{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Good coffee and decent food selection. No free WiFi, bathroom hidden behind a sliding door.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "The coffee and pastries are stellar and the staff is consistently friendly. Expect high price points (although similar prices to other 'third wave coffee' joints in NYC), but overall the service makes it worth the prices. Thumbs up!", "author": "Claire H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "This is a great place to grab a bite before work, or getting on the road.  I was early for an appointment and  thought I'd get one of their delicious ice matcha lattes with almond milk because about 3 people got them while I was waiting for my breakfast sandwich.  By the way the breakfast sandwiches are perfect.  I'll be back for the ice matcha latte, but I'm adding a little sugar in it next time.  Very friendly staff, and very clean establishment.", "author": "Alycia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This is probably my favorite cafe in Brooklyn. Great coffee, great bagels, beautiful little store", "author": "Tom F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Really wanted to like this place because of the name but I have to say that it was a disappointment. I think you should be able to judge a place by it's most simple item to reveal the true nature of the place and for a coffee shop it would be straight black coffee. I usually drink black coffee. I don't mind bitter, I don't mind dark, I don't mind strong. But this coffee tasted like paint thinner. Truly horrible. Actually left the shop and then came back in and tried to make it taste better with their assortment of add-ins such as sugar, cinnamon, honey, whatever but it was still pretty terrible. Maybe I need to try something fancy there to get the most bang for my buck?\n\nI also have to agree with other reviewers that the staff was apathetic verging on rude. I was waiting to the side looking at the menu (the only person waiting to order) and the server was basically tapping his foot waiting for me to decide. Not a friendly atmosphere. Wouldn't recommend going.", "author": "Savannah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Met a friend here for a meeting yesterday and was happy to make yet another awesome Brooklyn discovery. Ft. Greene is one my absolute favorite areas in Brooklyn, so whenever I come across a noteworthy establishment it's always a plus!\n\nMy friend selected this spot and we thought, being that it's a coffee shop, that it would be an environment where we could be productive. You can imagine my surprise when I walked in and saw a beer in front of him. Almost counter-intuitive like walking into a Starbuck's and smelling French-fries. Yes, not only does this coffee shop/bakery have beer on tap, they have HAPPY HOUR on Sunday! \n\nNeedless to say, I indulged so my friend would not be drinking alone. I ordered a Blue Moon and had one of their Oven Toasted Sandwiches which had chicken, fontina cheese, arugula, and pesto mayo. The sandwich was not spectacular but also was not horrible. It tasted what it looked like so there was no real \"wow\" factor. To be fair, I can safely say it was between decent and good.\n\nI was probably more wowed by the novelty of the space and the friendly staff. If this review was solely on food I would have given it a 3.75 stars. However, the quaintness, novelty, and energy of the place pushed it into the 4-star range. The only other challenge here is that there's not a whole lot of seating. \n\nOverall, will definitely be coming back and trying other items on the menu.", "author": "Yusuf W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "Good but kind of pricey and small.\n\n\"do you want that for here or to go?\"\n\n**me: looking around at the tiny yet adorable coffee shop with all seats filled and then out at the drizzling rain on the street.**\n\n\"I, ah, guess to go.\"\n\nI came for the Dough donuts which were good but I noticed the grease from my donut completely saturating the paper bag it was in as I walked.\n\nI had a large iced coffee to go with it and wish I had tried something called \"nitro iced\" (similar to nitro beer) they had.\n\nTotal for donut and coffee? $8 and change.  Much like the grease at the bottom of my bag, I felt like it was all too rich for my blood,  both literally and figuratively.\n\nIt's a cute shop though, service was very good and the donut was pretty tasty.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Another solid corner shop from the HG crew, with some solid Stumptown coffee and decent in-house cookies.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Trusty local standby for great coffee. It can get busy during the morning rush hours, but is much calmer at other times. Their breakfast sandwiches are delicious, if you are in the mood for that kind of thing. My only (sort of) gripe is that I wish they had slightly bigger table for placing drinks on after they are made by the barista. I get anxious that I will miss mine when it comes up or accidentally knock someone else's over. But otherwise, it's a very solid, contemporary coffee shop with a friendly vibe.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "Rating: 3.5\n\nThe cold brew I had this time is much more acidic and I tasted it right away. Not sure if I just noticed it this time and it's normally like this or it's only this morning. I know other reviews have mentioned it. Meh, a little too sour for me.", "author": "Xiuna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-01", "description": "Greedy Ghost is more like it.   I had a horrible experience here on Sunday.  $7.50 for an ice coffee and a cookie.  The food and drink were very good.  One star is for the crappy service:\n*  very negative attitude from the clerk behind the counter; she never said how much I owed - she just took money and handed some money back; a $4 ice coffee filled to 3/4 of the glass (if that much and mostly ice); no prices displayed on the cookies; the small sign describing the cookie was incorrect.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "This place gets a good rap B/c the name, but This place sucks. It's pricey the employees are rude. I work at Starbucks for the last 5 years so I kinda love coffee and with every great cup of coffee come with a smile and a thank you. If your gonna charge so much I would at least like to be treated like a person spending my money at your store. Never coming back!", "author": "Theodore H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Great cappuccino, delicious cafe au lait doughnut.", "author": "Kelli M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "A cute spot, but a tad overpriced. Also, it gets super cold every time the door opens because it's a pretty small, open place. Eh. The guy there is very nice though.", "author": "Krina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Love this place. Great name, coffee, service. Smells like heaven. Didn't try the food, but I wanna. Delicious drip coffee. Even have beer - eclectic selection of rotating local brews. Baristas are super-friendly, found out the whole history and raison d'être of the place while trying one of the brews. Chippy coffee house during the day, chill lil' bar at night. Definitely going back to try out more. You should too.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "It's very small, but the coffee can't be touched. Beer \u0026 wine for the evening crowd.", "author": "A.R. G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "(3.5 stars)\nThis is the tiny Hungry Ghost. This is the cafe where, if you are planning to meet a friend, you will likely discover there are no seats. This cafe has four tiny tables (one next to the bathroom!), a window with a weird chair (so seating for one), a communal table with five or six stools.  In short, there's not enough seating for the amount of foot traffic that comes in, so it's not a good place to meet anyone. It is, though, a perfectly good place to get a cookie (and their cookies are particularly tasty), or to get a tea, and the staff at this branch is, I think, friendlier than the other branch.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "Serves Stumptown Coffee and their pastries and goods are baked in house. \nI went first to the Hungry Ghost  at the corner of Flatbush and 6th Avenue, this new location Fulton is just as amazing!   I had an amazing caffe latte  to stay (they also do lovely Latte art). \ncheck it out if your in the area :)", "author": "Sandra R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "I love a good morning cup of coffee and decided to give this hungry ghost a try. Bad idea. This was honestly some of the worst coffee that I've had in a long time - completely over roasted and bitter. Undrinkable. It tasted like something that could have come from a bodega.\n\n2 stars only because their location on Flatbush is decent.", "author": "Jazmine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Artsy en good coffee!  Alex remembers our favorites.  They also have poetry and music there on Thursdays.  Place fills up quick.  Great community vibe.", "author": "Juliette S."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}