{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Best cappuccinos that we had in NYC, and really cool atmosphere and layout. They make most of their treats in-house which is a bonus. Highly recommended.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Im enjoying an amazing iced latte right now... Amazing! Madalines are just right too. Great environment!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "I like sweet drinks/coffee so I got a latte with a shot of vanilla and it was sooooo sweet and delicious!  I also had a cinnamon sugar Dough doughnut which was thick as hell but in a good hearty way", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Very cool Brooklyn coffee place to meet friends or clients. Great coffee and good sandwiches... well its a coffee place and I love coffee! Has a decent amount of seating so the only problem was the lack of electrical outlets!", "author": "Becky A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Happened upon this cute cafe yesterday, stopped inside to get out of the humidity. Ordered an iced tea and chicken fontina sandwich for myself, as well as a lemonade and bacon/ham/cheese egg sandwich for my boyfriend. I *loved* my meal, so delicious! The egg sandwich was surprisingly large, super tasty. Unfortunately, my boyfriend did not enjoy the lemonade, it was bottled (unlike the iced tea) and was some mix of apple and lemon juice (according to the label). Still, we would definitely come back if we're in Brooklyn again.", "author": "Pamela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Killer little coffee nook on the corner with awesome in house pastries. Love the no laptop policy on certain seating so people don't hog tables all day. Cappuccino and pastry were both top notch. They're also very fast. Highly recommended.", "author": "Thomas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "The jasmine kombucha was delicious, fresh, and reasonably priced. The yogurt parfait was super tasty (plain yogurt! Yay!), with plenty of fresh and tasty berries. Kept me going for the morning. All the breakfast breads looked amazing as well.", "author": "Juliana F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-30", "description": "I wanted a cup of water with my sandwich. The guy said I needed to pay for a plastic cup. He handed me a tiny glass tumbler and said, \"This is free and you can fill it up as many times as you want.\" Let me explain: the tumbler could hold about 2 sips' worth of liquid. I thought he was joking, but he was totally serious. The sandwich wasn't very good - they skimped on all the toppings. Skip this place", "author": "Panda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "Consistent, excellent morning coffee. Served by fast, friendly staff. Clean, efficient layout for moving customers through line and letting us put sugar or milk in our coffee without creating a logjam. Great place, and worth holding a punch card to get that free coffee every few weeks.", "author": "K R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-24", "description": "Slowest service on the planet! No one else to be served and my bagel with cream cheese took 15 minutes", "author": "Harry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "Good coffee, good pastries.\n\nDecor needs work.\nPutting my \"architect\" hat on for a moment, you really need to adjust the bench and table height, guys. Tables at the windows are too tall for the bench height - very hard to sit at and use the table, and I, at least, am tall! Also, double-pane windows should have been put in instead of those single pane ones (I didn't know single-pane existed any more) - this place is way too drafty and with condensation on all the windows.\n\nLastly, I am surprised that coffee shops exist, nowadays, that don't have wifi. Seriously? Couldn't spring for a $40/month internet connection? Your clientele would expect this.", "author": "Shane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Very nice place in a busy area.  The coffees are great and the baked goods are tasty.  We came a little late one night, close to closing and we were offered their baked goods, just to take home instead of them throwing it out.  I thought this was awesome and not wasteful!  Good staff, good location, very comfy and quaint in a busy busy area.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Delicious java fixes, alluring baked goods, clean space that is accommodating for doing work, hanging solo or catching up with friends. There is a little something for everyone here.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I love everything about Hungry Ghost.  There are plenty of places to get a good cup of coffee in Fort Greene, but I always go to Hungry Ghost.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Lots of interesting drinks and great donuts. Worth it for the donuts alone, though plenty of other appetizing things as well.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "I have had a few jobs in the neighborhood and stopped here before work. They have a nice ice coffee at a reasonable price. The marble tiles are beautiful and the bathroom is very clean. I wish it was located closer to where I live son could come here more often. But for those lucky enough to live near the Barclays center it's only a short walk", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "So, I love this little shop. The nicest people work here and their coffee is REALLY GOOD. Cold brew AND nitro on tap! Their espresso is on point. Their sandwiches are really good. HOWEVER the star of the show, to me, at least, is the baked goods. Damn, son. Those cookies, though. Unreal. Get the ginger cookie. Get the oatmeal chocolate chip thing they have sometimes. They even carry Dough doughnuts. My only complaint? Not enough outlets and no wifi. But no matter. Come here to read or study or people watch. It's worth it. :)", "author": "Cassie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "The pastries are really, really good--I had a sea salt brownie and a chocolate chip cookie, and wow!  They taste really homemade.  I wish they were a bit cheaper (is it me, or is 2.75 really excessive for a pretty small cookie?) but taste-wise, easily 5 stars.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "This place has become a meeting point for friends of mine before we go to brunch together. We'll stop in at Hungry Ghost for a coffee before, and sometimes even after going out to eat on Saturday and Sunday mornings. The baked goods are excellent! The coffee is pretty much what you'd expect. If you're lucky enough to get seating, the ambiance is really great. Very simple, understated, clean and comfortable. Nothing too fancy going on here, just good coffee and really delicious muffins, donuts, croissants, etc.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "This was our morning pit stop for our fix of daily coffee! The baristas were always friendly and on a couple of occasions we even stopped by for an early lunch and we even had evening bagel and latte one night. They have a huge range of doughnuts in the morning however they dwindle quickly! The oven roasted sandwiches were great with a good combination of toasted crunchy bread, meat filling and hot gooey cheese. The bathroom was spacious and always clean. I know this is a smaller sister store to the one on Flatbush however this one was right near our subway entry.", "author": "Joshua J."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}