{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "LOVE THIS PLACE. \n\nStaff is friendly\nCoffee is AMAZING \nLine can get long which is a pain when your in a rush. But I highly recommend trying any of the locations", "author": "Jacob P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-27", "description": "If you want any more proof that Brooklyn has jumped the shark, look no further than Hungry Ghost - a coffee shop manned by walking caricatures of what \"hip\" human beings resemble nowadays. \n\nCome pay $3.75 for a muffin that wouldn't feed a toddler or enjoy some very overpriced \"exotic\" coffee that 90% of people wouldn't be able to distinguish from your average bodega's offering. \n\nThis neighborhood was better off back when this was a tire shop. Once all the native establishments are replaced by stores that just price gouge for mediocre product in exchange for a naive, clown-like interpretation of what is cool, Brooklyn will be lost forever.", "author": "Eek N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-28", "description": "I stopped by here twice because I just love the coffee and lattes here. Its a pretty neat spot with great ambience for a relaxed vibe. It has ample seating and tables for you to get work done or just have casual talk with some friends. I definitely would come back just to do a little bit of studying while enjoying a great roast. \n\nI personally love any place that uses Stumptown coffee and does it right since its one of my favorite roasts so its no surprise that I love the coffee here. Its also a plus that they offer oat milk here as well which is one of my personal favorites to put in coffee. \n\nStaff here is quite friendly and will be sure to pay attention to your requests. From what I've seen, the food here is also good so next time I stop by I will give their breakfast options a try.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-04", "description": "Horrible attitude from the staff working at this location. I don't think the manager trains the staff well or at the very least have some simple basic customer service. Nasty nasty horrendous attitude. Been a customer for many years but this is the last straw. I'm done with the overpriced mediocre coffee with a huge dose of nasty attitude.", "author": "Jay J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "A perfect cappuccino, (4.50)our barista was pleasant and they have a loyalty card they stamp eventually you can get a cup for free! Conveniently next to Boqueria which we stopped for tapas but I wanted coffee from an actual cafe, relaxed atmosphere would return!", "author": "Diana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Nice little coffee place close to downtown Brooklyn. It's looks nice and there's seating inside as well as outside. I got an oat milk latte for about $5. It's priced about the same as any other coffee shop in the area. The latte was good. I'd definitely come back if I'm in the area!", "author": "Tina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-28", "description": "Coffee is dece, plenty of seating but has also always been crowded when I've gone. Nice enough staff but pretty expensive for what you're getting. Prices aren't listed for everything so I've been unpleasantly surprised more than once.", "author": "Sira K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Excellent espresso drinks for reasonable prices, 75c extra for soy/almond/oat milk. Gender neutral restroom. Great place to sit outside in the summer and watch the world go by. Sandwiches and pastries galore, with enough to keep vegetarians satisfied.", "author": "Suri M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "I like this coffee shop because they have nice wooden benches lining the outside of the shop that are the perfect place to sip coffee and people watch along Fulton Street. The location is also excellent, there aren't alot of other higher end coffee shops nearby. That being said, it's definitely on the pricey side and you'll probably end up paying more than $4.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Cheddar chive jalapeño biscuits! Definitely looking up some recipes to try to recreate that. Nice treat on this gross and rainy Sunday. Coffee is always fresh and delicious.", "author": "Annie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Team is the best! Helped make my life so easy for an event I was organizing - responded immediately to my inquiry, offered to deliver pot of coffee to my building, brought all the coffee accessories I hadn't even thought of - even thought of the almond milk - and picked-up after it was over. Thank you Hungry Ghost \nIn terms of food/drink, the cold brew and chocolate chip cookie are fantastic", "author": "G D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "Great vibe, somewhat sparse but at the same time cosy! The coffee is delicious; I had a cookie but they also serve other food (including breakfast). It's the sort of place to come and read a book or be a typical brooklynite and write your novel. I'll be returning here if I come out this way again.", "author": "M.M. K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-16", "description": "Prime location. Very nice and comfy decor. I had a blueberry muffin with a hot chai latte. Very underwhelming... the muffin was dry, left me wishing I had ordered something elsewhere. I stayed to do some work - stars are for the atmosphere!", "author": "Aaron P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "I come here for breakfast sometimes, I said sometimes because it can be a tad bit pricey for me. The decaf americano is very good but my favorite thing to get is the cardomon bread ( from Ovenly) and the egg and cheese sandwich on a french roll. The cardomon bread is moist, has the right amount of sweet and has this crunch on top and that reminds of the 7 up cake my mom used to make back in the day. The egg tastes like how eggs used to taste with a little salt and pepper;  the cheese tastes like gourmet cheddar, the bread is super fresh. \n\nMohammed and other guy he works with (the guy who works in the mornings with the long braids, I didn't catch his name, thus the description), is very nice.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-07", "description": "The coffee is still good but I still feel like the staff hates me for existing. The drinks remain overpriced by about 50 cents.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Hungry Ghost:\nExcellent place, great coffee, awesome pastry, supper team. The best coffee shop in the neighborhood!", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Lattes are always great, hot chocolate is amazing as week. Service has always been exceptional every time I've been here. Music gives a nice vibe. Perfect for a coffee date. They have indoor and outdoor seating.", "author": "Donna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "I live in manhattan, but stumbled upon this gem of a coffee store! Not only is the staff incredible friendly, the vibe is electric. My cappuccino with an extra shot was DELICIOUS and the perfect temperature! I would highly recommend popping in here for a coffee, a chat with a friend or to escape the world for a minute. Will be back soon!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Awesome coffee shop with AWESOMER AC! \n\nPerfect for a mid summer day drink. They have nitro brew coffee on tap. They even have kombucha on tap!!! I need to get one of those in my future house.\n\nGreat coffee and great vibes!", "author": "John T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "One star for the worst service on a Saturday. No words and smiles at all from the lady who works here today. I'll give her the benefit of doubt, maybe she is having a really bad day.", "author": "Monica R."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}