{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "Good coffee, but they sometimes run out of simple things like lids. Also very expensive.", "author": "Gertrude S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Nice little much needed coffee spot. The coffee is great and the food is delicious. They have dough doughnuts. Plus. Baristas are warm, friendly and professional. Place is always clean. \n\nNot a good place to work, study as there is limited cramped seating. Place gets crowded fast because its so tiny. No worries, take your coffee to go. Its worth it.", "author": "Theodis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Cozy little cafe with ample wooden bench seating outside. Their Stumptown coffee is very good and their super rich choc chip and peanut butter cookies are the bomb! Even had beer and wine here on a rainy Saturday night (only $13 for both). Cashier/baristas are very friendly.", "author": "Angela K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "The lattes here taste good, but the service is poor. Every time I walk in, I'm polite, I order easy drinks,  I tip, and yet feel like I've somehow affended the barista each time.  Which has been dozens of times. Sadly, I don't think l'll be going back any longer.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I stopped here for a time-out on a hot Saturday and sipped a glass of rosé and grabbed some espresso on ice. A great spot with great product and great atmosphere. I could've hung out at their sidewalk seating all day.", "author": "Laurie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-14", "description": "If you're looking for Stumptown coffee, this is a solid coffee shop that has it. However, limited seating, pretty standard/limited food and slightly more expensive coffee than other similar quality shops nearby make Hungry Ghost skippable.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Great place, great atmosphere. Lots of places to sit and enjoy a coffee and surf the web if you need too. \n\nThey serve Stumptown Coffee which I love. I usually get the iced mochas which is refreshing on the hot summer days. \n\nStop here for your cup of joe and enjoy the relaxing atmosphere.", "author": "Angela P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Such a weird corner. I think they make the coffee $1+ more expensive than Starbucks to make up for the laptops. \n\nHave bought: reg. coffee, macchiato, ginger molasses cookie (I'll fork out the cash...)", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "I'm not a huge coffee drinker, but their coffee is made really well that I even like them!  Their mochas are amazing (yes I like to disguise my coffee with chocolate). Their cookies are moist and gooey, and baked in house. They serve Dough donuts which is amazingly dangerous considering I work next door....\n\nThe environment is nice, although I wish it was a tad cozier - I'm sure it'll feel much better when it's not freezing outside. I think the big windows and open space made it drafty, but I do like the vibe.", "author": "Zanna W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-02", "description": "I really want to support this local business, but the service is slow as molasses, the products way over-priced for what they are, and there are other picks in the neighborhood steps away. And they don't seem to care or notice.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-06", "description": "No star for the attitude from the same young girl EVERY TIME. Two stars for everyone else and good pastries and coffee.", "author": "Keyla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Nothing fancy, just an awesome coffee spot with some nice sweets. Also serves beer. How cool! Handful of seats. Was packed when I was there on a Saturday afternoon, but stick around and you'll probably get a table or stools.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Decent coffee,  drinks and snacks. My only beef with this place,  and it seems insignificant but,  no benches outside.  And they have plenty of room for it.  A lot of times you just wanna chill outside. Also there is no Wi-Fi for some reason.\n\nEDIT:\nThey put benches outside. Nice job", "author": "Dante J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Of the few times I've been here, I've noticed that it's pretty hard to find a seat, but that's probably because it's a great place to be. The coffee is good - I had a Red Eye - and the shop is cute.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Awesome go-to cafe. I stop by certain mornings to get my casual latte, the employees are also VERY friendly!!", "author": "Jose P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "I've stopped by here a couple times since it's right around the corner from my apartment. I had a capuccino and an americano, both yummy. Also, I had their multigrain croissant, which was really good! I keep eyeing those donuts...\n\nIt's definitely overpriced and a little hipster/snooty for me, but I'll take it since it's good and convenient. Unfortunately, there's no wifi so when I'm looking for a change of scenery to get some work done, I have to pass this one up for another cafe.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "really great coffee. love the morning glory muffin.\nthe music is a nice jazz to wake up to. when I'm in Brooklyn this is where I will be.", "author": "Cyndie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "I love this little coffee shop! They have stumptown cold brew on tap, and it's all I've ever wanted. Pastry selection is great from what I've tasted, and gotta love a fresh DOUGH donut. However, I just gotta comment on the straws! An easy fix, but they're kind of on the softer side so the lid of the iced coffee sort of crushes the straw. Straight clear straws would be best. Overall amazing, even despite the straws - but quick fix on that. :)", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "First time here. We just moved to the neighborhood and we're looking for our new favorite coffee spot. While the staff that meaning wasn't particularly friendly (not friendly not unfriendly), my chai tea latte was delicious. I will return soon to try some of the sandwiches they offer.", "author": "Regis W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Morgan's barista skillz are off-the-chain; she's pretty much the Frida Kahlo of espresso beverages. You wanna fight about it?", "author": "Sam F."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}