{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-07", "description": "Bland and weak coffee. Don't come here if ur looking for a quick caffeine boost because u won't get it here. Service was good and that's about all.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Lovely coffee shop with cozy interior. Delicious looking pastries, good coffee, and sufficient seating. \n\nMinus one star because their sandwiches aren't made in house, yet they take a bit too long to prepare (reheat). \n\nThat said, it's a lovely spot to sit and chat with a friend, read a book, or do some work (though no wifi).", "author": "Willa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Coffee is great.  Staff is friendly and very helpful.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-23", "description": "Hi. Here I am, in front of the counter, waiting. Trying to order something, while you're just ignoring me. This place has rude, or rather, indifferent people serving your incredibly overpriced coffee and pasteries. I am still Hungry, so I'll make like a ghost and disappear.", "author": "Rosetta S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "Great clean atmosphere I must say very nice looking pastries yum, the iced cold brew wasn't the best tasting coffee  I was a little shocked I even wanted to return it but felt bad", "author": "Keke C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Omg this coffee is so good. Its so good. If you like dark roasty coffee, come here. \nITS SO GOOD", "author": "Annie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "The vibe here is very relaxed and invites you to sit and spend time inside, or, enjoy your beverage on the go. They serve Stumptown coffee here, one of my favorites, in addition to a variety of specialty teas, handmade Italian sodas and even Kombucha on tap. They also have a lunch menu and some pretty amazing looking baked goods (which I definitely need to try next time).\n\nI got a cappuccino, one of my favorite coffee drinks, complete with it's little Florette.", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Very good iced tea! Simple yet edgy/elegant decor and continently located off the C/G train and numerous buses. And they have donuts from Dough!", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "I came here from the Bay Area looking for a cute and cozy coffee shop to do some doodling. A friend recommended this spot to me and I can see why. The service was really friendly and the brew was perfect for a cloudy day. Not to mention the natural lighting was good for any artist to come in for a sketch break.", "author": "Breena N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "Have been coming here since they opened. Service started great and now is lazy. The hot sandwiches every time I come aren't available due to a broke oven. I ordered a cold sandwich instead, more bread than anything else. Portions are off. I ordered a glass of wine, @$10 dollars and it wasn't even a quarter full. A lot to be desired. Maybe they will go back to actually satisfying customers with great food whether it be hold or cold and good services", "author": "Matthes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Fantastic, properly done cappuccino. The people who work here are very friendly and it's a lovely spot to grab a coffee before walking around Fort Green. They also sell Dough donuts, which is always a good thing.", "author": "Jen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Good cold brew, beautiful floors, awkward staff (but, hey, I'd gone through a 23-year old angst-ridden developmental stage too, so let me actively practice some compassion and understanding).  Very little seating on a typical weekday afternoon.", "author": "Anya A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-22", "description": "Lame place serving lame, lukewarm coffee (and Stumptown is about a craft made as fucking Starbucks at this point.  Peets Coffee owns them), lame barristas can't be bothered to listen well enough to make an order correct.  Total waste of time and money.", "author": "Brianne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "My favorite coffee place in New York! It's just perfect in terms of taste. My fiancé is very picky about cappuccinos but loved this one! And their almond lattes are perfect! I don't have to add anything. They have three locations and all are cute and nice people and fast as possible though they can get a little busy.", "author": "Alyssa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Dropped in for some to-go, but wound up sitting for a minute and soaking up the space.  \n\nSimple and somewhat fancy, clean and quiet.  The bathroom was easy to find and didn't require a key or code or secret password.  \n\nAlmond cortado was exceptional.  Not sure when baristas started steaming almond milk so well but it's much appreciated.  \n\nThey serve Stumptown Coffee but not at Stumptown prices - the same drink is $3.50 there.  Just sayin.  And, IMO, the cafe didn't vibe with the surroundings. I'd like to go to a spot that reflects the neighborhood's lived-in vibe instead of crisp whiteness.  Maybe some local art on the walls could make it seem like more of a part of the community.", "author": "Alanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Great cafe. Super clean and sleek. They have amazing iced teas. However, there is no internet!", "author": "Monica Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "They charge extra for things but don't list on price list. This is against city law and prob BBB regs", "author": "M H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "One of my favorite coffee shops ever. For some reason their espresso makes my favorite lattes. Great bakery items (the chocolate and apricot croissants are amazing and flakey!) including Dough donuts. Solid breakfast sandwich and yogurt parfait. Just started serving wine and beer including shiner bock. \n\nOne negative: it's tiny! Hard to grab a spot to work there if that's your goal.", "author": "Maura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "We stopped by this coffee shop for a pre-Nets game snack. Great little shop - husband LOVED their Stumptown coffee and my hot cocoa was perfect. They had soy milk so that was a plus too. Super clean, good cozy seating, awesome floor tile, and really nice bathroom. \n\nIf in the area again, will be sure to stop by here!", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Great cafe with very cool decor. We were there 30 min before closing and they weren't making decaf coffee drinks so I was bummed but tea was good instead. Chocolate chip walnut cookie was generous but a bit stale at the end of the day. Maybe too dry all around.", "author": "Deborah G."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}