{"aggregateRating": {"reviewCount": 151, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "Love this place! Great coffee, great food and a very friendly staff. It has a great energy and they play some pretty good music.  If you're looking for a cozy place to grab a cup of coffee, a sandwich or a freshly baked pastry, this is the place to go. I had the chili when I went and it was delicious - if they have it I definitely recommend it. The quality of the Stumptown Coffee and service at the Hungry Ghost far exceeds any of the coffee shops in the area.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Fantastic lattes, great music soundtrack, solid pastry selection (the donuts are to die for!) and super friendly service. The Hungry Ghost is my go-to coffee shop, whether it's for a sit down or \"on the go\" caffeine fix.", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Good coffee. Scone was great tasting, muffin filling was great (raspberry and ginger) but the actual dough was a bit bland.", "author": "Monica Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Great Stumptown coffee. Super friendly service. Great spot to meet new people and build community.", "author": "Austin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "I love stumptown coffee, and this place has a wonderful atmosphere. I usually go there in the evening when it's not very busy, so it's always been perfect for writing or meeting with friends. Also, Jon is the friendliest barista in Brooklyn!", "author": "Kelsey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "The coffee is good and the vibe relax (perfect to read or study) but every pastry I've had there was really forgettable. How can one make a muffin so bland?", "author": "Clara F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "I am a fan of the Stumptown coffee/ espresso drinks and the pastries here, and given that this Hungry Ghost location is closer to me than the one on Flatbush, I am giving it 4 stars.  I agree with other comments that this location doesn't have sufficient seating (they could easily add about 2-3 more chairs), doesn't have outlets/wifi, and so it's not ideal for camping out to do work.  You can get the lounge feel and bad coffee down the street at Outpost.  Another thing to know is that the service is slow. They take orders quickly, but the one barista behind the machine can't keep up, so if you drop by on your way to work, be prepared to wait 7-10 minutes.  I actually like the clean, bright decor of the place, especially the black/white floor tiles. I also appreciate the water spout they offer and think that by using glass instead of plastic, they are being environmentally conscious.  I hope they will offer sidewalk seating this spring/summer.", "author": "Adria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "I really liked Hungry Ghost. I thought it had super great, a more inviting and kind vibe than other coffee shops on the block I had been. They played great music. The only thing I did not like about it was that I was given a \"to-go\" cup despite saying \"for here.\"", "author": "Caroline T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "I ordered a latte to go. After tasting coffee from Ninth Street Espresso, i have to say Hungry Ghost is not quite up to par. For one, i was disappointed that the coffee was lukewarm. I'm not very particular about the temp of my coffee, but this really took the pleasure out of the whole experience. And then the taste was just mediocre, it's not something I would go out of my way to buy. For $4 a cup and a quirky name like Hungry Ghost, I was really expecting something much better.", "author": "M T."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Hungry Ghost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "781 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ztl2WDbzjjDSQ1b4F5hPtA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973595"}