{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Now down to 3 stars, like with everyone else's review here.  So what changed?\n\n1) $5.50 is the same as most other average delis charge for a hero in the area.  In fact, at one deli on Fulton Street, they gave you a free can of soda with your sandwich purchase.\n\n2) The last couple of times I went, they definitely gave less meat in their sandwiches than I remembered before.  Either that, or I became used to eating a bigger sandwich.  Probably the latter.  In any case, it's still a decent deal compared with the deal you get at the Subway across the street.\n\n3) I discovered a better deli - do yourself a favor and go to the Side Street Deli in Brooklyn Heights.  It's about a 5-10 minute walk from this deli, but it's well worth it.  Many of the lunch special heroes are around the same price, and they give you a small bag of chips free with the purchase.  In addition, they make their roast beef and chicken cutlets fresh.  As good as Boars Head roast beef is, freshly-made roast beef is simply better.  Plus, the owners there are friendlier (though to be fair, the owners here are friendly, but they're mostly rather indifferent because they deal with too many assholes on a daily basis).\n\nThat's not to say this deli is bad.  The Reuben Sandwich is still a good deal, especially if you ask them to make you a Reuben Hero instead (only $5.50).  And the cook here is at least somewhat talented - his Western Omelet is quite tasty compared with the bland Western I ate from the recently-shuttered Evergreen Deli (the only plus was that they sold 50 cent bags of white cheddar popcorn).  \n\nBut there's a reason why I use this as my default \"I won't have time to go out to buy lunch, so I'm buying a cold sandwich as I leave the subway station on my way to work\" deli.", "author": "DC C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "This deli is garbage in there first thing in morning to last thing I need to be dealing with in this dirty deli is getting harassed from behind the counter to close the fridge while looking for a drink... terrible customer service experience place is disgusting", "author": "Marc E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Instead of a review, I'll make a statement. Don't come here unless you want a guy who was visibly just picking his nose to offer to make your sandwich, while the actual guy who makes the sandwiches is on the phone having a personal conversation. Also, the sign over this deli reads \"Jay Streets Finest Deli.\"", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "Average to slightly more expensive side. Stocks of food do appear disorganized.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I love the place I've been going there for the past 10 years, Sam makes the best sandwiches. They have great prices too.", "author": "Jos L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-17", "description": "An average deli.  I can tell the man behind the counter gets a lot of crap from their usual customers as he was really curt with everyone.  My bacon egg whites/ cheese on whole wheat was exactly as I ordered it and my coffee was not half bad.  For 4 bucks, you can't expect much else.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-04", "description": "Like most things in downtown Brooklyn, what you find is generally \"meh\" or decent. The Jay Street Deli is no exception. I came in here for, what else, a turkey sandwich. And what I got? A turkey sandwich and watching some dude make a complete ass out of himself while I waited for my sandwich to be made (I love that!).\n\nThe sandwich? Bread was a little chewy, turkey and cheese were fine, and the guy needs to learn how to cut a sandwich all the way through. But decent nevertheless.\n\nCost? $4.50.\n\nThe self-imposed ass? Came in accusing the counter man of short-changing him. Proceeded to count the change that was in his pocket after they agreed to what the price of his items were. Found out that the counter man had actually given him the correct change. The ass's response? \"Oh.\"\n\nCost? Priceless.", "author": "Shea D."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Jay Street Finest Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "408 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/U1KR5BRjtzHt5n7baPKgKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880967"}