{"aggregateRating": {"reviewCount": 43, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Well, it's definitely no California tacos! I ordered the Al Pastor Taco and the Carne Asada Taco thinking that I would have a taste of home, but boy was I wrong! Although the portioning was fair, I was heavily disappointed with the overall taste. Both the meats were very dry and were overpowered by the other ingredients in the tacos--you pretty much can't distinguish which kind of meat is in it. For these reasons stated above, these tacos are not worth the prices they charge. Just getting 3 tacos alone can add up to around $14. This dining hall offers many more options therefore, I will be taking my appetite somewhere else.", "author": "Tabitha K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Overpriced, small, dry, and very messy.   \n\nThe ordering process was fast, and the menu straightforward.  The food was prepared fresh and almost immediately after ordering.  All the staff there had trouble saying customers' names.  So it can be confusing for the customers listening for their name.\n\nThe meat was dry, but was drenched in sauce which made it very messy to eat.  I had 4 tacos and they were all snack size for $17+ after tax, I'd expect bigger portions or to be a bit more full.  \n\nThis place was disappointing and I won't be coming back here.", "author": "Stephen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Went for lunch....pretty crowded...got the vegetarian burrito bowl and a fish taco. DELICIOUS!!! Wayyyyy better and more authentic than chipotle...\nFresh, quality ingredients...homemade salsa and sauces....fish was sooooo fresh ...for one taco day it was filling! Good service but definitely allow time for the lunch crowd they are a little slow with a rush of orders. Def will return the next time I'm in Brooklyn...def worth a trip...maybe the reviews will go up as more people try it out!", "author": "C. S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "I'm so angry about my food from lunch today at DeKalb Taco. First I have to say the guy working there was super nice and this has nothing to do with the customer service. I ordered a Baja Fish quesadilla. It came as a disgusting sloppy, soggy blob of cheese. It was basically bread and cheese that tasted fishy. I posted a photo here below, does this look like something anyone wants to eat? No.\n\n I ate a few bites because I was starving and I felt sick after and still feel grossed out by it. I'm so disappointed because I love DeKalb market hall but I will not go to this taco stand again. What a waste of $11 for a pile of cheese!", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "Are all the workers here stoned?! I swear the ladies assembling my tacos were moving in slow motion. \n\nTacos were also pretty meh (esp carne asada), would find another place to waste your time.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "We lurve ourselves some Dekalb Market Hall. Came here after running some errands at Target to eat and decided to get the tacos since we hadn't tried them yet. \n\nWe each got three tacos - I got the Smoky Pork Belly, Baja Fish, and Smoky Crab tacos. My boyfriend got the Carne Asada, Barbacoa Lamb, and Al Pastor tacos. We split a side of salsa rojo and salsa verde. We loved that each taco came with it's own different toppings, rather than just using the same stuff for everything. They all had different sauces and veg. \n\nHere's a breakdown of the proteins:\n- Pork belly: it was amaaaaazing. Some pieces were more tender than others but they had chopped it all up in perfect lil bite size pieces. The smokey aftertaste was crazy good. It wasn't a punch the face kind of smoke, but this slow, creeping smoke that lingered on your taste buds after you finished your bite of food. Really delicate and really perfect.\n- Baja fish: this taco was probably my favorite! Super tasty. It had a crispy but not oily batter. It wasn't too heavy. And I was looooving the sauce they used! It was also a super nice portion of fish, not just some overly battered lil sliver.\n- Crab: the smoked crab taco actually comes out cold, which I didn't expect. (I guess I donno what I expected!) I'm not a huge fan of cold foods, but it was still good. My boyfriend REALLY liked this one, too. The smokiness was even less punchy than the pork belly but that was a smart move because crab flavor isn't as strong as pork. The crab kind of reminded me of a mayo-less or low-mayo \"tuna salad\" consistency. It was shredded in that same way.\n- Lamb: this thing was THE BOMB DOT COM. The lamb barbacoa was SUPER tender and really juicy. The sauce was really flavorful and punchy and melded really well with the lamb flavor. You could tell it was lamb, but it wasn't overly gamey or anything. I'd definitely order this next time!\n- Al Pastor: this was really tasty but it was a bit dry. You could see right behind the cashier that it was made using the rotisserie, which is kind of near impossible to find in Brooklyn (or at least, as far as I've been able to find?). \n- Carne Asada: this one was just okay. I didn't have any but my boyfriend said it was fine but not something he'd order again necessarily.\n\nAll of the tacos came on fresh corn tortillas that were really amazing. Not dry or thick but also not too thin where they'd break apart. Perfect texture! The toppings were all unique and intentional and purposeful depending on the protein. The salsas were also good, and it was nice to use on the tacos here and there. The chips, though, were really hard.\n\nAlso, we didn't have a wait problem like most of the other reviewers... It must've been when we went but we got our food in a timely fashion. It's not cheap but it's Brooklyn. In the context of Dekalb Market Hall, it's actually on point, price-wise.", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Dekalb taco is just average. They arent bad but for the highly competitive and super tasty Dekalb Market their closer to the bottom of the barrel. Sadly, theyre the only Mexican taco offering in the food hall so hopefully they step up to the plate. I would start by adding fresh onion and cilantro to their tacos. I really missed the traditional accoutrements. The meat filling was ok but my lamb was on the dry side. Staff was friendly tho!", "author": "Charles K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Good salsa, but the rest of the burrito bowl left a lot to be desired. The portion was very small, with only about a tablespoon of black beans and a few kernels of corn. Not a filling vegetarian meal. There was also no guacamole, as listed on the menu, instead there was what might be considered an avocado salsa... a thin, watery green substance unlike guacamole in every regard but color. \n\nAlso this food court is insane. From where I'm siting right now I can hear at least 3 different songs playing at once. Not a good atmosphere for hanging out.", "author": "Kate K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "A better more amazing version of chipotle. I got the burrito bowl and went back the next day for a second. I'm from California so my expectations of Latin food are high, and this place nailed it!", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "My daughter wanted a cheese quesadilla and they delivered! $6 later (which is fair for the city) we had a large quesadilla with two types of cheese oozing out!  It was good.  They could have gone a little lighter on the cheese but overall you get what you pay for here and I would love to try other food here.  (Another vendor said they put egg in their burrito's and its delicious.)", "author": "Holly W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-21", "description": "I have gone here a few times and the food is pretty good. As others have mentioned they are very slow. The reason for the two stars is the bogus pricing. \n\nA two taco box is 7 bucks. Three tacos is 11 bucks. They charge 75 cents extra for the premium meats. Individually the tacos start at 3.75...so you are charged more if you order the three taco box than if you order individually. I mentioned this to the cashier after I had paid. He said he will tell someone. If they change it I'll update my rating appropriately.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-21", "description": "The food here is good, but wow, this place is way too expensive. I've been here a few times, but I think I'm done with them because I can't seem to justify $14 for a meat burrito bowl, $10 with no meat. I could go two blocks away to that franchise and get twice the portion for even less. I hope they reconsider their pricing, there's too much competition for them to keep these prices.", "author": "Estela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-15", "description": "$13 for a bowl of rice with an egg on it. So few black beans and other stuff it's like they're mocking you. 2 stars bc the rice itself is pretty good.", "author": "Mat M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "We waited for 20 minutes for one taco. We also paid 10 dollars for a spoonful of guacamole. Do not recommend.", "author": "Mary l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "Tacos are okay but like the other reviews said, they take FOREVER. Skip this and go to Los Tacos #1 in Chelsea Market.", "author": "William P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place is so good!!! I walked around Dekalb's to figure out what I should get and decided on tacos. My friend and I split a box of 3 tacos, and we were in love with the pork belly one (HIGHLY RECOMMEND!!). Also, for someone who is very picky, I knew I didn't like half of the ingredients they added on top, but it was still amazing altogether!", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-20", "description": "Decent tacos but a total sh*tshow on service.  Unorganized, took FORever, and very un-helpful folks working there.    \n\nAlso the first time I ordered there the tacos were super crispy and awesome, the second time they weren't.  \n\nI know it's new and they're working through the services, but get it together!", "author": "Jules M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "Not a terrible spot but expensive. I ordered the quesadilla with crab meat. It was a weird mixture for taste. And not as satisfying as I hoped it would be for a $12 quesadilla", "author": "Calvin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "Usually love this place...not today. Ordered multiple burrito bowls and they were 1/4 full. Why would I pay around $9 for a burrito bowl with barely anything in it?! Extremely dissapointed.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Awesome tacos!!  you have to try the smoked brisket and carne asada .\n\nThe charred salsas are outstanding !!", "author": "Theo P."}], "servesCuisine": "Tacos", "priceRange": "$11-30", "name": "Dekalb Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1M6c5jnYI2Uj8hWBKizwCw/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}