{"aggregateRating": {"reviewCount": 43, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "Dekalb Market Hall is a place I like to take friends and family that are visiting from out of town. What I've come to realize is that while there are tons of options in the hall...to folks not used to the offerings, a lot of them can seem intimidatingly ethnic, and the menus daunting.\n\nAnd so I'm glad that Dekalb Taco is here. \n\nThere's a certain segment of the population that will walk around and see the baos, the jianbings, the udon, the arepas, the kebabs, the paella...and they'll be overwhelmed, paralyzed by all the exotic choices. And they'll come back to this stand for something that's familiar: a good ol' chicken quesadilla. \n\nLuckily, Dekalb Taco makes a solid one. One I'm not sad about splitting with a friend to stave off hunger while I convince them to try something less recognizable afterward.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Surprised about the negative reviews here! I had an amazing experience for lunch here today. I was met with a smiling lady (Diana, I think her name was) who gave me her favorite quesadilla that did not disappoint. Crispy and delicious flavor-forward spice on the juicy chicken and some nice instagram worthy cheese pulls. They serve it with a gaucamole salsa that gave just the right amount of acidity to keep you coming back. \n\nI also ordered their most popular taco - pork belly. I almost died and went to pig heaven. The nixtamal tortilla was the perfect little bed for the smoky pork belly. The diced white onions and cilantro were great traditional toppings -- no pico de gallo here! \n\nI finished up with a burrito bowl that was so filling I had to take the rest for dinner. GREAT value. I ordered the tilapia which was seasoned to perfection with gaujillo chile sauce and cooked to where it was very moist and seared on all sides. I had to slow clap in front of their stand for a good 10 minutes. Searing fish on ALL sides is a labor of love. The cilantro rice was a tad overcooked but was great when I mixed in the corn, beans and tomatoes. A lot of interesting textures and flavors. Don't listen to these negative reviews. Come see for yourself.", "author": "David O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-25", "description": "Picked up the All Day Breakfast taco (Chorizo, egg) and Baja Fish taco, so I can't speak for the rest of the menu but HIGHLY recommend the fish taco. The battering is light and the way they fried the fish is incredible, crisp, and leaves a great mouthfeel (lol). Definitely one of my favorite things to eat in Dekalb.\nThe All Day Breakfast taco gets a pass from me. The pictures on Yelp list it as containing bacon, but when I went this weekend, they had chorizo. Small bits of chorizo that had very little flavor to it. The taco tasted mostly of eggs.\n\nPrices are a tad high for tacos in the city, but that's a common theme in Dekalb. Come with wallets prepared.\nService was good and quick. This place was popping when I was there, so they must be doing something right despite the low rating.", "author": "Pearl K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-09", "description": "Like many of the other reviews, I was really disappointed with Dekalb Taco. For starters, they are way overpriced for the portion size you receive. I decided to go with the shrimp quesadilla. When I received my food, I was baffled at the size. I left still hungry and wanting more. \n\nThe quesadilla itself tasted okay. The ingredients were fresh, but nothing that would keep me going back for more.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "What's with the poor reviews of this place? I'll admit this is my first time here, but these tacos are incredible! This is downtown Brooklyn, not Oaxaca - the prices are totally fair!", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Like much of Dekalb Market, the prices seem high, but the current 3-star rating is absurd so I figured I have a civic responsibility to vote.\n\nI believe that on my first visit I got the lamb, breakfast, al pastor and huitlacoche tacos. I went with a co-worker and was probably focusing on a work rant than the food. Tonight I got the breakfast, al pastor and huitlacoche again but consumed them more deliberately. The breakfast one was probably my favorite but the al pastor was skillful in its pineapple strategy. \n\nYes, you can find places with lower-priced tacos, but Dekalb Taco packs in plenty of notable flavors and textures.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "I agree with one of the current high reviewer. What's with the low a\u0026\u0026 reviews!!! Every time I get food from here I'm satisfied. I even had a special lunch dish, which was basically a burger quesadilla. It was so good when I cam back and asked for it was only for that day. Damn they need to bring that back special more often. It was so juicy that I had to watch out for my clothes. The meat juices were coming out of the seams. \n\nNow when I first cam here so was like where is the variety , but after Dekalb Taco got their grove of items to sell that concern was no longer for me. I can get bowls breakfast items and the meat options expanded a bit as well. I could also take a gamble and try their special. Of course I'm asking the staff their opinion and appreciate their honesty. Only one time I took the gamble on the the special and glad I did. \n\nAlso most of the places in Dekalb Market are overpriced for the portions they give you. Honestly after trying several places only a few places make the middle class budget. This place is one of them. You get a decent size portion for what you're paying for. Basically the most bang for your buck theory. Now to follow this theory, stick to the bowls of your hungry! Otherwise if this is a pay day meal caution yourself because you may get full if you get 2 separate items. \n\nBecause Dekalb Market has various of places to choose from I would get Dekalb Taco if I'm in the food for Mexican food. Sorry Dekalb Taco! I felt like I was cheating on you, but I love trying new things (hehe). Also I'm getting Dekalb Taco because again they have the most bang for your buck!", "author": "Diane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "$5 for a single, small taco is pretty steep. Granted, the taco was tasty but all it did was open up my appetite! There are some specials of 2 for $7 during a certain time so I guess that's a plus.", "author": "Keturah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Um.. what the HELL are with these low reviews??\n\nI was in the market last weekend (How awesome is DeKalb Market) and I noticed Dekalb Taco. Looking at the menu choices, pork belly tacos, chorizo tacos, al pastor tacos and even lamb tacos?? (Arnold voice) I'll be back.. \n\nSaturday afternoon, my wife \u0026 I stood on line and waited. Don't think you're going to zip in and zap out like Taco Bell. These are artisan tacos, it takes time to prep them. We each ordered the special peanut-shrimp tacos, I ordered the pork belly and my wife ordered the baha fish tacos. Wowza! You could say tacos are a slap together dish but these folks took each ingredient and elevated to a chef'd up level. It was a serious taco.\n\nI also noticed they offered nachos on the menu. At first I was thinking nachos that would be covered in fake cheese whiz and jarred jalapeños. Then I started to see the different toppings like crab. Wait a second, crab?? I'm down for something funky, we ordered that as well.\n\nThe crab was smoked which brought the nachos def com krazy good. The cheese was light and the chips were freshly made. Another yummy dish made right by Dekalb Taco.\n\nTotal fan, be prepared to wait for some bangin' tacos.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "We visited here on a Date Night before we caught our movie in the movie theater upstairs.  After going through the variety of the options laid out on their menu, we settled on a shrimp taco, chicken taco, and pork taco.  Their process was straight forward as far as one person takes your order, another prepares it and another calls it out once its completed.  As you order the cashier ensures if you want all or none of the fixings then instructs you to wait until your order is called.  When I tell you I almost lost my breath at the size of these tacos.  The 3 tacos looked like they were appetizers.  First of all, given the portion size, I am already tight that I have to share.  Then I'm wondering, \"Am I not drunk enough to be satisfied with these kids meal tacos?\"\n\nLong story short a return visit will be slim.  The portion sizes did not equate to the price.  The flavors were okay, however I was a bit caught off guard when the shrimp tacos were cold due to some sauce that they put on top.", "author": "Elethia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-24", "description": "The people are quite kind and the ingredients are fresh.\n\nThe burrito bowl involved three huge heaps of rice and a soaring amount of all the other components. I felt like I had paid for a plate of rice with a sprinkle of beans and a dash of chicken. I like big loaded burrito bowls with ample amounts of each ingredient, so for me this bowl was a bit of a disappointment.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-17", "description": "Just not worth the price. A burrito bowl is $15, almost twice the price of chipotle, and for that price you'd expect to at least get a decent amount of food or a bit of flexibility. I asked for no beans but extra sour cream, and they wanted to charge me $1 for a tiny squirt of sour cream. The flavor is decent but the price is a ripoff especially when they can't accommodate small additions.", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "Waited forever for my lunch. I only ordered a steak quesadilla. And it took over half an hour or so for it to be made (my lunch hour was nearly up). \n\nThe steak isn't bad. There was a lot of juice pooling on the bottom. The quesadilla was pretty good. The only downside was that it was really small. I ate the whole thing and was still super hungry. I didn't want to spend any more though because I paid like $12-13 for this. Don't think I'll be coming back. Maybe when I'm reeeeally craving Mexican food.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "Monday evening and lots of shops winding down for the night. Wasn't sure about coming to this spot, but the ladies behind the counter seemed friendly and they had some options I liked.\n\nMore on the expensive end for take-away Mexican food, so limited myself to just an entree. Went for the \"Pollo Al Carbon\" Burrito Bowl ($12.50) - a helping of green rice, beans, pico de gallo, guacamole, cheese, salsa, corn, and of course chicken. All the items are in containers ready to be assembled, which is why it was weird it took 10 minutes for the order to come out. Bowl is layered with the ingredients, and a nice helping of chicken - not much guacamole to be seen, yet plenty of sour cream. Meal-to-price ratio is not favorable; albeit the food is good enough to eat quickly.\n\nWasn't a line when we were there and the people working here are nice. Don't think it's worth coming back to considering the plethora of options at this food court.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "So we stopped in after doing a escape room. The tacos are definitely pricey $4.50 for one taco and they are small. I had the grilled steak which was really good and the snow crab taco which was just ok. My friends had the nachos and they enjoyed it. Be prepared to spend. I would definitely come back here again though.", "author": "T H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "This brisket quesadilla was filled with meat and cheese. I never thought to put brisket in a quesadilla. There was a bit of a wait and line for the food but it was worth it. It also comes with a small side of guacamole.", "author": "Geraldine E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-21", "description": "Here we tried the brisket quesedilla. Not too bad, not too good. The wait was exceptionally long and unexpected for just a quesadilla to snack on.\n\nThe texture is on point, the amount of brisket is pretty good, the taste overall is there. What is needed here is a little bit more for the customer, maybe compensate for the wait with having us watch someone make guacamole or pico. We literally did laps around the entire city point and ordered other food in the time it took to receive ours.\n\nI love tacos, I know a lot of taco places, I have yet to try the crab one. Please find ways to reduce the wait or create more excitement for the wait before I bring my family back again!\n\nThank you.", "author": "Devon O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Overall one of the more decently priced options at the dekalb market. A brisket quesadilla is $10 overall pretty tasty. The service is fine but it does take a little longer than most people are probably used to waiting for a lunch order. I was there on a slow day and my order did not take long but I can see how their orders could get backed up on a busier day. \nThe brisket quesadilla was good I wished the toppings were on the side rather than on top of the quesadilla because it was pretty messy but it did taste good. My friends ordered the smoked crab and breakfast taco. Overall they thought the tacos were good the smoked crab could use a little more sauce. The \"with guac\" on the menu led us all to believe it would be on the side (we will ask next time). I would go back and try to ask for the guacamole on the side.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-15", "description": "This is probably the worst spot to stop for tacos.First of all one of the woman that works there has by far the worst attitude.You're not indentured if you don't like your job quit.I work in customer service so I always try to be as polite as possible to people.It was as if I was bothering her by being there.I walk up to the counter say hello get no response back.I say my order and everything I ask for they don't have.I settle on a chicken taco that looked like a kids taco at a diner.Six dollars for one taco and to deal with someone with a very bad attitude.", "author": "Gloria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "We were really hungry and overwhelmed as the Dekalb Market is always full of delicious smells that you can't really figure out where it's coming from. We decided to try DeKalb Taco since we had already been to dulcinea the same corner. The order-taker was very nice especially when she explained the shrimp taco was already sold out. She look like she felt bad that I was unable to try it. So I ended up going with the chicken and fish tacos and my BFF got a burrito bowl. I tasted his dinner and it was much better than mine as the tacos claim to have the same thing on each one and that could not be further from the truth. The fish taco had some weird sauces that were mayo-based as opposed to the toppings on the chicken taco had guacamole and salsa (verde \u0026 rojo) which were pretty good.  But the baja style fish was super gross.  I don't know if I will go back.", "author": "Farrah B."}], "servesCuisine": "Tacos", "priceRange": "$11-30", "name": "Dekalb Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1M6c5jnYI2Uj8hWBKizwCw/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}