{"aggregateRating": {"reviewCount": 43, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "These guys are the worst. Tacos are tiny and not good. Customer service is unbelievably bad. I'm not the kind of customer that needs to be put up on a pedastle. Just don't be a jerk to me for no reason. They're not exactly doing me any favors by selling me food and taking my hard earned money. The big guy with short buzzed hair in the white shirt working the register is in the wrong business. He should not be interacting with guests. I would never go there again. Too bad because I like Dekalb Market but that place leaves such a bad taste in my mouth that I'll never return.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "Food is decent. This was my second vising on 7/18. I ordered the same thing as last - smoked crab quesadilla with no tomato. Tomatoes make me very sick so I emphasized that both times I ordered. The first time I ordered, I was still giving salsa - which I obviously didn't eat. The second time, the tomato was actually cooked into the quesadilla which was an obvious issue. Didn't realize it until I got back to work which by then was too late to actually go back for a refund/replacement. There seems to be miscommunication between the cook and those taking orders, but I don't understand why this was an issue as 'no tomatoes' was also included on my receipt. Additionally, the service is also a bit slow. Several people who ordered after me received their order first. Great addition to the area and tried to give it a chance, but I'll stick with the other Mexican restaurants in the area that are more reasonably priced and actually listen to what you order.", "author": "Kimmie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "As another reviewer already said, the food is great, but the service needs to improve.  Also, the first time I went, I was charged $11.98 ($11+tax) for the three taco box.  Today, five days later than last time, I was charged $12.79 for the same box of three, and when I asked about the amount, the cashier said it was the amount with the tax.  So maybe I will try other vendors in the Hall until this place gets its act together.", "author": "Amy P."}], "servesCuisine": "Tacos", "priceRange": "$11-30", "name": "Dekalb Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1M6c5jnYI2Uj8hWBKizwCw/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}