{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "A Louisiana/Alabama twist ALL THE WAY UP IN #BROOKLYN ZOO, NEW YORK!!!!! Adam Lathan \u0026 Clay Boulware hits a homerun! The customer service is CREME DE LA CREME Southern Hospitality IN BROOKLYN!!!!! The catfish poboy is to die for!!!!! My OFFICIAL #1 EATERY IN BROOKLYN, NY FROM NOW ON! Every single person that walk in while I was sitting talked about how awesome the food was. #TheGumboBros #gumbo #goodeats #YesMaamYessirNoExceptions #poboys #catfish #seafood #chicken #sausage #nannysseafood #shrimp #roastbeef #delicious", "author": "Tammi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "About last night!!! I heard about Gumbo Bros online and decided to pop over to Brooklyn to see about this amazing place.  When I walked in I immediately was taken by the smell of the space. Its that smell that gives all good restaurants their street cred. It takes you back to your grandmamas kitchen table, tapping your foot, waiting for whatever creation she was working on.  I knew I was in for something legit and I was not disappointed. \n\nThe restaurant has about 5 tables and seats maybe 20 people at full capacity, it was quaint and welcoming . When I reached the register I was met with a big smile from the young lady working there. I asked a few questions and decided to order the shrimp poh boi, fried green tomatoes and gumbo!!! The pricing was about the same as New Orleans.  I waited maybe 10 minutes and the waitress materialized with the food. Let's start with the fried green tomatoes. The tomatoes were fresh, firm and fried well with good flavor. Moving on to the seafood gumbo . You could see somebody was working a real rue to make this gumbo. Served wjth white rice it was an amazing combination of shrimp and other seafood, that signature brown gravy nom nom is an understatement.  The poh boi brought me back to New Orleans. The bread firm and fresh, good toppings and super tender shrimp.... I found myself at the table talking to myself.. Talking through each bite excited and wanting more. \n\nGumbo Bros is a great restaurant. I will be back and can't wait to bring a group of friends with me!!\n\nThank you Gumbo Bros for a great experience.", "author": "Charlie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "The only spot in the state of New York to get real gumbo and poboys. I travelled to New Orleans this past weekend and had \"seafood gumbo\" at a prestigious joint and it had nothing on the quality of roux and flavor that The GumboBros provide. \n\nAre you a rice guy.... they got you. \n\nAre you a potato salad guy.... they got you. \n\nI don't know what those gumbo brothers are going back in the kitchen, but as far as I know, it's magic.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "This place is Amazing!!!! The Crawfish Mac \u0026 Cheese is Terrific! I was in New Orleans in April and had Seafood Gumbo from a lot of different places over there near Bourbon Street and honestly when I had the Gumbo here, it brought me back to the N.O. This place is A1 for The Gumbo and Mac \u0026 Cheese. But I was highly disappointed in the Beignet. It was flat out disgusting! I can't even describe the taste but the other items make up for it. The Sweet Tea is really good as well. Every time I go there, it's either a little bit left or it's sold out. Come check this place out. I would differently recommend", "author": "Camil A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "The food here is insanely good!!!  I had a shrimp po'boy and pickle chips today and I'm already thinking of when I make it back.\n\nFor any Texan, I highly recommend the pickle chips! Closest thing to Luby's I've ever eaten outside of Texas... ;)", "author": "Annie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Everyone knows that the big difference between a decent Po'boy (a pretender to the name) and a great Po'Boy (the legit) is the bread. It's a special thing that is tied to New Orleans - like New York bagels or San Fransisco Sour Dough. Well, these guys make legit and awesome Po'Boys. When I asked the super friendly check-out girl, she said that the bread is specifically from a small bakery in New Orleans - and you can really tell the difference.\n\nEasy to snag one and head two doors down to the Brazen Head bar for a good beer to wash it down. It's a very very welcome addition to the sadly growing boring food scene starting to rule over the Cobble Hill/BK Heights area.", "author": "Henry W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Pretty close to what you would get in New Orleans. Had the \n\nshrimp po boy \u0026 catfish po boy - wish they toasted the bread, but at least it's fluffy. Don't think it's fresh shrimp. \nchicken and sausage gumbo - highly recommend, the small is a good portion even to share for two people since it's heavy \npotato salad - highly recommend, different from regular potato salad, nice spice kick", "author": "Na S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Finally! A superb New Orleans-style restaurant in New York City! Outstanding chicken and sausage gumbo. Excellent catfish po-boy. Very tasty fried green tomatoes and pecan pie. We loved it!", "author": "Steve K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "I had the vegetarian gumbo and catfish sando.  While the gumbo was ok, the sando was great.  I would definitely come back, especially for the quick turnaround and relatively good prices.", "author": "Five C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "The Gumbo Bros more like \"The Dumbo Bro\"...I was in here yesterday afternoon and could not have had worse service. The Bro working was Adam and man could he use a few lessons in custom service. He had a line out the door and was constantly taking to other folks regarding some dumb chili the bar next door had to order...hey Adam, take care of your customers first and chat with your friends later brother (took 30 min to get out the door because my time wasn't as valuable as his convo)! I usually frequent this place because the food is pretty good...however this experience was about as rude as it gets. Thanks Adam and the girl from Brazen Head Bar...two thumbs down!", "author": "Craig K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Really liked the po boy although I braved the pickles(I didn't think to ask if there were any, My usual spot didn't put pickles). The gumbo wasn't good like at all, and the rice to stew ration was like gravy with 2 grains of rice in it. I'll give their other items a try on the strength of the po boy, I hope I'm not disappointed. Friendly cashier and good service", "author": "Afia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Got shrimp po boy and gumbo. The breading used for the po boy was light, non greasy and delicious. Bread was great, flavors of the sandwich was well thought out. Everything was delicious. My mouth is watering thinking about it now.", "author": "sandy c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Let me preface this with the fact that I know NOTHING of Cajun cuisine.\n\nThere are very few sandwiches that I would eat with un-toasted bread. I don't know if you can request it or not. It doesn't matter. My girlfriend and I had both the catfish and the shrimp po boys and they were some of the best sandwiches I have ever had. The seafood was very fresh.The fish \u0026 the shrimp were crispy on the outside without being greasy and still soft on the inside. \n\nA few bites in we noticed the hot sauces. I figured I already know what tabasco tastes like so I tried the Crystal hot sauce. It is not the hottest hot sauce but it has a VERY good flavor profile which paired excellently with the po boys. So much so my girlfriend wants to find out where they sell it so she can buy some for herself.\n\nTo go with this was a bag of Zapps voodoo chips which were highly recommended by the person at the counter. Originally I got one bag of voodoo chips and one bag of sour cream and onion just in case. 2 chips in I went back to the counter and exchanged my sour cream and onion for another bag of voodoo chips. The flavor itself is hard to for me to describe. It has a hint of salt and vinegar, bbq, sweet and something else I can't quite put my finger on. Some of you may be hesitant by the way I described it, but you should absolutely try it!\n\nThe service was excellent! The person at the counter was very patient and willing to explain the flavors to us and made us feel welcome. You order at the counter and then sit and then the food comes to you. \n\nFor those of you a bit hesitant about spending $12+ dollars on sandwiches and chips, you are paying for fresh seafood lovingly made by people who know their way around a kitchen. We are definitely coming back next time we are in the area and trying the gumbo.", "author": "Richard P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Simply the best Cajun Creole food in the city. Simple sandwich-shop style atmosphere with zero pretense and fanfare; just straight up, down home, fantastic cookin of the best, most authentic Po Boys and Gumbo this city has to offer. I dare you to try and figure out which gumbo is better!\nOnly caveat, there's only seating for a few people, that said, since everything is served to-go style anyway, I'm highly inclined to, well, take it to go :) Cheers!", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Believe the hype.\n\nWorth every penny and every bite. I had the seafood Gumbo and I swear I could survive exclusively on it. \nThe flavors were balanced and perfect. \n\nHad the potato salad, and that was smokey, creamy and well seasoned. \n\nPlus I hate pecan pie and I almost stabbed my dude after I had a bite of his. So... \n\nGet here fast.", "author": "Jonaya K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "I'm from New Orleans, I've eaten this food all my life, and this food would feel right at home anywhere in Louisiana. \n\nStarting off, the gumbo game is on point. The chicken and andouille sausage was my favorite thing here. The roux and the okra were both cooked perfectly. The roux's a little spicy, loose but still buttery, and the okra was creamy and fresh. Gumbo is super hard to get right, even at home, so I'm damn happy that this place knows how to make it well.\n\nTheir po-boys are very, very close to perfect. What they've done better than any place in the city is the bread. If you want to talk authentic po-boys, you've got to have that dry, flaky, almost stale crunchiness. No other place in New York has tried as hard on the bread game. If they can find a way to toast it and dry it out just a tiny bit more, they've nailed it.\n\nIf I were as snobby as some of the other reviewers who have visited \"NOLA\" once or twice, I'd say they could be a little more sloppy and messy with the roast beef po-boy. There's a real charm to just tossing the meat and gravy in there without a care in the world. \n\nI'd love to see them add a french fry po-boy as they expand. This is a mega classic back home and it'd be awesome to see on the menu.\n\nAnyway, good food.", "author": "Brett B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Lord this place is my weakness!! Once it gets a little chilly, I'm inclined to stuff myself with comfort food, and this stuff is intense comfort. I usually get the seafood gumbo which is perfection. The roast beef with debris gravy is bursting with flavor and has become my favorite sandwich over the po'boy, even though I've always been a seafood gal, and the crawfish Mac and cheese is so savory and packed with crawfish; I never leave without an order. NOM NOM!", "author": "Janice W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "This place is amazing. I've tried both gumbos and they hold up against my famous Louisiana family's recipe. That says A LOT. The roux is super flavorful, more on the medium side color wise. I haven't tried the po boys yet, since I've tried to keep it on the \"healthier\" side, but they look totally legit.\n\nReasonably priced, good, and a unique lunch option. They could use more table space, but that's just because people love it - so it's worth the wait.", "author": "S L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Food was super good! We shared a shrimp po-boy and shared a small sausage \u0026 chicken gumbo. It was totally enough for two people. The po-boy had the perfect bread and came with some seriously good spicy cocktail sauce. It was a little messy and the shrimp breading didn't want to stay on, but it tasted seriously good. The gumbo was the real standout though. It was so flavorful with a slow spice that caught up with you as you ate it. Mmm. Seriously, it was so good that before we left I ordered a second gumbo to go so I could have it for lunch this week. \n\nIt's sort of a fast-food style set up so there's not too much atmosphere and it's fairly small. Even on a Sunday afternoon the tables were all filled up. \n\nDefinitely worth going back for a quick bite, though I wish it were more of a sit down, take your time kind of place.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "A taste of NOLA in brooklyn heights. The food is good but a bit pricy. I understand that they have their inventory imported from New Orleans directly so I can get why the high prices. Their Po'boy is good. The rice in the gumbo is a bit hard but that's just timing in cooking. Overall a good experience but once is enough.", "author": "Samantha L."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}