{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Stopped in on Fat Tuesday for our annual family feast! We chose the large chicken and sausage gumbo, the shrimp po boy, sides of red beans and rice and potato salad - also came with a piece of King Cake for the holiday. Then...I traveled 40 minutes with the food. \n\nThrew the po boy in the oven for a few min and heated the gumbo. Everything was GREAT! Bread was exceptional...really, I enjoyed it all very much and look forward to coming back. \n\nService was also pretty quick and friendly. No complaints.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "I've been going here since the beginning when the restaurant first opened. I really enjoy having their Nanny's Seafood Gumbo and the Fried Shrimp Po' Boy. I see that it has gotten more popular and was even recently featured on NY1. Menu has expanded, and I look forward to trying some of their other meals in the near future. If you enjoy spicy food, gumbo, soup, seafood and Cajun food, then this is the place for you.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "For some reason, NYC lacks good NOLA Cajun cuisine.  This is probably some of the best gumbo I've come across in NYC- aside from what I've created in my kitchen.  Being that it's an all day affair, the homemade stuff doesn't happen frequently.  It's labor intensive.  It's brings up the temperature in the kitchen to an uncomfortably hot level.  It takes a long time to mature. So yes, it is truly exciting that Gumbo Bros has arrived in my 'hood.\n\nThe seafood and chicken/andouille were both excellent.  Full of depth, flavor, and decent heat.  The only gripe I'd have is that the Gumbo Bros gumbos need more intact veggies - specifically okra.  Maybe the veggies were there to begin with, and had cooked down to oblivion. There's something nice about having a gumbo that doesn't feel like an unhealthy gutbomb.  With more veggies in there, I could probably be tricked into eating it daily.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "I was so happy when I first saw Gumbo Bros was opening nearby. \n\nSomething about the thought of not having to go to Williamsburg or the Lower East Side for Louisiana grub is amazing!!! New Orleans has been my favorite place to travel, and I long for gumbo and po boys. \n\nThe shrimp po boy was delicious. Seafood Gumbo was nicely seasoned and had just the right amount of kick. \n\nThank you! I will be back! \n\n*seafood is now local but they want to find a distributor (Louisiana?) that will sell their fish. I can definitely taste the difference because the different seafood that is Used. Nonetheless, very good! \n*waiting on their liquor license so you won't be sipping on an Abita there. The food and good vibes of management make up for all of this.", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Wow, I fell in love with the food of Gumbo's Bros. I got chicken and sausage gumbo, catfish poboy and green fried tomatoes, everything delicious!!! My new go-to place in Downtown Brooklyn", "author": "Davide O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "All I can say...CATFISH po' boy..The bread is the real deal from New Orleans..The spices are perfect...Took home seafood gumbo..Ahhhh..nirvana!!!!!!\nSaves me a plane ticket...", "author": "Esme J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "This place is as close to NOLA that you're going to get in Brooklyn. It's not too big inside, with a nice cozy feel and great atmosphere. As soon as you walk in you can smell the delicious spices from the gumbo, and honestly I started to get giddy at that moment. The last time I ate gumbo was 2 years ago during my first trip to New Orleans, and The Gumbo Bros. (Of course) did NOT disappoint. I had the chicken and sausage gumbo which was fantastic. It had just the right amount of kick to it, and was super filling. The catfish poboy was great also, with the fish being light and flavorful and the shrimp poboy that my bf had was a hit with him as well.\n\nThe staff was very friendly and we got a chance to say hello to the owners who were there. Overall the food here is definitely worth trying, and it just made me wish I was back in the big easy. I know we will be back here soon for another round, and maybe I will catch them when they make their beignets too!", "author": "Erica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "After living in New Orleans for a few years, I know my poboys. I've had the best... from Parkway to Crabby Jacks to Domilise's to R\u0026O, I have eaten several football fields worth of French bread.  These poboys rank among the best. Their roast beef (shredded... these guys know what's up) is some of the most succulent I've had anywhere. The debris (that's gravy in Yankee speak) is balanced and appropriately portioned on the sandwich. Their shrimp poboy has the perfect batter.  None of that scampi dogsh*t either. These shrimp are JUMBO, perfectly cooked and piled high.  The bread was a familiar favorite: Leidenheimer's bread, sourced all the way from New Orleans.  If you speak poboy, you know there's no substitute. \n\nLet's get down to business: Gumbo. I tried their seafood gumbo and it was better than my grandma's (which takes her all day to make).  Enough said. \n\nThe sides were some of the real stars here. The greens were better than many meat \u0026 3's we have down south. The red beans make it feel like it's Monday everyday.  The fried pickles use fish batter (my personal favorite) and a side of remoulade. \n\nThe decor was even authentic. They have familiar pictures from Louisiana all over the walls. Every detail, even the floor tiles saying \"Atlantic Avenue\" scream old New Orleans.  They even had an old school JAX beer cooler in the bathroom. \n\nSpeaking of beer, several Abita favorites are on tap, along with some of Brooklyn's finest crunchy craft brews.  \n\nI am always skeptical of \"Cajun\" themed food anywhere outside of southern Louisiana, so much so that I almost didn't give the Bro's a try.  But if these guys set up shop in New Orleans, they'd be a hit there too.  The service seems to be imported from New Orleans too: friendly, warm, attentive.  This place rules. Do yourself a favor and grab a quick lunch here.  It might be one of the best meals for your money in the city.", "author": "Richard F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Great hospitality and delicious fried catfish po boy! Went here with a group of friends and everyone enjoyed their dish, the whole range of gumbo and po boy selections.", "author": "Storm H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Sat down and enjoyed the seafood gumbo, which was phenomenal! A robust, smokey, and spicy flavor that embodied Louisiana like no other. Relax and enjoy a beer, savor the flavor of this amazing gumbo, and end with some delicious beignets.", "author": "Allie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "There... was... a house... down in New Orleans.  Well more like Atlantic Avenue.  And not really a house, more like a nook.  The decor inside tell a different story, crimson paint covered walls, bar stools and elevated tables, small bistro sets and stools, plus a bar at the entrance which offers a scenic view of the street.  Modest accomodations which leads to their food.\n\nGo for the catfish po'boy.  The hard crispy crust of the fish in soft bread topped with shedded lettuce, sliced tomatoes, and remoulade and pickles are a good tickle for the tastebuds.  Condiments of ketchup, tobasco, and Crystal's hotsauce for the purists.  \n\nThe menu is pretty simple with just po boys and gumbos.  Which means two things.  Specialized niche recipes so its great but lack of variety.  \n\nYou want good fried catfish, this is the place to go.  \n\nAs a note, I want to see ettouffe and blackened gator on the menu in the future.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Went again Friday. I won't order the rice and beans again. The po boy was good. I had the chips and the banana pudding to go. The door opening and closing made my mac n cheese cold.", "author": "Musiclvr 8."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Not many places to get New Orleans style fare in Brooklyn, and this might be one of the best. Gumbo and po boys! What else do you need?", "author": "Rich P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "I am vegan and from New Orleans and just had the best food!! Gumbo z'Herbes and fried green tomatoes poyboy and beignets. Everything tasted like home. One forgets how sweet is the French bread and how delightfully painful it is to bite into a piping hot beignet surrounded by pillowy powdered sugar.", "author": "Allison Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "The catfish po boy with dashes of Krystals hot sauce was awesome.  The fish was crispy on the outside and tender within. $13 feels pricey,  but is super filling and worth it.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "So delicious! Got the chicken and sausage gumbo cup with a side of the greens. Fast service (from a very cute and friendly waiter), good music playing, and lovely eclectic decor made for the best Cajun food I've had outside of New Orleans. Definitely recommended, especially if you're on a low carb diet as they have great non-bread options.", "author": "Allegra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Delicious and authentic New Orleans cuisine. We started with the gumbo, which was hearty and delicious. The shrimp po boy was great, as good as any of the ones I had in New Orleans. Big portions and flavors. \n\nI was surprised by how warm and welcoming the ambiance and the staff were. We planned to take our food to go, but decided to stay there and enjoy our food instead. We had some delicious Abita beers to go along with it. \n\nHighly recommend. Great staff and food!", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I love this place.  The food is tasty and it taste true southern.  The owners are very pleasant as well.  I love the poboys.  The specials are great.  The deserts are great as well.  Must try in the neighborhood.", "author": "M S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-28", "description": "Why it takes so damn long to scoop gumbo into a bowl, I will never know. What's worse is I see my food sitting on the counter. Do I really have to ask for my own food after sitting here for 20 minutes?", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Great place small quiet great music and the gumbo was great the crawfish mac n cheese was good but my fave is the fried green tomatoes yum prices are reasonable", "author": "Kishana C."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}