{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "The food was very fresh and delicious, I had seafood gumbo and a catfish poboy sandwich. Seafood and fish  were particularly fresh tasting. Bowl of gumbo was $14 dollar, the sandwich was $12.  Total was $26.\nI thought it was a little pricey and the portions a bit small. Small place with pleasant fast food ambiance.  Next time I come, it will be for lunch, not dinner,\nbecause I  will get either soup or a sandwich, not both due to the prices.", "author": "Beth O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Stopped in for lunch and I was not disappointed. I ordered the lunch special. The shrimp po' boy was tasty. Shrimp were a decent size. The seafood gumbo had just the right amount of kick, they were not afraid to season it accordingly. Cajun/Southern food should not be bland. My son had the chicken and sausage gumbo. He liked it very much. Don't expect much seafood in the seafood gumbo, but considering prices I did not complain. Service was friendly and knowledgeable. I did have to wait for my food but it wasn't too long and you can have a beer while you wait. I liked the fact that everything was not reheated so once again the wait isn't too bad. I will be returning.", "author": "Nisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Great service! Great fun! I threw a crawfish boil at my apartment and both partners arrived on time and prepared. They showed my guests how to eat the crawfish and interacted with my guests all day. They cleaned up wonderfully. Great pricing too! Definitely a perfect way to kick off the summer!", "author": "Jamie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Place is tremendous, have been there and also ordered a number of times. Last night they weren't as fast as they normally are for delivery, but they were still under the time given. They sent a hand written note apologizing for the delay as they are expanding and included free deserts!\n\nWhat amazing customer service to go along with the awesome food.", "author": "Darrell G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Really impressed with this place. The gumbo was excellent, the po-boys were great, and the staff was very friendly. Really looking forward to going back here for my creole cravings!", "author": "Tom O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Love the environment. The owner is the one and only coolest individuals ever. The food is awesome.", "author": "Chef Simone R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "So one day my boyfriend really wanted cat fish po boys. I mean really, really wanted them. He wanted them to a point where we watched endless YouTube videos of catfish noodling, listened to Mardi Gras tunes and drank ourselves silly from a cooler of beers in the living room. (No, the kitchen was not that far away but we had urgency!!) After visiting not 2 but 3 grocery stores in search of le catfish, we finally found our whiskered fishy friend in Gowanus...no not in the river...and on our way back home we passed Gumbo Bros!!!! Oh man had we only known of your greatness. We had momentum so we still went home and made our own anyway but you better believe your sweet jambalaya that a few days later we tried Gumbo Bros. (Not) surprisingly their cat fish Po boys blew ours out of...well, the water. Pun intended. Blew ours out of Brooklyn. Blew ours out of...get your mind out of the gutter and get to Atlantic Ave!! Pro tip: if you want to try a few of their other offerings (and you're there with a friend), split the sandwich, it's enough for two in my very, very humbled opinion.", "author": "Leah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Had high expectations for this place since its impossible to find good New Orleans cuisine in NYC.\nWe ate in. The gumbo was very good  - but served in a plastic to-go container with plastic utensils which was kind of gross as your food ends up tasting a bit like plastic. The shrimp Po-Boy was served on cold and mushy bread which had the effect of cooling down the fried shrimp, which were flavorful and delicious. But nobody wants to eat a sandwich on cold mushy bread. I heard that they are using a bakery in New Orleans for the bread.", "author": "Debbie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Surprisingly good! As someone with family in Louisiana and who can make a Peru decent put of gumbo myself I was pleasantly surprised to find a good gumbo spot in Brooklyn. Was in town for work for a couple of weeks and ended up at this spot at least three times. The 'dearth by gumbo' special is a combination of both the seafood and chicken and sausage gumbos. Perfectly seasoned. The fried shrimp po boy was also very tasty and took me back to some of my favorite spots in New Orleans. Would definitely be back each time I visit the area.", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Been here twice and had the same order each time: chicken sausage gumbo and a bag of Zapp's voodoo chips. It's never too crowded and the gumbo is delicious. Okra might be my favorite vegetable and it's perfect in the stew. Really happy with this addition to the neighborhood.", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "So excited this place opened in the area, given our love of New Orleans. My favorites are the shrimp po boy \u0026 the chicken gumbo - which has a ton of chicken and sausage and veggies over rice - although my husband swears by the catfish po boy (with hot sauce of course). I do agree with a previous poster though - it could be that much better with toasted bread IMO.\n\nAlso, tonight I called because one of our sandwiches was not quite right (we had picked up) and I just wanted to see if it was supposed to be that way, and if not, just let them know - they insisted on making a new one and delivering it right away (with chips \u0026 a dessert). Impressive customer service. Welcome to the neighborhood Gumbo Bros!!", "author": "Janna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Small quaint hip joint. Order at counter. Seating for about 20-25. Southern comfort food.  Handful of beers on tap plus some Louisiana favorites by bottle. Not a wine drinker but I believe they had some available. Delicious and filling. Good portions for the price. Service was fast. Authentic Creole gumbo. I'm from Louisiana so I should know. Hot sauce bottles were near empty though. Should do a better job of keeping them filled. But you won't need much because most dishes are flavored to my taste. Highly recommend the seafood gumbo and the roast beef poboy. These guys need another location across the river.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "My girlfriend is from NOLA and has a high bar for the food she can make at home. It wasn't the best po boy she's had but she liked it which means a lot. I only ordered the mac side which was great after I added salt to it.", "author": "Vainius G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "I really enjoyed the meal and the cashier was super friendly and made sure the place was clean. I got a small bowl of seafood gumbo which was actually larger than I expected and good amount of shrimp and a side of greens which were delicious! Next I'll try a sandwich !", "author": "Sonia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "These boys know their Cajun cuisine. Having been born in New Orleans and raised in Louisiana I can tell you the shrimp poboy, potato salad, fried pickles, and gumbo were as good as any I've ever enjoyed. Congrats guys, you hit a homerun with these recipes. Can't wait to return! Randy B.", "author": "Henrietta B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "My family is from New Orleans. I've lived right around the corner from Mother's on Tchoupitoulas. As a New Yorker of 8 years, I never thought I'd find a passable po boy or bowl of gumbo outside of Louisiana. But I was wrong!\n\nTheir debris po boy is one of the best I've ever had. Their catfish po boy uses fresh fish with a perfect cornmeal batter. And it's all served on Leidenheimer's bread, shipped up from New Orleans, which is the secret to a great po boy. Nothing else comes close!\n\nAs for their gumbo, it's also stellar. The roux is dark and the stew is thick, with a perfect amount of heat. It's loaded with meat and goodies so it'll fill you right up. And the andouille sausage is not some cheap imitation. As someone who turns his nose up at any gumbo that's lighter than the color of dark brown leather, this hits the nail on the head.\n\nI can't praise this place enough. It's almost insulting what passes for Cajun \u0026 Creole cooking up here, so Gumbo Bros is a breath of fresh air. In all seriousness, it's better than a lot of the gumbo \u0026 po boys you can find in New Orleans. Do yourself a favor and check this place out.", "author": "Garroch N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "I want to come home to their gumbo every night. A cup of gumbo and half of a po' boy will leave you full and happy.", "author": "Regina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Such good New Orleans-style food.  Creative spins on classics too. Biz partners from LA are super nice and passionate about what they do.", "author": "Jordan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Not impressed. Should've known seeing as how the place is always empty. Food was mediocre at best. Will not be returning.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "When I tell you this place has changed my life and took me on a Spiritual Journey to down home southern living! It'd be an understatement the Gumbo was nothing less than magical but the Catfish Po' Boy... I would straight fight someone over! If you find yourself in the neighborhood do yourself a favor stop in and grab a bowl and snatch up a sandwich.", "author": "Kabal S."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}