{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "I got the shrimp po'boy tonight and absolutely loved it! I lived in New Orleans for three years and tried all the good spots. This isn't Domilise's, but it's damn good po'boy right here in Brooklyn. The bread is on point. They know how to dress it. And the shrimp was fried perfectly and deliciously. I love the classic New Orleans decorations and of course was happy to see a range of Zapp's options. Looking forward to when they get the beer/wine license, which they say should be before the new year. I hope these guys succeed because I see myself coming here way too often.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "If siting down in an atmospheric setting is your thing, move on. If tasty Cajun chow is your thing, stay put at the meager sitting spaces or take out. This brand new New Orleans joint has super gumbo and po'boys in several flavors at reasonable prices.  As a resident of BoCoCa (Boerum Hill, Cobble Hill, and Carrol Gardens), I will be ordering delivery from this  wonderful new spot when they start delivering beginning next week. The gumbos are flavorful and not too spicy (hot sauce is provided for customizing), and the po'boys are generous (I had the shrimp). Welcome to the neighborhood!!", "author": "Marty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Had the sausage and chicken gumbo which was pretty dang good. It's nice to have something different in the neighborhood and the gumbo is worth a try.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "I am not one of those people that writes help reviews, but I just had to shout out to the homies at the gumbo bros who created a the best vegan gumbo, ever. I mean... I had pretty much resigned myself to a gumbo free life as a vegetarian that is... until I popped into this restaurant the other day cus my friend wanted a po'boy. Well.... turns out vegan gumbo exists. And it's delightful. Also, the guys that work the counter are exceptionally charming.", "author": "Genevieve J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "The seafood gumbo and shrimp po'boy were on point! The ambiance is cool, it reminds me of a restaurant I often visit in the French Market. Thank you for bringing some of the Big Easy to Brooklyn. Great job ya'll!!!", "author": "Kay K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-08", "description": "I'm from Louisiana and have been looking for a decent cajun place for years. Went in last night and was really disappointed.  The food took forever, but that's forgivable considering they just opened and the guy at the counter was really nice.  \n\nThe cup of gumbo they handed over had no rice, though. No rice. They didn't warn us that 50% of the dish was missing beforehand. When I went up to ask for rice -- we were told they were out and weren't making more. The flavor was pretty authentic overall, though, even if there was only one piece of sausage in the whole thing.  \n\nThe dressed catfish poboy arrived cold with no sauce at all. It was bland and honestly pretty terrible. \n\nOverall: stick with the gumbo and hope they have rice.", "author": "B W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Love the Menu... picky eater.. the best Shrimp, Softshell Crab Po' Boys! Seafood Gumbo slamming,the best Cooks And Customer service, the Owners are So Cool and very down to Earth... Today was about my 5th time eating there... don't eat every where..But I love this Gumbo Joint! Banana pudding, Pecan pie.. Yummy!", "author": "Regina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "The roux was way too dark for seafood (I might even say burnt) and undersalted. Given the lack of any amenities, e.g. disposable bowls, plastic spoon, the $14 price tag for a not-huge bowl was too high. I lived most of my life on the Texas Gulf Coast, have spent a good deal of time in Louisiana, and had two wives with Louisiana roots, so I've eaten a good deal of gumbo on its native turf, and this was not close to the best gumbo I've ever had.", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Authentic Cajun flavors! Was so excited when this place opened in the neighborhood since I'm a big fan of Cajun/Creole food and take regular food and jazz trips to New Orleans. Been here twice now and it lives up to the promise. Excellent shrimp poboy - the best I've had outside NOLA - plenty of plump perfectly cooked shrimp and balanced flavors with the slaw and remoulade sauce. Highly recommended! Also recommend the seafood gumbo, which is very tasty with an assortment of seafood in a crab broth and comes with two scoops of rice.  Will definitely be going again!", "author": "Shafina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Had the half shrimp poboy and cup of chicken and sausage gumbo - really good! Coming back for the catfish. Staff was great gave me great recommendations and funny and friendly. It's a win for me. I'll gladly travel for a good poboy! Will have to try the \"ben-yays\" and coffee next time too", "author": "Kayla P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Now that I've been indulging more in Nawlins cuisine and \"get\" the flavor profile, I can say I have learned to enjoy it. I have given Gumbo Bros another try or two and can say I enjoy the catfish poboy. This place is STILL THE MOST UNCOMFORTABLE RESTAURANT IN BROOKLYN but I like the food.\n\nPlease, you gotta do something about the awful, awful accommodations in the dining room. PLEASE.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Awesome place for scrumptious po boys and gumbo reminiscent of NOLA.  Had the cat fish po boy, crunchy outside and juicy inside.  Great addition to the neighborhood!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "This place is seriously overpriced. I paid $13.00 for chicken and sausage gumbo. It came in a cheap plastic container that was not even filled all the way. As for the gumbo it was bland. No heat at all, the roux tasted a little bitter.  It's definitely at the bottom of the worst gumbo's I've  ever eaten. Next time I'm craving Cajun food I'll wait for when I'm in Nola again.", "author": "Aheisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Great food and friendly service/owners.  The Po Boys are great and the banana pudding is a treat.  Will be back to try the Gumbo!", "author": "Matt P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Solid po boys and gumbo! Pricey but high quality. No booze yet, though they say it's coming. I'd like to see them serve their gumbo for dine in in something besides plastic takeout containers.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "The catfish po boy was great and the roast beef po boy was very good.  Fresh ingredients and full of flavor. The Gumbo bros have a winning recipe. This place is a great recommendation for a Brooklyn eatery", "author": "Francis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Excellent hole in the wall spot off the borough Hall subway stop. Their potato salad, gumbo, and pecan pie is the best I've ever had outside of home cooking. Go eat it", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "As a native Houstonian, I'm picky about Gumbo and Po'boys- definitely not disappointed here! Really nice folks at the counter and the good was awesome. Girlfriend and I split a large gumbo and a shrimp po'boy. Great price, great food. Highly recommended!", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "We are visiting from Seattle and wanted to explore great sandwich places in Brooklyn, NY. When we found this place on yelp, we thought it was interesting to try this highly rated southern sandwich place in Brooklyn. Fantastic! This is real deal. We had Gumbo and shrimp Po'boy sandwich. Generous amount of shrimp and seasoned so well. Gumbo was thick and rich in flavor with just right amount of spicy kick. We have family in Louisiana and visit them every year. We love to eat and try new things, you reminded us of our family and great time we had from New Orleans to Natchitoches to Shreveport. Friendly people, great tasting foods.  Great job Gumbo Bros! Go LSU!", "author": "Alex T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "If you like shrimp, definitely try the shrimp po-boy. It was fantastic!", "author": "William D."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}