{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "??? Who knows, it could be 5 stars! Might want to adjust Yelp, Google and other platforms when you're going to close for the day before someone bikes all the way over here, based on the hours Google provided! Those hours can easily be turned on and off, please be considerate and communicate with your guests!", "author": "Mr. W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "This place was just okay. Inside there is a large communal table plus a few bar stools and tables. There is no table service? I'm still confused as to whether or not you're supposed to order at the counter or what. (We did but, really?)\n\nThe food: maybe I'm biased because I've actually been to NOLA but, this place was just not the business. The po-boy was bland. The catfish had a good fry but it was tasteless. And it costs $12  Throughout the restaurant they advertise that they import the same bread used in LA but it's more than the bread that makes the sandwich, in my opinion. \nThe crawfish Mac and cheese was pretty good though. I don't think I would come here again but it was an okay place to eat during a day of running errands in downtown bk.", "author": "Mel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Everyone knows you can't go to Trader Joe's hungry (those samples aren't enough!), and the surrounding chain restaurants are never worth the investment. Enter Gumbo Bros, which takes a fast-causal and authentic spin on the New Orleans classics of gumbo and po'boys. \n\nThe gumbo, stewed for over 2 hours, is absolutely delicious! Choosing between the seafood and chicken \u0026 pork sausage was one of the hardest decisions I've ever made. We got the chicken \u0026 pork bowl, which was more than enough for 2. We also got the roast beef po boy. It came with a fresh toasted baguette - shipped fresh from NOLA - and a lightly mayo-ey lettuce, tomato and pickle spread. It was good but missing something..maybe an onion or spicy layer?\n\nOverall, such a great comforting place to pop into! Let the full times roll..", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "What you need to know: \n- a small restaurant with just 4 tables and a small bar for seating\n- authentic touches from Louisiana grace this restaurant, including the bread that is used to make their poboys are shipped from Louisiana, Abita beer, cute décor and the cooking is point on! \n- accepts credit cards\n- the menu is quite limited, offering mainly gumbos and po-boys\n\nWhat we ordered: \n- Fried green tomatoes price $6.50 - this could possibly be the best fried green tomato I have tasted so far due to the non-greasy fried outside, the sponge-y dough and then the softness and wetness of the tomato.  It is not on the menu but they have it, just ask for it! \n- Chicken and sausage gumbo $12 - the depth and robustness of this gumbo was incredible.  You could definitely taste the time and the labor of love they placed into this dish! As they say, they make their gumbo the old-fashioned way, including their 2 hour roux! \n- Fried catfish po-boy $12 - I particularly love how the bread is soft so it is the perfect vessel to contain fried catfish, when you bite into the po-boy, all the contents stay in place and don't come shooting out.  This is the reason Gumbo Bros ship their Leidenheimer french bread directly from Louisiana!  The fried catfish was not greasy and had a sharp crispy exterior.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "This is by far the best restaurant I've eaten at in Brooklyn. The staff is extremely friendly. The place is a little small but the food defiantly makes up for it. Went in on a Saturday afternoon and got a table. The ambiance in there is nice. The food alone is sooo mazing.", "author": "Jasmine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "So I came here again and my experience was muchhh better food wise at least. I ordered the shrimp po'boy again. It was good shrimp well seasoned with the regular fixins'. I also got the Z'herbes gumbo MUCH BETTER than the one I had before I believe it is vegan, not sure if it's gluten free as well but I loved it, well seasoned, nice kick of spice and hot by the time I got back to work. I will definitely be back.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Ordered the lunch special which consisted  of 1/2 shrimp po boy and 1 cup of gumbo for $12 plus tax. This is a fast casual restaurant, so you order at the counter and wait for your food to be brought to you. Food was satisfying, although a bit on the salty side. Will return.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "I LOVE GUMBO!!!!! Especially from The Gumbo Bros. I have never been louisiana, but this place makes me want to visit real quick. The banana pudding here is also the bomb. You must try that too! I had the chicken and sausage gumbo 2x times already and each time it warms my heart. It is so perfect for cold weather. The wait is kinda longer than expected, but it is worth it because the gumbo is super flavorful. The sausage is my favorite part, but the chicken is tender as well. Definitely go for the bowl size because the cup will be too little to fulfill your craving.", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "This place serves the best catfish PoBoy sandwich!!!! I ate at Shakin Crab a few days before and was soooo unhappy with their catfish nugget sandwich. Had to stop by and get the real deal from The Gumbo Bros.\nExcellent service and great food!", "author": "Yolanda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "I passed this place on the way to the movies one day and vowed I'd make my way back. Well, today was the day! I've been craving a po boy and I was nearby so I stopped in for a bite. I will say this was the most expensive po boy I've ever had at $13 lol but it did not disappoint. I got a shrimp po boy, a side of potato salad ($4), and a sweet tea ($3). The food was really good and flavorful. The sweet tea was uneventful and barely sweet but the food made up for that. I left happy enough and with my belly full. So, although the price point doesn't rival anything you'd find in NOLA, it's still worth it to stop by here and try some things out.", "author": "Shawnee E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-27", "description": "If you want to watch other people place orders and eat mediocre sandwiches while you wait 20 minutes+ for your takeout order, this is the place. If you like asking for your money and being scowled at and told to wait some more, look no further. If you just hate yourself and your precious time, make this your lunch spot.", "author": "T M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "So I LOVE this place.\n\nIt's really really good.\n\nI am from Houston, which is quite close to LA. This is the real deal. \n\nI've been here a few times and come as much as I can when I'm in the area. Today my boyfriend was nice enough to bring me a bowl to go.\n\nI was super excited but now I'm super bummed because my $12 large bowl of gumbo that is far from my apartment is 70% white rice. \n \nBased off of this experience: 1 star\n\nBased off of in store experience: 5 star", "author": "Bec P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "Had what is called the chicken and sausage gumbo although the chicken and sausage were practically non-existent. What this turned out to be was a flavorful bowl of liquid (no roux available?) with some over-cooked vegetables and small pieces of meat. Even the sausage pieces were cut into quarters. Besides, their videos show a nice ball of white rice on top but mine had all the rice buried under the soup, not even sure if it was fresh or left over from yesterday.\n\nMaybe just a bad day since some of the other reviews are very good but too many other choices around so probably won't go back.", "author": "Max K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "Seafood gumbo is a must. Shrimp po bo good but not worth the price. I ordered the lunch special which is a good way to try more than one thing. They also serve desserts when i get to my goal I'm coming back for that nana pudding.", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "The gumbo would be better described as a soup. While it was flavorful and well spiced, it was very thin and the rice was undercooked. I was able to save it by reheating and adding some okra later.", "author": "And E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "If you've been to New Orleans, you'll realize right away that the food differs greatly from New York City. I love New Orleans Cajun. It is one of the best things about any city in the US. The gumbo, fish, po' boys, you name it, are all so unique (not to mention delicious). Every once in a while, I find myself craving New Orleans Cajun, but now place in the city really ever fit the mold..until now. \nI've tried Po' Boys from all the highly rated places in NYC, and this was by far the best one. Get the catfish po' boy since 1. It is the most authentic to NOLA style and 2. The obvious reason, it is the best one. The gumbo was also very good. It didn't give me a NOLA flashback, but it came the closest to ever doing so.", "author": "King K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "Small place with decent po' boy. During lunchtime they had a cup of gumbo and 1/2 a sandwich for $13. The server there was chatting away with the woman in front of me, while I waited for the conversation to be over and then finally ordered. Took quite a while to get my food because there seemed to be like 1 staff back there. \n\nNanny's seafood Gumbo ($6.50)- 2/5  It had a good amount of shrimp in it, which were good. But I wasn't too sure about the flavor, it was a mixture of blandness and pepperiness. \n\nShrimp po' boy ($13)- 4/5  This was good, but nothing spectacular. Expected it to be better than Popeyes but honestly it might be the same, just a lot more pricier.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "The gumbo was really good; nice little place on the inside. Just a random restaurant I came to because the reviews on Yelp were good so figured why not", "author": "Jon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I really enjoyed the feel and taste of this place. When you walk in, there are bench tables set up like a family reunion in Louisiana. That already set the New Orleans vibe and it kind of set the expectations high for me. I knew it had to be authentic and it had to taste REAL. Especially because I just had gumbo nearly a week ago during my trip to New Orleans. The staff was so welcoming, warm smiles, and they gave off this very genuine feeling that they really wanted me to enjoy the food and they really wanted me to give me the total experience and feel of an authentic Louisiana meal. The first bite I had was the seafood gumbo. It had the perfect amount of seafood and spices in the gumbo served under white rice. It was spicy, but not overwhelming go get a cup of water or milk spicy, not runny nose spicy, but more like a pleasant, satisfying kick. The gumbo reminded me of real southern cooking because of the very warm spices in the dark roux . You can tell they didn't some time and hard work on getting the roux to a great taste and texture. I didn't try the chicken and sausage gumbo because I don't eat Park but my friends seemed to enjoy it but said the seafood gumbo was better. I also tried the fried green tomatoes, in which there was  a bit of vinegar taste that made me question if it was a friend green pickle. Whatever was inside this crispy brown batter was perfectly fried and tasted pretty good in this white dipping sauce that came with it. I had the fried chicken sandwich-- loved it because it was juicy and well flavored with this honey mustard glaze. I don't even like honey mustard, but maybe this is how honey mustard is supposed to be done! The last thing I had was the collard greens. I didn't like them much because of the vinegar base and I just don't like vinegar in my collard greens. But I know plenty of my southern friends and family would appreciate it. Apparently vinegar in collard greens is a southern tradition so I won't knock the style. I can say I like the consistency and freshness of the greens and they clearly hand selected only the best collards. Overall, I LOVED my experience and my meal. I went home satisfied and wondering who else in NYC can do it like gumbo bros... (crickets)...", "author": "Mia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Cute place with high top tables, and festive beads hanging from the ceiling. You order at the counter and they are quick! They have three gumbos, out of the two we tried the seafood was GREAT! They have a veggie option that is gluten free (roux is made with wheat usually). The rice and beans was delicious as well. Beers on tap and they are proud of sourcing many of their ingredients from NOLA (beers included.) Delicious + fun spot !", "author": "Ali S."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}