{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Had the fried honey chicken po-boy and fried green tomatoes. If you close your eyes the flavors and textures are identical to New Orleans..My favorite place to eat! I look forward to eating at The Gumbo Bros any chance I get :).", "author": "Jacqui C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Thank you so much to Adam and the whole team at Gumbo Bros for bringing a little New Orleans to cobble hill!! Amazing gumbo, po'boys and chicory cold brew! Pop boys made on Leidenheimer bread and all ingredients are fresh and delicious! So lucky I got to try the special (which are on the groups social media pages- thanks instagram!) alligator jambalaya!! Lovely atmosphere and super cool and nice staff! Couldn't be happier to have this awesome restaurant so close by!", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "I ventured into The Gumbo Bros their opening weekend and tried the seafood gumbo along with some of the Leidenheimer bread for dipping. The Gumbo was on point, full of flavor and not overly spicy. The bread was perfect for sopping up the last bit of Gumbo. \n\nThe menu was limited at the time I visited and beer was not yet on tap, but with Gumbo that good I could not have cared. I'll definitely be coming back for seconds, thirds, etc.", "author": "Jordan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "This has been my third time visiting this restaurant and I've been satisfied with the food every time.  I've come at varying times and the wait has never been long and the staff has always been pleasant.\n\nSo far I have had the chicken and sausage gumbo, roast beef po' boy and the shrimp po' boy and some beignets. The gumbo has been my favorite.  It was very flavorful and satisfying, even in the smaller size.\n\nThe po' boys were tasty but seeing as though I'm not a fan of plain mayo, remoulade would have been a preferred choice.  I was able to get a cup after asking though. Maybe ask if one would prefer one or the other?  Also, if the roll was toasted it would have been perfect. Not sure if that's a step away from a normal po' boy but I'm sure it would have made for a tasty addition. \n\nOn a more disappointing note, like many places, a cup of soda initially came with ice filled to the top.  That's never preferred since I'm paying for soda and not ice.\n\nAside from that the food and atmosphere was great and I will definitely return, this time for the seafood gumbo.", "author": "Lucien A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Thank You But No Thank You! Recently got back from NOLA where we ate authentic fresh beignets at Cafe du Monde and Morning Call almost daily (3/under $3). The ones here do not measure up neither in taste or price. The taste was off-putting, only one side was crispy, the inside was spongy, and instead of 3 whole beignets, were given a whole one and one that was cut in half for $5!!!  The chicken and sausage gumbo was too watery, flavorless and overly spicy hot. The Shrimp PoBoy was soggy and the batter was not sticking to the shrimp. The Catfish PoBoy was thin and overcooked. The mayo on the sandwich didn't do anything for them. Will not be returning.", "author": "Norma B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-12", "description": "Great-TASTING seafood gumbo ($14 for a bowl), BUT it's definitely overpriced by at least $4. Even if you dine in, the gumbo is served in one of those horrible, heavy plastic take-out containers with a plastic spoon which cheapens the experience, further highlighting that you just clearly overpaid for an average-sized, not-terribly-filling nor generous bowl of gumbo. I left still feeling hungry. No cornbread or anything like that included to fill it out.\n\nI feel like I've tried every Cajun place in the city, and I'm still amazed that no one here has been able to get Cajun right. Yes, when I say that I'm including Great Jones Cafe, which I've found to be overrated. So, I was hoping that The Gumbo Bros would become the go-to place for my gumbo fix. And yes, like I said above, the TASTE is certainly the best I've had in the city, but the inflated price and cheap presentation is a huge disappointment which causes me to relegate The Gumbo Bros to the \"MAYBE if I'm nearby and I have money to burn\" category rather than the \"reliable weekly haunt\"category I was imagining before my visit. Unfortunate.", "author": "Lance E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "This place is amazing. My bowl of nanny's seafood gumbo and order of beignets took me right back to my time in New Orleans. The staff is friendly and gracious and even came out to ask how we liked everything, which is very unusual in a fast casual environment. Can't wait until their liquor license comes through and they get delivery set up because I will get to eat here even more.\n\nI highly recommend this place to anyone who likes good creole food. Let's support this local small business and keep amazing spots like this coming to downtown Brooklyn! Thanks for the amazing food and good time!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "This place was pretty delicious, i went here about 2 weeks ago and ordered the shrimp P.O. boy seeing that my fam is from Louisiana and it wasn't too spicy but it was just right. The fries i ordered were delish as well they were spicy just how i like it and the vibe comes off as if your on bourbon street", "author": "Felicie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Reasonably priced and solid po boys. We had one shrimp and one catfish. They both tasted pretty good. They seasoned it really well and the crispiness of the shrimps/catfish with the poboy/salad worked really well together.\n\nIt's not a big place so I wouldn't recommend coming with a group. It's more of a quick bite before the movies or take out kind of place.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Maybe I went on an off night, but I just wasn't that impressed. The space itself is cute as can be and the guy behind the counter was very friendly. We tried the shrimp po'boy and seafood gumbo. The shrimps on the po'boy were beautifully battered and crunchy and the roll was good but the rest was kind of tasteless - not enough pickles I guess. The gumbo had a decent amount of shrimp but the advertised crab was non-existent (call it shrimp gumbo please) and the sauce was totally tasteless. Fortunately there was lots of hot sauce available to remedy that situation.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "The shrimp poboy was good and large. I don't have room for the cup of seafood I bought. That is a very good thing. This review is to be continued ........", "author": "Sara P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "Was really looking forward to a Po'boy sandwich here.  The Po'boy's  in New Orleans\ndripped with sauce that was beyond scrumptious.  You couldn't order just one.  You\nhad to make the most of the experience with at least 2.\n\nAt GB the shrimp was dry and so was the shake \u0026 bake seasoning.  They put a little\ncabbage on top and they call it a Po'boy.  I call it a waste of $13 bucks.", "author": "Charro L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Fantastic gumbo. Some of the best I've ever had and I've had my share of gumbo. Friendly staff, cozy environment. Definitely recommend.", "author": "Carol A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "As a New Orleans native, my standards are pretty high when it comes to Cajun/creole food and this place does not disappoint! Po'boys are a staple down in Louisiana and this place is legit!! When I need to satisfy my Nola cravings, this is one of the first places I go!", "author": "C. T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "I ordered the shrimp po boy.  It was nothing exceptional.  Nothing close to what I had in New Orleans.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "The service was fantastic and the food was even better. My girl Heidi has the chicken and sausage gumbo and I had the seafood gumbo. Both were delicious and while mine was a little bit more spicy her was the better of the two. It was more flavorful and more filling. Heidi loved it so much she got 3 quarts of gumbo to take with us back to Boston. The owners were so kool they froze it for us overnight to pick up the next day. Please try out this place as you won't be disappointed!!", "author": "K W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Having been to Nola 4 times and being completely obsessed with it, I was SO excited to finally stop by this place. I got a poboy, and it was killer. I plan to return for gumbo and fried green tomatoes. Everything was lovely, the staff was super helpful and nice, it was clean, and I'm hoping to hear we will soon be able to watch Saints games there. They know what they are doing. The only thing that could make this place better is a projector and a backyard. I wish them so much success that they end up moving into a bigger space!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "This place is located right next to Trader Joe and it's so easy to grab a quick bite.\n\nAmbience 4\nService 3\nFood quality 3 \n\nI think over its a solid 3. Prices were a bit high but still I understand it's seafood. But I found the gumbo mild in flavor. I felt it was quite bland for a place who offers southern food. I expect a bigger punch from the seafood gumbo. Will not be back.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Had the beef po'boy and the vegan gumbo. 5 stars for the po'boy alone. That thing was on a whole 'nother level delicious. The gumbo was not bad, nothing to write home about though. Would definitely recommend, and would eat here again for sure.", "author": "Corey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "The seafood gumbo is delicious! The restaurant looks clean and tidy. Limited amout of seating.\nI went for the first time with some coworkers. I received fast service.", "author": "Ray-Ray M."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}