{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This place is SO DELICIOUS. I live around the corner and JUST discovered it. I wish I had earlier because I'm moving out of the state in 2 days and won't be able to eat here anymore!!!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Visited this small, humbly appointed neighborhood gem last Saturday.  Had their seafood gumbo and shrimp po'boy.  I have had many gumbos in my life and none compares to theirs.  It was absolutely the best - richly seasoned, not overpowering; plenty of seafood; authentic, looks and tastes like what a New Orleans grandmother would make in her kitchen; and, a generous portion for a reasonable price.  The po'boy was equivalently well prepared, well seasoned and full of shrimp.  Will definitely be back to try some of their other offerings.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "The Surf n Turf Po'boy (shrimp and roast beef) is the best sandwich in the city. End of review.", "author": "Buddy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "I had high hopes for this place after reading reviews. But even after a bad meal i usually dont care and say whatever. But i actually wanted a refund for this aweful meal. I tried eating more of it in hopes for it to taste better. But i ended up throwing half of it out and got another dinner. The crawfish mac and cheese came out scalding hot to a point where i burned the roof of my mouth to a point where i had skin hanging off. The mac was over cooked and very mushy. The cheese was flavorless and watery. The crawfish had an offputting old fishy taste. I also ordered the chicken sausage gumbo. Again, the food came out incredible hot and my burned mouth got worst. The roux wasnt bad but the sausage tasted like flavorless rubber balls and texture was of a dry spounge.  I wanted to ask for a refund. I wish i could get my money back. Because this tasted like leftovers from yesterday that was overheated. Biggest waste of $15. I wanted to like this place and im usually an easy pleaser and i love cajun food. And maybe i had a bad batch or maybe it was because i came late in the evening. Either way. This was a very dissatisfying experience at that price. This place was a huge dissapointment after reading the reviews.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "I'm so excited to have this place around the corner from my store. Always great to have a new lunch option. I tried the seafood gumbo today and it was excellent. And the shrimp Po boy, and I know I'm gonna get a lot of crap for this, is better than Domilise. The shrimp actually tasted like shrimp not just fried stuff on bread. As far as other reviewers complaining about prices (someone referred to them as overpriced), I can tell you until you open a food business, especially in a high rent neighborhood, cobble hill, then you have no clue what you're talking about. Food costs are high, labor costs are high, rent is through the roof.   Nobody is getting rich off selling food in a tiny shop and you are not getting ripped off. It might be more than you'd like to spend but it is not \"overpriced.\"  Anyway, back to the spot. They're doing it right. Having opened my own place I can tell you that the beginning isn't easy. But judging from what I ate, they're gonna be just fine!", "author": "Peter S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-18", "description": "Found this place while it was running a half gumbo half po' boy lunch special (still not cheap). The gumbo was very good, with lots of sausage (I assume andouille) and shredded chicken in a deep, dark sauce. There were bottles of Tabasco lying around but I can't imagine why as the gumbo was plenty spicy as served. The sandwich, unfortunately, had much less flavor. I was expecting slices of rare roast beef, but instead it was shredded, stringy and stuck together in small clumps, not much meat either. The gravy it was in didn't have any taste save for salt. I should say I don't know this kind of sandwich but I would normally like the roll to be crisp on the outside and soft on the inside. This one was soft on the outside and a little stale on the inside. Cajun food used to be very popular in NY; I remember it being better than this.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Little hole in the wall with big flavors and lovely, friendly service. My small container of thick, spicy shrimp gumbo really hit the spot. Cajun potato salad is delicious. The whole meal cost me $11. They have vegetarian options, but for those who care, be aware that the braised greens are cooked with bacon. No matter. There are enough options  here to keep this pescatarian happily returning.", "author": "Michele B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Food tastes awesome! I've had the shrimp po boy -- get it! And beignet bites -- available mostly on weekends are fantastic. Price is a little more than what you'd expect for what you're getting, even for this trendy part of Brooklyn. Everything feels about $2-3 more than it should be. That's what knocks off a star in my rating. Will it stop me from coming here? Not at all. The food is good, and the atmosphere is chill. Especially since there aren't many casual NO restaurants around, this makes a great spot. But it does deter me from the dropping in every week for random lunches or takeout. Final point, service here is very laxed. But their hipster'ishness is very adorable.", "author": "Xin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "I liked the sandwich (roast beef po boy) and the greens.  Very nice.  I think the issue is going to be the value for something that is solid but not special.  Brooklyn's the land of the great sandwich, and despite the imported-from-NO bread, I found a $12 price tag for a sandwich that's much smaller than the typical hero to be a little disappointing.  (Big price for smallish sandwich made me feel a bit like a po boy myself.)  But I will certainly try it again and price and size aside, it's hard not to like this stuff.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Seriously one of the best spots for a shrimp poboy that I've been able to fine in the NYC area! I happen to know for a fact that they have their bread shipped in from the 504. The seafood gumbo is no joke either, these guys know what they are doing! Love this place and is now a definite mainstay in my rotation.", "author": "Joel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "I was hopeful given the reviews but found myself severely underwhelmed.   I decided to try the gumbo z'herbs and it wasn't a gumbo; the consistency was way off and very watery.  It had the beginnings of flavor but missed the mark and never really got there.   The fried pickles were a bit better and still managed to have a crunch in the breading.   The pecan pie was mediocre.   I don't know if I would try it again.   I tried delivery,  maybe sit down has a better experience.  Delivery was timely though.", "author": "Nia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Ate lunch today- shrimp po-boy, greens and chicken sausage gumbo. Delicious and tastes like home (native Louisianan). Great service and very clean. Will be back.", "author": "Becky N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Good was outstanding.   I had shrimp poboy and fried pickles.   Service was great!   Very clean !!", "author": "Michele M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "This place hands down has the best gumbo I've ever had in NYC! The po boy sandwich was delicious and they weren't cheap with the shrimp! We will for sure be back!", "author": "Christina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Really good !!  I had the catfish pop boy  it was very satisfying and a good price it was only $12.00", "author": "Olga L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-25", "description": "Not a gumbo expert by any means, but compared to other gumbo I have had, this was mediocre. Chicken and sausage Gumbo tasted like pork gravy served over rice, pretty bland with very little spice or heat. It wasn't bad, but overall I was disappointed.", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "National Gumbo day? Who knew it was a thing?! Well it was and fate brought me to this gem on Thursday October 12th. Lets start with the staff - it literally took everything in me to not ask for a application and when could i start working! The staff is extremely peachy and charming. Everyone in this establishment seems to be placed with earthy smiles, unlike the press on ones that new yorkers are used to. I met amy, adam and a cook, although I didnt get his name. He flashed me a smile and went back to work : which was highly favored in a town that can be so cold. I got the chicken and sausage Gumbo as well as nannys gumbo for my mom and I . My mouth literally watered the whole train ride home. They both have completely different flavors without overpowering the yummy natural flavors of the seafood and chicken and sausage. The seafood gumbo packs a spicy punch were as the chicken and sausage gumbo has a smokey undertone. Both gumbos are packed with mounds of flavor! Days later - i heated this up and it was just as delicious if not: even better. You cant help but savor every single drop as if its the last. Everything is shipped from Louisiana and is fresh. This gem serves top quality without breaking your bank account! How could you not love it? Portions are southern style and they arent afraid to fill you up. Worth the trip, worth the time, worth the money and all. They dont just provide you with a meal, they provide you with an entire experience that will be hard to forget. Will be back soon with friends. Far from \"average\" food- definitely the homecooked feel we all love and appreciate!", "author": "Jai B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "I'm from Metairie, Louisiana and I grew up with legit po boys and gumbo. Having been living in Manhattan for years now, I haven't found anything even close to proper food until now. I honestly wouldn't change anything about Gumbo Bros recipes. To all the Yankees reading this, THIS is how it's supposed to taste. I didn't know this was here until my wife came home with a surprise and I was very skeptical. The bread, is legit. It's not hoagie bread or whatever else they call it here. Shredded lettuce, mayo, pickles. No remoulade or pretentious stuff. The gumbo was perfect. Every place has it's own recipe but I like theirs. I could smell the file' when I opened the container. Unfortunately, going to Brooklyn isn't a daily occurrence for me but I will definitely eat there whenever I can.", "author": "Polta T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I had the seafood Gumbo, and it was really delicious! It was the perfect mix of spice and flavor, and it had tons of shrimp. The rice was also cooked perfectly. It had the right amount of texture, and soaked up the gumbo really well. You won't miss going here for lunch or dinner.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Gumbo bros is fantastic. Small space but well laid out, adequate seating. Had a roast beef po boy and a chicken and sausage gumbo. Both really excellent. Will be back often.", "author": "David S."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}