{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "The Mac and cheese with crawfish was very good! I woofed it down before I could help myself. The Mac and cheese itself was flavored nicely and the crawfish was a good bonus to the Mac and cheese. \nThe catfish po boy was delicious. The bread was fresh and that really can make it Break a po boy. The bread was more like a baguette than a roll. The catfish was seasoned well and they weren't too cheap with what they gave. I would come back because this po better was better than what I've had in NOLA.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I ordered chicken and sausage gumbo, cajun fries and a sweet tea.  I found for gumbo slightly salty but delicious.  The dollop of rice was a nice partnership.  \nI was not super hungry but am curious to try the half po boy and gumbo lunch special which only takes place Monday through Friday.  I would say give this place a chance.  \nIt is tiny but great for a quick bite . There is not large picnic table and a few tables for two against the wall..there is a lovely window seat that provides a street view. \nThis place also sells tap beer and bottles miller high life for example", "author": "Dionne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "My wife and I ate here on a trip to NYC and were surprised how much we like it. First, they bring everything in from Louisiana and so it is very \"authentic.\" While that in and of itself is great...it also was very good. I am not much of a gumbo person, but I really liked mine. They also had root beer on tap...which is very hard to find. I don't remember the name of the sandwich that I had...but it was GREAT.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "One of the best places in NY to grab a cup of gumbo - I was spoiled while in New Orleans and nothing else compared - until now! \n\nThere are options for all types of New Yorkers with our special eating needs - meat eaters, pescatarians and gluten free vegans can all unite here for a cup of gumbo.\n\nBeer is of tap - all proceeds from Six Point beers go towards the Gleason Foundation. \n\nThe gumbo is filling and comes with rice in the dish too. \n\nAnother must eat while your here is an order of fried pickles. The pickles are lightly battered and not super greasy. They are tangy and zesty.", "author": "Anna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "I came here for lunch \u0026 the food was ok. I had the lunch special($13 \u0026 change) which was 1/2 of a Po Boy with either shrimp or roast beef (I did the shrimp) \u0026 you get a cup of gumbo \u0026 I picked the shrimp.My friend had the roast beef Po Boy \u0026 said it was good with cajun fries. The Shrimp Po Boy was ok \u0026 as well the gumbo, which was also a little spicy. I have been to NOLA \u0026 the gumbo didn't taste like it did out there, but it was a decent attempt at it.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Had the firecracker shrimp po boy and seafood gumbo. Both were awesome. Service was very friendly. Our food apparently took a little longer than normal, and they offered free drinks as compensation. Nice gesture.", "author": "Glendon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "Gumbo Bros is the best! Everything is super tasty. I love their chicken \u0026 sausage gumbo, seafood gumbo, all of their po-boys, and they have a bunch of great beers on tap from both Louisiana and NYC.\n\nGo now!", "author": "Michael H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "What a perfect day , the coldest day in NYC 2019 !!!!\n(Minus with the wind chill ..... still January so who knows.....) \nA Perfect day for GUMBO !!!!\nTried both the shrimp and the chicken/sausage  at the cup size which is great option if you want to try both options and not being overwhelmed.\nExcellent steamy rich gumbos , i prefer slightly the shrimp but both served well and generously .\nTook on the side their skinny fries , fresh and crunchy (remind me of spotted pig ones but better)", "author": "Tsvika K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Don't know why it is so hard to find decent Southern Food in NYC, but Gumbo Bros lives up to​ the hype. I remember trying them out at Madison Sq eats sometime back so it was good to visit their​ first brick and mortar store. The place is small and cozy, with just a sitting of about 12 people.\n\nWe ordered the green tomato PoBoy and chicken/sausage gumbo to share. First off, I love PoBoys but this was my first time trying out the green tomato poboy, and we liked the tangy fried goodness and gumbo wa​s also very flavorful, but I wish Gumbo's portion was little bigger.\n\nOverall a solid place for a quick and fast southern fix!!", "author": "Vineet S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "I had tried the gumbo when this place first opened; and while it was tasty, it was not as good as what I'd eaten in New Orleans. Today, years later, I passed by and thought that I'd give the gumbo another taste. Well, it is spectacular...as good as what I've eaten during my multiple NOLA vacations. So, this review is targeted specifically to those people who haven't tried this place since the early days. I confirmed with the owner and chef that it took a while for them to create gumbo PERFECTion, but they did!!", "author": "jill b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "3.5! I had the seafood gumbo and a side of red beans + rice. The gumbo was the clear winner! It had a mix of rich, authentic flavors. The reason I'm not rating it higher is that it was sooo salty. I thought it was a bit pricey at first, but the \"cup\" size was surprisingly filling. \n\nIt took about 15-20mins for the food to be ready, which I thought was a bit long given that the place was half-empty. But there was only one young woman taking orders and bringing out the food (she was incredibly warm and welcoming). \n\nAll in all, not a bad choice to go in the neighborhood if you're looking for something a little different! I would go back and try their po-boys or desserts next time.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "The Gumbo Bros lunch special is pretty awesome.  I have eaten it a bunch of times and it never disappoints.\n\nThe Poboy goes well with the Gumbo.  You can dip the bread from the Poboy in the Gumbo.\n\nThe beignets they offer are big and suitable for two.  As in, I pretend there are two people sitting there, but I eat them all myself.", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Got the chicken and sausage gumbo and Cajun fries. The gumbo is pretty good, but a bit smokier than what I prefer. However we are a long way away from Louisiana so I'll take what I can get. Cajun fries were perfect shoestring fries. They also gave complimentary potato salad!", "author": "Bobby N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Gumbo is the order here. Deep, dark reddish brown with a spice that lingers just long enough to wake you up but not upset. The shrimp was plump and sweet, an ideal foil. A fried chicken po boy was good but forgettable. \n\nA beer and a bowl of gumbo is a warming winter meal of the highest order.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Honestly thought the food here was better than the cajun food I tried in New Orleans. We had a party of 5, so pretty much got to try everything on the menu. The cajun chicken gumbo and the beignets were the highlights. The fried chicken poboy was delicious as well. \n\nThe staff were nice and it's a great place to grab a quick, delicious meal.", "author": "Janus C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Not to many places in New York where you can find good gumbo but you definitely can here. My favorite though is the Roast Beef Debris Po Boy. I've had the famous one at Mama's in New Orleans and Gumbo Bros version is much better. Great grave, tender,meat and soft bread. Top notch ingredients and its comes out in the food. Awesome stuff.", "author": "david l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "To be fair, the catfish po boy was very good. Not NOLA good, but very good. But the 2 gumbos we got were really disappointing. Nanny's was oily and z'herbs was bitter. Both felt as though the ingredients had been dumped together without coaxing the roux and spices into the necessary time-consuming NOLA lovefest.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "Maybe today was an off day. I had the shrimp po'boy.  It was only ok. You can't really mess it up - toast, mayo, pickles, lettuce, tomatoes, and fried shrimp.  It was good but nothing to write home about.  I don't think it's worth 15 bucks.  But like I said today may have been an off day.", "author": "Lorianne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Ill start with saying this was a good sandwich. I had the Shrimp Po Boy and it was severed hot, loaded with shrimp that were crispy fried. And the bread was good.  The sandwich quality and service was really good. The reason I cant give this place 5 stars is because if you call yourself Gumbo you better know how to season food with a creole flare! Not only did the sandwich not have a drop of spicy, Louisiana kick it didn't have any kind of seasoning. I mean they could have at least through some Old Bay in there for good measure. Clearly whoever owns this spot is not from Louisiana, maybe ancient members of their family are but they are northern city folks getting over on other northern city folks who don't know better.   \nThe sandwich isn't bad but if you know southern flavors and are expecting that, you will be disappointed.", "author": "Cstuff B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "I heard about this place for a while and I always wanted to try it. So I was driving by with s friend looking for a place to eat when my friend saw it. And he was like I know u always wanted to try this place want to do it now. At first I was like no but than I said let's do it. I should have followed my first instinct and kept driving. First of all inside is tiny not a lot of seats. But while we were ordering 2 seats became available and I had to run like I was on a train to get those seats. We ordered gumbo and poboy catfish and shrimp.\nThe gumbo wasn't tasty at all it was hot but no seasoning just bland. So glad I ordered a small size..I was in shocked but I had an idea when I saw the clientele that this wasn't no Louisiana Gumbo. My catfish after one bite i just left it. Only thing was ok was my beer.", "author": "Sidee F."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}