{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Stopped in for a quick bite \u0026 I am so glad I did. I was served up a serving of seafood gumbo along side a shrimp Po Boy. All I can say is YUMMMMM!!!\nThe gumbo was savory and loaded with shrimp. The Po boy was delicious. I chose the remoulade sauce. I can't say enough about how much I enjoyed the food!\nThe shop is small but nicely \u0026 smartly furnished to accommodate as many diners as possible. The service was quick \u0026 friendly. I wish I lived nearby but I will not forget to stop by!", "author": "Monise A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "I was on a mission to find something delicious while on a break from jury duty and I got lucky walking in here. I had the Surf \u0026 Turf po' boy and it was really delicious. It was pricier than some of the other ones on the menu but entirely worth it! Can't wait to go back and try the titular gumbo. A lot of people around me were eating that and I felt severe fomo but my po' boy was so gigantic I couldn't fit one more bite. Yum! Felt like New Orleans!", "author": "kimberly g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "Dicey little gumbo and po-boy place a few blocks from the courthouse seemed like a good idea for jury lunch break. The food was pretty good - I had the seafood gumbo and 1/2 shrimp po-boy lunch special. The gumbo was good but not really thick enough and needed more rice. The sandwich was great but a little small. For $20 I would have liked more food but what I did get was tasty.", "author": "Al W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-21", "description": "Went here for lunch  and I ordered a po boy and fried pickles. I did not dine in so this is based on take out only.  The service was pleasant and the fried chicken po boy was delicious.  The pickles were not my favorite. I will return because I like the quality of the food and the service was very pleasant. Also the value is very good for the money. One thing I dislike, intensely dislike is being put on a mailing list. I used my credit card to pay and all of a sudden I started receiving emails.  No bueno.", "author": "Cylantro D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "The Gumbo Bros was great, we showed up for dinner on a rainy night and hot gumbo and a shrimp po-boy were perfect. The service was fast and friendly. I liked that they had local beer on tap.", "author": "Amber W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "This is easily one of my favorite spots in all of NYC, nay, the world. Their gumbo is made meticulously, carefully, and deliciously. My fav is Nanny's Seafood Gumbo. It's definitely three fire emojis in terms of taste (that means it's fuego food for the uninformed). If you're unsure what to get, do yourself a favor and just get it. The Gumbo Bros also do phenomenal po'boys. The catfish is a staple here, but I prefer the roast beef. The second I put it into my mouth hole, I knew it was the one for me. Actually headed to the chapel now to get married to it. It's succulent, juicy, decadent, and super filling. \n\nMost importantly, the owners of this shop are all-around great guys. They care about their food and they sincerely care about their guest's experience. Come in for a drink, or stay around and kick it, either way, this spot is awesome. 10/10 would recommend for a tinder date here.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "***LOUISIANA NATIVE ALERT***\n\nAuthentic, quick, easy, and tasty. Food was what you'd expect from a top-notch Louisiana eatery. The gumbo was delicious, and I can't say enough about the poboy. If you've had 1,000 poboys or 0, you'll love it. It's either the perfect introduction or a crazy-good compliment to what has always been a Louisiana staple. \n\nWhether you're on vacation and just looking for a taste of home, or you find yourself in Brooklyn for an extended time--try this spot and I guarantee you'll enjoy yourself. \n\nGreat dranks too. Get the aptly named Big ass beer. Get drunk and eat a lot. \n\nAs my buddy Douglas \"Roux\" Harper used to say, \"best place this side of the neutral ground!\"", "author": "Big S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Great little spot here. Just be warned it's small, so you might not be able to grab a table. We got the Shrimp Poboy, fried green tomato poboy, potato salad and sauteed greens (a bag of zapps too of course). We picked up, but the beer selection looks great. I grew up in cajun country, and this is a nice taste of home. I think they're from Baton Rouge (hey nobody's perfect hehe).\n\nLooks like they have crawfish boil during crawfish season (March - May probably), every sunday. Definitely want to check that out.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Lunch special combos are a great deal! The shrimp po boy was very fresh and crispy. Very generous portions as well.", "author": "Mandy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "For les than $20 before tip, I was able to check out a cup of seafood gumbo a side of fried green tomatoes and a draft. Great affordable introduction to the Gumbo Brothers. I have a light to medium tolerance to heat. A cup was about all I could do for those heat averse.\nDefinitely worth another visit. Good value \u0026 cool folks working here.\nCheers,\nPhil", "author": "Phil W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "I had the shrimp po'boy and voodoo chips. I have never had a po'boy so I am not sure what it is supposed to be like. \n\nThe shrimp was heavily battered and fried, then placed in a soft toasted hero roll with lettuce, tomato and pickles. There was a bit of cream sauce but it was mild and I would have liked a bit more. The cashier suggested I get cocktail sauce on the side. I tried it without the sauce and it was a bit dry (the bread and batter were heavy). I added the cocktail sauce and it was tastier but still heavy (since the sauce is thick). I personally would have preferred more moisture so next time I will get more cream sauce added to the sandwich. \n\nThe voodoo chips were interesting. They were kind of like if salt and vinegar chips and bbq chips had a baby! Very different and intense flavor. \n\nFYI - This review is based on one meal, but I plan to go back and try the fried pickles and fried green tomatoes. \n\nSide note - the cashier was the sweetest guy ever!", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Came here on a late Friday afternoon after work and I have to say I love this place. Lets breakdown why\n1) Decor: The place is small but very welcoming with beautiful brick walls, New Orleans decor and beads hanging from the ceiling. \n2)Service: Our server was very personable and helpful. Alex and I split a Gumbo and she split it into two bowls before serving. \n3) The food: Of course none of that matters if the food isnt up to par and the food here is way above that. We got the aforementioned gumbo (it is The GUMBO bros after all) seafood version which was just perfect. Spicy and rich with chunks of crab and lovely shrimps throughout. We split a shrimp po'boy and unlike the now closed Cafe Boqoo they serve it traditional style. Wonderfully fried shrimp, lettuce, pickles, tomatoes and remoulade sauce. Simple elegance. No onion jam or other such silly stuff. \nThe fried pickles were as good a version as I have had. Crisp and not at all greasy with a great dipping sauce. Of course we saved room for the Banana pudding which was the best I have ever had. Chunks of banana and nilla wafers in the lusciously smooth pudding and delicious whipped cream. \n     The spot isnt far from our office and we are already planning our return to pick up for lunch. After putting pics on my Instagram several people commented that they will be going in and that makes me happy as I want these Bros to be around a long time.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "It's good! I got the roast beef po boy and my wife got the seafood gumbo. She loved the gumbo and the bites I had were tasty. I want to go back and get my own.\n\nMy roast beef was really good too, reminded me of a Chicago style Italian beef. Problem was the size to price ratio tho. Just filling enough, but tiny for a +$12 sandwich. Saw someone else here with the same complaint, but they suggested the restaurant include a bag of chips to supplement. Great idea! Would make me happier about the purchase.\n\nThink about it Gumbo Bro's...", "author": "Zack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "You can't go wrong with their gumbo. Thick, spicy, hearty, stick-to-your-ribs gumbo. A cup is generous, a bowl makes a very filling meal. Haven't had the po'boys yet because I keep ordering gumbo. Chicken and sausage is the best one (in my opinion). The fried pickles and fried green tomatoes are great sides. Not crazy about the rice and debris gravy, but I think it's just my personal preference for the gravy to be more sauce-like. \n\nThe restaurant is small and cute and the service is pretty friendly. Sometimes they have crawfish etouffee but I've never tried because they've always ran out by the time I got there. One of these days..", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "This place is no joke!  Really authentic Gumbo and Poboys, like it came directly from New Orleans.   French bread used for poboys is the difference maker.  Beers are cold and delicious as well.   Good tunes are usually playing as well which is a bonus.", "author": "Geoff W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Omg their seafood gumbo is AWESOME. I found a little piece of New Orleans in Brooklyn. If you are contemplating eating here... just do it!!!!", "author": "Beth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Yoooooo I think I found the perfect collard greens. Seriously... you don't even need hot sauce. These damn greens remind me of my grandmother's greens and that is ... that takes me back home to MIAMI and fond memories of my beloved Grandmother. I miss her. \n\nI tell you. This place must be on your twice a month good food choice list.  yes do it. The shrimp Po'boy is amazing. The greens.. HELLO!! And the Cajun potato salad... Yass mama. \n\nIt's also a cute midday date place. Yesss! Not to packed around 4 and you can talk and possibly make out. Yassssss boo boo. \n\nI'll be back and maybe with a date.", "author": "Jimmy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "I came here for lunch and had the seafood gumbo. The spice is great, the roux is very good (a tad salty for me, but it's gumbo and it should be). Lots of shrimp rounded out a great bowl of gumbo. They were cleaning the taps so I couldn't grab an Abita draft, sadly. The only thing I'd add is a piece of bread to mop up the remnants of gumbo left in my bowl! Good work Gumbo Bros", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "The only gumbo I'll eat outside of the south. Hot honey and roast beef po boys are great, too. Always have a great Abita beer and Zapp's chips selection. \n\nRecently ordered catering for the first time and they did not disappoint. Seafood and z'herbes gumbo were delicious. Ordered the jambalaya for the first time (both chicken and andouille and vegan vegetable). Both were fantastic and crowd favorites. \n\nThe staff is always friendly, knowledgeable and helpful. Thanks Adam, Clay, Kai and Ross!", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "The best New Orleans food in NYC. No joke. First of all the guy behind the counter is an angel. Good and friendly service really goes a long way. Had the fried chicken po boy, seafood gumbo with a side of cajun fries and cajun pickles. All super tasty and packed with flavors. The only one thing I will say is maybe a little on the salty side. I cant wait to be back to get another fried chicken po boy!!!", "author": "S.H. L."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}