{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Had a mix up with the delivery service but i ended having my food delivered by the guys themselves, with a bunch of free add-ons from their menu... \n\n Thank you guys, for taking care of me!", "author": "Royce M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Hearty gumbo. Nice seasoning and flavor. Could get a bowl or ten.", "author": "M W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Po boys were standard, nothing special. The gumbo was fantastic though. Unfortunately, ran out of crawfish Mac n cheese at the time.", "author": "Amit P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "As a native of New Orleans I had to check this place out.  So I had the catfish po boy and it hands down was one of the best po boy sandwiches that I ever had.  The bread was fresh and true French bread. It also had and excellent remoulade sauce which made the sandwich juicy.  So I decided to go back the next day to check out the Gumbo.\n\nNow the Gumbo gave a lot to be desired. It was not my mommas Gumbo. Nor was it mine as I make a mean Gumbo myself.  I did not like the seafood gumbo at all, nor did I like the chicken and sausage one, but it was better than the seafood one.  They should change the name to the Po Boy Bros because they got that right hands down.  But them Gumbo ummmm.... I don't think so.  \n\nSorry guys.  Great po boys though.", "author": "Toni B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "So we stumbled up on this cool place, trying to make our way to another well know food place in Brooklyn. Man o man, this place was super amazing. They have some great choices but let me just say I love seafood but the honey chicken po' boy was amazingly crunchious. OK, I know I just made that word up but who cares. It was everything. I initially didn't try the remoulade sauce on my sandwich but tried it because my mom put it on her fish po' boy. That sauce was sooooo lit. OMG. The fries were so good as was the okra. Next time I'm trying the gumbo. This place is super amazing.", "author": "Can P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Ordering a cup of hearty gumbo is necessary when you're in the neighborhood because it will warm your bones and soul right up. According to the staff, their Cajun chicken and sausage gumbo is their most popular seller and it's no wonder why. Classic combination of andouille and Cajun-spiced chicken evokes lunch by the bayou. Personally, I'm a fan of their seafood gumbo, filled with shrimp and crab. If you have room in your stomach left, they also offer various po' boys (I would recommend the crispy catfish!) and delicious sides.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Absolutely one of the best Cajun/Creole restaurants  I've eaten at. The fried shrimp Po boy was out of this world, service was fairly quick and I walked out of there knowing I was not going to be hungry for many hours", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Best gumbo I have ever had, no exaggeration. The spices are on point \u0026 owners are so friendly!", "author": "Amanda J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Greaaaaat customers service ! Personable staff ! I been meaning to come to this spot since my brother recommended it but never had the time, especially because I live pretty far from the area. BUT when I tell you that I was happy I had a doctor appointment and made it my business to swing by...Best decision ever ! I had the lunch special 1/2 shrimp po' boy with gumbo. DELICIOUS! The roast beef with shrimp on top  i think it was called surf and turf. The pickles is a nice touch on the sandwiches. But I will definitely be back ! I need to try the pudding", "author": "Nekemma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Damn, their seafood gumbo is so good and the portions are really generous!   Southern style in their hospitality with flavor that can't be beat.  PS I love that they use compostable bowls.", "author": "Alyssa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Great Gumbo, Louisiana root beer, and beignets. But the service is what made it. One of the beignets was a little doughy so they brought us 2 new orders and cards for free gumbo next time. 5 star customer service!", "author": "Alyssa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Amazing!  Had the shrimp and crab gumbo with a shrimp pot boy sandwich with a can of Rose.... PERFECTO", "author": "Janae W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I was in Cobble Hill looking for lunch and decided to stop into this place. I love trying places like this that have things that you cant find in excess everywhere else. I decided to get the shrimp po' boy. This sandwich was so lite, flaky and delicious. I didn't think that I would even be able to finish it but I did. The shrimp was crispy but not heavy or greasy. The sauce on top was flavorful. It was just an overall good choice. I left feeling fulfilled but not stuffed or heavy. I would really love to come  back and try the gumbo! This place is pretty small so Im not sure how crowded it can possibly get but this is a must try if you are in the area and you like ragin' cajun!", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "This spot was a magical find. \n\nI love gumbo. It's one of the most special dishes in America and so challenging to get right. \n\nWe tried all three- The seafood, the veggie and the meat based one. And all three of them had unique and distinct flavors and all three were delish. I think it is a little pricey, but I think it's super worth it. We went with the seafood and meat one and I left super, duper happy. \n\nI love that they have Zappo's chips on deck, too. So yummy. \n\nLove,\nRenee loves gumbo.", "author": "Renee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Being from Opelousas LA, I think I know something about good gumbo. This is( was ) really good gumbo! Down to the last Bay leaf. The roux was perfect and the consistency of the dish was just the way my father-in-law made it. Not too much solid to spoil the dish. \n\nWe also had crawfish mac'n cheese which was as good as you can make mac'n cheese taste. \n\nThe Bkln restaurant is very small so don't show up with more than a party of 6 unless you don't mind splitting up. I never have that prob as I don't have that many friends\n\nOverall a very good experience. \n\nCheers and Keep on Eating", "author": "Charlie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Eating a big bowl of the vegan gumbo and loving life!  Washing it down with Sixpoint on tap.  My first time here and impressed.  \n\nUpdate: When I originally reviewed, the only thing I didn't like was my utensils, glasses and bowls were plastic - I hate that for dine-in. They fixed the bowls - now they are heavy cardboard.  Thank you for changing them!!!", "author": "Margaret C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Best gumbo I've had in NYC. They were out of Mac n'cheese, so get there early if you want it. Fried green tomatoes were crunchy and tart, the way I like. Fried okra were okay, as were the beignets.", "author": "Nazeema B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Gumbo, po boys, and southern sides. It's a simple menu, but my goodness does the Gumbo Bros make everything really well. The gumbo is rich and full of spice, and the po boy fried goodness is also very well seasoned. Laissez les bons temps rouler!", "author": "Monte H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Best poboy I've ever had- and I'm from the south- been to NOLA-- this place knows what they are doing! The staff is incredibly nice, checked on us several times, they play good jams, and most importantly the food and prices are on point. \n\nWe got: seafood gumbo- packed with blue crab and shrimp! Delicious! \nShrimp poboy- yes. Yes. Yes. Tangy, crispy, excellent bread, excellent sandwich. \nFried pickles: this was good for the sourness but we could have skipped- they use sandwich sliced pickles- I prefer wedges. \nBeignets- yes! Delicious and fluffy and made to order!\n\nWe will come back! Honestly, if our wedding were going to be in NYC we would've had them cater it.\n\nStop looking at Yelp and go to Gumbo Bros immediately! You won't be disappointed.", "author": "Aleida K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "Don't know why this place has 4.5 stars. I know this place is new but the food here sucks!!! I ordered a seafood gumbo which was so disgusting NO flavor what's so ever and they put absolutely no salt. Don't claim you guys are the best if you can't even salt your food right!\nSo I also had the shrimp po boy that was $13 and nothing special flavorless rubbery shrimp inside a roll with a lil mayo and shredded lettuce.... this isn't what Cajun food is about. I could get a better sandwich at the corner bodega and it will be 10 times better. \nAlso it took like 15 mins to get our food which is prob already pre-made and not worth the wait. There were so many people waiting to get their food just to be disappointed. But it's ok you guys are new and adjusting. BUT at least put some salt in your food godammit or no one will be returning.\n\nAnyways this place ruined my night so I went over next door at Cobblestone to make up for it and thank god they didn't disappoint like this place did.", "author": "Sigma U."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}