{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "Finally checked this place out after debating for a while. The debate was whether i would like the menu options but gave it a chance so I went simple with the chicken \u0026 sausage gumbo in the cup size. \n\nThe gumbo was really good \u0026 tasty, and with a perfect amount of spice. It was actually really feeling \u0026 I believe my first time ever having it. Would definitely return to get me a po boy!!", "author": "M. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "The food actually impressed me. i didn't have high expectations because i still remember the deliciousness i had in new orleans. \n\nyou order upfront and pay when you order. when the food is ready, the cashier brings the food to your table. \nthere's not a huge amount of seating, but enough for approx 25 people. seems like they do a lot of takeout. it's cashless\n\nthe food\n- gumbo was solid; rich with a scoop of rice and four shrimp sitting at the bottom of the cup. i'm not a big gumbo person, but this was good and quite a lot for a cup! \n- oyster po'boy was my favorite; crunchy on the outside and soft plump briny deliciousness inside. there are a lot of tomatoes, but it works. the bread is soft so don't worry about cutting up your mouth. \n- catfish po'boy was also very good; the fish was juicy and the crust was crunchy\n- fried green tomatoes. these were fine, but you get a heavy oil taste eating these because there's nothing it mask it with. \n- boudin balls; second favorite item. shredded pork with rice which is deep fried and drizzled with hot honey. crunchy on the outside and hot inside. great textures and flavor. \n\n\nwould absolutely come back; great food!", "author": "Doris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "When you love everything New Orleans. but are so far away thennnnnn surprisingly enough, you find a piece of NOLA in your Borough. So yes, yes, y'all  the food couple had to make a trip on a cold night for some gumbo, Po' boys \u0026 extra good eats. \n\nUpon entering the establishment there were a few patrons dining and within minutes the crowd grew,  luckily we snagged a countertop table and were greeted by Tray, at the register/order area. Tray was friendly and answered a few of our menu questions. We easily made our selection,waited a few minutes and he brought our order to the table. \n\nWe ordered the Cajun potato salad not overly dressed and pretty good. The honey chicken Po' Boy was very good and large enough to share. We also ordered a cup of gumbo which is actually a nice size bowl, and great for the price. It had the right amount of warm and nasal clearing spicy kick. We also ordered sweet tea \u0026 an Abita root beer as for our beverages. Don't worry we did not overstuff ourselves we, packed the leftovers \u0026 made room for dessert. We ordered the beignets \u0026 Bourbon pecan pie. The beignets took me back to NOLA in spirit lol. The pecan pie although, small is completely shareable. \n\nVenue: if I had to guess this place may seat 15-20 people comfortably. Good for super casual in \u0026 out dining with a significant other or  just kicking it with friends. \n\nStaff: we only met Tray, and he was awesome! \nThe kitchen staff was pretty quick in bumping out our order.\n\nRestroom: clean \nDecor: Cute \nPrice: very reasonable $3-$20 \n\n\nGo get some good eats", "author": "Millie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "Beignets are not good without the powdered sugar. My order barely had any sugar on top, maybe because take out orders get less love? I ate right away once I got out of the shop so it was still hot but tasted like a fried flavorless dough. Disappointed because I was really looking forward to it!", "author": "Florence V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Came here during lunch time on a Wednesday with my dad and we were the only ones in there. I was a little skeptical because it was empty during lunch but we tried it anyway. The gumbo (cup size) was a meal itself! Very hearty and filling and the perfect amount of spicy. The fried tomatos were ok but not really worth $6. And the catfish poboy was also pretty good. There was a little too much sauce on it but otherwise not bad. Would go back for the gumbo! Also the girl who took our order was super friendly and welcoming.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "Gumbo Bros is a nice whole in the wall restaurant. Its a good place to choice from when walking down Atlantic avenue. I don't know much other places that offer New Orleans style food like this in Brooklyn.\n\nFoodwise they primarily serve Gumbo and Po-boys. The options for the Gumbo are fairly simple but offer seafood, non-seafood meat and vegetarian options. Po-boys have a wider variety of options to choice from though personally I prefer getting the Gumbo here more often. \n\nAnother thing I like about this place is they offer Louisianan beers on tap! The classic one to get here is the Purple Haze which is a raspberry wheat beer but they also offer scottish ale (around holidays,) IPA's, amber ales, etc. They are all on draft too which is very rare for these types of imported beers.\n\nThe place is fairly small but I have never seen it crowded before. The atmosphere is pretty hip and you can always get good seating here.\n\nOverall a pretty decent place to eat at. If I have any suggestions about this place is to visit their booth when the Atlantic Antic Festival is happening since I have seen them barbecue a real alligator and serve alligator Gumbo!", "author": "Cory B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Such an authentic experience felt as if I was in Nola again. I had the Spicy Honey Chicken Po-Boy.", "author": "Terrence U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-11", "description": "Pass by on my way from Trader Joe's and was hungry.  The lunch special sounded enticing, 1/2 Po'Boy sandwich, with gumbo for $13.99.  Hubby ordered the shrimp po'boy and seafood gumbo ( recommended by the counter person) I want to switch it up so I got roast beef po'boy and chicken gumbo.  The seafood is much better but not as good as those in Nawlin.  That being said it was good enough for Brooklyn.  The lunch was filling for its size so no complaints there but not a place i would go out of my way for it but if I am in the nab I will.", "author": "Adeline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "This place is legit!  Shout out to Peter D. for recommending Gumbo Bros.!  There were so many delicious items on the menu that we wanted to try as many items as we could!  So...8 of us dined family style;  trying the below items.   My only disappointment was that they no longer serve the crawfish mac 'n cheese;  however, we got to try their fried okra in their place.  It did not disappoint!\n\nI loved the vibe and decorations in this restaurant (even their restrooms!).  Service was very friendly and excellent; although note that this is not a waiter service restaurant - you order and pay at the register, and when your food is ready, they'll bring it to your table.  Complimentary jug of water/cups provided for self-service.   \n\nRegrets: we didn't leave room for dessert!  They have lots of tempting desserts!!  Next time!  :)\n\nMenu for the night:\n~ Gumbo:  4 of us had the seafood and 4 of us had the chicken \u0026 sausage.  Everyone seemed to like their gumbo.  I had the seafood and thought it was a tad bit too salty.  I'd love to try the chicken \u0026 sausage next time!\n~ Catfish Po:boy:  my fav dish of the night!  It was just delicious.  Fresh bread and fried catfish cooked to perfection.  Very satisfying dish!\n~ Fried green tomatoes:  this was good, although some slices of tomatoes were sliced way too thick.  The thinner slices were SO MUCH better.\n~ Fried Okra:  I\"m usually not a huge fan of okra, but this was very good!  I'd order it again.\n\nLooking forward to a return visit and trying their Oyster Po'boy and Gator po'boy (whenever they're in season).", "author": "Andie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "I ain't mad at this place! Pretty good selection of po'boys. I prefer the fried shrimp over the fried catfish. It's slightly more seasoned. The fried okra was a good treat too. Their gumbo has a kick to it so if you can't handle spicy, then don't pick it. \n\nps - it's a first come seating system. Great for small groups and a quick bite if you're in the neighborhood.", "author": "Daisy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Love their shrimp and catfish poboys. I recently went to New Orleans and, dare I say it...... these poboys were better than some I had there. Oh and when they buss out the crawfish, I feel like I'm in NOLA and I love it!! Great addition to BK.", "author": "Cristina O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Had to come back literally a day after I was here for an event! \n\nPo boy shrimp sandwich is everything! Literally best fried shrimp I've had- super fresh, big and cooked to perfection! yum\n\nFried chicken po boy is hands down the best fried chicken sandwich Ive had. Its made out of dark meat which makes it extra juicy and its just crispy and tender at the same time oh my god. Comes on a white hero with mayo, lettuce and tomato! divine!\n\nI love cajun food and its probably the best I've tried in the city - from the jumbo, to the poboy to the fried oysters!\n\nThe staff is super nice and friendly and I've been told they have crawfish boils during the spring! coming for sure! \n\nWill be returning again real soon!", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "The best Gumbo in Brooklyn!! \n\nThese guys are legit and are from Louisiana and Alabama; they know gumbo!! \n\nI would opt for the seafood gumbo!! The recipe is a family tradition that incorporates a rich roux and a nice variety (quantity) of seafood. They also offer some great poboys too!! \n\nYou can even snag some quality Louisiana beers and watch LSU games!! \n\nOverall: love this place and I'm glad we have real Louisiana fare in BK!!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "I was really excited about this place. I love cajun food! I actually waited to go to this place for about a year just so I could go with a friend who lives out of NY. I was disappointed for sure. \n\nStaff- 3.5 stars, she was kinda blah but it also seemed as though she was having a sh!tty day, we can closer to closing.\n\nFood- 2.5-3 stars, I ordered a Po-boy sandwich with mac and cheese on the side. My first, most pressing issue and irritation was that the bread was super stale. I understand that we came later in the day but I don't think that's an excuse really. The fish itself was cooked well and nice and crispy ower it was a bit under seasoned for my happiness. The mac and cheese was lukewarm, again not sure if it was because we came later in the evening, and I was also underwhelmed the seasoning.\n\nMy biggest disappointment?! THE GUMBO! I ordered a cup to go and planned to eat at work the next day. I made it home and decided I needed to eat sooner lol. I  reheated it in the microwave for ONE MINUTE and 30 SECONDS. I took it out and had a sip. Yum! I was very excited. I took my spoon and stirred it up and all of a sudden EVERYTHING tasted burned. My sadness was deep, I may have shed a tear on the inside. I know an argument can be made that my microwave caused the taste but I obviously disagree.\n\nI hope to try this place again and have a better ecperience.", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "My friend and I came here during a drunken night of debauchery at her recommendation. I had the shrimp Po boy as well as the fried green tomatoes. The fried green tomatoes were wonderful, the coating was crunchy a deep brown, the tomatoes juicy. The shrimp Po boy was also wonderful, the shrimp were a nice size, and the bread was crispy. The sandwich was too big for me to eat myself and I shared it with my friend. Ten out of ten, would visit again.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-02", "description": "I really wanted to like this place, I truly did. The employee behind the register was so sweet, I swear he was the world's nicest guy, but honey let me tell you in the most southern way possible.... bless their hearts, but this here ain't no nola gumbo!  \nThe consistency was thin like soup and dark like a cooked roux with specks of burnt-ness.  It was obviously some type of processed ingredients made with salted butter resulting in that odd tasting liquid base.  The rice was not even fully cooked!  The beignets were fried biscuit dough, yes, heavy, salty (again with the salted butter) biscuit dough. I was starving and noticed all of this.  The only thing that tasted ok was the coffee and the zapps chips. I know where I can have a lil chicory coffee and chips, but lord knows that's it. I will stick to cooking gumbo at home and when I visit Louisiana.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "I'm really glad that I now know of somewhere good to eat near the movie theater.  I always considered the Court Street area a place to be filled with run of the mill franchises, so I've considered myself smart to not come to the movies hungry.  (Which is still a smart thing to do.)\n\nThis is my first time back since attending a Yelp event here.  It's just as cozy and inviting as I remembered.  I got the shrimp gumbo in the small size.  Makes a good app or small meal if you're not starving.  Came with 4 juicy shrimp in a sea of wonderfully spiced gumbo, the kind of flavor I haven't seemed to get anywhere else yet.  \nOthers around me had gotten the large which seems to come in a huge bowl.  I'm also happy to see that the Peachy Pig has made it to the menu as I remember it to be quite delicious.\n\nNow that I'm in this area more frequently than I thought I'd be, I'm glad I have somewhere to go and recommend!", "author": "Natisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Visited NOLA not too long ago and the Gumbo Bros might be better!! The Green tomato Po boy is perfect for vegetarians! We also ordered the honey fried chicken, shrimp, and beef Po boys and they were all spectacular. The bread was on point, it didn't overwhelm the sandwich. \nThe restaurant itself is rustic and quaint. The staff are wonderfully friendly. I will definitely be visiting after work!", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "My friends and I happened to be in Brooklyn Heights area on a rainy day and craved for something warm and spicy, so we went to The Gumbo Bros. The portion is smaller than it looks, for the price that they charge. The large portion is almost twice the price, but I don't think it's much more than the smaller one. We ordered \n\n- Chicken and Sausage Gumbo $6.50\n- Seafood Gumbo $7.50 \n\nBoth Gumbos have the same taste: salty and spicy. I prefer the seafood one because the Gumbo already tastes so salty, and adding sausage in it only increases its saltiness level. Each Gumbo also come with a tiny scoop of rice. If you come hungry, you need to order more than 1 dish. \n\nMy friend also ordered the Gumbo and some kind of fried balls with meat and rice, which was good.", "author": "Vinny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "Creole heaven! So. Good. Fried shrimp po'boy, gumbo, fried okra, \u0026 beignets were all stellar! Get an Abita strawberry with it or a local soda! So good. Also best crawfish north of New Orleans - go on a Sunday and experience that", "author": "Jonathan W."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}