{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "I love this place! The lunch special which is half a po boy sandwich and small gumbo with rice.  Its definitely filling for lunch and even for dinner.  The chicken and sausage gumbo is great with the hint of heat that hits you after you taste it.  Its homemade and I have been 5 times and havent had a bad batch.  Everyone has there own way of making gumbo with different ingredients etc. This one is stellar! The shrimp po boy is full of large to jumbo shrimp and the bread is not regular New York hero bread.  Its the bread for the po boy shipped from New Orleans. The There are a few tables to eat in.  The staff is welcoming.  Very kool dudes.  Always will stop in when I havr a urge for a po boy and some gumbo.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-26", "description": "The catfish po boy was disgusting and gave me a stomach ache. The fish was soggy and tasteless which negated any decent experience I've ever had with them.", "author": "Marz D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Let me start off by saying that as far as fried seafood sandwiches go, they are the only game in town that I'm familiar with. I'm from Baton Rouge, and I really like the food. That being said, if I may offer one point of  constructive criticism with regard to the gumbos and red beans and rice: I like to spice up my own food with my favorite sauces. But these dishes come so heavily spiced, that not only do I not want to spice them more, but the spice level is borderline unenjoyable for me. I dont think that your food has to be super spicy to be authentic cajun. I'd tone the hotness down and let people decide for themselves if and in what way they want to spice it up further. I still eat it though.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Great food. Great service. Cat fish is fire! Chicken and shrimp gumbo hit the spot too. Definitely recommend. The owner overheard the conversation we had about the food and threw in some extras for us. I will definitely stop in next time I'm in Brooklyn.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I've been twice and my high expectations of Nawlins' cuisine were met both times. Menu is simple: 3 types of gumbo - meat/ seafood/herbs, 4 types of poboys and sides. They usually have a couple specials (savory or sweets). Even vegetarians can get their fix here.  Pay at the counter and food is served 5 to 10 minutes later. Aaaaaaaand they sell the largest variety of Zapp's I've ever seen.  I really dig this spot.", "author": "Adria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "Do not go here for the gumbo. Go for the catfish po-boy. Those are really done well there. If you know what New Orleans gumbo really is, this gumbo is a disappointment.", "author": "Elliot L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "My heart began to pitter patter when I realized a nawlins eatery was now open in Cobble Hill. I'd like to come during lunch to take advantage of the gumbo bowl and half po-boy for $12. I ended up getting a whole scrimp po'boy sammich and a cup of seafood gumbo regardless. I really like the bread they use as it has an awesome outer crunch and moist yet crispy whole shrimp throughout. It was good, not mind blowing but very tasty. I'd really like to try their roast beef po'boys next time (Oh you lovely debris, come to daddy). Now lets talk gumbo.....freaking ridiculously flavorful, succulent, amazing seafood gumbo. I want more, like right now. I find it hard to imagine if I'm ever walking by Gumbo bros, and I'm even slightly hungry to not stop in for a cup of gumbo. If I were in the hospital, I'd have them pump it through my veins to bring me back to life. Shoot, I think it would give me super powers!...or a heart attack. Worth. The. Risk.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "More like 4.5 stars the shrimp bo boy was amazing I thought they would be cheap on the shrimp but hearty portion fried to perfection and just the right fixings! The bread was spot on too! Will come back soon", "author": "Denise B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Okay so i'm from Louisiana, I was really excited to find this place in Brooklyn while shopping on this beautiful day. So my friend and i ordered separately, with the intent to share. I ordered the shrimp p.o. boy, along with the cajun fries. My friend ordered the soft crab po boy with fried okra. I'm going to start with the sides, the cajun fries and fried okra were excellent. He fries were crispy and well seasoned. The okra was just right, fried to perfection and the breading was delicious! On to the Po Boys, so we each have each other a half of one. My shrimp Po boy was pretty good, but i felt like it was missing something in the seasoning, it was almost there but not quite. The soft crab po boy was a disappointment it tasted over cooked and unseasoned, there was absolutely no flavor to the soft crab po boy. The bread was just right on the Po boys, just soft enough but still crispy, super important part of the sandwich. The dressings were also not too heavy and just enough. Overall it is a small interior, so seating is limited during peak hours but it is very cute. Loved all the Louisiana culture, the newspaper clippings and the LSU memorabilia. Made me feel at home. Another big bonus was that all around the restaurant whether the back of the menu or the big chalk board, they had pictures of exactly where your food was sourced from and i LOVED that! I wish more places took note and did the same. I would go back, maybe next time to try the gumbo, or the red beans and rice. GEAUX TIGERS!", "author": "Channing W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Great spot with a unique vibe. I had a draft beer while I waited with my friend for our order to be prepared. The staff was very friendly and conversational, too. I was a little disappointed by the small amount of fish on my catfish poboy, but that sandwich was still pretty good. The prices are a bit high for the portion size. I would recommend stopping in for the seafood gumbo.", "author": "Mitchell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "First time visit today. Good food. Good service. PoBoy was on point and seafood gumbo was really good. Will def return.", "author": "Damon J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "The food is great! I recommend for sure! I never had a Po Boy before, so I picked a great place for my first one.", "author": "Noey V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "So, I've never been to New Orleans sadly. But I've eaten gumbo before and I had heard how amazing the gumbo is here. I came in for a quick bite and ordered the chicken gumbo and fried pickles. The gumbo was %^\u0026\u0026%*^%!!!!! So delicious with lots of andouille sausage and okra. Added a little Crystal hot sauce for heat and I was a happy girl. The rice in the gumbo was so creamy and made it even better. The fried pickles were crispy and hot! definitely go!", "author": "Holly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Yum. Don't miss this place for a quick lunch. As a vegetarian I was so glad to see that there was a vegan option! Great for the price. The place is small so just be aware!", "author": "Sara E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Grew up in south Louisiana \u0026 the food \u0026 experience here was AMAZING! Definitely would recommend! Po'boys were excellent!!!", "author": "Abby B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "When I walked into The Gumbo Bros and saw that 1950's era Billy Cannon LSU football helmet hanging on the wall and the George Rodrigue - Blue Dog print, I had a good feeling this place was going to be legit.  I was right - this place reached into the heart of a coonass. \n\nBefore The Gumbo Bros, the only other place in NYC that had legit gumbo was Dizzy's Club at the Time Warner Center, although that requires you to drop some $$ to see a jazz show.\n\nOn this day, we had the classic chicken and sausage and the seafood gumbo.  It was a little pricey for what I would normally expect ($28 after tax), but I guess that's part of being in NYC.  The spicing in each were different, but both gumbos have that ditchwater dark roux that you were looking for.\nThe seafood gumbo had more of a rosemary? spice flavor in it.  For the chicken and sausage gumbo, although the andouille sausage chunks were got cut up real small, the chicken was shredded just right.  Both had the depth of flavor one would expect when you slow cook the trinity in the pot.  Additionally each came with a medium-ish sized scoop of rice.  \n\nThe great part is that they also sell some Zapp's kettle cooked potato chips.  Although I didn't get any, you should opt for the red bag Cajuncrawtators.  The best.\n\nI also love that all of their bowls and utensils are compostable/recyclable.  One minor update, I think the gumbo eating experience would be augmented if they used a less wide bowl, but a deeper bowl.  The bowl dimensions made it feel a little like it was a plate of gumbo instead of a bowl.  \n\nOverall, a very solid place and I will be back.  To the Gumbo Bros, GEAUX TIGERS, and can ya'll partner with Legend's during LSU football fall Saturdays in NYC?", "author": "Kyle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Stopped in here on a whim, and I'm so happy I did because it's such a great find. Both the gumbo and shrimp po boy were amazing. Seriously one of the best po boys I've ever had! And who can pass up beignets?\n\nI don't live anywhere near this place and I already know I'll be making the trek to get my hands on these po boys more times than I'd like to admit.", "author": "Becky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Excellent catfish Po boy \nSolid chicken gumbo\nSeafood Gumbo pretty whatever \nFriendly service\nThey should play NoLa style music instead of whatever hipster crap they were playing when I was there. Would be more fitting.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Awesome catfish po-boy and friendly staff. Great addition to the neighborhood. Will definitely be back.", "author": "Andrey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I am from NH so what do I know but this place seems very authentic. in any event I like the food", "author": "John M."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}