{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Absolutely fantastic and authentic New Orleans Gumbo. The flavors are wonderful. The staff is extremely hospitable. \nI came to their one year anniversary party and they shared beers, laughs and great stories. Great owners and awesome atmosphere. \nThey sell their gumbo in large party portions so will definitely be ordering some for future tailgates. \nBeware the veggie chili is a bit spicy but they were nice enough to give my wife some extra rice. \nWe even ordered beignets and they were delicious too. Will definitely be back.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "The place was small and cute, and staff was super sweet and patient.  We ordered the shrimp and catfish po boy, and they were ok good consider the hefty price.  The bread was pretty on point though!The chicken and sausage gumbo was disappointing because it was too salty too dark and tasted too smoky.  I lived in Louisiana for almost 10 years so I am bummed that this place ain't IT.  Maybe I went on an off day?", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Coming from the South, I have to admit I was pleasantly surprised that this place actually turned out pretty legit.\n\nI dropped in for a quick lunch, and got the shrimp po-boy and the chicken\u0026sausage gumbo. Both were excellent. The po-boy had decent size shrimp, great crispy exterior, and came out nice and warm - but the unsung hero was that bread: damn, that bread on that sandwich was so good. Perfectly toasted, and soft. The chicken\u0026sausage gumbo was delicious - served piping hot, thick and rich, with a nice spicy kick from that sausage. All of this was washed down with Abita root beer that they had on tap (no alcohol at the moment).\n\nMy hope for the future is that they start serving boudin - now that's one food I have not seen much of since I moved to NY.\n\nFor those looking for some authentic Louisiana cooking, definitely need to drop by this place!", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "So let's not get started on how awesome the staff is but the gumbo is amazing. My husband and I enjoy the convenience of having a slice of Louisiana in the heart of Brooklyn. If you ever feel for a fresh taste of gumbo or po'boys check them out for sure. My advice? Try out their lunch special so you get a full treat for a fair price. Love you guys!!", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Saturday afternoon around 1pm and there was business, but not the crazy line waiting experience.  Staff was very friendly and helpful.\n\nWe ordered the vegetarian gumbo and the catfish po' boy.  Both were above our expectations in flavors and quality of ingredients- so good!  \n\nPrice point is fair for the food but on the higher side for the dining experience.  Overall a great meal - and a true gem with a unique offering to the area!", "author": "Ignatius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "I like po boys. I like gumbo. And I like The Gumbo Bros because they do both well.\n\nI had the shrimp po boy, which was stuffed to the brim with crispy breaded shrimp, and topped with shredded lettuce, tomato and mayo. It was a really big sandwich that I turned into two meals, especially with the cup of gumbo I also got.\n\nThe chicken and sausage gumbo was super filling. Shredded chicken, andouille sausage with some kick to it, and a ladle of rice. A cup is enough to make a meal, but my fat ass could definitely have eaten a full bowl.\n\nService was quick, and the staff was friendly. The bathroom also has some of the coolest wallpaper. Good times all around.\n\nOh, and they also have a surf and turf po boy that's not listed on their website or regular menu. It's roast beef and shrimp. Will have to give that a shot next time I stop by!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Mmmm, yes, this is probably the closest you're going to get to authentic gumbo outside of New Orleans. \n\nThe space is small, fast casual in vibe. They have the most Brooklyn wallpaper I've ever seen. Service was Southern-level friendly. \n\nThe chicken and sausage gumbo is the strongest choice on the menu. Complex flavors, tender meat, warm, served with rice. Really hits the spot when you have a gumbo craving!\n\nNanny's Seafood Gumbo is solid but I wouldn't come out of my way for it. The shrimp and blue crab were very fresh and nicely cooked.\n\nI would skip the vegetable gumbo all together. I've never had one prior to coming here, but the flavors and the texture were just not working for me, everything looked and tasted \"green\". \n\nAll the gumbos have okra. Yum yum yum. They get their po-boy bread shipped in from NOLA- get some to dip into your gumbo! They serve Abita Root Beer.", "author": "Luci B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "This is AN AMAZING PLACE ! Great portion sizes and taste. A \"cup of Gumbo\" is very big and fills you up. The fried pickles are to die for. I would definitely come here a million times over.", "author": "Tyler F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Gumbo Bros has never had an actual spot. They've been on the food truck/holiday market scene for a bit but this spot just opened and THANK GOD.\n\nThis gumbo is legit. Like, this is the real deal good stuff.\n\nRoux base\nveggies and spices (no 'fillers' like celery or bell pepper- because that ain't real gumbo.)\nOKRA (because that IS real gumbo)\nchoice of crab/shrimp or sausage/chicken.\n\nTwo sizes, the larger size lasted me three meals. \n\nAt their new shop, you can indulge in fries, potato salad, chips, and other sides. They also have freshly made mini-pies for dessert (get the pecan. $4)\n\nThese bros know what they're doing when it comes to this southern dish. So glad I can go visit year round! Go, go, go.", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "I had high hopes for this place cuz of their high rating on Yelp!, but The Gumbo Bros has left a lot be desired. I mean the food was excellent, and the place was clean and all. I really enjoyed the seafood gumbo, but can a large order have a bigger portion? I mean if I'm going to spend $14 (+ $3 for root beer) on lunch, I should leave your place stuffed! The food needs to more plentiful! Give me more rice or a couple more shrimp. Something! $37 for lunch for two was a tad high. \n\nAnyway, I'm still hungry, now I need to look for another place to eat! Thanks BRUH!", "author": "Jedsada Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "This is my new spot when I need a dose of home. Gumbo. Poboys. Potato Salad. Crawfish Mac n Cheese. And dare I say it: Boiled Crawfish complete with all the fixins of potatoes, corn, smoked sausage and mushrooms!!! And the crawfish boil seasoning was LIT AF. \n\nI thought I was back on the bayou and my uncles had been firing up the outdoor crawfish pot after eating just one tail and suckin one head. WTAF??? Add good beer and wine and I'm planning at least monthly visits. \n\nAs me and my other half, along with my little sister also from NOLA, pigged out basically ordering one of everything on the reasonably-prices Creole-Cajun fare menu, we kept saying: \"somebody in this joint is either from back home or spent some time there.\" There's just no way to get congruent flavor like this. And sure enough, Clay, one of the brothers, is. He was super cool as we lauded his spot and his diamond staff. \n\nHe was southern warmth all over the place and was ultra gracious. He cracked a few jokes that made me even more comfortable like we've been long lost family. So he's now my adopted cousin. \n\nGumbo Brothers has a gem. They've got the best people, with the best skill, in the right place doing some good *ss food. I'm looking forward to meeting more NY transplants from Louisiana right in this Brooklyn spot.", "author": "Reina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Awesome food, even better service.  This is a great unique place for lunch!  I highly recommend.\n\nFood: We had a few cups of gumbo and the shrimp po'boy.  Come around lunch (before 4pm) and you can snag a gumbo bowl and half po'boy for $12!  The po'boy was tasty - the bread had the perfect flaky bite and the breaded shrimp was crisped so well.  The gumbo is good too.  The seafood gumbo is quite spicy if you can't take the heat.\n\nSpace: it's an arrow restaurant with 5-6 tables.  You order at the front and take it back to your table. \n\nService: the guys there are super nice and friendly.  They made an effort to make sure we were enjoying the food!  They also knew most of the patrons so it felt like a neighborhood joint.  No complaints here!\n\nDefinitely will return!", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Say what? A New Orleans joint just moved in down the street? And damn is it good.\n\nI lived in NOLA for four years (and I go back on a regular basis), and this chicken and sausage gumbo is legitimately one of the best I've ever had. No joke. \n\nI honestly don't know why you think I'd joke about something as serious as gumbo anyway. Gumbo is no laughing matter. For a certainty, the Gumbo Bros' two hour roux is SERIOUS. Get a bowl of this stuff, and it'll be bursting with so much flavor and spice that you'll barely be able to stop eating it long enough to thank me. \n\nIf you know what it means to miss New Orleans (and for some reason you don't want want to get the best gumbo of your life), they've also got chicory coffee and Abita on tap, Zapp's (the best chips in existence), Crystal hot sauce to put on everything (they have Tabasco for those of you with no taste), and good po' boys (dressed, obviously) on Leidenheimer bread that they get shipped up from the south.\n\nMy only complaints? \n\n1. I'd appreciate a little lagniappe (in the form of Zapp's Spicy Cajun Crawtators) thrown in with the po' boys ($13 for shrimp) which are just short of being a full meal for my fat ass.\n\n2. Even when you're dining in, they serve the gumbo in a disposable plastic container. This bothers me a bit, as I spend a solid amount of time on the weekends hugging trees (read: this bothers my wife a lot, and that means it bothers me too).\n\nBut neither of those will stop me from regularly indulging in some serious gumbo this winter and beyond.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "So I have a pass from a museum in another part of the country that gets me into certain other museums for free.  My goal for the day was thus the NYC Transit Museum, which is in an old subway station in this part of Brooklyn.  Prior to my visit, I checked Yelp for a lunch suggestion and walked around the corner to Gumbo Brothers.  Yes!\n\nI had learned my lesson at another place to slow down with the menus and I'm glad I did...and thus noticed the greens available as a side.  I first ordered a fried green tomato po'boy and the greens, but tomatoes green fried they did not have.  So I got the catfish po'boy instead.  And the greens.  Of course.  Must have greens.  Greens.  Greens.  Greens.\n\nFirst, the greens were everything I'd hoped for.  Flavorful, not too salty, deep but not too meaty, not tough but not too soft.  Yum yum yum.\n\nThe sandwich was also awesome.  Write home awesome.  If I was a good girl, I would have written this review immediately afterwards but I wasn't and I'd packed light and I didn't want to type it on my phone.  So now I lack intelligence and detail in this review.\n\nI wished I had room for pie.", "author": "Carrie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "This place decor is what really had me I loved it.The food was ok,I was thinking it would of been a lil more flavorful but that's just me.I rated the place four stars because the staff was awesome.My co worker and I came for lunch.The cashier was very helpful and patient being that it was our first time.Food came out rather quickly and it was served to us since we dined in.Only complaint I have is why is the chair stools and picnic table so low.I am not too tall but I am not short either sitting to low I wasn't feeling.", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "They have Gumbo (obviously) and Po Boys right now, though they have a few other things they'll be adding eventually, like some sides.\n\nI tried a Roast Beef Po Boy which was ready suspiciously quickly and was just ok ($12). Maybe the catfish will be better. Or maybe it's really just about the Gumbo.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "I love this place!! Everything tastes so good. I recommend everything I've had! Great gumbo! Great po boys!! They have a very affordable week day lunch special.\nI feel like there are so many options on Atlantic, Court, and Smith- it can be overwhelming! And I feel like it's easy to be disappointed. So this is a sure fire GO TO spot that you can definitely count on, and that's really nice!!\nHere's a picture of our food. But it's almost gone! Because it's so good!", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "The bests gumbo in NYC with a chocolate colored rue along with a shrimp po-boy on really great Leidenheimer bread from Louisiana.  You can go wrong in this tiny joint if you are craving food from the bayou in NYC. \n\nCounter service was friendly and time to table was under 15 minutes with 8 other customers in the restaurant. \n\nLunch for two before tip: $40\nTotal Dining Time: 45 minutes", "author": "Kelly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I say this again and again - I love supporting local business and when the product is great it makes supporting the business an absolute joy.\n\nThe shrimp po boy is DELICIOUS. It's my favorite fried shrimp sandwich probably in Brooklyn. \n\nThe roast beef is also delicious. I'm not a big red meat eater but I almost always trade half of my shrimp sandwich for half of my husbands roast beef - it's a great trade!\n\nThe seafood gumbo hits the spot when you're craving some southern comfort and the banana pudding was so decadent and tasty.\n\nNeedless to say, I would highly highly recommend them. Can you tell? :)", "author": "Amber E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "Great gumbo and po boys. Try the shrimp po boy, which is loaded with perfectly cooked fried shrimp. Really love that this place is in the neighborhood!", "author": "Andrew L."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}