{"aggregateRating": {"reviewCount": 280, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I loved the food!!! This place is a must visit. The crawfish Mac n cheese was phenomenal. The seafood gumbo was unforgettable. I will bring friends next time!", "author": "Nia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "My first visit here was great! Try the friend green tomato poboy, it's amazing. I had that with the mac and cheese and an Abita beer - perfect dinner!", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "I just finished eating the shrimp po'boy and I will say it is pretty tasty.  Good sauce and toppings are well-balanced.  However, for $13 there should have been more shrimp on the sandwich.  I realize we are in (now expensive) Brooklyn, and that shrimp isn't cheap, but this will not be a go-to lunch spot at these prices.  \n\nPerhaps if they threw in a small side, or even a bag of chips with the sandwich, it could justify the price.  But the sandwich did taste good.", "author": "Tene W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Warm \u0026 friendly  hole-in-the-wall sanctuary serving southern-Louisiana comfort food - delicious po-boys made with the right NOLA bread buns and (as promised)  tasty hot fresh gumbo in three or more daily varieties at very reasonable prices. All this plus $5 Albitas and Gansetts and reliably excellent gumbo-infused music. Best lunch spot in Boerum Hill.", "author": "Bill O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Fantastic Po' Boys! Add Fried Pickles, Braised Greens and Potato Salad on the side! Loved it.", "author": "Christian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Gumbo is truly excellent, so is rice and debris (rare find) and beignets.  All the way i recall it tasting in the quarter.  They cook it right there so it might take a little bit, usually comes out quick enough for me.  For those giving fewer stars, can you tell me who in NYC has better gumbo?", "author": "Chilly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "The seafood gumbo was on point. Plenty of heat. Shrimp po boy was tasty, don't skip the hot sauce though. Wish we had tried the crawfish mac.", "author": "Ango G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Absolutely perfect shrimp po boys. Perfect spice, bread is shipped from NOLA, doesn't get any better. Reminds me of home. Check this spot out!", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Flavor in the Chicken/Sausage was good, but was warm/luke-warm when received in the store.", "author": "Joshua W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Ok, so NOLA flavors came to Downtown BK. I had shrimp po boys in NOLA, but Gumbo Bros, do it better. Oh man, a solid sandwich, delish more shrimp for your buck, not a bread with pieces of shrimps like some po boys I had in the Crescent City. This place makes the po boys mighty fine. Next time I will try the Gumbo. I wish they make a gator po boys, but is an acquired taste. I love this place, and the street sign tile on the floor (Atlantic Ave), surely reminded me of places on Bourbon Street. Gumbo Bros, you're doing it well.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "Gumbo Bros is a good concept, poorly executed.  When we arrived, the place was not packed.  However, the person at the register for some reason didn't take down our full order.  The food we did get was expensive, did not resemble the marketing photo, and was served in very small portions.  Half an hour later, the rest of our food was still not ready (we only found out we weren't getting all our food only after we asked).  This happened to another party who ordered but didn't get everything they asked for.  The staff didn't apologize and we ended up leaving.  Would not recommend until management tightens up operations.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I am so excited to welcome this new gem to the neighborhood! Just went in and picked up a quart of their chicken and sausage gumbo, potato salad and greens to go and it was AMAZING!!! Cannot wait to make this a regular goto spot!", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "I'm not an expert, but I travel to New Orleans every year and the gumbo here is as good as any I've ever had outside Louisiana. I'm looking forward to trying a po boy next time.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "As a NOLA native that went to LSU and lives in Brooklyn I am super happy about this place. I've had takeout a couple times but was extremely impressed with my delivery via TryCaviar. So the shrimp Poboy is the best I've had in nyc. Not only full of shrimp but the bread is incredibly fresh and not too hard. The Seafood Gumbo was good..full of shrimp n Crab. The roux was that great dark roux that a lot of places try here and fail at. The lady that delivered my food was super friendly and even apologized for being stuck in traffic that I hadn't even noticed.", "author": "Akua A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Been twice so far for seafood gumbo and shrimp po'boy. Yum city. Beignets (daily special) were not so good as to have me mistaking the place for Cafe Du Monde, but I do wish they were available every day.", "author": "Andy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Food was superb, 4 stars only because the side order of fried pickles was minature sized and meal was a bit pricey ( 20 dollars for sandwich, 1 side and a bottle of water). Shrimp po boy was fresh and tasty.  Will be back for more", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Belly pleasing Seafood gumbo and Catfish Po-boy just hit the spot on a cold wet rainy evening.  The gumbo was tasty, spiced perfectly, just thick enough from the okra and came with perfect shrimps and just a dab of rice to pull it all together with the sprinkle of green onion.  The closest gumbo I've ever had anywhere to the ones in New Orleans.  The catfish was sweet with a crunchy corn meal crust and without the slightest hint of oil. \n\nI will be back as soon as possible to try the other 2 gumbos, sandwiches and sides! \n\nDon't hesitate to try this place out.  It's right near Trader Joe's and you know every time you go shopping there you get hungry!", "author": "Conni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Just an update after more visits. Do try the nanner puddin. could use a few more nilla wafers, but that's a personal preference. delish!", "author": "James W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "They're over priced with small portions. You're dining in and eating out of and from take out containers and plastic silverware. I don't find the food to be anything more then mediocre in which they don't even fill up the container for the money they're charging.  I tried it because of the reviews but so not worth it.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Great cozy little place. Owners obviously care  about the decor being authentic New Orleans. The gumbo, and catfish sandwich was great.", "author": "Scott M."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "The Gumbo Bros", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "224 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggYBxs0EFewZXeOZMCKYcA/ls.jpg", "@type": "Restaurant", "telephone": "+19179091471"}