{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "The name of this place says it all!! They \"ACED\" it!! This place is what Brooklyn has been waiting for when it comes to Thai food. Friendly service, fresh ingredients. Food hits your table hot and ready and delicious.\n\nBest crispy duck I have had in awhile.", "author": "Ricardo F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Delicious dinner and stellar service at ACE Thai Kitchen in downtown Brooklyn, NY. Plus it has a sweet atmosphere.  \n\nI asked for a special favor...they made me a Yum Tom soup with chicken, noodles, and extra vegetables. Soooo good!!", "author": "Bambi Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-15", "description": "Their delivery is always fast and accurate. The food does the job. I always order the pineapple fried rice and the consistency is always there. \n\nI've never ordered anything else, but I love the quality of what I order.", "author": "Shaud R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "This neighborhood has some fantastic Thai restaurants, but Ace really stands out! The food is delightful, exceeds expectations. The pork in a dish we ordered was cooked perfectly, the outside was grilled and crispy and the inside is melt-in-your-mouth tender. The taro sticky rice is a must have! The service is impeccable. We had a chance to chat briefly with almost everyone there and these interactions were so sweet and sincere. The decor! So thought out. The brick. The wood. The fresh flowers! We loved everything about our visit. Can't wait to return!", "author": "Emese I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "Wow!! This may be my favorite Thai food in Clinton Hill. Authentic, flavorful, and spicy tastes, and a pretty great lunch special. The lunch specials are cheap and portions are heavy. I usually get one of the curries or noodle soups, and often order delivery from here. It's always a pleasure. Glad to have ACE Thai in the neighborhood!", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Full admission:  I'm addicted to Thai food, with a long history going back to living in Elmhurst Queens for years, the kingdom of NYC Thai.  I've intentionally not lived in a neighborhood in NYC that I didn't already know had amazing Thai Food...until Fort Greene.  It's not that the Thai restaurants here are bad...just none of them are special.  They're the Thai Cuisine I expect when I go back to my long-ago-home of Ohio.\n\nI went to ACE kitchen hoping for it to be as good or nominally better than some of the other \"pretty good\" places in the neighborhood.  We were blown away!  First off we ordered everything Thai spicy, and it came..Thai Spicy, legit burning our mouths off.  Was very happy to see a new place respect that, often they're too afraid to offend new customers.  Second, the dishes flavor profiles were totally on point.  The ped ka prao (Basil Ground Chicken w/ Fried Egg Combo) was fabulous - wonderfully flavored.  The Green Curry was the best Thai Curry we've had in Brooklyn.  Even the \"Spicy Vegetarian Eggplant Kraprow\" (which I gotta admit, I was skeptical of, but there with vegetarians) was fantastic.\n\nSo happy this place moved into the hood!", "author": "Pat L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "I don't particularly like fish or Thai food, but damn... this place is a hidden gem.\n\nGF and I ordered from this place a few times on seamless and we both loved it, but she loved it so much that she wanted to have a birthday dinner date here. The food was even better when we dined in, and the decor was beautiful -- especially for a restaurant that probably does most of it's business on seamless. Everything we've had is good, but our runaway favorite is the Khao Soi (called NOODLE CURRY SOUP on the menu) DO NOT SLEEP ON IT. We fell in love with Khao Soi when we visited Chiang Mai and this is by far the best we've had in NYC. The \nfried red snapper, \ngyoza, \nand drunken noodles are also good. \n\nSeamless tip: If you're like me and you're always looking for extra protein, I'd recommend ordering Khao Soi and grilling a chicken breast to add to it while the delivery is on its way. It only comes with one drumstick.", "author": "Bruce W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "This is by far the best thai food I've had. In addition to affordable, authentic, thai food, this place has an incredible atmosphere. The manager is super friendly, and makes sure every guest leaves happy and satisfied. There are real plants throughout the restaurant, and the decor is modern. Great for a date or a quick lunch by the bar. They have lots of space in the back for a birthday dinner (or other celebrations). This is my new favorite place.", "author": "Brittany F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Wonderful new addition to the neighborhood! The food and atmosphere is awesome and we had a lovely dinner here.  Oat was a pleasure communicating with when making our reservation! Our waiter A was so friendly and professional and accommodated all our requests. We can't wait to dine there again. Wonderful gem!", "author": "gina k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-01", "description": "Was just ok based on what we ate:\n-steamed shrimp and chicken dumplings were very tasty (4)\n-fish cakes were chewy like eating leather and did not taste good at all (1)\n-ace chicken wings were also too chewy. Would have preferred them crispier \n-ace spareribs were also tasty; however, very small pieces and too much fat (2)\n-shrimp drunken noodle was pretty good and just the right amount of heat (4)\n-chicken spicy basil fried rice was also pretty good and flavorful (4)\n\nOverall for the price and smaller portions, I would have hoped it was a little better.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-24", "description": "They have a lot of potential to get much better. \n1. Update people that ordered pick up when the order is ready. I was told it would take an hour so I went early around 35 minutes later, and seemed like it was sitting for a bit. \n2. The crispy fish that they serve was definitely not the classic Thai dish. It was like fish strips with tempura batter, and the sauce itself was ketchup-like. Overly sweet and there was limited vegetables underneath. The fish itself was crispy but again, not what you expect from Thai \n3. The mock duck was nice with great crispy broccoli and the sauce was nice and mild. \nI think they need to stick to more classic approaches of Thai food. \n\nI would love to go back and try more dishes, seeing that there was elements of the food that were good.", "author": "Jinie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "I went to ACE Thai Kitchen on a weekend. I was able to get seated right away. The decor was really nice and the restaurant looked very clean. \n\nThe waitress suggested the chicken wings so I ordered those. The skin was really crispy and the wings were flavorful. I would definitely order these again.\n\nI also ordered some other dishes which were all good.\n\nKhao Soi: the curry broth was yummy and I was amazed by how soft and tender the chicken was. \n\nRoti Canai: not crispy, but went well with the Khao Soi. I wish it were crispier\n\nBeef Curry Puff: flaky and good\n\nPad Thai: the pad Thai was presented nicely. The bean sprouts, noodles, and peanuts were all separate on the plate and you get to mix them together\n\nOverall I really enjoyed my experience. I liked the food and the waitresses were kind and helpful", "author": "Peggy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "This dish is way out of sweet. Hope you Can improve it next time. I have been order snacks and soup in this res. It taste Good. I have come back again and again for those. Recommend definitely.", "author": "Automne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "It was very nice in there looks newly renovated. It was also cold. The food was good I got calamari and spicy fried rice with sliced pork . I really enjoyed it the rice was made spicy with real peppers and not chili flakes. The Thai ice tea was also good. There was no wine n beer as listed though.it wasn't hard finding parking on the street .", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "I don't write reviews often but I really want this place to stick around. I've lived in the neighborhood for 10 years and have just made do with mediocre Thai takeout this whole time. As the previous reviewer, I assumed this place would be no different, but saw a coupon on seamless so thought I would try it. \n\nGlad I did! I ordered pad Thai and a spicy chili basil eggplant dish, which were ready in literally 10 minutes! Not only were they super fast, but both dishes were delicious and fresh. I wish I'd known papaya noodles were an option, but that just means I'll be back.", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Excellent Thai Fried Rice!! Great service! The food is so good!! I mistakenly came to this place for an order to go. I ordered crab fried rice... and has been back every weekend since then.", "author": "Nigel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "There are 3 other Thai places on Myrtle already that are all pretty much same, so when ACE opened I rolled my eyes. But ACE stands out with a way more interesting menu than standard Thai, but NOT the premium prices that usually come w these more thoughtful restaraunts. \n\nThe Pad Thai made w papaya 'noodles' instead of rice noodles  was so smart -- just as tasty as regular pad Thai  but lighter/crunchier/fresher and the Gang Yang somtom came w massive pieces of delicious marrinated chicken on the bone and papaya salad that was tastier than any I've had from a takeout place. Curry was super spicy yet in a way that didn't blow out all the other flavors. Tons of other dishes I've never seen at other local Thai places --inckuding a couple very reasonably priced appetizers -- but all the usual favorites as well. Checkout the ACE highlights section of the menu. \n\nI probably never would have tried ACE if not for 25% off coupon on seamless, but am really glad I did. Only had takeout so far but will definitely be in soon. A bunch of places in this spot have failed in last few years but I really hope ACE manages to stick around.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "The Beef Pineapples fried rice was disappointed and taste not good.  The Beef was very very hard to chew, and I don't recommend this kids and elderly people.  But I do like the Thai Ice Tea and the Vegetable Spring Roll.  I do gave three stars because the service was good and price was reasonable at this area.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-28", "description": "I orderd the food through yelp. but I never got any food. I was really waiting so long time. I called the restaurant, and Firstly they said that deliveryman is on the way. and Check your door man. So, I checked our doorman. but It was fake. the restaurant lie to me. and I called to restaurant again. the restaurant say that we can make a new food, and we will bring right now. at that time was 10:30pm. Then, why did you first lie to me that you were delivering it? I really mad at their attitude. I asked refund. I totally sure, They omitted my order. How could they do that? I can't understand this situation. now 10:30pm! I had to waste my time because of the terrible staff.\nIf they didn't miss the order, Just, If they don't want to receive the order, they had to just cancel as soon as they received it.", "author": "Jisu K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "I am a fan! Everything is flavorful and packaged well. It's a bit pricey BUT I keep ordering. Again and again!", "author": "Valarie J."}], "servesCuisine": "Thai", "priceRange": null, "name": "ACE Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Myrtle Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/i2l8kVp4vHoEEaU7-DykHQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874100"}