{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "Finally my go-to Thai in Brooklyn. It's just so difficult to find the right Thai restaurant that meets  my standards. I grew up in Bangkok so I'm always searching for authentic flavors. Usually i trek to queens when I want authentic Thai, but this place satisfies my local cravings. Great service and fast delivery. I would recommend pad Thai (usually not a fan of this dish, but they make it well), duck  dishes and crispy pork basil.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "I'm usually very skeptical about finding good Thai food on Seamless. Ace Thai Kitchen has the best Thai food in Downtown Brooklyn. I highly recommend the khao soi, duck noodles, and the crab meat/char siu pork noodle soup. For lunch, they have a 10$ special that includes a small Tom Yum soup, an appetizer, and an entree.", "author": "Jesse A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "I've eaten here a lot; at least 7-8 times. Most of the time, take out and once in the restuarant. \n     Ace Thai is awesome! The food is absolutely delicious and consistently the same every time. The delivery is always on time, if not early. I always get the Tom Yum soup. So delicious and still hot when it's delivered. Gyoza is a tasty treat. I tend to alternate between two dishes, both of which are impeccable. The Panang Chicken Curry or the Pineapple Fried Rice. Both are great portions when paired with an appetizer like I mentioned.  I usually have half left for lunch the next day. (Life hack) \n    The inside of the restaurant is decorated so lovely! It appears to be not much more than a bar when you first enter but if you asked to be seated In the back there's a whole room that opens up back there. It's beautiful and cozy. The staff are polite and very helpful. Great for a date night or a cozy dinner. \n     All in all, Ace Thai is a great local restaurant that I would say does not have enough reviews or recognition. Come check it out!", "author": "Natasha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "Affordable and delicious lunch special. Pad Thai Beef very high quality. Delicious curry puffs. Awesome meal.", "author": "Chandler H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "New local thai spot, walked in the first time and order the pineapple fried rice with chicken got a side of fried calamari and a Thai iced tea. Everything tasted so delicious and portions were appropriate for their prices. I've order from them 4 times now and have not yet disappointed me. Can't really speak for anything else on the menu as I have not yet tried but definitely would recommended the pineapple fried rice.", "author": "Lucio M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "I made an order through grubhub, and I am willing to visit the restaurant soon! I really enjoyed my tofu pad Thai ( even though, due to the delivery time, the noodles were a bit dry, but still flavorful) I can't wait to try out more of the menu!", "author": "Yoon Ah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Ace Thai is my new favorite neighborhood spot. The back seating area is surprisingly cozy and inviting. Service is great, especially our waiter Quincy! The food exceeded our expectations. Papaya salad, beef noodle soup, and seafood noodle soup were all on point", "author": "Dalia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "We tried ACE tonight for the first time on our way to another Thai restaurant down the street but stopped here instead. They have been open for 3 months but somehow hadn't noticed it before. The food was great, recommend the pad Thai and Panang curry. Good service and a nice spot/good atmosphere. BYOB is a great feature too. Next time this will be the first stop for Thai!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "This is my favorite Thai restaurant in New York. I'm telling you, the price for the lunch is so good, you get more than what you're paying for. They serve fresh herbs and use fresh ingredients as you can feel all the aroma in your mouth when you eat it. The staff are so nice and so helpful. Highly recommend this place!", "author": "Quincé P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Creative menu, definitely gives me a reason to come back too many items to try in one evening.\nAppetizers are delicious and the servers are very attentive.", "author": "Adonis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Was here for a girlfriends birthday. The restaurant was so accommodating to our large party from the music we requested and to the food. The service was good, they held the cake for us and gave us candles as well. The shrimp rolls was delicious. The Bangkok wings were good as well. The chicken Thai fried rice was good as well I wish we had it spicy tho. Sucks that there were no cocktails. The dinner overall went great will definitely be coming back.", "author": "Zainab A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Amazing food and beautiful restaurant in our neighborhood. The decor is lovely with a nice bar and candlelit tables. They have yet to get a liquor license, so allowed us to bring wine. There are 3 other thai spots nearby that we frequent often, and the food here is definitely superior, and prices are same. Ambiance is also nicer. Service was perfect. The lunch menu looks like a great deal. We had amazing tom yom soup with giant shrimps, and I ordered a shrimp papaya \"noodle\" pad thai that was delicious. The food was not too oily and seemed to be healthy, did not feel weighed down. Huge menu. Portions were great. Cant wait to come back.", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "I'm visiting Brooklyn from Seattle and had takeout twice from here and loved it both times.  Good Pad Thai and yummy steamed dumplings.", "author": "Diann K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "This was our first time at Ace Thai, and the food was very good, the service excellent and the decor tasteful and homey. We had the curry puffs, red curry and pad see ew - all were delicious! The waiter checked on us frequently and made sure everything was to our liking. Will definitely be back again.", "author": "Tanya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "This place is awesome. My partner and I have come three times and have loved the summer rolls, green curry, pad thai, and the rama peanut sauce with shrimp. Good thai food that doesn't feel too heavy or greasy, and pretty good atmosphere as well.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Delivery was super fast and delicious! They have a bigger more authentic selection of Thai food than other places in the neighborhood (I was surprised when they opened when we already have three other Thai restaurants within walking distance) at very reasonable prices.  Will definitely order from again!", "author": "Christy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "Best Thai on Myrtle. Basil chicken fried rice had more flavors than expected - great, although borderline too spicy. But nice with actual flavor. Red chicken curry - same 'great and spicy' comments apply; chicken pad see ew - good, pretty average but nice. Pork Dumplings are above average for takeout, not the best in the city. Main complaint is delivery was 5 min after proposed delivery time. All in all, try it - place needs to stay and survive on Myrtle!", "author": "Elizabeth J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "Randomly picked this place from Grubhub and ordered delivery to my hotel while visiting for a concert. It arrived very fast. But the food was amazing. I've eaten a lot of Thai food on my travels and at home, and this was some of the best I've ever had. Would definitely order again if I'm in the area again.", "author": "A L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "Served me spoiled seafood.  Don't trust this place to serve fresh food.  The tum talay seemed fine til I got to a piece of shrimp and it was rotten.  They told seamless that I couldn't prove it.  I will never order from here again!", "author": "Kris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Great neighborhood spot, very tasty and fresh food with good ambience. Staff is very welcoming.", "author": "Biscut D."}], "servesCuisine": "Thai", "priceRange": null, "name": "ACE Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Myrtle Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/i2l8kVp4vHoEEaU7-DykHQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479874100"}