{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-10", "description": "Came here with a few friends....\n\nReconfirmed with the waitress what i wanted - double white meat. I asked her twice to make sure. What does she bring me, thigh and leg... WT*... seriously? \n\nThe mango drink had no alcohol when i asked for it. \n\nThey added 15% tip to the bill automatically WT*... that just pissed me off... tip is not mandatory its suggested. DO NOT SUGGEST FOR ME.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-23", "description": "This place is a madhouse, very boisterous!  Be prepared to wait,  no semblance of order in the seating process. If you are going to eat here, call for take out.", "author": "William C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "I would only come on a day where it's empty. Everybody in there mama I know from my hood be up in here", "author": "Ceo J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "Terrible Place, Policies and Service!  I went there with a bunch of students from a nearby college yesterday!.  I should have know better than to select this place, however, being that I was with college students who are on a budget, I decided to give Dallas BBQ a try!  BIG MISTAKE, it started with a really ridiculous policy that does not allow customers to be seated without their entire party!  GIVE ME A BREAK, I REQUESTED A TABLE FOR 9 as soon as I got there and that was at 5:30 when it was relatively empty!  I was told that I would have to wait for my entire party!  Mind you there were already five of us there  and we were cold, hungry and ready to start to drink!  So the fact that they would not sit us until everyone showed up was really an inconvenience, not to mention that it also put us in a bad mood!  After insisting 20 minutes later that I wanted to start to order, they finally relented and allowed us to sit with my now party of seven.  By now it 5:50 and the place is packed so we ended up in a Booth for six right next to the kitchen!  Remember I said a party of NINE!  This TERRIBLE RESTURANT and I use the word RESTURANT LOOSELY, then proceeded to place a small crappy table for two on the end of the booth for six and add a chair to the table for two making it now the smallest table for three that I have ever seen in my life!  To top it off after I complained for the 100th time, I was simply told that they could add another table for two (which I may add we never got).      Now were are finally ordering and the waitress was so slow that all of our food came out so late and by that time we were just so upset and disgusted with the entire experience that we just paid the bill and left!  Mind you it was a party of nine and we were there to spend cash, eat, drink and have a marvelous time!  NEVER AGAIN!  OH and did I mention that the bill had a gratuity of 15% already added to the bill so imagine my surprise when after paying the bill, I get NO CHANGE (WHICH WOULD HAVE BEEN $9.68 CHANGE BACK FROM THE ORIGINAL BILL PLUS THE ADDED 15% GRATUITY!  When I asked for my waitress, I was told she left for the day!  So not only did I have a horrible experience, I got robbed in the process also so on top of the demanded 15% gratuity, the waitress kept my change!    :((((  I was not a happy camper and I nor any of my students are ever going back to this place again!", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "I love going to BBQ's. I usually get the Half chicken with Shrimp and Fries...I really like the Fries. Their drinks are good also but even if you order a soda they don't give you free re-fills. The pricing also is good. Great place for lunch but because of the location it does get busy fast.", "author": "Brenda-Cleo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Nice waiter, big dining area and great baby back ribs.  Came here with my son on a Friday.  It was packed but not a long wait.  I ordered the baby back ribs and man that sauce is finger licking good me and my son couldn't stop sucking our fingers.  Waiter was making sure I was satisfied and was accomodating.  When I left I was shocked at the bargain of the meal.  Let's just say I left a good tip.  Bathroom was a little cramped for mens since I had to change my son.  After I left I smoke and the waiter even left me a ciggaratte after the great meal.  A+", "author": "Felipe R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-02", "description": "This Dallas is in a great big and clean space, very nice interior in downtown Brooklyn. But as with every other Dallas the food isn't good at all (it's not bad per say it's just not good) , this will be my third and last Dallas experience. The prices are really reasonable but the food isn't made with any love or knowledge of what real BBQ is. The service at this location just isn't good at all and the margaritas are  just sugary slush mixes and it's really just not worth it at all.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "The best beef ribs i ever had, Flintstones sized! The drinks are hit or miss, either way too much alcohol or way to little. There is no dignified way of eating the beef ribs, so If you care about what your g/f thinks then order something else, cuz your gunna have to get down and dirty and tear it up with your bare hands and teeth....like you just murdered somebody. The steak is horrible, way too salty and hard. On the down side every time i eat the ribs i feel like i got hit with a tranquilizer dart and always wake up groggy.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-09", "description": "The baby back rids are great! The meat just falls off the bone. Make sure to chase it down with a Texas size margarita.", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-10", "description": "I'm going to be blunt...\n\nI think going to this place is a waste of money. \n\nI had a cheeseburger that had a uniform frozen burger shape...unattractively hard on the outside, soft on the inside... If I visit a sit down eating establishment that charge around $7 or more for a burger, that burger should be made from high quality ground/chopped meat and not a uniform frozen shape from who knows where. The burger should also be seasoned, not bland. This burger was bland and, on top of the strange hardness, reminded me of burgers served in my college cafeteria. \n\nI also had coleslaw with the burger since the other options of side dishes for the burger was nothing but starch (potato, fries, and rice). The coleslaw was also bland. The taste reminded me of coleslaw sitting out in the open in a college cafeteria. \n\nSeriously, there are higher quality, private own business in NYC that serve better (and often organic) versions  of this food for the same exact price.\n\nThat night my stomach squirmed, thinking of all that nonorganic frozen uniformed shaped meat.\n\nThe drinks are the only thing worth the asking price...but this last time I went, the drink had no power. I had a big rasberry drink.", "author": "Janay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "1st time at BBQ  I was told everything is huge, well to start Texas Sized Margarita's are Huge and good as hell. I Order take out because I was push for time to head back to Jorsey. Well even after getting home the Burger and Chilli was still banging. very crowded sevice was ok.", "author": "Walt G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "Today my wife and I went to Dallas BBQ in Brooklyn. A soon as we were led to our table by a maitre d or a waiter I was feeling uncomfortable about this restaurant. I was not surprised to find out that our table was not ready yet. The atmosphere of the restaurant, noise and loud conversations all over perhaps increased my negative perception. The floor near the bar looks as if it has not been introduced to a mop in a while. After we order the drinks my wife suggested that we should live without ordering any main entries. The menu, if it merit to be called as such; at this Dallas BBQ (don't know if the other one use the same menu style) looks like a cheap flier with some many entries that might fill out your mine before the real food reach your stomach. We decided to stay because the drinks did not take to long to be served. My wife ordered Baby back ribs with yellow rice. Her ribs were perfectly cook but the rice was not what she expected. I chose Carolina Pulled Pork Burger which was very good but too big for my mouth. At one point I though of eating my Burger with a knife and fork but the mere idea of it seemed out of place. However, we left satisfied with the food but they should consider opting for bigger plates that fit the food without dropping into the table. I would not think of coming back to this restaurant again. \n\nAlso, the absence of a kid menu is a nuisance to a parent who does not even know what to order for himself let alone to chose for the kids, such as in my case.", "author": "L S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-28", "description": "If I could give 0 stars I would.  I've been to the one on 42nd street although only for take out and like their food. I couldn't even eat at the one in Brooklyn. The atmosphere was just too ghetto for me.  Not ghetto fabulous - just ghetto.  I'll stick to Manhattan.", "author": "DAWN F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "i have been coming to this location for years!!!!!! the service is fast, the food is always hot and piled on high!!!!!!!!!!....BUT WHO AM I KIDDING....we all know the real highlight are the killer drinks!!!!!....lol Texas size margarita!!!!!!! whoot whoot!...lol is it the best I've ever had no, is it obviously a frozen mix...yes BUT! its still yummy and will give u a nice buzz! nothing like a plate of sticky wings w/a side of their house ranch, a plate of fries and a cold frozen margarita!!!!!!!! \n\none downside is the parking!!!!!!!!!!! it sucks!!!!!!! u have to wait until 7pm to park on the other side of the street and its a bitch trying to get one ....but its worth it! if u wanna have a fun dinner i recommend this location!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "Really, people? 3 stars?? I definitely thought this restaurant would be rated much higher than just 3 stars! I absolutely love this place! I always come here for the ribs and half chicken combo, that's the only thing I order and that's the only thing I'll ever order! It's so damn delicious! I come here every few weeks (because if I came here more, I'd be a cow!) and each time I do, my food is perfect. They do give A LOT of food here though. Not only are their portions enough to feed 3 people at a time, but they also give you a brick sized piece of yummy cornbread and a crap load of butter, you know, just in case you thought your arteries wouldn't become clogged enough. Seriously though, there portions are HUGE!!! I mean, I know I'm ordering ribs and a half chicken, but the ribs looked like they've been pulled out of a giant buffalo or something! And also, with your giant Flintstone slab of ribs and your half chicken and brick sized cornbread, they also throw in a giant portion of fries! Yup, heart attack, here we come! But hey, if I have to dropped dead in that restaurant after finishing all that, and for only $10 mind you, then I definitely died happy with a smile, a full stomach, and a full wallet as well!\n\nSome things I'm not too crazy about here though is the SUPER LOUD crowd (this place can literally have 10 people in here and still, you need earplugs!), the decor seems pretty dingy and needs to be updated from the 90s, and the demographics here are....um.....very skewed, not that that's a bad thing, it's just interesting to feel like a minority haha. But even with these things, I'm still giving this place 5 stars because it totally deserves it!", "author": "Smalls D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-03", "description": "IF I ever decide to step foot in here again it would be only for take out. The customer service in this location is plain awful. I have tried on 3 occasions to like this place, because, hey Brooklyn is my home town but it always loud and filthy in here. Then the attitude at the door from the host and then the waiters is so not needed. I don't know why they give customers all this grief, I mean if you don't like serving people, get a new job. It's a recession and Dallas BBQ should be happy to have customers coming in their doors. But I won't be returning because this is NY baby and I have many, many food places to choose from.", "author": "Zee W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-02", "description": "The employees in this resturant  are very rude. My husband and i tried calling to place a order for delivery .and was put on hold for at least 27 minutes. We had to hang up and call back only for them to tell us that they wont deliver to our neighborhood., and she had the nerve to put me on hold again. This resturant is located at 180 livingston street in downtown Brooklyn, and we reside 5 blocks away. Not to mention that we went there for my birthday and i recieve a piece of cornbread with strawberry toppings and was told it was cake. NEVER EVER EVER EVER AGAIN!!!!!", "author": "natalie h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-04", "description": "Same as all the other locations, just a longer wait on the weekends. This place is pretty big but they still pack people in really tight. Great service, quick and friendly.   But its  Dallas BBQ's and its yummy and amazing so go!", "author": "Kimberly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "I like the 72nd street location better...but the food and drinks are top notch and offers plenty of bang for your buck...in these economic times its great you can get alot of food, plenty of drink and great service for a fair price. Just remember to tip the servers...they work hard for the money!", "author": "Gregg W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-30", "description": "My friends and I used to go to Dalla BBQ all the time. It's easy on the wallet and the food is tasty. Well the wings are tasty. This isn't a place for a refined dining experience. This is the type of establishment that you go to when you want overly salty, overly sweet , overly tangy food that really satisfies. Oh, I almost forgot, those texas size drinks will get you buzzed!", "author": "Electra T."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}