{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-16", "description": "Well I went to this location to catch up with a friend before she left for Israel I must say I'm a fan of the BBQs chain, but the customer service at this location is not good at all . The server comes too the table without an introduction and was like are you guys ready to order as if he's in a hurry. The food came out before the drinks did. They forgot food from my order so by the time he came back to check on me to see if we were good I was almost done eating. But my sides were still a \"No Show\" . Took Issab awhile to bring the check. It will be awhile before I visit this location anymore . Not to mention walking into the place the Police were kicking a couple out.", "author": "Desmond F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Stopped by today because I haven't had bbq in a while. It was to busy I was able to be seated as soon as I arrived. I was greeted by my waiter, Eric, shortly after being seated and asked if I was ready to order. I ordered the early bird special which was only $8.99 for a one person meal. It included a chicken vegetable soup \u0026 half rotisserie chicken I ordered separately the honey basted sauce (sticky sauce). I received the soup in less than five minutes which was great and the wait for the food because a lot more bare-able being that I didn't have to starve until it's arrival. I am very impressed with the costumer service at this facility, the cleanliness, and the entrees provided. I would recommend this location to anyone. I was even offered a free piece of cake. Awesome experience.", "author": "Sherqueena M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-03", "description": "We were there on 2/2/2019. It was freezing outside. There was no heat or hot water in this restaurant. I told the manager there was no soap or toilet tissue in the ladies room. They got the tissue but no soap. Never going there again!!!", "author": "Stacey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Stopped for a quick bite to eat after shopping downtown Brooklyn New York. The waitress greeted us and took our order promptly. I ordered the ribs and chicken special and he ordered the chicken wings with sauce on the side. The food was at the table in less than 10 minutes we did not drink any of the big signature drinks we did have a regular size Sprite and a iced tea , it was disappointing that they do not offer free refills on a  drink that's $4.25 other than that the visit was quite good and I'll be back again.", "author": "Tamiko D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "A bustling restaurant that's very family friendly - lots of groups and birthday parties here on weekends but it adds to the atmosphere. Prices are reasonable and the food is good value. It's not as clean as other Dallas BBQs I've visited but the food was cooked well and the staff friendly. Highly recommend the 1/4 chicken with BBQ sauce!", "author": "Jen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Another good budget friendly BBQ Joint available.  They live up to what they're known for: large portions, big drinks, decent price.  Quality of the food can vary a bit from time to time.  The beef ribs I ordered was super chewy and not tender like it usually was.  Lotsa of floss and elbow grease is needed for that meal.  Chicken wings are excellent as usual.\n\n\nOrdered for office party and it was a good value considering what you get.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Talk about ready made food. So my friend and I came here on on a Friday night and it had a huge crowd as usual but not overly packed because we were immediately seated. Our waiter came right over to take our orders. We didn't decide at the time of what we actually wanted to eat so we just ordered the Moscato Mama that came with a Patron shot. It was good and a lot. When the waiter came back we again, both decided on the baby back with honey chicken and a baked potato. When I tell you about ready in 5 mins. I was able to take a pic of my drink, listen to staff sing happy birthday to another table right before our food was served to us. You should've seen the look on our faces.  Both the chicken and ribs felt as if it was already prepared but heated up when we made our order. It was hard but not to the point of it being unchewable. Next, I'll have to ask them to not have it so well done. Besides that, our waiter was very attentive. The drink was tasty and we enjoyed our time. I've been here a million times already and I'm more than positive that I'll keep coming back.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "I liked the food and ambiance of this place. \n\nBeing someone from Dallas, this place doesn't remind me at all of Dallas. However, the vibes are good and honestly most of the people here were POCs which made me feel very comfortable. They also have two large screens where they play a lot of old-school R\u0026B music videos which I definitely enjoyed. This is definitely a place where you can come with friends or even bring your family. \n\nService was great. My waiter was attentive and food was delivered within a reasonable time-frame. \n\nI ended up ordering the 5-piece chicken wings and an order of mac and cheese. The chicken was large and very crispy the way fried chicken should be. Mac and cheese was good as well but definitely not something I have to order again. I ended up just ordering a beer with my meal but they have a large selection of adult beverages to choose from.\n\nOverall, I was feeling the vibes of the place and the food was good as well.", "author": "Zak W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "If you want a good time and uncomplicated food this is your spot. The alcoholic beverages are very alcoholic and easy on the wallet. The portion sizes are huge and honestly, can be shared.\n\nI always go here for a drink whenever im in nyc. The salmon and shrimp combo is a must.", "author": "Aisha K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-09", "description": "Terrible service.  Waitress forgot to bring our soup.  She never returned once to refill our water.  \n\nThe dining room was nearly all empty around 2:30 pm when we sat down in a corner.  There were lots of open seating available.  Yet they managed to squeeze a loud group of construction workers - some covered in mud - right next to our corner table.", "author": "Lana J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-10", "description": "I went to this BBQs on Friday with 2 other people and the server who was short Spanish with thin eye brows acted as of she was doing us a favor by offering us a booth after she took our order only to get us out of her section we moved thinking ok maybe over here is good and another server walked up to us to take our order we were confused because she took our order already this is not acceptable because I know she did it out of discrimination or because we only wanted drink so she unfairly moved us to another server wich is very self but anyways we tip the server very well that took care of us she missed out but I would like management to speak to her about her actions she had the section right by the left of the host stand", "author": "Kay H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-18", "description": "It's just ok. Food came out quick, but seemed to lack in quality. The half chicken was good and juicy. Not very kid friendly. It's dark and loud. The server left after we asked a couple questions and returned several minutes later. After I told him \"not to run away again\" he took our order. He barely checked on us. They clearly have a problem with patrons lack of tipping since they put a sticker on the bill stating tip not included. Wow.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "Service was fast! Great atmosphere! Great staff! Food was 3 stars! I loved the sticky tenders they were seasoned just right!", "author": "Priscilla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "A great dining experience in the north with some southern flavor!! I started off with the Sticky Wings and they were amazing!!! For my main course I order the bbq chicken and ribs, and they were both quite delicious!!! My mom ordered the chicken waffles and they were absolutely delicious!! If you're in Brooklyn and looking for delicious dinner or lunch stop then I highly recommend stopping in to \"wet your whistle\".", "author": "Clint E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "Gross food. We ordered the Mac n cheese truffle and it was cold and chewy. The fork they gave us was used, and the chicken wings were not as expected. Worse dinner ever.", "author": "Kiran B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Love me some Dallas BBQ!!! The best damn wings! We always order the large 10 pc crispy wings and they are huge and crispy and juicy and perfectly executed every time. This is very important because being consistent is key to success and return customers and the wings never ever fail. You know what makes the wings even better, the ranch dressing-it's the tastiest ranch I've ever had. Dallas BBQ offers great frozen drinks and the strawberry daiquiri is delicious and you can get it (and other drinks) in \"Texas sized\" which is their large size and boy is it filling and reasonably priced. We had ordered the lunch portion of steak and decided on the baked potato. The steak comes on top of flat bread that soaks up that nice steak juice and the baked potato was nice and fresh. This particular time the steak was cooked correctly but the actual steak tasted a little livery and just wasn't good. Other delicious options we've ordered were the ribs, the fried shrimp, and rotisserie chicken. The corn bread which comes with any combo is always fresh, big and perfectly sweet. This location needs to be updated or renovated because the whole restaurant is dark and tired. The chairs are old and the tables are worn. The server, Manny was very kind and attentive and was nice enough to bring my wife samples of their frozen drinks because they ran out of the strawberry daiquiri yet we found another delicious back up (mango moscato daiquiri) as a result.", "author": "Eddie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "Wish I could give them -0 stars. I visited this particular BBQs location on the 5th of July. I ordered take out , Salmon Caesar Salad. As I prepared my Cesar salad at home , I noted that the Parmesan cheese to apply on top of my salad was molded. I contacted BBQs immediately , and requested to speak with the manager. The manager was very disrespectful , and took offense to me having an attitude about my cheese being molded; and basically told me it wasn't s big deal because the cheese was provided on the side. Hmmmm maybe hospitality is not for him. What customer wouldn't be upset about there food being molded. You have been warned don't eat here!!!!", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "Good drinks too noisey food has its moments always crowded personally the one on 23rd is beta", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "This wild, wild Brooklyn establishment has been around for ages by the looks of it. The floor, the walls and some of the wait staff were so worn that, when we decided to eat here, I worried about the cleanliness of Dallas BBQ. But it, of course was crowded on a cold Sunday night so it had to be OK, right? \n\nI don't usually patronize chain restaurants-the food is processed to the point of you don't know what you're eating but the money you spend and the time you wait is as if you were eating at a 10-star gourmet resto in Paris itself-unless they have a French name and are spotless, but love makes you do silly things, sometimes. In this case, I wasn't impressed but I wasn't entirely disappointed either.\n\nFirst, let's talk about the good. The Texas-size frozen daiquiris with extra shots had us smiling from ear to ear. Get one of these and life won't be so bad, at least not during your time at Dallas BBQ. They're not strong at all but the most colorful slushies have the potential to make anyone smile. The crispy shrimp and wings-I got mine honey basted-was a delicious combo. Liked it and wanted more. A truly casual environment perfect for bringing the kids out. The decent wait staff that made sure to give my sleeping LO a dessert. I laughed the night away per my usual good mood with my LO on my lap. \n\nSecond, here's the stuff that had me frowning, aka the bad. The falling over drunk patrons that you thought were your age till they started singing along to an archaic Isley Brothers song. An oldie but goodie, but still an oldie. The loud people in the back that wouldn't stop complaining about the lack of customer service, other patrons that they knew that didn't want to talk to them, and life in general. The loud people in the front that wouldn't stop complaining about the hour and a half wait and about the \"manager\" who took delight in shuffling people away from the counter in the rudest way possible--if you're not a people person don't get a job where you have to deal with the public. \n\nBoth groups collectively making foul noise will make you want to leave and never look back. Dallas BBQ should invest in more space and/or better managers.\n\nThird, I hate to use the word ugly but how else can you describe disgusting bathrooms, patrons so drunk they were falling over themselves and other people on purpose for attention, and a place that has an overall messy, out-of-order, dirty vibe? But I'm thankful that it did get so ugly, if nothing else than for the fact that I won't be pushed into eating here ever again.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Get yourself a big ol' draaank\n\nWell we all know that Dallas BBQ is no where near fine or elegant dining but it is the place you come to for a guilty pleasure. This location is pretty much the same as all the other locations. One platter of food is about 20 bucks with enough food to feed a small village. The crowd is on the more lively side of life and the atmosphere of the establishment is very loud. \n\nI will say that the restroom could be cleaned a little more frequently, because the floor was very slippery and sticky (perhaps someone spilled bbq sauce on the floor). \n\nBe aware that the gratuity is included in your check, no matter the size of your party.", "author": "Kwame S."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}