{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "All the ghetto people \u0026 people who never been out come here. Everyone is so ratchet \u0026 loud. The waiters are slow as hell. Everyone shouting to the top of their lungs. This location is the worst one in my opinion. The food \u0026 drinks aren't bad thou. Me personally I wouldn't come to this location. The other ones are better", "author": "Brianna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-18", "description": "The food \u0026 drinks are great... \nThe service is good...\nbut the place overall is ghetto...\nit's so loud \u0026 annoying. \nBut go, go if you want! lol", "author": "Elaine F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "Please have enough staffs. The whole resturant was not busy at all, but we have been waited service for about 20 mintues. Not sure how they arrange tables and work.", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "I enjoy this place when I don't feel like spending too much money but still want to enjoy my food. The service is quick, the food and drinks are good. Not a fancy restaurant so its loud but once you take a couple sips of your drink you'll join in lol", "author": "Shantell G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-16", "description": "Wife and I have been to other Dallas BBQ, you can see our more positive reviews.\n\nWe have been at this location at LEAST THREE TIMES BEFORE. We won't be back.\n\nVery loud music, so loud we had to raise our voices to speak across the table.\n\nSoup served with a teaspoon instead of soup spoon or bouillon spoon.\n\nDishes not cleared off promptly.\n\nCorn brad overcooked", "author": "Raymond N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Place is always packed but the food is usually good.the service can be sucky because it's too many customers. We had to ask for water 3 times and still never got it.waiting and waiting for our check.I actually love the drinks but now debating on ever coming back.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "Like most NYers I have been to Dallas BBQs many times in the past but ths was my first visit to the downtown brooklyn location. I joined a few friends for dinner on a friday night and it was jam packed with lots of large family groups. The wait for me was not very long because my friends had gotten there before me and were just being called as I walked in.\nThe food in general is typical cheap fast food - fried chicken wings, ribs, rotissered chicken and some seafood dishes. The chicken wings are some of the hugest I have ever seen and looking at them always makes me think their chickens must've been on steroids! The ribs in my opinion are decent for the price but they are far from the best. The best thing I like about BBQs (next to the prices) is the texas sized drinks which come in every flavor imaginable and can be virgin or alcoholic. You can also add shots depending on how buzzed you want to be when you leave.\nThe service was decent for the huge crowds they had to manage while I was there. But what I didnt like was that this location charged a mandatory 18% gratuity to the bill but looking at the crowd Im sure they have to do that to ensure that they get any tips which is the bulk of a waiter/waitresses income.\nI also saw some tables being offered cupcakes after there meals but our table was not offered any which is tacky. \nIn the future I'd prefer to visit the outer borough locations rather than this one - sorry.", "author": "Celeste B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Dallas BBQ is THE place for barbecue in New York City. From tender, juicy rotissere chicken to fall-off-the-bone carmelized ribs, this barbecue restaurant knows their way around the kitchen! If that wasn't enough, the portions are giant while the prices are very reasonable. From fresh-baked cornbread to scratch-made chicken soup, this barbecue stretches their culinary muscles by going beyond the BBQ pit to serve up scrumptious seafood, steaks, and even their infamous Texas-style chili that is made twice daily. Stop by to see for yourself. You will NOT be disappointed! I chose to rate them four stars, due to the loud noise level that is often present.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "Last night I had a Henessey Burger, it taste really good, looks like they had new employees, seems to be better than before, last set of employees that was there a few months ago was really rude and disrespectful.", "author": "Gia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-16", "description": "~~ BBQ ~~ (LICKS FINGERS)\n\nThe Dallas BBQ's in downtown Brooklyn is not my favorite location. For some reason I much prefer the overly packed, loud, slightly obnoxious one on 42nd street. \n\nThis BBQ's looks like your typical restaurant (booths/tables). It gets really busy around the weekend and they don't have a huge waiting area so there are usually people blocking the doors and standing outside. Now if you go on a weekday then you will completely avoid this situation. \nThe one thing I love about BBQ's is that the drinks, in particular the bulldogs are amazing!! I promise you that one bulldog gets me right. Then again I don't have a high tolerance for liquor but I am usually tipsy after one of these bad boys. Of course you are paying about $14 for one but honestly I think it's worth it. \nThe food is okay to say the least. I am not a fan of it, it is like your typical fast food place. There is nothing special about the food at all. The portions are rather large and you get what you paid for. I have never really seen anyone clear there plate unless they ordered an appetizer.", "author": "Ayanna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "while i like dallas bbq this location is not my favorite at all. The staff is not that friendly they always seem like they are rushing and dont have time. They literally sit you right on top of people. I have gone on days where the restaurant is not that busy and they still will stick you so close to people that its almost as though you are at the same table. the person goes to cut their meat their elbow is in your face. Its absolutely ridiculous I have had people sweeping under my table while i'm eating the waiter/waitress comes every second like you cant even have a conversation because they want you to get out. I would not go with kids for this reason either. even for the birthdays they go sing this half dead rendition of happy birthday that is a complete embarrassment. The staff seem really unhappy here and as a patron I felt the same. The flatbush avenue location is wayyyyyyyyyy better", "author": "Summer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "Ugh! Ghetto! Ghetto Ghetto! From the customers to the workers! Come here only if it's the last option, otherwise don't waste your time. The employees are rude, you walk in and they look at you, like \"what are you doing here\" the menu is your placemat, the food isn't fresh, it's basically like a cafeteria. Everyone basically comes here for the cheap, sweet, going to give you a headache drinks. Never Again! If I have to mentally tell myself to \"have patience\" before entering a place, then it isn't for me.", "author": "Casey R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "Great sauce! That's the only reason I gave it stars.\nTiny ribs with barely any meat and that's after your able to get the meat off the bone.", "author": "Nelson P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "I'm giving them 4 stars specifically for  the only thing I tried which was the sticky wings and the hot wings. I must say that their sticky wings..... Are.....AMAZING!!! I'm sad that I live in Miami and can't have these all the time. They are drenched in this honey with some other flavors but it's the right balance of sweet and savory. \n\nWe ordered half sticky and half hot. The spicy wings were great, your average hot wings, but the sticky wings, were the best and my favorite. An added plus is that they are the entire wing, so you get your belly full and your monies worth. We went twice during our trip and on both occasions they were made fresh to order, even with us getting there at closing one night! \n\nEvery time I go back to NYC, you will certainly be seeing me hit up Dallas BBQ :0)", "author": "Denisse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "I always have a good experience especially during lunch because that's mostly when I do come.The service is fast and the staff is friendly", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "Food is mediocre.              \nService is slow.        \nThey sit everybody near each other when there are multiple  tables  available.\nI don't  need a sticker to remind me that the tip is  not included.", "author": "Ray-Ray M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "I was at this restaurant earlier this afternoon. The  place has a weird odor and the service is disgusting. I ordered some food to go and then produced my debit card so I could pay. The female that served me asked for proof of ID so she could check to see if my debit card actually belonged to me. I told her (as I was producing my ID) that this was the first time I had ever been asked to do that before making a purchase for food to go. It has never happened to me elsewhere. She responded by saying that sometimes a person will drop their debit card and another person might pick it up and go shopping. I cannot remember the last time I was ever so disgusted by the service I received somewhere.", "author": "Tara Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "If I could give 0 stars I would. The staff is rude and unattentive and the food was absolutely horrible. I ordered a burger at the suggestion of my server and I was far from impressed. For one, they use pre-made patties that aren't seasoned and when cooked turn to rubber. Fries tasted like they decided to pour extra grease over them after coming out of the fryer and the toppings looked as though they had been sitting out all day. To make things worse, they had the nerve to add gratuity in and I was by myself. Save yourself the headache and money and go someplace worth it.", "author": "Reggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Fantastic food. I always do pick up here, but it's obvious that this place is loved because it is always crowded. When I pick up, I always see people ordering huge frozen drinks. \n\nThe ribs here are fantastic!  Always flavorful,  big and juicy. The barbecue sauce here is great. \n\nYou can purchase food for a crowd at a reasonable price.\n\nSide orders are fantastic here as well - try the onion loaf and the cole slaw - everyone loves those. \n\nHuge corn bread chunk - hot and flavorful.", "author": "RibsGuy .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "I would give this place one star, but luckily our waiter was respectful and attentive.\n\nBe advised: this is ghetto central! Nothing more....nothing less (trust me I know...ive lived here for years). The long wait is expected...its a friday night.\n\nBut why in the hell are sitting on plastic chairs? The kind of plastic chairs you bring out to the picnic when you run out of the good plastic chairs!!!!!! The type of plastic chairs you lean over the porch to dry off when it rains and leaves a puddle in the seat...\n\n UNACCEPTABLE! All this money this place makes and you can only accomodate with plastic chairs????\n\nNever again will I come here. Hopefully if you decide to come, your waiter will be just as nice as ours.", "author": "Jessica J."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}