{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Whenever I'm heading home on a Saturday night I order food from here for pickup. I celebrated my birthday here. Had a great time. Love the Sticky wings and Hennessey wings.", "author": "Rudy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-06", "description": "A scam if I ever saw one.\n\nI have been to a several dallas bbq restaurants and this one is  a real trip.  i ordered the sticky chicken meal. you are supposed to get sticky tenders, a side ( i picked french fries) and  corn bread. they gave me 3 tenders, 2 butters, one sauce and no forks. i go to the dalls bbq on times square. same meal. they gave me 4 chicken tenders,4 butters and 2 sauces with forks and napkins!!! i will never go to the brookln one again. I had to wait a long time as well. the larger meals were being given quicker than the smaller meals? I have been going to the brooklyn one and they keep scamming people with the number of tenders and not to mention the unfresh coleslaw. never again! times square dallas bbq is much better!", "author": "Shye V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "Leron's Lesson: Honey Sticky Wings and/or Henny Wings are mandatory for anyone who dines here.\n\nFull Review: I came here with a group of 6 friends recently on a weekend night and it was packed. We had to wait at least 30 minutes to be seated. We didn't mind the wait because we knew it would be worth it. We all split 2 large orders of their delicious wings which I demand you order as well. Entrees were ok, the fries are incredibly greasy. If you can get past the calorie overload then you should have no problem having dinner with friends here any night.", "author": "Leron G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "I rarely write reviews but I have to today because my family came from out of town to bury my grandmother and afterwards we had to find a restaurant that could accommodate at leat 20 people. BBQS was so helpful and took care of us very well. We ended up having to request additional tables because we ended up with a party of 36. Everyone was so nice and pleasant. They really helped us make an otherwise sad day easier because my family was able to enjoy good food, drinks and conversations together. I really want to thank our server Maria....she was awesome!!", "author": "Faya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Nice open layout no bar though. They have a few big TV's as far as the food you know what you get from BBQ. I mostly come here for the drinks with sticky/Hennessey wings.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "You get what you pay for, SUPER SIZED!!! Long been a fan of Dallas BBQ chain. This location particularly has an old diner vibe and truly reminds me I'm in BK. The margaritas and Henessy Coladas are legendary. On a bored Saturday, if you get seated before 4pm you should check out their early bird special (1 portion is shareable and plenty).  Also, shout out to the uber friendly staff and attentive service albeit huge crowd.", "author": "Marianne D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-14", "description": "Pros:  \n\nOur group was seated fairly quickly, they had free water, and (for some reason) brought us a plate of cupcakes at the end.\n\nCons:  \n\nService was SLOW.  And I understand busy restaurants can sometimes take a while to turn tables, but I am talking molasses flowing up hill.  We saw our waiter 4 times in 2 hours.  (We were not there for 2 hours voluntarily...it just took that long.)\n\nWaiter was impatient and rushing us (when he actually made an appearance).  When one person in our group wasn't sure what to order to drink, he left while saying he was going to put in our drinks.  How about helping offer some choices or explaining some of the drinks?  Seriously, it looks like he had a section with maybe 6 tables seated.\n\nNaming this place \"Dallas BBQ\" is like slapping a Bentley logo on your '91 Honda (with chrome-like spinners).  A more precise name would be \"McBBQ\".  This is a bastardization of any BBQ from Dallas or Texas.  I'd much rather eat a spicy chicken sandwich from Wendy's; at least I would enjoy a little bit of moist chicken product.  Oh, and the corn bread was more like corn cardboard; the cornbread at Boston Market puts this place to shame!\n\nI have spent 26 years of my life in the NYC area, and 6 years in the Dallas area.  I'd say my expectations are equivalent with the locals, and I have some great experiences with REAL Texas BBQ joints.  It's great stuff (when it's not at this place).\n\nSide note - the decor leaves much to be desired, the carpeting is starting to get a little rough, chairs are starting to get torn up, and it's way too bright inside.\n\nSarcasm aside:\n\nThe chicken was VERY dry, and the only taste was the honey BBQ sauce that was drizzled on top.  It seemed like an after-thought.  Do they even bother seasoning their food while they cook it?  It certainly didn't taste like it.  \n\nI asked for a side salad with dressing.  When the meal came out, the salad was about the size of my fist.  This normally wouldn't bother me, except it was dry -- where's my dressing?  I could probably find out if someone stopped by our table.\n\nAt this point we were 1.5 hours into our stay, only had one round of drinks delivered, and had only seen our waiter twice.  He wasn't even the one who delivered the food, and he didn't bother to stop by and ask if everything was okay.  From a management perspective, how is it that they don't see tables not being turned quickly enough...and customers looking around for waiters (like meerkats scanning the horizon)?  How do they make a profit, and how much more could they be making if they were attentive and responsive???!!!  Not a long-term recipe for success here.\n\nOh, and the kicker?  15% gratuity was automatically added.  If it were up to me...I would not have tipped.  And I'm usually pretty generous (25% and up for better service).\n\nSummary:\n\nIf you have plenty of time, are a little short on cash, and are okay with only 1 drink in two hours to wash down your extra-dry, unseasoned meal, give this place a shot.  Otherwise, you may want to check out Dinosaur BBQ or one of the 20 other spots in the area first.", "author": "Eddie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "I think I've actually been to every BBQ's in New York. first off it's BBQ's.. pretty much more of the same... the thing I like about this location is.. \n\nPros\n\nIt's close to home. (Clinton Hill)\nThere are no tourist traps on prices (unlike Times Square SMFH)\nService is rather fast.(Strike up a decent conversation and BAM!!! Food is here)\n\nOne thing I don't like is the spot is kinda hood.... I'm used to it but if you're looking for a peaceful super duper calm dining experience.. NONE OF THE BBQS ARE FOR YOU! Slap yourself!\n\n BBQ's is a spot you come to with a group of your homies looking to kick back, rack up on some Hennessy Wings, Some Sticky Wings... and most importantly... TEXAS SIZED DRANKS!!  Yes.. DRANKS! The wings are golden... the food it's self is good.. I don't think you will run into many issues with the food.... the experience will be mainly focused on the environment. The most relaxing BBQ's I've been too was the once I think in the 70's up there in Manhattan near Central Park. This location it is noisy, so keep that in mind. If you plan on drinking please I repeat PLEASE DON'T DRINK AND DRIVE!", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "So I've only ordered take out from here, but all my family knows, when I come to New York, I HAVE to have my honey wings from BBQ's.  They are AMAZING and Im never disappointed!  We usually get delivery, which is usually pretty fast!\n\nLove their wings, so tasty and very big too!  Would definitely love to actually check out the restaurant for once, but for now, Ill just order my honey wings and enjoy them at home ;)", "author": "Toni B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "This is a typical BBQ's and has been a staple in Brooklyn for a while now. It's always crowded but the wait is never long. I visit this spot maybe two or three times a year the most. You are bound to run Into someone you know since it's in a high traffic area. I would recommend it if your going to the movies downtown and want to get some food. The service is quick and food is typically good.", "author": "T H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "So I'm still waiting for a response from the \"manager\" \nHi Eric \n\nJust writing to see if you received my email?\n\nSent from my iPad\n\nHi Eric\n\nI was a visitor to your restaurant on the 12th of October.  We arrived to your Brooklyn establishment and our first thought was how wonderful of an experience we were about to have.  We were sent to your restaurant with high recommendation and expectations.  It was anything but pleasant.  From the experience of ordering until the the we paid our check.  We were a party of 5.  Rolanda was our waitress.  She took our order after 20 minutes of sitting there.   Very unprofessional from the moment she took our orders.  She actually acted as if we were interrupting her.  Her eyes were rolling when she took our order.  I ordered appetizers in which she decided would come out with the rest of the meal.  When asked she said that this was our request.  Which was untrue.  There is a table in the far back to the right behind the wall divider where your group of waitresses and waiters sit.  They are actually eating and kicking back.  After another 20 minutes of not seeing our waitress we asked another waiter to please check on our order.  At this time this waiter went to get our waitress who again noticeably had attitude because we were again bothering her.  She said very irritated \" can I help you\"  uh yeah ....we would like our food.  She went to check in our food and returned about 10 minutes later with a busboy who served our food.  Not once did she ask about our drinks or refresh her service by letting us know the status of our food.  At this point we lost our appetite and more than half of the food was left at the table.  One of my guests had to get up to ask for the check.  She brought it and walked away.  We were not going to wait for her to come back again.  We all gathered our items and walked to the cash register.  At this time she came yelling that we needed to pay her.  There was a white gentleman who was wearing a suit standing by the register who we commented to him how horrible the service was.  His response was \" yeah but how was the food?\"  WOW.  I work in customer service and the type of service provided in this establishment is far below acceptable.  These people who want to \"hang out\" in the back who you are paying to attend to the customers need a lesson in customer service.  At this point I told him and her that I am NOT LEAVING A TIP AND CROSSED IT OUT ON THE RECEIPT.   She said that was fine and snatched the pen out of my hand.  To only find out the other day that the tip was actually charged.  This waitress doesn't care about Dallas BBQ and fraudulently charged my card an unauthorized amount not agreed upon.  I called and Ming is currently working on my refund.  I did a review on yelp.  And I will keep going until I let the owner knows what kind of people they have working for them.  I will not ever return not will any of the guests I took that night.  I am embarrassed for the waitresses conduct and do hope that this is brought to her attention.  No matter what her side is, you should not be in the hang out zone when you have customers to attend to.  You should not give them attitude when they are ordering.  And don't ever snatch things out of their hand.  Lastly steal from them.  If you have any questions please feel free to email me.\n\nI'm sure there are people who would love to have her job.  Who have a reason to work. And who earn their money.\n\nHave a great day.\n\nTamara - please don't tell me management isn't interested in correcting their staff or apologizing and acknowledging their errors", "author": "Tamara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "It's Britney bitch....\nI'm a slaaaave, for you! \nI won't deny it, I'm not trynna hide it!\n\nI am a slave, a slave for those addictive honey wings. Taste so good make you wanna slap yo' mama! (a joke from FRIDAY the movie).\n\nAlways ordered a baked potato with extra butter and sour cream. Thank you waitress. Oh and don't forget my 50 cent block of Jiffy cornbread. \n\nFor a beverage to wash it all down, I prefer a bulldog or a strawberry daiquiri.\n\nI have never had an issue with service - my waiters and waitresses have always been attentive every time I have visited and the food comes out relatively quickly. What I also enjoy is taste consistency - the food is never a disappointment!\n\nThank goodness they have BBQ to order and go :) - I can eat my honey wings and lick my fingers in the privacy of my own home.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "Great place to get together with friends and family. And for special occasions. I will definitely come back again.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "I've been here twice, and tonight may have been my last visit.  The service at this location is seriously lacking, especially when compared to Manhattan locations.  The waiter seemed bothered my friend wanted napkins, and her correct order.\n\nI ordered the shrimp and ribs combo and a yummy colada with extra shots.  Everything was delicious, but the service from each staffperson was suckeh.  :-| \n\nAs always the food and drink portions are crazy goood.  I took off two stars for the service.  Everything else is perfecto.", "author": "Tamara O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "You got to love and hate this place so much. The food is Awesome But obviously it's not good for you the food is high on grease and could give you a Heart attack. But lord knows its good!!!! I only eat here when I visit NYC BBQ's aren't in Florida good thing too because I would be on there all the time. Cheers, and Enjoy your meal.", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "Hate BBQs.\nTheir food looks like its on hormones with Bigger than life wings. Their fries are charred and nasty. \nI just hate it.\nBut their drinks are the best lol\nI would just go there to drink thats all.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-12", "description": "This place was packed Saturday night \u0026 the wait was long. What made my wait even longer is that the lady forgot to write my name \u0026 number down. Eventually i realized there was something wrong \u0026 went to inquire about our table. The lady then seated me next once she realized the mistake she made. This was after 45 minutes.\n\nThe server was decent enough. He wasn't overly friendly but he was about his business. I can appreciate that. Sometimes I can really do without a smiling, pretentious waiter. Piss them off \u0026 see what happens.\n\nThe food was as good as at any other BBQ's. However, the sticky wings were like Brontasaurus wings. Seriously, what the hell do they feed those chickens pigs? They were tasty but they were abnormally huge.\n\nThe drink I had was the Margarita Royale which comes with a tequila shot \u0026 a bottle of champagne inside of a huge margarita. The drink was better at the other Dallas BBQ's but hey, after a few sips it all tastes like iced tea right?\n\nI would go back but I doubt I would go on a saturday.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "So after my National board exam I met up my Aunty Venus and she said dinner is on her at Dallas BBQ. So I was excited because I was STARVING. We went to Dallas BBQ and sat down to order. She ordered the sticky wings and i ordered the chicken and rib combo with fries.\n\nLet me tell you the STICKY WINGS!!! WOW!! I'd put that sauce on my chicken and dip my fries in that sauce. It was very good!! and filling! \n\nThe ribs fell off the bone which was very good and my chicken was very juicy and moist! My stomach was fulfilled! It was a very good and filling dinner. \n\nBut STICKY wings is a MUST!!!  Get that and you wont regret it! \n\nI had a strawberry ice tea which was great!\n\nIf your visiting from out of town and want some BBQ this is the place!\n\nCustomer service was nice they seated me right away and took our orders quickly. Its perfect considering how much New York parking cost per an hour. \n\nSo you can get a great meal in a decent amount of time.", "author": "Jimmy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "Dallas BBQ is a \"Chain\" restaurant, as most of us living in the NYC are know, they have several location spread out throughout the boroughs.\n\nThe Food at Dallas BBQ is pretty much consistently good at any location that you visit, I particularly like this Dallas BBQ Location because it is to me. The Food is always consistent, inexpensive, and fast. The Chicken \u0026 Ribs combo is one of their most popular dishes on the menu, you get a little bit of both, at what they do best, \"Chicken \u0026 Ribs\". I have tried better BBQ elsewhere, but their BBQ is consistent inexpensive, and fast, this cannot beat matched anywhere in NYC, and the fact that their portions are huge. \n\nMost all meals come with a side and a Corn Bread. The Corn Bread at BBQ is amazing, it's like another meal all on its own lol, huge, delicious, and filling.\n\nBBQ has killer frozen Drinks, they are the best around, huge \"TEXAS\" size portions is the way to go. The have many options and flavors to choose from.  You have the option to choose your Frozen Drink \"Alcoholic\" or virgin, which allows \"drinkers\" and non-Alcoholic drinkers alike to enjoy their fabulous drinks.  A must try. \n\nI recommend this BBQ Location, it is HUGE and spacious, service pretty much always fast and friendly, but on occasions you may get slow service, but this is probably due to the fact that they are always busy.\n\nStop in for Lunch, they have awesome Lunch Specials that can be beat.", "author": "Leo L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "The bathroom was filthy, I sat at a table right next to the waiters POS computer and the garbage was overflowing, I ordered food and they forgot my fries I ordered a drink and they forgot my extra shot. The quality of service and food at BBQ's has gone completely downhill. Ew. I went to the one on Livingston but I won't be going to ANY of them ever again!  I wish I could give it no stars!", "author": "Jade S."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}