{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-13", "description": "Had yet another craving for a burger two days ago,after my huge disappointment with BK I wasn't really sure if the word hamburger would ever enter my vocabulary again but it did, and well this place was kind of ok i suppose,nothing really special to rave about, employees didn't seem to professional, spent more time flirting with each other instead of tending to incoming customers,the drinks are way to expensive if you ask me considering that this isn't even a high end joint, but i prefer the one on Time Squares though providing that you can get a seat.", "author": "Anubis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "Dallas BBQ has a great feel to it, and the place is great for both small groups and big groups. the food is SUPER GREAT (had to put a \"super \" because the food is really, really good). i gave it 4 stars because its a great place for lunch, and dinner and the prices are fair, i would of given it 5 stars but the place is always crowded and there's usually a long wait for a table.", "author": "Juan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-27", "description": "The food is pretty good I enjoyed the Buffalo wings, they were definitely to die for. the waiters are extremely clumsy and kinda unprofessional. The tall dark /African guy is the worst ever! Who in the hell hired his silly ass. He was such a bafoon, one time we ate he spilled ketchup all over the carpet. The next time he was actually our waiter he was silly and I just couldn't bare to think of him going near our food. You will see what i mean if you visit. Shout out to all my African people this guy is a bad seed! Then the manager was scarfing down his food and hitting the back of my seat with his back. we were about to catch a case, we had to exit real quick they were just slow and silly.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-11", "description": "Acceptable, if unexciting, lunch option in the neighborhood, and a cheap sit-down one at that.  The quarter and half chicken options will set you back under $10 each, and the waitress was excellent, serving us quickly within our hour lunch break.", "author": "L C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-16", "description": "Besides the long wait on weekends and on most nights, the wait is soooo worth it.\n\nBBQ's has ostrich size buffalo wings!!  The wings are to die for and the variety is amazing.  FIVE STARS.  The pricing is not expensive, even the one in the city has not bad prices.\n\nThe chili is good, the corn bread is amazing, the texas sized lemonade is great...but WINGS IS MY THING!  The wings are finger licking good.\n\nLarge tables get charged gratuity so beware and check your bill before you add tip.\nI drive from queens just to get some of them wings\nFIVE STARS!!!", "author": "K K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "The food it was ok nothing special, the presentation is so awful, they put all the stuff in one plate looks like a garbage.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "The food held up shockingly well for delivery. However. It takes me under a minute to get to the front door from my third floor apartment. In that minute, the delivery guy rang my bell EIGHT TIMES. Nothing is better with bbq than the sound of all the crying babies in my small building. Dallas, I know delivery guys aren't making a lot of money, but please ask them to never ever do this. It was soo annoying I'd hesistate ordering again.", "author": "Brooke T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "I personally love this Dallas BBQ's. It's the best one I've been to in NYC. I go to school near here so it's not uncommon to head down there at around 11 for their early bird special (Weekdays only) where you can get two half chicken meals (with a soup starter) for only $9.95. The prices are fair, I personally wish they had a few more options but that's not a fault of the restaurant. The only few downsides is that the waitstaff is inconsistent. Sometimes it can be really hard to get your waiter's attention, and other times they are in your face every five minutes. At peak times it can be a wait to get a table but never more than 10 minutes in my experience. If you have a large group this may be different for you. All in all I won't stop going to this Dallas BBQ's. I'm always greeted warmly and have never been disrespected or had a bad time there at all. Oh, one thing though the steak sucks. REALLY sucks. Stick to their chicken and burgers and you'll have a great time.", "author": "Jade W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "the best restaurant,,, the waiters are great.  the pina colada drink and the chicken wings,,,,delicioso  !  good d for family with kids  if u are on a budget.  u can order one meal for two.", "author": "Lorena S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-27", "description": "i went to this bbq for lunch today and had the meal for 2 which consisted of chicken vegetable soup, choice of salad, if i remember correctly or baked patatoe, and half a rotiserri/ barbeques or honey chicken. i also had a coffee.  the soup was good and the baked patatoe was good as well, but it wasnt amazing. the chicken was disgusting !!!! i keept picking all around until i found a piece i could actually stick my fork into, the corn bread same thing. the top was so hard it almost cut my gum if i hadnt moved it from the angle it was on , i actually would have. i dont know whether there was a practicle joke being played on us or what but i did not like my experience there today at all. when i asked the server for crackers to go with my soup she said \" she never recalled bbq ever  having any\" and proceeded to walk away, my friend then asked to speak with a manager because she frequents there all the time and had crackers there the week before and 5 minutes later crackers appeared. she brang the coffee with milk, no sugar and disappeared before i can asked her for some. by the time she appeared again, the coffee was cold. it was loud, the managers or who evr they were were fooling around with some of the waitresses that looked very unkept. this place has no class. it changed tremendously since the day it opened. i know ,y review differs from alot of these others, in fact i feel like i wasnt even at the same place. one good thing was that when i complained about the food, they gave me an option , to pay for patatoes and soup i ate, or wait for another order of chicken. i opted for another chicken and cornbread. so i took a break from the computer and decided to taste it, because it wouldn't be a proper and honest review if i didnt. i left bbq at 330pm this afternoon with new meal in hand , with the intentions of giving it to my husband and not tasting it all. its now 832 pm and i just tasted it...i loved it!!! to my surprise ..so here the big question, what day last week did you make the one i tasted earlier???? i could've of a wonderful experience despite not having sugar for my coffee... what alley was that picked up from??? it tasted like something a dog wont eat!!! but this food here in my togo box...i can honestlt say , i at the chicken off the bone. waitresses still need to clean up!! they look a mess!!! so i change my stars to 4 for food if you end up with the right plate and a 1 for service, cause they were dirty looking shirts in there!!! and no class waitresses!", "author": "Mia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "2 words BEEF RIBS! I don't eat pork and it's getting increasingly rare to find beef ribs. DALLS has a nice sauce and I love the sticky wings. Mustardy, tangy, delicious. Oh and the drinks. WOW. They're huge and they don't skimp on the alcohol. Always a favorite stop to eat in NYC.", "author": "Jan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "Alright I've been here a few times.  It's the same food, same great cheap texas sized frozen drinks (woo hoo), service, and ambiance as the other locations. It's not a place to go out of your way for, then again none of the BBQ restaurants are but if you are in the area it's a good option for decent food.  One more Woo hoo for texas sized frozen drinks before I move on.", "author": "diana m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-05", "description": "i just came back from dallas bbq. omg. this palce was so crowded, it felt like i was at a concert at msg,seriously. the line was out the door for people who wanted to be seated, it was so bad that they had to give out numbers in order to get a table to eat in. the line was no less short for take out. there were at least 400 pepole in there, and the sign in side said 250 max capacity. i orderd the full order of wings, one fries, one garden salad and a texas size blue hawaii. i had to stand at least 20 minutes for my food. if the wings were not so crispy and tasty and the drinks frozen i would not even come to this place.", "author": "Sharlene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-15", "description": "The food is good.  but the service is poor, quantity is good \r\nfriendly atmosphere,", "author": "Puneet C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-06", "description": "Though I rarely go to Brooklyn, here is a reason to go. These are big portions, if you are a light eater you can share. Their texas size drinks are pretty good. Fun friendly service makes it a cool place to eat and drink with friends.", "author": "Ali H."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}