{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "Ginormous bustling inexpensive restaurant with huge drinks and tasty, filling food. It attracts legions of loyal fans who consider this a choice location for Date Night, Girl's or Guy's Night, and Family Night. This is not Serious BBQ. My friend who moved to Austin and became a BBQ expert will probably make a snarky comment about this being the Applebee's of BBQ, and that's true. This food is to authentic pit delicacies what Mexican food in NYC prior to the late 90's was to the real thing -- barely recognizable to true aficionados but still a flavorful way to sate hunger. Their to-go chickens are a good deal, and the Onion Loaf is delicious in a kind of gross way.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "Had a great time with my family, but the manager (a tall thin guy) has a major attitude problem, and a waitress had the nerve to be pissed when she thought I shorted her tip by a dollar", "author": "Chantel E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "The Sticky Wings are Amazing!!! \n\nFast service and the portions are HUGE!!!\nThey have this special that 2 people can dine for $9.99. \nIt includes soup and half of chicken, rice or baked potato and corn bread. \nThis place is always packed for lunch and dinner. \n\nJust wondering why they don't have a dessert menu...\nThen again you are too stuffed by the time you leave here!", "author": "Touro T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "This is not the place to come to for a first date. The place is loud and you have to yell in order to be heard. By the time I left I was hoarse. The frozen drinks are good especially with the especially with the extra shot of 151 Vodka ;-). I ordered the Hennessay wings. I must say, I don't think Ive ever seen such big chicken wings in my whole entire life. Even though their extremely sticky, they were pretty good. The service was good and the waitress was pretty cool...", "author": "Tracy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Four stars are for the cheap humongous drinks.  The restaurant is super LOUD as in I had to scream across the table to my boyfriend.  I've eaten at the BBQ in Chelsea and had heartburn every time.  I won't eat the food here because the portions are waaaaaay too big and too much grease kills my  digestive system.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "I know when you first think of this place, you may not be thinking great thoughts but you might be surprised! I have to say the chicken vegetable soup is something to dream about. It reminds me of when i was a kid and my mother made me soup when i didnt feel well. The prices are also very reasonable.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-17", "description": "I used to swear by this place.  Unfortunately the last three times I went I ordered the honey based chicken with a house salad, yellow rice and an apple martini and was sick by the time I got home.  On one occasion my cousin ordered something different and felt really sick after wards.  The same exact thing happened to my mother on another occasion. What are the odds of that?  I used to think it was just me but it's not a coincidence that a lot of people I know keep getting sick. It's crazy; we all thought the food tasted good, however we all ended up sick.  \n\nA few years ago, I started eating at the Brooklyn location because it's convenient. Before the Brooklyn location opened, I always went to the location near Central Park and West 72nd street in the city.  Needless to say I am willing to give the city location another chance instead of writing off the restaurant chain completely.  I'll let you know how it goes.", "author": "Erin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-31", "description": "If I could leave zero stars I would. Since I've finally recovered from the worse bout of food poisoning I've ever had (I mean the type where you're doing some serious bargaining with God, Allah,  Yahweh or whatever deity you believe in, ALL from the comfort of your bathroom floor and/or toilet while have hovered over the sink at the same time) I can honestly say that I will NEVER EVER EVERRRRRRR buy anything from here again!!! Gotdamn dirty shrimp.", "author": "r b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "Every time I come here the food is on point. I usually order the Henny wings, (Hennessy wings), the sticky wings, or the honey chicken half with mash and cornbread.....so so good! The drinks are even better especially my favorite Pineapple Crush. This is one BK establishment that makes me proud. Sure sometimes it is very crowded and like every crowded restaurant the wait is long but the food and drinks never disappoint me. The servers are straight to the point, sure it's nice to have a friendly waiter but I didn't come to have a conversation with the waiter, I came to eat! As long as my order is right, my food is hot, and my food is good, I'm good!", "author": "B T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "World's absolute BEST pina coladas (virgin, of course)!  It'll set you back $8 but it will be the best 8 bucks you spent for a drink!  Food is excellent as well.  Always a great stop!   Definitely a casual atmosphere.  Good service.", "author": "Jeremy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-22", "description": "I went here for lunch with my friend and we got two huge plates of food (a half chicken, baked potato, and huge chunk of cornbread) and a chicken vegetable soup for the lunch special price of 10 dollars total! For the amount of food, that price was great. Sound too good to be true?\n\nIf you said yes, you'd be right. The food had an absolutely disgusting odor emanating from it, and when I flipped the chicken over to cut it it could only be said to resemble a dead animal caracas. The person I was with claimed it must have been the sauce I chose to have it basked in (honey BBQ) but in my mind, this is hardly excuse. \n\nDowntown Brooklyn has lots of other great discount eats. Skip this one.", "author": "Grace A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "It's a chain, I know that. But it should be consistent. Food-wise, it's been pretty average but as far as service goes, it's a hit or miss. It was the shiz 5 years ago when I started college and loved the portions and the cheap prices but now it's just so drab. I don't think there's anything that stands out with their food aside from the way too sticky wings (which the smell alone hits you so hard that you just can't stomach it) and their Texas sized drinks. Their mixed drinks are so watered down that it's not worth it. I definitely had some fantastic memories here though so I guess I'll keep it as that.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-02", "description": "Service Snob alert! wait, it's not because I'm a \"snob\" it's because the service AND the food were sorely lacking at this establishment!\n\n1st, let me say I'm \"from\" Texas. Oh, wait, maybe this was actually named for some guy named \"Dallas\" not the city in Texas. Nah, they had \"Texas\" all over the menu.\n\nFirst, they had GREAT glasses, reminded me of George's Big \"O\" in Waco...now that is a place I've never had a negative thing to say about!\n\nThen, the fried little onions on top of the food was awesome!\nAfter that, it all went down hill. Steak and Ribs were cold, not even lukewarm...C O L D. Even if they had been lukewarm, by the time the waitress returned to check on us, they were even C O L D E R. The offer to put the meal request in again was nice, but it took 20 minutes, at which time it was not feasible to eat the food, some people have lunch 50 minutes, and even then I was over an hour at lunch! Add another 10 mins to get the check, and DAMN I didn't have exact change...so add another 10 mins for that. (Don't you love it when you give them a $50 bill for a $20 meal and they actually have the nerve to ask \"do you want change back from that?\" and I wanna say \"   ..\" oh, not gonna say anything really trying hard to be a responsible yelper..you fill in the space and dots betweeen the quotes!\n\nI can't say I would down all the DBBQ places in NYC based on this one. I will say diner B E W A R E. This place is like a black hole, be fortunate if you come out able to yelp about it!", "author": "Reba P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "good place to meet up with friend for lunch, waiters were very attentive !! best things are the drinks considering most of the menu  to be fried food but i had a great experience.....", "author": "Kimoralee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "This is a must do if you are in the Brooklyn Area - Great unique BBQ in the heart of NYC. We usually go to the Brooklyn Tabernacle and have Sunday dinner here. I love Sundays when Dallas BBQ is involved.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-15", "description": "Love the texas sized drinks. Could get loud at times but a great after work hangout spot. Fridays and the weekends it gets really crowded. So get there early or take a number and wait outside.", "author": "Ramon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I like this place. I've been to the one in Chelsea multiple times. \nGo here if you have a urning  for barbecue. It's quite good. I like it the food has always been consistent. It's not the best but it's consistently above average and if you want hearty food in a convenient location, here is the place, right in the middle of downtown Brooklyn.\n\nI always feel good after leaving here!!", "author": "Brian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-08", "description": "Very good ribs and shrimp!!!!!  Yellow rice and corn bread was ehhhh. Good service also.", "author": "Keisha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Horrible seating. EVEN WHEN THE RESTAURANT IS EMPTY as a party of two we weren't allowed to sit where we wanted on two occasions, which is enough for me. If I decide to go to another Dallas BBQ's, I'll test the SEATING before the food.", "author": "Ellen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "Ahhhh....So many good times at BBQ's! I swear those Texas Sized Margarita's are a god sent! And I think I should know being a Texas girl and all. \n\nOne time I finished one (including the extra shot) all by myself and then proceeded to drink half of my friends....But I'm a pro kids...don't try this if your an inexperienced drinker =) \n\nOh yea...they have food too! LoL...in BK there was always a line for a table during dinner almost every day of the week...goes to show you how awesome it is. I usually got the baked potato, honey glazed chicken and cornbread. So good!", "author": "Amanda M."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}