{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "This spot very crowded for the lunch rush. It looked like they were giving away free meals. I was fortunate to be seated right away since I was a party of 1...(I know, sad.)\n\nMy waitress was cute, took my order and got me my $5 chicken sandwich lunch special with fries and cole slaw. \n\nIt was cool and I'll probably be back if I'm in the area, but there are better BBQ's to go to.", "author": "Edgar S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "I've had different experiences with this particular BBQ's. Deff not good for large groups, as they try to overcharge you and the service is less than amazing. I guess they don't try very hard when the tip is included. Went here for a friend's birthday last April, we had a large group, about 30 ppl or so. One person found a wire in her salad, they took it back and gave her a new one. We got the bill and they overcharged us for plates of food and drinks that no one ordered. Spoke to the manager and he seemed to not care.\n\nOther times when I go with smaller groups, the food is on point, the service is pretty good and the experience is overall, much better. Sticky wings and Hennessey wings are AMAZING! Drinks are on point. Very accessible location. Deff better than travelling to the city.", "author": "Lori T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-27", "description": "This was the worst service that I have every had. It took 25 minutes for the server Jazz to come to the table to take the order, and then when the food was brought out the order was wrong. That was my 1st time at this restaurant and 1st impressions are everything, I wouldn't recommend this restaurant to my worst enemy, I wouldn't want them to waste their time.", "author": "Trina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "I usually only come here for the lunch special.  It's a steal at $5, and comes with a chicken breast sandwich (Actual white meat cut straight off the rotisserie), a large helping of fries, and a small side of coleslaw and bbq sauce.  The sandwich is pretty large and I always seem to have leftovers to munch on later.\n\nA heads up, the dining room always seems super, crazy busy during lunch (at least at the BK location), but the craziness can be avoided by opting for take-out which is what I do 9 times out of 10.", "author": "David E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "Terrible Place, Policies and Service!  I went there with a bunch of students from a nearby college yesterday!.  I should have know better than to select this place, however, being that I was with college students who are on a budget, I decided to give Dallas BBQ a try!  BIG MISTAKE, it started with a really ridiculous policy that does not allow customers to be seated without their entire party!  GIVE ME A BREAK, I REQUESTED A TABLE FOR 9 as soon as I got there and that was at 5:30 when it was relatively empty!  I was told that I would have to wait for my entire party!  Mind you there were already five of us there  and we were cold, hungry and ready to start to drink!  So the fact that they would not sit us until everyone showed up was really an inconvenience, not to mention that it also put us in a bad mood!  After insisting 20 minutes later that I wanted to start to order, they finally relented and allowed us to sit with my now party of seven.  By now it 5:50 and the place is packed so we ended up in a Booth for six right next to the kitchen!  Remember I said a party of NINE!  This TERRIBLE RESTURANT and I use the word RESTURANT LOOSELY, then proceeded to place a small crappy table for two on the end of the booth for six and add a chair to the table for two making it now the smallest table for three that I have ever seen in my life!  To top it off after I complained for the 100th time, I was simply told that they could add another table for two (which I may add we never got).      Now were are finally ordering and the waitress was so slow that all of our food came out so late and by that time we were just so upset and disgusted with the entire experience that we just paid the bill and left!  Mind you it was a party of nine and we were there to spend cash, eat, drink and have a marvelous time!  NEVER AGAIN!  OH and did I mention that the bill had a gratuity of 15% already added to the bill so imagine my surprise when after paying the bill, I get NO CHANGE (WHICH WOULD HAVE BEEN $9.68 CHANGE BACK FROM THE ORIGINAL BILL PLUS THE ADDED 15% GRATUITY!  When I asked for my waitress, I was told she left for the day!  So not only did I have a horrible experience, I got robbed in the process also so on top of the demanded 15% gratuity, the waitress kept my change!    :((((  I was not a happy camper and I nor any of my students are ever going back to this place again!", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Came here after my flight from Miami, so needless to say i was hungry. As soon as we walked in we were greeted and sitting down looking over the menu.\nOur waitress was super friendly, The service was great. The food was good, nice portions and drinks were VERY good.\nI would definitely come back the next time I'm in Brooklyn.", "author": "Ellena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-08", "description": "TERRIBLE.  CROWDED.  At 5pm had to wait in line for a half hour ...ok it was a Friday.\nLOUD.   The food is BAD.  The chicken wings are SKINNY....the fries are GREASY and sweet!?  eeech.  The beer was good, but it was beer.  This proves that sheeple will eat anything!", "author": "Dee .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "This location is on and off for me. Last time I came here the manager was about to fight some bird. Don't really know what happened but she was clucking and he wasn't having it. This location stays open pretty late so that's a plus. BBQ's is not consistent. Not never. This location is the best one I've been to. The one on 23rd is my second favorite. I usually stick to one of four things, sticky wings, Henny wings, shrimp platter or quarter chicken with honey glaze. Don't get their lunch special chicken sandwich. It's dry af! Always stick to dark meat, it's juicier. Their corn bread is average, cole slaw is the bomb and the yellow rice is so delicious with the scallions on top!! I dream about that scallion yellow rice. The drinks are really good and strong. Had a mango Patron daiquiri. It came with an extra shot, smh. Never go to the Times Square location. That location killed it for me for years. Mind you that was my first time trying BBQ's.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "The only thing worth getting at BBQs is a Texas sized drink. Das it!\n\nService is fine. Location is fine. This restaurant is significantly smaller than the Chelsea location. The bathroom is super cramped. It gets really loud. Like really, really, really loud. I could not hear the music, had to yell, and could hear a party or two being really rowdy.", "author": "Roberto A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "I loooove Dallas BBQ! \n\nOkay so I come here purely for the drinks- huge, no skimping on the liquor and not badly priced.\n\nI've had burgers ribs and roasted chicken there before: all sub-par. The fries however are great and tonight I tried the BBQ wings: HUGE and great! I swear they were more like turkey wings!", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "I love this location. I've been around to a bunch of the Dallas bbqs in manhattan and brooklyn and this ones always fun. Great bar scene, fun after work crowd. The drink specials can really get you going. I'm a sucker for BBQ: ribs, cornbread, Mac and cheese, WINGs.  The wings are instance. They are the size of a small human arm. And the meat just falls right off. The hot is good and hot but if you're lookingn for sweet you should try the henney wings. They go great with... You guessed it... A glass of henney!!! Anyways if you can't get into dinosaur BBQ (they just opened up a brooklyn location) this is a great place to check out. Reliably good food, won't break your wallet, and like I mentioned above, a good fun scene. A great place to go for a birthday dinner or a group holiday dinner or to celebrate a special occasion.", "author": "Fred C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-16", "description": "Somebody got arrested while we were here. That's basically the nature of it. Super trashy BBQ where it's fun to get drunk.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "Went here for a late lunch on a Saturday afternoon.  It's a fairly large establishment and it was PACKED.  Noise level was pretty loud, if you're looking for a quiet environment, this isn't it.\n\nThe food was pretty good.  We had hot sticky wings to start, which were delicious and crispy.  For our meals, he had delicious beef ribs, and I opted for BBQ chicken and ribs.  The cornbread is also good eatin',  and they certainly don't skimp on portions.  It gets messy, so ask for some more wet naps! Also had a Texas sized Tequila Sunrise, which had in my opinion more liquor than most other chain fishbowl type drinks.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "I came here with a coworker to check out their bar and happy hour and much to my dismay, they don't have either! But we sat at a table and were able to still enjoy some yummy wangs and frozen drinks!\nOur waitress was super friendly and nice and she gave us tastes of the Hennessy Pina Colada and the Strawberry Long Island Iced Tea. I am usually a wine or scotch gal, but when in BBQs, drink what they are known for right? I loved the Hennessy Pina Colada and got that regular sized with an extra shot. My friend got the Texas sized Strawberry Long Island Iced Tea with an extra shot and we were both feeling a nice little buzz upon completion. \nTo snack on we got the wings with honey on the side. Super crispy and perfect with the dipping sauce. My friend is a BBQs pro so he knows what's good and having the sauce on the side kept the wangs crispy and less messy to eat. \nEven though it wasn't the traditional happy hour experience, it was still a great time and a lively spot for yummy fun drinks and food. I will be back!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "Oh HECKY NAW.. like we say in Detroit,\nYou all have read my reviews and know that I love BBQ but I will stick to the one in the east Villiage. \nI cant not deal with this one's atmosphere or policy. First they will charge you gratuity even if you by yourself and come in after 8pm. I wasnt worried on this day because it was like 330 in the afternoon. \nI had a friend come in town and of course one of the first places i was going to take her was my favorite BBQ spot.. but .. being lazy we went to this one that only down the street from us in stead of going to the city well we learned our lesson.\n\nyes it was bigger and had a more open space. but this was only March 17th and the first Hot day we had all year.. 72degrees outside and 90degree on the inside.. are you guys nuts where is the Air conditioner or even a dam window. sorry that's how i felt. I had been boasting about how great the food was but today is wasn't all that. \nWhen i say something is good people agree and taking my friend to this Particular BBQ made me feel like i was a liar. i wanted to leave and Go to the east villiage one Just so we can compare. \nI was like a sauna in there and at least groups and crowds of large families and people talking super loud.  I hate siting that close to people and they had us supper close. ehh it was like people next to us was at my table.. I'm sorry we all originally from Detroit and they Don't crowd people in restaurants like that are you crazy. \n\nnot to mention they had two host mixing up tables and messing stuff up. one asked us How many, then found a table.. then ANOTHER chick comes up and says the same thing...???? we say 3 again.. then the other chick returns and says follow me.. okay.. umm you need to ask before you try to seat a table that is already in the process. Later I notice that one family was told to be seated in on spot and then.. there was no table over there.. because another girl was sitting people in the same spot.. GOODBYE..lol\n\nI raved about how even the cole slaw is good but at this place i think they cut back on some of the ingredents because it was Nasty as H$#\u0026. then We order the Famous onion Loaf.. they lady claimed it cam with no sauce Yet They give us Sauce Every time we went to the other one in the City.\n\nI still love BBQ but this one DOESN'T EXIST to me... maybe thats mean but they need to get it together. wont ever be back here unless I'm just drinking... thats IT!! cant Mess up a Great drink..", "author": "Deprina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-30", "description": "Please for the love of God don't order their steak.  \n\nWith that out of the way, the rest of their food is just okay.  The highlight to their menu is the wings.  I ordered sticky wings but what I got were plain fried wings.  (minus 1 star).  I was a little disappointed but I'm not one to turn down anything fried so I ate them anyway.  They were flavorless for the most part but the amount of crispy skin that they had made up for it.  Ahh who doesn't love eating fried chicken skin?  *has a moment*\n\nUm, this location is in downtown Brooklyn and as much as I love my borough, I'm not going to sugar coat this, you will be seated way too close to ghetto people, annoying screaming children, and cheapskates that run in here for the lunch special and gawk at your Texas sized drinks wishing they could order something other than water (minus another star).  The worst thing out of that group is the screaming children.  I just don't understand why so many people bring toddlers to BBQ's.  Nothing on the menu is healthy enough to not clog their poor little arteries which is probably why they all go there JUST to cry and scream and run around like rugrats. \n\nI'll go back when I'm 21 so I can get schwasted and maybe then the food will taste better and I'll appreciate the \"atmosphere\".", "author": "Emily M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "First time visiting the establishment, wasn't sure what to expect.  I got seated with my friend's family.  My friend and his wife ordered the combo special, which came with chicken, rib and steak along with pita bread, fries and fried onion.  I ordered the full rib with yellow rice.  I also ordered the Onion Loaf, BBQ Beans and TX size diet coke.\n\nIt took about 15 minutes to get our food.  The combo plate was that... combo plate; they stuffed all the food items into a single dish.  I was blown away by the onion loaf... it was about 8 inches tall and 8 inches wide... it was awesome.  \n\nI enjoyed my rib, the sauce was good, the rib was tender and the meat fell off the bones.  The rice was okay, next time I go, I'll order something else as a side.  The BBQ Beans - must have, they were excellent, best BBQ beans I had in long long time!  The BBQ Sauce they had on the table was okay - I had better sauces before.  It would have been nice if they had couple different flavored sauces on the table.  \n\nThe service was quick, we got seated right away.  It took us no more than 40 minutes to sit, order, eat and enjoy our food.  They do charge 15% tip if you have 5 people or more... i just saw my recipt and realized i under tipped the wait staff :( \n\nI would go back again and enjoy the meal.  Next time I go, I'll try other foods on the menu.  Give it a try if you are in the Brooklyn area.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Didn't know until late that they have great carry out menu. Fast service and great food!", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-25", "description": "I come here only for the Buffalo wings, which are the HUGEST, I have ever had. They are crispy, and tasty. Get the BBQ sauce on the side, to dip it in and never forget the blue cheese. I also get the lil garden salad - they raised the price on it recently. I always order a Texas size drink. Usually a margarita or daiquiri. The place is always packed, there is a long wait, and people will \"people watch\" as you eat. The tables are way to close to each other, I wish it were more spaced out. \n~ But it's good for the money.  The staff is always in a rush, because they have many tables to tend to at a time. Doesn't deter me from going back though.. I'm just so happy that they finally came to Brooklyn. The street parking is a bit tough though.", "author": "Rica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "I really enjoy myself each time I go..i always order their special tasty ribs ummm.. in fact this is where i had my first drink lol", "author": "Cassia H."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}