{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "(Sunday August 12th 2012)No Complaints,Didn't Have To Wait For A Table,Our Waiter(Will Post Her Name Soon) Was OUTSTANDING!!! Came Back To Check On Me And My Friend A Few Times, Ask Did We Need Anything.Definitely Not Like Other Waiters That Pass By You Or You Have To Flag Down Just To Get Service....Food Was Very Decent And Reasonable, I Had The Baby Back Ribs With Fries And A Strawberry Bulldog(Don't Matter Which Flavor You Get,The Bulldog Is A MUST TRY)Not To Packed And The Noise Level Was Alil To Loud But Yeah I Went To Eat And Enjoy Myself", "author": "Maurice W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-07", "description": "This place is inexpensive and the portions are large. This includes the drinks! This place has a large dining area and the dress is casual/comfortable. The service is fast. We were seated right away and received our food and drinks right away. The food was good but it tasted just like typical bar food to me - nothing special. Atmosphere is that of a bar; noisey. I did notice the tables were very close to one another. You hear EVERYBODYS conversations.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-23", "description": "I hate BBQ food.  I never order it, but my good friend just graduated and she picked this place to celebrate.  \n\nWe ordered:  \nBaby back ribs w/ french fries - My bf said the portion was too small.  \nShrimp Cocktail - the sauce was spicy and good.  \nCrab Cakes and Crispy Shrimp - the crab cakes were the size of pebbles aka small.  \nCornbread - check plus.  \n\nI didn't have a problem with the food, but it is sooooo F%(*#$\u0026 loud in here.  My boyfriend had to talk using his \"outdoor\" voice and I can barely hear my friend who is sitting right next to me.  Sheesh, people are just too excited for BBQ food or what.  \n\nThe waiter tried his best, but he was getting slammed with tables so he was mostly M.I.A.  The line for the bathroom took about 10 minutes because women take forever, and one of the stall was out of order. \n\nI also hate that they give you the check with a calculated total for an15% or 18% gratuity because thank you, I don't know how to add.  \n\nI am not coming back, and I repeat in my shout-it-out voice - I WON'T BE BACK BECAUSE IT'S TOO LOUD IN HERE.", "author": "Kiki R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-20", "description": "Terrible. Food was bland and dry. Service below par. Hot wings were okay and massive (each contain both the flap and drum together so keep that in mind when ordering).", "author": "Jason N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Yes I give it 5STARS. my girlfriend and I come once or twice a month for a good drink! STICKY WINGS RIBS SHRIMP \u0026 CORNBREAD! Always a good time and always a pleased stomach. But last night was by far the best FOOD HOT and great service!!! Delicious and our SUPER MAN drink hit the spot. Thanks to our great SERVER Manny aka Emanuel whom was awesome and very attentive. Must ask for his seating.", "author": "Tia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "We usually only do take out when frequenting any Dallas bbq because its just best that way.  The go to items are sticky wings and angry shrimp.   Also if you are feeling like you need a lil something to go with the chicken and shrimp then get cold slaw as a side accompaniment.  Avoid the fries unless you like limp and wilted fries. The dine in experience is basically an experience in itself and just best to get your food to go.  The take out is very quick and not much of a wait.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "For a chain restaurant this is good food! I think more of a 3 1/2 stars type of place. Doesnt measure up to Dinosaur bbq or famous Dave's but its still a good lunch spot", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Went here when we visited New York several years ago, it was highly recommended, and it lived up to it. Tasty food, large portions, family atmosphere, great service. You must try it when visiting New York.", "author": "Floyd T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "This is hands down the best BBQs I have ever been to. The establishment is very clean, the staff are extremely friendly and the food is great. I would strongly suggest trying the hennessy wings!", "author": "Zaynah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Pina Coladas and frozen drinks are great! The food is just ok... Crowded over the weekend, it can get kinda ratchet. The kids love it but in my opinion its nothing special. If I come its for the drinks, wings, shrimp and cornbread. The barbecue ribs dont do it for me, meh.", "author": "Helmut D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-05", "description": "Some of the reviews mentioned it was loud,  this is an understatement!  I had to put kleenex in my ears.  If they had appropriate spacing in between the tables it might help a little.  Our server Manny,  had such body oder we had to cover our noses when he came to our table,  nor was he any help with menu questions.  I ordered the baby back ribs,  extremely dry.  So dry I didn't even take the leftovers back to my hotel.", "author": "Sherri B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-16", "description": "I only do take out at this place, good food. Ordering on the phone cuts down on the time.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "I've been through the deep South. I know my Southern food. Dallas BBQ isn't the world's best, but it's the best I've had in NYC, and that's what counts. Their ribs are succulent, and I love their crispy shrimp. The cornbread is fantastic, and who can go wrong with a Texas sized margarita?\n\nConvenient location. Not the best atmosphere, but a fun place. Good times. Get drunk and eat meat, y'all.", "author": "Stefanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Very good sticky wings, REAAAALY GOOD pina colada. The environment is pretty loud, and dark, but the foood is good so it's fine", "author": "Bob L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I've visited  this business  twice  before  ,but at other locations  and I've always loved the food. The atmosphere  gave a urban vibe ,which was fine with me . Rap and R\u0026B videos  played on all of the flat screens. I ordered  the sticky  wings with fries and a libation. The wings are really  big I only ate two and couldn't  eat anymore. My friend's loved their  food. We decided  to split the total bill 3 ways ,which should  have been about $37 bucks each,however  the waitress  screwed  up the charges and put the whole tab on my debit  card. My bank  put a block on my card because  she put in a total of over  $100  . I had to wait  on the phone  for over 30 minutes  trying  to confirm  my identity and remove  the block with the banks customer  service . After  verifying  I was myself  the block  was removed. My native  new York friends  told me that this restaurant  is a hot stop for stolen  cards so that visitors  be sure to notify your bank ahead of time if you're  a visitor.  Overall food was fantastic.", "author": "Latrice G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-27", "description": "Looking for authentic (and good) BBQ in Brooklyn...go to Fette Sau.  Dallas is the McDonalds of BBQ.  Cheap price, yes.  Cheap food, yes.  Went on a Wednesday and while I sat and ate...the manager/bouncer told a customer that he better \"shut the F*** up\".  Also witnessed a guy slap his girlfriend on the way out of the door.  Very classy place.  \n\n\nCorn bread was good!", "author": "Andrus g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-12", "description": "Two stars!\n1 star for the Texas sized drinks( Really good)\n2 stars for the sticky wings :-)\nOther than that Dallas BBQ is cheap but always packed.", "author": "Patti E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "Today I was at the Dallas BBQ and I had chicken ceaser salad and it was amazing that restaurant can hold it's own . The food there were excellent especially what I had . Next , time I'm going back there again . It were noisy but I didn't care .", "author": "Tonia F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "I want to love the BBQ's Brooklyn location, I really do, but it's always.... lacking.  I can't blame it on the staff, they do the best with what's been given to them.  The atmospere when it's empty is okay enough, but when it's crowded UGH, I hate this place. \n\nWas recently there for lunch on Thursday, crowded and loud, and pardon me but  GHETTO AS HELLLLLLLL, Rey Rey and them in this corner cussin and carrying on over paying 6 dollars for a shot of hennessy and some loud woman on the other side threatening the waitress that her scrimps \"better be clean\", (yeah I said \"scrimps\") \n\nBBQ's isn't exactly gourmet fanfare and the food is okay, but most people come for the Texas Size drinks.  \n\nI find the wings there, especially the hennessy barbecue wings are really great.  The baked potato is always big and hot, served just right.  I enjoy the taco salad, and the ribs, both pork and beef, are decent.  (Although the beef are huge and might be a bit much especially if they are fatty).  I think the chicken always needs some kind of seasoning, but that's just my opinion.  The portions are plentiful and you will definitely leave full, but please come with a sense of humor, and take things with a grain of salt.  \n\nI wish  they gave more wet naps, but hey,  you can always ask for more.", "author": "Cassandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "When u go for a party of 4+ you might not like it unless u don't mind waiting then by all means.. But I usually go with 2 but I get the onion loaf which isn't as good as it used to be in 2010 it's not as crispy  but I love onions but their henny wings is great and they henny colada is my favorite.", "author": "Nakoyi R."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}