{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "In my College years, I was the avid Dallas BBQ'er and they basically never let me down. I always have the same meal yellow rice, cheeseburger, and a frozen drink. No harm, no foul, reasonably priced and go about my business. I haven't came here in quite some times, but decided to come here on Christmas night with the family. Surely wasn't my first choice, but I obliged. It was not very crowded and immediately sat down. The server was nice and attentive. I was expecting a loud and ghetto atmosphere but it was mellow probably because it was Christmas. \n\nThe food was prompt and I didn't have any complaints. However, my companion did have some issues with her \"crab cakes\" which looked like meatballs with BBQ sauce, I was none too interested in trying them, but after she ordered them, neither was she. I did not go in with super high expectations and I had a decent time and meal. \n\nThey should do something about their bathroom though, it's not in the best condition.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Take it from a chick from TX who knows her BBQ...this place is gooooood! The Atmosphere is so much fun! I had the ribs and shrimp...yum! But the best part was the service and the drinks! I had the big margarita with the Corona in it (sorry, I can't remember the name) and it was perfect. And Denisia, was amazing. She recommended the perfect combos, gave great suggestions for other things to do in the city, and was all together friendly. I love to try different places when I visit the same city over again, but I'd definitely go back here.", "author": "Kesha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "So I ordered a Chicken Caesar salad for delivery. Almost halfway through my salad I noticed a fly in my salad. I called the restaurant to tell them, and they insisted on giving me a new salad(as if I would want to eat from the again),but I kept telling them I wanted my money back. The manager told me he was going to deliver my money back to me, but never called or came. Had to walk back over there after work, and the manager act as if I was bothering him. I only asked for my money back, I could've did worse than that. I just know I would NEVER eat from this location again.", "author": "Shanequa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Wow this is an amazing place. This is remarkable to say, but these were the best chicken wings I have ever had. Our daughter also adds they are probably the messiest! We attended the Brooklyn Tabernacle Church this morning at the 11 AM service, and Dallas BBQ is literally right across the street. Perfect for Sunday lunch.\n\nI ordered the brisket sandwich, which was delicious, but if we come again I would definitely go with the Hennessey Wings. Our daughter ordered just five, and they were huge, plenty to share.\n\nMy wife and oldest daughter ordered the quarter chicken with white meat honey basted, and they loved it. The portion of fries was extremely generous.\n\nDraft beers were not working, which was not a big deal, they still had good bottled beer options. Free cupcakes for dessert!\n\nHighly recommended, a friend had told us this was a place not to mess in New York City, and he was right. Wow you will not be disappointed at Dallas BBQ!", "author": "Wesley F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "I've been here so many times and surprisingly I've never remembered to leave a review. This is your run of the mill chain restaurants that are located in almost if not all of the 5 boroughs. They have huge drinks, giant sized wings , ribs and cornbread for the \" low low\". The same money you might spend on a McDonald's meal you'll spend here (maybe a bit more depending on what you order). I normally always get the wings, the shrimp, fries and cornbread on one rare occasion I've tried the salmon and it's a no for me ! Stick to what you know. The service is basic sometimes you run into nice waitresses other times not so much. You can definitely bring your friends from out of town here or even your S.O it's even good for a girls/guys night out. It can be a little bit rowdy sometimes due to the crowd but I've never experienced any actual physical altercations. So I definitely recommend this place keep your expectations low though. Don't expect to much it's a regular barbecue establishment lol.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Always a great time and good Vibez. Our waiter was amazing. The portions are huge and taste is on point. The Henny wings and DELICIOUS!!!! The Henny Burger was OUTRAGEOUSLY GOOD!!! Perfectly cooked and the icing on the cake my frozen big boy margarita", "author": "Rafael B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Let's start with the seating, why is everyone sitting so close to each other? Might as well pull your tables together because everyone is literally sitting on top of each other. The food at this place is disgusting. I came here to celebrate my friends birthday at her request. We had a party of 8 \u0026 everyone had a complaint about their food. I ordered salmon with shrimp \u0026 a baked potato. The salmon was so spicy, It was ridiculous \u0026 nowhere on the menu did It mention anything about It being spicy. The shrimp had a weird taste to it, I couldn't even eat it. The baked potato was the only thing on my plate that I didn't complain about \u0026 actually ate. We left about $250 dollars at this place and no one enjoyed their food. Aside from the food the Texas size Margarita, henny colada \u0026 Bahamas mama drinks were really good. I won't be returning to Dallas BBQ and if I do it's to sit at the bar because their drinks are actually better than their food.", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Underwhelmed during my first visit. Didn't really mind how crowded and loud it was but I could've gone for better service and food.", "author": "Erik B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "Great portions and price! The huge ribs are highly recommended! They are cooked to be juicy, tender and flavorful! Downside is that this place seems unorganized and customer service should be improved!", "author": "Ye T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "Good food very nice place for you and your family to grab a bite to eat or for you and your significant other.. I don't go there often because I'm always trying other places out but when i do the food never lets me down.. Always on point..", "author": "Tito K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "This place have roaches a damn roach crawled across the table while we was eating  and the manager act like he was mad at us because I told him we wasn't paying for the food his costumer service was horrible I would never go back to this restaurant again", "author": "Derrick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "I came here for my sister 's graduation.  I ordered a salmon with shrimp And French fries.  We were a party of 5. Food was great, correct, and came out on time. Our waitress was very much on point. The only thing is that I wish their bathrooms weren't so cramped.", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "We came in at 4:55 P.M. We asked for the early bird special. The waiter said we were too late. Printed right on the menu: EARLY BIRD SPECIAL available until 5:30. Second problem. We ordered 2 half chicken dinners. We got 2 quarters dark meat. Third problem stale hard and burned corn bread. Fourth problem we had movie tickets and time was tight. We told the waiter to please give us the check. He stood there doing nothing for an additional half hour. We went up to him and put the money in his hand including a very generous tip that he definitely did not deserve. Next thing you know the manager would not let us leave, accusing us of skipping out without paying the bill. We had to wait an additional 15 minutes while someone found the waiter to verify payment. We will never be seen in this despicable place again. It deserves ZERO STARS. ACTUALLY LESS THAN THAT!", "author": "Richard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "It's always a good time when you come in here regardless of the actual location. The wait is always worth it once you finally get inside and get one of those frozen drinks. The Henny Colada is one of the best that they have. The Superman will always be an all time favorite of mine. This is a drink they need to bring back as a permanent drink on the menu. However the Henny Colada is my all time favorite drink and if you haven't had it then you definitely need to give it a shot and make sure it's a Texas Sized Glass. You won't be disappointed. The wings are amazing and the chicken and waffles are delicious. You won't be disappointed with your visit to this location.", "author": "Stringer B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "Always very crowded no matter what day or time you go. The wait can be as long as an hour for a table. The environment is very loud and chaotic. Food is good, after all it is a chain restaurant, however the drinks here are by far better then other locations. I would definitely recommend this spot for a quick bite and a good hard drink but be advised to plan ahead as there could be a long wait.", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Love the beef ribs from here. Nothing beats the Florida BBQ spots that I'm used to but this isn't bad if your looking for a quick bbq fix. The people I went with has the bbq chicken sandwich and it looked really good as well. We also tried the frozen pina coladas and they were really good too.", "author": "Tommy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "Horrible service.. Horrible environment.. never been to a restaurant that was half full but was so noisy. Had waitresses dropping trays (more than once), gave me a small plate barely fitting my wings. I asked a passing waitress for another plate she told me \"this is not my station and walked away\". This location is a joke. Needless to say I took my food to go. My advice never ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever, ever,  go there expecting great service.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "I've lived in NY all my life. I've seen all the recent changes to all area and the improvements that has come along with local businesses. My daughter and I are in the Downtown Brooklyn area after catching a movie and came to the Dallas Bbq on Livingston it is by far the worst Dallas bbqs there is in the tristate area. The services is the absolute worst of them all. You cannot request a booth as a party of 2 even it most booths being open and you wait extremely long for service with staff standing around doing nothing. I do not recommend this location to anyone. After getting our meal - the wrong items were served. I cannot understand. Please save your money and time.", "author": "FayannDesiree A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Came here in June with 7 of my friends. Our waiter was amazing. Our food was delicious. The portions were huge. Our drinks were all really good. We will definitely cone back the next time we are in Brooklyn. The Hennessey wings were my favorite.", "author": "desiree g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-31", "description": "We had some high hopes for place but in all honesty everything about this place sucks expect the cornbread....\n\nSo we are starving sitting at the table and getting ready to order our food. The waiter comes up to us and asked us what we like we we also order chicken and shrimp combo and some chicken wings. The side that we got were fries.\n\nWhen the food came out the fries were so soggy and so oily that we just couldn't eat it. The shrimp was nasty. The barbecue chicken was disgusting.\n\nLater about the fries and the waiter kindly decided to swap it for some rice. When the rice came had such a off taste to it we couldn't even describe it we couldn't eat that either.\n\n Now at this point we are trying to figure out is it us or is it the food. We are looking around and we are seeing everyone eating the food without any issues. Also at the same time everybody is drinking so I do not know if the drinking had anything to do with it. We couldn't wrap our heads around how everyone is just eating this really disgusting food.\n\nAlso noticing we were the only people that weren't served any water. So we're eating this meal without anything to drink and at this point just hating the service. Despite the waiter coming to us that one time when we exchanged the fries for Rice we have not seen him since. We couldn't even find our waiter to get us some water. \n\nThe only thing that we did eat out of the whole meal or the side order of wings that we got which was decent. We didn't even touch the plate of food barbecue chicken and rice. So we try to get a manager's attention to see what we can do about this.\n\nSo no we weren't trying to scam the restaurant because we didn't even eat the food so we asked the manager is there any way we could get this meal off because we we didn't eat it you completely see that it is untouched. We also try to tell the manager that we did not get any water or anyone checking up on us throughout the meal. The manager then starts to state New York state law we do not have to serve water unless it is asked. Now at this point I'm trying to keep my cool but who doesn't automatically give water isn't that a common courtesy why would we not want water why would we want to eat our food without anything. The manager doesn't seem to care about the quality of food or the quality of the wait staff. At the end we got half off for the meal we didn't touch which I'm grateful for but still highly disappointed not even I'm sorry that the service wasn't up to par. The manager seemed more upset with us.\n\nIf you like cornbread or alcohol this is the place to go if you like real southern cooking please avoid this place at all cost because it's disgusting", "author": "Swisher L."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}