{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "If you do go here, make sure you aren't seen by Simone. I have a very minimum standard that I ask of my waitstaff; please ask if we want a refill. After she took our order, not one time did she come by and ask if we wanted a refill. The manager gave a sorry excuse saying they were busy but she walked by several times without even looking in our directions. I still tipped but I won't be back!", "author": "Adrian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Massive BBQ wings and huge fishbowl sized drinks make Dallas true to the saying \"Everything is bigger in Texas\". The food has always been great on the numerous occasions I have went, as has the atmosphere and the service. In addition the portions are more than generous at incredibly reasonable prices", "author": "Edward M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "My 200th Review!  Wow, that's a whole lotta typing.  I thought long and hard about who was going to get the honor of this monumental review, and without a doubt Dallas BBQ earned the spot.\n\nI have had a LONG love affair with BBQ's (Sorry we don't actually use Dallas....just plain old BBQ'S).  Although we go long periods of time without seeing each other, my love never waivers.  If you want some great BBQ in New York....come on down to Downtown Brooklyn. Whatever you do DON'T go to the Time Square location....here is why:  http://www.yelp.com/biz/dallas-bbq-new-york-7#hrid:kE12noYwQ3ILS6dBw4P-GA\n\nAnywho, many years back my cousin brought me here and I've been hooked ever since.  This place stays crowded but the wait is never that long.  And you might get to see a group of traveling Amish...no, I'm very serious.\n\nFOOD: 5 Stars\n\nThe main reason I come to BBQs EVERYTIME I touchdown in NY. OMG the food is ridiculous.\n\nWangs -  The first time I had these Wangs I couldn't believe how big they were.  These Wangs put California drummetes to shame.   These are the Guido's of Chicken wings....without all the douchebaggery and spray tan.  They are plump, moist, fried, dyed and layed to the side. My mouth is watering just thinking about them.  A good bet is to go with the Wang and Shrimp combo. Deelish.\nhttp://www.yelp.com/biz_photos/dallas-bbq-brooklyn?select=0jyNmpsLVs77wZYO4XKBZA#JV-n-wOSC8amSVEIdn604w\n\nBBQ - yes I have actually had the BBQ here, once.  It was good...so good I ordered a combo platter and ate the whole thing.  Seriously. Oh this was back in the day when I had a high metabolism...now, not so much.  But it was sooooo good.\n\nTexas Sized Ritas - Get the Texas Size. Don't wimp out with a regular size..... grow some!  They puts your shots in these cute little tubes so you can get as drunk or not as you like.  I always add all my liquor.  And some of yours if you are offering.\nhttp://www.yelp.com/biz_photos/dallas-bbq-brooklyn?select=0jyNmpsLVs77wZYO4XKBZA#svpP384yDhwADLaCBKihZQ\n\nSERVICE: 5 stars\n\nLike I said, DON'T go to Time Square...their service is HAWRIBUL.  But here at the Brooklyn location you get Southern Hospitality with a NY speed.  \n\nWarning: In the winter, the hot water is HOT.  You have been warned.\n\nCan't wait to see you again My Love.", "author": "Amaya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "This might be the place where you find the most hood folks in Brooklyn. You can expected to find this place jammed packed from wall to wall and at least a 15 minutes wait. This place is extremely noisy and sounds like a market place. You can easily get a headache from just sitting around here.\n\nEven despite its flaws, the drinks are pretty good and pretty cheap. You can get a Texas size frozen drink with an extra shot for $10. These drinks or also pretty strong. After 2, long islands, you might need some guidance getting home.\n\nThe wings are also amazing. They serve whole wings here and these fowls are like chickens on steroids. The Hennessy wings are amazing. I can't get enough of them.\n\nIf you are ever in the mood for a quick bite and strong drinks, this is the place to be but just expect the whole block to be here.", "author": "Keisha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "Never been to texas but I think that was some pretty good BBQ. \n\nThought the cornbread was too much and too dry but the baby back ribs made me soon forget them.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "The food is mediocre to good. First went to the Times Square location. It was crazy busy. We were told it would be a half hour for food. It took almost an hour. We didn't really have time to eat the meal when it came out. The Brooklyn location was our 2nd time trying Dallas BBQ. Food still mediocre. Service just as bad even though it was much less busy. We had to flag someone just to find our waiter so we could even order our entrées long after my appetizer was finished. We considered just leaving at that time.", "author": "Jaime S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Portions are HUGE(I suggest sharing a plate with your date or friend). Really love the wings (ask for the sauce on the side, trust me), burgers, the baked chicken, corn bread, and french fries. Let's be honest though, you come to this place for their amazing frozen drinks. They are always on point and do not disappoint. Service can vary depending on the day and the server.", "author": "Tito V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Avoid. Baby back Ribs are ok, but nothing special.  Chicken was dry.  Corn bread was over cooked.  Then they throw your fries on top of the ribs and chicken,.makimg a.mess.of everything.  Horrible presentation. 8 big screens showing weak music videos.  When there was NFL football available?", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-07", "description": "Two stars are because the drinks are actually good, if you are into frozen drunkey drinks that creep up on you after at least two or one depending on your tolerance.\nThis location features the best of the best hood chic patrons with dashes of ppl who didn't know any better. \nLoud groups of a thousand who seem as if they will never leave so other ppl can eat, keep the place full. Food is as is at most of their locations if you enjoy chain food eating. I happened to be there to celebrate a bday with family who rather \"keep it local\" so I had no choice. Would I come back here...\nSure if I wanted to scream over ppl and watch out for the double stroller that rolled in after 10 o'clock- of course I would.\nNot.", "author": "V V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "Back in high school, college, and graduate school as a student on a budget I used to love BBQ's for their hot wings and nearly lost my mind when the sticky wings were introduced to the menu. This has never been my favorite location because the caliber of ppl that frequent it. \n\nHowever this past Saturday friends and I decided to go somewhere for drinks and I was craving wings. Therefore we ended up in BBQ's. The drink (tsunami) I ordered was disgusting. I stopped ordering their extra shots a long time ago because the house liquor is HORRIBLE. I ordered the sticky wings and they were just subpar, not what I remembered about my joy of sticky wings. I love them so much I even tried to replicate them at home and miserably failed. \n\nThe bathroom I'm sure wasn't up to code. Soooo you mean to tell me not only customers but the employees use this restroom. As in the people cooking and serving my food? I'll pass.\n\nNeedless to I will not be returning to this location...I prefer the ones in the city better, except for the Times Square location(which is also horrible).", "author": "Lola O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-03", "description": "This is probably the seventh Dallas BBQ location I've patronized over the last few years so it's safe to say I can compare my experiences.  Like most BBQs, the menu is standard and the quality of the food, for the most part, is usually comparable.  The major difference always comes down to service.  \n\nI spent an evening meeting with friends at the downtown Brooklyn location.  The host seated us immediately; unfortunately the server didn't show up for about 10 mins.  To be clear, a short wait is reasonable but once it becomes noticeable and we start asking other staff who our server is.....then \"Houston, we have a problem\". When the server arrived she was pleasant.  She initiated the order and we decided to place everything at once Drinks, Meal...I would have ordered the check in advance because there was no telling when we'd see her again.\n\nUpon ordering the drinks, I asked for a margarita \"on the rocks\" and the waitress offered three tequila options Patron, Jose Cuervo, or 1800.  Fast forward to the check, we are itemizing the order and I see Patron Margarita $22.00.  Now look, I'm no tequila connoisseur but I'm not going to Dallas BBQ for a $22 margarita. I even checked the menu to see if this was some type of promotional drink that they were pushing on the menu...but no.\n\nHere's my issue, I asked for a tangerine margarita.  I never inquired about  premium options and was fine with their house tequila.  I can respect upselling but I called the manager over because I felt that it was both misleading for the server to present premium options without mention of a house option which was almost half the price.\n\nLastly, I think this comes down to training on what's an acceptable tactic and what is not.  Although appreciated, the manager offered $5 off the bill which I declined because this was a matter of principle.  As a patron, I should have all the information to make an informed decision; not limited options that somehow coerce my decision.  Lesson learned!!!!", "author": "Rafael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Cool spot for lunch. It's very busy and very loud. They serve you quickly and the food is always fresh and hot. Dinner time is just a busy but louder. The drinks are pretty good and there is quite a variety for you to choose from. Most of the wait staff are pretty cool the manager thinks he is intimidating until you stand up. If the wait staff makes an error he says he is going to take the difference out of their pay check.  So there is a quick turn over from time to time. This is my favorite Dallas BBQ to visit.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "We were walking back to the subway from the Transit Museum when I saw the sign: BBQ.  I was in!  It was Saturday afternoon (a little past typical lunchtime) and the seating area, which is huge, was largely empty.  Waitstaff was helpful in orienting us to the menu options and friendly/attentive throughout our meal.  Ribs and 1/4 Chicken were both tasty and the portions were not too overwhelming.  Cornbread was particularly yummy.  We were even offered small iced cupcakes at the end of our meal.  Some of the best meals are unplanned, in the moment, and this was certainly a memorable one.  Would completely recommend!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "We needed to grab something quick and satisfying and Dallas BBQ happened to be right by the theater where we would later be seeing my niece perform in Alice in Wonderland, Jr. I was a little put off by the bathroom, which was somewhat dirty, so I didn't know what to expect. But we had the NICEST waitress ... seriously, she could not have possibly made our experience any better. And the food came out hot, quick, and really good! I ordered the power bowl (quinoa, spinach, mushrooms and grilled salmon) while my husband had the Sriracha chicken sandwich. We went to put in our usual two orders kids meals but our waitress informed us that one would be sufficient. We were skeptical, but she was absolutely right - the kids meals are huge (and all meals come with mini cupcakes!) We'd definitely go back.", "author": "Diandra D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "I have been to this Dallas BBQ's location a few times and it was a great experience.  The service is also good and the food as well.  I recently ordered take out for delivery on their website.  It was a DISASTER!!!  I placed my order and was actually really excited to get the shrimp caesar...it is my favorite.  My email confo stated I would get my food in 45 minutes.  I get a phone call 45 minutes later informing me that the delivery person does not deliver to my address.  What???  I live 1 mile from the restaurant!!!  The person telling me this then asked me if I could come pick it up multiple times...no I can not!  I was annoyed because I had waited so long to get my food just to find out I was getting nothing.  These people need to get it together!  Their website is terrible and should not let you place an order out of the delivery range.  Why no one called earlier boggles my mind.  To top it off...I was told I would have to wait 3-5 days for a refund.  I might even have to call back if I don't get the refund.", "author": "Meritza H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "This was a late night stop for us and the second time I've been to the Brooklyn location. I usually go to Times Square. All of the staff seem fairly young and the service is reflective of that.  Though the service was kind of slow, they made up for in the quality of the food and drinks. I would definitely go back!", "author": "Shantael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-01", "description": "On the Plus Side.\n\n+The portions are enormous. You can get a meal that will feed two people for about $11. It won't be particularly good, but it will feed you.\n\n+If you like gigantic, sweet drinks, you've come to the right place.\n\n+They are extremely popular. This must be good for the owners, and I'm glad someone is happy with this situation.\n\n+It seems as though countless other barbeque joints (Hometown, Morgan's, Dinosaur, Fletcher's, BrisketTown, Mable's, Hill Country, Mighty Quinn's, etc.) saw the success of Dallas BBQ and realized that NYC needed real barbeque. Thanks Dallas, for getting that ball rolling.\n\nOn the Minus Side.\n\n-The ribs are awful. Ribs are one of my greatest loves, and it pains me to see them destroyed in such a manner.\n\n-Their signature sauce is cloying, and pouring it over poorly cooked meat of all kinds does nothing to improve said meat.\n\n-Every Thursday, Friday and Saturday night (as well as Sunday afternoon thanks to the Brooklyn Tabernacle overflow), Livingston Street echoes with the sounds of cackles, fights, shrieks, and unintelligible screaming over a PA system.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Dallas BBQ is the place to be if you're into strong frozen drinks and delicious wings, ribs and steak. Service is always great and the complimentary cupcakes at the ends are cute. The volume in this place is really, really bad. I feel like I was yelling the whole night. Our server Achmed was funny, and gave us everything we needed.\n\nThey are FAMOUS for their Hennessey wings, so you should probably order those, or the black bean burger like one weirdo in our group. What kind of vegetarian goes to a BBQ place? Sheesh.", "author": "Tee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Limited menu, no desserts but the  wings ARE AMAZING!! The sticky wings are absolutely amazing and nothing like anything Ive ever tasted!", "author": "Sandra Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Hey! This place deserves four stars! Buried under my deep-fried onions and rice was an amazing steak! In addition, I had some truly delicious baby back ribs.  \n\nAnd the price... so affordable!\n\nMy service was excellent, and the atmosphere is really vibrant, especially with the psychedelic TV screen patterns all around! It feels good to be in a BBQ establishment where I am a minority.", "author": "Kris F."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}