{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "JESUS ! \n\nThe wings are to DIE FOR !!! \nI came in one day, on a busy friday, I  ordered some wings and in LESS THAN 5 minutes it came , OMG They were steroid huge yum yum yum I will be going back !!", "author": "Shade C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "BBQs is great to come to for quick service, large portions, and food that is pretty okay and a step above fast-food fare. Folks also come here for the selection of Texas-sized drinks, but I wished they had a better beer menu - they didn't even have Sam Adams, which other BBQs serve,\n\nThe food came quickly and was adequately prepared, our server was friendly, but we could tell had too many tables to tend - not her fault. It was tasty, a nice place to come to when you want to sit down for some humongous wings, huge drinks, or comfort food at a decent price. This location can get noisy, especially on Fridays and the weekend.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Four stars  for customer service and fast food delivery.  The salmon spinach salad I got was fresh.  I usually go to Dallas BBQ for their fried wings but I  have been spoiled crazy by Korean style fried wings.  My server was sweet and attentive.  Families and large groups were having fun which made for a noisy space but this is what the franchise is all about. If I'm around downtown Brooklyn again this would be a cheap reliable grub stop.", "author": "Ireen N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-23", "description": "I went there with a good friend for dinner and drinks. The waiter was super nice and he gave us extra shots in our Texas size blue Hawaiians.\nI ordered the steak, shrimp and ribs combo it came with french fries and corn bread. I only got to eat half cause I was to full. LOL \nThe steak is gross. It was over cooked when I clearly stated medium well. It was super nasty never again. \n\nOh and forget about the surroundings . super ghetto people. The couple in front of us were arguing from the moment I got there until the moment we left. The guy called his girl a SL*T and  was talking to her like she was a man. OMG GHETTO. Oh yeah I forgot I was in Brooklyn lol", "author": "Yanel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "Good food depending on who is in the kitchen. I eat here a lot when I need to have my stomach full. I place items for lunch and then pick it up. My suggestion if you call in your order always double check it before leaving. I was impressed at how I could place my order, have it read back to me and still they got it wrong when I arrived to pick up. Also they will try to slip you a diet coke or Lipton ice tea with your order. Who wants either of those not me. Anyway the food can be a hit or miss. Stay away from the fish it has no flavor. The sticky wings are good and the drinks are ok. It can get loud and very crowded. The servers are ok some are shady and will try to add items you didn't order, so check your bill closely.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Me and my boyfriend went to this BBQs the other day. We got seated right away but waiting for the waitress to come and take at least the drink order was a wait, about 10+ minutes before someone came over. Thats the only complaint I have. It was also pretty packed and it was a wednesday. Other than that, the food was GREAT, Margaritas were the BEST and our waitress,  Rochelle was really nice. She wasnt like those annoying waitresses that breathe on top of you every 5 minutes. She was good. Deff would go back and would recommend!", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "Love the Pina colada and the hot wings are good.  Nothing special about the atmosphere.", "author": "Define_Me N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "I go to this restaurant several times a year. \n\nThe Good: I love the rotisserie chicken, fried shrimp, corn bread and baked beans here! The sirloin steak is pretty good too. It's well-seasoned and tastes even better with bbq sauce. The service is relatively quick considering the size of the crowd and the food portions are huge. \n\nThe Bad: I do not care for the ribs here. It tastes bland to me. \n\nThe Ugly: Rarely, the patrons act as if they have no hometraining but I do not let that ruin my meal.\n\nSidenote: Once in a while, I see a random cute kid walking around with a rib in one hand and a toy in the other. Gotta love BBQs!", "author": "Dolores O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Went with our group of 4 adults and 3 kids. The wings were huge and delicious.  I don't even like frozen drinks but since it was all they had I tried the pineapple rush. It was amazing!  There was a honey mustard sauce that was so good.  The ribs were good but I'm spoiled by my husband's cooking.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-20", "description": "Let me start with the good, I had the most delicious strawberry daiquiri. ..the food I orded was horrible....me and my friend ordered turkey burgers and they were discusting. ..very dry and under seasoned...", "author": "Sherri D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-30", "description": "This place is crappy, a group of 4 sat there for 45 min without getting any service. Manages were sitting at tables with girls flirting while at work, very Unprofessional.", "author": "Vic A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-20", "description": "Bleh.....nothing new nor exciting. The food is subpar at best, but the drinks are why everyone comes here. I just wish they'd do something exciting with the menu,because isn't BBQ food supposed to be exciting and flavorful?", "author": "Omari K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Today was my very first experience at Dallas BBQ's. I went with a party of 6. The waiter was very pleasant, she constantly checked up on us and asked us if everything was ok and if we needed anything. The food is good. I enjoyed my double cheeseburger with fries, and it was so huge I couldn't finish. I also got a Texas sized raspberry piña colada and it was also huge, I shared it with a friend. They have virgin and with alcohol. You could also add any favors you want. They have a decent selection to add to it for flavor. The prices are great. All in all it was good. But the only downsides are that there is no dessert menu at all, they give you free mini cupcakes after your meal as dessert; btw those cupcakes were extremely cold and the frosting didn't even move it was basically frozen. There was a time when we needed our waiter to add something to the order and she was nowhere to be found but then we asked another waiter and they said they couldn't attend us, but then again they also didn't help us find our waiter, so we were just sitting there waiting for our waiter to come back around. Also, it was extremely noisy, I had to speak louder than usual to get the people right on the other side of the same table as me to hear what I was saying. Other than that I enjoyed my time there and I would definitely make another visit for that delicious piña colada :)", "author": "Raslin E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-13", "description": "When I was growing up, my family and I frequented BBQ's regularly. And that was back when there were only like two locations in all of New York City and they made a really good rotisserie chicken.\nBut over the years, BBQ's has turned into a chain with locations all over NYC. And as time went on and more locations opened up, quality went down. \nThis location in particular is stunning. It appears it was some kind of ballroom before it became a chicken and rib franchise. \nBut, this place is ALWAYS crowded, thanks, in part to Brooklyn Tabernacle a few doors down. \nWho doesnt love that early bird special? two meals for $9.99. \nThe service is rushed. The food is mass produced and the staff arent the friendliest. The real kick in the face was the bright red sticker on my receipt telling me tip was not included as well as the waitress telling me that the total did not include a tip for her services. \nWow.\nIs it THAT bad here that staff are getting stiffed? \nThat wasnt even the big deal, the big deal came when i left her 18%, which was generous despite being ignored the entire time, but when she read the receipt in front of me and said I didnt leave a tip. \n\"Thats because Im leaving a cash tip.\" The part where it says TIP: read CASH. W. T. F. \nServes me right... the food is nothing to write home about, but my family loves it here.", "author": "Monique R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-24", "description": "Myself and a group of close friends and family visited Dallas Bbq's at Broadway Junction in Brooklyn yesterday. The Hostess could've been a bit more gracious nevertheless her Manger rectified it and we were quickly seated. This particular Bbq's bathroom was a horrible, terrible mess. The Handicapped stall toilet has been broken for at least 2 months, maybe longer.(someone in my party frequents this location ) The bathroom was in such disarray i just wanted to come out as quickly as possible.", "author": "Phyllis L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-12", "description": "So u want me to give a review about this place oh man oh man where to start!! Ok here we go this place is freaking disgusting we came here after getting lost going to a Spanish restaurant and let me tell u was a bad idea from the start. The place tonight was full of wanna be thugs it was way too damn loud.  Then to top of some lady tried to get away from paying her bill no class. And to top it all of next to my table was the biggest water bug ever!!! I would not come here again the reason y I give one star is cus I'm force to give it!!!", "author": "Juan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-11", "description": "good food, but slow service. they always seem overwhelmed.  very loud tho, not a place to go if u intend to actually talk with your company.", "author": "Airial R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "The Texas margarita was delicious and it took me awhile to drink b/c it is a huge drink. Nothing like the actual bbq food from Dallas, TX. but it is still delicious.", "author": "Letty A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-08", "description": "This place is way too loud the food is good and it ony takes a few minutes to get your order then why is everyone talking and not eating?", "author": "Jay S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-01", "description": "The one in Brooklyn was not impressive.  They brought the entrees before the apertizers and the food tasted like it was sitting for a while before it was served, the fried shrimp batter was soggy.  Would not return, luckily our dates were oblivious, which means I need to start dating up but that's another story..", "author": "Lynnard B."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}