{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-04", "description": "The food was ok.  I went during lunch hours.  They will give you a hard piece of corn bread at times.  I will often politely ask for a fresh piece of cornbread.\n\nI sat in a booth.  The fabric on the booth chair backings are black with dirt.  When is the last time they were cleaned or better yet just change the fabric?   The booth chairs in Juniors and Red Lobster are clean.\n\nA good manager focuses on every detail in a restaurant  even the furniture.  Gee", "author": "Stacie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Can't go wrong with this place when looking for something good and cheap. Service was fast at this location and very large portions. I've been here several times and have never been disappointed. Love the seafood, BBQ sauce, cornbread and frozen drinks. BBQ sauce has a tangy taste and I used that as a dipping sauce for my shrimps #delicious.  \n\nFor some reason we received free cupcakes at the end of our meal; not sure if it's a holiday thing or if its ongoing but they were ok. Moist but not rich in flavor.", "author": "Mo D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "I give it two Star because the waitress was not at all taking care of us she only took our order never came back until we finished eating the fries they're terrible I don't know why people eat those fries there but I didn't the chicken barbecue sandwich the meat was dry and had no taste whatsoever did not attract me and  the coleslaw was also Dry... first time in BBQ's and I was very disappointed I don't think I'll go back there.", "author": "Ileana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "This location has to be one of the busiest Dallas BBQs that I know (and I've gone to all of them). There is always a line and a wait even at midnight lines are still out of the door. It's always so loud, to the extent of where you can't even hear the person seating next the you. The food is always great! I love the combos with yellow rice and corn bread. I wouldn't recommend the onion loaf, it's VERY bland. My most recent experience was great. With a party of three, we were able to get a booth that they would normally squeeze 5 to 6 people into. Our orders came quickly and our waiter was a nice jolly man, and of course we got the complementary cupcakes for dessert. It was a once in a lifetime experience at Dallas BBQs that I probably will NEVER get again.", "author": "Nathaliah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "My supervisor took us to eat as a hoilday treat . it was awful they lost our order the onion loaf tasted like paste they forgot the cheese on my supervisor' s potatoe the order came 45 minutes late and we left very disappointed. They had the nerve to give us stale cupcakes as a consulation", "author": "Shalita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "My favorite spot to enjoy a nice cocktail of pina coladas and the food is amazing The bbq buffalo wings specially..", "author": "Joey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "I had a decent experience at this Dallas BBQ location but it was probably because we went on Wednesday during lunchtime.  It was less crowded, and our waitress was pretty good about taking orders and responding to us.  \n\nThe food was pretty good with larger servings - especially the fried shrimp which was delicious.  We've had too many experiences when fried shrimp were less than satisfactory.\n\nThe one thing that was a little annoying was the seating.  The seating was tight and I sat at the end of the booth.  Since the other side of the table was against the wall, whenever someone had to use the restroom, I would have to move so that they could get through.  The table next to us was pretty close and they had smaller children who were restless.  \n\nI've been to the location in the Upper East Side before and I would always order takeout since it seemed pretty busy.\n\nThe food is never bad at any of the locations, but the seating can be inconvenient and the noise level can be high.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "This place has some great food! And it came out super super fast. If you're in a hurry, this is the place to come. If you're looking for good service and a good meal go elsewhere. The service was so bad here. Our server visited our table once when she took our order and we didn't see her again until she came to pick up our plates, I sat through my entire meal with no drink as she sat with her coworkers at a table across from us. Even after she retrieved our dirty plates she never refilled my drink. After we ordered I decided that I wanted to get us an appetizer but had a question regarding the menu, our server was nowhere to be found so I asked another gentleman who was walking but, he had a horrible attitude. I asked about the sticky chicken fingers and what made them different than the regular, his response...\"they're sticky\" I asked if he could find our waiter and he walked away. Just service here is horrible. But come for the food. \n\nEdit: I just asked the server for a refill on the tea. She informed me that tea refills cost however Coke refills do not......interesting that something made with water cost to get refilled but not coke......", "author": "Cody H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "My experience with BBQ'S has always been pleasant. Especially with the attention we receive from servers Genille Guthrie and Brian Santos. These two servers are the ultimate with the attention they provide. Their courtesy, smile and care is what constantly brings me back to this location. Their professionalism and great customer service are also other factors. Brooklyn BBQ'S is not an easy location to work at and thru it they maintain that standard of professionalism. Kudos to both!", "author": "Siul A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "I came here with some friends on 4th of July around 4pm and was seated right away. We each ordered burgers with fries as well as drinks. The burgers were pretty good but the fries were kind of burnt, but it was anything some ketchup couldn't fix . The drinks were the shining stars of the meal. One of my friends said her MOM (yes, her mom) loves this place for their drinks, I am not much of a drinker and can see why; I really enjoyed my drink! I ordered the \"Captain America\" (don't know what the \"official\" name is so that will have to do and yes how so very patriotic of me ;) which I wasn't sure of but after having received a sample, I was in love, my friend's ordered pina colodas. Our waiter was absolutely awesome, she came around often (given the crowd she had to service) to see if we needed anything and was pleasant each time. I would come back.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Best wings I've ever had! Ever! If I lived close to a Dallas bbq I'd honestly go there 3 times a week just for the wings. The prices are extremely reasonable and the drinks were strong. I got a tsunami and that was the tastiest frozen drink I ever had.\n\nYou really get food bang for your buck, so if you have a family this is definitely where you want to go. The rack of ribs is $13 and that is unheard of. Definitely going back when I'm in the area. \n\nCan't remember who our server was but he was great. Had great energy and wasn't pushy to get us out. I guess they know after you eat that golden fried goodness you won't be motivated to do anything for a while lol.", "author": "Roberto J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Great food \u0026 super friendly waitress!! Location. It bad but prefer the Manhattan over the Brooklyn spot. Sticky chicken is always good. Shrimp was tasty as well.", "author": "Jerri S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "Crap. Crap. Crap. Crap. Just crap.\nBut I still want my baby back, baby back, baby ba-- oh wait, that's Chili's. Oops, wrong chain.\n\nWhile it was hell finding this place, this place was horrible. Very slow customer service, and when there was a waiter, he was very impatient. And where are my drink refills? I got toilet water in return for my coke. \n\nI can't say the food is bad. It's the only thing worth remembering from this place, aside from  walking through drug dealers, and all sorts of troubled ones through Gallatin Place in the dark with a group of scared friends. This area is really scary at night, so don't sweat it to come here. My crispy shrimp and baby back ribs combo was the bomb. No, seriously, it was. All that bbq sauce was pure heaven., and don't even get me started on the crispy shrimps. The \"baby\" back ribs was saucy for sure, but did not have enough meat to it. Too bony. And I really hated the onion rings, all soaked in oil.\n\nI guess everything good has a price to pay. We were wooed by a group of teenagers, one of them, or some of them shirtless. Excuse me, now I have to vomit.", "author": "Sharon T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Stopped by with a friend for a quick lunch and was pleasantly suprised. Can't go to Texas style bbq joint and not order beef 'que right?? Had the beef bbq ribs and yellow rice. They were EXCELLENT. Very impressive too! They come piled on the plate like dinosaur bones.. (not white shirt friendly, be warned!) The rice was plain but good. Service was great, prompt food to table, yet we were not rushed at all.. Definitely will go back..", "author": "Duane S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "I came here last Thursday. Place is good. My waiter was really great, he was training a girl who was also great. Drinks are amazing.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Waiter was doing his job properly and understood my accent, in the end we received a tiny cakes. The place at all is good and worth to come some time. That is why 4 stars. I almost made it 2 stars because of the steak. Too small and not that great as was described by friend of mine. Today I didn't get that steak. Waiter Many pulled the situation to 4 stars.", "author": "Iryna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-16", "description": "I rarely write reviews, but my horrible experience with this restaurant necessitated that I write one. I work just a couple of blocks away from this restaurant. I ordered food there on a work day for delivery. My food arrived close to two hours later. When I called the restaurant to complain about the delay, the person that I was talking to promptly hang up the phone on me. When the food arrived it was cold and damp. I asked for a refund, but I was told that I would not get one. I recommend that you avoid this place, if you can.", "author": "Joam A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "Very Disappointed.\nWe waited about half hour on a Saturday afternoon, it's not the waiting I mind, it's just very dark in the store.\nIt's very loud; people were eye-ing me because I was the only Asian in this place at the time.\nWhen my number was called, someone brought me to a table, but it a group of customers did not like their table so they decided to more to the table that I was going to be assigned to. Next, the guy that brought us there did not apologized to us, he just looked at me and say, \"Go back to the front\". Seriously? So we stood in the middle of the store while people around us was munching and staring. Very awkward. \nWe were seated 5 minutes later, given a menu and had to wait for about 10 minutes for the waiter to come here to take our orders. \nI ordered the Salmon Special with garden salad with Orange Juice. I got a \"stare\" when I said I wanted orange juice...\nMy other half ordered the steak and baby back ribs combo with garden salad and cornbread.\nMy mistake was ordering anything besides meat here. All meat related have huge portions. The fish was small, I finished it about 10 bites (I don't shove food down my throat) and the side salad was extremely Small and it came without the dressing.\n\nAll the people around besides me got red velvet cupcakes, I wasn't sure why. I had to flag my waiter down for the check; we gave him a $100 bill and he asked if we wanted change back....Really??? The meal plus tip was $40 and you were not planning to give me change. He returned in 15 minutes....", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "The food was ok but the drinks made up for it lol! The customer service was excellent !!", "author": "Crystal S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-12", "description": "The waitress was nice, but the food was subpar and not worth the money. The drinks however were amazing. Highly recommended if your just going for drinks, but get dinner somewhere else", "author": "Bianca G."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}