{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "Why is this place degrading every time I come? The fried chicken wings are so dry. The drinks are way too sweet. They need to keep its together because there are definitely new places opening up for cheaper and tastier food. I'm glad the servers were attentive and friendly.", "author": "Linan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Came here to eat with my boyfriend as it was close to the hotel we were staying in, in Brooklyn. I'm pretty familiar with BBQS. I usually frequent the one in Manhattan.\n\nWe came to this location as soon as they opened at 11am. There were already about 12 people waiting. They did not allow people to sit at tables until about 11:25. Our server was okay. She was efficient but there's definitely a lack of customer service among the staff. They never say thank you or let you know they appreciate your business, they kind of just serve you and then are done with it. \n\nI gave them 5 stars because my food was delicious! I ordered the classic sticky wings and crispy shrimp. To drink I got a Pina Colada which was delicious. Overall, I was very happy!", "author": "Kendra H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Customer service was on point! First of all, my spouse fell in love because there were a lot of people of color working and eating here although it is a chain, my friends recommended this place to try out for lunch. My spouse and I were seated quickly, and I was a bit disappointed to see how much the wings were. I ordered 10 and my spouse ordered 10 as well, thinking we would be able to eat chicken. Well, the wings were humongous! We were only able to eat four wings each so we had a lot of leftovers. Our food was sent out almost immediately and we devoured as much as we can. The coleslaw was fantastic (not the corn so much) and the ranch was also pretty amazing. There were even cupcakes when we received our receipt to pay. Again, super fantastic customer service. I would definitely be back because it was such a pleasant environment.", "author": "Toni Rose D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-19", "description": "I would say this is my least favorite dallas bbq spot, it has a very ratchet feel lol like its been like this forever I would think it would change a bit but no, it needs to be redone compared to other locations the decor is ughh. Just a really unclean feeling and I was really upset for having to pay a 1$ extra for dressing like since when...The only reason for 3 stars is because the service was super fast. My henny colada was gross, worst one I have ever had at bbq's and this was my main point of coming because the drinks are always good...most likely wont be back to this location.", "author": "Zenda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Omg I so loved the drinks here. Plus friendly staff and clean. The henny wings was delicious. Must come back", "author": "Linda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Go and see a very nice Gentleman named Mark! He was mega helpful in our selection of drinks and food. Tell him the Girls from Shreveport sent you. We're from north Louisiana 2 hours from Dallas Tx. This place is like being back home. No Kidding. The Chick n Waffs was \"off the chain\". The Sticky Wings were good and STICKY. Yahhhhhhssss!!! .", "author": "Arimathea J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-23", "description": "The wait for a table was a bit long. Usually that's not a bad thing because the food could be really great. I was not overwhelmed with my food. Ordered the combo with fried shrimp, steak and baby back ribs. It comes with a side so I picked yellow rice. The corn bread was good as always. The steak was under seasoned. The ribs were over cooked and a bit chewy.", "author": "Sue L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Enjoyed visiting and trying out this restaurant. Even though i am Vegan. I was still able to enjoy a meal here. Of course there is endless supply of meat. My coworker had chicken wings and he absolutely enjoyed them! THE LIQOUR IS AMAZING !!! So damn good !!", "author": "Jarneseya R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-20", "description": "Thanks for the \"beef\" ribs...ordered takeout beef ribs and to my surprise I got a container of bones. Don't know what going on but received the Sam from 42nd st a few weeks back. Loved you guys but will be preparing my own beef ribs from now one. \n\nThe 2 star is for the bbq sauce. :-)", "author": "Vernanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "This restaurant is probably one of the dirtiest places I've ever eaten at (idk why I stayed) The chicken tasted a week old. Our waitress was very nice. The food was meh. Definitely not coming back here again.", "author": "Knot U M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "I like the food here but the service at times can be sketchy. We ordered take outland sure enough they got it wrong. At the tables you have a better chance at getting what you really want.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "Like their drinks and food was ok. I go there with friends to catch up and have good laughs", "author": "Tashea M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-27", "description": "I agree with prior reviews. The service sucks!  Went there on a Saturday afternoon and was seated immediately. Sat for about 20 minutes no one came over for my order so I went to the front desk and asked to be seated where I could get service. I was told that waitstaff would be there shortly.  Waited some more no one came so I asked again and finally after 40 minutes someone shows up. This was also happening to other patrons that day but I was the only one who complained. They definitely need a floor manager to make sure people get service in a timely manner. They have so much staff seating people but no staff checking to see if people are getting service.", "author": "D H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I absolutely love Dallas BBQ. The food is always great and the customer service is  at times. Every time I go I either get sticky wings or the BBQ Combo and they never skimp or their portion size. Also, the Texas size drinks are awesome, I've got to have one every time I come.", "author": "Cherise J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Before I start might I add, that they have the most diverse waitstaff I've ever seen in this city. That alone brought a tear to my eye. The waitstaff was courteous, efficient and looked happy to work there.  My waiter was just awesome. He checked up on us every time he circled around our area. He kept our glasses full. He didn't forget my bluecheeee and it was perfectly chilled. \n\nThe food was delicious I got my favorite, the Hennessy wings.  My friend got the ribs and chicken combo. Also delicious .. I tasted some of his food just to make sure it was safe for consuming. The presentation was perfect. The AC was blasting coldness everywhere on this  sweltering hot Day and to top it all off the waiter waited until we were finished before he gave us the check.  \n\nI love BBQ's.. I've been to almost all of them in this city... but have had an amazing experience with them up until yesterday at this very location in Brooklyn.  I will be back!\n\nNotes :\n\n5 huge wings run You about 10.99 10 wings about 16$ \nNothing in this menu is expensive .. the alcoholic drinks run between 5-16$\n\nGratuity is included in bill. Great for groups and the homies especially family. Not really good for dates unless you're both craving BBQ's.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "When I came last week I ordered fried shrimp and grilled salmon. When I left I thought why the f$\u0026k did I order that? Sometimes I make bad decisions when I'm hungry. While the salmon wasn't horrible, it wasn't all that. Its BBQs don't come here expecting to be wowed. So don't be fancy and order all that extra stuff. As long as you stick to the chicken, ribs, burgers and shrimp it should be good.", "author": "Shamorra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "BBQ's are pretty much the same, with varying noise levels depending on the location.  This one has really good food and alcoholic bevys, but it is the loudest by far. If you don't mind the noise and the spectacle make of themselves, it makes for great people watching.  Try the pineapple crush.... it's delicious with bits of real pineapple and flavored ciroc.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "The crab cakes (spicy or mild) are delicious. Portions are large enough to take some home. You often have to wait for a table.", "author": "A.J. N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "I'm kind of mortified that this review is happening...but it's happening and if you're reading this then I salute you. I was in this neighborhood with a friend killing time before I had to meet another friend for dinner and he had some time to kill before work. There weren't any reasonably close bars to the B57 bus and so when we spotted this Dallas BBQ we chuckled to ourselves and hopped on in.\n\nIt was pretty crowded for like 4pm on a Thursday and we only did drinks here. He got a Texas sized Tropical Tsunami and I ordered a Stella - it was a solid beer...as al Stellas are, but it was also the best beer here. My beer was served in a chalice. I felt fancy. Well, as fancy as one can feel when at a Dallas BBQ. \n\nI loved these places when I was in HS and although my palate has matured considerably, the table of clearly HS kids next to us ordered lots of chicken and waffles which made my hungry stomach growl. I may have to return again sometime for nostalgia's sake :).", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "Enjoyed my Texas size apple martini. My food came out pretty quick, and the server was good.", "author": "Sharmaine B."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}