{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-27", "description": "The food was really good here. My waiter was extremely rude. I do NOT remember his name. While we were drinking he came over and asked if he could clear off our table. When we asked a question about the food he told us the menu was right in front of us. He bragged about making $750 a week which I clearly do not see happening. He had absolutely no customer service skills and I did not tip him for his terrible service. The food is good at this location but I wont be going there again. 3 stars for the food!", "author": "Pash T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "It's a good spot if you looking for quick service. I typically order the BBQ ribs and Fried chicken wings -I only come here because my mother likes the drink specials...", "author": "Mari B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Service was pretty good, good was definitely on point I must say. I was scared because of the whole \"Brooklyn thing\" lol but it actually was a great night out with the family!", "author": "Leon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "I'm here. Not my first choice , or even my 8th to last choice. The Good... The wings, they are huge, which makes me think of hormone ejected giant chickens! HULK CLUCK! I don't eat them now-a- days...but, they are tasty. The Dranks, do what they are made to do, feeling nice and buzzy as I type ( \u0026 I can hold my liquor). The BAD, everything else, the rotisserie is over rotisseried, the steak... Um no, let's just say beef jerky. I've never enjoyed an entree. \n\nThe service is good, they do what I ask and are efficient! \n\nLots of youths in here, some well mannered some...not so much! \n\nPrice, I mean, I've had worse food that cost more, but we are spending round 30 bucks each and that is with a \"Texas size\" drink. So not too bad.", "author": "Gwen B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-17", "description": "My husband and I went to Dallas BBQ last night looking for a little BBQ and fun. We'd never been to any location but had heard decent things. I'm not sure that every location would be the same, but this location was awful. We were seated on the corner of the walk way near the entrance, so the entire time people walking by kept hitting us. Including servers, managers carrying chairs, etc. so I wasn't thrilled by the time our server greeted us. \n\nThen, our server would only address my husband. I get in the Indian culture they might have their traditions, but I'm paying to sit at your table and you will address me. My husband doesn't order for me. Then he kept pushing the Hennessy colada, even after we said no. No means no, even in a restaurant. \n\nAfter we get our drinks, my husband realized his shocktop wasn't right. He was very clearly skunked beer. When I mentioned to the waiter, he said \"that's what shocktop tastes like.\" No my friend, I think I know the difference between a good shocktop and skunked beer. Even if i am a woman. He eventually replaced it with something else but not before I had to tell him to get his boss. \n\nWe order a burger and a BBQ sandwich. The food came out rather quickly, maybe 20 minutes. My husband said his burger was just okay. My sandwich was okay, but I am wary of the brisket. There was some strange spotting along the edges that I have never seen on brisket before. I ended up eating mostly the pulled pork, leaving the bun and most of the brisket behind. \n\nAfter we ordered, we never saw our waiter again. Not to deliver the food, not to ask how things were. Nothing. We had to get up and go to him to request the check. Clearly, we will never be back. But judging from how packed the place was they don't need our business and someone is pleased with low level service.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-26", "description": "Let me start with saying the food was delicious. The sticky wings and onion loaf are the way to go. The Henney wings...bleh. If you like Hennesy then you would like these wings. I don't. 2 out of 4 people at the table loved them. The chicken was cooked perfectly. The spicy crab cakes were delicious.\n\nNow on to why i disliked it. The service. Our server was so rude. And just not a care in the world. He was slamming dishes around and just plain old nasty. And if you go after 8pm, 15% gratuity is automatically put on your bill. I'm so disappointed with this experience.", "author": "T. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "Food and drinks at this particular Dallas BBQ is like boozing and grubbing at the circus. It's ALWAYS loud (bad loud...no music, just people talking in their outside voices), busy and there aren't any booths to get cozy in or shield oneself from the madness. All the seating is out in the open and they really need a bar area that people can sit at. The fact that your food comes out really quickly is a plus. I go to Dallas BBQ for the sticky and spicy-sweet, Angry Shrimp and Texas sized drinks. Everything else here tastes the same as it always did but you can't beat the super cheap menu prices. Be sure to order an extra shot with your drink. The buzz effect will take your mind off the awful ambiance.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "Meh. Wasn't exactly impressed but I think I need to just maybe give them one other shot and see. I had a turkey burger and asked for some of the henny sauce to put on it but I wasn't exactly thrilled. They seemed pretty busy though and from what others tell me the henny wings are where it's at with this spot. Maybe next visit.", "author": "Lainey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "I will 100% say (and agree) that I'm biased just based on the fact that I'm FROM Dallas, TX. In my opinion, this place was an insult. Lol. (I'm just accustomed to the real deal.) \nWhen I first moved to NY, one of my Colombian friends found out I was from Dallas. They surprised me for lunch by taking me here. This person, never having been to the south, believes this is the best BBQ place on this planet. So, imagine their excitement in taking me. I ordered a basic pulled-pork sandwich with fries. Both items were barely warm. The meat was just...bleh. Just so average. The service is great, the atmosphere is great, but if you want a better taste in authentic BBQ, I would suggest Fletcher's on 3rd Ave and 8th St. in Brooklyn. Needless to say, I will never be coming here again.", "author": "Alexandrea C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Food was excellent,  drinks was excellent environment was a little to loud for my taste. The waiter was rushing me to order and I like to take my time so customer service was not the friendliest I understand they were busy but it was my first time there but I would return for the food and the portion was pretty big for me and the three kids it came up to $90 not bad.", "author": "Dia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Food was great. The beef ribs were huge and delicious. We even out free cupcakes after our meal! The only downside was the place itself. Most of the cushion on the chair were ripped and the booths were even worst. I would most definitely come back but hopefully they will replace some of the furnitures.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "Solid three star place. I wouldn't be too impressed with a date here, but the food is ok. NYC can't seem to get good BBQ. I always get the \"bbq\" chicken (AKA Roasted Chicken slathered in BBQ sauce) a baked potato and corn bread.  The corn bread is basically the Jiffy Mix you find in the grocery store, they don't even try and hook it up and make it seem like it's their own. The rice is meh and SO out of place for a BBQ place! The BBQ sauce is the best thing they serve tbh, just drown your food in it and YUMM-O!\n\nSeriously, I recommend this place only as a drinking spot for pre fun activities. They are huge, cheap, and tasty.", "author": "Kim O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Waitress was very pleasant and knowledgeable about items on menu. I had sticky and henny wings. Really good. Tsunami with extra shot was awesome!! Must try both!!!", "author": "LaVonda A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Went on a Saturday and while it was very busy we still got seated pretty fast. The food was relatively cheap considering the huge portions you get. I got the BBQ rotisserie chicken,fried shrimp, with rice and cornbread. It  was so much food! I ate until I was full and still ended up taking half home.\n\nThe chicken was very moist and tender but next time I'll probably opt for the plain instead of the BBQ. It appeared that they just poured bbq sauce on it at the end as opposed to actually baking the sauce into the chicken. Also, I've had better cornbread. \n\nI wish I had tried the Texas sized drinks that everyone's talking about . Next time!", "author": "Marla B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-21", "description": "If you are between the ages of 18 to 26 go somewhere else. You are young and fabulous and you should be with other young fabulous people. \n\nThis review is based solely on the servers here which excludes the bus boys:  When my friend and I walked in, there was someone infront of us he was alone and the host said to him \"we don't serve your kind here.\" it turns out they knew eachother, however I didn't hear him laughing nor was it professional on the restaurants behalf. The customer should never witness crude racist comments even if jokingly, that is a law suite waiting to happen.  \n\nWe were seated immediately, pretty crappy that I had to witness that disgusting lack of a joke comment the host made but a semi decent start I guess. The server didn't come until 10 minutes only to tell us to wait 5 more minutes. He came back eventually to take our orders and we ordered one dish to share. I had read and heard that the servings here are huge. So we ordered one to see how big it would be and if it was not big enough we'd certainly order more. \n\nHe was very rude and asked \"just that one? Are you sure?\" and I said yes we can always order more later can't we? \n\nHe walked away and I saw him at the host booth talking to the girl making hand gestures about the number two and pointed at us (his back was faced to me). \n\nWhile we were waiting for our waters I saw one of the servers grab the bill off a table and took his wallet out to shove the tip money in-- right in the middle of the joint. \n\nOur server managed to bring drinks to the other tables but not for us. I laughed and took one more look around at the BBQ barn for the obease and alcoholics of NYC and with no hesitation got up and left. \n\nOn my way out the host was very sarcastic and mentioned something about me and my friend under her breath. I was close to saying something back but I didn't give her the pleasure I simply forgave her and told her to have a good weekend. \n\nRise above. It might be cheap and have big portions, that's what lured me in, but I'd rather pay a little more to dine in class. I'm disappointed that it was such a crappy experience but at least it only cost me 15 minutes of my life and not my $ or health.", "author": "Trisha W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "Chicken wings are delicious!! Huge portions.  Texas size daiquiris are also unbelievably good.  Service was only okay.  Though the place was very busy, the staff moves the food quickly but they are kind of rude.", "author": "Tamara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Great prices and good food. This is a causal place with tasty dishes, very hefty servings and yummy drinks. I got a piña colada with wild berry flavor and a extra shot, Texas sized. Was plenty of drink, well made. The Hennessy wings were really good - real wings not the mini ones. Don't bother with the Caesar salad, not much dressing and lacked flavor. Perhaps ask for more dressing on the side. Pulled pork sandwich was delicious and the baked potato was well cooked too. Fast service and even with a seemingly long line, only waited 10mjns on a Saturday night. It's a big place and seems to be very well managed. Will be back, for another cheat meal:)", "author": "Sara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "No need to get all fancy shmancy here with your finest jewels. This place is ghetto fabulous and i love it! The drinks (Texas size only) are EVERYTHING!!! Im your only suppoaed to come here for WINGS \u0026 Texas Size DRINKS!!! Im drinking by the wsy, so bye!", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "The food is pretty good if want some soul food and fairly priced. I took one star off because the place is dark. Maybe they could lighten it up. The drinks are insane so if you need to feel nice order a regular sized, Texas size is not necessary.", "author": "Francine J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-09", "description": "My friend raved about Dallas BBQ, so I agreed to check it out. Went on a Sunday evening, so it was pretty busy. I ordered the sticky wings, a baked potato, and cornbread with a frozen pina colada. The food was average, as was the drink. This place did not live up to the hype. It's too expensive for the mediocre food and service. Would not recommend.", "author": "Ty W."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}