{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "My entire meal was horrible. A bunch of premade crap. With these prices at the very least make my food fresh. The shrimp taste like the oil needs to be changed, ribs overcooked and rice dry. Not to mention the manager was a complete jerk. Never again!!", "author": "Rhonda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "The worst bbq ever, the food is good but I quiver every time I go in there. The local wildlife seem to have no manners or etiquette what so ever I understand people get excited over affordable large drinks but it sounds like an animal house. You cant even take a date there because you'll be screaming to each other just to talk for no reason because of the ratchet types that frequent this location. The food is good and wings and drinks always on point just wish there was a bit more control on the crowd and it would be perfect", "author": "Billye D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "The wait for this restaurant was around 25-30 minutes. It was packed and very noisy. This is the type of place you could show up in sweatpants and a sweatshirt and no one would care, that's just how casual it is. The music playing differed from R\u0026B or country, to pop or rap. \n\nWe got the sweet and sour shrimp, vegetable Tempura, and crab cakes. The shrimp was actually pretty good, the crab ok, but the Tempura was a disappointment. It was flavorless and I regret wasting money on it. \n\nFor our entrees we ordered a veggie burger, the steak chicken shrimp combo, and the shrimp with salmon. Entrees come with either rice, a baked potato, fries, or a side of salad. I got the veggie burger which was made with beans and it was pretty average. It was topped with salsa, cheese, and a good amount of lettuce. My side was a baked potato which came still still wrapped in the aluminum foil and completely un-seasoned. Though it was very filling I won't remember it a couple of days from today. \n\nI heard the salmon was pretty good and the people who ordered it got a huge serving of fries with it. \n\nThe only non-vegetarian at the table got the meat combo which came on a huge plate and was unable to be finished. According to them the chicken was completely flavorless. They took one bite and couldn't continue. They said the same of the steak and corn bread. Their meal also came with a ridiculously large serving of French fries that they barely made a dent in. \n\nThere are no deserts on the menu but as a way to composite for it, tiny cupcakes come at the end of the meal. The drinks came in huge \"Texas\" sized cups and there was a very limited food/drink selection for kids. \n\nTo conclude, the food was average to below average. If your starving and want a quick bite then coming here is ok but don't come if you want a good mind blowing meal. \n\nPs: Dieters beware. This place is NOT diet friendly and there are barely any vegetarian options.", "author": "Jade K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "**Early Bird Lunch Special Overview** Although I am giving BBQ's(as we call it) a 3 star rating, I really enjoyed myself here. It dawned on me the other week BBQ's had an Early Bird lunch special. I was in the Boerum Hill/Park Slope area and was reminded of this. I had had it once before here and left pleasantly surprised and FULL. Part 2. I read a menu somewhere that said that the lunch special is $8.99. Nice. But when I got there, the menu stated that it was...*drumroll*....$7.99. Joy! It consists of a cup of a hearty chicken vegetable soup, 1/2 chicken, cornbread and your choice of baked or french fried potatoes or yellow rice. You can have your chicken honey dipped, barbecue basted, and even be entirely white meat, for an additional $1-$2. No add-ons for me as the table provided a barbecue sauce and this time around I wanted to taste the meat. Still salivating over the price, I couldn't get over the fact that I was eating for so cheap. And then I ordered the Piña Colada....*drumroll*....for $8.99. Ughhhh. And it was virgen and Texas-sized. It was great and refreshing and served quickly but I left a good amount of it. I kind of wished I just settled for a Coke. The chicken was dry, Folks. As I forked through the flesh, I did get some bites that were juicy. The outside layer of the chicken was sort of rough. I attribute this to the meat being under a heater for however long just waiting to be chosen. I began to kick myself for not exploring any of the add-ons. My sweet server did mention that the barbecue sauce on the table was different then the add-on one. The table one was liquidy and resembled a no-frills industrial kind. Still kicking myself. My baked potato was standard. The sour cream provided was da BOMB though. And it may be packaged, but it elevated my baked potato with it's subtle tartness and cooling note. I wished my cornbread was warm. Hell, I'd take room temperature. My fantasy of warm cornbread melting a smear of butter was euthanized. This special is only offered from M-Th and from 11am-1230pm and again from 2pm-5pm. And they were playing the jamz on their TV sets. I caught myself dancing and eating and not caring. After asking for the check, I was greeted with a cute little cupcake. So you see, this rating is a strong 3 borderline 4. I would have to explore the menu more. And I saw that they just added a Chicken and Waffles to the menu. Which guarantees that I will be back very soon.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "In town with some colleagues for work and were looking for a quintessential Brooklyn place to have dinner at.  Not sure this is it but the restaurant was really busy especially for a Thursday so we agreed to check it out even though we had a short wait to be seated.\n\nThere are a bunch of TVs around the restaurant that made watching March Madness easy and comfortable. \n\nDrinks were awesome.  Good selection of beer and a number of us had specialty frozen drinks which are huge and tons of fun.  Great idea for the restaurant to promote these drinks.  They really add to the atmosphere and as I watched other tables receive their drinks it always resulted in additional excitement.  I recommend the Pina Colada!\n\nFood was good.  Not amazing BBQ but certainly very good.  We had ribs, chicken and a pulled pork Burger (which is a beef Burger with pulled pork on it).  Huge helpings of fries accompanies everything and the cornbread that comes on every plate adds an extra southern kick!\n\nServing sizes at the restaurant are very large. No need for an appetizer.  Nobody left hungry.\n\nMy biggest complaint is that the wait staff always seemed to have other things to do.  They were always very nice and made a point of apologizing whenever they came to see us but we waited for every part of our meal: drink order, drinks to arrive, food order, food to arrive, and bill to come.  It definitely put a bit of a damper on the experience.  \n\nNote that this restaurant automatically adds 15% to your bill as a service charge.  Upside is that you don't need to think too much about how much to tip.  Downside is that the waitstaff have little incentive to make sure you're taken care of during your visit.  Was apparent to us.\n\nWill be back next time were in town but because of the atmosphere and the drinks.  This was a truly fun place to have dinner.  Food was good but it is lots of other places too.  Helpings were big.  Service was lacking but maybe that was just the night we were there.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "Food was great and drinks we're liqoured up unlike the Manhattan 8th ave location. I was so happy to come here and tear it up with my train gang no douth. I like the food i had here steak, yellow rice and shrimp was ok unlike the Flatbush junction location where the food tasted like cardboard ... But the location atmosphere is better tho so check it out large screen projector and double floors with nice view ... Service depends I would say it was above average ...", "author": "Issac L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "I ate here yesterday night after I went to the movies with my family. It was pretty cool here . I ordered the chicken power bowl which was amaze Balls . The waiter was pretty good with great energy . I always come to this spot the service changes each time.", "author": "Ayers A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "When we got to our table the place mats still had crumbs and decent sized pieces of food on them. Also the paper napkins were stained from something that had spilled on them. That just set me up for not wanting to eat. But we are gluttons for punishment so we ordered 2 drinks and the hot wings. The flavor of the sauce was delicious; however, they came out too fast! They came out before we got our drinks.  #suspicious Also I asked for blue cheese that I never received. \n\nThe drinks were good but not good enough to deserve another visit.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "I have yet to eat in this establishment because of the filthy mess that they repeatedly leave at their back door on Schermerhorn St. Apart from residential buildings on this block, there is a preschool. People walking on the block must pick their way through gross decomposing food and grease. Today you could smell it half a block away.", "author": "Tony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "One of my favorite places in NYC. The drinks are amazing and the good is good. They have a bar menu with wings, burgers and sandwiches but they also have ribs. I had a henny burger and it was outstanding. The sauce was like bbq sauce with a pleasant twist. I had the moscato mama frozen drink and loved it. The service was amazing and we got there at a good time so there was no wait. I'm looking forward to going back and trying the henny wings. All the food going to other tables looked delicious so I want to try more menu items. I always get burgers or just drinks. The drinks are in a class by themselves. It's their best feature in my opinion. Lots of variety and delicious. They're not afraid to put alcohol in a slushy drink so they're alright with me. I wish they were in more states. I am a loyal fan and will always stop in while visiting NYC.", "author": "Celeta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Food was very tasty and affordable! The wait was supposed to be about 30 minutes but it ended up being shorter. I had the mascatomama which was so good! The drinks are pricey but they are huge and you may not even need to order another one. I ordered the shrimp and cod platter which was very filling. The waiter could have been nicer and they need to have more options besides fries and onion loaves for the sides. That was my second time at this place and I was pleased once again!", "author": "Aba W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Im a non meat eater so my meal choices is the Grilled Salmon platter it is the bomb. And the power bowl is my favorite of all. My only issue is the noise to music  ratio it feel like public school all over again .", "author": "D650 V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Been to a few Dallas BBQ spots in this city. And this particular location usually takes a while to get a table? Why? Because they are good! Food is delicious, drinks are phenomenal, especially when you Texas-size your drink. I'm a sucker for their Long Island ice tea with some bubbly and extra shot added to my drink . While waiting for a table can be a pain, it is worth it. Get a lot of grub for your buck. Never leave hungry. And if you order ribs and chicken, make sure to ask for extra napkins and wipes. Your fingers will get sticky, you're tempted to wipe on your clothes lol. Don't want to do that", "author": "J A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Food was ok but the staff was rude as hell I gave my waitress a tip but did she say thank u? Nope she snach the money out of my hand and tried to walk off but I called her rude ass back and took my tip back  next time don't be so rude and I definitely will not be coming back", "author": "Kamica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "I'm completely disgusted with the lack of service at this location. There's been times where I've ordered \u0026 was given something different. Their response times are also ridiculous. I waited two hours for a delivery today when I was originally verbally provided an eta of 30-40 minutes. I called to inquire on whether or not the food would be delivered \u0026 I was placed on hold for four minutes. Not to mention my original phone order which shouldn't have exceeded a 2 minutes was nine minutes long.  When my food got here, it was not what I ordered. I've been going to BBQ's for over 20 years \u0026 of all the locations, I've had the worse one (repeatedly) @ the downtown Brooklyn one.", "author": "Nyrean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "My Girlfriend and I had the baby back ribs and fried shrimp. I had some French fries with that while she had baked potato. The food was okay... the shrimp could have been better. I enjoyed myself though.", "author": "C.J. N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "I had the sticky chicken tenders and they were amazing. The cornbread was dry and the coleslaw was just okay. The MoscatoMama saved the entire meal. Highly recommend.", "author": "Briana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Wednesday, June 26, 2018 @ 3ish.\nTwo friends and I arrived and the 3 people at the hostess station were stumbling over each other.\nOne of the hosts walks us all the way around to a booth by the area where they keep the dirty dishes.\nWaitress is very young and didn't even look old enough to drink adult beverage not serve them.\nShe totally, does not listen but, we like to encourage people to better themselves and work.\nWe ordered a large order of wings without sauce( it is brought out with the sauce on the side so it can be charged on bill). \nShe brings a regular ginger ale instead of Texas size( so once again it will increase the bill)\nThe drinks were quite thick and ice barely melted in the Henny Colada and that other drink with the wine shot( which is pictured with bottle).\nCrabcakes and shrimps were actually crab balls on some dry cabbage.\nThe onion loaf came out soggy but, she was hungry and ate it anyway.\nThe chili salad was mostly lettuce, 6 tomatoes cubed, NO ONIONS(I asked for extra) cold chili( because if it was hot like ordered it would have wilted down the lettuce some). \nNow, she brings check before she even asked if we wanted anything else...then came back and just tossed 2 cupcakes down.\nIt was ridiculous that the restaurant was no where ear 1/4 full but, you put everyone by the window and had people waiting to be seated.\nI would not recommend this location and probably won't be rushing to another location anytime soon.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "This Resturant is ok. One of my favs when I only have a little time to sit down and eat.", "author": "Kenya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Went there on Thursday night with a friend. Ordered chicken wing, fried shrimp, half chicken. It was so much food. Really, this is one of the reason to like this place, the portion sizes are huge. Service was very attentive to our table (maybe just the timing - few customers and 11pm at night). The place itself needs some renovation.", "author": "Ivan S."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}