{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "So everytime I've come to NY for the past two years, I've come here. I've tried multiple locations and the food is always on point. This day, I was in a party of four and was seated immediately. The place was packed and noisy but not to the point i could not hear my party.\n\nI ordered sticky wings, fries, and a margarita. The amount of food I received was amazing. The chicken wings were HUGE. The margarita looked Texas size but it wasn't. And I got a whole plate of fries. And they came out SUPER QUICK. We were all shook because she left and came back with it in probably 5 minutes at most.\n\nThe sticky wings are to die for. I was not disappointed. I almost ordered the chicken and waffles but my friend did. He liked everything but the chicken breast that came with it. He said it was dry, but all the other pieces were good. Also the scallion and honey sauce was surprisingly delicious. I did not see them provide syrup though, which personally I would've wanted. I also got to try their corn bread and that was okay however it was huge. To be completely honest, I couldn't even finish my fries because I had so much food. And the price was not too bad either. Also the margaritas were strong. It didn't have a kick but rather a stomp. On a normal day, we would've gotten more but we were gonna do heavy drinking the next day so he chilled. But definitely try the drinks.\n\nIn the end, we left there with a full belly, a to go box, the itis, and a nice buzz. Whenever you're in NY, definitely go experience this place.", "author": "Darrian J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-25", "description": "Firstly....\nI understand it's fast paced butttt the bartender is so nasty !!!\nOmg not once he washed his hands\nSecondly he didn't even rinse out the glass he serving people....\nThe manager had to literally tell him it's dirty omg\nNever again!!!\nPeople can get sick that way...\nAnd I'm not saying anything bad the food was good but the glasses are dirty ..... because other bartenders came while I was there but that first one omg\nHe's just there for the pay... and that's horrible .... and I use to love this place\n~do better \nRecruit people who love their jobs...\nIf u can't get ur dream jobs love what u do....", "author": "Miles L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-20", "description": "Dallas BBQ never lets me down! My one suggestion that I have is make sure you get those Sticky Wings! Not only are they to die for but that's all you need! The best $12 you could ever spend! I really want to make the Sticky wings at home but if they down turn out right I guess I will be in NY every weekend! \n\nUpon arriving the line was out the door with people waiting but the wait was no longer than ten minutes which wasn't that bad! The Waiter was cool he was very honest and direct. I can not remember his name but he was a cute dark skinned black man. LOL... \n\nThe Bathrooms were really small, that was not my favorite part! I will honestly also say that the atmosphere in Times Square is just my favorite one. It is two floors and much bigger but the food was still amazing.", "author": "Tishea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-16", "description": "Well St Patty's weekend is here, and there is nothing better than having your friends celebrate for you with a drink to satisfy the one with the best tolerance. We had great food, and some of the crew went no-alcohol, and the rest pretended to be Irish for a day.  The service was ok, and the food as well, but the best part is celebrating with true friends.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Stopped in for lunch with my parents after visiting the area. I love the wings here so we made a large order of sticky wings, sauce on the side, and two combo platters with ribs, steak and shrimp. Everything was pretty good and filling. The portions were so big we took most of it home.", "author": "Cheryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "I was told about this place when I visited NY. My girls and I came here and had a great dinner. You have to try a drink here they are so good! These drinks will get you drink so be careful lol. You can add shots, mix different flavors \u0026 they are huge. They have many locations around NY. I'm from SF I have recommended this place to people going to NY looking for a place to eat. The foods good too I got truffle Mac n cheese \u0026 chili but I'll be back to get a drink everytime im around", "author": "Aleyah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-23", "description": "How. Is it no refills on a non alcoholic drink. Service here stuck had a manager tell me they dont do refills on soft drinks. The waiter never stopped for one second to take our order properly... #NoRefills #LittleDrinkSaturday #ShadyManager", "author": "Darryl S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "The food was good, service efficient and courteous. The portions are huge!!! The reason I gave 3 stars is because the place could be cleaner..", "author": "Suchitra K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "Not my choice of places to eat. The corn on the cob is my favorite. \nThe service sucks.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-04", "description": "This past Saturday I visited the restaurant. While eating I happen to look over and caught a glimpse of something moving on the back of the booth (towards a child's coat). I kept looking and noticed it was a ROACH. Being a mother I quickly got up and informed the lady sitting with him of the bug. she quickly scooped it up with the napkin i gave her and the manager was called over. This disgusted me completely as well as my boyfriend and mother who also stopped eating at the site of a roach. \n\nThe manager quickly came over offering up an explanation that just disgusted me even more. His reasoning was \"I apologize as we just had the exterminator over. Please note we will be calling him back\". I was shocked to have heard this as the reason. I then asked if we would be accommodated and at least given a discount on our meal since we stopped eating. His response was \"I am sorry but I cannot do that since you were out of reach\" of the incident. This response was unacceptable.\n\nHaving managed a cafe at some point I could not believe this. His attitude towards the situation was unsatisfactory and questionable for allowing me to leave the establishment as an unhappy customer who had just witnessed one of the most horrifying and disgusting things anyone can ever see at a restaurant. I quickly asked for the bill and proceeded to the bathroom, and this was the nail in the coffin as people would say. The bathrooms were disgusting and when I looked in the kitchen all i could think of was WHERE IS THE HEALTH DEPARTMENT. there was food all of the floors under the counters where food was being prepared. The kitchen was just in pure disarray. \n\nWe will NOT be returning ever!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "This must be one of the oldest Dallas BBQ locations because the decor and furnishing here look worn and torn. The people before me must've not used any wet naps and pressed their sticky fingers against the seats because my friend and I had to wipe down our booth seats before we could sir comfortably. \n\nThis place can be pretty packed and loud. A lot of birthday celebrations take place here so expect to hear a lot of Happy Birthday songs sang by the wait staff. \n\nPortions are huge here. The drinks are great. The staff mediocre.", "author": "Yanni C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-06", "description": "I would give this place 3.5 stars, mainly for service.  Our waiter Manny was very friendly and helpful.  As for the food, it's definitely cheap and large portions.  I came here with a group of 4 people on a Saturday afternoon.  They have an early bird dinner special until 4pm on weekends - chicken soup, half a roasted chicken, choice of potato or rice, and cornbread for $7.99 which is a great deal.  We ordered two early bird dinners and the sticky wings (large 10 wings) to share amongst the 4 of us.  You can definitely share the early bird dinner with another person.  The wings were huge, crispy, but the sauce was a bit too sweet for me.  The chicken soup was tasty and there was a lot of chicken.  The half chicken was a bit dry and overcooked.  The fries were not crispy.  The cornbread was dry.  You get free dessert which varies since we received red velvet cake that day.  The bathroom was not clean but our table was clean.  It's a cheap place to eat if you're in the Downtown Brooklyn area but I wouldn't go out of my way to come here.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "So first off this place is NOT quiet so be prepared for that but overall the food is damn good. I had Chicken \u0026 Baby back ribs, and it was glorious. We had to wait a little while for the food but it was reletively busy so thats fine. If i had to say i really like the place but it is loud and you get an ton of sauce. So if you like Bbq restaurants definitly check it out", "author": "Bertil P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "A simple menu with something for everyone. Always filled with diners. Their signature wings and piña coladas are must-haves. Not a steakhouse, but the steak options are good too. Great for lunch and dinner on a budget. Always manage to take home half of my meal. The free cupcakes at the end are a nice touch.", "author": "Estralda T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-23", "description": "Consider that one star as rounding up. The place is like a downscale cafeteria, only with carpeting.  No bar, but some booze.  It was unclear what they offered.  My waiter mentioned Hennessy a few times.   I wanted a plain tonic with a lime.  He had to check what tonic was.  They didn't have that, but they had Hennessy.  No limes either.  Settled on water with a lemon.  I ordered food (reluctantly) and it was ok.  I only ate it because I was hungry.  While I was eating, the busboy was cleaning tables by dragging around a large black trash bag.  Never saw that before in any restaurant.  Kinda wish I didn't see that.  I didn't even know that was something I didn't want to ever see.  After the server placed my food, the waiter came right over and asked if everything was ok.  I explained I didn't know yet, I just got my food.  He said he would wait over there.  And he did.  Just staring at me.  The whole meal was odd and weird.  I spent less on diner than lunch and it wasn't worth it.  Lots of very large people seemed to be enjoying themselves though.", "author": "Ozzy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "I loveeee this place! I wish they would open more locations around the world. It is so worth it. \nThis place has the best wings ever! My favorite being Hennessy Wings. Just 5 wings alone can fill you up. \nThe drinks are GREATTTTT!! \nThe price is reasonable. \nThe environment of the place is very laid back but exciting at the same time. \nThey place great throwbacks music and new school music. \nThe customer service is great! \nI would definitely recommend this place!!", "author": "Shanae V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "This is my favorite place to go to in Chelsea. The sticky wings are do good as well as the coleslaw. Those Texas size drinks are the Best!", "author": "Sue V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "Can't go wrong with Dallas BBQ. The food, in my opinion tastes the same throughout the ones I've visited within the five boros.  \n\nBut let's be real. People come here for the drum roll.....DRINKS. The waiter asked if we wanted a sample of the new drink The nutcracker which of course we said yes, Duh. I thought I wouldn't like it, but I actually did. It had coconut flakes and a shot of vanilla Ciroc which I wasn't too crazy about. \n\nOne thing I noticed, the menu has changed a tad with new items added. My group ordered vegetable tempura which sounds weird for a BBQ place. It actually wasn't bad except it taste much better dipped in soy sauce. The prices also has gone up but the portions are bigger except for the shrimp and crabcake appetizer. I wish I took a picture, but that thing was a joke. \n\nWish the bathrooms were cleaner and without graffiti. I really don't care that \"Bebe wuz here.\" Other than that it was fun and food was alright.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-19", "description": "Was excited to come try this from hearing all the hype.  Was basic BBQ for sure.   Don't think I'll be back unless invited by someone else for a party", "author": "Terrence W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-22", "description": "Always sends incomplete orders when ordering for d! 2nd time this has happened ughhhh\n\nOrdered wings.. they sent 5 wingettes that cost $14.  This location is trash", "author": "Ms C."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}