{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "By far he worst and rudest service ever. Combine that with the huge bone in the middle of the pulled pork burger, dryers chicken sandwich ever and carelessness of the manager - avoid at all costs.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Our server made this visit 10 times better. The BBQ food wasn't the best. I mean how do you say you're a BBQ place but do not have mac and cheese or mashed potatoes. Besides that, the drinks were GREAT. Nice place to grab a drink with a friend. Just don't expect the food to be any true southern BBQ.", "author": "Brittany N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-18", "description": "This place sucked! Had Denisea as a server. Horrible service for a Tues evening. Tip is already added to bill, so server could care less about you! You'll be ignored all night! Not worth it at all!!!!!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "This use to be my favorite place to eat at, but not any more the service was so bad the people that work there are trash.. and my rice was like sombody droped a pill of salt on my plate it was so gross. Never again. Horrible place to eat at", "author": "Carmen N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "Service was ok. Waiter wasn't paying attention much because he left off one of the items we ordered. Brought out the wrong order, but took it back and rectified the situation immediately.", "author": "Monique J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Must preface this bad review to say I had a good experience at this location a couple of years ago. My last visit is the reason for the current one star review. I ordered the ribs, shrimp and \"steak\" special. The ribs and shrimp we're ok but the \"steak\" turned out to be liver. Couldn't believe they had the gall to serve liver and not expect one to notice. Didn't expect a high quality steak for that deal but serving liver is just next level dishonesty; I grew up eating liver and have nothing against it really but it's not what I ordered. Asked my waiter about this and he referred me to the manager then the manager assured me that I was not served liver...the very liver still on my plate as I spoke to him. This was infuriating and definitely one of the worst dinning experiences of my life.", "author": "Dre S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "I tried to have lunch here. I was seated in a section and a waitress never came over to help us. I spoke to the hostess, who did not seem to understand anything. She asked me if I wanted a different seat and I informed her that I would like to sit in any seat that would allow me to order lunch. I sat for another 5 minutes and still no service. I had lunch elsewhere and will never return to this location. There was plenty of waitstaff, but no organization or willingness to help.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-23", "description": "This restaurant was really bad. I ordered the taco salad and essentially paid $10 for a bowl iceberg lettuce. It didn't even come with the sour cream as advertised and when I asked for a side of sour cream to decrease friction between leaves, I got two little packets of sour cream. Also, they don't have a dessert menu", "author": "Ivey J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "I have been working in Downtown Brooklyn for two years or so already and I've never had the opportunity to try out this Dallas BBQ location until last month. We were initially going to do a birthday dinner at Dinosaur BBQ, but due to overbooking we had to quickly decide on another restaurant in Brooklyn that would take a party of 10-12 and served barbecue, so we ended up at Dallas BBQ. \n\nThe wait was around 20-40 minutes. I must say this isn't the best Dallas BBQ I've been to because it was loud, rowdy, and super crowded not to mention it was a Friday night. After a 20-40 minute wait, we were finally seated and after deciding what we wanted, our waiter took our order.\n\nWe ordered two type of wings to share. The only type of wings I remember we had was the Hennesey wings which were quite delicious! The wings were jumbo- size. They were slightly sweet like honey, meaty, hot, and full of flavor. This was a good pick.\n\nFor entrée, I asked for the Pulled Pork \u0026 Brisket Special. It is supposed to come with bread, but I asked for it without bread (trying to cut some carbs). I got the special with a side of fries and coleslaw. The pulled pork was moist and tasty, but there was something a little offsetting about the brisket. The texture of the brisket felt very odd. It wasn't moist nor dry, but weird.  The fries were slightly crisp and soft. Coleslaw was okay. \n\nAfter we finished our entrees, our waiter brought out a plate of corn muffins with a green frosting (green for St. Patricks Day) and did a whole Happy Birthday theme for us. How delightful!\n\nThe dining experience at Dallas BBQ wasn't as bad as I thought it would be. The only complaints I have really is the texture of the brisket was off putting and the loud and rowdiness. I very much like the Dallas BBQ's in the city, they are more friendlier and not as loud or rowdy.  I don't think I would come back because this was really just a last resort/last minute decision since we couldn't get a table at Dinosaur BBQ.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Place was extra crowded. I love the drinks here. I ordered the seafood combo and Henny wings. I wish we they would bottle the Henny sauce and sell it. It's amazing. The crab cake were good but small. The shrimp was good. I would recommend this place.", "author": "Tajuana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "The hours for this place were wrong on here; and bc it said they closed at 10 we weren't planning to go there. We happened to walk by it anyway and it says it's open till 12am. \nWe were seated right away even though they were busy. Our drink orders were on the table before we knew what we wanted. Their mixed drinks are potent and that was awesome. If you're going to pay between 8-16$ for a drink it better be strong. \nWe ordered the beef ribs since I don't eat pork and it's rare to find beef ribs at a BBQ spot. They were tender and delicious, the sauce was so good.  Much better than the vinegary sauce that's in the bottle on the table. \nWe also ordered the chicken and savory waffles, which were sticky goodness. \n\nWe spent about $60 (tip is automatically included and included taxes) for dinner and drinks for two people but the portions were large and the drinks potent - absolutely worth it to us. \n\nDownside- this place is stadium level loud but that is entirely on the patrons. People were clearly having a good time with friends which is nice, but so GD loud that they drown out the music and anyone else trying to talk. \n\nI only wish there was karaoke for the late night crowd. Lol", "author": "Natta M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "My server crystal I believe her name was is amazing really sweet and funny. Went for a quick lunch with my mom and had a good experience. They could definitely use some remodeling and cleaner restrooms. I would go back again for her", "author": "Na'Kia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-22", "description": "Worst experience ever in my nyc life!! Service in really bad. The manager should check more on the floor.", "author": "Claudia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "Good ol' BBQs never disappoints. We had a margarita, pins colada (Texas size with an extra shot  of course), Henny chicken wings, cornbread, crabcakes and fries. It was pretty good and service was fast (maybe because its Labor day wknd). My buzz is still hanging on to dear life. But it will get rejuvenated tonight.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "Big portion with relatively low price. If you are a hungry wolf, this is the place to go. I came here for take-out. For ~$16, you can get a big box of ribs, chicken and baked potato along with corn bread and a tiny cute cupcake, which can almost feed two people. However, the taste is not ideal - the BBQ sauce it serves is way too sweet, which overwhelms the nice taste of the meat. The sides are decent and filling.", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "We were seated as soon as we walked in. Bianca was a great waiter. She constantly checked on us and make sure we had everything we needed. Our drinks and food came out in a timely fashion. The drinks was wonderful. I don't know if it's me but I think the Texas size drinks are getting smaller. The food was good, we weren't really hungry so we shared a 10 piece fried chicken. If you want great customer service and a waiter that checks on and make sure you're good, ask to sit in Bianca section. You rock girl.", "author": "Alania A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-09", "description": "Dropped by for a quick meal. Waited 15-minutes.\nWaiter took the male's order before the female. \nFood was ok. Pulled pork burger was served hot. The chicken with baby back ribs were tasty. The service needs improvement. Waiter informed only one of us about the delay and he only checked in with  one of us if the meal is ok.\n\n2-stars because of the little cupcakes were given complimentary after we asked for the bill.\nAlso, See your bill. Beware, Gratuity is already included. Ignore the lines below TOTAL.\n\nLots of patrons were ordering drinks and fried chicken wings.", "author": "Patty N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Best in class in downtown Brooklyn. Stands up well compared to other Dallas BBQ I've been to (all of em). Nice decor, friendly staff, fast service at lunchtime. Compared to all other sit down restaurants in the area its a best bet.\n\nEarly bird half chicken with soup choice of side is the best deal.\n\nFood is consistently good and there's a few choices that aren't suicidal choices for a daily visit. The staff is great, helpful and friendly.\n\nSo disregard low ratings here its not any indication of food or service just good old NYC snobbery :)", "author": "Stuart T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Definitely Texas sized meals and drinks. Fast service. Food was very good-especially the Hennessy burger and the sticky honey chicken wings. The drinks were great and very strong! I would recommend this restaurant.", "author": "Cailey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Recommended by two people (Chicago \u0026 Brooklyn) and it definitely hit the spot.  Large portions and everyone in my group wanted to go back.  we tried the ribs, chicken, shrimp, onion rings, burger, drinks and tempura vegetables.  Man - on - Man it was great.  I would definitely go back to visit", "author": "Jasmine M."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}