{"aggregateRating": {"reviewCount": 355, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-19", "description": "This by far was the worst food service ever. It's over crowded and extremely loud in this establishment. From the moment I sat down my neighbors sitting next to me were yelling to communicate to one another. My guest and I could not concentrate on a conversation. My server was great. He offered every special on the menu and was prompt with taking my order. I chose Baby Back Ribs and Chicken (dark meat) and a very tiny salad as my side . The ranch dressing served in a  large bowl and my salad went swimming inside of it.  \nWhen I received my meal I thought I was missing a piece of chicken , it was so small I thought I ordered a chicken wing . Also the chicken was not cleaned well because it still had the blood clot in it .The chicken lacked all flavor. The ribs were cooked 5 times over I thought I was chewing rubber . My dog has strong teeth and couldn't rip the meat off. The sauce was so sweet, I could not finish any of my meal. \nMy friend never finished his honey basted rotisserie chicken double dipped in batter and over fried . I was done at that point and couldn't wait to pay my $39.63 meal ( tip included) . I would have added more tip money if only  I enjoyed this meal and restaurant . For years Dallas BBQ has been my favorite spot to go to in NYC , but not the Brooklyn location. I will never return here again. I'll stick to what I know best and go to my favorite location on 23 rd St in Chelsea area in the city . I only chose this location because it was in my immediate area. My recommendation is go here if you like but have an open mind .", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Great food! Serving portions were very generous and prior to trying a drink, our waiter, Luis offered a sample to us. Luis was very knowledgeable and kind. Thank you for your great service!!", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "I don't know...just do not do it for me. Just a usual highly populated family restaurant. Food was ok. I will say the waiters are on point. If you looking for something generic...this is your place.", "author": "Carl L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-15", "description": "Gross. I got the Bar-B-Q Combo with pulled pork and beef brisket. The beef was too tough to chew. I ended up spitting out half my lunch. Yes, the place is always packed. So are most chains. A packed place does not equate to good food. I would never go to this place again.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "The ribs are on point...saucy \u0026 flavorful\nThe baked potato is as good as can be\nThe cornbread....magnificent \n\n\nThe DRINKS......Super-sized \u0026 ALWAYS On Point. (make sure to order an extra shot \u0026 down that first, then you sip on your drink. It'll give you a buzz faster).\n\nI used to travel to the one's in the city with my family, I'm glad they opened this one. I can take the B103 straight home or hop on the B41 \u0026 transfer to the B6...The trains aren't too far either. Parking is almost non-existent during peak hours, but that's to be expected if the place is popular.", "author": "Sadequa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "I loooove BBQs. I've been to like almost all of the locations in NYC. I go to this one sometimes when I don't want to get on the train but my fav one is the one on 23 St and 8th Ave...they have the best service. You can't go wrong with the sticky wings or fried wings with ranch on the side. I used to always get the honey basted rotisseried chicken but somehow over the years I can't eat it anymore. The chicken isn't cooked well enough for me and it makes me nauseous. So I stick with the ribs, shrimp, and wings. I LOVE their piña coladas!!! They are theee best...and very strong with the alcohol added. Bbqs is the go to place for consistent cheap food and drinks. Also ALWAYS SUPER FAST SERVICE. definitely a major plus!", "author": "Djinou J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "Rum punch wit a EXTRA shot n sticky wings, the food is okay only the wings r a killer, the waiters are really not that great that why i didn't give too many stars but they have three for the drinks mostly....", "author": "Tiff T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-12", "description": "The food was good price is good but the service like i blame the manager he gave the employees there paycheck while they were serving customers so what happen the employees open there paycheck and it look like a union meeting going on they start talking about there checks and forget about the customers so we waited longer for our food if it wasn't for the manager doing that the exprience would have been much better", "author": "Boy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "im here regular  aka liquid lunch. i love the fast service. i must give tellie sum stars. well of of the 5 stars he is all 5.tellie is da best waiter at dis location --- i love u tellie lol i'm at a table for 1 not 2/3/4 -- save me tellie--- yahhh !! im never in a rush so i like coming alone!! but when im with co workers they are always in a rush but a few times tellie made sure they ate , they had their doggy bag , bill was ready and we was good to go. i never forgot his name from the 1st time he served me. he is full of life and very gentle and polite. he is the life of bbq's. he offer sample of drinks if u not sure wat drink to choose. today he wasn't even assigned to my table but i called out to him to let him know i needed to be taken care of. he looked for the assigned waitress but she was having issues so he took care of me with no problem. my food was great and my drink was not wat i wanted but it was good. i was in there for that new \"yolo ice tea\" treatment!! but its out now yeaaa it came out at 4pm. thanks for the 2 red velvet cupcakes tellie!! lol nx time gimme corn bread!! lol", "author": "I C Y U N V S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "So i get to this place i ask to be seated and 10 minuted go by no weighter/tress so i placed my order at the to go desk with the manager that saw me walk to him from the dining area and neglected to even find out why i was ordering there or if my meal was ok assuming i had one, great job dallas bbq's", "author": "Emmanuel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-17", "description": "So tonight me and my home girl came in here to enjoy food and drinks.I had ordered chicken tenders, while my friend ordered a salad with the dressing on the side. As she is eating she notice a bug in her salad. She told the waiter and he asked if she wanted another one. Needless to say, she requested for the manage. He was a totally ASS HOLE AND NONE CARING ABOUT THE SITUATION. He had the nerve to say it looked like lettuce. By far the most disgusting thing I've ever encountered in my life. BBQ WAS A FAVORITE SPOT FOR ME, TONIGHT WAS AND IS MY LAST VISIT TO ANY BRANCH. I will also be filling a complaint with the health department. Not to mention, we still had to pay for our food. The only reason I gave a star is because I had to in order to write the review.  They need to be inspected who knows what else goes on in the kitchen.", "author": "Precious P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-09", "description": "We had the baby back ribs, pulled pork sandwich and coleslaw, the food was good but not great, in my opinion, the coleslaw was the best, then the pulled pork and lastly the ribs, however, still good.  The service was good for a chain type of restaurant and the prices are very reasonable given the portions.  Overall, it was a fun experience.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "The waiter is friendly and so fast! Foods are pretty okay for this kind of chain stores. Price for drinks is acceptable. I would visit there again for baby back ribs.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "Came here on a friday night w/ 3 friends. The neighborhood at night might be a little scary so be sure to go w/ guys. \nThe portions from Dallas BBQ are always hugeee. I tried the ribs..it was alright. I thought the drinks were a little too strong and they put an extra shot on the side when i didn't ask for it.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "I am a carnivore. I find it totally pretentious and unnatural to be anything but! (actually, I'm just jealous of those silly vegetarians and their slim, healthy, e-coli-less, figures) \n\nSo, after consecutive nights of spicy noodles, steamed dumplings, dragon rolls, and sweet and sour soup,  I was craving something uniquely American- and I wanted it fried. \n\nChicken fingers and potato skins it was! And oh... can I get fries with that? Yes? I'm in!\n\n...wait... I'm eating... something... why can't I taste it? OMGZ! My taste buds! That food from those other countries must've had lead in it! I need to throw out my leftovers and get rid of my barbie dolls (that uh, I'm giving as Christmas presents...) I need to taste again! Am I dying?!\n\nLuckily... I am still alive... though, after eating this food I kinda wished I was dead... fried, big, portions may be uniquely American, but MY food should be uniquely New York in taste and quality. This place made me re-think my carnivorous lifestyle.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-20", "description": "After Church we visited and we received very small portion of food and we paid twenty six dollars for a order for two. When I looked into my bag with our food on the plate I was very shock on the portion and the amount of food. We had small chicken leg with thigh and a poor grade of chicken. a bake potato which was not done, cornbread had no taste to it. We are from long Island. I will never return here again. It was hard finding parking too. This was not worth it to come for the amount of money that was spend. i will obtain better BBq place in the neighborhood. It did not fill my wife and I at all.", "author": "Diana W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-19", "description": "The food and drinks are the best but the service in this location is super whack.. no one cleared room on my table so i just started putting dishes on the floor... like a boss. Im pretty sure on a busy night you can walk out without paying because all the waiters are clueless.", "author": "Guy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "I love BBQ's. The prices are great \u0026 the food is good. My only complaint are the seating arrangements. You feel like you're sitting on top of the table next to you unless you have a booth seat.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-10", "description": "Never again will I ever patronize this establishment. I came with a party of 4 Saturday night and was seated in 5 minutes (great). The waiter came introduced himself and said he would be back. He came back 10 minutes later and we told him we were ready to order. We placed our order and waited for 45 minutes. I couldn't believe as the table behind us which was a party of 4 and the table next to us which was a party of 5 were both seated after us and had their food orders before we did. Finally when I tracked the waiter down and asked him about our food order he looked at me with a blank stare and see I will go check for you. He didn't even bother to come back to update us on the status. We asked for a manager and explained what we ordered and how 2 other parties after us were already served their food (no apology from the manager ether). Our waiter then comes back and said it will be 2-3 minutes. By that time the table next to us (party of 5) was receiving their second serving of wings, drinks, and appetizers, etc. Finally the food and arrived and womp, womp, womp, it's cold. My mom's food was cold and my chicken was extremely dry. They took it back and added some sauce to it but the food was not reheated or a new dish was cooked for us. The waiter never apologized nor did he give an explanation to the long wait. I get that it's a Saturday and its packed but when everyone else around me has food then I am pissed. As we were eating the waiter literally stood by our table but still didn't ask us if we were okay, if we needed drinks or anything else. Finally, the bill comes We were charged $96 including 15% gratuity. I immediately called the manager over and reminded him of our experience and told him that we were not going to compensate our waiter for his lack of service. He immediately took the gratuity off and we did not tip the waiter. The waiter must have told his fellow co-workers because as we were leave a waitress rolled her eyes and mumbled bitch to me under her breath. I don't care what you call me. When I come to a restaurant I automatically have in my mind that I am tipping 20% if the service is not so great I start deducting from that percentage and his service sucked and I waited 45 minutes for cold food and not even a refill on my drink so he got nothing and deserved nothing.", "author": "Ebony J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I don't know how many times I've been but obviously I'd rate myself as a fan of this franchise. A friend and I went to grab a late lunch on Memorial Day and it was deserted. I was expecting a full house for some reason since their cuisine is predominantly bbq but I guess everyone decided to make it themselves. The waitress was pretty nice. She quickly took our drink order and returned for our meal selections. On such a slow day, the three of us could not figure out why the kitchen was so backed up on chicken tenders. While I waited, we decided to share an order of fries. My friend bet that the fries would come out with the tenders though it was requested much later. Would you believe she guessed right? Anywho, the meal was delicious as always. Just enough portions to leave with full bellies. I tried out their new drink the Miami Vice (pina colada and non-alcoholic strawberry daiquiri). It didn't blend well in my opinion, but you're welcome to try it yourself. Only downside really is the restroom facilities. The stalls are way too tiny and mothers are left without a changing table so be sure to make the necessary preparations before heading over here. Take it from me and stick to the front of the house.", "author": "Kristia B."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Dallas BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "180 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCmhjcVERrQiXGS3xDXE9A/ls.jpg", "@type": "Restaurant", "telephone": "+17186435700"}