{"aggregateRating": {"reviewCount": 97, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "This spot is my new favorite in the hood. There are so many changes happening right now on Smith St - but Fawkner keeps it real.. Tasty bar food with the BEST burger around.", "author": "Mr. A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "Solid bar...could easily be 4*...just need to fix a few things. First of all the outdoor area (which obviously won't be of much use for a while,) could be made a little more welcoming. Inside, there are lots of cool spaces (sometimes too literally: ventilation and cooling systems are odd...we had to move a couple of times after getting stuck in freezing spots.) Sandwiches hit the spot. Drinks are good. Bartenders are friendly, but not completely on the ball: ran a tab one night, had at least a dozen drinks in my group and each time the dude asked me my name. Could be really good and comfortable. Not yet.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "This spot is amazing. I came here with hubby on Friday night and we were really impressed with the service and the decor. Leah, our bartender, was really sweet and made us the best manhattans we have ever had! She then gave us some great beer recommendations. We hung out for a few hours and really felt at home. The ambience is really nice as well. We will definitely be coming back on the regular !", "author": "Mila K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "I want to like this place and keep giving it a shot, but the few bartenders I've encountered are such miserable, unpleasant human beings (and seemingly incompetent) that I can't go back and don't recommend it.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Fawkner honestly has the coolest decor and set up I've seen in at a bar in a long time, or possibly ever. It's a cozy place to hang out with a group, or solo given its ample seating, multiple quiet corners, and long spacious bar. The beer selection is great and they even offer premium bottles (Maine Brewing's Peeper Ale, for example.) Haven't tried the food yet but have to imagine it's great. Staff is super nice and friendly. 10/10 would recommend to a friend", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Lots of great choices for beer and good wine pours - no complaints, especially considering all the seating throughout the bar and couches in the back.  Once my boyfriend and I saw their food menu, we decided we'll have to come back to try it out, so I'll update my review when we do.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Fun, low key new bar in town. Great sandwiches- we had the roasted pork and fried chicken.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-21", "description": "Went in to meet a friend for dinner on a not busy Tuesday night.  My fault that I left the credit card at the bar, but I went back 2 days later and they had completely lost my credit card!  Pretty irresponsible.  They spent literally 2 seconds looking for it.  Also, no one apologized.  Least you could have done was give me a free beer for losing my credit card, but thats not how this place seems to function.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "Terrible place. Female bartender was nasty, bad attitude and her drinks will leave a sour taste in your mouth, literally. Bartender is incompetent, cannot make a decent $12 cocktails.  Had ask to get something else, of which she responded \"if you want to pay for it\". First off, you made an inedible drink and y you want me to pay for it. B*tch please. Save your money and go elsewhere. Do NOT order the cocktails. Came here for NYE first time and will never come back! This place will be out of business in no time with poor service and staff with bad attitudes. Karma! You will never gain any loyalty from locals by functioning like this!", "author": "Phaedra Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Best fried chicken sandwich I've had in awhile. Not too greasy. The corn pudding and slaw add interesting flavors without overwhelming the delicious fried chicken. Fries came with your choice of dipping sauce. The maple sauce and the spicy Japanese mayo were delicious. The bartender was also very friendly and attentive.", "author": "Mary F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "We enjoyed our sandwiches and fries, although the separate self-service food set up is a little confusing.  Also, the back lounge area is cute, but the couches are SO uncomfortable.  After testing out all of the seating, we ended up in one of the booths, which is just a flat wooden plank, but was an improvement over those couches.  All in all, we had a pleasant time, but it's not high on my list of places to return.  Maybe we'll try trivia!", "author": "Deepa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-08", "description": "I loved the bar and restaurant that used to be in this space, and it's great it's open again, but the food is bland and overpriced, and the service is horrible. It took over half an hour to get two drinks. Which were horrible. Who can make vodka and soda horrible? This place can. And then when I checked my credit card statement later on, it turned out my tip was somehow doubled.", "author": "Osh P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "Great space, great happy hour. The Gold Rush was really good. But the food....the food needs work. We ordered a pork sandwich, a fried chicken sandwich and a burger. The pork was really dry, the chicken had very little chicken and way too much bread, and the burger was a dry over cooked frozen patty. I will gladly spend a lot of time at this bar if they up their food game. Please up your food game!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Wonderfully decorated bar with fun booth nooks!  The bartender was super helpful, and I am only taking off one star because it is hard to get to for me", "author": "Aly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "The atmosphere here is amazing! Very relaxing, and feels like you are in someone's home. Get there early to snag a seat by the fireplace in the winter. Also had a great list of beers on tap, delicious cocktails, and good happy hour specials. The food was delicious, I highly recommend the Disco Fries and the chicken sandwich!", "author": "John P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "This is a great neighborhood bar. The bartender gave good recommendations on drinks and food options. She was really nice and makes great cocktails. I second the mentions of manhattans and the gold rush. Love the decor too!", "author": "Cici H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Amazing new spot! Went last night on a lark, and was incredibly surprised by the quality of service/cocktail, especially on a Monday night! Drinks are super tasty/pretty well priced for the neighborhood. Additionally, bar tender could not have been lovelier -- took the time to explain part of the menu, made solid recommendations and even checked to see if the drink was well received. I'll definitely be back! Just try and stop me!", "author": "Bari J."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Fawkner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "191 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l6bgf_F6PIOKHTlqNDiWzw/ls.jpg", "@type": "Restaurant", "telephone": "+17185223172"}