{"aggregateRating": {"reviewCount": 97, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "I really like the bar and what they've done with it, darts are a great addition and this could have been a 5 star. But the bar tender working on Sunday completely sucked. He was rude and didn't make us feel welcome (in an empty bar and should have been glad of our business), was just generally up his own ass (excuse my French). Won't be back", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "I'm generally a pretty positive Yelp reviewer and went in here expecting to love it. \n\nMy girlfriend and I went in to get tacos and ordered the special they have on Tuesdays, two tacos and a margarita. My girlfriend is a vegetarian so she ordered the vegetarian tacos. They then informed us they didn't have the vegetarian tacos, so we ordered the veggie black bean burger instead.\n\nThey came over to our table ten minutes later to tell us they didn't have the veggie black bean veggie burger and asked us if we wanted a regular burger...  There was one other vegetarian thing on the menu and we were kind of stuck there since I had already ordered and we had our drinks, so we ordered the baked vegan empanadas. They came over a few minutes later to tell us they were also out of guacamole for our chips and guac and hadn't realized. \n\nI understand that dietary restrictions can be hard for restaurants, but we picked this place specifically because of the vegetarian options and I don't feel like that's a challenging dietary restriction to deal with. I just wish they had been more organized and had informed us from the beginning of what they didn't have before we had already ordered, because we could have left and come back another day. \n\nThe pico de gallo that we switched to from the Guacamole was okay, but the empanadas were soggy and greasy. I am increasing to three stars because the chicken tacos were actually very good, the employees were nice to us, and the bartender gave both of us drinks when we were cashing out because of everything going wrong.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "Cute bar with some fun spaces. There were couches, secluded wooden booths that provided privacy and romance, and a medium size space in the back worth a roaring fire place and funky seating. The roaring fire was a bit much - it was way too hot there. Large selection of beers and drinks, a few wines means there is something for everyone. We tried the wings and they were spot on. Very saucy so things got dirty but it was all good. Service was mediocre - the bartenders were busy chatting while we waited to place orders. Once we placed the orders, drinks came quickly. Fun space for a group outing.", "author": "Agta B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Been here twice now on Saturday nights and each one was a different experience. The first time around, barely anyone was inside with plenty of room to talk and get some food. The second time, the place was packed and took a while to get drinks as the night progressed.\n\nDrink selection here is solid. A few different crafts on draft running around $6-9. Food here is your regular bar fare. The nachos ($11) are gigantic with layers of cheese, sour cream, beans and the like. Frites ($5) come in a large cone, seasoned well and easy to share.\n\nService here is okay depending on the crowd. Definitely needed more bartenders to man the ship on crowded nights, but I don't think they even know when it gets busy. Great spot for groups, just wish the back portion wasn't always reserved for parties.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "I've been here twice now, both times on a Saturday. The first time, hardly anyone was in there so it was a great place to just chill with friends. The second time, it started out okay and then got horribly crowded due to another birthday party and a wedding after party. The bar was understaffed that night so getting drinks took a really long time and we ended up leaving to find a quieter place. However, I won't judge it based on that one time. Before all those people came in, it was great! They have decent food options - the nachos are really good as are the fries! The drinks are average priced but are made very well. I'll probably come back again when I'm in the area - I haven't had the chance to sit by the fireplace in the back room so I'm looking forward to that this winter! :)", "author": "Pooja C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "If you're the type of person who likes rustic, warmly lit, taxidermy-forward bars with a mismatched assortment of chairs--many of which look like could have once held your pipe-smoking grandfather--well, you're already in Brooklyn so you'll have plenty of options. I would not describe Fawkner as a standout so much as a (potential) standby. On the Friday night my drinking partners and I visited, it was neither too crowded nor too empty, too expensive or (is there such a thing?) too cheap, too loud or too silent. There was a private party in the back, so I was not able to investigate the patio. \n\nI ordered mulled wine, which was a nice wintry touch for the bar, but it did not taste very alcoholic nor did it stay too warm. There are plenty of beers on tap here, and also plenty of specials, including one night when it is possible to get 8 tacos and a pitcher of Narrangassett for $30. My dining partner ordered a burger which took an extremely long time (upon ordering, you're given a buzzer which you then bring to a food window), but did eventually arrive. I noticed she finished it but I did not inquire about the taste.", "author": "Emma G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "Fawkner still has to work out a few kinks, but it's definitely a solid bar. It's from the same people who started the Bell House, Floyd and Union Hall. There's a backyard, but it's kind of too chilly for that right now. They don't have any activities like Floyd/UH does, but they do have taxidermied animals, so... I guess there's that. They also have a bouncer checking IDs outside, which is similar to the other spots, but it's very out of place on Smith street.\n\nAnyway, the decor is great. There's ample seating at the bar, tables with mismatched seats in the front, booths opposite the kitchen, and a bunch of couches in the back room lounge.\n\nGreat beer list too. They have food, but you have to order it separately. One of the kinks is that you can't share a tab between the kitchen and the bar. Hopefully they sort that out soon. You order food, grab your number, and then they bring it to you. Easy peasy.\n\nOf course, I had to go for the fried chicken sandwich that everyone's been raving about. Definitely one of the best fried chicken sandwiches I've had in NY. There was a little more bread than chicken, but that's mostly because the bread was huge. Lots of delicious sesame seeds. The chicken was thinly breaded and crispy. It was thigh meat, so much more juicy than breast meat. The chicken was layered with chow-chow (relish), corn pudding and fried onion strings. The corn really added a nice flavor layer to it, very southern tasting.\n\nThere was also a side of maple syrup. It was strangely viscous. The sandwich really didn't need it, but it was a good option.\n\nThe only other kink I need to mention is the bar service. There were two bartenders. One of them took my first drink order and then spent like 25 minutes counting money. This left the other bartender fending for herself, helping out people seated at the bar, people trying to close out their tabs, and people ordering drinks for their table.\n\nWill definitely come back. Seems like the new \"it\" spot in the neighborhood. And not a moment too soon, now that Char No. 4 has shuttered.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Walked in with girlfriend and it was as if two invisible people walked in. We stood around and then walked around hoping to be noticed to no avail. I started to get the feeling that service would not be what this bar offers. One can have the loveliest home but if its not welcoming then whats the point?\nThe decor was nice(FAKE FIREPLACE ALERT) and while we left before ordering anything we were really glad to leave and i have zero regrets because sometimes you have to make the smart choice and go somewhere that makes you feel welcome.\nWe ended up at the Ugly duckling and i must say nothing ugly about the place. It was great service and only a block away!\nMUST ADD: I do not work or have any ties what so ever to the Ugly duckling, I just like the way they welcomed us.", "author": "Jose R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Fawkner was the absolute perfect spot to hold my boyfriend's surprise party, and their awesome staff made the whole night go smoothly! I'm SO glad I decided to go with them for my event!!\n\nI'd pretty much been canvassing the whole neighborhood for the best spot to throw a party for my boyfriend's 40th birthday, for which I'd invited his friends from Europe and LA to come surprise him for his big day. I wanted our spot to feel special, but not overly fancy or precious for my guy, who is not the schmancy, cocktail-swilling type...and the search led me to discover that renting out a bar in NYC can cost in the tens of thousands of dollars! Either that, or the space will require your crew to spend upwards of $3-4K on food and drink, something I couldn't guarantee with our group of about 40 people. I didn't want to end up being charged thousands of dollars if we didn't hit the minimum, but I also didn't want to do the party at just any old dive bar, so I was starting to get stressed.\n\nEnter Fawkner, our friendly neighborhood gastropub that allowed us to have private use of their spacious back room, on the condition that our group hit a very doable food/drink minimum spend ($1K plus gratuity and tax). The back area is wood-paneled and cozy, with a cute fireplace, plenty of couches for seating, and a little outdoor patio--it's comfortable without feeling dive-y. Linlee from CityFarm was very responsive to my email inquiries, offering me a bunch of different scenarios for my party and answering all of my (many!) questions. I decided to go with a taco bar through their catering company, and the food was delicious! All my guests commented on how good the tacos were. Chloe and the rest of the bartending and kitchen staff were super attentive to our group the whole night, quickly clearing plates and bringing out additional food, helping me out with the cake I'd brought, and generally just being awesome! The bar staff even stayed open after last call and patiently waited for our group to be ready to go--the last stragglers were still gabbing away at that tipsy point where they're tough to mobilize--though they probably really wanted to go home. Since my bf and his European guests only see each other every so often, I appreciated that the staff let them linger!\n\nMy boyfriend was thrilled with his surprise party, and kept saying that he wouldn't have done anything different the whole night if he had planned it himself! \n\nI'd highly recommend Fawkner for future parties or events!! The space is great and their staff is wonderful!", "author": "Marisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Fawkner is terrific for parties! I highly recommend Linlee and Fawkner for any future events.\n\nEvent: I hosted a company happy hour at Fawkner last night, for around 100 team members. In addition to happy hour specials, we had Lord Easy from Karaoke Tremendous hosting the event. It took some convincing to hire him but I'm so glad I did! He made my team feel less nervous about performing and definitely supported them in between songs. Happy Hour was a huge success!\n\nCommunication- This is the second time I've worked with Linlee. She is personable, easy to work with, and will accommodate any budget restrictions. I'm so glad I listened to her about hiring Lord Easy! Day-of the event, it was the hottest day of the year and there were a few hiccups with the A/C. She proactively took care of that problem by getting a room full of powerful fans. No one even noticed the heat! She can solve any problem! Her staff was super efficient and friendly. \n\nSpace- We had a buffet station, several reserved booths, \"living room\" with fireplace, and back patio.\n\nFood- We had a taco station set-up, great for all picky eaters and taco lovers.\n\nThank you from UncommonGoods! -Anita", "author": "Anita N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "I've been here a couple times for drinks and Fawkner is an enjoyable bar. Drinks options are varied, with great seasonal additions. I'm always a fan of mulled wine and hot toddies. Bartenders are friendly and efficient. Fawkner is spacious and cozy. There are many seating options - bar, couches, wooden booths, and tables - giving you size and privacy options. There's a fireplace in the back, which was blazing a little too warm for an autumn night.  I'll definitely be back to try out the food.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "I waited until winter was over to write this review, because I didn't want people to crowd my new favorite bar!\n\nSeriously, though, I love Fawkner. The food is amazing, the beer list is always fresh and it's just so damn wonderful inside! For awhile my friends and I didn't want to go anywhere else, because this is seriously the best winter hangout.\n\nThe sandwiches are awesome, in addition to the poutine/fries, I can pretty much recommend whatever's on the menu. Plus you can easily share one sandwich, they're huge!\n\nStaff is super friendly, a bartender even ran outside after I left because I forgot my scarf! Amazing. And the beers are reasonable for the area, it's certainly cheaper than some neighboring bars.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "My fiancé and I came in on a random Thursday night. The lady bartender - Dina? or Tina? - was so lovely. Smart, funny, made great drinks. And she showed us pictures of her kitten. Super fun to hang out with her.", "author": "Meg B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "The music was incredible! So good that I actually downloaded Shazam so I could save the tunes for later listening. It was warm and cozy. The drinks were exceptional and original.  The tables are spaced out nicely so that you're not elbow to elbow with anyone. We sat in the far back because we wanted to have a romantic evening. It was perfect!", "author": "Kris L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "Here's the takeaway: DO NOT BOOK A PARTY HERE\n\nSo, as a bar, I like Fawkner.  I'd seen it and not gone in for months, and then wandered in one sunday afternoon for some lazy day drinkin.  I found it to be laid back and mildly charming if a little cliche'd.  Drinks were ok, nothing special, and food is a low medium, but there seemed to be real promise in the spaces toward the back.  Fireplace, dark cozy booths, couches, ambience.\n\nSo I decided to book my girlfriend's birthday here.  They have a set-up that seems not super expensive where they reserve you a section in the back room (they say they will, I should say), and start your group a tab that cuts off at a specified dollar amount and/or time.  That guaranteed tab amount is also what gets you the reservation.\n\nProblems arose.\n1) Food doesn't count towards the amount.  Fine, I guess.\n2) Seating.  For my party of 15 they blocked off 4 seats only.  We had to aggressively expand and mark our own turf.  Less than ideal I guess but not the worst thing as it wasn't super crowded at first.\n3) Drink orders.  I discovered at one point toward the end that our waitress was taking drink orders from anyone in the by-then crowded and very open back room who claimed to be \"with the party\" and adding them to my tab.\n4) Tab limit.  Despite my request (and written in contract) to cut off at that tab limit, we blew past it by a solid hundo.\n5) Upsold drinks.  Every mixed drink except one was upgraded to a premium call liquor.\n\nAfter taking a while to check the receipt and poll my friends, I discovered that not only were most of my guests actually paying for their own drinks, none of them were calling their drinks.  So I was funding the higher end tastes of complete strangers.  If it had been for our actual friends, you know what, I would have been fine with all of it.\n\nDid I raise the issue with management? Yes.  Did they admit a problem? Yes. Did they do anything to fix it? No.\n\nYou don't need the stress.  If you want to have a gathering in the back room, do NOT go through their booking channels.  Just pack in with your crew and enjoy.", "author": "Average J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Whoa just went on a Saturday afternoon and for the last time. They were doing a Kentucky derby thing 'kind of'. Every time this bar tries to hold events which is always because it's not popular enough without the events it screws them up! \n\nThe tv projection was small, the service was slow, the manager is just about the rudest woman I've ever met, the volume was off, and then 1 minute after the end of the race while everyone is still juleping around they kick everyone out for a private party. Rudely also. But you guys were the ones that advertised the Kentucky derby event fawkner!\n\nIt's bad regularly, was bad that day and nobody seems even a little excited to work or be there. Too bad cause smith street needs that space to do well with a big bar :(", "author": "Sydney L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Friendly bartenders and lots of cozy little nooks. Their poutine is fantastic. I accidentally left a really important notebook there last night, and the folx there were thoughtful enough to have found it and kept it safe for me -- which I really appreciate. Ty!", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Fawkner is one of my favorite bars, hands down. The beer selection is great. Their frozen margaritas are really good. The atmosphere is so chill. Their burgers and nachos are awesome. I highly recommend this place for drinks, food, or just to chill. I got to chat with Linlee, the manager, and she was super cool. Definitely go here!", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Phenomenal! Loved the atmosphere and especially the staff behind the bar. I stopped in and was delightfully greeted and taken care of by Daniel at the bar. Definitely worth stopping in for a cocktail and a snack, food is superb.", "author": "Lindsey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "If you enjoy drinking in a Wes Anderson film, this is your place.  Great selection of beers to drink in front of a roaring fire on a large leather couch.  Food is simple, but good.  Don't open a tab before ordering food though.  They 're not connected, you have to go to a window to order and pay, so don't hand in your card to the bartender until you've figured out your food situation.  Otherwise, enjoy!", "author": "Sulma V."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Fawkner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "191 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l6bgf_F6PIOKHTlqNDiWzw/ls.jpg", "@type": "Restaurant", "telephone": "+17185223172"}