{"aggregateRating": {"reviewCount": 97, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "Yes! Finally, a sandwich place where I can get my money's worth. The $10-$16 sandwiches are enormous! And delicious! Love the order and pay at the window and seat yourself at a booth layout. The space is huge with a bar up front,  awesome cavernous booths, and a large couch area with fireplace in the back. I got the roasted mushroom sandwich and the hubby got fried the chicken sandwich. Both were delicious and my husband was especially pleased to finally find a local fried chicken meal that was satisfying and filling (vs. the tiny portions he's been getting at the other \"artisinal\" fried chicken places around). The Japanese spicy mayo that came with the fries enhanced the flavor of the meal. Can't wait to return to try more sandwiches and frites.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Awesome interior. Good beer/cider in tap. Friendly staff. Open windows. Happy hour. What else do you need?", "author": "Kat G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "We had a birthday event in the private room in the back, and it was a huge success. The food was really great, especially the sliders, and the service was tip top. Planning the event was a breeze, and the party was a surprise so this required working with Linlee, who is wonderful and reliable and represents Fawkner very well. The atmosphere is exactly as advertised--cozy and hip. And the beer choices are excellent. All in all we had a great experience and highly recommend it.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I didn't eat at Fawkner, so this review doesn't have anything to do with their food. \n\nBUT-the drinks and the atmosphere were great! My boyfriend and I arrived at Fawkner at around 4:30 pm last Saturday and the bar was pretty full, as were all three booths. There was only one couple in the back room though. The front section has the bar and some tables that are great for groups. There is a deer in a glass case that looked like something from the Museum of Natural History, which I thought was kinda cool. The middle section has three big booths and a spot to order food. The back is darker and has leather couches, comfy chairs, bookcases, paintings, a fireplace, and a skylight. I really loved the atmosphere and thought it was romantic and perfect for a cozy date! There is also a small outside area with string lights, two chairs, and a bench. \n\nMy boyfriend had two glasses of wine and I got a glass of wine and a whiskey ginger. Happy hour was $2 off of wine, beer, and well drinks. The bartender was super nice and friendly. I collect business cards from places and he very nice when I asked him for one! \n\nFawkner was great because it wasn't too loud and had a nice mix of seating. The front and back have totally different atmospheres, so you can go there with friends, family, or a date. I also liked that it was laid back and comfy. Great addition to the neighborhood!", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Oh, this place. I don't know anything about it but Ioved it so much. The chairs are amazing, the cocktails are crafty, and the place is HOMEY. There are recessed booths that are walled with a curtained opening, there are 2-4 person high bar tables, and then there are loungers. My sister and I sat in retro rockers in front of bookshelves. There are also overstuffed chairs, couches, hardback chairs... All in all a lovely place for a date, catching up with a friend or meeting a group.", "author": "Meg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Great space where you can be comfortable (ex: huge booths); cool bartenders who take care of you, especially Arnie; a good place to hold events, like the trivia nights", "author": "Shankar V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Went there a couple of weeks ago on a Sunday for brunch. Bartender was delightful, made sure to check on us throughout. Food was excellent, as were the cocktails. Would go back and recommend to friends. Great job!", "author": "Brian R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Love this place and the concept. It's usually crowded there so when my friends and I met there On a Friday night after work we had no where to sit and either a runner or the host truly went out of his way to find us a spot and chairs. Bartenders are a little pretentious for the area but the food is okay and the other staff are wonderful! \nBurgers are lame (I think they're frozen) but Try the poutine!!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Delicious food, including homemade tortilla chips. Great tap list and pretty stellar cocktails. The only reason for less than 5 stars is that the service is slightly slow. It also can get really crowded in the evenings, so come early.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Let's start this review being a local tourist - feeling like a local, totally at home at this place. Besides the prices being tremendously fair, being done at 35$ having dinner and drinks for two, the atmosphere is friendly and welcoming. The fireplace at the back, small dug-outs in the middle and large sofas at the entrance make it perfect for any companionship you're with, date night, family, parents, friends, or by yourself, you'll feel comfy and at home. Don't miss out on the weekly specials, comedy on Monday, trivia on Tuesday and darts on Sunday. If you're in or around Brooklyn, or wherever in the world, just go here", "author": "Martijn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "This place rocks. A chill place to go after work on a weeknight. Lots of quiet spots to sit and talk and a real authentic atmosphere. The staff is especially nice. William the Barkeep was right there with a fine beer recommendation. He let me know they have sour beer on tap! Will visit again for sure.", "author": "Sam Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Service is friendly and warm. Ambience is comfortable. Great place to catch up with a small group of friends and a large group of friends. I've had their brunch sandwiches, late night sandwiches and their fantastic pouring... Consistently good! Good selection of Scotch. \nI didn't think that I'd like this place because I loved Ceol so much... But Fawkner you have won me over.", "author": "Dee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Cool atmosphere and a good tap list, with multiple IPA choice on draft and some interesting bottles as well.\n\nMy group of five were all underwhelmed by our food, however. Not sure why the fried chicken is getting accolades, as it was mostly bread with a very thin chicken patty and sweet cabbage slaw. Poutine was totally average, and couldn't even begin to compete with the offering from nearby Mile End.\n\nFully agree with another Yelper: it's time to up your food game!", "author": "Rich J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "I'll start with the positive- the space is big, open and aesthetically appealing but sadly, that's about it. The concept of \"self-serve\" with no wait staff means you must wait in line for your food and then again at the understaffed bar for your drinks. However, no one explains or even smiles when you walk in so you look like a jerk while looking around to figure out whether you are supposed to wait to be seated or move forward on your own. The whole thing is poorly conceived.\n\nAnd the food--- We both had the ribeye sandwich on which there was a ton of coleslaw and almost no ribeye. The sandwich was slathered in an herb butter but served completely cold. Oh and they only have tiny bar napkins to use with your food. The manager was nice enough to comp our drinks when she saw the scene at the bar but otherwise I'd expect way more from the team behind The Bell House and Union Hall.", "author": "Dana A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Fawkner, I don't know what to do with you.\n\nYou have insane potential -- but your layout is holding you back.\n\nWent for an after-dinner drink with a friend and was having an OK time at the (nearly empty) bar when I spotted some people in the back area. Curious, I made my way there... and was surprised to see tons of people and a gorgeous lounge! I'm talking booths full of diners, a big leather couch, couples relaxing in front of the fireplace -- it was like I'd entered a whole new bar.\n\nAnd it's a shame because I imagine many people come to Fawkner and sit in the empty front area without ever discovering the real party. \n\nI'm not sure what the solution is, but Fawkner has too much going for it (awesome cocktails, nice bartenders, great music) to not figure SOMETHING out.\n\nGood luck, guys. I'm rooting for you.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "When Ceol closed I was saddened that the neighborhood had lost a pretty good bar, so I'm quite pleased that Fawkner has taken over the space. It's the cozy back room that really makes Fawkner stand out. It's like an old hunting lodge out of one of the 19th Century adventure tales, or maybe like the parlor of an old manor where a murder mystery once took place. It's cute, comfy and super cozy. The fireplace will definitely be a coveted spot as the temperature drops this winter. \n\nIt was not too busy on the Saturday night we went, though I foresee that changing. When we went back on the following Tuesday, it was actually busier than on Saturday night. \n\nThe drinks selection was pretty great and they had an interesting selection of beers on tap. The first time we went we just had a couple drinks, but the second time we got food. \n\nAt first we were a little hesitant on the food because it seemed like every sandwich had one questionable ingredient. Roast pork with Caesar dressing? Fried chicken with corn pudding? A hot dog with remoulade? A burger with white sauce? What is \"white sauce?\" Is that a bechamel? Is it the same white sauce from the halal cart? \n\nWe tried the ribeye, the burger and the hot dog. They were okay. For the price (around $10-$15 for a sandwich) I wish they would have come with fries or salad or something, otherwise they are a tad over priced. Overall the food was just okay. But I guess if you've been drinking and need something in your belly, it'll work well enough. I do like that you can order and pay one at a time, which makes the place great for groups - no having to figure out a complicated bill at the end of the night. \n\nWill definitely be going back, but probably just for drinks.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I got the special, the poutine, which was such a big portion for such a low-low price. I also got a couple of beers and whiskey. All drinks were great and the service was excellent. The decor is also really nice with a mix of tables and chairs up at the front, cozy booths in the middle, and plush couches and fireplace at the back. They also have a small back patio. I came here specifically for the Tuesday trivia, but see why I'd come back again, especially for poutine.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "My friends and I went to Fawkner last night around 12:30 just to grab a beer and play darts for an hour or so. When we got there it was dead, but no judgment, it is the holiday season and it was a Wednesday. We were not greeted or even acknowledged and then was ignored by the shaved head female bartender as she conversed with the only other patron at the bar. We waited calmly, got our beers and was then asked if we wanted to order two rounds because it was last call. We assumed closing was at 2:00, but was told it would be around 1:00, which is even more of blatant lie because the hours advertised are 4:00pm to 3:00am.You could tell the entire staff was waiting for us to leave cleaning up the bar, putting chairs on top of tables and waiting for the papa johns pizza they had delivered to the bar. \nOverall, it sucks that this place sucks so much because the interior is cool and its a local spot. Perhaps if the entire staff was replaced, the female with the shaved head being first on the chopping block, this place would be cool and pleasant. Honestly just don't go, there's a million other bars on smith street that will make you feel unbothered about spending your money.", "author": "Marie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-18", "description": "Nice bar.  Staff is attentive.  Don't expect a buy-back;  They are all about business and collecting your money.  Prices are a little high but it's a proud place.\n\nI've been here 5 times in the past 2 months and haven't received a single complimentary drink.  (Buyback) They just don't seem to think tipping and being a regular is important.", "author": "Jon M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "I wanted this place to succeed but it just keeps getting worse.\n\nThe first time Ali went the good was average, drinks nothing special and service very rude.\n\nThe last time I went the food got even worse. Ick. Who makes nachos with fake cheese and serves soggy cold French fries? \n\nNow I'm just hoping someone comes in and takes over because the location and space is great.", "author": "Bridget S."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Fawkner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "191 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l6bgf_F6PIOKHTlqNDiWzw/ls.jpg", "@type": "Restaurant", "telephone": "+17185223172"}