{"aggregateRating": {"reviewCount": 97, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Hella cozy, dark and warm. The back room has a great fireplace/reading room sitch going on, which I really like. You can get a massive amount of poutine for a pretty normal price and all the food I've tried here has been good - sliders, wings, etc., pretty standard pub grub but well-made.", "author": "Liz B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "I really want to give this 4 or 5 stars for the atmosphere alone, but they still have a few kinks to knock out.  \n\nThe food here is great! I ordered a burger and poutine...YUM!!! My burger came with a whole pickle, I love details like that.  What I didn't like about Fawkner was that apparently our beer was flat because something was wrong with the kegs. Why would you not tell us this and/or discount our beers.  The bartender didn't seem to know exactly what he was doing.  And while the staff was nice and attentive, their nonchalance seemed out of place for an incredibly gorgeous atmosphere.  They have booths that are inset in the walls and in the back a huge fireplace and gorgeous paintings.  It was a fun time, but they are fairly new, so I guess it will take time for things to fall into place.", "author": "Morgan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "Bar\nBy the\nBell House peeps.\nGood booths and beers,\nSmall patio, relaxed, and sandwiches.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "We had our engagement party here in April and it was a totally great experience. The food was delicious and the staff was very accommodating. The sliders were much bigger than tiny appetizers and they were so good! The back room is so cozy and it was great to have access to the back patio too!", "author": "Stephanie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Visited the fawkner and wanted to share some observations. I'd rate the bar service a 3 and entertainment a 5 (hence my 4 star review). Bartender seemed like he was more there for entertainment than service. People had to stand on their bar stools to get service (I'm not kidding) - so hilarious and ridiculous all at once. Visit the fawkner for good food (that may take you 40 minutes to order). Also don't be surprised if some parts of your order don't come through. Also visit if you want to work for your drink by fighting for the bartenders attention. When you do get their attention be prepared (and excited) for their real opinion about your drink order and what it says about you! Bond with other patrons over your experience and first world struggle of having to wait. Wonder aloud whether you are being pranked or if the service is just a nice dose of real life. Overall- would go back!", "author": "Sia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Bingo night on Wednesdays is the best! $1 gets you four bingo cards for the entire night, and each round the winner gets some random prize plus a food or drink ticket. So good! The host is fantastic, and it's the best deal in town. Highly recommend!", "author": "Katie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "I think I'm done coming here. Tired of getting charged $12 for uninspired cocktails made with well liquor (especially bad when the menu says Cointreau and they use triple sec). The space is confusing, as are the food and drink menus. There is no one thing this bar is particularly good at. With so many other options in the area, don't bother coming here.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "We had our welcome drinks for our wedding weekend in the back room at Fawkner's. It was perfect! Linlee and team were amazing- easy to communicate with, flexible, and friendly. The back room is private and has an outside patio area. We had small bits and everyone enjoyed the food. I appreciated Linlee coming up to me throughout the night to let me know where the tab was, and allowing me to close the tab or keep it open and check back with me when it was closer to that number. I would always have events here and couldn't recommend it more.", "author": "Ansley L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "This is more scrounge like pigeon than fly like an falcon - besides the Gold Rush cocktail there is nothing classy about this place.  The staff is undertrained and unsupervised to a point that is almost bizarre. \n\nWhile cleaning up the bar the less than groomed (in an icky way) bartender swooped in and took our cash while cleaning up the bar and then returned minutes later to ask us if we'd been served.  It would not have been so strange if she hadn't missed the half full beverage in my hand.", "author": "Cameron F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "Went because a friend rented out the back room for her birthday. Was super chill. Bartender was friendly and fast considering how many of us were bombarding him. Beer list is okay better than was listed online, so I was pleasantly surprised. Interior was nice and weird. Like the study of the curator of the museum of natural history.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Ok bar. Nothing special.  Good beer.  Disinterested service.  Interesting chairs.  Covfefe.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "really adorable cocktail bar in Brooklyn. the cocktails are on point and the vibe is super chill. great place to come after work and grab a drink or even a night cap.", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Unbelievable. Just stopped by this place for a drink, horrible service but we just wanted beers in the area so we stuck around. They lost my credit card within 20 minutes, failed to inform me until I went to close out (just to be clear, they did not find out that my credit card was stolen when I went to close out - they clearly knew it was stolen beforehand and didn't feel the need to come up to me to say anything). Totally unapologetic to the point that I wondered if the bartenders stole my card.", "author": "JC J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "This place is great. The bartenders are really strong. And they have Tang on tap! Great place to come and feel at home. They have a goat in a cage up on the wall. Blessings.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "Really cool space. Great drinks. Quite possibly the slowest food and service in Brooklyn.", "author": "Jeremiah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-09", "description": "I want to love this place. The bartenders are AWESOME. But the beer list is very hard to find something great in and the food service is confusing.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Solid local watering hole with great food and beers on tap. Open bar area, with a few hidden booths, and a large den/library like back area. Solid \"bar\" burger, and the $9 Poutine is more then enough to feed a family of 4.", "author": "James H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Love this place--*almost* as much I loved Ceol.  But honestly, it's probably just nostalgia--Fawkners has improved on the space in almost every way.  The food is great, the bartenders are friendly, the back room is fire-placed and comfortable, and Thursday night trivia is lots of fun.", "author": "Graham G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "So my friend is moving away, we all live kind of spread out in Brooklyn and manhattan but we decided to meet here for drinks and darts Sunday around 4pm. There were 2 people working front of house, a male behind the bar and a female running around. The female was nice, helpful, working. The male, awful! I bartend in midtown, along with most people I was with, so I know sometimes you're just not in the mood, but this guy was SO rude to all of us. We had a big group there, not annoying, not taking up bar space or being obnoxious, but he just insanely unwelcoming. We noticed he was pissed if and tried to be extra nice and inviting to him, but the only people he event spoke more than two words to was the girl at the end of his bar at which we all assumed was his girlfriend...I mean why else would you ignore 10 people!? All in all there were about 16 people in this entire bar, we were 10 if them, he was insanely rude and unwelcoming. We decided to leave early because we were all so uncomfortable. I even wrote him a note at the end on my receipt where we still left an appropriate amount  saying \"I wish you didn't hate us\" because we all felt as though he hated us just for walking in. All in all, if you want a cool bar atmosphere and good drink but a SUPER rude and unwelcoming bartender go here! If you want a nice atmosphere with a bartender who doesn't hate you, don't go here.", "author": "Joanne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "So my boyfriend and I heard about this cozy fun bar through some friends, and let me tell you it was that and more. We arrived in the late afternoon. We were greeted immediately by a blonde haired woman, her name was Stephania she was nice and carefree. We decided to sit at the bar. We were greeted by a young man named Connor. He introduced himself and went on to tell us about the happy hour specials and offered us a menu.  We decided on the \" Bar burger \" and the fried chicken sandwich to share. The burger was cooked to perfection, it arrived stacked with fresh LTOs. The fried chicken sandwich was out of this world. Every bite was explosive with flavor and the chicken was crunchy on the outside and tender on the inside. Yummy. We also ordered some fresh cut fries with a side of spicy mayo. Once we were finished with our meals, we decided to take a look around being it was our first time here. They have a great back room almost like a living room but with more couches. Also a sweet private patio in the back of establishment. We had a great experience over all. If you happen to be near the Bergen stop off the G go give this bar a try. We are looking forward to coming back and experiencing all Fawkner has to offer.", "author": "Raven M."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Fawkner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "191 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l6bgf_F6PIOKHTlqNDiWzw/ls.jpg", "@type": "Restaurant", "telephone": "+17185223172"}