{"aggregateRating": {"reviewCount": 97, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "This is a quaint, cute, trendy bar with an array of drinks.  I've been several times and enjoyed my visits.\n\nThe back of the bar has lots of seating very Alice in Wonderlandesque. I love the feel of the bar and I believe has an outside seating area too.  A great spot for friends and meetups after work.  There is ample seating and I am pretty sure there is a menu to order food too.\n\nEither way, stop by because it's one of the fun and quirky Brooklyn bars that has a lot to offer.", "author": "Morgan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-18", "description": "Spent some time with friends at Fawkner on Saturday night. A cozy bar with all the elements I enjoy, but some issues with service prevented a perfect evening.\n\nQuality: The food we ordered was delicious, it just took forever. I loved the Pulled Pork Sandwich, with tender meat, great sauce, a wonderful bun, and delicious slaw. The fries with spicy mayo were also an awesome treat. The drink selection was great as well. I stuck with local beers, but they also had fun cold weather drinks like a hot toddy and mulled wine. No wrong choices on the menu.\nQuantity: The food came with large portions and drink pours were more than fair.\nValue: $12 for a Pulled Pork Sandwich. $7 to $9 for Draft Beers.\nAmbiance: Fawkner is located in Gowanus, Brooklyn. It is a very cool space that embraces an upscale and classy style. The signature piece of decor is a ram that stands illuminated over a dart board. The back area has a fireplace and cozy couches. It is a bar built for comfort and they absolutely succeeded. \nCrowd: Even with a party going on in the back space, still plenty of room for guests.\nService: The food was extremely backed up, which was very frustrating. The only issue with our visit.\nParking: We were able to find nearby parking relatively easily.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-04", "description": "Solid location, not so great food. \n\nThe decor here is hipster library from the early 1900s and the food...well, I was expecting better. Decent fries, but everything else was not so great. Probably won't go back.", "author": "Tom T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "I was happy to discover this really wonderful bar today! Fawkner has an amazing chill vibe with many comfy options for seating, including a huge back area. There's also some random taxidermy display which adds to the unique atmosphere. \nThe draft beer menu is huge and includes cider. They also have a wide variety of wine, cocktails and a full bar.  Additionally they have cans of beer and cider. \n\nThe bartenders were friendly and attentive. We ordered some deviled eggs with our first round and they were delicious. Aside from them, the food menu had a ton of options including nachos and tacos. \n\nWe stumbled in on a night that was hosting NYC Trivia League-had a lot of fun playing and won a couple of free drinks. \n\nBased on the service, vibe, food \u0026 drinks I would absolutely come back and hang out here again. Loved it!", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "So i'm walking down Smith St in Brooklyn, and for the 87th time, I walk by Fawkner.  From the outside it seems chill, and I see there is a food thing written on the board outside.  I'm hungry, let me go inside.  \n\nWalk in, good music is playing, not crowded, post up at the bar.  Order a drink (the beer list is mediocre with some local offerings, but nothing top notch; but that's what BGH is for).  Anyway, I digress.  Food, food, food, ah yes.  Nachos!  And wings?  Perfect.  Place an order, couple minutes later, my buzzer goes off, go grab my food, damn, the nachos look good.  Take a biet of the nachos, alright, good solid chip, okay cheese and toppings, but, the cheese sauce, lets just go with the, wtf happened here?  It tasted like you took soft cheese and mixed it with refried beans, and let it sit for three days in a restaurant pan, heated it up, and put it on nachos.  This was an epic fail thus resulting in just okay nachos (the chips, peppers, onions, sour cream etc were alright, but that weird green looking cheese, no thanks.  Wouldn't order them again.\n\nOn to the wings.  Classic buffalo with bleu cheese.  It's hard to find good wings, not the cheap 10cent ones that are miserable, cooked well, etc etc.  But, these wings were cooked well, not over-sauced, and overall just delicious.  And the bleu cheese was good and had chunks in it.  \n\nI'd come back for the wings, and if it wasn't busy, to hang out with a few friends.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Great place to meet friends, grab some drinks. In the nice weather love the outdoor seating in the back and in the winter the indoor cozy seating is lovely.", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I've been here a couple times for just a couple hours each visit. \nThe configuration of the back room changed since the last time I was here.\nBut let's backtrack for sec. Fawkner has been around for a few years and seems to be a neighborhood favorite. \n\nUpon entrance, there's the bar to the right  and a few sofas in the front. As one proceeds to the back, there are three booth like spaces to the left which looked quite nice. Convenient for dining but also private. \n\nI like the back room. It has various seating options. Last time I was here, a cute sofa was facing the fireplace--- of which is a charming and a welcoming feature  to the room especially during the winter. \nThe sofa has been replaced by a huge table with 8 chairs. Unsure of its purpose. The rest of the room has various, random chairs, sofas and smaller tables chairs available for different groups/parties.\nThere's also an outdoor patio for warmer months. Lots of seating options. \n\nThe ambiance is really cozy whether you're with friends or on a date. Fawkner can accommodate either and more.\n\nKnow this:\nNo waiter service. You must place any food/beverage order yourself at the bar.\nThey have a good selection of food such as sandwiches, fries and poutine (fries with cheese and brown gravy and no, never tried it). A good list of assorted red and white wine (even rose'), cocktails, beer and hot drinks such as hot toddy and mulled wine. The latter was not available when I went so it must be served only during the holiday (fyi, I settled for a delicious Reisling and shared some fries. The fries were okay--a bit oily--but the spicy mayo dip complemented them well.)\nI think HH is $1.00 off drinks before 7 PM. Prices are standard--figure $9.00.\n\nFawkner stands in the middle: it's not a dive bar, but it's also not upscale and pretentious. It has a chill vibe that's casual allowing you to feel like you're relaxing at someone's living room. Check their website for activities such as trivia night.\nOh, btw--the music is fantastic!", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "This is a fun and relaxing bar scene with a fire in the back room and plenty of seating.  There are two dart boards in the front area and lots of seating.  We had the wings and fries and too many drinks to remember the number.  The food is good and the drinks are stronger in the early afternoon.  \n\nThey play great music; when we went they had on 90's and early 2000's R\u0026B.  The mulled wine is on point!  If you want to hangout with friends this is a great place.  I would also recommend this as a great date option for drinks!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "TLDR: delicious mulled wine; tasty bar food; comfy couches; cozy, dark wood interior\n\nCame here around 5:30pm on a Saturday. Between the taxidermy, dark wood tables, antique bookcases, fireplace, and large mismatched couches, this place's interior could best be described as a cross between The Jane and the board game Clue.\n\nWhile the bar was definitely buzzing, there was still a good amount of seating available. We headed to the bar to order mulled wine and fries, which came with Japanese style spicy mayo, and found spots on the couch near the front.\n\nThis place uses a buzzer system to alert you when your food is ready, at which point you head to the kitchen window near the back to pick it up. Our fries took 5 to 10 minutes to be prepared and were hot, savory, and crispy. We also enjoyed the mulled wine, which was fruity, sweet, and delicious. Later on, we also got an order of nachos, which were typical but tasty.\n\nWhen we decided to head out around 7pm, the place was noticeably more full, with many people crowded up against the bar. Great place to sip on mulled wine on a cold day with friends, but would recommend coming early if you want to find seats.", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "Well I have bad feelings about this place because my bracelet fell off and no one turned it in, while waiting FOREVER for three little tacos. \n\nThe food is, honestly, outstanding. The sullen bartender did not tell me that there was ONE MAN in the kitchen on St Patrick's Day. WTAF? \n\nI ended up here because lost in Brooklyn and finally after nightmares with the 4/5/6, got off at whatever this stop is. I cannot bear Faulkner so thought it was a funny name. \n\nBartender was not nice. You go pick up your food at the kitchen when in the bar, which is an odd system, but would be okay if not for the wait time because someone didn't come in on a Saturday night. And again, not just any Saturday night. St. Patrick's Day! \n\nIt's cute inside. I mean part of the revival/gentrification of areas that old timers kvetch about. \n\nThe taxidermy is a bit odd but adds to the charm. \n\nIt's not close to me, nor do I have friends in the area. \n\nBut the food is very good and if I hadn't lost an irreplaceable (if not expensive) bracelet from Peru because I kept going back and forth to the kitchen, holding my giant overcoat with fur collar (worth a fortune but I got it used), I'd still have my bracelet from Salaverry, Peru. \n\nThe manager was, to be fair, cool in her email. Bartender just didn't put the food in and then it took a long time once he finally did. \n\nI will not be back unless lost again in this area of Brooklyn. But if I lived there I would 1) not bring in a fur coat and 2) make sure I knew the wait time for tacos.", "author": "Victoria O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I dig it like a Diglett. I was so tired of all the crowded bars in the neighborhood, so difficult to get a seat at the bar even on weekday nights. Not at Fawkner. Now some might see that as a bad sign but I like a quiet drink here and there. and wherever. most places honestly. \n\nAnyway, the prices are pretty standard but I like the low-key vibe and the boilermakers ($8): any well shot and a Tecate. \n\nNever tried the food but I'm not afraid to at this bar.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "We came here on a whim after we were stuck in the dead of winter at a bar with a radiator that wasn't working for my friend's birthday drinks. We needed to find anything that had heat, and Fawkner was our cozy cabin. The aesthetic itself does feel like you're at a lodge in the mountains - but with a hipster touch. It's good for groups as there are some spacious nooks and larger tables.\n\nWhen our bones had thawed a bit from some hot toddies and mulled wine, our stomachs came back to life growling for some nourishment. Someone in our party ordered the regular Frites and as one of two Canadians in the group, we had to order the Poutine. Both were amazing. The Frites comes with a \"japanese style spicy mayo\" but it was heaven to me because it tasted like hot velveeta mixed with srirarcha. It's worth coming back to Fawker just for the poutine, it all comes hot and crisp and the gravy is perfectly seasoned.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "When fawkners place hoods over the eyes of their falcons, over time, they grow accustomed to the artificial night produced. They do not suffer for this lack of sight; instead, they are made calm, for the stress of experiencing every detail of a perpetually-magnified reality takes up a significant portion of real estate in their marble-sized brains.\n\nHumans are not so different. We are most at peace when steeped in the darkness of meditation, and are more than willing to allow certain truths to be veiled from us, so long as this reduces the overwhelming terror of being. But this is not a defect, not something to be held against us; such limitations keep us oriented in space and time. We can only engage with so much information at once before we lose the boundaries of our selves.\n\nModernity asks us to exist in the company of millions simultaneously, an unceasing throb of virtual death and delight. To survive in such a climate, we need hoods of our own, both digital and analog, internal and external. We need our timelines curated and distilled; we need fine spirits to blur the world's edges.\n\nWe need these things because we know that the hunt never ends.", "author": "Max T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "My friend and I were visiting NYC and after wandering aimlessly along Smith Street, we randomly popped into Fawkner. So glad we did! Really cozy, relaxed, \"grown folks\" kind of place with great beers. We were the bartender's (Tina) first customers, so we got all of her kind attention. She recommended some really amazing, non-touristy things to do, including going to the top of Sunset Park to watch the sun go down behind the Statue of Liberty! Even when the bar picked up a bit, she kept checking in on us, all while keeping pace behind the bar all by herself. We loved her wittiness and felt so welcomed. If we lived in Brooklyn, this would definitely be our local. We plan to return.", "author": "Betty F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Wow. Fakwner - let's talk about this. Vaguely reminiscent of a mountain lodge, this bar is the perfect neighborhood haunt. Bring your games, stay forever. A perfect fireplace for consuming many rounds of mulled wine and delicious beers.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "I've always found Fawkner to be a suitable place to meet up when hanging on Smith street. Am I going to say it's my favorite bar in the area? No, but is certainly an upgrade to the former tenants Ceol (RIP, while I never really loved you, St. Patrick's was always a hoot). \n\nThe ambiance is definitely on the eclectic side, but if you're into taxidermy or nook seating Fawkner's is for you. If you're into old couches by a fireplace, or tiny outdoor spaces, then Fawkner is also for you. OK now that we have cleared what the place is like up, let's talk about the food and booze. The beer menu is extensive and not terribly expensive - once upon a time they had 5$ Blue Point tallboys for happy hour, though I'm not sure that's the case anymore (if it's not, it should be). Aside from beer (which I mainly associate with this place), they make a decent cocktail, or have a few wine selections if that's more your speed. The food is on point, and also not terribly expensive (except maybe the tacos, 3 tacos for 10$ is kinda steep, but that seems to be the trend in our fair city). They also have poutine, if that's your thing, though I can't say I've ever really loved it. \n\nAll in all, it's a solid place. Your best bet is to get there before it gets too crowded and snag a seat at the bar during happy hour; don't forget to order some fries (spicy mayo is a must).", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "Four Things I Like About Fawkner.\n\n1. Poutine. Poutine is always good, even when it's bad. Here, it's pretty good. Somewhat Fun Fact: Did you know that 'poutine' autocorrects to 'pouting'? This is wrong on several levels, one of which is that nobody is ever pouting in the face of poutine. At least no one I care to ever, ever, talk to. \n\n2. They have a fireplace, and enough antique* couches for me and every single one of my [four] friends to lounge back there for an entire weekend afternoon.\n\n3. The personable bartenders. Some of whom look like they are going to be jerks, but turn out to be sweethearts, which is always a pleasant surprise. More importantly, they execute classic cocktails fairly well, and are capable of going off menu if one of your party decides she wants a bourbon grapefruit thing. \n\n4. Their beer nuts (spicy, of course). Addictive, and I have yet to come in and not get a bag of 'em. \n\nFour Things I Don't Like About Fawkner.\n\n1. The signage on the storefront. I don't know why, but the owners of this fine establishment didn't consult me when they commissioned it, which was a mistake on their end. It actually kept me from coming in for a couple weeks, and that was a mistake on my end. Let's call it even. \n\n2. It turns out there are lots of people that like poutine, fireplaces, nice bartenders who make excellent cocktails, and delicious beer nuts. Unfortunately, this means that weekend nights tend to be loud as hell/all that beautiful seating can be taken, which is too much for this old man (sometimes). Luckily, I like to drink every night of the week.\n\n3. One time we saw a star (I use this term loosely) of a popular Netflix series at the bar, and we couldn't remember his name. This probably isn't Fawkner's fault.\n\n4. The next day, we saw that same star elsewhere in the neighborhood, and I'm about 26% sure that he recognized us from the bar and thinks we're stalking him. This almost certainly isn't Fawkner's fault.\n\nSince just about all the things I don't like about Fawkner are basically bullshit, I think I'm going to come back in here plenty. \n_____________\n\n*Although, a few of the couches really feel their age, and are no longer comfortable as a result. At least they look good?", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "I like this bar.  It took over the location of what used to be a good irish bar, if i'm remembering right, but it does the trick for the neighborhood.\n\nample seating for groups - a couple of leather couches and booths in the front, and a back room that opens up with a fireplace. A good place to come on a date or with groups, or alone, as i did the other night with my kindle.\n\nHH specials are good, and the bar food is not bad.  Every staff member I've interacted with has been lovely.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "I like Fawkner's a lot because it's kind of a genre of homegrown, authentic restaurants without pretensions.\n\nFawkner's is very similar to Jake's restaurant in Washington, DC, or, closer to home, Black Swan in BedStuy. Black Swan is a British-themed restaurant, and the idea behind these three restaurants is simple food done very well at reasonable prices. For an example as a case in point, their beer selection is good. I asked for a Guinness and they offered a honey stout, so the name of this game is to just be slightly different and better than a shoot-from-the-hip choice. \n\nBoerum Hill is booming like \"thunder,\" to quote Imagine Dragons. I think this bar is and would be a great bar-hopping tour because this street has a bunch of bars. Why don't the owners get together on Grubhub or Groupon and make a thing out of bar hopping? Yesterday was simultaneously France winning the World Cup and the French Holiday, Storming of the Bastille, so the streets were jam packed.\n\nBrooklyn as a matter of philosophy has that much more room than Manhattan, and this bar is, by comparison to Manhattan's bars, really big with a lot of space. The three areas are big, and the whole bar is capable of small parties of four to six. This is a huge compliment, because it's easy to feel cramped in New York City bars, especially Manhattan. \n\nI see on other reviews that Fawkner's bartenders are insular and uptight, and I agree! I think that's part of the experience of drinking beers in Brooklyn. The bartenders were fresh with me, but they had a great knowledge of beer and they were always fast and attentive. \n\nFive stars for the whole place.", "author": "Gordon E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Good bar spot for a group gathering of Smith Street (right off Bergen G/F trains). There is a large room in the back with a ton of couches and chairs, leaving the vibe of the room feeling very intimate.\nBar was stocked with a few house cocktails and a pretty good list of draft and bottled beers!\nOn a Friday at 11pm this spot was not overly crowded, which I would usually prefer when catching up with friends!", "author": "Sam K."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Fawkner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "191 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l6bgf_F6PIOKHTlqNDiWzw/ls.jpg", "@type": "Restaurant", "telephone": "+17185223172"}