{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "The dogs are slightly salty, but pretty damn good. Better than Nathan's on Flatbush for sure and the now closed papaya king. Chili cheese dogs all the way.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "So my coworker \u0026 I decided to have lunch here today and sadly this place did not do so well for us. I order a chicken sandwich with only mayo and she order a turkey burger. What she received is a turkey burger with a side of disappointment. I got a chicken sandwich with a bunch of extra stuff i didn't want like ketchup and tomatoes and lettuce. \n\nthey only accept cash.. and breakfast stops at 11am. Wish they accepted cards \u0026 wished they served breakfast for longer. The place is very tiny and the workers are a little too friendly. probably won't return.", "author": "Iris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "This place is outstanding with their Tasty Burger and Hot dogs! I used to work at Aeropostale across the street from this place. I rate Fulton hot dog kind a 4 starts because of the kind service and amazing fast food. I dislike the fact that it can get a bit crazy in there with the line. I dislike waits for fast food but that's always the case .", "author": "Jannu B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Quick, cheap, variety and convenient. Really as simple as that.\n\nStaying a Indigo Hotel and didn't feel like paying $10-15 for breakfast. Crossed and street and saw this place, doesn't look like much but it was busy.\n\nGot my breakfast for $5, it was a lot of food that my hotel would gladly charge $15 for. Will definitely be there for the next few days, the hot dog looks good so I might try that next", "author": "Jive O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Hit the spot. Ahhhh. \n\nGot one dog and one sausage, both loaded. Sausage was much better. $4.50 total. Sweet. Place was packed at 1pm on early Spring Friday so I knew it would be good.", "author": "Dr. Snarkenstein Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-10", "description": "This review is solely for the male server who think it's okay to grope customers. This use to be one of my favorite places but when you have perverts working there I can no longer patronize this establishment. I will spread the word as well to others n hopefully they check the cameras.", "author": "Yajaida M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "This is the hot dog/ sausage capital of Brooklyn.\n\nLow on cash, only a few minutes for lunch, starving? This is your place to handle all those needs. This place gives you a hot dog/ spicy sausage cheap, fast, and with toppings....i mean you'll be in and out before you can count your change.\n\nThe guys behind the counter understand that you're not there to socialize, so they do their best to get you fed and get you out...no complaints here.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "First time trying this place have to admit a lot of variety choices the hot dogs were excellent many toppings to choose from and I tried the spicy one which was crazy hot lol.", "author": "DrizzyBaby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "This is a good spot to get food if you're shopping in the area. They have seats in the back to eat your food. I got a hotdog and a coke and it was only several bucks. Don't let the name fool you. They sell more than just hotdogs. You can find all sort of fast food on the menu, but hotdogs are their specialty.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "This is a review for the delicious hot dogs! I think I've come here at least 5 times but I keep getting the same thing b.c I'm boring and they're yummy. They're the kind of hot dogs that have a nice snap to the casing when you bite into it. I appreciate that the shop is always looking clean, and that the service is consistently very friendly. There's a definite neighborhood-y vibe from all the regulars who drop by and I get the sense that the people who work here really enjoy helping and getting to know customers :)", "author": "Linda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Dope spot in the oldest-school sense. I can only imagine how many dawgs they go through every day as there seems to be a steady crowd of people getting their lunch on. After I had my 2 dogs (mustard and onions thanks) in my grip and was enjoying them I had a chance to scan the entire, building-width menu. There must be 100 unique items, all priced very modestly. I tried to find the most expensive thing which I think is some sort of seafood platter with fries (still CHEAP). Do you really want to walk into McDonalds t the Fulton Mall and battle endless people for a spot? Grab a dog at Fulton and roll on, Player", "author": "National H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Used to come here frequently in my teens back when I would shop in the Fulton/Downtown Brooklyn area. Much has changed in this area but thankfully Fulton Hot Dog King remains a cool fast food spot to hit up when you are on the go and in passing from one store to the next or if you're running errands in the area.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "This place actually seems to be more an all purpose fast food joint than a solid hot dog place. They had plenty of burgers, pizza, and deli type sandwiches on the menu. \n\nI was hoping to get breakfast, but that stopped at noon. I ended up getting a grilled cheese and a small pineapple juice drink. The sandwich was melty, cheesey, and buttery. The juice was sweet but not too sweet. Oh, and the total was 3.00. Seems like a good spot for a cheap snack or a quick meal. It sucks that they are cash only. It also sucks that the ordering process is kind of awkward and offputting. They had 10 guys there but for some reason I had to order at the one guy farthest away from me so they could chat up the pretty nurses on break....yeah ok. \n\nOverall this is a solid middle of the pack place for quick cheap eats.", "author": "Bill M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "This place is great as always..but there's a serious problem with numbskulls ordering their food and then..standing there shoveling it into their mouths right at the counter where the line is for other people waiting to order! Sipping from their drinks as if they've not a care in the world. \n\nYo, the counter is not your personal dinner table, let people through so they can get their food too, dummies!\n\nThis place needs to set up some tables or sawhorses or other eating surfaces outside the glass. Anything. Seriously. DO something, management!", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "Fulton Hot Dog King likely offers the most reasonable (and speedy) lunch in the area. It's only $1.50 for a tasty grilled hot dog, and the fruit juices won't set you back much either. This place has a devoted following, but they move people through the lines very efficiently.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Great old school unpretentious hot dogs! What more does a person need?! I read some of the reviews below complaining from \"too friendly\" workers- since when being friendly is a negative?! This joint is great for a quick dog on the go- simple, satisfying, and filling!", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "Lived in New York for 7 years, always passed this place and never tried it. Last week me and my mother in law went and it was as good as I had expected. The Philly cheesesteak is what I ordered and it was phenomenal. I love finding new restaurants and this one is great coming from a self-proclaimed foodie.", "author": "Shawnte M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Hot day? Hot dog!\n\nHad one sausage dog on a bun running an errand, on the way back went for two more. Six bucks total... clean and neat.\n\nThe sauerkraut is smooth (with a little pickled bite), but the dog and bun were extra smooth. Amazing texture for both.\n \nYou want a bonafide Brooklyn dog? Go here!", "author": "Kris F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "Hope you have good lungs and a loud voice. There is alot of activity in the area. Its an open area so you will most likely have to order over people. The menu is huge enough to be seen from across the street so dont start \"ummm\" or \"whatcha got\" ....if you cant read nobody can help you. Had to remind the guy of my drink order 3x..other than that its a new york thing...loud and fast.\nThe hot sausage with the works will fill you for the rest of the day", "author": "Anin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "Man, did I love this place when I was a kid. Back in the day they served their fruit drinks using a hand pump. You had to see it to believe it. There was decent competition for hot dog lovers downtown with Nedick's, Woolworth's, and even Chock Full 'O Nuts (a coffee restaurant.) But, Hot Dog King (not the name then) was the best. The menu has more items today. They still serve a pretty good hot dog!", "author": "Justin B."}], "servesCuisine": "Hot Dogs", "priceRange": "Under $10", "name": "Fulton Hot Dog King", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "472 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/MErUWDFqkPFWtuhXBOW3jA/ls.jpg", "@type": "Restaurant", "telephone": "+17188589799"}