{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "When you wake up one day and decide that you are going to accept the title of \"Foodie\", there are a lot of connotations that come with the title.  One of them is that you have an appreciation for the finer things (to some degree).  Haute cuisine is something that fires your brain, and rightfully so.  Mastery of the culinary arts is to be admired and can be a beautiful and luscious thing to behold.\n\nOther times, you just want a darn Hot Dog.\n\nFor those times your inner Foodie says \"I really just want to eat like I just partied all night.\" or \"I want a hot dog or sausage that has been grilled perfectly.\" there is Fulton Hot Dog King.   Calling this place a hot dog \"stand\" does not do it justice.  The long counter, awning and signage look like something out of another age (and it likely is, I have been told this place has been there at least since the 80's but it could be even older).  Service bounces between perfunctory to hilarious.   Sometimes they take your order and it's straight forward, other times they quote you different prices several times in a row to mess with you.  It's all in good fun and they are never mean or impolite.\n\nI love both their hot dogs and spicy sausage.  They are always grilled to have that wonderful \"snap\" when you bite into them.  The spicy sausage definitely has a bit of a kick and the hot dog has a wonderful savory flavor.  They offer the basics to put on it including sauerkraut and cooked onions.  There is no seating, so this is a strictly \"to go\" affair, but there is seating in the public spaces a short walk away near Albee Square.\n\nIf you're in the area, do yourself a favor and drop by this example of a bygone era and satisfy (a part of) your inner Foodie!", "author": "Benson Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "I'm not a hot dog fan much at least when I use to eat hot dogs this would've been the go to spot as opposed to Nathan's hotdogs.  They make Knishes, Kebabs, Franks, and Spicy beef sausages. The sausages are  legit, with ketchup and mustard or without.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "Right by my work and very convenient for a quick bite to eat and very affordable. My favorite is the spicy sausage (attached photo) for 2.50... I love spicy food and even for me it gives me a good challenge and has a very nice kick. I also get the cheeseburger with fries all the time for $5.00..the burger is surprisingly solid and gets the job done. Great place for a quick bite.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Best hot dogs in the area. Actually, they're my favorite. When I crave a dog, I come here. Simple, classic, delish dogs that surprise you. \n\nHave one and you'll think, okay, that's a good dog, nothing special. But then you'll have a dog somewhere else and you'll think, hmmm, kinda bland, mushy, even gelatinous. Then you will realize the meaty, smoky, grilled flavor with the snap/bite this dog has, and you'll wish you were having a dog from here! Then the addiction begins and you are hooked!\n\nI don't give it 5 stars because I've only had the dogs. I want to try the sausage but the dogs call me!\n\nTry one if you're in the area. You won't regret it!", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Great spot for a quick hot dog. Always crowded but very fast service. Hot Sausage off the grill with mustard and kraut and a knish with mustard. Perfect to cure those hunger pains for a quick bite on the go", "author": "Steven C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-06", "description": "I dont understand the rave about this place, i got a sausage with some toppings and it tasted exactly what i expected a greasy sausage on a bun to taste like.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "I've been going here for years. I always get the hot sausage ! It's so good and juicy ! I really love the customer service here ! It's very good place to get a quick bite.", "author": "Petty G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "My favorite spot for a hot dog! I always get the same thing, but the hot sausage with sauerkraut always hits the spot. The sausage is juicy with a bit of a crisp to the grilled outside. Ketchup and mustard. Mmm. \n\nAlso love the guys there--always welcoming with a smile. And the shop itself is cute. Plan to eat standing up, or walk across the street to the public tables.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "I really just wanted a quick bite on this Mon. I hadn't had anything to eat all day and was in the neighborhood. Craving kicks in-- how could I resist. I took off a star because it's cash only, and I really wasn't in the mood to go to the ATM, but I did. Why? Because the Franks are really good here. They're juicy, savory-- all the things a hot dog should be. I also had a side of fries. They weren't the best, which adds in to the 4 stars. But otherwise, the staff was super sweet. I got exactly what I wanted from her: a quick meal, good food, for a banging price. Come through guys, this is a typical NY-er fare you don't want to miss out on. \n\nAs always, happy eating and drinking. Marie Madeleine Gnagniko.", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Love it! This is what NY should be. Great hot dogs, NY-nice people, fun place. It's in the style of Gray's Papaya / Papaya King / etc. This might be my favorite hot dog in NYC. \n\nI went to Dekalb Market before and was pretty much sickened from the fakery that exists there. It's fine for consumption but it has absolutely no soul. Fulton Hot Dog King has soul.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Definitely one of my favorite spots for lunch.  Good food and without a doubt affordable.", "author": "J E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Had the sausage with kraut, onions, and ketchup. It was juicy, spicy, and the bun was delicious.  Best dog ever!!", "author": "Katrina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "This was the 1st NY hot dog experience for my kids and they loved it. Very str8 forward place, you can see them cooking the dogs and applying the toppings which my kids enjoyed. We had 4 hot dogs with everything (relish, onions, sauerkraut) and an order of onion rings. Everything was deliciois and we love that this place is halal and cooks no pork.", "author": "Lanash L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Brooklyn's answer to Gray's Papaya.  Just the right amount of chargrill and crunch. Be forewarned though - if you're there anywhere close to closing it's takeout-only and they're likely to have run out of chili! (Because they're so delish)", "author": "Caitlin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Quick, simple, good ole fashioned hot dogs. Nothing fancy and there's literally no seating but this place definitely gets the job done, and cheaply.", "author": "Sherine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "I used to frequent this spot when I was a teenager and was running the streets shopping with friends downtown Brooklyn. I stopped by today because my mom wanted a hot dog. We passed a few hot dog stands and Im like uhmm where are you going? She says she has a spot where she goes for her hot dogs and sausages and lo and behold it was here. The place looked the same with some extra menu items. I was shocked when the worker behind the counter knew my mom, I was like dang you come here that often. She said she stops by whenever she's in the area. \n\nThey have like four or five bar seats all the way in the back and dont get too comfy back there because if more than two people sit there you will be cramped, LOL. Now to the food, I ordered a sausage with a small pineapple juice and devoured both. I wasnt even that hungry but since my mom was treating I couldnt resist and boy was I surprised. That sausage was goood and hit the spot. All I had on it was mustard and ketchup and it was umm umm delicious. It had the nice amount of spiciness and wasnt overcooked.  I shouldve ordered one to go.  I wont forget this corner spot in the future and will check it out when I want some cheap good eats.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "As I walked into hotdog haven (can't really say shop because it's on a corner and all awnings, doors, gates whatever you want to call it are up giving it an open, fleamarket feel), I heard \"what do you want what do you want?!?\" in quick succession. Without enough time to browse the menu board I replied \"hot dog hot dog hold all sauce\" and I felt like a true Brooklynite hotdog  pro *GRINS*. \n\nI can't say if it's one vendor or several that share this corner space because although it's one long counter where your place your order, they somehow manage to look together but apart. \n\nThey have smoothies, various types of hotdogs and hamburgers, and at the very end I saw pizza. I'm sure I missed something. \n\nCome hungry leave happy even with only three stools at the very end by the pizza area. My yelp pal JackSprat told me they've been in existence for over 50 years. Nice. Things still taste fresh. Lol\n\nI enjoyed my hotdog and wish I'd found here sooner or maybe not (gym calls).\n\nNice experince but not if you're on the fussy side and don't particularly enjoy munching your food standing (sometimes on the street) and being jostled by new customers. Me? I likey!\n\nFive stars! It is what it is. Take it or leave it. \n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Best hot dogs in town. Quick and hot. Kinda crowdy at times but fairly quick service.", "author": "Lady F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "This is my go to place for hot dogs. Grilled perfectly they have that snap and the hot sausages are the best. These are the type of  hot dogs we grew up eating. Can't beat the price or the service. My to go order always the same 2 dogs heavy on mustard with relish and 2 hot sausages the same. Time to make a trip to Brooklyn.", "author": "EARLDINE J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "New York City has some of the best cuisine in the world. You can get everything from the most expensive cut of steak to New York Style pizza. But there is one food that will always be American as apple pie, something that is synonymous with the City of New York: the hot dog. Fulton Hot Dog King is serving up hot dogs and sausage dogs faster than you can say frankfurter. Their hot dogs and hamburgers are cooked to perfection, topped with a myriad of delicious items, sure to make your mouth water! So the next time you're in Brooklyn, join the locals and enjoy a classic New York staple!", "author": "Jennifer C."}], "servesCuisine": "Hot Dogs", "priceRange": "Under $10", "name": "Fulton Hot Dog King", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "472 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/MErUWDFqkPFWtuhXBOW3jA/ls.jpg", "@type": "Restaurant", "telephone": "+17188589799"}