{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "I have been going to this place since I was a kid. Growing up in downtown brooklyn was great but the best part was being able to go shopping at Fulton mall and stopping by hotdog king for the best hotdogs in town hands down!! The hotdogs are so good you get that SNAP! The minute you bite into them. Let's not forget to mention the hot sausage OmG! To die for!!! I can't emphasize how good this spot is you must go try ( my mouth is watery as I am writing this review). Btw parking is difficult there go with a friend and enjoy!!!", "author": "Rosie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Just when you think the best hot dogs you would have ever eaten would come from Papaya...\n\nI've been eating here for ages! Not only are they good hot dogs, but you get that crispy snap! That snap is the key to a hot dog changing your mood for the day and quite possibly your life. What I will always love about this place is it's convenience to people riding the train and the openess of the location.\n\nYears ago, downtown Brooklyn had a pizza shop that everyone and their momma's went to. Once that closed, a void had been left open and I feel these guys filled it. Two hot dogs and a lemonade will cost you around \u00266. You will pay almost double that amount at Nathan's and you get the same quality here.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Best hotdogs downtown. Don't even bother with the carts.\nThey also have some other sandwiches like fried chicken, grilled chicken, fried fish, cheeseburger, hamburger, btl etc. All super reasonably priced and good.\nThey got fresh juice $4 for a small, veggie and fruit.\nperfect place to wait while your girlfriend is taking forever in Macy's", "author": "Carl W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-24", "description": "Simply put, this is not a great restaurant. I paid $5.25 for a soggy burger, mediocre fries, and a very small medium drink. For the price, it's still not good. I would recommend the nearby McDonalds before this place if you want a good burger/fries/soda combo.", "author": "Davy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Cheap, friendly, fast, tastes good, free water.\nSaw the great reviews on Yelp so I decided to go there for dinner. The hot dog ($1.50) is a normal sized hot dog where you can add relish, onion, ketchup, and tomato. I got everything on it, but I recommend not getting the mustard or ketchup because it gets too salty. The burger platter ($4.25) was extremely satisfying. Ample amount of hot, freshly fried fries and a not-so-overwhelming yet filling burger.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Excellent value for price, great all-beef hot dogs, surprisingly good fresh smoothies, very nice crew.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "If you are ever in the downtown Brooklyn area you must try these dogs and hot sausages! Simply marvelous. You will not be disappointed. Excellent!", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "OMG - I love this place!  \n\nI don't know what it is about their chicken sandwich, but I think it's one of the best I've ever had.  And....it's only 3.25 with ketchup, mayo, lettuce, and tomato on a sesame seed bun!  I haven't tried anything else, because I always get the chicken sandwich.  The fried part is crispy, the meat part is tender and juicy, and it's the perfect size!  The fries are really good too.\n\nI like their juices, and you always get fast, friendly service with a smile!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "When I'm shopping downtown and I'm hungry I stop at this spot they taste good it's been there for years sense I was a little girl.fast and convenient.they have alot sausage pizza burgers .", "author": "Beverly A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Surprisingly phenomenal hot dogs and sausages. Staff are not dicks and the dogs are cheap and delicious. The dogs are grilled and you can get them near black if that's the way you like 'em...and that is the way I like 'em. Best hot dogs in BK? Yes...", "author": "Pipe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "I think they have the best hot dogs. There grilled not boiled in water so that's a plus! It is a bit loud n busy there but that's only because everyone goes there and not only for hot dogs. There steak sandwiches are great too! They have a good variety of food there also.", "author": "Redgem M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "This place has always been great. I came here today and got a spicy sausage and an Orange crush for just $3.00!! This place has been here since I was a teenager and they have always had the best grilled hot dogs and sausages....Love them ! Just wish they had a big dining area ....", "author": "Reena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "This place has been here over 20 years easy...Love the hot sausage. It's sin to eat this because of the side effects on the tummy but sometimes you have that crave. It's so worth it. Best in hot dog/hot sausage in Brooklyn.", "author": "Joe B."}], "servesCuisine": "Hot Dogs", "priceRange": "Under $10", "name": "Fulton Hot Dog King", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "472 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/MErUWDFqkPFWtuhXBOW3jA/ls.jpg", "@type": "Restaurant", "telephone": "+17188589799"}