{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Staff was very friendly. He remembered our complicated order by memory. It was nice sitting by the open window/wall. I really enjoyed the food.  We had the Makhani (butter chicken) and lamb vindaloo.   It was very flavorful with just the right amount of spicy. The garlic naan was moist and garlicky without being overbearing.  I had a very tasty mango lassi which complemented the spice nicely.  Biggest complaint was that the simosa was a tad dry and they gave us limited sauce, but I suppose we could have asked for more.  Price was decent, I think entrees were 12-16 bucks", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "I highly recommend this place. I went to have dinner with a friend and we both were really amazed. The food was really good as well as the service, the waiter made sure we had a pleasant experience. Unpretentious yet excellent.", "author": "patricia s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "We had Asya delivered for a company lunch and it was fantastic. The guys came in and set up the dishes with the utmost care and attention. They provided the serving utensils and had name tags to clearly highlight each dish. The put a cover down to prevent any spills or mess and they were polite and friendly. The food itself was delicious and satisfying. Our entire office was extremely impressed and will definitely plan on ordering from this spot again.", "author": "Terri R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "Food ok, but laughably bad lunch. The owner is clearly not sure about his decision to offer 50% off at lunch. The waitress asked three times if I wanted rice (I clearly said no the first time), she upsold me to garlic naan instead of plain naan because it costs more. I asked to see the menu (for dessert) and she asked why I wanted to see it. Strange question in a restaurant, but she was planning something. Only rice pudding, she said after not bringing the \"dessert menu.\" Check, please. She charged me $6--HANDWRITTEN AT THE BOTTOM OF THE CHECK--for a chai tea (no milk, no sugar). When I said no way (the menu full price is $4, so it should have been $2), she said it's not half off. She told me how much of a discount I was getting, like it was a favor to me personally and wasn't marked on the sandwich board outside. She then reprinted the check and made the tea $3 when she had just said something different. Giving up the struggle, I opted to leave a smaller tip, write this review and never return. I prefer the places in the neighborhood with better service and better food.", "author": "PM M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "We eat here regularly for a reason. The dishes are excellent, the bread is fantastic, and the service is super. Highly recommend the chicken tikka and keema naan. The bhartha is great too.", "author": "Cam M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "Very bad attitude with customer.  The Waiter was very rude to us. He give me wrong order and talks like shit... very bad! Food was not good too. Waste of time!", "author": "Ma R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "Possibly the worst service I have received in NYC so far. My boyfriend and I came to this restaurant a few months ago for dinner and we had to wait for over an hour to get our food. We did not get any sort of apology or updates on what was going on with our order. Since the food was decent, we decided to give it the benefit of the doubt and try their lunch deals (50% off everything) today. We ordered the cauliflower manchurian, chicken tandoori and chicken tikka masala. The woman told me that I would have to order the rice for the chicken tikka separately even though it clearly says on the menu that the lunch deal includes \"rice, naan and salad.\" I said okay and made a separate order. The portions were really small. They tell you 50% off but the portions are actually less than half what you'd get for full price, which is a rip off. Then we paid the bill, but the lady came back with the receipt saying that she forgot to include the rice and we need to add more money. Then she said we should give more tip because the gratuity should be on the original full price and not the discounted price. She kept saying \"the company is going to take this money.\" However, we'd still given her her tip although she was talking on her phone the whole time we were in that restaurant. We left her the money and left the restaurant vowing to never return.", "author": "Rediet D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "We LOVED this restaurant. The ambience, the food, the service. All was excellent. Must go to.  We are definitely repeating!  Thank you Anthony! What wonderful service and excellent food! Loved it. Lucrecia ( we had a starter: combination to share) and had the lamb with fresh spinach and a really good bottle Malbec :) highly recommended!", "author": "lucrecia l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "The food is good, but they are rude and super unhelpful when something goes wrong. I ordered via eat24 and it took almost 2 hours to get the food. They didn't know if they had the order or not and kept hanging up on me when I called. I don't think we'll order from them again.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-16", "description": "I have had delivery orders from Asya in the past, and never had a problem.  Their food in past orders WAS consistently good... until now. I ordered the Fish Tikka, which had 3 large pieces of salmon.  No complaints about portion size.  I ate the first two, however the third piece I could not eat because it was mostly raw.  It was not cold inside, per se, but clearly, it clearly was not cooked beyond the outer layer.  \nAdd to this, they forgot to put the bottle of water I ordered in the bag.  I hope the quality of this place is not going downhill.  This was the best that Brooklyn Heights had in a very long while. \nPlease Asya, do better!!  Thank you.", "author": "Mmg N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "We usually order online but tonight we had a babysitter and decided to go in person. I have to say that this is as good as you will find. The host was extremely attentive and the food was excellent.\n\nI highly recommend the butter chicken and a cold glass of Kingfisher to wash it down. \n\nCan't wait to come back.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "We have eaten here several times. This time we got paratha, tikka masala and korma. The Tikka Masala  wasn't as good as we remembered. The paratha was burnt on the edges, oily, and was so shredded up I thought we had been given a basket with a towel in it. Service was good, not hard considering we were the only people in the place for the whole hour.", "author": "Andy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-25", "description": "I love the whole atmosphere inside this restaurant.  It's small and cozy, making it a very comfortable place to eat in.  I had a taste of several dishes, my favorite being the chicken masala.  I also enjoyed the fish tikka; it's not overcooked, retaining the right amount of moisture.  The waiters were very attentive, and service was fast.  \n\nThe only complaint is my seating.  Try not to sit directly in front of the door, especially during the winter.  But the restaurant was packed, so I suppose it cannot be helped.", "author": "Josephine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Every time I come here I love the food.  The cauliflower app and the garlic nan are great.  Really good Indian food in Brooklyn.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-10", "description": "They have just ok Indian food. The location is nice though and it looks pretty cool. However their food isn't really that great, its nothing to rave about. They do appear to have great service though. HOWEVER, the brought us lentil bread to the table, and we hadn't ordered it, and our waitress just said its ok, just enjoy. We were impressed. Their menu said lemonade mojito $4, so I ordered it too. Come to find at the end they charged us for the lentil bread that we didn't order to begin with, and charged us $15 for the mojito because we didn't get a lemonade, even though their menu described it as $4. Oh yeah, and we were their first customers of the day...at 05:30 pm! Wow. I don't know how they stay in business.", "author": "Angel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Last Wednesday night my sister and I went in Asya for dinner and it was outstanding. We ordered the special, grilled lamb with ratatouille, and tikka masala. The lamb was grilled to perfection and the spices were wonderful. We ordered plain naan and the owner recommended garlic naan to bring out the tastes. Great recommendation. The food was so exceptional that we went back there with my other sister and a friend on Saturday night. This time we got two of the grilled lamb dishes, the tikka masala, and saag paneer and shared it all. If it was possible, the lamb was even better than it was the time before. The owner is friendly, eager to suggest dishes and combinations, and clearly takes pride in his restaurant and food. The decor is inviting. The interior is cozy and warmly lit and the front windows open up onto the street with beautiful planters in the front, making it a great summer venue. I live in the neighborhood and for whatever reason the majority of Brooklyn Heights dining options aren't remarkable. I'm happy to say this is an exception.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-14", "description": "Have ordered from here twice. 1st time I was really underwhelmed. The sauce on my chicken tikka was weirdly sweet. Friends convinced me to try again. Ordered for take out again last night. Once again the Chicken Tikka was a disappointment. The sauce was... ok. But the chicken itself was overcooked both times I got it. Really dry and felt like it wasn't cooked in the sauce but rather just plopped in later after it had been hardened. The Samosa was decent. My wife liked her spinach \u0026 chickpea thing. My wife did pull a full cardomon pod out of her samosa. Having cooked Indian at home I know it can be a bear to find those things before serving but I'm not cooking for people for money.", "author": "Luis F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "The manager Anthony is the best. I came in early to make reservations for my girlfriends birthday dinner and he helped me choose an assortment of delicious dishes during our visit. Every dish - the Shrimp dish , the portobello mushrooms,  and the Lambchops just so goood! \nThen the wine and the chocolate cake they prepare for me. \nJust unbelievable great experience- great atmosphere,  great food and great service.\nOur new favorite and happy birthday to my lady of my life Keva.", "author": "Brooklyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "One of the few places that makes me crave Indian food. I've been here several times now, but it wasn't until I had the Lamb Korma that prompted me to leave a review. The dish is lamb in a delightful almond curry sauce that has several layers of flavor. At first, the curry is smooth and milky, as you would expect from an almond sauce, then like most traditional curry, it gets a little spicy, but just enough to tingle your tongue for the next naan dip. If you're lucky, sometimes you'll get some pieces of almond to give the curry a delightful texture if you're the type to ladle the curry onto your naan like I do. I would definitely recommend the garlic naan, it came with a nice crispy outside and a warm fluffy inside. \n\nI've also had the crab curry, which was actually pretty good since I am not a big fan of seafood curry. I expected the curry to overpower the crab, but surprisingly you could make out the crab in the curry which was a delight. And of course, the chicken tikka masala was delicious and delightful, it's always a self bet to sample Indian food if you've never had it before. \n\nIn terms of delivery, I would say dine in is better. I'm saying this because the food might not come as perfect as it would straight from the kitchen. If you're up to tipping, definitely stick with the dine in, the decor is actually pretty nice and has an authentic Indian feel to it (the bathrooms are pretty clean too).\n\nIn terms of service, I would say it was pretty quick and courteous. I have never dined here on a extremely busy night, so I can't speak about the food speed, but I never have noticed the food not coming within an appropriate time frame. I will say that if you're there when they are about to close for lunch, they might seem like they are trying to rush you out a bit, because they will give you the check before you ask for it. However, I didn't feel rushed the entire time, and I will say that we overstayed pass the closing time for them to prep for dinner service and I wasn't bothered by the gesture at all (although some people might).\n\nDefinitely come here for the lunch special, which is 50% off if you pay cash, as other reviewers have mentioned. It's also surprisingly offered 7 days a week, so I would imagine it gets packed during weekend lunch.\n\nOverall, I would definitely recommend this place for Indian food. The only gripe I have was the waiters didn't come in on magic carpets and no genies from lamps were present as was portrayed by Disney.", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "We had to come back to visit Asya because its our favorite Indian restaurant in NYC. Anthony always takes care of us and went beyond expectations. Cauliflower Manchurian is a must! If you love Indian food go to this restaurant! The service is great and the setting just right. Thanks for making our visit that much better : ) Julian and Julianne!", "author": "Julian C."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}