{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-24", "description": "I was super excited to find one more Indian restaurant in the area but after coming here,I think Ill just stick to my usual place .To be fair,on the positive side,the decor is awesome,beautifully carved artwork and very desi looking lighting. Everything good about Asya seems to end there.The service was less welcoming than I am accustomed to but maybe they were having an off day.\n\nFirst of all,the specials(if there were any) were pretty confusing,outside on the board its written 50% off,on the menu kept outside,its 25% off and includes a $9 lunch combo  while the menu inside the restaurant  doesnt seem to have any specials at all.It would be so much better if there was more clarity.I have enough analysis to be done at work without trying to deduce things in my lunch hour too.We had decided to have the lunch special combo since our curry preferences are very different and ordering one entree per person would be way too much food.Well,turns out if you dine in,you cant get the lunch combo.umm what?!!why??You just need to give me exactly the same food on a plate and i swear I wont eat your plate!!\n\nSince we were seated already and didnt want to be rude,we didnt walk out and agreed to split one entree which didnt seem to sit well with whoever came to take our order!After reading some reviews on the quantity of food,I decided to get a chicken tikka appetizer too,hopefully making him happy.The food took forever to come out and even though it was okay,the quantity and taste does not warranty the prices they think each dish is worth.The asya baingan was brinjals in onion tomato gravy,tasty enough but a tiny portion for $12.The chicken tikka was flavorful but nothing you cant get in any and every other Indian restaurant.\n\nThe lunch is cash only in case you miss the tiny sign hidden behind menus on the table out front. I do hope they can step up their game because it would be nice to have another decent Indian lunch option near work but for now Curry Heights is gonna get my business.", "author": "Aparna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Good food and I'm an Indian food lover\nVery nice and simple people\nThe place is clean and with classic interior", "author": "Toto E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "I stopped by this restaurant for lunch today, and it was the worst restaurant experience I have had in a long time. The man is highly rude and racist. I was eating my appetizer and taking a phone call when the man walked over and told me to eat before the food got cold. I watched the service that other customers received and compared it to mine. Never again. \n\nNot to mention that they wait until you have eaten to tell you it's cash only for lunch. Never again.", "author": "Rashad M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Saturday night at 7:00 we order. At 8, we call and ask for a status update. \"5 minutes,\" we're told. At 8:20, we call again. Once again, apologies are offered and we're told, \"just 5 more minutes.\" At 8:40 we call a third time. This time, we're angry. The staff is unresponsive. They show no concern whatsoever that it has now taken them one hour and forty minutes to deliver food a few blocks away. They seem more annoyed that we're bothering them by calling. One hour and forty minutes. That is neither hyperbole nor exaggeration. One hour and forty minutes.   \n  \nJust after our third phone call, by coincidence, the food arrives. It is ice cold. \nAs far as taste, the worst offense was that the food was bland.  It was as if they'd forgotten to spice it. The chicken tikka was better than the saag, but only marginally. The kick that usually comes with these dishes was missing entirely.  Even a staple like samosas were just mediocre. They simply lacked flavor.  \n  \nWith so many better options (for both food and service), and with competition so fierce, it is unlikely I would try Asya again.", "author": "Gary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "I ate here with friends recently and we ate so much we barely made it home! I grew up eating my Grandmother's cooking, so I'm particular about my Indian food. I'd ordered from Asya on Seamless before and didn't have a great experience, but it's so close to home we decided to give it another shot. For main dishes we had chicken vindaloo, chicken ticka masala, and butter chicken. We also had the cauliflower, saag paneer, and a few other dishes (like I said, we barely made it home). Everything was delicious. The man who took our order was nice and polite, he checked in on how everything was shortly after it came out. I got the feeling they are really trying to improve their reviews. The waiter sent us an complimentary round of beers midway through our meal. \n\nOver all, we will definitely return!", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Bit pricey for a take-out, but we've tried all the Indian food in the area and this is definitely the best of them all.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "A good Indian restaurant about four blocks from The Brooklyn Bridge.  I had the Lamb Korma.  My wife and son had the Chicken Korma.  I think the food is about average- not going to blow you away.  I have had better in some side streets in Manhattan.  But I had a star for service and atmosphere.  Attentive and spot in.", "author": "John K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-08", "description": "Had a late stop after an artists' talk with my friends. We were greeted by a very pleasant and warm host who doubled as our waiter. \n\nThe decor is very quaint and colorful, and gorgeous on a cool summer night. \n\nI had the roasted cauliflower which was sweet and savory and just perfect. We had an assortment of naan - plain, cheese and garlic - and for the main I had the vegetarian mushroom and peas curry which was amazing!!\n \nJust the right moderate spice to add a kick and warmth. It was fresh food prepared with care. If you are looking for Indian food in the area I highly recommend this spot. \n\nOne tip, there is no alcohol served nor do they have sparkling water or a variety of drinks- mostly sodas.", "author": "Holly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Wanting something different from the typical items on a holiday party menu, my department decided on ordering from Asya and I am so happy we did! We ordered platters for 40 people of chicken tikka masala, bhindi masala, malai kofta, chicken malai kabab and naan, all were a hit at the party. The manager, Viniti, even gave us a free platter of rice and provided extra aluminum pans to keep the platters warm. The warm and detailed service plus delicious food will keep me coming again and again!", "author": "N C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "Yay, we found a new neighborhood Indian place - and it blows Curry Heights out of the water!\n\nAte lunch here yesterday - love the decor... quiet, relaxed, romantic.  The service was quick and friendly, and we didn't have enough cash for the 50% off cash only lunch special so we were allowed to use a card and just tip in cash which was really sweet of them - I wouldn't have minded going next door to Cranberry's to use their ATM at all.\n\nThe food - awesome Indian!  We had the Bhel Puri and the Aloo Papri for appetizers - the chutneys were amazing - sweet and spicy - and the crispy bits were just perfect.  We had the Bhindi Masala and the Chana Masala for entrees with saffron rice with peas - both also vegetarian, but very rich in flavor.  I've had Chana Masala a million times but this one was different - the sauce was just better, maybe fresher?  and it was definitely richer.  I could eat that sauce for days.  We also got an order of garlic naan which was deliciously crispy.  Lastly, two herbal teas plus refills - really warmed us up, and the spices were incredible.  Tasted like a light chai, perfect for a cold day!\n\nThe price was higher than what I would have expected, but I didn't bat an eyelash because it was 100% worth it.  Besides, because we had 4 teas and 1 beer total, the beverages alone were $18.  The food was $45 minus 50% for the lunch special, so $22.50 + $18 + tax/tip... totally fine.\n\nI just hope the whole \"curse\" doesn't affect them... I mean, we've lived in the neighborhood 3.5 years and this is the FOURTH restaurant we've seen in this space - FIRST actual good restaurant though so I just wish them the best.\n\nNamaste.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "Came here for dinner with a party of four. The food was fine. It wasn't fantastic but it wasn't terrible. The service, specifically from the man (possibly an owner?) was incredibly RUDE.\n\nWe ordered an appetizer immediately after sitting down. A few minutes later the man came over to see if we were ready to order. We asked for a few more minutes and he said that we had to order now because the take-out orders were getting really busy and if we didn't order right away we would have to wait for our food. We were a little surprised but we decided what we wanted right away and put in our order. \n\nThe rest of the dinner was pretty uneventful until the end. Literally as soon as we put the tip down on the bill the man came over to tell us to get up because they needed the table. Mind you, the restaurant was not full and there were plenty of tables with enough seating for four or more in the back of the restaurant. As we got up in shock to start putting on our winter layers, the man came back to start clearing the table and to set new places even though we hadn't left yet. I was standing up at my seat and hadn't had a second to grab my coat or purse. I told him I needed a minute and asked him to wait. He responded that he wasn't in my way. Someone in my party told him that he was being extremely rude.\n\nI've never been kicked out of my seat at a restaurant like that in my entire life. This man's rudeness totally ruined what would have been a lovely evening out. I am never coming back to this restaurant again.", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "We had an incredible dining experience at Asya with our host, Anthony, tonight. The food was delicious. We ordered our go-to dishes...chicken tikka, palek paneer, etc. but Anthony made wonderful suggestions to complement our dinner and he was right. Plus, he treated us to wine, samoas and dessert, plus lively conversation. The restaurant was not busy with in-house diners, but there was a steady stream of take away and deliveries. I felt a bit sorry for those who didn't get to enjoy the great ambiance of this restaurant as well as the wonderful service here. Next time you want a lovely Indian dining experience in the neighborhood, venture out, relax and let Anthony take good care of you.", "author": "Sandy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "I love this place. The food is wonderful and the staff is great (especially the manager Anthony). \n\nIt's Great for any occasion, or no occasion at all. I've come here with groups of out of town guests, dinners with friends, dates, and take out.  \n\nAsaya has become my staple restaurant with amazing food. Finally a consistently yummy indian restaurant in the neighborhood.", "author": "Sabs B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Please boycott for discriminatory practices. We order from here all the time. The food is acceptable, not great, but twice we tried to eat there and they turned us away because we have children (two well behaved girls that know how to eat at restaurants.)  They said they were full but they had at least 4 empty tables and when we checked, reservations were available on opentable. Their food is not that good for them to be turning away business like that.  Please do not give them your business.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Sadly we will never be ordering from Asya again despite enjoying their food. Three times now when we've ordered food they've forgotten to send us rice - the previous times they ended up sending their delivery person back with the rice. This time they argued with us on the phone saying they provided it! Finally they agreed to come back out with the rice and we waited 30 minutes before calling back to ask \"where's the rice,\" at which point they argued with us again, saying they sent it! The rice still did not turn up and after the third call, and again having an argument, we just gave up.", "author": "krst l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Had a wonderful family dinner here. The Cauliflower Manchurian appetizer is amazing! I also liked the: bhartha, asya baingan, malai kofta, and the daal. Garlic nan was a great side, and the service was nice! Highly recommend.", "author": "Kelly J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Great location in Brooklyn Heights. Though there is no outdoor seating, they did open the front door and windows to let the natural Spring breeze in. I loved the leather cushion seating along the brick walls. The music was low enough to add to the ambiance without preventing you from conversing with your party. The decor is simple at best with a few religious pieces. There is only one bathroom towards the back. This is definitely a family-owned business, because there were no servers - just two individuals. They're not really big on conversation and at times it took a little more effort on my part to grab their attention. Patrons moved in and out pretty frequently so you won't experience a long wait time if you did not reserve a table. I ordered the samosa (pastry filled with potatoes and peas) $7, saagwala (chicken with fresh spinach) $14, garlic naan for $4, mango lassi for $4. Food as always when it comes to Indian cuisine rarely disappoints. The spices and flavors were there. It was a hearty meal that I most certainly enjoyed. I had to walk it off a bit, because I was so full. The tab at the end of the night was easy on my pocketbook. Thumbs up!", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-14", "description": "I'd been in person to the restaurant and eaten once and liked it. This time I thought I will order using Seamless app. I ordered the price fix meal combo. In the request I specifically wrote to provide some cut salad like Red Onions and lime/lemon. When the food came, guess what, those were not there. And neither was there any fork, spoons or napkins. Frustrated I called the restaurant and told the same. The lady says \"we don't provide forks spoons or napkins unless you put it in the request\". Oh really??? Then I ask what about the Onion and lime.. And she's like \"we didn't have it\". And she's like, \"shall I send all those now?\". I'm like, really?? \"No, THANK YOU\". The food \"Paneer Bhurji\" that I had ordered tasted subpar and nowhere close to what I'd expected. \nThey just lost a customer (who eats outside everyday) and I'll post this review everywhere I can for their crap service they did.", "author": "Deep B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "OMG!!!! My girlfriend and I was looking for a place to eat and the atmosphere at Asya just drew us in. We started with the Aloo Papri \u0026 Samosa and for dinner we had Saag Paneer \u0026 Maharaja, everything was absolutely tasty and service was excellent!!!!! We've already plan on returning w/ more friends to sample more of the menu!!!!!!", "author": "Portia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "My new found love for Indian food started here. Everything was so good. The dishes that stood out to me were cauliflower manchurian, samosa, chicken korma, and the naan. Even the rice was amazing.  The restaurant itself didn't not have a strong scent which I truly appreciate. The meal was almost perfect. They should work on their customer service skills. It wasn't a big deal but were were rushed to order and at one point it felt like the waitress was yelling at us. All in all, thanks to this place I now love Indian food. Woot!", "author": "Lisa H."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}