{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Finally some great Indian food in the Dumbo/BK Heights area.  We ordered Tikka Masala and Saag Paneer and both entrees were delicious.   Looking forward to adding them to the weekly rotation.", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "My husband and I had dinner here recently. Great service, Great food. Staff was excellent! Beautiful artchitectural venue. Nice music.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "The food is just okay and the service is not good. The man who works there was nasty and rude.", "author": "Manel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "I like the place, and this is the only clean Indian restaurant in DUMBO. \n\nI went with my American friend, and we ordered White Rice, Garlic Naan, Lamb coconut curry, Lamb Almond Curry. \n\nMy friend liked the Almond curry better as its was less spicy. I liked both, but taste was lesser than I expected. Though I also missed the spicy hot flavor, I should confess that I am from India, specifically Southern part of India, who eats very spicy and very specific about the traditional taste. \n\nI would rate 2, but my friend said he would rate 3. Worth a try!", "author": "Raj E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-07", "description": "Food is okay however people who manage this restaurant are too rude; they accept reservation but don't care about it. Poor customer service experience ever.", "author": "Anup S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Great place. Worth traveling to from anywhere in the city. We had the chicken makhani and daal.  Birds chirped outside the store window as we dipped our naan into the tangy sauces.  We'll be back.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "My wife and 2 yr old daughter had lunch at Asaya.  The food was AMAZING and the service especially from Anthony (owner) was top notch...we were spoiled to say the least.  He treated us like we were part of his family and we enjoyed great conversation about both our families.  I'm not usually the type of person that writes on reviews but I felt the need to do it for Asaya restaurant.  If you go you wont be disappointed!", "author": "Cale V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "The food is so yummy here. When we get delivery it is there in 20 minutes. The staff is kind and responsible and there are lots of nice touches when you go into the actual place - they have nice beers and keep the glasses in the freezer so they're nice and frosty. We love this neighborhood gem. (And we eat there at least once a week - it's the only place in the hood we really crave on a weekly basis). When we go in, the only thing that bums us out is that the raita isn't included as a sauce selection for free the way it is when you get delivery, but that's not a big deal. We splurge and get the Raita side dish. Love this place.", "author": "katie k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Comfortable place, delicious food, good service, and the host, Anthony, was very personable.  I love this as our neighborhood Indian food go-to, and looking forward to going back!", "author": "L S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-14", "description": "The food is good, but there's at best a 50% chance that your delivery will arrive on time and contain everything you paid for.", "author": "G H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-14", "description": "Ordered food over two hours ago and still waiting for delivery.  If you order with the intention of actually consuming Indian food, this isn't the place for you.  Inexcusable.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "Do not order from this restaurant. The past two times I have ordered it took over an hour for my order to arrive and it was incomplete both times. When I complained about these incidents, the receptionist simply said, \"I'm so sorry.\" No offer to fix the order nothing.", "author": "Debra H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "We went for sloppy pavs, but left hungry. The host told us you cannot order them for sit down, nor for take out. You can only get this menu item by ordering through Seemless.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Best Indian in Brooklyn, hands down. Eat here at least once a week, mostly through delivery and the food is always as warm and delicious as it would be if  I were sitting down in the restaurant. Even the delivery man is great! If you live in Brooklyn and want Indian food, look no further than Asya.", "author": "Gertrude P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "This is such a racist restaurant! I am an Indian and had brought my parents along with me to this place. The waiters here have too much attitude, are discourteous and have no respect whatsoever. Right from the moment we entered, the waitress showed too much attitude to us when we wanted to order appetizers. They didn't check on us either, the food was late and not good at all. And to top it all the waitress hand calculated the bill, added tips on her own (can you believe it???) and then when I asked her for why she did that she said \" Its ok, I don't need your 4 dollars\". I felt really embarrassed in front of my parents for taking them there and having them face this! This is a totally unprofessional place with the people here not respectful of their customers. I am sure if they continue this, they would be left with no customers whatsoever. Through this review, I wanted to warn people to not head here and face disappointment and embarrassment. It's not worth it!", "author": "Shweta K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-03", "description": "They didn't give silverware with delivery to a hotel. Wtf? Having to search out silverware bc our hotel charges four dollars for utensils = terrible meal experience. GIVE PEOPLE SILVERWARE If they ask!", "author": "Maggie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "So yummy! Easily the best Indian food in the neighborhood. We had the Chicken Tikka Masala and Crab Curry and both were excellent. Ordered for take out and the staff was polite and courteous and very attentive when we walked in. So happy to have Asya in the Heights!", "author": "Isabella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Awesome deal for lunch. 50% off the menu. Easily best Indian food in this part of bk.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "My husband and I have been to Asya 3 times so far since we found it and I have to say that I'm always craving it!  It it is by far the best Indian restaurant in the Brooklyn Heights area.  My favorite dish has been the Balchau Shrimp, but the Chicken Tikka Masala is also delish.  The service is always excellent and I love the decor.  Highly recommended!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "We just went there for the first time and it was awesome.  Lovely ambiance, attentive service, and best of all the food was delicious!", "author": "Joyce p."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}