{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "The food was okay. I had the Chicken Almond Curry and it was really good food. However, the man who seated us was not very nice and made an in incredible awkward situation for us. Never cracked a smile the entire time we were there.", "author": "Renee F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "Unfortunately, the service was very poor. Very very poor. Upon entering, we were not greeted. Our server just grumpily pointed to the table we should sit at. My husband and I asked a couple of simple questions about the menu and we received harsh, short answers. As if we were dumb for not already knowing the answer to our questions. Not one employee of this restaurant ever smiled or made eye contact. My husband and I both felt as if we were an annoyance to the staff and not wanted at the restaurant from the moment we stepped in. I'm not the type of person who needs amazing service at a restaurant. But the quality of service at our dinner last night was so low that it actually made me uncomfortable and made it hard for me to enjoy my meal. The reason I didn't give only 1 star is because the food was tasty! I got chicken curry and my husband got chicken tikka masala. We also shared some garlic naan bread which was very good! Although I really enjoyed the meal, unfortunately I will not be returning to Asya.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "The staff is so rude that if you are not an Indian and find such behavior normal, you can probably not sleep in the night. I was standing outside the restaurant few days ago and the lady inside says to an elderly couple looking for a table \"You have to stand outside. Do not crowd inside\". I was like damn this place. When my food arrived, the quantity was very little and not worth. They also have minimum order of 1 entree each if you take a table. Overall, bad experience", "author": "Chirag A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "I have been visiting Indian restaurants , but very few of them are really authentic . Visit to Asya was a pleasant surprise. For starters , I ordered Bhel Puri. It had an authentic Mumbai taste , had adequate tamarind . Along with red wine it turned out to be great combination . Then ordered Baingan Bharata, spices and chillies were just adequate and not over powering . Will certainly recommend highly to everyone!", "author": "Vilas V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "3 stars for food, which does the job when I'm craving Indian considering how far I live from Jackson Heights and Curry Hill....however, 1 star for delivery - half the time it take well over an hour/hour and a half to arrive with all the chutneys spilled inside the bag.", "author": "jacky t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "Nice place for a casual evening dinner.  My only concern was that there was only one server, Anthony, for the time we were there, who at some point left the restaurant briefly to purchase club soda for the patrons sitting adjacent to us....", "author": "Lasonya T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-24", "description": "The owner is very unfriendly. We were with our luggage as checked out and even though the restaurant was showing open she said its closed. When i asked if we can just use restroom she asked to go to other store besides it as it was dirty. Very un coperative and proudy", "author": "Charchica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "The food is great.  We got the Aloo Papri is like a dessert, sweet but filling.  Chicken Tikka slightly spicy, and the Lamb Korma is just delicious!!! All is so good, had it delivered at 10 p.m. and it was delivered via bike, but still warm.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "I stopped in to Asya just for a quick bite, the host, Anthony went above and beyond to make me feel at home. The service was excellent, the decor warm and inviting and the food was delicious. I will make Asya a regular part of my restaurant choices in Bk Hts.\nPS. They do serve wine, but I opted out that night...However, the mango lassi was heavenly!", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "Food was just alright. Nothing special. Indian food in Brooklyn isn't great, and this falls in the middle range of Indian restaurants. Probably won't go back. I liked Baluchi's more when it was here.\n\nHopefully they'll add some flavor to the food and things won't be bland like they are everywhere else.", "author": "Suraj S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-24", "description": "Pretty legit, they never brought me the crackers with the spicy red sauce when I sat down, the table next to me received this when they sat down, kind of irked me even though I was done eating I still would of liked to have that when I sat down.. Ordered Samosas for an app, have had better before but portions were right and sauces were good. \nHad the curry chicken for dinner, portions are mad small. Could of had way more chicken for the price. Also had the lamb app (Seekh Kebab ) was pretty fire. All in all good Indian place but nothing special. Ordered the garlic naan also, very garlic... like too much garlic.. but good.  Delivery truck pulled up to make deliveries during dinner (8pm) which was kind of awkward. Bathrooms are nice haha... I'm gonna give some other Indian places a try before I go back here, its the most expensive spot in the area. \n\nMight go back but didn't deserve more than 3 stars.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "So glad we made a reservation! We were a party of six on a Saturday night and every table was occupied. The staff had to turn away about 50 people during the 2 hours we were dining, so do yourself a favor and make a reservation. The food is outstanding. The Manchuria Cauliflower and the Garlic Naan was amazing. The waiter was very direct but his suggestions to order extra appetizer platters was spot -on! Atmosphere, decor and lighting were very nice. We will be back!", "author": "Robert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "Came for dine-in Brooklyn, just writing my review now! Woah!\n\nClearly, you know this place is good if I'm willing to dig into the nether regions of my memory to craft this review. Asya is definitely the best Indian I've had in the hipper regions of Brooklyn (e.g., BK Heights, Carroll Gardens, The Slope,  etc.). I say this because I feel like there is some amazingly authentic hole in the wall Indian place elsewhere in Brooklyn I just don't know about.\n\nAnyway, for Dine-In BK, Asya did this awesome 2-for-$26 or so three course dinner. Yea that's right, two three course dinners for a cheap price! I got the Chicken Tikka as my appetizer, the Chana Saag as an entree and I don't recall what  had for dessert but I know I enjoyed it. \n\nIn terms of what I do remember eating, the Chicken Tikka was really flavorful and hot, which was great a I'm a spice lover. The Chana Saag was also hot and complexly spicey- I feel like too many louzy Indian places just chuck some spices in and don't create discrete flavors. Not the case here!\n\nI also got a navratan korma to take home which was very good but lower on  fruit than I'd have loved", "author": "Steve B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "Every once in a while, like a true cheapskate, I use a restaurant.com coupon and try out a new restaurant. On this occasion, I printed out a coupon, specifically for Asya, and headed over for an early off-hour dinner, I sat down and let my server know that I had a restaurant.com coupon. She said \"okay,\" but at the end of the meal, when she wouldn't accept the coupon, it became clear that what she really meant was \"i didn't hear you, but enjoy your dinner.\"  After that the interaction was pretty lousy. (Before that, the Ragra Chaat appetizer was really good, and the Malai Kofta perfectly fine.)", "author": "Matt V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Tasty Indian comfort food on a rainy night hit the spot at this attractive  neighborhood find. Our host Anthony suggested great dishes served in lovely silver bowls. We left feeling pampered by great service and delicious food.", "author": "Sharon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "The decor is incredible, very cozy with beautiful artwork and wood carvings. The service is topnotch, both when you sit in at the restaurant and when you order out.  We usually order the chicken tandoori, malia kofta and saag paneer with lime rice (a must to try!). I highly recommend Asya.", "author": "K. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Very tasty, fresh and flavorful. Bindi masala, Bharta were both fantastic. Hours later and we are still talking about it. We asked Anthony, the very friendly manager, for a recommendation for a lamb dish and we were not disappointed with the dish we got - it was awesome. Don't know the name but it looked like lamb chops with some amazing roasted vegetables accompanying it. Naan was deliciously fresh, chewy and not at all oily, as I've had elsewhere. \n\nService was very friendly but not as attentive as I would like - water glasses needed filling etc. noise level was quiet, which was nice. Not sure was a previous reviewer was talking about - they take credit cards. \n\nI'm going back soon. You should too.", "author": "Diana N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "The food and service was spectacular. Anthony is great!!! You can tell this is a family ran place with a lot of love.", "author": "Franchesca G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "We eat here at least once a week. Always consistently delicious and the service is wonderful as well - particularly Anthony! Highly recommend :)", "author": "Lindsay W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "I came here tonight with some friends. We all agreed that the food was delicious and perfectly seasoned. The servers were also extremely attentive and nice.\n\nWe tried a few of their appetizers and ordered a variety of dishes for our entrees. Everything that came out was spectacular! Definitely one of the best Indian restaurants I've been to!!\n\nMy favorite dishes were the veggie appetizer and the crab curry. Their chicken tikka masala was so good too! It was balanced in flavor and the white meat was juicy and tender.\n\nI will definitely be coming back with my bf!! :)", "author": "Cee B."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}