{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Frequently go to this restaurant. The food is delicious and the service is always great. Highly recommend the Cauliflower Manchurian and Chana Saag. \n\nWill definitely eat again here.", "author": "Travis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "These guys do not F around when it comes to spice level. Ask for spicy, and it will rock your socks. The chicken tikka was very good and the portions were generous (could've used more basmati, actually). And their samosas are just perfect!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "If you are Indian DO NOT EAT HERE!!!!! The food is plain. Does not taste like Indian food at all!!!!!! Had butter chicken and it was sweet. It had no flavor!!! Oh ordered the appetizer (onionbhujia) I got three pakora for 14 dollars!!!!!\nAs for their service well if you want water you will get water every five minutes but if you want your food then you will be waiting at least 40 to 45 minutes. Overall, the worst Indian restaurant I have been to in NY. \n\nDO NOT EAT HERE!!!!!!!!!!!!!!", "author": "Manne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Prompt delivery from seamless.\n\nOrdered chicken vindaloo, raita, mango lassi.\n\nVindaloo was a bit mild in slice in comparison to other vindaloos. Plenty of chicken, and only two pieces of potato. Raita was fine. Mango lassi was incredibly creamy and yogurty.\n\nNothing bad at all, but nothing amazing either.\n\nSafe place to order!", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "This tiny gem in Brooklyn Heights filled  all our expectations. The food was amazing and the service was great. The ambience was quaint and authentic. If you are looking for delicious Indian food, this is the place.", "author": "Christina A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "After coming here 4 separate times, I have to give them one star. The food is amazing but the sheer lack of customer service, poor management, and constant understaffing during LUNCH hours really sets for a one-star rating. \n\nOn one occasion we were denied service altogether because they were only doing deliveries. Today our server gave a brusque \"No\", when asked to split a check amongst two servers, although we had done this before. \n\nThere really is no reason why a restaurant can be SO bad at this? Come on. Staff more than one person during lunch, and make sure our food comes out sooner than later.", "author": "Bushra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Beautiful rustic Indian restaurant in the neighbourhood. Had a great evening here with my friends. The service was good, a lot more laid back, you can tell its family run. The waiters refilled our water several times but wasnt rushing us to order or checking up every five minutes so I appreciate it for a slower pace service.\n\nThe food overall was pretty good. Tried their mango with yogurt drink was delicious. I had the chicken tikka masala. Only complaint I asked for spicy but it wasnt spicy at all. I asked for some hot spices and it was perfect. Overall I would come back and really liked that I didnt leave the restaurant smelling like a curry.  Good ventilation magic here.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "The food is delicious and not too spicy (especially fried cauliflower in a chutney, almond curry lamb), portions are bigger than expected for the price, service is fast and attentive. The ambiance could have been a bit more authentic and drinks list could have been bigger. But overall very nice place", "author": "Yu W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Service was excellent for lunch and the food great as well! Order the vindaloo for something with a kick, naan is fresh and great assortment of sauces/ chutneys.", "author": "Zay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Amazing food. Best I've had in the city! Awesome service.  Couldn't have enough, Had to order takeout at the end of our meal!", "author": "Saman M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "I came in a party of 6 and we all got our own entrees and garlic naan to share. \n\nI ordered the chicken tikka masala and it was perfectly spiced and creamy. They are generous with the meat portion and the rice blend is so delicious. I do like the quiet and open-air ambiance, but service was somewhat laggy. \n\nOverall, great dinner and lovely place!", "author": "Juliana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "This is the most genuine indian place I've had in NYC. 5 stars on quality and price! You can only pick 2 of the service quality or price. Anyone that marks it down for not being perfect in all 3 is a moron.\nHad tikka chicken, saag, and Rogan Josh. Stayed for the rice pudding. All unbelievable excellent!", "author": "James N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Pretty good indian food in a convenient location.\n\nI ordered the chicken tikka masala, butter chicken, and garlic naan. All were excellent and pleasing dishes.  The ctm was pretty decently spicy as well with a kick. \n\nDefinitely use the chicken tikka masala sauce as a dip!", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "Where to begin, Ali is a gem, the Sag Paneer is to die for, the Goan Salmon is divine, the garlic naan keeps the vampires away, and the wine just flows. I love his place!", "author": "Cyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "Good, fresh Indian take out. Generous portions, fresh ingredients, great flavors and not watered down sauces. I would order again.", "author": "Ashley P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "Terrible place filled with dust and germs. Please see my picture and evidence. The food is terrible and overpriced. I ordered a shrimp and rice. The serving of the rice was smaller than my fist. No joke. The shrimp dish was even smaller than the rice. Like I took the bowl and put it ontop of my fist to measure and my fist was bigger. This is a problem. The shrimp dish cost me $8 and the rice cost me $3...... that was the 50%? Without the 50% discounts, the entire meal would cost $41......  41 DOLLARS FOR SMALL SERVINGS????!!!!\n\nthe lamb also sucked. Their utensils like forks were not properly cleaned. I asked for another one, and the waiter gave me an even dirtier one. The water was infested with dust, see again the pictures. So I had to report this place to the health department for giving me a stomach virus and diarrhea. Please note this was the only thing that I ate the entire day. I was sick for the entire week! \n\nAlso everyone else is right. They don't look Indian or speak Hindi. I tried speaking to them in Hindi and English, literally the 2 official languages of India.... the waiter can't respond. FAKE AF.\n\nDon't go here otherwise they will scam you with INFINITESIMALLY SMALL SERVINGS BUT EXORBITANTLY LARGE PRICES FOR SH%T FOOD!", "author": "Cal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Amazing, lovely place! We have been  in a lot of restaurants with my husband and we like samosas so much in this place! Service was also good and we sit by open windows ;) food is delicious. Will definitely come back and recommend", "author": "Ann T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Great food! Fabulous Service! Ali is so on top of his game! Chicken vindaloo delicious with spice! From the minute we walked in, we were family! Can't wait to go back again!", "author": "Mary Kate T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "The best Indian joint in Brooklyn guaranteed the best authentic tasting food with great atmosphere servers are always welcoming and smiling will be back soon!!!", "author": "Parvez A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Didn't expect good Indian food in the neighborhood, but was pleasantly shocked with the great food!\nThe naan was soft and well cooked and the chicken gravy had rich flavor.", "author": "Kairav P."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}