{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "We have become regulars here because we love the decor and the tikka masala! We welcomed an Indian restaurant to the neighborhood (it was Baluchi's for a short time, not sure what the story behind the change was), and I have to say we're pleased. I don't see it crowded with diners most nights, so I hope the good reviews help get the word out. Really good food and very reasonable pricing!, especially for lunch!", "author": "German B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Indian food is overpriced all across the western world. I know Indian food. I'm of 1/4 Indian heritage and I've spent a lot of time with my paternal grandparents in New Delhi and Mumbai. Asya has a huge problem. The food is substandard, overpriced and the menu is uninformative. Living in Brooklyn Heights area one has only 3 choices for Indian food. All of them serve non-kosher halal meats. Two other restaurants mention it on their menu, but Asya does not, thus misleading people. They will charge you $18 for 2-3 pieces of shrimp without explaining what the sides are. The person on the phones, their waiters and the host are rather snippy. There are other ghastly things in the kitchen that go on which need not be said without substantial proof. A food prep worker, when confronted off duty, told harrowing stories about their kitchen. So customer beware, and use this restaurant at your own risk.", "author": "Devyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "So i had to write a review bc the neg reviews are just annoying. This place is super cute and the food is great! I do have to say im new to indian cuisine so perhaps my palate is not as trained as some others but ive had indian food in places that are considered by expert indian food eaters some of the best and this place didnt pale in comparison.  In fact, some items here were even tastier than at this \"expert indian place\" like the garlic naan which, as another reviewer pointed out was \"garlicky and naany\" and also just plane ole delicious! Id skip their apps as they are not the best ive ever had and just order a bunch of mains to share. We had lamb with veg curry, eggplant with onions and peas and aloo gobi (the cauliflower n potato) plus the garlic naan.  Ive been here once before where a friend ordered the chana masala and my hubby had another lamb dish.  All dishes we tried here were very tasty! The waiter (a tall gentleman) was courteous and helpful and i have no complaints.  The only thing was that the place was totally empty, but people did keep coming in for takeout and lots of deliveries were going out, plus it was a random tuesday evening so not too many people out i guess.  When i came here once on sat place was pretty packed! Anyway, i really liked everything and will def be back! Dont be fooled by the small looking portion sizes tho, they completely stuff u! I think they only look small because of the type of plate they are served in, if they were served on a flat plate it would prob be a pretty large portion. Anyway if ur looking for solid indian food, good music and a good atmosphere i def recommend!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "Decent neighborhood take out spot for Indian (or dine-in).  The samosas are yummy.  However, the chicken tandori I ordered was not spicy at all.  Condiments needed to be added for more kick.  A little disappointing.  The saag paneer is good, but wish there was less of a nutmeg-like flavor.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "I've had my fair share of Indian cuisine in Brooklyn and Manhattan and never felt any reason to write a review. But I have to say, Asya is the absolute best Indian food I have had in a while. The Samosas and Chicken Tikimasala are my favorite. I simply cannot go without ordering one of the two. Another thing about Indian food, is that I find it quite difficult to find good naan, but they have pretty decent naan. Haven't tried the flavors yet, but I'll be sure to next time.", "author": "Timothy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-06", "description": "The restaurant wasn't overly crowded at a peak hour, which is typically not a good sign.  After being seated we were met with a very friendly waitress who took our drink orders and made some recommendations.  The cauliflower app was very good, it was a bit over-sauced though.The garlic naan was exactly what I wanted.  The recommended lamb entree was well cooked and well seasoned.  The food took abnormally long considering the number of customers in the restaurant.  It was a bit unnerving seeing all the back and forth between the kitchen staff and delivery runners.  I'd prefer not seeing that in the common dining area of a restaurant.  Overall, food was good, service was good, I'll go back if I'm craving Indian.", "author": "Arthur S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "I came here Sunday night with my friends, and I must say, we had an amazing night.  Asya is a beautiful restaurant with a great atmosphere. The food is awesome and the prices are at par with them. I will definitely be returning and recommending for dinner date or family gathering. Finally a good Indian restaurant with best Tandoori Chicken in town.", "author": "Roger M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Asya Indian restaurant is located in Brooklyn Heights. The rating distribution for this restaurant is about 30% five stars and 40% four stars. A tip would be to come here with your significant other since it has a very intimate ambience. Some popular dishes here would be chicken Tikka Marsala while others would prefer the veggie curry. The prices here are pretty standard for an Indian restaurant and many would say the portions are tremendous. The noise level of this restaurant is average and the best time to come would be an occasion for dinner. Unfortunately during the summer there's no outdoor seating so you have to sit indoors only. This restaurant does take reservations which I would recommend doing if you plan to come here at the prime dinner time. The waiting time here is usually not more than 10 minutes for a table. The staffs attitude here is very pleasant and they make you feel welcome.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "So I have eaten here fairly regularly and wanted to finally write.  This place is not consistent.  While food flavors tend to be excellent, you feel a little like you are being \"had\" as I suspect some of the food is just reheated in a microwave.  I had a business lunch here and the cauliflower appetizer was absolutely cold on the inside and tasted like it had been sitting out for days.  They charge for rice, which I don't appreciate, but okay, it is what it is.  I do like some of the food even though it is not the healthiest, and because the remaining Indian options around here are terrible I do still eat here occasionally.  For lunch they do cash only, which is one of my pet peeves.  Delivery is better than the in-restaurant experience.  The owners/managers whoever is on the floor always look worried or upset.  These problems should all be fixable since the food does have good flavor.  Hopefully they see this and make some changes.", "author": "Katyusha O."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}