{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-28", "description": "Cozy place, moderate prices. We had appetizer, good naan bread, coconut curry salmon, and chicken vindaloo - all good but vindaloo was extremely hot.  Service was non-existent. There were extended times when NO ONE was on the floor. Seated, order taken and took long time for food to come.  After appetizers we sat there for 20 minutes with a table full of dirty, empty plates and no waiter to be seen. When one came out of the kitchen I had to wave with both hands to get her to come over so I could ask her to remove the dirty dishes. She did but did not wipe the table that  had some sauce and bits of food on it. After another 15 minutes our food came. When we were done we asked for the check and waited 20 minutes. We finally calculated ourselves what the cost was, put cash on the table and walked out. Decent food but awful service - err, I mean \"no service\". Won't go back.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Never been to the actual restaurant, but I recently ordered food for delivery and was completely content. \n\nWe ordered the sag paneer, samosas, garlic naan and tandoori chicken. Everything was pretty dang tasty. Was it the best meal ever?- probably not, but I have no complaints and was really content with my meal. Even the leftovers maintained its good flavor and quality. We all know that doesn't always happen. \n\nAs my order was delivered, I can't speak to ambiance or in restaurant service, but from a delivery perspective- the food came in a timely fashion, as promised, and was accurate. This is winning from a delivery order perspective- trust me!", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-31", "description": "SHITTY ASS WAITER. Rude as hell and I asked her to pack my food and just because we were college student she said \"I'll give u boxes, pack it yourself\". Food was not bad but the service is disgusting, makes you not even want to be here or feel welcomed at all. TRASH", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-22", "description": "I'm going to state this up front--I didn't eat here. But honestly, given their service and horrendous prices, why would I?\n\nWe were excited to scope this place out for Dine in BK week. Upon getting there, we were promptly informed that no, they aren't participating in the deal for lunch--only dinner.\n\nCool, we thought. They're offering 25% off lunch. We'll stay.\n\nWe were ready to order in minutes, but ended up waiting 10-12 minutes because the woman decided not to take notice of us, despite trying to flag her down multiple times.\n\nPrior to ordering, we were informed rice was NOT included with any of the dishes. Um...what kind of Indian restaurant doesn't give you rice?! It was $6 for typical basmati. Outrageous.\n\nWe left, and at those prices and absurd policies, why would we stay? Avoid, unless you want overpriced nonsense.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-01", "description": "Pros - Ambience\nCons - Food is OK.. our server was a lady who was giving curt replies... she didn't care if we liked the food or not... we placed an order and in a minute we changed our mind to have something else instead and we requested to change our order which she curtly denied... if customer service and food is priority then wouldn't recommend to others", "author": "Viddhesh B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-21", "description": "I was quite disappointed... I had been so hungry and couldn't wait for my seamless order to arrive. Asya had a dinner special for $18 that included an appetizer, entree, rice, naan, mango chutney and raita. Sounded great to me!  \n\nMaybe I made the wrong selections but my appetizer was not even remotely good. I had ordered the aloo papri, which was described as potatoes, chickpeas and crispy wafers mixed with chutney. Bad idea to order this take out as it was completely soggy by the time it arrived and I couldn't eat more than a few bites.\n\nThen came my entree, the classic chicken tikka masala. It was not rich and creamy like I hoped but quite watery. Again, so disappointed! Everything was just a bit off with the meal. Very unfortunate.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "DO NOT GO TO THIS PLACE!! The service was pathetic and food was very bad. Moreover the manager doesn't know how to deal their customers. Try some other restaurant in the area if you are craving for indian food.", "author": "Sandeep B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Ordered Saag Paneer, Malai Kofta, and garlic Naan for pick up. Our order was ready quickly and the food was delicious. The Saag Paneer was heavier on the spinach flavor than most, and the Malai Kofta had great spice. We'd never heard of Malai Kofta before- I'm glad I tried it. The Naan is HUGE and thick! We have plenty of leftovers, so it seems like a good deal for the price. You could comfortably split an entree and order of Naan between two people.\n\nWhile we didn't eat there, the interior of the restaurant looks cozy, we'll definitely be back to dine in.", "author": "Adam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Best Indian food in Brooklyn Heights. Their quality and service stands out. I usually order deliveries from them and never had any issues. They're a bit more pricey than other neighborhood spots but totally worth it because they use fresh quality ingredients.", "author": "Cc W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "I went to this restaurant with my boyfriend yesterday. The experience was amazing!! The host, Antony was helpful he recommended the spicy lime rice to accompany our chicken korma option. The food was sooo tasty!! Good portions and well prices. I pride myself to be an indian food best friend and this restaurant has my approval. \n\nI do highly recommend the restaurant if you looking for a fun night out with your boo or family!!", "author": "Mwikali M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-07", "description": "tl;dr Worst experience I have ever had at a restaurant and the food was mediocre. \n\nMy friends came to visit me in the city and we decided to go out to dinner near downtown BK. This place wasn't our first choice but we all like Indian cuisine so we gave it a shot. \n\nI wish I had never walked into this place. We were seated and then moved because a larger party who had made a reservation was coming in. I didn't really mind that because we hadn't ordered yet. My 3 friends all ordered saag paneer, one of them wanted to add shrimp. The man who I assumed to be the manager told her that could not be done, but if they all wanted to pay for a full order of shrimp and split it, that would be fine??? This suggestion didn't make any sense to me when no one else expressed wanting shrimp. But my friend just let it go and accepted it. Our food comes and we only get one small bowl of rice to split among 4 grown women. Yet the table next to us who had 3 people received 2 bowls of rice. They were able to get us another bowl so again I let it go. The food was decent. They did not offer a spice level, which I normally get to choose at Indian places. \n\nHere's where it all goes downhill: We asked our waitress for separate checks. She tells us that they cannot do that, but if we write down each total she can charge our cards separately. So my friend takes the time to do the math, accounting for tax. The waitress then returns with our cards saying that they cannot run 4 cards at once. This was my breaking point. If they can do four separate orders, why can they not do separate cards? By this point I am angry, but my friends being better than I am, manage to pay in cash. The waitress then says that paying in cash is too complicated and that she'll need one of our help to ring it in? My friend returns after 10 minutes of helping this woman. Apparently my friend had to argue with her about getting correct change. On my credit card receipt I write \"horrible service\". Because that's what it was. \n\nWe finally leave, but as we're about to head to the train, the manager from before comes out and begins to YELL at me on the sidewalk outside. He was upset because I wrote horrible service on the receipt. After going back and forth with this man, I eventually walk away because this was ridiculous. He continues to yell at my friends and I as we walk away, vowing to never return to this place.", "author": "Talor B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "An amazing experience - Antony was an amazing host and we loved every moment of our dinner. Food was well priced, service was exceptional, and the atmosphere was inviting.\n\nI highly recommend this if you are looking for a fun date night or a great place to bring the whole family.", "author": "Conor S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Bad service and food.\nWe were 10 people and went there in happy hours which is 50% off everything. They said that in happy hours, quantity of the food is 50%!!!!!! Then what is the point of 50% off???? \nWe didn't get right order and right quantity and at the end we were charged for full price. We ended up paying a lot for little, below average food. \nService was terrible too. \nDisappointed!!!! \nWon't go again ever.", "author": "Rose P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "The only reason we walked in to this place was b/c Noodle Pudding was crowded \u0026 had a long wait..(will try Noodle Pudding again on a less busy night). We sat down \u0026 this short round bitchy looking lady (the only female out of the staff) approaches us, started to take our order. I asked if one of the entrees came with rice (like most Indian restaurants) she said (very aggressively by the way) \"No! Nothing, You have to order everything, separately\"..despite that nasty response, l go back to look at the menu again quickly while my boyfriend is ordering \u0026 in mid order she walks off..l look up at him \u0026 he's looking perplexed at the direction she went. I said \"what happened? Where did she go?\" He says \"I have no idea what just happened. That was weird\". More like rude. Then a few minutes later, the guy comes by our table (he seems like the manager or owner) he asks did you order?\" We both told him what happened \u0026 he looked annoyed \u0026 said \"Oh l will talk to her. I'll take your order\". I asked for what I originally picked (the one where that lady said it didn't come with anything) he tells me that it comes with rice \u0026 roti bread. I said \"oh! That woman told me it didn't come with anything \u0026 l had to order everything separately\" he looked annoyed again \u0026 shook his head. After taking our order he goes up to her \u0026 kind of yelled at her in their language \u0026 she got nasty back. I'm guessing he reprimanded her \u0026 rightfully so! Anyway the portions are very small for the price \u0026 we ordered 3 entrees along w/an app. We were told rice came with all our entree orders. We were given 1 medium bowl of that basmati rice not enough for 3 entrees. Not to mention after taking a few sips from my glass of water that that woman poured, my glass was dirty. They changed it though. We couldn't finish \u0026 one of the dishes was extremely spicy so my stomach started to feel funny, so we had everything left over wrapped up to take home \u0026 asked for a lil'more rice since it wasn't enough for all 3 entrees. He said yes. We got home, no extra rice. The restaurant had a nice interior though \u0026 it seemed like the guy tried to fix what that woman started, that's why the extra star.", "author": "Brooklyn A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "Horrible service, very rude, cold food , food came out 1 plate at a time.  Saw numerous patrons get up and leave after waiting for 15 min without being greeted !! Stay away!!! More focus around to go orders !!! Don't go to Asya!!!  Even asked for check 3 times to pay for this BAD experience !!!", "author": "becky w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "This tourist ate lunch here after working up a huge hunger after walking the bridge. \nSuper happy we chose this place because it was warm and cozy on a cold day...just what we needed!!\nI had no problems whatsoever with service, absolutely delightful... way attentive. \nOrdered several typical veggie things,,,samosas, saag, aloo gobi, eggplant, naan....all delicious and cheaper than anything we're used to. \n!! left happy !!", "author": "B S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "My sis and I were craving indian food and came right to Asya after class. \n\nWe ordered the Naan Keema, the best naan I've ever had! It has a nice lamb filling with just the right crust and consistency.  \nFor entrée we had Chicken Vindaloo and Lamb Kochin and both were pretty amazing! \nI am a spicy addict, and I would have to say the vindaloo was spicehh !  \n \nI would recommend Asya if you are in Brooklyn. \nAnd you gotta try their naan!! \nBest of all, you get 25% off during lunch hour", "author": "Aito M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "I usually look at yelp reviews before I eat somewhere and if I had they might have scared me away from this place but don't let them. The food was so good! And reasonably priced. My boyfriend ordered the Chicken Madura. He really liked it. I thought it was good but a little rich for me. I had the chicken tikka masala which was delicious. A side of rice was brought out to share which was fluffy and light. Both dishes were $14 each. We also ordered naan which was good but not sure it was worth paying for, seemed like it was something that should come with dinner. I'm glad we stumbled across this place. I will definitely return.", "author": "V M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Great food! Nice location. Service a little bit too straight. \nThey offer 50% off between 11.30 and 3pm. So very good price for the meal.", "author": "Matthias P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "This service is horrendous. I placed an order on seamless and I didn't get a confirmation email saying they had received my order. Then I called THREE times and here's a little play by play of what happened.\n\nCall one- they told me my order was on the way and when I asked what address it was going to, they hung up on me.\n\nCall two- the order they thought was mine was not; when I told them seamless had charged me they told me they closed 20 min ago and hung up on me.\n\nCall three- I called them back after receiving a text from seamless saying I would receive my food in 30-49 min. They said oh, oops. Then hung up on me.\n\nStill no food in sight.", "author": "Angela C."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}