{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "Asya has a lovely, relaxed and cosy atmosphere.  There are also nice tables by the windows which open out into the street.  Anthony, the waiter, was attentive with our order, but somewhere along the way there was a little mix up and our food was delayed.  They couldn't do enough to make amends and brought us complimentary beer while we waited and puri bread.  The puri bread was delicious and probably the best bit.  At the end of the meal Anthony even brought us a dessert on the house.  The food was nice but the service was the thing that made our evening.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-25", "description": "I usually order from here for delivery, but will no longer be a customer.  The food ranges from very good to very bad depending upon the chef that day.  I used to overlook a bad delivery, because when they were good, they were very good.  When I finally complained the gentleman told me my next order would be free, however, when I asked for my free order he denied the gesture  and was VERY rude and unappreciative of my twice weekly order of $85 each.  The inconsistent food and rude treatment made me give them one star.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-15", "description": "This restaurant says they close at 10:30pm, but they can refuse to serve you before then. My friend and I were in the area at 10pm, but because we knew they were closing at 10:30pm, we called to make sure that they would still serve us if we showed up within the next 10min. The girl who answered the phone said yes, so my friend and I walked over expecting to have a great Indian meal. We arrived at 10:10pm and a man quickly approached us to say they were closed even though there were still patrons in the restaurant eating. My friend mentioned he had already called and was told it would be fine if we stopped by. The man was adamant about closing and refused to seat us. Might be a good idea to work on some customer service skills. Even a small gesture such as offering to let us take out would have even been better than the very standoff-ish demeanour we got instead. Sad to say, but first impressions go along way. And even though the food might be good there, we won't be going back for a second attempt.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-07", "description": "The food is good. However, we have had some catastrophic delivery experiences on more than one occasion. They desperately need to get a new delivery person. One time they delivered food to wrong apartment. Another time the food was initially delivered to the wrong place and then the food delivered to us was not ours and finally on the third attempt they got it right. Visit in-person, but avoid delivery at all cost.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "This is a delivery review. \n\nService was quick (if not a bit brusk, the guy nearly threw my food at me). The food was excellent; hot and delicious. I ordered the combo and for $15 was given three chutneys, yogurt sauce, naan, two samosas, rice, and a large portion of chicken tikka masala. It would have been enough for two light eaters. The samosas (that were still crispy, not soggy) were served with chickpeas. I'll order from them again.", "author": "Emellia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "First time here a couple of weeks ago, and literally stumbled upon it with a friend.  Beautiful decor, lovely owner/manager, great service overall.\nDelicious food, shared the special shrimp and okra special with my friend (we both loved it), and my Chicken Saag was the best I've had in NY, just the right amount of spice, fresh and flavorful.\nHighly recommend and looking forward to my next meal there!", "author": "Norene M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "By far the best indian in brooklyn that i've had.. Usually i go to jackson diner for my indian fix but every time i come here i leave just as satisfied as i would making the shlep to Queens. I usually come here once a week or so with anywhere from 4-6 people and Anthony the waiter maybe owner is a great host. The Samosas are super fresh , the cauliflower app is great and the naan is always great as well! All the entrees i've had here are always right on point with spice and flavor. Great to finally have a good indian place close to home!", "author": "Ian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I'm a vegetarian and I have had various dishes here that are beyond exquisite. I recommend the malai kofta", "author": "Milan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "We stumbled in here after visiting Brooklyn and were so happy with the food and service. It happened to be happy hour, so we got three appetizers at half price instead of a meal. Everything we tried was hot and delicious. We'll definitely go back when in the area.", "author": "Season V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "This place is delicious! There are a lot of mediocre Indian restaurants in nyc, this is NOT one! Extremely flavorful execution of traditional dishes you'd expect. Great for delivery, but also a nice ambiance to go to. The people that work their are extremely friendly and sometimes throw in a complimentary dessert!", "author": "Arabella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-09", "description": "I do not recommend the \"sloppy pav.\" I ordered 2 of the vegetarian pavs for lunch time delivery. It did not come with masala chips or pickled ginger as indicated on the menu. It included a very small portion of stale potato chips. It also did not come with Jalapeño aioli as advertised. The portion is very tiny and extremely overpriced. I also detected no quinoa.  Lastly, the delivery person arrived with no money to make change. When I called to inquire about this, it was not handled well. \n\nAfter spending $14 (tax and tip) for lunch, I am still hungry.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-25", "description": "The food in this place was ok, the taste was diminished because it felt microwaved heated. The service is terrible. Granted it was a Sunday afternoon. Our waitress was slow, rude and automatically charge 20% service for a table of 3. When I asked her for our change, she kept pretending not to hear me. When I explained that I'd like to decide the tip amount, that as far as I understood tip was suggested, she got mad and said that in that restaurant they didn't have laws. There are lots of better options in the area.", "author": "Angela F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-21", "description": "The food was just okay, I felt the portions were very small and we were given one rice to share between the two of us.  We had gone all the way down Henry street to this restaurant because we had a $15 off coupon through Scoutmob, and it took the waitress 3 tries to ring up our credit cards properly.  The appetizers we had - vegetable samosas - were dry, and didn't come with sauce.  We asked for dipping sauces and were given a tiny little bit that was barely enough for one person.  I wouldn't come back here again.", "author": "Lori S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "Really nice atmosphere, great for a date. And, of course, very tasty food. I'm so full, but now that I'm home I'm craving more!\n\nWhat really brings this to the 5-star rating though is the service. Both times I've been there the manager has done whatever he can to make us happy. Tonight I went there and ordered a chicken vindaloo. The waitress warned me that it was spicy (to which I said, 'no problem') but I didn't realize just how spicy it was. When she cleared the table she noticed I barely ate it. I told her it was much spicier than I expected. Then, minutes later, the manager came to our table and told me he was going to give me a chicken tikka masalla and rice to go, free of charge. So, now I have lunch tomorrow!\n\nAll in all, a great place. I recommend!", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "When hear with an old friend. The ambiance is very nice. Beutiful Indian artwork here. I had a sppinish and lamb dish, some type of delicious califlower(very different) and tasty. I also had the mango lassi.... so good.... will most definitely be back here..Itd be a nice date place too. Staff were very hospitable as well.", "author": "Krystal F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "Decent place for Indian food, but a bit pricey for lunch. We had the tikiyas to start, which I wouldn't recommend unfortunately since the flavor was a bit overpowering. For entrees we had chicken tikka masala, bread, coconut rice and crab curry. The sauce for the tikka masala was quite tasty and the crab curry had a lot of flavor. The coconut rice was not too sweet and went well with the crab. Overall a good meal and probably the best in the area for Indian, but I still may stick to Little India or Curry Hill for my Indian cravings in the future.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-23", "description": "This is not so much as a negative review as a piece of constructive criticism.  We have been a number of times as we really love ndian food.  The decor is gorgeous and food is good but the woman who is the host is just so aloof and cold.  No friendliness, or acknowledgement that we are regulars.  \nHowever, the  young guy who brings the food to the table is full of personality and fun and friendly.  My advice, swap them round and the atmosphere will completely change.  Sorry, don't need the long face after a long week!", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Really good Indian food. Pre-fixe special is great and the choices are abundant. If dining in, the owners will usually custom make dishes, depending (Aloo Matar was not on the menu and they had no problem accommodating).\n\nA great [flavor] break from the norm in BK Heights!", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-02", "description": "The food was good but the service was horrendous!  The female manager/ hostess was RUDE! The sign outside reads 50% off and I ordered to takeout. The bill comes at full price over (17 dollars) and she tells me that its half price only for dine in and she can't refund my credit card because they started cooking the food. Almost 18 dollars for lunch for a dish with no sides ,is a little pricey. So I told her I would dine in with my sweaty workout clothes on. After I ate the bill came and she said no CC for under 10 bucks. (There is no sign in the door or on the menu). Told her I had no wallet because I went for a run only CC. She started huffing and puffing. I left no tip.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Appetizer: Samosas. Excellent, crispy and alive with flavor.\nEntree: Bhartha. Unbelievable, perfect seasoning. Without a doubt the best way to eat eggplant. \nDessert: Jalebis with Rabri. I trusted our host with this selection and was completely satisfied. The Jalebis were sweet and crunchy and the Rabri was creamy, with full hints of saffron.\nI hope to go again soon.", "author": "Mauricio A."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}