{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "At long last a great Indian restaurant comes to Brooklyn Heights.\nThe food is delicious,  very freshly prepared dishes that are graciously served.\nAsya is a great addition to our neighborhood, give it a try you won't be disappointed.", "author": "Diane J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "If I could give this place 10 negative stars I would. I used to wait tables and bartend and understand how much work the restaurant business is. By far THE WORST service I've ever had. We arrived here a bit late, and they wanted us to go ahead and order while waiting to be seated. That's fine. I understand. I told him I wanted soup as my entree, and he told me I couldn't have it that way. I could only have it as an app. Repeated myself, he looked down and ignored me and proceeded to bring it as my app. We then asked for two glasses if hot water with lemon. He said no. \"We don't do that here.\" Who says no to hot water???? They didn't get us two of out orders and still tried to charge us. The manager was absolutely awful!!! I've never hated anyone, but he definitely came close!!!", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-20", "description": "I'm so surprised this place got rated so highly. I ordered through seamless. The sauce for the Chicken Tikka Masala was watery and the chicken was dry. The Saag Paneer was so bad I couldn't even eat it; the cheese was tough and browned. The Naan was tough but edible. \n\nThe delivery guy was nice at least.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-12", "description": "I came here with 3 ladyfriends after a very frigid viewing of the Festival of Lights in DUMBO. Didn't read the reviews but saw that they had an overall rating close to 4 stars and were a little bit away from the crowds. My mistake. Most of the recent reviews were under 3 and now I see why.\n\nThey told us it would be a 10-15 minute wait, but by the time I turned around to wait by the door, the host had changed his mind and was now seating my friend. Huh, ok.\n\nWe sat down, perused our menus and ended up ordering 4 different kinds of chicken dishes (I would normally get paneer or lamb, but when in Rome and sharing chicken...), along with garlic naan and Bhel Puri. The bhel puri was fine and fairly spicy. They brought out the naan with our main courses and gave us regular naan, not garlic like we had ordered. They also brought 3 out of 4 dishes (and rice), so my one friend had to wait for hers. And wait. And wait. A server finally told us it would be out of the kitchen soon, but did not apologize. 20 minutes after the rest of our food had arrived, they finally brought out her Chicken Korma. We needed more rice at this point, which they charged us for. Then they took away the rest of our first rice before they delivered the new bowl. Water refills were slow, which was a nuisance with my vindaloo dish. Prices are a little high (eh, this is Brooklyn Heights) for the smaller portions, but taste and consistency was great overall.\n\nWe finally all got to eat (since we were sharing a bit, my friend did not starve). Then the bill came, with a 20% autogratuity. I've never gotten an autograt for a party under 6, much less one for 20%. The service was so poor overall that this might have been one of those rare times that I wasn't going to tip 20%, too. But I guess they knew that. Then there was a 2-card limit on using credit cards to split the bill. OK, fine, 2 people paid the other 2 of us and we split it evenly. We just wanted to get out of here quickly, but then we were delayed further by how long they took with our cards. It's really hard to flag down servers here, they seem to be pretty good at ignoring you (and not apologizing for ridiculous delays).\n\nIt did seem like they had a fairly brisk, well-organized delivery business (and their website points to this as well), so maybe you're better off staying at home and ordering in.", "author": "Hilary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "I have been sorely disappointed by the other Indian places in the Heights so far. Thankfully, I tried Asya last night and it is PERFECT. I walked in and placed an order to go, and the waiter helping me (who looked like Aladdin, which is obviously a MAJOR plus) brought me water while I waited. The waiters are very helpful and nice, and not in the typical overbearing Indian restaurant way. The decor is chic and clean--a perfect mix between modern NY with a hit of India. \n\nI ordered chicken vindaloo and naan, and they were delicious. The naan is standard, but the vindaloo was by far the best I've had. Plus? The portions are huge--They gave me so much that I have a ton left over. \n\nIN SHORT:\n-chic, comfy interior\n-delicious food (and half price lunch every day!)\n-great service\n-sexy waiter/host who looks like Aladdin", "author": "Emily H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-25", "description": "This place advertises... 5 days a week mind you... for 1/2 off lunch special. I went in yesterday and discovered they give you 1/2 a portions at half price! \n\n4 piece Chicken Malai Kabob, $8 app at night is a 2 piece Chicken kabob for $4 during the day.  I tried to explain to the manager that this is false advertising and to bring me full portions. They refused.", "author": "william p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Came to this unfamiliar neighborhood of Brooklyn to be pleasantly surprised by this little Indian Joint just a few blocks from the Station.\n\nThe gang (about 10 of us) came on a Saturday night and fortunately we were able to fit in the little place.  Service was top-notch as staff constantly refilled drinks and catered to our requests for more Nan and rice.\n\nWe ordered lots of sauces but the Chicken Tikki Masala was by far the best.\nThe shrimp sauce (don't recall the name) was also quite good.\n\nIf I'm ever around this hood of BK, I definitely will return!", "author": "Susan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "There is only one thing that ruins a decent meal more than when the server tries to cheat the customer on the check. And that is LYING about it. Tonight was a perfect storm of lying and cheating by the lone female server who would not give me her name. If ASYA is (hopefully) reading this, they will know who she is. First, after I paid the check, no one came back with my change, from which I would have left the tip. Could this have been an oversight? Of course. So I gave her the benefit of the doubt and, after about 10 minutes of waiting, simply asked for my change. She brought it and when I went to use some of it for the tip, I noticed that it was NOT all there. I called her over and told her, to which she replied, \"oh, that's OK.\" Again, thinking she may have misunderstood, I said \"no, it's not OK to give me substantially less than the correct amount.\" Then she thought for a moment and said, \"well, I didn't charge you for the rice. That's when I completely realized that this was a purposeful and rehearsed scam since the cup of simple white rice is included with the meal. I said that that was not true and now I want my change. She went back and brought it to me...all in nickels and dimes...surely no accident, again. I left but decided to call back and speak with the manager to tell him how unhappy I was to be so blatantly lied to and cheated in our neighborhood restaurant. Unfortunately, she answered the phone. I said, \"may I speak to the manager?\" She said, \"what are you calling about?\" I said, \"I'm calling to speak to the manager\" (who, by the way, I knew was there). She said, He's not here.\" I said, \"when will he be back?\" She told me she didn't know. I asked again and this time, after a long pause, she said, \"he's on vacation.\" I said, \"no problem, when will he return?\" She said, uh...uh...uh...about two months.\" Then I told her that I was just in there and when I called just now to speak to the manager, I was simply going to complain to him about what happened and what she did. But now, I told her, I am going directly home to write a review. She became very flustered and said, \"no, no, no...just come back tomorrow and I will give you a free lunch.\" I told her that would not be necessary as I will be writing this on TripAdvisor and anywhere else I can impart this information. Do with it as you please. I felt it important to pass it on. Clearly I, and my family will not be going back again.", "author": "Jack H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Being a big fan of good Indian restaurants,  I'm always skeptical about trying new ones.   More likely than not I'm disappointed.   But Asya was a very pleasant surprise.   The staff was helpful and friendly and more importantly, the food was excellent.   We had the Chicken Tikka Masala, the Lamb Cochin and the Peas Pulao, and everything was perfect.   In addition, they had a reasonable wine list.   We had a nice French Bordeaux for $40, that complemented the food perfectly.   And the meal ended with a nice touch when the manager gave us a tasty Gajar ki Kheer (carrot \u0026 rice pudding) on the house. \n\nOne minor criticism, I would have liked to have seen some vegetable side dishes on the menu.\n\nA return visit is definitely in the near future.", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "We just ordered from Asya after a long hiatus. Not sure why. I guess I've had some digestive issues. But last night's meal was phenomenal. Just the right amount of heat, and special flavors, and lots of condiments, all beyond delicious. Will be dropping by again,and will not hesitate to order delivery again in the near future. BTW when we eat in, it has always been a pleasant sit and surroundings.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-28", "description": "Extremely pathetic customer service.  The person is very rude and asked for cash and asked everyone to forcefully order atleast one thing", "author": "Lets M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "The food is good! BUT they're running a scam.\n\nMy boss and I looked at the menu on their website: http://asyany.com/ which says 50% off Lunch (in-house only). That sounded like such a great deal and we were in the mood for Indian food so we headed over there.\n\nAfter we ordered and finished eating, the waiter brought over our check which listed everything at full price. My boss asked about the lunch special and the waiter gave a long-winded reply about how food prices have gone up and the restaurant was reconsidering the lunch special, I believe he said they were trying to decide whether or not to alter the lunch discount to 25%, and that the lunch special was currently 'on hold'. We replied that the only reason we came to the restaurant was for the lunch special that was advertised on the site--they must have to honor it, no? Well according to the waiter, no they weren't honoring it. And they also weren't giving the 25% discount either. He said that because they didn't put the board outside we should have known there was no lunch special that day--perhaps we should come back tomorrow, they might have it then.\n\nI regret not refusing to pay due to their false advertising. Moral of the story: always ask about lunch specials BEFORE ordering.", "author": "K L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-01", "description": "The food is tasty BUT overpriced, and I have received consistently poor service both in the restaurant and with delivery. Trying the lunch special on a day the restaurant was empty, I experienced a long wait time for my lunch, a forgotten beverage, and half the typical serving size for the \"50% off\" lunch special. That's not a lunch special, that's just smaller portions for a smaller price! The last time I ordered delivery, I waited 70 minutes for my order, and had to call twice to prompt any responsiveness. And as mentioned, the food is overpriced -- $14 for an entree with rice. I am giving up on this place.", "author": "Kara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Yes, it's better than Curry Heights (duh!). The quality of their corma is on par with some of the better indian restaurants in the East Village, while the Maharaja is just awesome (cashew sauce). The dinner prix fixe at $15 is a sick deal if you want to eat out on the cheap.\n\nCourteous staff, consistently good food - you can't ask for more around here. Ambiance-wise, it looks like they had Olde Good Things design their interior, but whatever. I'll take oppressive over tacky, which is what most Indian restaurants seem to be these days.\n\nBest of all, they have a website you can directly order from. No reason to go through Seamless, and no reason to speak to a soul when ordering your food.", "author": "Nicolay S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-27", "description": "This guy selects who he wants to serve. He is not serving to people who look like Indians. We entered to this restaurant and ask do you have a waiting time. He said we are full now, but there were couple of tables available. It was evident that he didnt was to serve us. By reading previous reviews on this restaurant after this experience, I assume he thought we are Indians (but we are not).", "author": "Sujan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Food was tasty, was nice sitting by open window, but service not friendly at all.  Never made to feel welcome.", "author": "R Dale S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "Ordered take out from this new place.  We did chicken saag and \"Malai Kofta\".  Both were great, but the latter we had never heard of, and we both loved it.  Garlic naan was par for the course (which is great...never met a garlic naan I didn't care for).\n\nI strongly recommend you give this place a try!  Just a bummer they won't deliver to my neighborhood :(", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "I have never been treated so rudely by an establishment in my life.  Last Saturday, my cousin and I decided to grab dinner at one of the local restaurants in the Heights.  We settled on Asya, as it is fairly new to the neighborhood - my family has lived on the next block for about two decades.  \n          Upon entering the restaurant, we observed that it was completely empty, save for a small family at a table to the right.  The restaurant had no other patrons, and had several empty tables of various sizes.  The manager/host saw us come in - he was facing the entryway - but he never acknowledged us, not even to greet us or tell us to give him a minute.  After a minute of awkwardly standing in the entry, we decided to seat ourselves figuring the host was simply unfriendly and the establishment preferred that patrons find their own seating during slow hours.\n          My cousin and I decided on a table made up of two two-tops along the long bench seating that lines the left side of the restaurant.  Despite having never said a single word to us, the manager/host rushed over, giving no greeting, and nastily said to us, \"You can't sit here.  You need to sit there.\"  He pointed at the two-top table directly next to us.  Since the tables were all split as two seaters or four seaters at random, and our table was simply a two seater joined together, I asked him, \"May we just move the extra table over a couple of feet so that this seats two and the one beside us becomes a four?\"  He angrily responded \"NO - there's a reservation,\" and he walked away without a backwards glance.\n          My cousin and I looked around at the empty restaurant with numerous empty tables of various sizes, and we decided that we would eat elsewhere.  He was the only employee at the front of the house, and he had been extremely inhospitable and rude to us.  I have never been treated so nastily by an establishment in my life.  I live on the very next block; however, I will never ever go back to eat there again, and I would not recommend anyone to do so either.  I cannot imagine how this place manages to stay open when this is the way they treat their clientele.  If you enjoy poor service and inhospitable proprietors, this is the place for you.", "author": "Elle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Very good food. Decent service in restaurant. Ordering on Seemless takes avg of 90 min. Sometimes 1 hour during week. Usually 2 hours on weekend.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-15", "description": "Just ordered food for delivery. I received it cold and for the amount being spent it is a small portion and the food isn't that great. Really disappointed.", "author": "Shomari S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}