{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "While it was deserted inside at 9pm on a frigid Wednesday, the food was delicious and the service was very warm and friendly. Great samosas, naan, chicken tikka masala, and lamb saag. I can't think of a single thing to gripe about. Thus, 5 stars.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "The food is very good. Unfortunately, that is about where it ends. A dine-in lunch took over an hour because of nonexistent service. It took about fifteen minutes just to place the order, which then arrived in parts and we had to ask for the raita, which came pretty much as we were finishing up the food. Very disappointing, as everyone else in the restaurant was complaining of lacking service. When the bill finally came, it was incorrect and needed to be reprinted. We have ordered takeout before, which was fine, although it also takes a while. Will not be back to dine in.", "author": "Wackydream M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Ordered online a few times. Great online system, and introductory discounts. \n\nThe tikka masala main and samosas are wonderful.\n\nHighly recommend this place!", "author": "Claire W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "My friends and I was very hungry so we could eat anything and anything will taste good kind of mood. But when we sat down there was no body helping us for about 5 min and there was only 3 other tables with customers. And i asked about charging my phone and manager kind of looking guy just pointed where i can charge my phone.. no words...\nand when we order some foods, my waitress asked me if i want a naan, so i said yes, this is when everything started..\nFood was not that great but we ate cuz again we were super hungry..\nAfter we finished everything, waitress gave us a check she charged me or gave me naan platter or something which was about $15. we were very surprised about how much we got charged.. \nWe explained what happened, But ended up paying everything.. except for the very small portion of rice they gave us for complimentary..\nWorst experience ever!!!\nI do not write or give this kind ofbad review but they deserved it.. Never ever going back", "author": "Julia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "The man who was waiting on us weird and kinda rude. Their wine tasted like lemonade made from Indian tap water and the food was average.", "author": "Yogesh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Best service in town - one of a kind food!!!\n\nYesterday evening, I was looking for a cozy Indian restaurant to have dinner with my girlfriend. Asya met all expectations!\n\nAnthony, the manager welcomed us and took care of us throughout the evening in an exceptional way.\n\nI have to recommend the grilled shrimps as a starter. Afterwards we had some delicious tandoori chicken and an amazing chicken curry.", "author": "Tilo K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "Nice ambiance, but I've only been happy with my order once here.  The chicken tikka masala is very tasty, but they give you too little rice, they're a tad overpriced for the quality of food here, and all of the other dishes I've tried here have been just edible or too disgusting to finish (korma dishes , spinach dishes, etc)\n\nI want to like this place because it's so nice inside and the location is super convenient for me..... But I can't :(", "author": "Christine P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "Overly priced restaurant, considering the quality and quantity of food.", "author": "Piyush C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "By far the best Indian food in Brooklyn Heights, probably in all of Brooklyn and maybe in all of NYC!  The menu has all of the standards you'd expect and some great specials.  Everything we've ordered tastes great and the food is consistently great.  The service is top notch thanks to Anthony, who is very attentive to every need.  The place is clean and quaint and very welcoming.  Favorites are the Cauliflower Manchurian and Balchau Shrimp.  \n\nIf you're in the area and looking for great food, check out Asya!", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Went last night on a Groupon.  The ambiance was very nice, and it wasn't crowded; we got a table by the window right away.  The decor is a mix of some Indian-themed things and old colonial style that actually mixed well with the music a-la Buddha Bar lounge.\n\nThe service was attentive but not overly so; of course the two most expensive items on the menu (rack of lamb and whole red snapper) were not a part of a Groupon, but everything else was (nice touch -- I like it when a restaurant lets you sample their normal menu instead of creating a special limited Groupon menu).\n\nSo, we ordered: \n\nAppetizer: Combination Platter, Aloo Papri\nEntrees: Chicken Makhani, Mixed Grill.\n2 glasses of wine were part of the deal -- they never said what kind of wine it was, just \"red\" or \"white\" -- which would've been ok for a typical cheap Indian place in the city, but this seemed upscale...\n\nEverything was fresh and flavorful.  I'd probably say that the food didn't seem quite as authentic as some places in East Village, but a good solid experience overall -- although a bit on a pricey side.  Will def get another Groupon for this place, but probably not worth it otherwise (our dinner would've cost us $80 for 2 -- before tip).  The manager mentioned their lunch special -- everything was 50% off -- may try that!", "author": "Elena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "Pathetic service. We entered at around 6pm and ordered snacks. Our order was rejected saying they only take full dinner orders only. Would never set foot again.", "author": "Hardik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "I had a wonderful dinner last night all by myself...very comfortable place to eat alone, the food was great, and the service more than exceptional. I'll definitely go back.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "Oh boy n how Asya has changed the 2nd time we 'tried' having a dinner here. We were shown the door by a rude guy saying it was all reserved, whereas only 3 tables were occupied, no 'Reserved' tag on remaing tables...they were all empty. We were ready to wait  for an hour or more if thats the case since we had a good time before and were keen to have our parents from India to dine here. Asked him to write down our name, he said he cant do that since hes not sure when will  the reservations end and kept saying its all reserved. We checked online and it clearly showed us 3 empty slots for the same time we were there.\nIt was a clear case of discrimination, maybe Asya has raised its standards and we Indians dont fit in....So guys, just skip this one....theres Grimaldi, Juliano n even Curry heights for that matter. You dont want to be treated like shit here!", "author": "Indraneel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "DO NOT ORDER FROM THIS RESTAURANT. The food arrived late, cold and missing items. I called the restaurant and the management was incredibly rude and condescending. I was told that I was wrong - the food was not cold and they admitted to not including the sauce in on the menu but STILL refused to do anything. Do not order from here. There are way too many decent Indian restaurants nearby to order from this place. I will be ordering from Kinara's Indian Food from now on.", "author": "Collin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Stopped here for an early dinner recently, and the food and service were great! Prices were very reasonable as well. For apps, try the onion bhujia. For entrees, try the chicken tikka masala, chicken korma or chana saag.", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "great atmosphere and location! Food was great, they got the spice level right on everything I ordered. the restaurant was full, which I always find a good sign when trying a new place out. I highly recommend the pakoras!", "author": "Brianna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-27", "description": "Horrible experience.  My wife and i walked in and sat down just now during lunch hours which is cash only. My wife wanted chai and i just wanted a snack. They don't have chai! When i ordered one bhel poori the woman with glasses said \"I can't let you sit here for one dish. You have to order at least 2 entrees.\" We left in shock. Have never experienced such rude service at a restaurant anywhere in the world. And have been to NY many many times and eaten at numerous Indian restaurants. STAY AWAY !", "author": "Deepak K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "Great place to order from on Seamless! Made it to me in Dumbo in under 15 minutes, kinda scary fast. I went with the Chicken Tiki after reading the Yelp reviews and it is delish although I do think I am a vindaloo girl at heart. I like a little edge to my chicken. They have a 20% off deal right now which makes tipping like free!", "author": "Maddy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "Oh, this place?  It's the best indian restaurant in bk heights proper. \n\nI got taken here on a date who brought a handy group-on code.  We were allowed two glasses of wine, two entrees and an appetizer.  Plus that, we enjoyed the lovely atmosphere: decadent, quiet, romantic.  The service was curt, but not too bad.  I would expect as much with a group-on code.  So ... worth it and glad I went!  \n\nThe food was tasty-- but not the best indian food I've ever had in my life.  We ordered only vegetarian dishes (which had a lot of choice) and since my date doesn't eat cheese (shh, I know) we didn't order anything with paneer.  I feel like the food didn't pack the indian flavors I love the most: garlic, curry, turmeric.  It was \"Indian Lite\" flavors... so if you are new to the cuisine then this is the place for you.\n\nI love that's it's up the block from me, though-- so I'll definitely go back and try more items with friends.  It's such a lovely place to just be in and eat in.", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Ate here in a party of six on a Friday night with a reservation-- table was ready and waiting for us when we arrived. Each of us ordered a different entree-- saagwallas, tikka masalas, curries-- all were wonderful. The crispy okra was MAGNIFICENT-- bast okra dish I have ever eaten-- no sliminess whatsoever, and an amazing combo of flavors.\n\nIgnore the carryout negative reviews if you plan to eat onsite-- place is pretty and very satisfying.", "author": "Lou Ann B."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}