{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "Went here for lunch and ordered a tilapia dish -- what came out was day-old fish pakora (not even the correct fish) re-fried and dropped in an underwhelming melange of curries. \n\nAlso, I fail to see why rice should ever be so expensive.", "author": "Varun G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "I love this Indian restaurant. It's super authentic and always good. I order the chicken curry or chicken Tikka masala. The samosas and naan are good too!", "author": "Nathalie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "The food quality and quantity is great here! It is one of the best indian food restaurants I have been too. I have tried 6 different chicken curries, the mango lassi and rice pudding, and they all incredibly delicious. The curries are amazing, filling, and come nicely presented in a metal bowl, along with rice presented similarly. The atmosphere is nice and relaxing making it great for many occasions including dates or family outings (at least this is why I have been here multiple times and it was always great). The staff is very nice and responding, and the orders come quite fast even for the ones in a hurry, although you are not rushed during your meal. The classic on the house appetizers are great as well, with these two tasty sauces.", "author": "Denis T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I love Asya, I'm surprised at the mediocre reviews.  The food is good to excellent, the location is great, the service is great, the prices are reasonable and it's super cute! I especially recommend hitting it during the day when the entrees are half priced!", "author": "nina r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-05", "description": "Walked in and the place has a funny smell. Its not actually an Indian restaurant its Bangladeshi. Bangladesh has its own history and culture so I think they should be proud of it and not masquerade as an Indian.\n\nThe one member of staff present, a short rotund lady was miserable. No interest at all in customers or customer service. The biriyani is just meat and rice, not a proper dum biriyani.\n\nNever again.", "author": "Victor A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "DO NOT go here if you expect good service. We went there during lunch time, as soon as we entered into the restaurant the host looked at as we were non existent and didn't even bother to say \"hello\". It took almost 10 mins to get water even though there was only one family besides ours. \nFood quality was decent but the dish portions were very small.", "author": "Amit G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Mango lassa, Achari tandoori mushrooms, Ragra Chaat (chick pea and potato cutlet), lamb vindaloo and crab curry for lunch today. All excellent! I'm coming back soon, even if the 50% lunch promotion is over.\n\nQuiet atmosphere, excellent service, so I'll come for full price dinner too, and check out the other enticing dishes on the menu.", "author": "Robert. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Really awesome place, I didn't go through the previous reviews as to why this spot only has a three star rating. But my partner and I went here for lunch, everything was 50% off for their lunch special so the two of us ate an order of naan and paratha, she got the chicken tikka and I the jalfrezi, we also shared an order of rice. This was enough food to take home and get one more meal out of, and next time we probably wouldn't have ordered the naan and the paratha but instead just one, and maybe an appetizer instead. Great lunch prices (especially considering the location), great food, and the waiter asked us about our day and we connected on our interest in cycling =D", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "Food was awful, but even worse than that I topped $3 on a $18 meal (17% tip) and when I checked my credit card they gave themselves a $7 tip! Scums. I will never go back here.", "author": "Josh R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "My family and I just had lunch at this lovely spot and everything was spot on . The few vegetarian dishes we ordered were delicious and well seasoned . Food arrived very quick . The waitress serving us Sita , was super sweet , kind and friendly. As soon as we ordered she brought a mango lassi for our toddler , which he loved ! \nThe decor is really beautiful and they were playing rice soothing and relaxing music . \nWe will definitely be back :)", "author": "Aleksandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-09", "description": "I have such mixed feelings on this place, and really wish the owners would take in all the reviews, because it seems like there is one particular recurring problem, for me and others. Service here is really a hit or a miss...but mostly miss.\n\nI have been ordering takeout here for four years, and the food is really good, traditional, filling indian. I can't say much about there dine in experience, because we avoid it...the times we've been it's left a really bad taste in our mouths. Even doing takeout can be frustrating, as half the time it seems as if the managers are annoyed.  Occasionally, as regular orderers, we will request extra rice or sauce, and the requests are always ignored (charge or not). It's a shame, because their food is great and the interior is lovely but service is what most NYers base their experience on. \n\nSo, while they work out some major kinks in their customer service, I will stick to delivery, and just enjoy the yummy food :)", "author": "Una H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "I stopped by for \"The $8 Lunch Special (11:30-3pm),\" which is advertised in ALL of their takeout menus... I waited a bit to give a to-go order, then was told they don't offer the special at all, they suggest \"the prix fixe\" at $19 which \"is very similar.\"\n\nI walked out. A bit of false advertising or a bait \u0026 switch...not cool.", "author": "John C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-22", "description": "Their lunch deal is a bluff. They will say 50% off but you have to pay in cash and you also get half serving for the half price so I don't really know whats good about the deal. The food is below average for the price.", "author": "Ferdous A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "We were looking for a a great place to eat and we found it!!!!  So good, I recommend the garlic nan. If you love authentic, fresh and hot Indian food, this is the one. Small and quaint with the best service I have ever experienced.   Thank you", "author": "Gary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Love this place.  Excellent, authentic food, great full bar, and good cocktails.  Service is top notch, and great location in Brooklyn Heights.", "author": "Jeremy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "Amazingly good Indian food. Don't be fooled by the rating or poor reviews. Service was great when I stopped in by myself for lunch. And the full menu is half off right now during lunch, which you can't beat. Had their authentic curry with chicken. Highly recommend that dish but would happily try others as well. Wish I lived here to come back.", "author": "Rachel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Asya is such an amazing place to dine. The seating is incredibly comfortable and the doors are open during the summer for a nice breeze. I've had a lot of Indian food in my day, and this is my absolute favorite Indian restaurant. The chicken tikka masala is to die for - the spices will warm your throat and your belly. The cold and refreshing Aloo Papri and the shrimp appetizer are must haves as well. The staff is incredibly hospitable, warm, and kind. I can't say enough good things about this restaurant!", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Manchurian Cauliflower. \n\nThat's what they call their best dish. What it really is? General Tso's Cauliflower. And it's as good as you'd think. It tastes like syrupy, Americanized Chinese takeout, but without the factory-farmed, over-breaded chicken.\n\nUnfortunately, the rest of the actual Indian food has fallen off in consistency, but I still order from Asya sometimes because of the Manchurian Cauliflower. And because the garlic naan is still garlicky and naany.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "This is a local restaurant for us.  It deserves a visit whether you are near or far.  They have had their ups and downs during the past several years, but with the new manager, Ali, there has been continuous excellence in food and service.  In addition to having meals in the restaurant, we have also taken food to go a couple of times recently - and all was wonderful.  Try it - you'll be glad you did.", "author": "Rick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "This place has authentic Indian food. The service is great here, the food is great, and the atmosphere is great.", "author": "Charles Y."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}