{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-21", "description": "I was very disappointed by this restaurant, despite the fact that Indian food is my favorite cuisine. \n\nI like the decor of the place and the servers are very friendly. But my positive notes end there. \n\nThe rice was inedible because the mustard seeds were burnt. So, it tasted was like I was shoveling charcoal into my mouth. And I've had a lot of tandoori in my life and so I know that the tandoori platter did not have to be as burnt as it was. Not only does it taste bad, it's carcinogenic!  \n\nThe bread was so-so, the raita blah, and the two appetizers we ordered didn't taste good enough to justify how rich they were. \n\nThis restaurant needs to employ a better chef and find better cooking methods. And get some healthier choices on the menu. \n\nFor the price, and it's not cheap, this was definitely not worth it.", "author": "James M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "A wonderful experience of Indian Cuisine in Brooklyn from  great service to phenomenal spice enriched dishes. Coming back again very soon.", "author": "Arlene F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Food was good, both veg and non-veg. Quantify is also good . Only problem was we had to pay cash which is not mentioned on yelp and restro site . \nMust try :\nChicken stuffed mutton \nMalai kofta\nPrefer bread basket \nChicken biryani was awesome", "author": "Sushant D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Food was yumm .. Place was small.. So recommend visiting post .. Walkable distance from brooklyn br.. Definitely a thumbs up", "author": "Nikhil R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "I don't have a negative rating.. So am forced to give 1. Worst service ever in my life.. Ok, let us assume that I looked horrible or my looked bad, but I have never been like this anywhere in America.. Where everyone greets others friendly.. This Indian guy was such a racist, especially to Indians\n\nAs soon as we enter, he says - no snacks only place.. As soon as we order, he (the server or the owner) asks if that's it.. I said yes for now, if required I'll order later.. He says \"I know you won't order further\" with a irritating face.. \n\nPlease check others reviews too..", "author": "JustA C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Anthony the manager know just what you want and what pairs with it.  He was amazing in his hospitality to traveling tourists.  The food was authentic and just what we wanted before we knew what we wanted.  The drinks were original and the mango one was the best.  Several different kinds of rice.  Just the best!!!!\n\nThanks Anthony", "author": "Keith H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "My family and I ate here Saturday evening.  Things were fine despite the luke-warm reception to our asking to be seated.  Shortly after we placed our order we were asked to move to accommodate a larger party.  We refused then saw the restaurant staff immediately seat the larger party towards the back.  What was the point of asking us to move in the first place if they had tables available!!!  The service only got worse as one of four dishes arrived.  When I asked about the rest of the food, the waitress put her hand up and walked away (SUPER RUDE).  The remainder of our food arrived ten minutes later but not before I noticed several take-out order go out the door.  The first dish that arrived was now cold by the time the remainder of food arrived.  By then we just wanted to pack up and leave at which point they dropped a few take-out containers on the table so we could self pack.  Safe to say, we won't return for the bad service and so so food.  Oh, and we'll be sure to tell all the folks in the neighborhood not to go too!!!", "author": "J K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "Have eaten here before but recently had a bad experience and will not be going back. The food is good, but they stopped offering any wine but cheap Frontera jug wine. Why they would stop offering a full wine list and instead make you drink that swill with your dinner is beyond me. So I brought my own bottle and the woman refused to cork it. And then demanded $20. So my wife and I walked out. The guy that runs the place is very nice, but she is a different story.", "author": "John G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "The food was good, although I believe the waiter didn't understand my allergies. So many choices and I would come back again!", "author": "Anne M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "The waiter's of this restaurant were fucking rude, unprofessional, and talked like monkey. They didn't like and even welcome us to the restaurant. The dishes were like shit and they took 45 minute to prepared. Don't come to this bullshit restaurant.", "author": "Riad M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Really flavorful, delicious food and Anthony is such a delightful host. He knew the menu inside and out and has great recommendations about what dishes would go well together. My faves were the tandoori prawn, yellow daal, and Manchurian shrimp appetizer - but everything we had was delish.", "author": "Laura L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "Wow, what a dump. If you want to make friends with some cockroaches then this is the place for you. Enjoy them crawling by as you dig into what you thought was your shrimp sagwala and come to realize after the first bite that you have been served chicken that you have not eaten since you were a toddler. Was there an apology? No. Did they offer to take anything off the bill No. Will not come ever again or recommend to anyone.", "author": "Victor A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "Found this restaurant while starting out on the Brooklyn bridge and DUMBO trip. \n  Food - Just ordered for samosas to go. The chutney was really bad and is best avoided.\n\n Ambience - Surely looked like a nice place. Dont mind trying the place again.", "author": "Dipak S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "We walked from Brooklyn bridge to this place, quite close. Appetizers were decent and entrees were good. Ambience is good too. A little more hospitality and a little more quantity will help though.", "author": "Ammar Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "Ordered food via seamless that was delivered over an hour late. Called the restaurant repeatedly and no one could say when our order would arrive. Terrible customer service. Will never order from here again", "author": "Vicky W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Everything was magnificent! Service, food, atmosphere - very well done. The garlic naan was a little burnt, but that's probably my biggest complaint. All in all - great experience.", "author": "Simas U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Came in and got a special chef menu.\n\nGot prawns with fried okra.\nMain course was lamb chops!  These were to die for!\nChef came out to meet and greet our party.\nGave the chef a high five for the delicious food and special menu.\n\nOwner/manager was very personable.\n\nI loved this place.\n\nWould highly recommend!", "author": "Alvin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-11", "description": "I have been to this place twice. 1st time was good experience- I went in the evening and our server was very good, he was very friendly, food was good too. But 2nd time I went- our server (woman ) was very rude, she didn't even want to talk or answer any question. Food was also not good ( I ordered okra and it was not cooked well). I am very disappointed with their service and food quality too.", "author": "Vicky S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Torn between a 3 and 4.  The food is always excellent, in my opinion, but after reading other reviews here, I was particularly in tune with the service.  Anthony was adequate but just did not make me feel welcomed.  I do not expect to be fawned over but please just add a smile and a thank you.  Ask how the meal was instead of assuming it was too spicy because I did not eat everything.  (I dined alone and it was a lot of food).  I will be back for the food.   I hope the service is just a bit better.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "I have to agree a great Indian eatery exists in Brooklyn Heights!  This is so close to me I don't know why it ook my so long to try it.  The flavors are so 3-4 dimensional I felt like I was eating in India.   \nI have long ordered from Curry Heights which was good and reliable, but Asya takes the flavor to another level.   Everything from the samosas, to the Veggie curry to the Cauliflower appetizer were all top notch. I was full but wanted to keep eating and eating. \nThe naan here is a step above other Indian places too, thank you for the garlic!! Please add even more in the garlic Naan. \n\nHave a feeling this will definitely be a regular eat in or takeout spot.", "author": "Tara K."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Asya Indian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "46 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/aymHsDffM2_iWwEChCUYFw/ls.jpg", "@type": "Restaurant", "telephone": "+17188586700"}