{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Everything we ordered from enchiladas to tacos kids menu was amazing! The pitcher of roccos margarita was well worth it! Desert was amazing! Highly recomended", "author": "Noni W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Love the decor in the restaurant. The staff is really friendly and nice. They really take care of you. The guac is made right in front of you and it is really delicious. Probably one of the best I've ever had. I had the taco platter and it was a very good size for lunch. And I can't forget to mention the receipts. They have a clothespin decor as their receipt thing which I thought was so innovative and cute.", "author": "Ellie O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "Ok, the ambience is great, the margaritas outstanding, specially the spicy ones. If you check in they give you a free shot. Great service helped, but the food was just ok, the chips were a bit burned and the prices were very high for the quality.", "author": "Juan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "This place has two sides. \nThe nicer one is not during the weekends or Taco Tuesday. The atmosphere is great and they have awesome music in such a cool environment. The guacamole is one the best ones I had in NYC, with warm chips. I come here pretty often and all of the dishes are really good. I would recommend it to anyone who loves Mexican food and solid prices. The drinks are also really good. \nOn the other side, if you ever wanted to come here on a weekend, just don't. They are definitely not managed well for big crowds. Also, they seem understaffed. There is always a lot wait, even if you have a reservation and the waiters take forever, which is not their fault, since they have to cover way too many tables. Brunch during the weekends is pretty good, except that the mimosas shouldn't have orange juice with pulp and the refilling part should be faster. \n\nAll in all, worth making a trip to Brooklyn, just do it during the week!", "author": "Stefan I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "enchilladas were fantastic. The guacomole is very good too! fun atmosphere. Friendly staff.", "author": "Mervat F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Amazing Food drink and atmosphere. The bartenders are knowledgeable about their cocktails and food is always superb just with it was more upscale but great spot to hang and eat with anyone", "author": "Esther L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "First review but I feel I need to tell people about this spot my coworkers and I went to recently!! Probably one of the livest taco bars I've been to in NYC. Seriously, what's not to love!!! Even though it was after work and I most likely was hungry (and tipsy off of those lovely margaritas), but everything I ordered was fantastic. I started off with just three tacos and found myself ordering three more...plus dessert (churros and ice cream...LOVE!!) The drinks were on point, the atmosphere was live and our server for the night, Chris, was amazing! He was very attentive and engaging; kept myself and my coworkers laughing and he never missed a beat! I fell in love with this place!!! Between the food, atmosphere and service, this will definitely be my new after-work spot!!!", "author": "Corey M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "This was probably one of the worst experiences of my life from beginning to end. I first called to make a reservation because we were a party of 13. They asked for a credit card to hold the reservation which I thought was understandable for such a large group. I had requested a 6:30 pm reservation but was told only 5:30 or 7 pm would be available. We opted for 5:30 since it was for a Sunday, there would be kids and my cousin \u0026 wife which were visiting from Canada (the reason for us going out) were leaving the next morning. Well upon arrival we noticed it wasn't crowded at all, actually it wasn't that busy but our table wasn't even ready. We waited about 10 -15 minutes to be seated and then about another 20-30 minutes to get our drinks. Our guacamole that we ordered table side was already being made before drinks or water were served. In our party there were 3 children total and one pregnant woman. Our waiter was beyond slow and forgetful. My nephew's orange juice took 20 minutes to be served after the rest of us had our drinks. The waiter also asked three to four times for clarification on his beef taco from the kids' menu. The waiter also forgot to enter 4 entrees. So while the rest of our table had food 4 people were sitting there with nothing. When we complained to the waiter and manager he couldn't understand why entrees were missing. The manager lied and said he had just come in and had no idea what was going on and he was trying to fix it. Lies. He had been there since we were seated. Well low and behold the waiter didn't enter them and only did when we complained. Me, being pregnant and hungry asked if he had just put in our entrees and he blatantly lied to my face and said, \"nope\". Ok so then our entrees should be flying out. Nope. The four entrees missing began coming out one by one. He apologized profusely and the manager came over and said dessert was on them. Not a resolution to the problem. At this point none of us were thinking about dessert. We just wanted to eat and leave. After all was said and done our meal took three hours and our bill was $375 with a 20% included for parties over eight. I am giving this two stars because when we did all finally get our food, it was good. The manager did take off the bill our alcoholic drinks and the four entrees that came out late but the service and food was definitely not worth it. When paying the bill, my brother and I asked the waiter for a reason as to where the breakdown was. He told us he got sidetracked and forgot to enter the entrees. So you lied earlier when you said you hadn't forgotten. ABSOLUTELY DISASTROUS!!!!", "author": "Claudia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "Came in with my brother to grab a bite to eat because we didn't want to travel far for a meal . I ordered a cheeseburger well done and he ordered a set of tacos . The burger came out cold and and undercooked . The fries tasted like fish that was stored in a hobo's buttcheeks for days . My brothers food tasted horrible. Never again will I go here . Fuckin sucks. Oh the waiter is an asshole and forgot my refill while he stands at the other table talking about his football days . Like who gives a fuck ?! Who the hellllllllllll caressss? Get my refill ! Smh . Horrible service . Never a-fuckin-gain.", "author": "Kevin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "A friend invited me out for lunch a week ago and  i wanted to try something new. This place rock, customer service was great. Four days after I celebrated my birthday while attending a seminar downtown I went Again to have lunch. I met one of the Manager ms Zee she treated  me with a Birthday shot, which was nice of her, I plan to take my coworkers there soon.", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "When the food is amazing and the service is just as good then why go anywhere else!Make sure you look for Andrew ,He will take care of you !, always on point ,  the food is seasoned to perfection, the flavors make you go back to the menu for more! Being a chef , I'm very critical on flavors and plating , both of which were superior!", "author": "Michel M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-26", "description": "I came here with colleagues for tacos and guac, however, the customer service was bad. No one attended us until one of us got us to grab one of the staff's attention to place our orders. After placing our order of drinks and food, the wait was about 25-30 minutes long. We got our drinks but the drinks were not great! In fact this place is overpriced for drinks that have an acquired taste and very, very salty tacos, which we got before the guacamole was served. We were almost done with the tacos by the time we got our guacamole. On another note, it was happy hour and no one informed us of which drinks were included in the happy hour menu. On the contrary, the decorations were nice but the customer service and drinks do not match the price paid.", "author": "Mercedes L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "OMG, the food, ambience and whole experience was excellent. The table side guacamole was well worth every penny, the entre was even better. this place is a good all around place, date night, girls night or a group.", "author": "Alem C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "Guacamole made at table was pretty good, not a fan of chips had a smoky flavor had the yukatan was yummy and mules were pretty decent.", "author": "Rosy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Had to come back to this place to give it a fair review!  BEST DAMN TACOS IN BROOKLYN! Good service, I enjoyed the mojito which they serve with your choice of regular or flavored rum! I have only one complaint, I work late on Tuesdays so I can't enjoy the Taco Tuesday's!", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Great tacos. We had guacamole prepared fresh at our table which was very nice.\n\nAtmosphere was nice, service was quick a, though the music a bit too loud to hear the waiter a couple of times.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Me and my family went there last night for national margarita day and we had a absolute blast... The frozen margaritas was amazing the food was great especially the quesadillas and nachos.. We'll definitely be back really soon and to make this first time experience even better we had the best waiter ever kevin.. Thank you KEVIN we had wonderful night i will make sure you are my waiter when ever I'm there", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Was looking for a quick dinner near my hotel. Food was fresh and delicious. Guac made fresh at the table. Watermelon Margarita hit the spot  waiter was attentive and prices were fair.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "I have been here several times in the past.Although it was always very pricey for small non authentic food the service used to be good. On Wed. 4/19/17 I made a reservation requesting no bar stool seating,and for the 2nd time in a row they tried to seat us on bar stools for dinner.When I asked them to read the reservation they brought us to a side area that was away from the regular area and the waitress came once in 1/2 an hour and refused to accept an offer that was mailed to me and offered me a cheaper promotion.The menu has changed with much higher prices and limited choices with smaller portions.Overpriced and poor service..There are much better choices in Brooklyn.", "author": "Mitchell F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "First time there but they really have great guacamole if you're into that stuff really great but drinks though", "author": "Nakedar S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}