{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "This place is really nice, you almost forget your in Brooklyn while you are inside. The steak, black beans and plantain quesadilla was absolutely delicious.  Taco Tuesday is fun, come with an empty stomach because it's all you can eat tacos for under $20..  The table side preparation of the guacamole is a nice touch..", "author": "Emma H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-11", "description": "This review is just for the service, not the food. My boyfriend and I came by on a friday around 5 pm and the bar area was a little busy, but not packed. He went to the bar to get a drink, and the bartender saw him, and said he would be with him. But after over 15 minutes, he never took his order, helped other people, checked his phone, stared off, and didn't have the slightest bit of hustle in his step even though people were waiting. In my opinion, that is pretty rude. We have never left a place before, but after not being served for so long, we decided to just leave.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I love, love this place! Drinks are fantastic. Thx Devon. The servers awesome food FABULOUS ALWAYS!! Going back asap!", "author": "Stacey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Overpriced and the portions are small. I guess this works well for the lawyers and judges who work right across the street at the court but not for regular people. The food was also very salty, I had high hopes for this place but I was highly disappointed. I only have the two stars because of the decor.", "author": "Judith R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "I really wanted to like this place because of location and decor, but it's been a big disappointment both times. Terrible service and really mediocre food. It took server two checkins to remember drink order (beer) and had to ask for a setup and napkin once food finally arrived. As a Californian, I was amazed that they called this Mexican food. Dry and tasteless tacos; never got to second app as it was taking so long, just cancelled it halfway through 2nd drink that also required a reminder about what it was. A big NO and will not be back.", "author": "Donna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Don't go here anywhere close to closing time. We arrived at 9:30, waitress was nice and informed us the kitchen would be closing soon. We were seated at a high top in the bar. We quickly ordered our food and waited. At 10pm, before our food arrived the Mgr turned up the lights, turned off the music and turned off the tvs. It was clear he wanted to go home and we were not welcome there anymore. I asked him what was going on. He told me it was closing time. I told him he completely changed the atmosphere and we weren't happy. He said it was a corporate rule and all he could do is turn the lights down one notch. The bar and restaurant was not empty, and there was at least one other table that had not received their food. I asked for my check as we just wanted to leave at that point. We were totally ignored by the server and the manager.  15 mins later, they brought our food, which I clearly had said I no longer wanted. I guess the Mgr thought that if he made us wait and then sent the food out we would stay and pay for our meal? Craziness. At one point I asked him \"so, the customer is wrong?\"  His answer was \" the customer is always right, but in this case, you are wrong\". Definitely will never return.", "author": "Kenneth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "The ambiance of Rocco's is great and intimate. The music is perfect and life. Love this place every time we come here we don't want to leave. The staff is very attentive and have cool vibes. Totally recommend everyone to come and experience the great food and drinks. The guacamole is AMAZING!!!!  What we love is that they prepare it right in front of you so you know is fresh.", "author": "Sonia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "I came to Rocco's on a Tuesday night with my boyfriend.  I had previously been to a Rocco's location in Florida and we loved it so we thought we would try out the one in Brooklyn!\nEasy access from multiple subways makes this location a breeze.\n\nIt was a bit on the earlier side, 6:30pm, so we were able to get a seat at the bar right away.  I immediately took note of how friendly the entire staff was.  Everyone seemed eager to please the patrons, taking time to speak with each of us to find out exactly what we wanted.  At one point the manager came around and took a few moments to talk with us as well.\nTuesday nights can get busy here and the crowd was flowing in with each minute that passed.  Taco Tuesdays = 18$ all you can eat tacos and reduced priced margaritas/ pitchers.\nThe tacos are basically two bites each, so if you opt for the AYCE option, do yourself a favor and try a few different options that you wouldn't normally try!  I gave the portobello mushroom taco a try that I would otherwise not have and it was tasty!  I tried all different types.  The first round of AYCE they serve you four, then the subsequent rounds, three.  If you make it beyond one round, you break even with the deal.  I made it through the second and I was FULL!\nThe restaurant is huge and consists of two floors.  The dining area downstairs is smaller but they have a bar which would be good for overflow crowds at the upstairs bar.  The decor is really neat with a lot of skeletons/ skulls throughout... a \"day of the dead\" theme, with bright, unique chandeliers.\nThe staff make this place great, everyone so friendly.  Can't wait to get back next time I'm in Brooklyn.  Very fun!", "author": "Dane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "This place is very cool I came during the day time but I know in the night time it gets even better !!! I didn't get any drinks but I've heard the drinks are really good ! I ordered the vegie queso and it was overly cheesy I guess that's how they make it if u do order a  queso just tell them lite on the cheese !  The chips are very good you could definitely start off with that! \n\nOverall it's a cool spot I would definitely go here if u just wanna grab a quick bite to eat and catch up . They also have a to go part !\nMy waiter was Zenobia and she was a great waiter she was helpful and constantly checked to make sure everything was great !", "author": "Queeny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "Came here with a friend whose office isn't far from here.  It's also pretty close to Kings Civil and Supreme Court.  Seems like it can get crowded sometimes but they give you a LOT of food (at least this skinny girl felt it was a lot).  When we got chips to take home here, I got a HUGE bowl of them.  They are seasoned very nicely and lasted me a while.  I've also had the nachos here, which were pretty good.  I have absolutely no complaints.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Aaron was an AMAZING waiter; friendly, funny, and thoughtful. \n\nThe food was really good. I had the chicken adobo tacos and my sister had the nachos. My six year old nephew was in love with the cheese quesadilla and wouldn't stop asking for more. \n\nEvery Tuesday they have unlimited tacos for $17 and pitchers for $21!", "author": "Marlee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "Food is decent but service is horrible even when not busy. It'll take you 10 minutes to get a simple request or your check. Hlo", "author": "Jae H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "I visited this location last night the food was very good the waitress that we had at our table she took our order and never bring back our food another way to came in from the south food and then come to find out that that very waitress got fired also this location is very drafty being that the door is right there in the back but otherwise I had a very good evening at this location", "author": "Vernon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Really nice place great food. On the expensive side but they do have options for smaller portions which helps. The interior is decorated so nicely.", "author": "Deirdre M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "This was a decent restaurant but my last several visits show that it's going down hill fast. Just left with 4 co workers and all hated it. First the table they gave was dirty, the glasses had some food still on it and when we moved 1 server acted like we had problem because we didn't want to drink out of the dirty glasses. Also the guacamole server dint know gow to make it!! Either too much lime or salt.This maybe the last time we go until they get their act together. Last time we waited 45 min for our food then had the wrong order. We tried to speak to a Manager and could not find.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "We rolled in on an average Tuesday and the highly energetic ambiance damn near turned our night into a party. We had perhaps the most charming waiter of all time- both my date and I were properly taken with him. He told us about the check-in special (high-five, Tequila!) and we got a variety of tacos. The chips were particularly flavorful and we didn't regret a single taco choice.\n\nGreat choice for a fun night, I will be back.", "author": "Kerri G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Great place. the manager Rashard was so nice. And it was a pleasure to meet him. Our waitress Bella was awesome. Will be be soon.", "author": "Giavanni B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "Spent Cinco de Mayo  at Rocco Taco in 2016 so we decided to go back this year.  Horrible!!\nRestaurant did not provide a festive atmosphere this year.  Drinks were not good and food was fair.  We were very disappointed. Will not return for Cinco de a Mayo in 2018.", "author": "Kay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Amazing service and food! Our server, Avante, was fantastic; personable, kind and made the dining experience very enjoyable. The food came out very quickly and was delicious. The only thing that took a 'while' (we're talking 5-8 minutes) were the Churros but it's worth the wait as they are made fresh to order and tasted great! Food is priced well and will come back again for sure.", "author": "Erik A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Went for the food, fell in love with the drinks. So ill start my review with the drinks. I had the Cadillac first and it was okay honestly. It wasnt strong and it didnt have an taste to it. It was just like liquor and a mixer to it. Blah ! Now the Black Diamond Rita ! Omg. Wish i would of gotten that first. So good. Has a sweet taste to it but not over powering. Definitely the better drink out of the two. I came here on a Saturday night and i made reservations on OpenTable so no waiting for me. I did my check in and showed my waiter Brian so i could get my free shot. And unlike some places, its a free shot for everyone who checks in ( which obviously makes sense but some places are one per table. ) Now to the food! I started with the table made guacamole ! Another guy named Brian made it and it was so good. The freshness of it was unbelievable and the chips were seasoned so well. For entrees i got Roccos tacos and got shrimp and blackened fish ! Delicious. My boyfriend got the steak quesadilla which had filled with beans and plantains. He loved it and said the plantains gave it a sweet taste. Would totally return!", "author": "Danielle A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}