{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-02", "description": "The service is horrible and I will never be back here to give them my service. My company come here all the time. We have our Christmas party and at times come here to celebrate. Today by far the service was hideous and horrendous. First lets start with the dirty plates. The waiter serve us dirty place not once but twice. He even found food on one of the plate. When I ask to speak to the manager, they were all in a meeting. When we told the waiter about our yelp check in he stated he has to see us all do it. Ok no problem. The so called manager walk over to the waiter and ask him who ask to speak to him. The notion was made to my direction. He come over lean on the wall that I had to back up. Then I said to him that the plates were dirty he she said no their not dirty they were water stain. I said no food was on the plate. He apologize and thats was it. Nothing much to offer as a manager speaking to a district manager. My coworker say tto thhe. Manager oh he said he had to see us check in. He said no he put the shot in. Ok np. The waiter come out with 5 shots anf said oh the shots are here you should count your blessing. Excuse me. No im not going to count my blessing because unfortunately we are paying for our food. And told the waiter his comment was inappropriate. This used to be a very nice place to come by but their service fucking suck. And I mean it. I made it my business to tell all my friends via social media. Guessing since they fire the gm and got a new team they all need to go to leadership/management class. Their was no empathy and they felt that giving us shots was something in our favor. Hello we check in so the numbers will match the report at the end of night. They are need training. The entire staff need to be trained in customer service. I only wnjoy Alex and Louis service when I come here. They are the best in servicing their customers.....", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-28", "description": "No. Just no. Why is the Korean taco so similar to beef jerky doused in the sauce that Chinese restaurants use for their boneless spare ribs??", "author": "Jeremy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Super disappointing. Horrible service. Came with my husband on Saturday night for our one night out a week and wasted it here. Took 15 minutes of sitting there before we got noticed. (Saw a party of 8 come in with us and get up and walk out because they were seated at a table for 6 and waited as long as us.) ordered margs on the rocks with salt. Margs came 15 min later no salt. Ordered nachos, took 25 min to come. No jalapeños. When I told our server he was surprised kitchen forgot them. I asked for a side order which he forgot once then came back with and said they were out of jalapeños. What Mexican restaurant runs out of jalapeños? Asked for a salt shaker, never came. Requested 2 shots l unlocked with the offer on yelp app. Never came. Ordered our dinner, he brought the wrong order for mine. Asked for the check and it took 30 min because a manager had to over ride my wrong order. I saw 2 ladies SCREAMING to manager that their whole order and evening were ruined as well. In the 2 hours I was there I saw at least 14 people complain. For these prices better service and food were expected. We won't be back. Shame too, cute place but poorly run and grossly understaffed.", "author": "Carly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Service was excellent.\nNachos and tacos were amazing!!\nService was great\nWe had a party of 8\nFree shot of tequila with Yelp check in.\n\nGreat find!!!", "author": "Bobby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Good food, cool atmosphere, very good service. Great selection of tequila and margaritas. I had the Chihuahua combination, with 2 different kinds of tacos, and a tamale. Tamales ate my measure of a good Mexican place, so they deserve a solid 4 stars. \nDecor is very, very, very cool. I especially liked the Speedy Gonzales cartoon playing in the bathroom.", "author": "Ginger R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "Alex our bartender was the greatest. He was quick with out drinks and food.If you want a great margarita go through him.", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Went here for brunch, and I was very impressed! The servers were attentive.. Even the manager came over to introduce herself! The table side guac was amazingly good, and made even better by peppered chips. My friend got the quesadilla, I got the chimichanga nationale, along with frozen margaritas, everything was exceptional! Everything was literally so good, I want to go back for dinner lol", "author": "Ivy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "Loved this place when I went to Orlando and loved it.  So I celebrated my birthday at the one in Brooklyn. All I have to say is that the service sucks!!! If you get Melvin, walk away. Forewarned ...", "author": "Delaila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "I've been here twice and both experiences were great! Nice afterwork spot downtown Brooklyn, great tacos... can get noisy due to size, music and the other large crowds that gather so forget this being a romantic or intimate date option. \nStrictly for friends, family, and co-workers...", "author": "Aneicia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Ate there for the first time a couple of days ago with a couple of friends  and the food was Awesome!  We also had a magnificent server name Kathy  thanks for the great service.", "author": "Crystal R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "The entire experience was not good at all. We were there on the night of 4th of July and wanted to quickly grab something before the fireworks started. They did have fresh guacamole and they made it in front of you, which was good to watch. However, the tacos that my boyfriend ordered were not good. I asked for salad with dressing at the side. They brought salad with dressing mixed up already, which I believe they may just premake the salad. I asked to return and change the salad. They brought the exactly same salad after 10mins. In addition, their service was awful! We had to wait for ages for every single thing we asked.", "author": "Lutao X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I did my birthday dinner here awesome service yes it was on a Tuesday but my table was ready. As we say we met Hunter very good waiter he took very good care of me at my table. One of the waiters dropped salsa and it splashed on me. Manager quickly apologized and gave me a shot on the house and club soda to get it out. this was a great experience and the drinks was so good. Definitely coming back.", "author": "Kawanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "The nachos...SOOOO GOOOD! The whole order is a lot and can feed 3 people very well. Also got the passion fruit margarita pitcher, which was delicious.  The carne Assada tacos are very good too. Service was kind of slow when I went, but other than that I really enjoyed this place.", "author": "Eden Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Best place to be after work on a Friday. Owner was giving out free bottles of tequila and free shots to almost everyone. Food was amazing as well as the music. The only downfall I will have to say is the wait time. Many individuals left because of the hour and a half wait. Tip: make reservations ahead of time. Def will visit again.", "author": "Nettiesha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Great drinks, no burritos though for a Mexican place. Make sure to make a reservation cause it get packed fast", "author": "Teresa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Kathy our waitress  is the bomb. She was made for this job. Oh by the way the food is bangging.", "author": "Unsatified Customer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "This was my first time here, it a was lunch rush but we were seated within 10 mins. Even though we got a new server and she had to come back a couple of times our food came quickly and correctly. They even give you a huge pot of guacamole that they make in front of you with seasoned chips....which I thought was free ($12). It was all in all pretty good, friendly staff, good atmosphere and clean if a little bit pricey. I'd go again.", "author": "Terrie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Came here last night for celebratory drinks! I love how large it is and enjoyed the making of the guac in front of us. Their magaritas are really good. The passion fruit was good but that prickly pear will really sneak up on you! The music was good for the type of place that it is.\n\nAlso, be careful to properly read your bill, they tried to charge us for things we did not purchase.\n\nOtherwise, a night of good old fun!!!", "author": "Annissa D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "Welcome to the new Brooklyn! I am the guac queen AKA I've been around the block a few times when it comes to what good guacamole is. I can tell you it's not here. The decor is cute and great to go for a date but the food (for the price) is a mere meh. The quality of food does not measure up with the cost on the menu. I make amazing shrimp and fish tacos to to receive cold tortillas, a tiny piece of blackened fish and just OK shrimp tacos I was very disappointed. My server asked if I wanted him to bring out new tortillas and I switch over my food to it. Who wants to do that?!?! I expressed my unhappiness and received no compensation. I don't drink so I can't tell you how the drinks are but I guess it's a cool place for happy hour? I highly doubt I'll be returning...at least not on my own dime. If you're looking for amazing tacos and guacamole...this isn't it!", "author": "Bayyina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Terrible delivery - tacos were soggy and tortilla soup inedible.  Delivery came over an hour after ordering. Much better at resto", "author": "Janet F."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}