{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-02", "description": "I had the combination plate, chicken enchiladas \u0026 skirt steak tacos. The food was mediocre. The sauce used on the enchiladas gave it a sour taste \u0026 the steak tacos were too chewy. I had the passion fruit  frozen margarita and my friend had the strawberry margarita we both said the taste was very vague  as if they put way too much ice. But the setup and decor is nice. It's very spacious and have another bar on the lower level. The bathrooms are clean \u0026 there's a television in each stall. However, If you want great Mexican food I wouldn't aim for here.", "author": "Abigail R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-20", "description": "My friend took me to Rocco's tonight for my birthday dinner. The food and drinks are awesome but there's no heat in the restaurant. We were seated by the front door and they refuse to keep the front door closed. A gust of cold air hits my back and legs whenever someone comes in or leaves the restaurant. I was too cold to enjoy my tacos and I had to keep my coat on all night. I couldnt enjoy my birthday dinner to the fullest. I won't be coming back.\n\nAlso, Our favorite waiter and manager was recently fired. This is disappointing because my friend and I always came to Rocco's just to see them (they were amazing).", "author": "Ty W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "guac is great\nso is the shrimp quesadillas\n the sweet plantains are amazing!!!\nsweet and soft but with a crunch on the edges!!! \n\nfish \u0026 shrimp tacos not so great.\nservice questionable...slow, no refill on water, had to ask one of the managers walking by for check \u0026 tubbies to take our leftovers.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "The food and drinks here are excellent... Came here with friends to celebrate a birthday. We started off with the chips and guacamole and shot of tequila for the table!!! I have the Molcajete surf \u0026turf is was great, taste like a Spanish style gumbo. The staff here was attentive. I will be back.", "author": "Ikara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "There service is good but it needs to speed up for lunch. Most people just get an hour. The food and employees are excellent otherwise.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Everything we ordered was on point and tasted great! Our server Morgan was absolutely great! Will be returning!", "author": "Ronny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "Probably the worst experience I've ever had at a restaurant. We waited forty minutes to get our first drink and an hour and a half before we even got our food. Not only did we wait that long, but we waited while we saw other customers come in, get their food and finish before we even got our drinks. To top it off, the manager Hector gave us the absolute worst service ever. He came to our table and without saying a word picked up our pitcher of margarita mix and proceeded to pour it into another customers glass. When we said we could handle the pouring our pitcher out for ourselves (being irritated that we'd already been sitting there for an hour and a half with still no food) he began to tell me that I was a terribly rude person for telling him how to do his job....which I never did. We didn't complain, we waited patiently...and then he told us we were the rude ones. I asked a couple of the staff members about Hector and were informed that he was a bully and continuously berated his employees whilst doing nothing but meandering about meaninglessly. At first I was annoyed at the waitress for taking so long with our order. But now I feel bad for every single person that has to work for Hector. No customer service skills, clearly no ability to manage his staff and obviously has no right to be employed at a place that has amazing food and an amazing atmosphere.", "author": "Jacob M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I work in the neighborhood, and while I wouldn't pick this place as my ideal happy hour spot (that honor goes to Hill County BBQ, just down the street), I definitely recommend this place for lunch.\n\nMy biggest gripe with happy hour is this place's layout.  Lot of high bar tables that appear to be for dining only, which crowd the bar area, leaving little area to stand or order a drink.  It's very tight, and not accommodating for meeting for a drink or two after work. \n\nFor lunch, however, it was pretty good overall.  Although we were sat downstairs (at noon), and it appeared to be empty, it soon filled up, which made it seem a bit less like being set to Siberia.  I ordered the Brooklyn tacos, came with 3 and overly stuffed with meat.  No sides or anything (which would have been nice since I was paying $16 for them), but I was nonetheless pleased.  Service was quick and efficient (always a plus for a work day lunch), but $3.50 for a soda is a bit ridic.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-28", "description": "Great space, even better food! Drinks were strong and guac was yummy. The Brooklyn Tacos were the best! \n\nCons: Hostess was rude and did not bring customers to tables; simply tells you to go to the bar, but who said I wanted to go to the bar? Please improve customer service!", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Kathy was awesome food was great drinks incredible! She's was very nice made our experience feel warming .", "author": "Althea B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Loved their Margarita Pitcher! They offer over 350 different Tequila Options. They make fresh Guac at your table. Food was ok. Customer Service was great.", "author": "Penelope B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I've been begging my friend forever to go here with me...she finally caved! We made a 10 pm reservation but didn't get there until 11. Thankfully the wait was not too long although there were two groups in front of us. I loved the decor. Felt like I was smack in the middle of \"The Book of Life\" (yes, I know its an animated film. I have toddlers...don't judge me). Our server, Shawn, was attentive and well informed and the food and drinks every bit of amazing that I expected it to be. Will definitely go again. Don't forget to check in on Yelp to get a free tequila shot!", "author": "Janelle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Came here with a couple of girlfriends - short wait for a table and they put is in a nice spacious booth.  It's cool because they text you when your table is ready so you don't have to hover around like an idiot.\n\nOK, slow start with the waiter - took FOREVER to put a drinks order in, but from that moment totally made up for it.  I had a burrito - amazing, couldn't finish it even though every inch of me wanted to.  Mexican Mule - great drink, but pretty much one of the only things with vodka in it :P ... worked for me though.\n\nOur waiter walked us down to the bathrooms, chatted with us, gave us a quick tour and when they accidentally removed our drinks, he brought us fresh replacements and then some.\n\nSecurity were nice - cordial - no egos.\n\nNice big space, so even when it's busy, you don't feel cramped.\n\nGoing back today, need a burrito fix.", "author": "Ava A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Excellent guacamole\nDrinks hit the spot\n\nGreat service\nThe tacos were filling and delicious\n\nThe atmosphere was fun", "author": "Ana P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-31", "description": "Served meat to a vegetarian and since I used the takeout window, didn't realize until it was too late.", "author": "jessica l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Made a reservation for here for a party of 5 for a birthday lunch for a friend.  Checking into Yelp gives you a free Tequila shot.  The server was quick and orders ring was speedy. We ordered Rocco's guacamole and I ordered the half nachos. We were in and out in an hour.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "We came with 7 ppl and was told they couldn't give us a seat due to the fact that they FELT WE wouldn't order enough food. This was excessive discrimination. And we decided to leave. Would never return to this establishment", "author": "Melvin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "The coconut mojitos were OUTSTANDING, a short beautiful Caucasian woman with black hair is an angel bartender!!! Our server was great but I forgot her name (sorry). Way too many drinks lol. But the chips and HUMPHREY table side guacamole maker....best I've had and I make it very well. His was better and he was friendly, courteous and entertaining. Great time catching up with a great friend at a great place. Only downside is they ran out of mint leaves....", "author": "Colisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "This is the place to be afterwork....food is great...drinks are the BOMB the ppl nd the employees r really nice...my spot !", "author": "Cynthia G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-13", "description": "Heard good things about the place and was excited to try and was instantly turned off. The hostesses (a group of 3) completely ignored us having casual conversation while we stood there and one man used his hand to brush us off and turn his back on us! We were shocked and went to the bar and asked for the manager 3 times before someone told us the person you turned his back on us was the manager which is why he was ignoring our request! His name was FRANK and he was completely rude and I am still in shock that he was the manager. The bartender Jen was great and made us feel better about our encounter and apologized multiple times. Overall don't think I'll be back there.", "author": "Nadia D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}