{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-25", "description": "My group waited an EXTREMELY long time for our food for all of it to arrive cold. Side note: Rocco's food does not taste good cold. Also, two 125lb girls split an entire pitcher of margaritas, and neither could taste tequila nor did either get any kind of buzz. Kind of a bummer of an experience, considering I love every other Rocco's locations.", "author": "Mary Kate K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "The place is very big was with a party of 14. The owner came over and gave us free shots. The service is good. The food was ok I had the chicken nachos. I love Mexican food so I know good Mexican food. This place is great for groups. It is for sure an after work spot. $3 over priced on the food. Don't order the frozen drink, it's watered down. Get a drink on the rocks really good. I'll definitely go back.", "author": "Tyseti S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "Food was mediocre and overpriced, three times now. Decent bar, with good selection of tequila, though the experience depends on the bartender. Overall, much anticipated and disappointing addition to he neighborhood. Thumbs down, Rocco, whoever you are.", "author": "Jackson L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "The drinks are really good and so were the chips and fresh guacamole. Unfortunately, the food wasn't, nor were the nachos. I would go back just to hang at the bar.", "author": "JESINA M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "I organized a high-stakes work gathering in their private event space downstairs and could not have been more pleased with the high-quality service, food, and set-up. Rashad was AMAZING to work with. He consistently and promptly answered all emails, helped us figure out a menu that worked within our budget, initiated a call to run through all the logistics the day before the event, and was incredibly patient and willing to accommodate our last minute requests. I highly recommend Rocco's Tacos if you need to throw a private event or just enjoy a margarita with friends! Thanks Rashad!!", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "Came here for dinner after reading the most recent reviews. Had to wait a bit for service but that actually  wasn't a big deal. The waitress was very nice and accommodating. The guacamole made at the table is a must. Fresh and delicious. I ordered the special - which was NY steak and  lobster enchilada- thus breaking my rule of never ordering the special because it usually means it is something the kitchen wants to get rid of without taking a loss. There were 3 pieces of meat- which is a bit unusual for this cut. The meat was cooked to order but the meat was basically gristle and fat with some slivers of meat in between. The enchilada was ok but lots of \"filler\" (potatoes). I sent it back and had the spicy chicken and chorizo tacos and they were good. The manager was very nice about it. The margaritas were great BTW!  Stay with the rule of not ordering the special and you should do fine at this restaurant.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "this was a horrible experience for me..i was sick for three days after eating their guacamole and chicken tacos. the waitress kept telling me how great it is, so i tried the guacamole..it has no flavor. then she informs e that their hot sauce is extremely hot.. i must of used half the bottle...dont waste your time..", "author": "Tabitha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-09", "description": "Food is fantastic!!! And so is the atmosphere.   But it was an hour and a half before the entree order for my table was taken...I will never come back here....can't get a drink and the staff seems to have completely half a brain.  The worst service in one of potentially the best places. .....literally as I sit here writing this reveiew.....2 out of the 10 people at my table got their tacos and said that the food was good up until now....somehow ...15 minutes later they are the only ones that got their food up til this point...we are all watching them eat...what's up with this place...they need to get their stuff together....maybe we just had a new waitress or something,..I can respect if they told us they were training someone new...but the they need to be on top of the new person .   So, not only did the 1 person get their meal a half hour before the other 10, but then we gradually got the rest of our entrees, all except one person at our table and then our waitress  started to grab mine and my husband's untouched tacos, to pass them off to my brother for his forgotten order....blah blah blah...I can go on with this review...But I will leave you with this hysterical  last thought instead...our waitress asked if we wanted our ice cream to go!!!!!", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "This place is awesome! I was a little skeptical because it is so large. Im like more of a home feeling when it comes to a mexican spot. Butttt the food is great and staff are attentive!  This place is always crowded however especially during happy hr times", "author": "Stacey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "This new place is just awesome so exciting to have an excellent Mexican restaurant right in our neighborhood.  I went to dinner with a friend and was seated immediately by a very friendly hostess. The ambiance and vibe was just what we were looking for. Hip bar crowd and lots of upbeat people. Good music. Our waiter came right over and told us about all the different margaritas, we chose the Cadillacs, so yummy!  Our guacamole was made table-side (delicious and incredibly fresh) and we also ordered the queso with warm tortillas, cooked to perfection. We had a hard time deciding what to order with so many amazing choices but went with the seafood molcajete for two and omg, off the charts delicious! We finished off after dinner with the most amazing dessert we have ever had... Churros with vanilla ice cream. Absolute perfection. The great service, delicious food, cool vibe and awesome crowd makes for a top review.  We can't wait to go back and enjoy another great meal at Roccos Tacos!!", "author": "Jen M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "If you like to enjoy watered down, sugary drinks while being bumped into by members of the loud and obnoxious after work crew then this is your place. If you actually want to enjoy a decent drink - you know the kind that has flavor and some alcohol content - around people who don't have to shout to have conversation you should go someplace else.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "A friend of mine \u0026 I went on Friday night right after work. It was packed! We were immediately greeted by their gracious \u0026 lovely hostess, who introduced herself as Christine. We were told it would be a 45 minute wait \u0026 were kool with that. Gave us enough time to make our way downstairs to the bar for a couple of margaritas. They were awesome! I was then greeted by Affrey, the friendliest coat check person. She immediately saw I was in desperate need of her services \u0026 I thanked her for her intuitiveness. My hands were full! I told Affrey that my friend \u0026 I were virgins to their establishment \u0026 she then began to tell us about their Tuesday, margarita specials. We both had the chicken salad \u0026 a side taco. prior to our meal, Zara came out \u0026 made our guacamole dip right in front of us! Pretty kool \u0026 delicious! Big shoutout to our server, Noel! My fave Christmas song! The best server in the place! If you're dining upstairs find her!  All around was a great experience! Big ups to the bartender \u0026 those complimentary tequila shots! Funny, how after a couple of those, things seem like they're in focus. Lol. Tuesdays: ALL you can eat Tacos \u0026 margarita pitchers for $15! I'm there! Made two new friends \u0026 will see them again soon! Thanks Rocco's for a great time! Great job!..:-)", "author": "JoAnne A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "I sat at the bar at this bustling downtown Brooklyn restaurant. It got crowded in a hurry, but the bartenders never missed a step and the drinks and food came quickly without a hitch. The food was really good. Slightly more upscale than a typical mexican restaurant but not on the level of a Rosa Mexicana. I would go early unless you like feeling like you're at the new \"it\" spot with people who aren't really \"it.\"", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-25", "description": "Awful Frozen Margaritas and Bartender\n\nI came in for the the first, and  last time the other evening with a friend.  I ordered a frozen margarita and a beer.  First of all, the frozen margarita is blended.  It tasted like dirty ice with lime juice.  How a Mexican Bar this size does not have a frozen margarita machine is beyond me.  It was by far the worst frozen margarita  I have ever had.  It gets worse.  The menu say's $9.50 for the margarita and $5.50 for the beer. Total should be $15,  I give the bartender  a $20 and get $3 back.  When I question her about it she rudely  states \"well, there may be some tax.\"  OK, so what is the total.  Turns out maybe I was off by 0.70 cents.  and change should of been $3.70.  This is not about $0.70.   But think about it...if you take $0.70 from every that orders a drink from you over the course of the evening you are probably pocketing another $100-$200 before they tip.   In summary, the frozen margarita was the worst I ever had and the bartender had a bad attitude and was a thief.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "Amazing place and amazing food! The service and staff were super friendly. Love the decor and vibe...great crowd and ideal for groups too! Must check it out!!! Easy location to subways.", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "This place just opened a few weeks ago and my roommate and I went to check it out.  The atmosphere was great, good music and ambience.  Our waitress was wonderful!  She was very nice and very attentive.  Margarita's were huge and good food.  I just ordered chips and salsa because I had eaten earlier that night.  Salsa was fresh chopped, very tasty, and the chips had their own house seasoning on them which was also delicious.  Service was fast, vibe was good.  I would definitely go again!", "author": "Ali W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}