{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "This is disappointing because the location is great, and the bar looks nice and is laid out well. Happy hour discount is $1 off drinks - which isn't a deal. Tacos are average. Service is typically average or bad. I only go here for the convenience and I do like the bar.", "author": "Will B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "Kind of fun... I guess. Nice assortment of tequila and friendly staff. Food isn't that remarkable.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "First time I came here was in a general annoyed fury while waiting to be officially released form jury duty around the corner. The generously sized margaritas were just what I need. After three I was good to go back and perform my civic duty. This is also when I feel in love with the pork tacos. \n\nThe second time was for a celebration. The waitress and staff were very accommodating and allowed my party of 2 to bend a couple of brunch related rules. I tried the spicy beef taco, and it was also quite tasty. I was a little plussed that the guac was $13.50, but since I had gotten 8 mimosas for cheap and the chips were amazing I couldn't complain.  My favorite part, though? Around drink 4 the waitress checked to make sure we were \"Brooklyn or NYC bound... Like... No car.\" This kind of care (for business and customers)  is rare anymore, so I find this endearing. \n\nI'd definitely recommend this to anybody who is in the area and/or looking for great tacos or a kick ass Mexican brunch.", "author": "Courtney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "The food is delicious. I like their menu and the selection. They have an evening special too. This a great new place with a fun vibe and uniquely designed setting. Both the upper and lower levels are nice and it seems great for parties, getting friends or family to go out. The staff are really pleasant.", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-20", "description": "This place used to be really awesome. I was a regular up until today. They recently fired a bunch of waiters and management and got new management which sucks! It's December there's no freaking heat in this place at all. The employees (hostess servers bartenders) are wearing jackets for crying out loud. As someone paying to eat and enjoy myself I have to sit with my coat on and still be freezing. This is unacceptable! Customers are without heat and sitting with full coats on zipped and everything.  How can this restaurant function with no heat?!?! And it has been this way for about two months. The staff are under stricter rules and it makes this place no longer fun to come to.  This will be my last time here. Management needs to get it together and get some heat in this place before someone complains to 311! It just might be me reporting the heat situation.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-27", "description": "After the nets game we wanted a drink so we walked over here. We had to wait about 30 mins for a table which wasn't bad on a Sat afternoon within the six o'clock hour. Got a text that the table was ready. Nice decor. The food was ok in my opinion. They provided nachos and salsa, the nachos was ok I've had better I wasn't a fan of the salsa. Also after eating a few I started to have a weird tasted in my mouth. I ordered quesilladeas (sp) which came out as four. They were ok also I ate two while there and had the other two the flowing day. It tastes better the next day go figure. I ordered a mango margarita which was on point. My friend had a burger and fries and a drink as well the bill was only 60 bucks. I will prob try this spot one more time though.", "author": "T H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "This was my first time here and felt like it was my savior we just walk out off a restaurant that paid is no mind and ended up here on a whim and loved it the food is amazing, great drinks it was a bit crowed but considering how good everything was its to be expected. Our server Janice was great tended to every need   I will defined be back.", "author": "Chamel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Came to Rocco's today and had a fantastic experience. When we arrived, I checked in with the hostess who notified me that the wait for a booth would be 35-40 min. However, we were alerted through text that our table was ready within 15 min. Our waiter was Sergio. He was very professional, efficient, and one of the best waiters that we have had here. He explained the special of the day which was the red snapper and corn. We ordered it and it was delicious. I enjoyed our mango and watermelon marguerites. I also enjoyed our tequila shots. Delicious. Great experience and we will be back.", "author": "Ms C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-06", "description": "Very much a dissapointment. Food was very bland and lack-luster.  The place was not busy at all but still took over 12 minutes for someone to come over and begin to take our drink order.  They brought out our dinner before our appetizer,  and i had to ask for my margarita when they brought the dinner.  Between the lousy services and mediocre food, I wont return.", "author": "John L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "The margaritas and the drinks in general are really good and pretty strong but the food is very very average. I suggest going only for drinks and guac.", "author": "Jape D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I go here frequently and LOVE the tacos, especially the Shrimp tacos. On Taco Tuesday you really get good deals and also during happy hour. The option to have a glass or a pitcher of margaritas are also a plus.", "author": "Sable J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "Tequila Mojito was fantastic.  Tacos were pretty good.  Worth going just for the chips and salsa. \nPacked on a Friday evening.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-16", "description": "Food was quite good, service was pleasant, and they sat 11 people when we walked in. However, it took a very long time for the food to come. Granted, we were there on a Saturday night, but if you're already hungry I'd say skip this place. But if you're up for it, the guac is amazing.", "author": "Elsie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "Was told 15 minutes for a table.  An hour came and went and still wasn't ready.  I understand Friday's are busy but be honest with your customers.   \n\nFor a margarita bar the mix is way too sweet and overall the quality was inconsistent with cocktails.  I ordered two jalapeno margarita's.  The first one was decent and tasted mostly of jalapeno.   The second one was all sugary mix, very little tequila.   Part of the problem is that the place is just too busy for three bartenders and the one's that were working spend more time trying to figure out the computer system then making drinks.    \n\nAnother thing is loaning out sombreros to customers.  Maybe in Florida casual racism is okay but not cool in Brooklyn Rocco.  Not cool.      \n\nFood was whatever.  Much better Mexican can be found close by but I imagine you are not going there for the food.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Very nice atmosphere with live music. The elote is very good.. Drinks are good and service was awesome...", "author": "Jesslyn A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "A review short due, formerly Mortons Steak house, Rocco's has taken what is a very spacious place and turned it into a hip trendy restaurant and bar that makes fun into and all night festivity. To begin one must try the tacos sample from meat, shrimp to fish tacos.\nThis meal is quiet flavorable and filling especially the mahi mahi grilled fish tacos. Listed as an appetizer this plate along with a start of fresh hot Doritos, plain or with all the trimmings will fill you up. A second visit was a must. \nOn this particular day the boys decided on brunch menu. I opted for the waffle with strawberries and cream. The waffle was made perfect as I usually prefer it to be crisp on the outer and buttery on the inside. I decided to add whip cream which tasted fresh surprisingly light and not store purchased. A burrito was added to my meal to finally complete brunch with no need to even think about dinner.\nThe burrito (beef) was combined with an array of spices to add a tender taste that will melt in your mouth. If you dare to pair a drink with such a meal try a Cajun Bloody Mary.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Went here for tge first time and everything was great. ..I had the surf n turf, margarita pitcher. And the best waiter DAVID ask for him", "author": "Momzie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "This restaurant is great. The menu is well put together and the food was outstanding. It was busy and still our service was good. Not that decor matters much, but the place looks cool too.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Such a cool and hip place. The food was good, but the price didn't match the portion. Decor was excellent, two stories with a huge tequila room. I really enjoyed how they made the guacamole table side. Good music , maybe a bit loud for the average person. Besides that I had a good experience and I recommend this place.", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Love it. Place just opened. I'm all in. Over 400+ bottles of tequila and mezcals. Even homebrew hot sauce that packs a punch. Chile rellenos were fantastic. There will be no other option for me when visiting the Brooklyn courts", "author": "Peter A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}