{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "One of my favorite local spots. Decent happy hour and the food is always tasty. This spot is always buzzing. Our waiter was cool and funny. He brought over some drinks that I guess the bartender made a mistake on. We also ordered a passion fruit margarita pitcher. They can accommodate different groups sizes due to space. I also think they have private events downstairs. I saw some drinks lined up when I went to use the restroom downstairs. Also, the restroom is cute and clean.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "This place is a must try! Anthony is the best bar tender. I had a steak taco. It was delicious -full of flavor. Anthony made me a delicious blood orange margarita. The kitchen screwed up or nachos. We order the bbq pork ones, but got meat inside. Anthony took half them off the bill! It was good.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-14", "description": "American version of Mexico   The space is really big. I sat at the bar with my lady and order drinks and steak tacos. Drinks was ok. My drink was better. Well my lady drinks was ok. She ordered Mexican Mule and a strawberry margarita. Both lack balance. My was a Mezcal Paloma, a lot better. \nTacos aren't authentic. Is was ok. Something a house cook can make at home.  Not sure I'll be back.", "author": "Benito M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-14", "description": "I was staying at the Marriott next to the restaurant.\nThere was no room at the bar. I asked for a table for one. The hostess said they wouldn't seat a table for one person. Very Disappointing!! I have eaten here the past, I won't be back!!!", "author": "Jeff A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Great food. We had a great time with our close family. Delicious and fresh guacamole. Definitely love the decor and friendly clean and spacious. Must reserve and plan ahead .", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-06", "description": "Oh my.  If you must, take out.  Food is good. But. Don't eat in. \n\nAs a traveler who from time to time stays at the hotel next door, tonight I made my second and final trip to this place. Travelling and eating alone (a 20 year veteran of traveling and eating alone) I sat down at the bar and was ignored for 15 minutes (it's a Wednesday....bar 1/2 full with 3 bartenders and a bar back).  Then.... oh so sadly (as it is her life and I feel sad for her.  But moreso for whoever owns this place) side pony tail and black glasses tatted girl throws me a menu and stands in front of me engaging another bartender in a conversation for another 10 minutes. \n\nLook.  Travelling.  Long day. I want a drink, chips and a taco.  Easy.  So now I'm here a half hour before even getting a drink.  Finally I order...she needs my card to start a \"tab\"...um...hand her my card.  Taco comes before drink (because this girl walks the bar talking to her co-workers and not ...um...selling drinks) also before chips, salsa, and utensils.  She notices this and take 5 more minutes to bring the salsa, chips and utensils.  \n\nI'm so sad for the owners that this is the employee they have to hire.  So.  Sad.  But I will not be back.", "author": "Susie Miller B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "This is my second visit to this place, the first time i went for drinks and the second time because i was so hungry i could eat a dinosaur. \nI was hungry so i went straight to the point and ordered the Durango plate from the combinations. It came with 4 little cheese quesadillas, one steak taco, and bbq pulled pork. It also had the a scoop of guacamole, sour cream and tomatoes.\nEverything was delicious but i will come back just to eat the bbq pork tostadas, that meet had no grease and it was like an explosion of flavors in your mouth.", "author": "Patty P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "I had my eyes on this place and went on\nBreak and boy it was good. Those margaritas is good, I'm def a drinker now. That drink got me so lit and the food is good too, the chips and guacamole, to me they kinda odee with the lemon/lime but it's good. Tacos good rice good salad good drinks good. I'm good I'm shmizzzzzeee", "author": "Ariel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "Came here with my friends for lunch after an exam.\nService was really good.\n\nI just think it took the food too long to come out, by time the food was ready we were nearly done with our drinks. Food tasted ok, got the veggie quesedilla, chicken tacos as well as the shrimp one.\n\nThe shrimp taco was sooo bomb, would definitely recommend.\n\nDrinks are really strong and great.", "author": "Mirabel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "Really great taqueria restaurant to stop at for lunch or dinner, the ambiance is so nice- it would actually be a cute date night spot too. The food was fresh, the chips and guac were on point. Location is convenient too. Just went for the first time today and our server Bianca was super nice and attentive. I definitely plan on coming back.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "First time coming and I loved the vibe. The decor is very captivating. They have TVs in the bathroom stalls even. Large seating area. We sat at the bar for the happy hour. I got a passion fruit margarita (passion fruit was extremely mild), strong drink. They took a while to bring the chips and queso. It was very delicious. I also ordered the chipotle wings, I didn't care for it, only because I like my wings crispy, flavor was nice. Will come back", "author": "Tiffanee A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "The guac is almost always amazing! Dean our server was great! We said we had half hour only, though I was kidding, but we had our food in less time than the table beside us who were there prior to us, had a different server, and we had steak - they had nachos and burritos! The manager also came over and brought our drinks to us - that was a first! Things are improving there I think. Not 5 stars b/c I think the prices are a bit high.", "author": "Maria O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-07", "description": "The restaurant concept here is awesome... unique decor, delicious tacos, table side guacamole, elite tequilas, and more. I've eaten at Rocco's in other cities and had a great experience. \n\nThe food was really good! Guacamole was fantastic, as was the gent who made it. The tacos were hot and flavorful, the enchiladas were cheesy and plentiful, and no complaints about food. \n\nI think that our greatest disappointment was the staff... which is a huge measuring stick of a restaurant. \nIt wasn't a busy afternoon at all, so much of the staff was standing around, chatting with one another, and mostly oblivious to anything except their own sections. The hostess at the front was the exception, who was attentive and helpful and super sweet. \n\nOur server, Floyd, for this particular experience started out energetic, super helpful, and excited to be there. We weren't much of a drinking party on this occasion, so after he took our order, we rarely saw him again, even when he promised to refill our waters. He apologized the one time he did come back, but even after that, he disappeared again and we literally never heard from him again. In fact, we had to walk over and get a manager to swipe our card in order to pay our bill. \n\nSimilarly, when going to the bathroom, I was ran into by two staff members (big bearded dude with a man bun almost knocked me over) who weren't paying attention due to their convos with other staff, with no apologies or acknowledgement of it even happening. That kind of thing puts a damper on the entire experience, regardless of the food quality. \n\nI want to give them another shot as I'm hopeful and believe it was a fluke, so I probably will. If so, another review will follow this one up.", "author": "Scott H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Great drinks chips and guacamole. Probably best ever. Bartender was surly.  That put a damper on evening. Apps other than these mentioned were 3 star. Slightly better than avg.", "author": "Sonia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "We were in the area and discovered Rocco's purely by chance, stopped in for dinner, and the entire experience was wonderful, from the food, to the service and atmosphere.  Our server Nathan was very attentive and friendly, and JP made absolutely  delicious guacamole right in front of us. I would recommend this restaurant without any hesitation; great food and a fun atmosphere, what more could anyone want?", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-15", "description": "It was just ok. The guacamole is definitely the best part for me. Its delicious!! Thats the only thing I need. Place is kind of expensive. The quesadillas are big but not greatly seasoned. The chocolate martini will hit you hard!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "My experience here was so amazing! Had the server Floyd and he was truly great! Floyd made sure I was always good with everything and that made me feel welcomed even more. The food was great and I left the restaurant so full I had take some home. They make the guac fresh and I feel that is cool! When it come to the service, food, and the vibe of the place it's def the perfect place to be! Thank you Floyd for making me enjoy every minute of it! Will definitely return!", "author": "Classy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "I ate here for dinner with two other folks. The service was poor all night. Our waiter didn't come around very much. He didn't use a notepad to take our order... Guess what, one table guest's order came out incorrect three separate times. The waiter spoke to his manager who claimed the best they could do was comp a side order and offer a free dessert. This doesn't really help when the meal was 5 times the price of the side order \u0026 we didn't have time or interest in dessert. Yes, they technically didn't have to offer any gesture of apologizing. However, it basically felt like they didn't care much about messing up our order. Next time force your waiter to use a notepad to increase the chances of getting the order correct the first time! \n\nFood was overpriced for the quality. Not really worth the wait or hassle to us.", "author": "Drew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "Sadly I need to drop the rating down a star. The last two times I have been here have just been okay. The service leaves a lot to be desired. Once our drink orders were taken our waitress disappeared. It was really difficult to get her attention to get our food order. It took a really long to get the check. The whole dining experience felt really drawn out. When we did manage to get her attention she seemed to be annoyed. The best part of this experience was the table side guacamole. Other than that I will not be running back to dine here again soon.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Went to Rocco's Tacos this past Tuesday while in town for work.  My coworkers raved about how great the food was and that it was a must eat at place.\n\nWe arrived around 715pm and they were on about a 45 minute wait for our table of 4.\n \nWhen we sat down we discovered it might have been that busy because it's all you can eat tacos for $20.  The waiter took our order brought some water and then we didn't see him at all for about 30 minutes.  We had ordered margaritas and he finally brought them to our table about 30 minutes later.  When he arrived with our drinks we had asked for more water and then it took him another 15 minutes to bring it.  Our food then came out about that time as well.  We were in no rush so the food coming out late didn't bother us plus hey make homemade guacamole at the table which was nice.\n\nFood was excellent service not so much.", "author": "Alissa O."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}