{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Guacamole was great. The atmosphere was cool. The food was just a step above Applebee's. Too chainy. Had the Quesadilla and something wasn't exactly right about it. It came with a Spring Mix on top that was soaked in vinegar? Not sure why... the manager came by and seemed nice but our server wasn't exactly suited for his role. He just wasn't warm and seemed very condescending. I mean.. we were just ordering food so I'm not sure what he had to be condescending about.. yet he was. I would recommend this for a quick lunch or a place to grab some chips in a drink if you aren't too concerned with being treated nicely by everyone on staff", "author": "D'Arcy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "Neither well-conceived nor well-seasoned.\nTheir $19 California Fish Tacos taste mostly of corn syrup, even after I doused them in lime (which I had to request, it didn't come with). Upon close examination, it appears that the problem is the ranch-like dressing which was poured in abundance all over the tacos. :(\nI do love fish tacos, and have ordered them many places. Here the fish is unfortunately battered and deep-fried, as I prefer grilled.\nDon't expect real Mexican spices. When I requested \"hot sauce,\" to try to help the situation, I received a small plastic cup of a red sauce which had only a hint of a kick.\nAnd the ladies bathroom? So odd. Smelled bad, but they did have a computer screen inside every stall -- behind the toilet, where you can't see it while you're seated there. (I guess you could hang out standing in your stall and watch it, if they had anything on. Which they didn't. And seems like the opposite of what you'd want to encourage.)", "author": "N N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Rocco's Taco\nNY Brooklyn Heights\n2pm Saturday 21st March 2015\nThree Stars maybe four stars\nUpdate\n\nWe had table side guacamole which was great. The tortilla chips were thin, crispy, and well seasoned. The fried plantains were sweet, chewy, and a must have at Rocco's. I got the beef wet burrito. It had rice, black beans, ground beef, and cotija cheese inside and then topped with red sauce and melted cheese. It also had salsa, sour cream, and guacamole on the side. It was big and filling. I also had a couple of $5.50 Modelos. The waitress was nice and attentive. The drink service took a bit longer than expected.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "This place was decent. It was in the area so I dragged my friend here for a mini-celebration. The atmosphere was nice, the servers were veryyyy happy (to my friend's dismay haha,) and it was a great all around experience aside from the food. As for the food and drinks, it was pretty pricey and I ate my tacos fairly quickly. I remembered using the sauce from the chips to add more flavor to my food which is weird since if I didn't order those chips, I wouldn't have had sauce and my tacos would have been meh. My drink was pretty pricey as well and I didn't expect it to be that size as well considering I looked at some photos before ordering. Just happy it was a great place to be at after a long day and that the staff is very friendly.", "author": "Stella G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "To be fair, I ordered take away via Seamless, and most of this review is based on the (non)service associated with that. I will give this place another go at some point, and hope for a more positive experience and an update to the review.\n\nThe standout bit is the service, for all the wrong reasons. Basically horrible, I didn't think I could find worse service than the McDonalds or Popeye's down the way, but this place nailed shitty service to a T. The hostess I spoke to upon arrival said \"just sit down there and I'll bring it whenever it is ready\" - hardly inviting. The only other person in the front was trying to sort a catering order, to which said hostess commented \"I don't know, it isn't here, nothing I can do.\"  Note to self, not a place to order from for an important meeting - don't know, don't care.\n\nAfter a few minutes I figured I'd rather wait at the bar, so I politely let her know I'd just be over there, which led to eye rolls and a certain sense I might not be getting any food. As it was mid-afternoon and there were only a few tables seated, I figured it wouldn't be all too long to make a few tacos.\n\nWhilst at the bar service improved, in as much as it was not openly hostile and just nonexistent. The bartender was so engrossed in a conversation with a patron that she failed to even look around. A young lady sitting next to me commented she had been waiting for 10 minutes to attempt to order food, just watching the conversation down the way. Finally a very distracted and unhappy manager-looking type walked past and the young lady mentioned how long she had been waiting and walked out. Good on her. It did result in the said absent bartender actually asking if I wanted anything upon the manager's prompting.\n\nSeeing as somehow a few tacos were taking a good while, I supposed I'd have a drink while waiting and ordered a classic margarita. It was classic in the sense that it would be great if one's already half in the bag. I was not, so it was classic in the disappointing sense. I paid immediately based on the assumption I'd never get her attention again. Thankfully, a rather cheerful server brought a sack with my name on it about 10 minutes later and apologized for the wait, assuring me the food was still warm (it wasn't, but at least she was nice). I never thought I'd be so happy to get away from a margarita. This server was the highlight of the experience, and I would have tipped her well were that an option.\n\nThe tacos were pretty OK, though painfully over-priced. $4+ for a taco is rather crazy. I'd have them again, both the chicken and chorizo were flavorful without being overpowering. But I'll not go out of the way, especially considering the price. Like most places, I assume the food is better dine-in - though they prominently advertise take-away, so one might think they have that down. They do not. From order to pick-up was about 40 minutes. For two tacos. Yes, that's right, two tacos outside the lunch rush.\n\nSo, for take-away go for Chipotle or better Dos Toros or any random taco truck. Maybe for a sit-down meal with some drinks it might be worth the ridiculous prices - the table side guac looked pretty good, but you're playing roulette with the service it seems. If these guys can step the service up to even a suburban Applebee's level they might have a chance, if not, the location is far too valuable for mediocrity to last long.\n\nPros: Cool decor, flavorful food that's not too spicy served with good hot sauce, open space could accommodate a group.\n\nCons: the whole review.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Only go to this bar to see Devon or GiGi. The food here is mediocre, but Devon's drinks are amazing. If you absolutely must eat, get the overpriced skirt steak with chimichurri. Tip: the fish tacos are extremely dry because they are made with mahi mahi, so stay away from that. \n\nAgain, just come here for drinks - and drink your tequila like a grown person. Don't be an adult ordering a margarita.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Confession: I noticed this place every time i make my way to Blink Fitness and instantly my carvings set in.  I've for the most part stayed strong and kept on my way to the gym; but it's always been in the back of my mind.  During a weak moment(or week) I made plans to put one of those tacos in my mouth!  and OMG Amazing! I ordered The Brooklyn taco....because BACON! 2 Thumbs up.  The Guacamole needed a bit more Salt Bae inspiration.  The Bartender that night seemed to be in a bad mood (she lacked smiles but was prompt on service so meh), and she was the only one working a football sized bar so...none of that mattered, only Tacos mattered. \n\nDecor was on point, not brightly lit and also not super dim romantic either where you would think only dates go.  Place is huge.  I will def be a repeat offender.", "author": "Draya-Renee J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-25", "description": "I gotta say I expected more from this restaurant. I read the reviews and really expected the food to be amazing!\n\nI visited with three other people. Honestly we really didn't enjoy our food. I felt my food was just too salty. I didn't enjoy the salsa. I liked the guac but expected better. \n\nThe one thing we all agreed on was the margarita!\nWe loved the cocktails. \n\nIt's okay. Not terrible. Just not great.", "author": "Annie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "I LOVE TACOS!! I HATE THIS PLACE!!  Food was terrible. There are so many better hole in the wall joints in the area for this type of food. The place might look cool but takes like trash. Avoid at all costs!", "author": "Steven A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "One word: Guacamole!!! \n\nIt is so tasty and prepared right in front of you (I am a guacamole addict). I tried the shrimp and crab one and although I wished there was more of it in every bite it was still very good. I have come on a few occasions with coworkers and friends and each time has been great. The chips come out warm, and the service has been very attentive. Came here for an early celebration for getting out of work early with some co workers. It's right in my neighborhood and its Mexican food (my favorite) so no complaints over here! An added bonus, free tequila shot with check in! Muy excellente !!!", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Great dinner spot. Wonderful service, especially from our waitress, Nicole. She was so hospitable and made the evening incredibly pleasant. Will come again!", "author": "Katherine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "I enjoy coming to this location. The food is typically really good and perfectly cooked. The last time I came for taco Tuesday I received really wonderful and quick service from my waitress. She was very friendly and made my visit awesome. Only 4 stars because the drinks are sometimes hit and miss when dining at a table vs. The bar.", "author": "Rae D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I didn't expect much from this place but i was happily surprised once i entered. The vibe made you forget that you was in Brooklyn and gave you a feeling you was somewhere in Mexico. My only couple issues was the seating where we were placed, The woman who greeted us didn't seem to concerned how we felt about that. They also messed up on my girlfriends order more than once. \n\nOther than that the food was good. Plus you get a free shot with a order of any entree once you check in with Yelp. Nothing beats free liquor!!\n\nI'll definitely be giving Rocco's Tacos another go", "author": "Sterling E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "Ok restaurant, good for Mexican type food. Good food, great drinks. Menu could use an update. Also need more choices for appetizers. Not one of my favs but would definitely go back. Also larger portions, they serve kind of small portions.", "author": "Ronald D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-09", "description": "I would have given this establish 5 stars up until we we are about to leave. We were taking photos and the back of house came out from their stations; dishwashers, bussers ect. I've been in the food and beverage industry long enough to know their positions. It was embarrassing for us to have an employee come out and yell out loud in the middle of the restaurant you're garbage in Spanish \"basura\" like we were trash for eating at your establishment. We spent our hard earned money there and we had a great time. The bartender at bar 3 treated us fantastic (I didn't get his name ). However that ruined our entire experience. We waited for a manager but no one ever came. This is completely unacceptable at any place of business.", "author": "Shisney P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "To experience bad customer service is one thing but to be continually harassed by the server who offered the bad customer service is another thing. This piece of shit of a waitress Lois or Louise whatever TF her name is served us water, eventually bought the drinks and that was it. The table adjacent from us was seated 20 minutes after us and the that was seated and the table behind was seated 30 minutes after our arrival had their orders taken promptly and courteously. \n\nI will say this - the manager Zena or Xenia was very nice, apologetic and tried to rectify the situation in a reasonable and respectful manner but the waitress kept coming back to the table being nasty and confrontational. How about just say sorry and try to correct the rest of the dining experience or initiate steps to correct your faux pas. No Lois/Louise not once, not twice but three times came back to the table to chastise us and berate and \nMake nasty remarks because we complained to her manager. \n\nWe see the general manager coincidentally come out the kitchen and we approach him and explain her less than warranted behavior. What does he do -- NOT A GOD DAMN THING. He tells the manager to assign us another waitress (Ashley) - who was very apologetic and tried to accommodate us but at that point we did not want to eat. \n\nNow to the bill. So we spent half the evening arguing with this piece of shit waitress and not eating but we have a full bill. PAUSE. The $$$ wasn't the issue but the level of disrespect and bulllshit that I just put up with and I haven't eaten and you bring me a $110.00 bill. \n\nNow I'll mention how helpful everyone wants to be when we upped and walked to the door!! \n\nThis place sucks. I work in the area and I will never spend another fkn dime here ever!! I'll do my damn best to make sure no one else does either.", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "This place is great. Definitely order the guacamole at the table. It's a must have! Ryan, our server was exceedingly nice and readily available. The quesadilla was tasty and the black diamond margarita is awesome!! I've gone three times this year with friends. Definitely, look forward to returning in the new year!!", "author": "Deliccate D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Ehh seemingly overpriced Mexican fare. Tried to get a table for 2 at 5 on a Saturday and was quoted a 30 minute wait when it look relatively empty. Got some apps on the 7 for $7 happy hour special and a pitcher of margarita; the margarita wasn't much to write home about, but the jalapeños rellenos were awesome, and the steak tacos and the empanadas were pretty delish as well! It's not posted, but the happy hour alcohol discount is $1 off drinks.", "author": "Erica I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "The two stars are literally for the chips. But for the chips this place would get 1 star. This place was a huge fail on all levels. The blood orange margarita was so basic and didn't give me that margarita feel. The guacamole was just ok. And the tacos were yuck. Nothing good to say about those. The  saving grace was the warm chips and whatever that is sprinkled on them. Tastes sort of like Doritos. They were really good.", "author": "Mickei M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "I went for a light dinner \u0026 drink. very nice ambiance, food is good but had a slight issue with my taco burger coming out rare when I asked for it to be Medium well (I ate more than half because I was hungry) \u0026 decided to still let the manager know about it \u0026 he remedied it by removing half the cost of the whole entree, he was very upfront about it \u0026 I will definitely be coming back again.", "author": "Charles D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}