{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Diane is awesome !!! Great service , great food. The tacos are great and the drinks are awesome -- get the house made guacamole for sure . Coming back every Friday !", "author": "MaryGrace D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-05", "description": "Sitting here now. I frequent the Marriott next door for my business travel so was glad to see the place finally open. Huge bar and took quite a while for the bartender to notice me but when she did she took my drink order quickly. Ordered the Brooklyn tacos and they came out quickly but cold and on tough tortilla shells. Took a while to flag down a diffrent bartender to request fresh shells. Didn't want to bother with sending the entire order back. She told me I should order flour tortillas b/c \"this is how the corn tortillas come out\". Well...ok....thats fine since I dont want stiff tough shells. So she took my entire plate. Cool. Maybe she is replacing my order. NOPE. She brought the same cold meat but on the flour tortillas. Oh well.... Nice vibe. Blood orange Margarita is good. Prices what I expect in NY. The food- no thank you. Though I thought the pork belly would be promising.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "I was here with a couple of friends and had a great time. The food was very good, especially the Guacamole that is prepared at your table was delicious! The best Guacamole I've ever tasted. The staff was very friendly, our server Albert made sure we had the best time and took very good care of us. I'm definitely coming back!", "author": "Lill W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Food was very good, waiter was friendly, no complaints about it,  I love the watermelon margaritas, just price was a little high BUT was worth It. Oh and almost forgot to much time to wait for a table, when seems not busy at all.", "author": "Ninosny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "I've been waiting months for this place to open and was not disappointed!  Despite being brand new the service was spot on and food delicious!  Try the Brooklyn tacos and guacamole.  Thanks to Brittany and Brian for making the experience perfect!", "author": "Steve S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-18", "description": "Omg the food was terrible!!!! Bland, flavorless seriously when you think of Hispanic food you think well seasoned not in this case listen im no drama queen or pessimst the food was horrible my first time in life asking the bartender for a do over the drink tasted like cough syrup 2 stars for the ambiance", "author": "Niya O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "Cool atmosphere.  Great for brunch or drinks with friends.  The chili mango drink is on fuego!", "author": "King Yan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Neval the waiter was amazing!!...very attentive to my party and I. The chips and guacamole is sooooo good I second guessed ordering anything else. I ordered a mixed quesadilla with chicken and shrimp.....that was probably one of theeee best I had. Now as far as alcohol beverages I ordered a passion fruit rocco margarita YUM!!! Had 2 of those and felt really nice not too tipsy or sober perfect balance for the time I went in the day .Definitely would be back!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "If I could put a negative star I would. I went with a party of 16 females. This was the worst service I have ever received. It is not like me to write reviews but I feel I must warn everyone don't waste your time. One waitress refused to serve us before our party even sat down because we were asking for beverages after sitting for a half hour waiting. If took about 4 hours prior to our food being served.  The whole wait staff was very unprofessional. Do they even have a manager in this place because not one came to our table. If you enjoy sitting and waiting hours for food please enjoy but if you have any class or respect for yourself do not go here. Not even a $1200 tab can gain respect. I was so excited to try this location because I have been many times on my vacations in Florida but you will never have my business again.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "Drinks, food, vibe;  An avocado-green emulsion of EPCOT, Orlando International Airport, Orlando in general, Vegas...off the Strip, ..and Señor Frogs.   Not cool.   :-/", "author": "Don E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "When I walked out of this place I was going to give it 3 stars. And then I let it sink in some more and I digressed to 2 stars. The food wasn't terrible but it was just very average. I just felt like the food wasn't greatly season. But Great atmosphere to come grab drinks with your friends. And I'm sure if I was drinking or had been drunk this may have gotten 4 to 5 stars", "author": "Perry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "How does a suggested tip for drinks that were separate from the original bill become mandatory after a group dinner that was $50/person which included an already mandatory 20% tip for: a small side salad, guac that needed salt, small entree, dessert and an unfriendly wait staff?   Rocco's tacos has watered down drinks, a great tequilla bar and a nice atmosphere.  Due to the guest of honor at the dinner, good company and Rashad the gem of an event planner the evening was nice.  It's a five minute walk from my job but unless they're giving away something free I won't return.  Chiptole at 1 Metrotech is much tastier and the staff is much friendlier I suggest that one goes there instead.  *insert eye rolling*  A further tip is to retrain the wait staff in customer service.  The waitress neglected to take the order of the person sitting next to me and when she got up to tell the waitress, the waitress advised that she wasn't sitting there and argued with her instead of just taking the order. The other waiter argued that I had to pay the tip since it was a large group.  I thought that's why drinks were on a separate bill so how is the large group factored back into my 2 drinks bill and since when is a tip mandatory?  Furthermore what did you do for a $20/person tip? So mad that my coworker paid that tip.  One should not be rewarded for below average service especially since one already received a blasted tip.  The 3 stars is for Rashad and the tequilla.", "author": "Ronsheeka H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "For those with food allergies, it's always a challenge to eat out. When your server is in training, your night out could get pretty dicey very quickly. Fortunately for me, the server in training was accompanied by a very attentive and adept senior server, David Torres. He ensured me that the chef would be aware of my concerns and was quick to turnaround an item that missed the mark. I had a taco salad that I tore up. Many thanks to Torres!\n\nAnother positive, an amazing margarita with Milagro Silver -- very smooth, flavorful and not too sweet. \n\nNow for the negatives: The noise level was entirely unnecessary. The place was perhaps half full on a Thursday evening around 8PM, but the music was blaring like it was a nightclub at midnight. The server in training was a soft-spoken, low talker -- which forced me to ask her to repeat items. My date and I may have left if we hadn't ordered a full pitcher of margaritas.", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "I posted four stars for customer service and no wait time though I did go to the downstairs bar where it was a bit less noisy.  The female bartender was friendly and attentive. The food was okay. I ordered pollo al carbon (roasted chicken) which came hot temperature wise and i didn't wait too long but the negative is that it was not seasoned at all. The veggies that came with it were fresh. It did the job of filing me up but it was forgettable.  I think their specialties (tacos and grain based dishes) tasted well enough as per my bar companions.", "author": "Ireen N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "On 12/13/2016, six of my coworkers went to this location to celebrate a coworkers birthday.   We were seated off in the overflow area.  At first we thought it was really cool because we were all alone in the section.  That feeling of coolness dissipated really fast when we met our server Lisa.  Lisa took forever to come to the table to take our order. We almost felt like she forgot we were seating in that area.  We started with some chips, salsa and two pitchers of drinks, which again took over a half an hour to arrive to our table.  Keep in mind we were on our lunch hour.  After Lisa got lost for another 30 minutes, she arrived back to our table to take our order.  One of my coworkers wanted the unlimited taco special that's on the menu.  She immediately stated in a rude manner, you can't order that because it's an item that must be consumed by only one person and the camera's will be watching us to make sure only one person eats it.  We were horrified that she would come out so rudely to patrons who monopolize this establishment on a regular basis.  We asked to speak to the manager and a gentleman named Al arrived to our table.  We informed him about Lisa and he reaffirmed everything she said and walked off.  His demeanor was so egotistical and arrogant.  After Lisa arrived back to the table after 15 minutes had passed, we asked for a check because we refused to eat at establishment that has no quality customer service from both Management and its  employees.  Lisa didn't even have the courtesy to bring us our bill, another server provided it to us.  Because courtesy was lacking, Lisa lacked a TIP.  Needless to say we would not be patronizing this establishment in the future.   MC.", "author": "Margaret C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Had dinner here with my sis, mom and neices. Nice ambiance, good food and our waitress Hayley and guacamole maker McCoy were the best. They were   friendly, attentive, professional and just all around awesome. Shout out to manager Zima... I will be returning on Wednesday with some co workers...", "author": "Joyce W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Lovvvved the guac and the margaritas!  The Wet Burrito was delicious too. Great staff.", "author": "Deb M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "great experience for my first visit. thanks too my daughter treating me too lunch!! my first taste of guacamole was a tasty treat. friendly waiters ( albert) nice plate sizes !!! food excellent!!!  buy the margarita pitcher comes out cheaper!!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Great family place to take your kids (especially for brunch)!  Their kids menu is only $5 and the portion is as big as for an adult.  We got a burrito for our daughter and it came with fries and i could have eaten it as my meal and would have totally been full.  We normally go for lunch/brunch and I like to order the Shrimp Quesadilla which is quite good.  We've also ordered the fish tacos but that is a bit smaller, so don't order that if you're super hungry.  My husband likes to try their breakfast options and I must say you can't go wrong with any of their dishes.  Their chips are amazing - I could eat a whole basket myself.  They are homemade and go really well with the guacamole.  I would order the guac if you're going with a large group of people.  Overall, a great neighborhood place to go to especially with kids because it's extremely spacious.  I'd say this would be great for birthday parties too.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "Friday is definitely not a good night. There was an 1 1/2 wait for a table. Food was good but the drinks was watered down. Please don't waste your time and order the pitcher drinks", "author": "Michelle L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}