{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Went for a few drinks during class break for my 21st birthday. My waitress, Shaniqua (I'm pretty sure that was her name) was the bestttt! Nachos were great and the mojitos to die for! Loved it. Will definitely going by during class breaks more often now !!! Oh and it was 6 people, one tray of large nachos and drinks and 2 or 3 pitchers for a great price. Loved it!", "author": "Cristy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "Their food is so nasty everything seem precooked and  nothing taste fresh. they're drinks are super high and not worth it. I  was so  disappointed I've been eating Mexican food all my life and this is so unofficial. WHAT AH WASTE MY HUSBAND IS SO MAD AT ME FOR SUGGESTING THAT ME AND MY FAMILY EAT HERE!!", "author": "Carlina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "This restaurant had a fun and energetic atmosphere.  I went on a Friday evening for a late dinner and ate at the bar. The decor is awesome, there was a DJ spinning music remixes from the 70's through current.  The staff were all friendly and accommodating.  The food was good but the churros dessert was outstanding!!!!", "author": "Lia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "UTTERLY FLAVORLESS AND EXPENSIVE. I ate 1 of the 3 tacos I ordered and I was starving. I will never ever come back. Monstrously disappointed.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-03", "description": "Not far from the Brooklyn bridge, almost connected to the Marriott. The decor inside is beautiful, kind of rustic, South American and lots of blown glass lighting. They put a tv in the bathroom stalls...um, okay.  I'm here for business and traveling alone so I sat at the bar. The bartenders were all very attentive, friendly and seemed comfortable making suggestions about drinks and menu items. I had a jalapeño margarita that was really good, just a hint of spice, I'd go back for another.  I ordered the mahi tacos, the mahi was breaded-I didn't notice that in the menu description. The tacos had radish and cabbage with the mahi, they were kind of bland, but the bartender gave me some different hot sauces to spice it up...just ask they'll fix you up. I wasn't thrilled with my dinner, but I'll try it again, overall it was a good experience...maybe next time I'll stick to apps and margaritas. \n\nIf you check in on yelp they give you a free shot of tequila. You don't have to use it then and there I was able to save mine for my next visit.", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "(Left a previous review on this venue but wanted to write an update) I went to this venue last night and once again I was not disappointed! The DJ was good and this time I ordered the vegetarian enchilada(I'm a vegan) and it was good. Also ordered the pomegranate margarita and it was really good!(Better than my last visit where I ordered the mango margarita-that was mediocre to say the least) o\nMy only gripe this time is that the venue needs to designate a certain area for those who wanna dance so that people who are tipsy or drunk aren't dancing right on top of those of us who are trying to enjoy our meal.*Hint of the day*- we don't need nor want to see you grinding on each other.\nOh and forgot to mention in my previous review about t.v in the bathroom stalls! Awesome! Although, I'm not really sure as to who would stand in the stalls for x amount of time and watch television!", "author": "SaSi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Considering I never liked Mexican food I have eaten here several times.  I enjoy the atmosphere and the pitchers of margaritas. I try to have something different every time I go. The flautas, chimichangas, and wet burrito were good. The table side avocado was ok, I found it to be warm, and the person who prepared it was a prick. They can get pretty busy and food may take a while. My last visit was on Cinco De Mayo, there were no specials offered that day, which I found strange. I always check in with Yelp, which gives  a free Tequila Shot with the purchase of any entrée. Rocco's is slowly changing my mind about Mexican cuisine one dish at a time.  If your in the area stop in and give it a try.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "The food was awesome! I had the Wet Burrito with beef! Must say very good. With co-workers and their dishes were great.  Our male waiter was the best experience! !!! Really Nice. Decor is beautiful.", "author": "YumYum .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Just had brunch here, the portions are definitely sharable.  The bottomless Mimosa's are great, the food is fresh..the table side guac is delicious.  Leave room for the churros.  The staff was great and its a great place to chill in a Saturday afternoon!", "author": "Lise M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "This places is more about decor and drink than food.  I got a sampler of three tacos. Although good, I have had better elsewhere (although not in this part of town).", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "This was my second time coming here and I enjoyed myself once again. Our waiter was attentive and made sure that we were well taken care of. The only reason I knocked off a star was because I felt the food was not the same in taste like the first time I had it. The ceviche was a bit disappointing, I would of enjoyed it more if they removed the avocados and added more sea food but hey can't do nothing about it. The drinks were great like always but the food wasn't filling like the last time I had it, but I wouldn't mind coming back again.", "author": "Pharah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "Really friendly atmosphere and lively spot and I wanted to give it a higher rating but overall I couldn't. I was so happy that this place opened up by my job and it was such a cool spot that it made you feel like you were in Manhattan. Decor was great, service was extremely friendly and helpful. But food, ugh I wish I could give it a higher rating. I got the korean tacos and my colleague got the brooklyn tacos. The shells tasted like stale hard tacos. The korean taco meat was so tough and dry it was practically inedible. I tried to eat it all because I was hungry, but it was just so dry and tough. I highly recommend they change the taco shells and take the korean taco off the menu unless they can do it right. \n\nI am hoping this place is so new that it is still working out the kinks and I will maybe come back to give it another try since the spot is really pretty and the atmosphere lively. I just hope the food gets better.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "Great drinks, a little sweet for me. But a lot if alcohol so good. Had the tacos;  soft \u0026 hard. Okay. \nTVs with the game, good crowd, very lively.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "I reserved a table for 10 for a friend's birthday. We were promptly seated in a semi-private area. The restaurant is beautiful. Our waiter, Mo, was really patient with our group, which trickled in slowly. I had the shrimp quesadilla, which was seasoned nicely. My friends raved about the mojitos, both the original and flavored. This is a great after-work spot.", "author": "JANELLE W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "I had a fabulous experience at Rocco's Tacos. I met there with a few of my girlfriends for girl's night and got nothing but great hospitality and food from the moment we walked in the door. \n\nOur server Shawn was an absolutely dream. He exemplifies quality service and knows the menu like the back of his hand. He went above and beyond to make us feel right at home. \n\nBesides Shawn, my favorite things about this restaurant were the drinks (absolutely AMAZING!) and the decor was (absolutely beautiful.) The chandeliers that dress the entire restaurant gave it true character. The restaurants interior theme is full of wonder and surprise I'm very happy to see this chain make its way to New York. I'll definitely be returning.", "author": "Macy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Best Mexican hands down! Fantastic drinks (full alcohol) and food. This is your mex fix!", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "The customer service here is horrible/ with no help from management when asked. We had been sitting at our table for over an hour and we still haven't even gotten water. After 45 minutes of sitting there the waiter came to take our order, we had a question about the menu that he needed the manager to answer, but yet still wasn't attentive to taking our order. He walked away, 20 minutes later, no manager. So my friend flags down a manager who was dismissive, condescending, and quite rude when asked about a simple question on the menu whilst complaining about the time of service, and yet the food that came out was cold. This place needs to do SO much better", "author": "Kimmie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "The food here is definitely average. The service is generally good, but after having been three times now, I do not feel the need to return, especially after my latest experience resulted in a frustrating adventure trying to find our waiter for almost 30 minutes so that we could order food. Lastly, the price seems extremely high given the quality of the food, and it certainly seems like they are overcharging and relying on traffic from the hotel next door.", "author": "Dave T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "First of this is not my first time at this restaurant. Everything was good up until it was my best friend birthday and the manager asked him for Id. Who those that for a slice of cake, anyways the manager name is Chris very arrogant and self centered, they need to hired better management,won't be celebrating anyone birthday her lol. Ps don't forget your id if you want a free piece of soggy tres leche cake lol", "author": "Amarelis F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "The Gaucamole with chips. Period. The chicken tacos were also filled with a burst of juicy spiciness. Loved it", "author": "Abhishek P."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}