{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Food and drinks are amazingggg.  Atmosphere is authentic. A server comes and makes your quacomole fresh at the table.  think im addicted! I've been here once and have been talking about it to everyone ever since. If you're thinking about coming here stop thinking and GO!", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "Absolutely terrible experience - the highlight of the dinner was the friendly guac-guy Humphrey (thank you) and the interesting decor.  As for the rest of the experience - \"methinks not\" is exactly it.  Our waiter appeared to be in a hurry all night, unless we simply got on his nerve and he just wasn't very good at hiding it.  The pitcher of Sangria with Grand Marnier reminded of a non-alcoholic fruit punch more so than what you would generally expect from Sangria, especially a \"spiked\" one (so to speak).  For entree, we had the Campeche and the Molcajete Seafood.  While the Campeche was simply not impressive (with cold rice on the side), the Molcajete was just terrible.  The dish was scolding hot, with ingredients (that were difficult to identify) either too chewy or too mooshy, with very poor seasoning choices.  Being that we were clearly annoying our waiter too much already, it didn't make much sense to also mention that the plate in front of me was dirty.  Molcajete did get comped by the manager as 95% of the dish was still there when we asked for the check and it was quite obvious (or not) that dessert was not going to be part of our plan for the evening.  Never again ..", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "This place has a really cool ambiance and is always packed for happy hour. I had friends in town and went for a margarita and chips with a salsa. Both better then your average Mexican. I had a champagne margarita that was delicious and the chips for the salsa were also really good. I would  definitely go back on a Friday night and try some other food.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "My waiter was Jarren. He was awesome, such a great energetic person. Made the experience even better and the food was outstanding. Definitely coming back; cool place, great food, outstanding service- cant go wrong.", "author": "Angie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-20", "description": "Some generous posts here, perhaps its the tequila. This is a typical eatery that survives and even thrives based on the near vicinity to a popular hotel. The food is average at best and lacks flavor. Its certainly not memorable. Salsa is pico, chips are covered in a spice many may not like. The tacos are small and came out cold. I tried two types and both were bland. If your coming here for atmosphere,  and drinks with a side of food your not going to care. If not id keep looking around", "author": "Jason M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "Weekday lunch review. Don't think I've ever had worse service...ever. Waiter was checking out single gal tables while taking our order, never came back with answer to 'fish of the day' question, no spoon provided for soup, no hot sauce after several requests. Soup. guac, steak tacos...so pedestrian. I suppose it's a good place for partying but alas, it was a business lunch and work was to continue afterward, so it was no party for me.", "author": "Ilyce M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "cool chill spot... you have to check out the downstairs bartender, gena. She's dope, and makes a great whiskey ginger.", "author": "Tisa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "Disgusting, almost inedible tacos. My Pulled pork turned out to be a single large lump of pure fat. Chicken tacos were inedible. I think the taco chip plate is simply leftovers thrown onto limp chips. Taste of all tacos was putrid and sweet. Service is appalling - we had to repeatedly ask to be served and then to get the bill. AND - the piece de la resistance- a very intimidating guy in full bloods gear who had been chatting with the waiters plonked himself down at our table and demanded money! I gave him the $5 that waiter would have got as tip. Suggestion: most restaurants with numerous huge, heavily muscled waiters have ways of ensuring their patrons are not bothered by homeless guys extorting money.", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-13", "description": "When I go to dinner I'm not expecting a DJ screaming into a microphone \"scream if you want a shot of tequila!\"  Again. And again.  Thankfully he also requested that I visit yelp, so here I am.  \n\nThe waiter didn't know the fish of the day.  Not a huge deal, but really?\n\n3 of 4 of us ordered a beer.  1 modelo and 2 negra modelo. 3 modelo's arrived. It took long enough that no one was sending one back.\n\nI ordered the fish of the day but when the other 3 entrees arrived mine was no where to be found.  Runner disappeared with no explanation. About half way through my friends meals someone leaned over from the pass and yelled it would be out in a minute.\n\nWhat arrived...  5 minutes later was an absolutely carbonized piece of salmon. I knew instantly what the inside was going to look like but I just couldn't resist looking.\n\nWhat lay under the charred crust was a 1/4\" of dry white salmon with a raw center.  So someone (kitchen/server) forgot my entree and blasted one out on the fly trying to cook it in the pan without a requisite trip through the oven.\n\nDid I mention that the DJ also requested that on 3 we all scream \"thank you Rocco\". I however will scream \"thank you Shake Shack\". You were next door with a hot juicy burger in less time than it takes to find out what the fish of the day is at Rocco's", "author": "Matt G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "Just skip this place. I really really wanted to like it. I live 5 minutes from this restaurant and would love to have some decent Mexican food in my hood. As a native Texan, I'm still not sure why it's so hard to find a basic, delicious, well made taco in NYC (other than El Original or Javelina--both five stars in my book). The guacamole is decent, salsa ok, fish taco is basically long john silvers wrapped in a tortilla. We received our margaritas 15 minutes after ordering (the only saving grace--their margs are great) before we had to ask for our first glasses of water. Overpriced, slow service, bland food, but so much potential in this space and location. You're better off walking 10 minutes away to Lobo for anything resembling Tex Mex.", "author": "Brandy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Rocco's Tacos and Tequila bar is actually an amazing experience from start to finish. I have never been a fan of guacamole, until I had it freshly made for me at my table when I visited the restaurant. The group that I was with ordered guacamole for the table, and we were surprised to see someone come over to the table, with a fresh avocado along with other ingredients!!! We watched in amazement as the young man created the most exquisite guacamole we had ever tasted. We ate so much guacamole and chips, that it was hard for us to finish our meals. Our main courses were just as yummy as our appetizers. The décor of the restaurant was also impeccable, but the bathroom was what stood out the most to me. First off the bathrooms were clean, and there were televisions showing current movies in the bathroom. I was amazed at how detailed the wall paper was in the restaurant that I couldn't help but admire it. If you're looking for a fun time, or a place to kick back have dinner, and a great drink, choose ROCCOS TACOS!!", "author": "Cherishe C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "Came here on a Tuesday evening for unlimited tacos.\n\nAtmosphere- This place was pretty decent. The vibe was good. I came here with a large group and we were well accommodated. They played music, which was great. They had a good choice of music selection.\n\nFood- It did take over an hour to receive our food. I would not recommend the chicken tacos, as the chicken was dry and tasteless. It seems as they did not use any seasoning. The hot sauce made it better though. The shrimp tacos were good.\n\nOverall, despite the tasteless chicken tacos, we did have a good time.", "author": "A J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "We came here last night with a large group. The food was okay, I had the enchiladas verses which comes with shredded chicken in it. It was only okay. We also ordered a couple bowls of the tableside prepared guacamole, although a little expensive, it was very good. They have a huge selection of tequilas you can see through a glass room, although I wasn't able to try any during this trip. The Service ended up being someone of an issue. It was a large group, and one of the people with us did not get his meal, and so we had to flag them down to bring it, and it took a while. Then when it was time to pay, we also had to go looking for the server. I'd eat the guacamole again, but if I had anywhere to be afterward, I'd worry about the seemingly difficult to find servers. Really I'd say 2.5 stars. Could be worse but could be a lot better too.", "author": "Vic S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "Nothing special at all. I had the Mahi Mahi, veggies and beans. Everything tasted so commercial. I waited a while for the server. I then ordered a dish and requested 2 side dishes. The guy didn't tell me that my dish all ready came with the same exact side dishes! How silly?", "author": "sara s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Demetri was an awesome waiter.  Gave good suggestions on entrees.  My husband and I split a molecajete surf and turf bowl. It was delicious.  I would recommend this place to anyone looking for Mexican fare.", "author": "Holly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-04", "description": "From the moment I got my drink I knew that I was not going to like this place. I went wit h a group of friends and we ordered strawberry margaritas on the rocks. It tasted water down, no alcohol, and very little strawberry flavor. When we expressed our concerns to our server he stated \"okay so\" and was rude. He later told us that we should each get our own margarita instead \"if we really wanted to taste any liquor\". To eat we ordered the guacamole to share and our friend ordered two tacos. After our friend's order came out wrong (she ordered two soft tacos and was given two hard tacos) we asked to speak to a manager. A manager did not come to the table for a few minutes but our server offered to take the margaritas off the bill. We were only able to speak to the manager after my friend asked the hostess.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "Food was less than desirable. If you are looking for cancun style drinks and food then this is your place. Comparable to señor frogs.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Beautiful space and lovely bar. Food and drinks are delicious. Slightly overpriced but not unheard of for the area. This is definitely my go-to place for a quick meal and stiff margarita.", "author": "Gerald H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "I work right next door to Rocco's Tacos and my colleagues and I eagerly anticipated its long delayed opening. Lunch and after work drinks place -hurray!\n\nSome of my colleagues beat me to it when the place first opened and consensus was, \"meh.\" A colleague and I decided to try it for lunch to see for ourselves. Cutting to the chase - meh.\n\nWe ordered guacamole, medium spicy. Looked great as it was pounded into submission tableside, but pretty flavorless. Then we waited for chips. Our waiter came over and asked brightly how things were so far and seemed surprised when we noted that we were waiting for chips to go with the guacamole. Took a while for them to arrive. I know others have commented on the deliciousness of the chips but they reminded me of Pringles - in a bad way - and that red dust was annoying. We got some plain chips and they were unsalted and flavorless.\n\nWe each got one taco and those tasted fine, but were cold.\n\nWill I go back? Probably, for drinks. It's a shame, they went all out on the interior and have a tequila library - all v snazz and visually pleasing, but the food is a miss. Wish I could order in Chipotle.", "author": "jane p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Great restaurant. Great food.  I give it s gazillion stars. Staff is friendly and considerate of any food allergies or intolerances. I highly recommend it.", "author": "Stephanie W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}