{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "I have a thing for big festive Mexican restaurants. They're fun and loud and the food is plentiful and you can just relax and sip margaritas and much on chips and enjoy yourself. \n\nYou can do all these things at Rocco's, except for the enjoying yourself part. \n\nThe food is average by NYC Mexican restaurant standards, which means it is bad by the standards of CA, CO, NV, AZ, NM, OK, UT, OR, and WA. \n\nBut the service is the biggest issue. It took us 35 minutes to get our starter: nachos. Yes, nachos. We had a seat near that kitchen, so we could see tons of other food coming out, most of it to feed people in the private rooms in the basement. This place is massive, and on a crowded night, they just can't keep up with the demand. Our waitress was lovely; she apologized, brought us some free chips and salsa to much on while we waited.\n\nWhen the nachos arrived, they were burned (that's what 35 minutes will do to chips) and pretty poor. \n\nTry Don Chignon instead. Much better food.", "author": "Justin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "The waiter took some time to acknowledge us. The food was ok a bit salty . The Cobb salad was great. The chimichanga is ok the beans are a bit tart might of been a bad batch. The wait you brought my food almost spilled it on the floor. Won't be coming back", "author": "Cassie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Service is just excellent. Jessica is an extremely great server. About to drink this drink \u0026 eat these Nachos. First time here, so let's see what it's worth.", "author": "Chef Simone R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "I'm big on customer service and like to be acknowledged when I go into a place. I went here thinking I'd pick up some dinner for myself and my husband. I went to the bar to place a to go order but wasn't even acknowledged. There had to have been at least 6 people behind the bar two of which looked directly at me but never even gave me a menu or glass of water or a smile or a hi...I understand it's busy...But just a quick hey I'll be right with you will go a long way especially when you're asking me to spend $35 for two quesadillas. Eh, I should've just gone to yummy taco.", "author": "Kamilah E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "I'm not sure how this place is so highly rated; I'm starting to think that New Yorkers have very low standards for Mexican food. All the food tastes like it came out of a package. There was a shrimp appetizer that came with tortillas: The shrimp did not taste fresh and the tortillas tasted like paste. The enchiladas I ordered were very bland and did not have much character. Honestly, you'd be better off going to a Chipotle, which isn't saying much.\n\nI'm getting more and more convinced that the only good Mexican food in the US is in California and Te", "author": "Mr X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "First I went to the take out bar... the young lady there had a bad attitude ( she was an light skinned slim African American with a blonde wig on) she never asked me if I wanted hard or soft tacos , she didn't give me anything utensils or napkins. Service was bad but the taco was good", "author": "Shana W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "After 5 years of living in New York, this is easily the worst dining experience I've ever had. Our server was rude, condescending and disrespectful to the nth degree. Our food was aggressively mediocre. Taco's bland and under seasoned. Got my order wrong. Take my advice and go anywhere but here for food, let alone Mexican food.", "author": "Tiffen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "The table side guacamole is killer. Plus, use the Open Table and you'll never wait to be seated.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "The waiter took for ever to come take my order the drinks were weak, I asked for sangria I got juice!", "author": "Carlene G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This place is always reliable, the guacamole is out of this world, the empanadas are good, and the tacos are great. The servers are always very friendly and always willing to help. Very nice ambience in the middle of downtown Brooklyn, probably the best Mexican restaurant in the area.\n\nThe Tres Leche is amazing!!!!!", "author": "Christi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "I love this place. Food is great! Atmosphere is amazing vibes. The wait time though is really awful. We waited almost an hour.", "author": "Alicia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "I took it as a sign that upon approach of my hotel there was Roco's Taco \u0026 Tequila Bar. As soon as I dumped my luggage in my room I made a beeline for the establishment. I was there early at 4:30 PM so I was seated quickly as a solo diner.\n\nFor those who haven't experienced Rocko's be prepared for a stimulating decor, a busy and somewhat loud backdrop and a decent menu. The drinks menu wasn't as expansive as I was anticipating given where I was. Ordered up a blood orange Margarita that was large and gave me an appropriate buzz half way through. Chose a taco salad versus other things I would have preferred because the portions were quite large. Salad was very good though. Departed just as the place was getting seriously busy and loud. Service was attentive and polite. I'm not a fan of chain restsurants but I would return to this place with friends for sure.", "author": "Imakayak G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "We, 6 cousins, had come here for Taco Tuesdays one late Tuesday evening, after 9pm. The restaurant wasn't too packed, yet we were told it's an hour wait for a table and chairs setting. Maybe they had closed off a section of the restaurant, not sure. Anyhow, we're all relatively healthy sized individuals, lol, and were seated in a semi-circle booth. To be honest, it worked out to be nice and cozy, so no real complaint.\n\nI don't remember our waiter's name, but he was cool. We were all a bit disappointed to find out that chips and dip weren't not complimentary..... at a Mexican restaurant, but it wasn't a deal breaker. We ordered a pitcher of Margarita and 6 orders of the unlimited tacos. The Margarita was meh. As you would expect it was full of ice but we were each able to get 1 glass each. On a brighter note, because we checked in, we received a free tequila shot.\n\nNow the food: The Taco Tuesday deal is unlimited menu tacos, in groups of 3, any protein you'd like. We tried all of the options and loved all!!! They continued to bring out tacos in rotation until we left, and even allowed us to take our final batch to go. \n\nI would surely return and do Taco Tuesday again, I'd just skip the Margarita!", "author": "Cassandra Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "such a great mexican restaurant ! lots of room for dining available and outdoor seating too! super short wait time \u0026 very friendly waitress, if you order guac, they make it fresh in front of you (mild or spicy) happy hour is only available at the bar. portions are HUGE and everything is delicious and fresh", "author": "Kika O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-24", "description": "Went there tonight a white guy was serving us. We ordered right away and ask for guacamole service 20 mins later he came back and said they so busy that they can't make it in from of us, my husband when to the host and ask about it 10 mins later he came back and ask why we went to the host and we got the guacamole the guy who made it apologized to us for waiting so long, 45 mins later we got your food. That's why the guy who made the guacamole got a $20 tip and you my server got $5.. here's a better tip for you give better service!", "author": "Safyia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Where to begin. I would avoid this place at all costs. I'm currently in a booth at the establishment writing this review. Their portions are fun sized AKA small AKA for a child. If you're an adult, I recommend getting 2 of whatever it is that you're ordering. Service is horrible I waited 10 min to get water and to be greeted by my waitress. I ordered the Carne which costs $30. I asked for fries with my food and they come after 35 minutes of me ordering to tell me that they ran out. The steak comes and they give you literally 7 ounces of SKIRT STEAK! THIS COSTS $2/LB in the market!!!!!! RIP OFF!!!\n\nThey don't even have white rice! Are you even a Mexican restaurant?! You're better off going to your local Mexican bodega.\n\nBad food, bad prices, bad portions = BAD Restaurant. I wasn't even offered anything after making a complaint. The manager came and she said \"that's how it is\"", "author": "Michael K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "Everything is very bland. The \"refried\" beans tasted like they came out of a can. The pork tacos were too greasy. They put this powder on the chips, that just doesn't belong there. The red sauce is like ragú. The rice had no flavor. The fruit in the Sangria was fermented, not fresh and crisp, like it had been sitting around for days. Where was the basil in the strawberry basil margarita? The fish tacos were good, I'd say stick to that with a beer.", "author": "Awilda J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "This review is long overdue. I've been to Rocco's more time than I can count at this point, and every single time it does not disappoint. The food, the service, the drinks are always  consistent, and that is hard to find in a restaurant. The guac is always made fresh in front of you, and it so delicious in combination with the seasoned chips. My very first time there I had the tamales, and they were so freaking good. Every other time after that I'd have the Molcajete, and it is consistently delicious, and bubbly and hot. The drinks are never watered down, music is always great, and the service is always fast and friendly. Honestly, if you're in Brooklyn...even if you're not...take your ass to Rocco's. You will not regret it!", "author": "Akilah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Came here on an oddly warm winter night. As soon as we entered the place I couldn't help but notice the unique decor \u0026 setup.\n\nWe sat at the bat \u0026 we were immediately greeted My a very nice bartender. I had 2 drinks.. I wish I remember which Margarita It was, but It was BOMB. I also had some fish tacos.. Baja \u0026 Blackend Salmon.. both good, but the Baja was better. Overall this place was a great experience.. just a hit pricey, but you pay for what you get, right ? I will be returning !", "author": "Raheem C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Beautiful set up , food was pretty good just wish I was better with Spanish/Mexican food names. Service was good atmosphere makes you feel ease and enjoy your food.\n\nHowever I have had better Aztec food with less cost and knew exactly what I was getting. Perhaps they need servers who could explain an antree better when asked.\n\nI will definitely be back here for their happy hour sometime . Cheap booze sounds awesome. This seems like a great place for a hang out with few of your friends.", "author": "Aleaf H."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}