{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-15", "description": "Food was good but server Brandon was not pleasant and very slow. He easily cost the business a couple rounds of drinks as our food arrived and was half finished before he showed up with our initial drink order.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "Poor service. Food is def over-priced for what you get. And idk how you can make sure the guac is good when you make it table side and don't taste it. But the worst part was the bathroom which was so lady-unfriendly, I almost didn't use it.\n\nIt is in the downstairs (basement), in an empty area, around a dark corner. You get inside the bathroom and it is sooooo dark. Seriously, I am terrified of this bathroom. Don't pee alone, ladies.", "author": "Danylle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Right next to the Marriott Brooklyn Bridge. Great location, good location. I had a chicken quesadilla (added mushrooms) and it was yummy. My dinner mates had the Queso Fundido w/ Chorizo (4/5 stars) and the Austin Queso (3/5 stars) and the Chicken \u0026 Shrimp Tacos (4/5 stars). The white sangria was fantastic! Overall, a fun place to check out when you are in the area :)", "author": "Alexis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Food was really yummy! I hate the fact that when you ask for a small side of sour cream or something to go with your meal they charge you for it. I feel like it's unnecessary. I had The Brooklyn which was under tacos de calle section of the menu it was good but the bacon and he pulled pork together was soooo salty. My cousin and I decides to get a pitcher of the house margarita and mix the flavors Strawberry \u0026 Mango but there was like pulp from the strawberry side of the drink that I wasn't a fan of. Might just stick to Mango next time. Over all I do like the place and I think I'm gonna come back and try their brunch.", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "I was there for eight sip and paint event which was good that you can catch some food while having fun after work but they should make room for you to eat. Also, when you asked for a change or ask for a certain thing they should be very deliberate. The food was good but the service need to work; some may not tip the wait staff! (Luckily I believe in tipping)", "author": "Jameelah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "We decided to try this place out after walking over the Brooklyn bridge. It was nestled among a plethora of other eateries, but we chose this one due to the different style of food. We ordered chips and salsa as a appetizer and they didn't disappoint. They were finely dusted with a spicy seasoning that played well with the red sauce and green sauce that was provided, not to mention the pico de Gallo. Our entrees consisted of the wet burrito and the tortilla soup. Both were superb. The burrito made me so tired I had to go back and take a nap at our hotel. It was stuffed with rice beans and your choice of meat, mine was chicken. Highly recommend to people from the south used to eating Mexican food but scared that the northern places can't deliver! Some can't but this one sure can!", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "There guacamole are margaritas are worth coming for just that!  This place is right next to the Marriot which hosts conferences as well as the courthouse so it get very busy at lunch.  We heard from friends also attending the conference that the wait was really long because they were down a cook while we were there.  It's also odd to me that you have to order the bean and rice separately if you just want a taco plate.  We ordered them because I wanted to try them but it was a lot and really not worth it so I would skip that next time.  I got two tacos - one chicken and one spicy beef - and I really enjoyed them both but preferred the spicy beef one.  Also while we were sitting out on the patio we saw someone walk by the outside area, reach over the railing and grab a chip from the table next to us, dip it in their guacamole and keep walking.  The people were still sitting at their table eating!  It was really awkward.", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Came here on a whim and I am enjoying it thus far. I can never turn down Mexican. My waiter, Mike, was so nice and accommodating. Attentive and informative. I ordered guacamole and the chips that came with them were different than the normal tortillas you get. They were seasoned which can solely be eaten by itself. Also got shrimp and vegetable tacos which were very tasty. The decor is okay. I like more intimate vibes but this will be a great place to get a quick bite or hang out with friends.", "author": "Jaael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Rocco's Tacos is fun. The bar is a great place to have a drink in the area with some good bar snacks. The nachos, guac are great. There is even a little dance floor and a DJ if the tequila kicks in. It's loud and fun. The Chili Rellanos are great. Surprisingly I think the tacos suck. The tortillas are very rubbery. Skip them.\n\nService is okay. Not slow but not speedy. For large groups there is dining downstairs. NYC does not have that many great Tex Mex places. This is one of them. When I am in the Tech Center I like to hit this spot for a drink and some snacks.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Great drinks and nachos. My husband got the all you can eat tacos and enjoyed them. Im giving them 4 stars because the bar was out of a few items on the drink menu which was inconvenient and it took two staff 20 minutes to get me a glass of water with almost no other customers at the bar.", "author": "Dahab H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I don't know why this place has 3 and a half stars, because when I went over there last week everything was great! \nI liked the atmosphere, design and polite waitresses. \n\nReally liked their guacamole that they made fresh by your table. I got vegan taco with mushrooms( which actually was SUPER delicious! ), skirt steak taco ( my #1 always) and telapia taco ( this one was okay, didn't really like the fish much ). \n\nI didn't tried their cocktails, but next time will do for sure! \nAlso they have unlimited tacos on Tuesday!!!", "author": "Nikolina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "Visited here on a Sunday evening. Seated within 5 minutes. The decor was fitting for the cuisine. The cup on our table was dirty and the waitress replaced it right away. We ordered the guacamole,it was very good and made table side. The rest of the food was nothing too special. I ordered a rojo sauce shrimp appetizer that came with corn tortillas. The sauce for the shrimp was not very flavorful and the tortillas were very thick. Our waitress was very nice and sweet. I would only visit here again for the guacamole.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-19", "description": "Horrible service!!!! Upon arrival we were offered chip and guacamole. It's a Tex Mex restaurant so cool, a guy comes over and makes the guacamole fresh at your table. You aren't told until after you have already ordered that you are charged for this service. Fine no big deal we should have asked. Waited over 40 minutes for my order to be told the kitchen lost it. Once it was prepared it was wrong. I ordered a shrimp and steak quesadilla I received a steak quesadilla with enough cheese on it feed an army. And the tortilla used was extremely heavy not light as the type I am used to. Due to the mixup and wait time caused in the kitchen management offered dessert as a comp. but only offered dessert to one member of my party although there were two of us who both waited an extended period of time for our orders. Our waiter Bryce tried his best however his support staff (the kitchen) sucks. Management and kitchen needs to be retrained. I work in customer service myself and this was unacceptable. Will not be returning and definitely won't be recommending. Bryce your service was excellent. Thanks for trying to help where you could!", "author": "Fatimah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "I'll give 3 stars cause the place is nice! Good to impress your guests, nice decor but thats it!\nFood is meh! Mexican restaurant they MUST have salsas green and red! They dont have that!  I was soo pissed! Instead they brought some bottle with some called \"habanero saauce\" at least the guy that i asked for salsa tried to help me out, but it just ruined my dinner, tacos in a fucking cold flour tortilla? Are you kidding me?? Really salty meat Chips and guac they asked would you like it regular, mild or hot?? We asked HOT!! Not a tiny bit of spiciness .... i just wont come back to this place.\nI've been in sooo many mexican restaurants and i always post reviews about them, but nothing but the truth.\nRoccos Tacos it was in my waiting list to try... and when it happened it really dissapointed me", "author": "Serxjo A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Stumbled across Rocco's one night coming from another place and had never heard of it so decided to come back. I've gone twice, once on a weekday and once a Friday evening. Expect sometimes up to an hour wait on weekends, even just for 2 ppl, but on a  Wednesday I was seated right away. \n\nI had the shrimp quesadilla which was big and filling, but nothing to write home about. I also had the blackened fish taco which was small but super tasty and flavorful. So good that when I went back to Rocco's for drinks, I had to get a fish taco again. \n\nDrinks were tasty and had the right amount of tequila. I tried the pineapple fusion Mojito which was tasty and had a bubbly taste to it, so I'm guessing maybe a splash of pineapple soda? And my boyfriend had the pear margarita which he said was great. They also have guacamole you can order and have made table-side which is great. Overall I would def come back again.", "author": "Robin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "I did a reservation on friday for a group of 15people. We went the same day to see the restaurant and it turn out that the lady was very helpful and help us decide on what we should offer the guest. On saturday 04/21 we had our diner and our waiter (forget his name) was very customer oriented and very proper. He was very corteous and he assist us from start to finish. The food was at our expectation and the guest enjoyed the Flautas and the guacamole. We had a good time and I will recommend this restaurant.", "author": "Kimberly B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-29", "description": "A friend and I had \"lunch\" there yesterday . Hands down the worst experience ever. Her and I waited over 30-40 min for the chefs to prepare 4 tasteless tacos -2 each amongst each of us . We had the platter option for our tacos and that wasn't even worth the $13/$16 (they charge you the expensive flavor if you want to mix the tacos)And 3 pieces of mini corns that cost $6 that weren't even warm. We arrived there around 2:30 pm .and didn't receive our food until 3:10pm. Honestly should've listened to my father and took my money else where. Overall horrible experience never would I ever step foot in that place again . Way too overpriced and not worth the money at all.", "author": "Akiba W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Made reservations for dinner it was our first time here with my family and bf. Service is fast. Margaritas are amazing. Food was great we ordered 2 Durangos and 2 gaucho platters and we couldn't finish all that food in one sitting. Nicely decorated. Street parking is a bit hard to find but there is a garage on the same block.", "author": "Nicole V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "My lady and I love the guac and chips here we found this place one night after walking the Brooklyn bridge back in August we've kept coming back great staff also", "author": "Gabbi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-14", "description": "This isn't the cheapest Mexican lunch to be had in Downtown Brooklyn, but the food is better than the Chinese-run* taco shops a few blocks away. \n\nThe burrito bowls are plenty of food to hold you over until dinnertime, and the taco salad is really solid, despite not being in a gigantic taco shell like the gods intended taco salads be served. The protein (chicken especially) can occasionally be entirely too salty, but salt never killed anyone.**\n\nI've yet to dine inside (I'm more of a takeout window and eat at the outdoor tables kind of guy), but I look forward to someday having margaritas with them. Because I like margaritas.\n_____________\n*This is no knock on the Chinese. I just don't remember the names of the joints over there, I only remember very cheap, not amazing tacos/quesadillas. You get what you pay for.\n**Unless you count heart disease...which I guess kills lots of people.", "author": "Peter D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}