{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "The food at Taco Bell taste better than this over priced place. How does someone mess up guacamole? The lady that made it at our table put so much salt it was inedible. I wouldn't  go back here even if I got the food for free.", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "FAVORITE MEXICAN RESTAURANT. Amaxing chicken tacos. Love their passion mojitos amazing place yo go hang out after work", "author": "Jani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Now I don't have to wait to go to Ft Lauderdale for the best guacamole and mango margaritas!!! Service was great.", "author": "Rosemrie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "The $12 guac tasted like it was missing avocado and took a solid 20 min for the person to come over after ordering it. Everything was over salted and service was sporadic.", "author": "Anny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-24", "description": "This place has gone downhill, food tastes old, staff is very unprofessional ,loved Rocco in Florida , doesn't make it in Brooklyn", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "Omg - to die for nachos \u0026 Margs. Reasonable prices, cool atmosphere with awesome music. Good service - waiter and kitchen took an allergy concern seriously (my meal came out w a plate that clearly marked allergy) - which is always appreciated. Would comeback here, even with its distance from my UES apartment.", "author": "K W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "The atmosphere was decorated very well. My server was very helpful and prompt with my order. I had the sangria, which was decent. The guacamole was ok, I would have preferred more chunks of avocados (that's something I would have to request). The main course however was disappointing . I expected a better entre. I could have had a better burrito at chepolte. Overall... 2 stars.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "I love love love love everything on the menu! If u love tequila this is the place to be! Taco Tuesdays are my favorite day of the week! #tequilaheaven", "author": "Jenay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "We went to Rocco's Tacos and Tequila Bar last night for dinner and drinks. We live in the neighborhood and were watching for the opening of this restaurant for many months now. The food is excellent and the service is fine. Loved the guacamole, made fresh at table side. Our entree was fresh, tasty and substantial. I would give this restaurant 5 stars, except for one major flaw: the music is way too loud. We were seated right near the speakers, so we asked to be moved. At the risk of sounding old and uncool, it was quite unpleasant to enter the restaurant and find the music blasting to the point where we had to yell to be heard. We asked if the music could be turned down. The answer was n, so the hostess moved us downstairs, where the music was slightly less loud. So, although I'd like to go back to Rocco's Taco's, I might think twice due to the excessive loudness of the music. I can't imagine folks not returning to a restaurant because the music isn't loud enough; the reverse, on the other hand, is highly likely.", "author": "Jo-Ann S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I enjoyed the unlimited tacos. Dave made sure me and my friends had a great experience.  He was the best.", "author": "Ms N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "The experience was great. Highly recommend for a chill environment with great strong drinks!", "author": "Naomie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "There are many good Mexican and Tex-Mex restaurants in NY so why is \nRocco's Tacos \u0026 Tequila Bar worth mentioning? Well...Brooklyn is the only one of their restaurants outside of Florida.\nFood is average but the portions are large. I was here in Spring of 2015 when they were open about 6 months. Service was between excellent and mediocre. The location and size were very comfortable.\nIf Mexican restaurants may seem like a dime for a dozen, this Rocco's Tacos \u0026 Tequila Bar has yet to be a star restaurant in Brooklyn. Someone I know recommended the place as a great spot for lunch when working in the Heights.\nI was less impressed but their Margaritas are excellent - better than those I loved at El Rio Grande on 3rd Avenue in Manhattan. Guacamole is guacamole, burritos are burritos. \nRocco's Tacos \u0026 Tequila Bar has yet to carve a unique stance in a city where Mexican restaurants are as common as Halal carts on street corners. Targeting Brooklyn from Florida means catering to a crowd that wants more but with a palate for uniqueness.", "author": "I Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-24", "description": "The only star this restaurant is getting is for the food. We were ID'ed at the hostess stand which seemed a bit strange, especially since my brother and I were the only patrons that we saw the security guard ID. The server was very nice, when we could find him. The appetizer came out before our drinks, and I asked for a seltzer, only to receive it after I asked a second time and it came when the entree arrived. The manager came to our table because I sent my entree back after I found a hair in my food. I used to work in the restaurant industry, so I understand that things like that happen. She offered us shots on the house which we declined because we were driving. She then offered to pay for our drinks instead. When we got the bill the drinks were still on the check and the manager was nowhere to be found. We quickly paid the check and left. I am confident that I won't be returning. Hopefully no one else has this experience.", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "I came here to taste they food that everyone talk about, and I couldn't be happier fast service, great drinks and daily specials, I will come back with a big appetite.", "author": "Josh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Sadly the people that are handling seating shouldn't be! They can't get seem to get their facts straight about when your table is ready!! Oy vey!!  the low rating is for the service only!!", "author": "Daune C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Awesome restaurant!!! Almost tastes like authentic Mexican. Server was very friendly(and cute). Took time to make suggestions and asked multiple times if we wanted anything/checked up on us. He noticed it was my birthday by looking at my ID and later came to offer me a free shot or dessert. Food is very good, expect large portions! The bathrooms here are very creepy and dark, so go with a friend if you're claustrophobic or a scaredy-cat. Loved the service and food so definitely will go back again!!", "author": "Melanie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "The empanadas of picadillo were great! And the guac was - eh, I make better. Of course there was tequila which was awesome and the lighting in there was cute", "author": "Sari P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "Just the facts... Can't really comment on the food 'cause my party of 4 didn't even get a seat.  Place was pretty empty around 7pm Sunday evening.  There were three open tables that could seat a party of 4 and yet two hostesses couldn't figure out what to do.  Long story short, I could tell the staff was inept and knew the service would probably be awful.  So we left.  What a disappointment!  Also, vacuuming around the customers while they're waiting to be seated was a bit of a turnoff.  Advice to management... you might want to train your employees.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "Service was good but food was so-so.  Ordered Flautas, chips and salsa.  Flautas were fried stuck together making them soggy.  I could do without seasoning on chips.", "author": "K W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-01", "description": "Not worth it. Went for brunch with friends. The food wasn't bad, but wasn't good enough that I would ever go back. For example, my breakfast burrito was mostly bland potato. Womp, womp. Everyone in our party of four was in agreement that they wouldn't revisit. Bummer, I was really looking forward to having this in the neighborhood. If you're looking for quantity, though, their margarita at brunch was HUGE. Woo!", "author": "Chrissy G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}