{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Went here on a date and had a great time the food was good and our waiter Milton was attentive and cool. We enjoy the presentation I forgot his name from a guy who showed us how they made the guacamole he was cool and made us laugh. This is a nice spot for a date or just to hang out with friends. There was 2 girls walking around promoting corona that was different the chips was good and our drinks was strong. We def. come back!!!", "author": "Alicia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-02", "description": "So I'm the first to arrive and I ask for a table for 6, the 3 hostesses stare at me and then say ok well seat you when half your party is here. Then when everyone arrives the same 3 just are slow to react. \n\nWe get seated downstairs in a big empty room, the waiter arrives shortly to introduce himself and another waitress who he said would also be serving us but she didn't even come close to our table. He proceeds to take our drink orders and tries to school my friend on the difference between a mojito and a margarita are.  He also tells me none of the drinks can be made virgin so I get to school him on how to make a virgin mojito. He then comes with water for the table and chips but nothing to dip them in. \n\nThe guacamole made at the table is the reason why they get one star, Props to the guacamole guy!  \n\nThe waiter comes back touting the specials and when another friend orders enchiladas but not the special, the waiter insists he gets the special or even order it and take it home!  He also tries to upsell me the queso fundido with ground beef or chorizo. Later he asks me how it was, I say just ok and he tells me it's bc I didn't get the add ons.  The tacos were also just ok (steak, chicken, ground beef). Elotes also just all right.  My friend asked for hot sauce 4 times from 3 different ppl!\n\nThe waiter must have thought we were tourist being this is right next to the marriott hotel but we just wandered in after work meaning we are New Yorkers which means we will avoid this place as we do other chain restaurants. Point is skip this place bc there's lots of other places around that are better.\n\nFYI happy hour is only at the bar which was crowded and it's only $1 off beer. \n\nThis place will only fool me once, not twice.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Came in for happy hour before it got crazy. Jen took care of us and she was amazing. Girl had a packed bar and she rocked the joint. She kept her cool and was prompt with service. I'd come back if all bartenders were like that.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "I went there on a weekday evening. I sat at the bar and ordered some food. My food came in 30 min, which is OK, but no fork and knife!!! I waited for 5 min, then asked the bartender to bring me the fork and knife!! Have to say that my bartender was a pretty african american girl. I wanted to order the drink, but she was ignoring me. I kept waiting and waiting.... in 20 minutes some other white bartender came to me and asked me what i want...hhmmmmmm......\nThe most ignorant bar staff I ever encountered!!! I will never go back to this place again!!!", "author": "Ms K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Best taqueria hands down. The customer service was top notch we got checked on every few mins. The tableside guacamole was fresh and delicious and that's coming from someone who doesn't really care for it. The fish tacos is the best thing off the menu I recommend it. Now the margaritas are awesome they have a huge list to chose from which is really good. I will be back at this restaurant !!!!!!", "author": "Akeema F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "(Continued from previous review) There are other places in the city, like Superfine down the street that uses green chiles. Surely you guys could bulk order and get regular supplies of these delicious but rarely-available-in-NYC vegetable. (Once I saw them in a Mexican shop in Chelsea, but that shop is no longer in business.)\n\nMargarita was pretty good. Not terribly sweet, though still pretty sweet.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "The food was amazing we had shrimp quesadilla and I was really packed on cinco de mayo. I have to say thanks again to Roshawn  because it wasn't for him I was still been waiting a lot longer than I was told for a table. The girl at the door, she was thin and wore glasses  told me two hours wait  out I was OK with that so I checked in hour and a half later and then again she told me another two hours.\nShe was nasty and a bitch. I really don't understand when I was by myself  standing there and then when my attractive friends showed up  with me and everything changed.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-25", "description": "To be honest with you guys, not the best tacos I've ate in my whole life. BUT the ambience is what makes this place possibly make me want to come back, their decoration is outstanding! They have Mexican death figures all over the restaurant (Día de Los muertos) since they take a day in their holiday calendar to commemorate the death of their loved ones. When I first read their menu it appears to me as a pretty solid Mexican restaurant but when I tasted the racks I thought to myself they lack true Mexican flavor ( \"adobo\" ). I got to try the shrimp taco and the pulled chicken taco. The shrimp in the shrimp taco was overlooked and it was not well seasoned, the pulled chicken also needed more seasoning. The guacamole was okay, nothing outstanding. The food came just a couple minutes after we ordered it. The staff was friendly and", "author": "Mariana P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "This was my first and last time that I will ever visit this establishment in Brooklyn or any of the franchises as I travel quite often. On 4/14/18 I was here to celebrate my bestie's birthday that turned into a nightmare! The service was poor, there was not enough staff to manage a large party of 25 although my friend made reservations several days prior. We were told that they were low on menus and we thought that the guacamole and chips were complimentary as that's the only food that kept coming.  The entire party was hungry and the servers took too long to ask us if we wanted to drink something and to take our orders.  The food was disgusting but the attitudes of the staff were even worse.  We had Birthday cake that wasn't even cut when we asked and ended up taking it home.  Who has a birthday celebration with no cake and no song!!  I have never experienced anything like this before; I nor my friends will NEVER come here again!  This is what we get for going to a low-key spot; apparently it's low-class as well.  When the bill came, we were charged an exorbitant amount as we thought once again that the guacamole and chips were complimentary! At no point were we told otherwise nor did we have menus before the \"appetizers\" were served.  Thanks for a horrible experience. The service was terrible; if I could give negative stars I would!", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Went here twice the past week. Fist time we got three small tacos with wheat tortilla, the tortilla was wet and thick, not good at all. The filling was, on the other hand, weary fresh and nice. \nSecond time I ordered Californian Fish Tacos (also on three wheat tortillas but this time perfect thin and nice) and that was perfect. Not one thing I'd change. Fried fish with avocado ranch and pineapple cabbage. BAM. \nFood was $15/$19 and the second time we got a pitcher of margarita for $25. \n\nStaff is alright but nothing extraordinary.", "author": "Elli H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "My 2nd time here this time for a birthday dinner and it's great!!! The food and drinks are amazing. The music choices that they play is great also loud. I like that the guacamole is made right in front of you. The guacamole and chips is a great appetizer to eat while you wait for your main course.\n\nI highly recommend Rocco's Taco's for a gathering if you want great music, food and drinks. You won't be disappointed with the lounge environment.", "author": "Lola B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "I've always seen this place but never had the desire to go in...until today. Glad I did. Went with my daughter. We had the table side guacamole, the 1/2 order of chicken nachos, she had fish tacos, and I had the tamales al tinga, I also had a mango margarita. We left \"wid we bellies burse\".  Delicious fresh flavors. I was pleasantly surprised. Our waiter was very attentive and the other staff members were very polite and friendly.  Our waiter, Aaron, was very nice, he checked in on us just the right amount of times, not that hovering business. Will definitely revisit. We went around 4ish on Wednesday. Not too crowded or boisterous.", "author": "Paula L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "We had been to the Rocco's Tacos in West Palm and decided to give this a try for lunch today. Food was great (those seasoned chips?? yummm!) but even better was the service. From the amazing hostesses to our lovely waitress.... we were treated like gold from the moment we arrived. This took a wonderful dining experience to the next level for us: memorable. Our toddler has a peanut allergy and our waitress even brought her a special serving of chips to munch on that were safe. The attention to detail and care in service is obvious. We'll be back!!!", "author": "C L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Mixed emotions on this One because it has a cool interior with a cool vibe and the food is proper good for it being mexcian: tacos, nachos, burritos!!!!!\nSo many joints like this.\n\n4 stars to the restaurant and I will talk about that for a bit before I get to the service ... Lol \n\nLike mentioned great decor it's really hip and young with a lot of colours and interesting things to see. You can walk around and be amazed at the things they have thought about in here!!!\n\nFood is good, tacos were great simple but very tasty we came here for lunch during the Euro cup and they turned on the tvs which were everywhere... Cool !!!! The wet Burritos was large filling and tasty cannot complain. The nachos, good size not dry, a way good nachos should be. Food \n\nThe service is where this place can really anger some people. I'm chill and easy going and would never tell someone off , because I know they have a tough job to get it right everytime is rare.\n\nBut you have to follow your job description. Hostess has to be welcoming - they weren't actually quit dry and cold. Waiter should remember things and be one step ahead, ours forget all the orders brought out the wrong food and when we ordered drinks with no ice what did they do bring drinks with ice. \n\nThe place need better management or staff that is trained properly and loves there job so the restaurant to flourish. I highly recommend it but I wish I can rate it 3.5 stars because the staff doesn't mess up your experience lucky I was more into the game then the waiter.", "author": "Kamil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Margaritas are Hit or Miss depending on the bartender but the food is great and the Margaritas are good so just depends how much alcohol you have in them . My experience with the service has always been nice the guacamole is excellent and everything here is great it's a staple of downtown Brooklyn", "author": "Mary Clare L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "Have been here many times...mostly on (taco) Tuesdays.  Any other day the price for food/drink is NOT worth it to me. The deals is ~$20 or so for unlimited tacos all day and they have margarita pitchers for the same price but after 7pm.  The tacos here are usually pretty solid but can sometimes be hit or miss, either being too salty or under seasoned. The margaritas are usually pretty good but have a tendency to be a bit watered down. The chips and guac are stellar though.  The service is usually good, but occasionally we get the waiter who's just a little off.  Will return...on Tuesday..", "author": "L N C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Friendly but uninformed wait staff, but that happens when the staff sit staff in a Mexican restaurant is not Mexican. The food is above average and almost authentic. Great fast food eatery and tavern.", "author": "Lou V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "My boyfriend and I sat for 45 minutes without being served. While at the bar, we heard the bartender named Ashely having a conversation with a costumer named Shane about how there were a lack of 'sisters' who came to the bar. They then made dirty looks towards my boyfriend and I, as we are an interracial couple. They continued to make derogatory remarks , and made us feel quite uncomfortable. We have been sitting here for almost an hour and she has not once came\nTo check on us. \n\nI should not feel uncomfortable when coming to a bar, and it is absolutely disgraceful you have someone representing your establishment who has the audacity to speak this way. I have watched her served everyone at this bar but us. I have never experienced racism in my life, before stepping into your piece of shit bar.", "author": "Brianna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "Lapin and I stopped by on a Saturday night for a quick dinner.\n\nWe ordered the table-side guacamole which was really good (definitely the only reason we would visit again). Lapin and I both fought over who could take home the leftovers (if they there were any...there wasn't). Lapin got \"The Brooklyn\" pork tacos which were a bit dry for his liking. I got the Mercado Chicken tacos which was dry but I was more concerned about the lack of taste. Even after adding a slathering of hot sauce, it could not be saved. Also, the Brooklyn was $17 and the Mercado was $14.5, which was pretty expensive considering all it came with was just three soft tortilla tacos. We got a couple of different margaritas that had a nice kick to it. But, towards the end, all of them tasted the same to Lapin.\n\nThe service was nice and attentive but a bit slow. Once, we had our drinks and guac we didn't care that the food took a bit to come.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "I went on a Monday evening. Very last minute, the place is beautiful. Fits in very well in the area. They are very accommodating. My sister had the chicken enchilada. She mentioned it wasn't anything to write home about. I liked the guacamole made at the table. Nice touch, very awkward him being so close to the booth.. its like you just gotta talk to him- \"So..how was your day?\" \nThe tortilla chips arrived warm always a plus. The guacamole was ok. I had better at Dos Caminos. So why give this place 3 stars?  Customer service,  i wasn't feeling my mojito at all..Although i still kept it..the manager nicely comp my drink for another stronger one.  Nice gesture. Drink was all alcohol no taste..\nI'll give it another shot, just need to do my research before i go there. Oh FYI- this place restrooms are on downstairs..be careful patrons.", "author": "Nikki B."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}