{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "Terrible service. I can't believe their horrible staff are allowed near food. \nThe food is awesome, if I were kitchen staff I'd be pissed that my hard work is being touched by such terrible waitstaff.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "I come here every time I'm in Brooklyn, sometimes for lunch and dinner. It's crazy vibe great food and drinks never dissapoint. Best of all look up at all the amazing lighting fixtures. Walk down to the party rooms they are amazing. I hope the owners are related to the artist because these are massive works of outrageous art, like you'd see in the grand casinos.", "author": "Gina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "Came here today with my team, we were a group of nine, so was pleased when it wasn't busy. Relatively quick with menus and drinks but then it went down hill. Took well over an hour for our entrées to arrive. Like, literally, it wasn't busy so we were at a complete loss as to what the hold up could be. Food was fine once it came, nothing amazing but nothing awful. Would have been fine if not for the wait. Sort it out!", "author": "Kylee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Here with my girlfriend for her birthday. The food is delicious. The staff is polite and the drinks are strong like I like them lol.", "author": "Roebie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "The guacamole is awesome and the drinks are good. There is usually a DJ on Friday and Saturday nights. My wife and I have been helped by Sergio a few times and he is awesome we always want to sit in his section. Overall a great place for Mexican food and date night.", "author": "Jabreel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Great food and amazing music!!!  The food comes out slow for somethings but with music it's worth the wait. The decor is amazing.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Restaurant is nice !! But the service is not good , you have to chase the waiter  all over the restaurant !! Never came to the table to ask if we needed anything else !!", "author": "Joel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Great food, great drinks, amazing and fast service. Place looks great, awesome vibe... Our server David from the bx, was very helpful in explaining the menu and gave great recommendations...", "author": "Edward J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "Second time coming here. Food is pretty good. Service both times was HORRIBLE. Sat at the bar by myself on both occasions and was practically ignored on both occasions. When I sat down there were two bar tenders having a full blown conversation. When they were done one walked off and the other started another convo with a third bar tender who was making a drink. I had to flail my arms to get a menu! Then they had a nerve to have an attitude while taking my order. All of this took place on the second visit. The first visit service was just really really slow for no obvious reason.", "author": "Carla Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "Kitschy chain Mexican restaurant with a great tequila selection. If you're looking for authentic, go elsewhere. Very much so a TexMex place.\nThe place is huge and great for large groups. and there are TVs EVERYWHERE", "author": "Margaret A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "Would give 3 stars for the food and drinks but EVERYTIME I go there even if they're not that busy, they fuck up my order!!! I got seltzer instead of ginger ale.. I ordered 3 different tacos and I got 2.. Asked for extra sour cream, didn't get any!!! I'm not coming back cause this is the 2nd or 3rd time I've had my orders messed up!!! I could understand if they were crazy busy but they weren't ! So annoying!!!!", "author": "Danielle X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Fun atmosphere. Prompt, energetic, friendly waiter Jarren! The guacamole is delicious and made at the table. A stop we didn't plan but glad we did.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "I just love this Mexican restaurant my first experience was in West Palm Beach Florida and now that their  in Brooklyn I couldn't be happier.  There's so many brands of tequila you will lose your mind and the food is just off the hook I love the Brooklyn tacos", "author": "Evan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "Roco's Tacos is an overall great place to go. The food is great. I had the flautas today and they were amazing. Perfect proportion of meat and great sauce on top. The service was great as well. Fast and courteous. Will definitely be going back.", "author": "Nathaniel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Came here with a couple friends! Food was really good.  Loved the space and ambiance. Staff was very friendly. They had a deal on tacos or something like that. It was affordable and I was stuffed!!! Prices are decent.  Would definetly come back to this establishment.", "author": "Fancy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "First off, you have to try the Guacamole. It is made fresh at the table and is really a meal by itself. I have had the tacos and the chimichanga so far, and they are both excellent, though the chimichanga could have used more salsa verde. If you are going with a friend, get a pitcher of margaritas (it is the best value). Their mango margaritas are excellent, especially in this summer heat!", "author": "Greg B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Food was great but service was poor. Definitely made the experience less than worth wild....Unfortunately", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Came here with my boyfriend while on vacation. This place is awesome! The margaritas are so freaking good. Our waitress was so funny and charismatic. We had the nachos, and man... Those were the best damn nachos I have ever had. Ask to see their tequila bible. They have so many youll be in shock. Cannot wait to come back! So worth the $118!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "Tomato in our salsa still had a sticker on it and it was not comped. Pretty poor service", "author": "Sean D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "definitely Enjoyed my our server  Jarred was AMAZING made our night fun and full of laughter will visit again soon", "author": "Sarah A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}