{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "The \"Service\" is pathetic and extremely slow!! The drinks took a while to come out, the food take a very long time to come out, the restaurant is clearly short staffed!", "author": "Arjun N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Worst service ever! Under staffed. Waited forever for water, then drinks and wound up having to cancel the food order due to them not being able to do substitutionsand taking too long. Didn't get to taste any food. Also the pitcher of drinks is a rip off because it literally only filled three glasses. Pitcher was 35 Ind margarita is 10 so for 30 you can eat 3 full ones.", "author": "Cassandra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "This wonderful gem is conveniently located right by my job. I love coming here for drinks and nachos! The guacamole is delicious and so is the sangria!! Come here hungry! The portions are ginormous and you feel bad not finishing them because the food is yummy! Really cool bathrooms with television screens in the stoles. An over all good time with descent food.", "author": "Tamara P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "Have to pay for chips and salsa. The service was slow, and even getting our margaritas room a long time. The food was just ok.", "author": "Stacey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I am a regular at this restaurant and to be very honest, every single time i have a great time. The food is amazing, really tasty and the drinks are the main reason why im writing a review on this. Angel is one of the waiters at the place and the two times i've had him as my waiter i come out the place really happy, he is really attentive and very fun!!", "author": "Sheyla D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "We went here on New Years eve for the first time and the place was wonderful inside, it made me feel like I wasn't in Brooklyn!! The Decor I will give 5***** \nThe hostess and our waitress will get 5***** as well they we're very nice and attentive!!\nFor apps we ordered chicken flautas which was pretty good I'll give 3*** we also ordered chips and salsa that'll get  4****. We ordered a pitcher of strawberry frozen margarita and I will give that 3*** we had to ask the waitress for flavoring because it taste bland watered down  I live for margaritas it's my favorite beverage lol so it was kind of disappointing but the waitress gave us some flavor to add to it. Maybe next time I'll order it on the rocks! \nFor our entree I ordered the Durango which is a combo of a BBQ pulled pork toastada the pulled pork was way too sweet I think my glucose went up lol, cheese quesadilla; supper good , steak soft taco that came with two small 1 1/2 inch strip of steak; the steak was great I wanted more! My girlfriend ordered pork flour tacos which was overly sweet as well we don't know what was going on that night but it was just ridiculous how sweet it was!! We ended our meal with a dessert tres leche cake it was delicious!! So all in all I think I'll have to come back to give them another try", "author": "Iesha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "The place to come too..great atmosphere. ..Brooklyn is where it's at...Rocco's is the place to come to and enjoy the food, drinks and fabulous atmosphere. .", "author": "Mo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "First night in the city and really wanted something good to eat. All I can say is Dave from Nashville was our waiter and really made our evening with a big smile and nothing was too much. Food was well portioned, amazing flavours and no waiting times.  DAVE, THANK YOU !! Carly .", "author": "Carly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Shrimp taco was great, the shrimp was we seasoned and flavorful. Full of onions, scallions and other greens. Wasn't greasy at all. It was filling but not heavy. Frozen strawberry margarita was watery \u0026 needed to be stirred often, tasted watered down. Didn't taste like it had much alcohol. Tacos are a bit pricey for their size but it was worth it. Also, the new manager is nice \u0026 cares about your experience expect for the woman the door. She was quite rude \u0026 snappy when it came to missing our reservation even though the restaurant was empty so that made no sense on her part.", "author": "Lira K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "First time at Rocco's and I must say I've been blown away from the moment I walked in. Jarren, our server, was extremely courteous and friendly and made sure my girlfriend and I were accommodated throughout our stay. The Brooklyn tacos are a must try! The Guac is fantastic and you have to try the Casamigos lemonade! (They don't cheap out on the Casamigos !) )", "author": "Dimitrios G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Great brunch menu, great atmosphere, great service. I recommend the steak and eggs to eat, bottomless mimosas to drink and Natalie as your server - she rocks!", "author": "Carlos R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Fantastic food and atmosphere!! Natalie was our server and she was awesome - definitely coming back for the chicken and waffles O.M.G.", "author": "Charissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Loved my drink it was strong ...im a picky eater so i didnt see anything on the menu i would like but ill come back for drinks definitely curel is a cool bartender", "author": "Kamica N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "It's Tuesday I'm hungry and maybe just maybe I need a hug. I know not the typical request in a bar, Tuesday is a bit packed they have a 'Taco Tuesday' special, drinks and tacos included. Brad is honestly the best server in the establishment, I'm sure he has bigger plans however his attention and overall demeanor and attitude made this the best Tuesday wind down...happy hour or not ask for Brad, you deserve it.", "author": "Mekela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "The table side guac is to die for.  Fresh and tasty.  Servings were a good size. Staff was friendly and knowledgeable.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "The last time I had table service, the guacamole was super pasty like a butter spread (I like it chunky) and pretty flavorless - which is surprising considering it's made fresh right in front of you. \n\nI decided to give them another shot. This time around, I specifically asked the waiter to tell the guy who makes it that I want the guac chunky. When the guac guy showed up (same one as last time - just my luck), I again requested to make it chunky. He bowed his head \"ok,\" but still made it pasty just like last time. Really? What can you rely on in a Mexican place if not on their guac??? :(( The fish in the fish taco (despite my request for it to be \"cooked medium so as not to be dry\") was (again) overcooked and dry. Bummer :( They also put the wrong cheese on one of the salads. Their shrimp tacos are not bad. The spinach/cheese quesadilla was nothing special - I could probably make a better one at home.\n\nFollow up: 2-3 hours after eating, my stomach is turning and I'm running to the bathroom :( For this, you lose a star.", "author": "allison a."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-28", "description": "We went for brunch on a Sunday to take advantage of their 2 hour bottomless mimosa or bloody mary special. When we ordered, the waitress informed us that not only were they out of champagne, but out of tomato juice as well, so that neither drink was available. We said, \"That's fine, just make screwdrivers,\" as we knew they had orange juice and vodka. She said that was fine, but neglected to tell us that she wasn't going to put those through as part of the bottomless deal. I asked to speak to the manager and he gave some canned excuse that his \"system\" wouldn't let him make any allowances. I said, \"So put the screwdriver orders through as mimosas in your computer\" and he said, \"That would be stealing from the company,\" which is of course an idiotic response. In any event, running out of such basic ingredients is simply not acceptable for a NYC brunch spot.\n\nWe were going to walk out at this point, but it was past 2 o' clock and we were hungry. I made repeated attempts to contact the general manger or owner through email and phone, and all were ignored. Nobody ever called me back, despite assurances that someone would. Rocco is clearly either dishonest or lazy. The food was very good, but the service and the blatantly false advertising far outweighs that. Stay away from this joke of an establishment.", "author": "Jon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "I LOVE THIS PLACE!!!!! So good , the guacamole is the best I've ever had !!! The guy who made the guacamole in front of us was very friendly and personable and made great convo with us . Our waiter was also very nice .  The Quesadillas are nice and big and soooo good . One of the Best Mexican places I've ever been too . Both my friend and I Loved it here . Can't wait to go back . A++++", "author": "Meka S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "The ambiance is interesting \nThe service is good enough\nThe food is okay \nThe margaritas are really good", "author": "David I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "3 stars was my initial review but our waiter was nice so I decided to give it 4/5 starts. I came on a Tuesday around rush hour and I was amazed by the ambience and decor. I ordered a Hongos, bistec and shrimp tacos. Hongos and bistec were nicely packed and the shrimp had 2 or 3 shrimp in it. For $6 the shrimp taco should have at least 4, 5 shrimp. However, the flavor was there. Overall, great experience. Would I come back? Yes, for taco Tuesday", "author": "Yessenia B."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}