{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "I have been here before  for brunch and had a great time. Food was good and service was great then. But today, the service was subpar. It began with hostess who could be a little more pleasant despite the fact she messed up the customer's wait list for the table.", "author": "Wale O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "One of my all time favorite places. However tonight has been the first time I've encountered horrible service. My waitress didn't check on us. I had to flag down other staff to get us water and to order another pitcher of margaritas. She seemed attentive to her other tables but I even caught them looking around for and having to flag her down. She never checked in on us or asked if we needed anything. She would completely walk pass us but never glance in the direction of our table. I'm greatly disappointed with the service today and considering that it's not as busy as usual I would anticipate good service. I've came here many times and never once received such bad service which is why I provided the 2 stars. The margaritas are great and the pitchers are worth it! The nachos, guacamole and tacos are all great and always delivers. I hope to not undergo this type of service in the future because of it continues they will lose a customer.", "author": "Savanna R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "The food is really good and fresh and priced fairly.  Guacamole made fresh at your table for only $12.00.  I recommend sitting at the bar first to get the happy hour bar only drink specials that end at 7pm.", "author": "Jaime B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Here right now about 2 margarita pitchers in, absolutely love this place, the skull decor is amazing and my favorite thing ever so I'm partial. Fantastic mango and passion fruit margarita's, I had the homemade guacamole which was made tableside and very tasty! Delicious seafood mocajete, great service and the manager even offered us tequila shots on the house, would love to come back for my birthday brunch.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "After 15 minutes we walked out. 4 waiters just walked passed us and not even a 'Hello' or acknowledgement. The 2 hostesses looked miserable and offered only to sit at the bar. The place was crowded and there were tables and booths available and clean. Why only the bar was I offered? Terrible. And this is the 2nd time that I've tried to eat there! The first time it was crowded and when we went to the hostess to get an estimate of the wait time she didn't even acknowledge so.... Never again...", "author": "Christina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Good food. We just got tacos but they were good. Katherine is amazing! Such a sweetheart. LOVE HER! Big ass tequila pitcher... Smiley face lol", "author": "Kamaye A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Sat at the bar with my friend, originally came in for drinks.. But then decided to have food as well. I was extremely pleased but the bartenders who were very nice, the food was on time and delicios!!!! Our Margaritas were so good! I will def go there again!", "author": "Mar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Milton and Aaron were amazing! went to celebrate my boyfriend's birthday and they made sure we had a great time! will be going back again for the wonderful service.", "author": "Di-Andra T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Went on Taco Tuesday. Great service ! Great smiles ! Manager Latifah greeted my girls and I well and presented exceptional customer service . Very pleasing calm environment as well, decor very pretty and detailed   . Deff will come again !", "author": "Brown H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "I was dragged by a friend to go here. I'm not much of a Mexican fan. To my surprise the food was great. Thanks to our waiter Shawn, who was helpful in my food selection. Well pretty much everything I ate and drank. Drinks were good and STRONG.  This would be on my list of places to return to.", "author": "Janine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Mercado tacos were exactly what I wanted!!!! Awesome!!! I would come back here every weekend!", "author": "Maya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Love the guacamole, free shot for checking in and ordering an entrée, love the waitress and she did a great job. Good experience with friends and to have a good time!", "author": "Shane A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "From the time that my friends \u0026 I arrived here they made us feel like we were home. Although a few of them were late they seated some of us \u0026 we were able to order the Mexican Street Corn \u0026 custom made guacamole. Our entrees were delicious \u0026 our Tres Lesches Cake ended my this excellent feast. We were highly impressed \u0026 will definitely visit again.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "Margarita was decent.  Food was mediocre and that's generous.  Extra charge for salsa (that's not even good).  Plus very limited kids menu and they burned my kid's chicken fingers and took 15 minutes to make a new one.  Will not come back.", "author": "Verleria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "This place has the most amazing staff ever!!! To the Manager Zena, the amazing server Jarren and the table side Guac master Marquis, they literally turned the trajectory of my night around. I came here with w co-worker after an incredibly stressful Tuesday and decided to do the taco Tuesday AYCE special. For $18 you get your fix of select tacos and refillable fountain sodas and Jarren IS literally the most engaging server that I've ever had (and I eat out A LOT). The plates were never allowed to be empty and before I finished my drink, another one was on the way. Marquis not only made the most delicious Guac I've ever had (and I'm half Mexican) but he knew about ALL the ingredients that he used and even knew the type of Avocado. The evening was capped off by Zena (the manger) coming and checking on us, and we had to commend her for training an amazing staff. Please come here and ask for them by name!! They ARE the Rocco's experience and if you had a bad time here, you didn't have them; they set the STANDARD for what a night out should be. This place is now my new favorite spot and it's because of Jarren, Marquis, and Zena .", "author": "Jose A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-15", "description": "We were staying in the area and were trying to find Forno Rosso but Google maps is terrible with walking directions and we got lost so stopped here for dinner. It was very late, almost 11 pm by the time we got there for dinner. A delayed flight and the aforementioned bad directions meant we were exhausted and starving by the time we got there. The restaurant was open til 1 and was pretty dead as it was a Thursday night. Our waitress was super sweet but everything else about the experience was meh. I put in my kids' orders first because they were hungry and cranky and my husband and I wanted to peruse the menu and take our time ordering. Now I take my kids out to eat often and I frequently ask for their order to be put in first and arrive first but for some reason a few minutes after we put in their order the waitress came back to say the kitchen needed our full order in order to begin making our food. This makes zero sense but I just went ahead and ordered the Korean tacos which the waitress said were her favorite entree. When they arrived the meat was incredibly salty as was the peanut sauce on top. In fact everything tasted overly salty including my kids' tacos and fries. There was also entirely too much peanut sauce on the tacos and I had to scrape most of it off and the corn tortillas were cold. This was Taco Bell level food at NYC prices. My husband ordered the Brooklyn tacos and liked his. If you check in with Yelp you get a free shot of tequila but that didn't make up for the food.", "author": "Elita K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "I had better tacos than what they serve here. The drinks were fine, the bartender is friendly/respectful, and the environment is pretty cool. But what made me lowered the rating to two stars is that the waitress/waiter by their table rushed us to finish our food and told us to get out. Kind of disrespectful, don't you think? We're just minding our own business and trying to enjoy our food and drinks..", "author": "Hikari N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Easily the best service!! Suuuuuuper good food! I'm from California and the Mexican food here can definitely make it in California!! TREVOR is the server to get!! He's amaaaaazing and super helpful. He knows every item on the menu and sells it PERFECTLY! I would come back again!", "author": "Jazmine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Came in, sat down at bar, not crowded, waited 10 minutes, none of the bartenders  tried to serve me, got up and left.  Total joke.", "author": "James R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "Our waiter was horrible , no napkins was at the table . We had to ask for it . \u0026 he was mostly no where to be found . The food was ok , but I've had better Mexican food . Not worth the drive", "author": "Sybil N."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}