{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "I'm not one to write reviews, but after visiting and then leaving this place, I was so grossed out.\n\nI came in with my boyfriend tonight. The service was friendly, but my boyfriend objected. Our waitress did seem too occupied with the staff there dining in our whole section. I guess there was some sort of party? The booth across from us was very drunk and belligerent. I had overheard a conversation of the woman in the booth with her children yelling and cursing about coworkers doing things. I'm not sure if she's a manager or an employee, but that's totally inappropriate and especially in front of her children and others around.\n\nAfter we had paid, the manager at the time came up asking how everything was. We said it was fine because it felt particularly awkward after our waitress had already apologized for us being in the staff section. \n\nI had to use the women's restroom before I left. There were children playing in it and one of the stalls didn't have a lock. I ended up using a different stall and noticed there were feces smeared all over the toilet seat while someone was doing business very loud in the stall next to me.\n\nOther than all of this, the margaritas were great. Food was mediocre. Sadly won't return again even though the building looks amazing.", "author": "Autumn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "The service from the bartenders to the waiters to the hostess is friendly. The food is always excellent and the drinks are always just right.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I go to Rocco's a few times a month and it is always a good experience all around! The servers are always friendly and outgoing. Perfect place to hang out and get drinks!", "author": "Diamond K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Well, I gotta say Rocco's Taco's is a #GDP!!  The service at the bar was on point and super friendly.. in fact; if Savanah or Steven are working, I might even suggest skipping a table and going to bar... especially if you're only with one friend. \n\nI mean, you're in Brooklyn. Do it right and belly up to the bar and you'll get kick a** service!", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Their brunch menu is amazing, best bottomless mimosas and service around!", "author": "Kate B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "PLEASE READ!!! ABSOLUTELY TERRIBLE. DO NOT COME HERE. AVOID THIS RESTAURANT AT ALL COSTS. My dad ordered \"the Korean\" taco and because of that meal he is currently bed-ridden with FOOD POISONING. The food was mediocre, lacked ANY flavor--and there was not a trace of \"Korean\" cuisine--overpriced, and was CLEARLY not prepared with fresh ingredients. This restaurant is an absolute disgrace to the Brooklyn Heights community and should be shut down immediately for serving such poor quality food.", "author": "Sae Rheen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Chain style Mex. is a cute central spot with some hits and misses, though it's hard to go wrong with Mex.\nAte:\nSpicy guac\nSeafood mocajete\nThis downtown Brooklyn joint is huge!. The guac is made table side which makes a good show \u0026 although it was spicy it was otherwise unremarkable. The chips had an awful spice to them, unlike the hangin' fresh ones at Vario 408 in Park Slope. What was very good though was the seafood mocajete Very flavorfu,  good earthy mole, but served with cold out of the bag tortillas and some tomatoes \u0026 more unremarkable guav- fun night, though.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "Being an Orlando native I have been to the location there a few times so when I saw this one basically attached to our hotel I was excited. I was more excited when I saw thy offered brunch with unlimited mimosas. \n\nWhile I would love to say my experience was stellar, unfortunately I cannot. For being a table of four and the only table our waitress had, as the rest of the place was pretty desolate, our service was shoddy at best. We all ordered our drinks and meals but 10 mins later, still no drinks. It shouldn't take that long for small glasses of mimosas to be made but we all let it slide. Our food did come and while two of the four of us liked our food a lot the other two literally hated theirs. The waffle and banana pancakes were the losers of the group, which we all laughed a little that they did likely make bad choices ordering classic breakfast food at a taco restaurant. We all looked past this though and just kept drinking our mimosas. Cut to receiving the bill, we noticed we were charged for two side of eggs at $3.50 each. My fiancé did order eggs so we mentioned to the waiter we were charged twice. According to the waiter the charge was correct... they charge $3.50 PER EGG. Now I know NY is expensive but really?!! Literally nothing was said and we walked out after paying but I can tell you those expensive ass eggs will live on in infamy with our group and I can promise my fiancé will never step back into a Rocco's again.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Overall great Mexican food. I visited here on Friday with a friend visiting from out of town. Service was a little slower than we'd have liked but the restaurant was packed and the environment was lively. I ordered nachos that were very flavorful and juicy. Honestly, they are loaded with toppings and probably my favorite that I've found so far in NYC. The 1/2 order is more than plenty of a portion for one person and priced very appropriately at $9. \n\nIf you order tacos, order ala carte. It'll save you some money and they are just as delicious as the trio that costs you a lot more money. My friend loved the steak tacos and thought the meat was tender and flavorful. The chicken taco was nothing special - a skip for next time.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Great Atmosphere  and the Taco Tuesday is CRAAZAAH!!! I LOVE IT!!! Sangria, they have the best in BROOKLYN!! Isabella is a beautiful courteous waitress there who is quite cognizant of the food and drinks when we were indecisive and she was right!!! The Nacho's, Shrimp Taco's and the Black Beans were BUENO!!! The Sangria too wash it down is exquisite.. Not that costly but again the good things in life are not on the dollar menu but I know some beg to differ LOL!!!! If you are looking for a nice relaxing place after work with great and courteous service that helps you unwind after a long day, THIS IS IT!!!!!", "author": "Robin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Steps from our hotel. Happening place on a Tuesday night. Waitress was wonderful. She took great care of us. Split our checks perfectly. Food was great. Guacamole made table side was informative and fun. The entire staff is first rate!", "author": "Al R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "My server Angel was phenomenal the food is always perfectly cooked and tasty! I got the walnut banana pancakes yum!!!! \n\nThe side of bacon is glazed with syrup and sweet!!", "author": "Raven N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Third visit....service is consistently great. Sat at the bar for lunch, awesome large screen t.v's..... Sports always on ... How awesome is that. West was the bartender, very attentive, great menu knowledge and actually suggested the perfect drink for me. The watermelon kiss ...... Yasssssssssssssss. West is the best !!!!", "author": "Tee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "The food was good, especially the guac. What stole the show though was our server Melissa who was attentive, friendly and all around amazing. Ask for Melissa!", "author": "Lenny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "Only Go when it's SLOW!  I would give this place 5 stars for the food and drinks but tonight has bend a disappointment. I know it's Taco  Tuesday but an Hour \u0026 30 mins after arriving and still no food! UNACCEPTABLE!", "author": "Jamall C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "The service was slow. The tacos were cold after waiting 20 minutes. I would not go back and I do not recommend this place. I think they need to hire more people and train them better.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "It's not authentic Mexican food. It's more like inspired Mexican food but non the less the food is pretty great. The decor is beautiful, even the bathrooms. Which is why I give it 4 stars. I've been here 3 times already and everything it's pretty much the same every time you go. The the service isn't that great \u0026 the drinks aren't either. I've order mojitos \u0026 they taste like pure club soda, I never get asked if my drinks or food was okay. \nThe only thing that makes me keep coming back is the burger. It's huge!!  Enough for two small ppl. \nI'll probably just order to go \u0026 make my drinks at home lol.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "A Friday evening after work with a few co-workers. Not a long wait was seated right away. Yummy quesadillas, GREAT virgin margaritas. Margaritas by the pitcher, and guacamole made fresh right in front of you. Such a GREAT experience!   \nEven better guacamole-specialist", "author": "Brytnie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "This was not my best experience eating out:\n\nWhile the staff were friendly and respectful, they were not attentive. I waited for a long time before my waiter even brought me my drink or water. I believe it was bc they were under staffed. \n\nThe restaurant was not clean. Many of the tables had not been cleaned/bussed properly. \n\nThe food and drinks were good. Their spicy guacamole was DELICIOUS!!! \n\nOverall, I think the lack of staff in duty impacted the service and cleanliness of the restaurant, especially for the price to find here.", "author": "Felicia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "About the food:\n\n\nThe nacho chips are incredible! Their unique seasoning coupled with the freshly made guacamole make it irresistible to much information the chips.\n\nFor my entree, I ended up ordering the Korean tacos. They tasted pretty crazy, but I loved every second of it.\n\nAbout the service: I was in a group of 10+, on a weekday, at lunch time. We were seated right by the kitchen. Even though at the end, the server shook each of our hands thanking us for our patronage, I felt that they could have done better I regards to how frequently he checked in on us for drinks.\n\nOverall, this place is definitely worth going back to.", "author": "Edgar A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}