{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Having an amazing time with my party of 10. Our sever is name Simmon. I recommend the tequila pitcher.", "author": "Klarissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "It was only okay.  The drinks were good.  The salsa wasn't great it was like chopped tomato with no flavor.\n\nThe guacamole was incredible and prepared in front of you.  I will go again if in the area.  Second try at least...", "author": "Gigi B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "My first visit here was pretty alright. I've been here twice, now my second time coming I came very early maybe 12pm. The sever was non existent she came to the table initially to ask us if we wanted chips and table made guacamole. We were both emerged in our menu so we just agreed to whatever she rushed out of her mouth. As I said I've been here once before so I know that they do bring you a complimentary bowl of chips so that's what I assumed she asked if we wanted. After about 15minutes we both figured we wanted a half bowl of nachos. So after watching our waiter walk pass us more than twice I decided to stop her and let her know no need to bring the chips and guacamole we think we want the nachos instead and an entrée. She said ok put her pen up as to signal one minute and kept going. Another 15minutes goes by and another waiter is bringing us this huge bowl of nachos. Now, I was under the impression that she would be back to take our order but she just put in an order for a full bowl of nachos when we only wanted a half bowl because we both wanted to order our own individual meals on the side. \n\nI had to send the big bowl of nachos back to get the half bowl. She then just kept refilling our drinks which left me thinking hey it's free refills on fountain drinks. WRONG! You pay full price for each drink refilled. I was so disappointed in her service and the lack of communication. After we ate we paid and went left. We were going to have a few drinks but I decided against it.", "author": "Nia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "Terrible customer service. Went in with 5 people and the continuously tried to seat us at a 4 top table. We were told 20 min wait. 1 hour later  still no table. The hostess kept snickering and laughing at us. Never come here without a reservation apparently.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Five stars taco joint. Music. Fast service. Polite staff. Food delish. We rolled out of the place.", "author": "Jp D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "We stopped in last night walking in off the street. The experience was great, the downstairs bar was very intimate and the queso fundido and chorizo were EPIC! After a few drinks we went up to the main bar an the music was a good mix. The Brooklyn Tacos were on point, especially the smoked pork and bacon! The bartender seemed slightly overwhelmed with only one bartender for the massive bar, but they found another one. Try the Rocco Rita it was damn tasty!", "author": "N V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "Food is great, but service was horrible. It took the waiter to get to our table a while. Once he came, he took the order and then it took a while for the food to come. Then we wanted to change something but couldn't et a hold of the waiter any longer. Another person got added in our group and we were hoping that when the waiter swings by we would order some food. Again, the waiter was a no show. We had to walk over to the waiter to make sure he knew that we were looking for him. Even then, he took his sweet time to come to our table. Over all it was the poorest service experience I have ever had.", "author": "Khan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Awesome tacos. Fresh made guacamole. Absolutely no complaints. Best on Taco Tuesdays (All you can eat tacos)", "author": "Earl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "The chips with salsa were unreal!!!! I also ordered a spicy margarita, and one of the fajita bowls for two which were yummy too, but something about those chips :).", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "I'm not really sure how I feel yet. I need to go back and try a few more options. I will say that they were out of two different items I wanted, so let's see if this is a pattern. The taco salad I had was really good though. Make sure to check in for your free tequila shot.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Kathy was amazing she made us feel at home the suggestions were wonderful !!! We're definitely coming back !!", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "Food was very good, service was exceptional.  Had the wet burrito and chips that were well flavored.  Service was especially good, and there is a humongous selection of Tequilas.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Fun place!  A good mix of people, lively music and free shots at the grand opening.  The food was very delicious and the Guac was made fresh at the table. Can't wait to come back.", "author": "Johanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I love this place . I had a strawberry peach sangria that was out of this world !!! So goooooood! I came on a Friday night with no reservation and there was no wait so that's a plus to me. I had a bowl of chicken steak and shrimp in some sauce. I forgot the name but everything was good except the steak. It was kind of tough. But overall great experience , I'm anxious to go back", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "The place is really nice, very modern. The service could use a more upbeat attitude. Servers seem a little gloomy but the host was very friendly. The food is ok. My biggest recommendation is the eloté. It's sooooo good. Music is great but might be too loud for dinning.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Nice ambiance and Shawn our waiter was very attentive and sweet. The food was a little better than ok, but the drinks are a must. Would definitely come back lol my sis remixed the guac tho", "author": "Darnella P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "Great deals on pitchers of margarita but food very mediocre for the prices. Good place and would go again when I don't have any other place in mind.", "author": "Shas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "Caring waiter, great food and an OK IPA beer selection. We have gone several nights in a row. Coming back.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Went to Rocco's for the first time with my coworkers for lunch and it was good. Ended up getting slightly overwhelmed by the menu, but I finally decided on the California style fish tacos. I must have misread, because when I received the tacos the Mahi were battered and fried as apposed to grilled like most of the other fish tacos I've had in the past. Regardless, I was expecting the food to have a bit more flavor, then it actually had. Wasn't too crazy about spending 24 bucks for a three taco lunch, however I was very happy with the appearance, theme and overall service of the place. Most definitely need to try that tequila bar in the near future. Looking forward to going back and trying something different!", "author": "Jason R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-12", "description": "Exceptionally good food, guac, and margaritas, but the service, while very friendly was S L O W, and they completely messed up at least 2 orders out of the 10 people in our group.", "author": "Paul S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}