{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Visiting NYC for the weekend and while staying at the Marriott hotel next to Rocco's we decided to give them a try. It was amazing the service and food was very delicious.", "author": "Temmy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "This is my go to spot.  I work in the area so it's easy to frequent, and close enough to come on weekends.\nGuacamole is outstanding and made to order in front of you.  The chips to dip and on the table are just to die for, seasoned to perfection.\nRestaurant is beautiful, clean and trendy.  Food and drinks are just plain yummy, you can't go wrong with anything you order here.\nCheck this place out, you won't be disappointed.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Ask for Mike, 5 star man, end of bar area. This place is an odd mix of people a lot of travelers as well as people that are native to brooklyn or Jane business at the courthouse", "author": "Cat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Large space and always lively. Not an intimate dining experience if you are looking for that. I think a place like this was needed in the area. I've come here twice- both times this was during the weekday around 7 pm. On both occasions we were able to be seated, but there weren't many vacant tables. \n\nThe food is tasty. They make the guacamole at the table and it is tasty! Definitely worth trying.  They offer lots of taco options. Given the name of the restaurant that's pretty appropriate. I had the fish tacos one time and the second time I had a Pork specialty taco. I've been happy each time. \n\nThe cocktails are good too. I ordered a pomegranate margarita and absolutely loved it!", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Came here with a group of my gal pals. From the moment we walked in we were greeted and seated right away. Our waiter was very attentive and pleasant. Drinks were amazing and the food was phenomenal!!! I definitely recommend. 9 out of 10.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "The hostess had a very cheerful disposition and very welcoming to the restaurant. The place itself is very nice and spacious. The lower level also has a lot of seating and overall the restaurant is beautifully decorated. I will give this restaurant a 4 to 5 star for the ambience but only a 1 or 2 for the food.\n\nWe were in a group of 5 and ordered a pitcher of the house margarita, chicken tacos, pork tacos, the brooklyn (mix of meats) tacos and the chorizo tacos.\n\nThe service was very poor. The server took her own time to bring us our waters and the margarita came after the food arrived even though everything was ordered at the same time. A refill of water also took forever to get to our table.\n\nThe house margarita could not have been made with any cheaper tequila. The glasses had abundant salt on them (more than I've ever experienced in any restaurant). \n\nThe chicken in the tacos was cooked well but did not have any taste at all. Thanks to the fact that it was in the tacos, made it palatable. The chorizo tacos were the pick of the entire order and were tasty. The brooklyn has lot of meat and is filling. I didn't taste it so can't comment on it. \n\nI noticed a lot of tables had guac at their table - I'm sure it was prepared fresh at the table. That looked very appealing and they make it a point to suggest it to you when you're order is being taken.\n\nIf you've never been to a mexican restaurant, you might like this place as a starter especially because the ambience gets you into the mood. However, the food is pretty substandard and the service is poor. I won't recommend this restaurant to anyone who has been to decent/good mexican restaurants. Also, the prices are higher than one would pay at other good mexican restaurants.", "author": "Kiran B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Great food and service, cant complain. I went with 2 girlfriends around 3p and there was no wait. The decor ia very beautiful and thr space is bigger than i imagine. Guac was fresh and made in front of us. I jad the taco burger (delicious!) And one slow roasted pork taco (yummy). Unfortunately i was the designated driver so no drinks for me, but ill be back another time via uber.", "author": "Shuka E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Absolute overpriced garbage. Not a trace of anything remotely authentic in this place. The service was completely absent and lacking, the bartenders stood in front of me and argued quietly over who was going to take me before the other one threw up his hands and said good because I have to take a... And went off to the bathroom. The portions were tiny and Incredibly overpriced with the flavorless attempt at Mexican. Not only for the first two things that I attempted to order, but also for the individual next to me our server told us that they didn't serve it anymore! So their menu isn't even up-to-date! Round that off with this business about needing a credit card before we even started ordering, a whole rack of dirty dishes sitting next to me and there you have this terrible restaurant experience. I don't know why anyone would ever come here of their own volition.", "author": "Jez R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "Not a big fan of this place. This is definitely a one time visit to this location. The layout is very nice, it's just the food and drinks are expensive and it's not that great at all.", "author": "Chaniqua T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I have visited this place a couple of times, I'm rating my second experience as I want much of a yelper during my first visit and don't quite recall what I ate or drank. I visited the place late Friday night with my fiancée and a couple of friends from Mexico City.\n\nService : the service was okay, I'd rate the service a 3.5 stars. The place wasn't overly crowded. It it took quite a while for someone to come take our orders after we were seated. We kept finishing our water and no on came around to either drop a bottle of water off at our tables or to fill our glasses. On the positive side, our orders came out pretty quickly.\n\nFood : as appetizers we had the chips and guacamole. The chips were coated with a mild spicy rub, something I haven't seen done before, it made the chips quite flavorful. The guacamole was made table side and again was good. As a main course I hade the chimichanga and it was excellent. The others I was with had the shrimp quesadilla and the pulled pork tacos. Everyone liked their food. My friends from Mexico City commented on how authentic the cuisine was.\n\nDrinks: I had the watermelon margarita and it was good, not too strong not too weak. They have a good selection of drinks.\n\nAmbience : The place is very spacious, they have an upstairs area and a downstairs area. I think they could accommodate a private party downstairs, they're also very good for big groups. The decor has a Mexican theme to it (duh). Again my friends commented on the authenticity of the decor.\n\nOverall I'd definitely come back to this especially to try the guacamole and chips again!", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "I ran into this spot unexpectedly after a client meeting and thought I would give it a try. I saw that they had a good amount of people inside so I assumed it had to be pretty decent. Also the part of Brooklyn I was in did not look like it had to many options.\n\nUpon entering we were greeted by a fabulous hostess. She was extremely nice and friendly. We were seated almost right away. Once seated we were greeted by our server. She was fine but was very monotone and did not seem like she wanted to be there. It is fine though, she did her job well and got us our orders and drinks in a timely manner.\n\nMy group went with the chips and guac as an appetizer and I chose the cobb salad for my main. The chips and guac was AMAZING. The chips had some kind of seasoning on them that gave it an extra kick, pair it with the guac and its a taste of heaven!\n\nThe cobb salad was pretty decent as well. The serving was pretty large with a good amount of meat. Nothing crazy special but it was good for what it was. When looking for a healthy choice, I would recommend this dish.\n\nOverall decent experience. The chips and guac really made the meal fantastic but the experience with our server prevents me from giving this place more than a 3 star. With so many options in NYC, customer service is so important to me and many others. Hopefully they step up their game here. I would definitely come back and give this place another try the next time I am in the area.\n\nPro tip: They have really good wifi for those who need a lunch spot while doing some work.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "The best thing about this place is that I received a free shot of tequila when I checked in to Yelp. Oh, and the bathrooms have TV screens in them, although they're behind the toilet so unless you're a man standing up to pee, it doesn't really make any sense. Speaking of the bathroom, it's a labyrinth of confusion to find it and a little creepy. It's all the way downstairs and around the corner.\n\nI came here with my bestie late on a Tuesday evening. We were both hungry for Mexican and tired from walking around all day. What better way to end the evening than with nachos and tacos, right? Well....\n\nOur server wasn't happy at all to be working that night. He looked annoyed even from across the room before he (finally) came to our table. It was late, like I said, so maybe he'd just had a long shift. I'd give his service 2.5 stars.\n\nMy friend's tacos were tiny. I was shocked, actually. It looked like they put half a scoop to one scoop of each ingredient in there. When I bite into a taco, at least toward the end of the taco, I want stuff to fall out onto the plate. After two bites, she was eating just tortilla. Disappointment.\n\nMy nachos were ok. The chips were burned and too hard. The portion was at least a good size; I got half an order, which was more than enough. It was very tasty as far as flavors go, but the hard chips almost ruined it for me.\n\nThey have all the tequila you can ask for, so I'm guessing they're hoping people will get drunk, at least tipsy, and not notice their food isn't that good. The atmosphere of the restaurant makes for a nice place to hang out with a group of friends. I wouldn't recommend it for a date if you're trying to have a conversation; it's pretty loud and a little dark.", "author": "Clariee J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "As we planned a weekend in Brooklyn - our stay at the Marriott @ Brooklyn Bridge found ourselves right next door to Rocco's Tacos \u0026 Tequila Bar.  A great restaurant/bar and we ate a good meal at an early hour - as it was not crowded at that time.  Waitress was attentive and kind and very helpful with recommendations. \n\nChips and guacamole were delicious as was their margarita!  We ordered the Rocco's Tacos:  flour tortillas, served with taco sauce, pico de gallo, cilantro, pickled red onions, and cotija cheese.  We ordered a few:  Pollo (pulled chicken in adobo), Cochinitas Achiote (slow roasted pork), Chorizo Sausage, Camarones (shrimp) and the Carne Asada (steak).  My number one was the Chorizo Taco - just fabulous!!  After adding all the sides - the flavors with the meats were incredible - my fav was the picked red onions :)  \n\nMy only complaint is that I checked in on YELP and an offer appeared on my phone, 1 FREE shot of tequila with an entree.  Well we ordered a lot of food and a few drinks but they would not honor the ONE shot as we did not get an \"entree\".  I would opt for a better review and happier customer .... just honor the ONE shot of tequila.  Food scores high - customer service - not so much.", "author": "Allison A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "The managers are more drunk than some of their patrons. The staff will steal your dollar if you look the wrong way. \n\nJust avoid this place. There are so many, actually good, places to get tacos in BK. \n\nAnd you don't have to see a mouse or cockroaches while you dine.", "author": "Kay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Roccos Tacos and Tequila Bar in Brooklyn has come from Florida. They offer margaritas that are absolutely delicious! I had pomegranate margaritas and liked the house one too! \n\nWith regards to the food, they make guacamole next to your table so you know it's fresh, give you nachos which I very much like and (as per the name) have a vast selection of tacos to choose from. Yes, this was my first taco. And no, it won't be my last!\n\nSpent my Saturday with a margarita in my hand once I'd eaten my nachos and tacos, watching sports at the bar. It was a really good day! This place is perfect for a chilled afternoon, a catch up with friends or a day drinking pomegranate margaritas. For which, you don't need a reason...", "author": "Louise H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "The service failed me this visit..\n\nMy waitress did not provide the same level of service to me as she did to others in her section.\n\nBeing alone, I observed the personal connections she created with her other sections. The only thing she asked me for is my ID and what I wanted to eat...the bare minimum.\n\nI guess she figured since I was alone, she wouldn't get a decent tip in comparison to a larger group...\n\nI quickly finished my drink and got a to go box for my food. The last thing I want to feel is paying to be mistreated.\n\n\nPlease note I have been here before and have received superb service, the food and drinks are good so I will view this as an isolated and return, I'll just request to sit at the bar.", "author": "Sherri D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-18", "description": "The food? AMAZING. Full of flavor and delicious. The drinks? Sub-par, a little over priced, but if you love tequila you'll probably enjoy it. The service? ABSOLUTE GARBAGE.  Our waiter, Mickey or Nickey (whatever the hell his name was) gave me the most nastiest eye roll when I asked him a simple question, to wrap my food up. Keep in mind, the gratuity is included, so they're free to treat you as crappy as they please. Aside from Mickey/Nickey attitude issue, he is also sexist! :) we had a party of 6, 5 females and one male. When my male friend went to use the restroom, Mickey/Nickey pulls him aside and says \"I dropped the check off, you should definitely go help them out since they're having such a hard time figuring it out\".......ok.......you pull the only man of the table aside because the rest of us are too stupid to figure it out? The worst part of it all is he walked away with a 36 dollar tip from us, when he deserved a clean 10%. He did the BARE minimum, therefore, he DESERVES the bare minimum. I loved the food and the atmosphere, but thanks to Rocco's tacos shitty wait staff, I'll go with one of the other 500 taco spots in Brooklyn next time.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "We visited Rocco's Tacos and we have to say the food was pretty good.  Started off with Elotes and they could've used some more flavor. The guacamole was good and we ordered a fajita style dish. The main dish was real tasty.  We also ordered margaritas which were just ok. I could say that the waiter was a bit snobby.", "author": "Claudio P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Was staying next door at the Marriott. Ive been looking to go here for a while and finally got the opportunity. Great food! Large portions. The guac was amazing! Super trendy and clean which everyone appreciates. The only downside was that the service was very slow. Came on a Saturday night, was not busy but maybe they were short staffed.", "author": "Emma E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "HATE. HATE. HATE. i've never been here prior to today. i decided to go for taco tuesday and i regret every penny spent. to start the hostess was extremely rude, we asked for outside seating but she said they couldn't rearrange the seats outside (it was 6-7 of us) and this was fine but we requested seating closest to outside. she proceeded to try to sit us in a booth far in the back then caught an attitude when we asked her to seat us in the area request and just huffed and puffed. now my waitress, she was very pleasant. our food took an hour to come and no one bothered to check in or anything. the cutlery was DIRTY. and when they finally bought our food, it was \"y'all ordered tacos?\" it was a disgusting experience. the food was okay, the chicken tacos were dry, fish tacos were nasty and the shrimp tacos were great. but the service alone was so horrible, it was enough for me to never go back again and the food is not worth it at all.", "author": "Aliyah A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}