{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Great meal sitting outside on a nice spring day- the Seafood Molcajetes is amazing. Our server Dean was great. He had great recommendations on the food and the drink and had a great sense of humor. We'll definitely be back.", "author": "Brad B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I came here a little over a month ago(didn't have the time to review it right away) and I waited over 20 minutes just for a server to come take our order. Some of the staff were rude and cold, our server however, was pretty friendly. Maybe a little too friendly to the point of awkwardness, she mixed up my friend a drink and waited enthusiastically for his reaction even though he didn't really care about it--a drinks a drink ya' know. Food was ehh, the first batch of chips were stale, the seasoned ones were pretty good...but I don't see myself coming here again.", "author": "Hoda A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "Jen the hostess forgot to put our name down after 45 minutes of waiting!!\nwe arrived at 7:40 and they finally found us a table at 9:05. When we arrived, they wrote down on paper our name, number, and told us that they would call but it should be around 40 minutes. By 45 minutes we asked them if our table was ready and the hostess proceeded to look at her list and, though she did not explicitly say it, she acted as if we were not in the list. Despite this, told us that a table would be ready shortly.  They then told us that they did not forget to put our name in the list, but minutes later told us that there were many hostesses and names were getting mixed up. In addition, she told us the table would be ready in five minutes. After saying 4 more times it will be five minutes, they told us that our table was finally ready. 1 1/2 hours later.  40 extra minutes from when the table should have been ready.  I get that some people may say \"oh well a lot of restaurants take some time\" but lying repeatedly is wrong. In conclusion, they not only took an hour and a half to get us a table, but lied repeatedly about the wait and our name being on the list.", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-10", "description": "Went here for lunch on Monday.  Food was pretty good.  I had a Cobb Salad.  The fresh guacamole served table side was delicious with freshly made chips.  Yummm.  I would visit here again if ever in the area.", "author": "Taikeya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "a lively but still chill place for a good happy hour \u0026 plenty of space for larger parties \u0026 Albert is the best server in the house", "author": "Robert G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "I'm going to start with I love Rocco's Tacos. I'm from Florida so I usually go to the Orlando location. This was the worst experience I've had at one of these restaurants at this location. Came with my family on a family vacation, 7 of us, so we didn't mind waiting for a table. However once seated it took about 20 minutes for someone to greet us and take a drink order. Mean while the table next to us was extremely loud and rude. We literally couldn't hear each other right next to each other. Our waitress never came by so we had to find someone to complain to. They moved us to another location but then we had to wait another 20 minutes to finally get some drinks. \n\nOnce the drinks were finally delivered the waiter said he would be back to take our dinner order. After about another 20 minutes of waiting we were ready to walk out when another new waiter came by. He gave us a free pitcher of margaritas to make up for the horrible, up until that point, evening. From then on it was great service. Really rough start but ended better thus the 3 Stars.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "Plus: staying next door, able to get on the wait list, go back to our hotel \u0026 be summoned by text when our table was ready. Plus: beautiful decor.   Minus: ads ON TABLE for happy hour deals ONLY available at the bar.  Minus: Can't be seated at a table in bar area unless you're getting food. Plus:Food is decent.  Minus: service is TERRIBLE...food before drinks, 15 minutes for WATER...having to ask bus boys to go FIND your waiter....sheesh.This place survives on the Marriott next door, NOT on their service... most people probably only go there once.", "author": "Laura L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "I would like to say the food was great and the young lady Kailor was a great host, anything we needed she got with no issues. The staff was very friendly.  Keep up the good work Roccos Tacos \u0026 Tequila Bar.", "author": "Tania G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "Fun, festive environment\nFun is better with groups\nFood is alright\nI've had all the tacos and beef is the best\nTaco Tuesday can be all that, if you come hungry (I barely got through 7)\nService was exceptional\nThe pitchers were nice and alcoholic\nI was there for the pitchers, I'm coming back for the unlimited mimosas", "author": "renje g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "When I started this review a few months back, I never finish it because I wanted to go again and see if my experience would improved.\n\nThis restaurant has the friendliest staff ever, from bussers to the manager everyone was great, except for Alexa (an annoying waitress who does not listen to what you want on the side of your dish, never refill your water and takes forever to come to the table even for the check.)\n\nThe first time my experience was pleasant because Alexa didn't take care of my table. The last two times she was our waitress and it was awfully annoying. I brought visitors from Miami, and I didn't tell them that I had a previous bad experience with that waitress, but they told me how inexperienced and unqualified she was while we were there.\n\nShe messed up our orders, never brought their drinks. Took forever to brink the check and never offer a dessert menu. Most importantly, never apologized.\n\nI would say that the food was good. Even though I asked her to bring my sauces on the side and apparently she never informed the kitchen because all the sauce was on top of my burrito and it was SO spicy ( I don't eat spicy food) I told her and she didn't even try to resolve the issue. So I basically didn't eat it, didn't take it home, and paid for it anyway.\n\nI don't want her to lose her job because of a \"whiny annoying yelper\" (I bet that's what she is going to think) but I believe this platform is more about helping the restaurants and places to improve their service and have a better customer experience. Maybe she can use an extra training and a workshop to handle orders and her own attitude towards the customers, which in this industry \"are always right.\"", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "This place was very unique and tasty! I came here with my gf on a rainy Sunday, and the place was pretty empty. The decor is very interesting, almost like a latin \"celebration of the dead\" vibe - very colorful with decorated and happy skeletons, and really cool lights and other other items.\n\nOur server was great, and ask for the guac! They actually make it in a pestle for you fresh, tableside. The chips and guac were awesome. Next week had the fish tacos and the Durango platter. The platter was very tasty and filling, the meat combos were cooked perfectly. The fish taco was unique and good, but the fish was strongly \"fishy\". I would have preferred a variety with a lighter fish taste.\n\nThe atmosphere was loud at times despite the few patrons, as some were enjoying the bar quite enthusiastically - but kind of the norm for a tequila bar. The service was kind and attentive.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-13", "description": "Went here for a birthday party! Great ambience and spacious restaurant! The food is very average!", "author": "Utsavi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Great experience last night with my wife and food was great. I will definitely go back to this one and clematis street", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Had the best service at this restaurant. Our waitress Emma was amazing. She was attentive she helped us out at every moment and she was probably be best waitress we've ever it had in all restaurants in New York City.", "author": "Albert O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Rocco's is a go-to favorite! Good good, cocktails (the mezcal Paloma is so yum) and fabulous guac. If you're lucky you will get Dean helping you with your table. He's personable, professional and fun; you feel like you are in good hands because you are! You can't go wrong any day of the week at any time of day. And when the weather is nice, sit outside. Tacos and sangria with the sun on your shoulders. Just YES!!", "author": "Christina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Mexican in downtown brooklyn anyone?... YES PLEASE! Really enjoy this place. Love historical like decor options - check out the bathrooms!  Staff is super friendly (shout out to Bella as server and Mike at the bar), food is soo well seasoned (no lack of flavor here), guacamole made to order at the table, and comes served with seasoned chips. I've had a few meals here and I think you can't go wrong with a quesadillas or the tacos (I like the beef on a crispy corn shell), but other options are a plus too! Order up... Drink time!!...  i really enjoy a spicy guava margarita; if your looking for fun spicy cocktail, but every drink made by Mike has been yummy!  Dessert?...  off the bat- Tres Leche !!  \"It was milky, creamy, and delicious...\"\nEnjoy guys... give this place a go, think you'll enjoy if around the way. Buen provecho!", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "I saw the restaurant sign litup after I exited the subway station across the street. \n\nAs soon as I walked in, I fell in love with the ambience and decor of this place. Chandeliers everywhere and other one-light fixtures hung from the ceiling. It's dimly-lit and buzzing with energy. Spacious venue. There's the usual level of noise, but can be a nice date place. Great place to have drinks and or eats.\n\nI ordered a blackened fish and a grilled fish tacos. Both were not hot when waitress brought it to my table. Classic margarita was light on alcohol. I decided to eat and drink them 'as is'. The Tres Leches Cake was like others I've eaten. I wished the meringue-like topping was real whipped cream. Even so, I cleaned dessert off that plate.\n\nThere's booth seating and regular table seating. Bathroom downstairs. And, more seating and a bar with a TV downstairs/cellar.", "author": "Judy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "If you are looking for the best guacamole \u0026 chips (or veggies) Terry is the guy to see!!! He takes the time to make you feel like you are the only table! His attention to detail, time to talk to the table, make you feel special. He is a guac expert, and will make it exactly how you want it. Terry is the reason why we continue coming back to Rocco's!", "author": "Cindy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "I had the most amazing visit to this Restaurant today. I was just stopping in for lunch from jury duty and received prompt service. We were seated immediately and that's when we met Dean, probably the best server I have encountered.  He was able to recommend great dishes and made sure they came out in a timely manner since I was on a short lunch break. I would definitely return and of course ASK FOR DEAN !", "author": "Giselle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "LOVE, LOVE, LOVED visiting with you all. This was my first visit and here and it was outstanding food and the service who was provided by Deyonte (Dede)and was superb!!! She served us with a smile, was extremely attentive and friendly and made us feel like we were in a living room. This my new #1 taco spot and I live in Bklyn! Will be back next week for sure", "author": "Odetta Q."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}