{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "Ive heard good things but the service just wasnt great when i came. Took a while before someone was flagged down to prepare the mild guac and chips that was just too spicy. Was recommended the quesadilla was steak and plantains which i didn't like but they didn't hesitate to take it back and give me a chicken quesadilla instead. My friends buritto was pretty good. So maybe it wasn't my day. But for the price i was paying i would have liked a better experience.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Nice Mexican Restaurant! Love it's Live Guacamole  \nWe had stuffed Rellano peppers and pollo tacos and enchiladas ! Good time spend and good interior ..", "author": "Arti P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "I've been eyeing the construction for sometimes now and to have a Tex-Mex option nearby was pretty exciting.\n\nThe vast interior is airy and not to loud the night we went. Cleary the interior decorator went to town here including the audacious bathroom. While I only saw the men's room, I wonder that the woman's must be like.  I like the variety of seating options. We got the booth along the wall. \n\nOur college student service was really good. He got our orders and was attentive without being too much. I like that. We started with the guacamole. He asked if we wanted spicy and said it wasn't spicy even on the most spicy. He was spot on. We also ordered the margarita to start. The California fish taco and Pollo Carbon as entrees. \n\nMargarita was pretty weak.\nGuacamole - despite all the ingredients made in front of you can spicy was bland.\nThe battered fish was bland. I guess the accompany sauce was suppose to help.\nThe grilled chicken fillet was decent. I liked the maduros. \n\nToo me this Florida based chain first restaurant in Brooklyn reminds me as Olive Gardenequese.  The food is decent in a comfortable environment.  The food is a bit on the bland side for me but maybe that is what white people from Boca Raton think flavor/spicy is. Rocco's is a good place to grab a drink and appetizers with friends in downtown Brooklyn.", "author": "David N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-22", "description": "The service here was terrible. I decided to sit by the bar and order a couple of drinks while I ate and I think that was the biggest mistake I could have made in my life. The bartender was a complete asshole and begin his conversation by telling me how bad of a day he was having. At the end of the bill when he noticed I didn't leave him a tip for his poor services he threw my card at me. I'm still waiting to hear back from the GM for my bad experience.", "author": "Rahmel Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Angel was on it from the beginning! \n\nWhen you come to Rocco's do yourself a favor and ask for Angel.\n\nTaco Tuesday was on point.", "author": "Jberia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "Ive been there 4 times. Each time the food was barely warm or frozen in the middle. Each time it was returned just the plate was hot.  The only redeeming eats was the guacamole made at the table. The drinks were great.\nThe servers Ashley and Jackie made the experiences good and friendly.", "author": "Rhea C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-05", "description": "The price of tacos are too expensive. The bar has limited selection. But hey the line isn't long which is good!", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "First off let me say, great guac! The table side guac was def worth it. The drinks are on the strong side but that's always a plus, and the service is great. I would definitely come for taco Tuesday's. Worth the drive from Long Island!", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Recently went to Rocco's Tacos for a bite to eat and to check it out since it's in our neighborhood.\n\nThe establishment itself has a nice Mexican feel to it decorated with mini guitars and colorful masks representing Dia de los Muertos, however, the hostess service could be better.\n\nAfter being seated next to a loud group beside us, we asked our waitress to see if it was possible to move to another table since the group seemed to be getting louder. The hostess returned to our table with a look as if it our request was too much to ask for. When she came over, she gave looked at my husband and did not say anything. When we asked her if we could move to another table she responded by saying \"No, you can't.\" When we asked why we were unable to move, she replied back by saying we had already opened a tab and ordered food; therefore we could not move.\n\nI'm sorry, if you are in the restaurant business, you never tell your customer, no you can't. If you want customers to come back, you listen to their request and then problem solve to see how you can accommodate their request. Since she clearly lacks customer service, the manager came over to assist us. After speaking with the manager, we managed to resolve our situation.  \n\nWhen our food arrived, there was really nothing special about it. The presentation of the food was blah and boring and we could not wait to leave. If I were a food critic, I would not recommend this restaurant to any of my family or friends.\n\nThe only thing nice about that place was the manager who at least tried to assist us and our waitress, that's it.\n\nIf we want Mexican food, we will go to Dos Toros Taqueria or a real authentic Mexican spot right by our apartment.", "author": "J Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Food is outstanding. Drinks are off the chain!! Waiters are pleasant. Restrooms are cute and sassy.", "author": "Jazzie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Just had a great dinner at Rocco's. I had been there for drinks one time before (amazing margaritas) and have been wanting to try the food. Food was awesome and there are tons of options! They were packed on a Tuesday night so anticipate a wait on Thursday, Friday, and Saturday. \n\nHad the taco salad, which was delicious. Amazing dressing. And two tacos (shrimp and mushroom)", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "My boyfriend and I came last night to enjoy a little dinner outside of Manhattan!\n\nI ordered a watermelon mojito as a drink and he had the lemonade with tequila. Both of our drinks were really, really, really sweet but definitely strong enough. Mine tasted nothing like a mojito, but alas, it was tasty.\n\nWe ordered guacamole to start which was definitely the highlight of the meal. They make it fresh at the table. \n\nAs for entrees, I ordered the california fish tacos and unfortunately, they were missing some zing to them! I was expecting the avocado ranch sauce to be drizzled all over the tacos, but there was just a little bit on the bottom and it basically tasted like a fried piece of fish in a taco. I had also filled up on guac and chips so I wasn't particularly hungry. My boyfriend ordered the wet burrito which was pretty tasty! He ended up finishing the entire thing.\n\nAs for dessert, we ordered the churros which were INCREDIBLE! A must-order if you visit this restaurant. Hot and ice cream and chocolatey ooey gooey goodness.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "Nice looking place and well located . It's just a topical sports bar that tries to mix the Mexican flavor with something of a chain restaurant/bar feel. The margaritas were very sweet and barely he any alcohol . The service was totally robotic and uninteresting . Very corporate run place that tries to be cool . The best thing was the decor in my opinion .", "author": "andrea p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "5/12/16 - I came here for a private party and was more impressed than I thought I would.   I had a few drink (Ranch Water - Lime, Silver Patron, \u0026 Soda) were solid and well made - have one (or 2 or 3) and let loose.  There was a buffet type set-up where the steak and shrimp that I had was really great.  I will say the one disappointment was the dessert items - they left a lot to be desired.  Bottom line - good place to stop for a drink after work and a small bite to eat", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "First of all, our server Jarren was awesome. He alone, makes this place deserving of 5 stars. He was friendly, polite and super attentive. He kept coming over to make sure we had everything we needed and the he was always smiling. We were first timers, so he made great suggestions  (Uhm, Casamigos Lemonade? LIFE.CHANGING.) Nevermind the fact that he was cracking jokes and keeping us smiling along with him. LOVED HIM. The food? FAN-FREAKING-TASTIC. The guacamole is literally made to order and if it looks good, it tastes even better. Speedy service, delicious food, awesome friendly staff?!?! can you say heaven? cause that's what this place is like.", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "We were happy with our drinks, had the margaritas. The food is pretty good but not authentic Mexican. The table side house made guacamole was cool but a bit over priced for what you get. $15 and they used 2 avocados... The service was stupid slow hence the 3 stars. Everything took forever...drinks, guac, getting our checks, running our cards. But it was convenient to the hotel..", "author": "Val S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I had the best time here for my birthday! I'm so happy I picked to spend my special day here! The staff was amazing as was the food!\n\nWe got guacamole made fresh in front of us and not only was that an interesting show to watch, but the final product was fantastic. So tasty! For my entree I had the chili rellenos with black beans and rice. That was also very good! Kind of spicy but enough for me to handle!\n\nThe showstopper of the night for me though, was the blood orange margaritas. I had two of them and they were delicious! Great flavor not too much alcohol and not too fruity but I would definitely go again for that!\n\nService was a bit slow, but I think it's because we had a big crowd. Our server Simeon was very sweet though!", "author": "Tiffani G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "The decor, the ambiance, the music, is nice and unique.\nThe service is fine \u0026 quick depending on what you order.\nThe food is good-nothing over the top though. \nI don't understand why we can't call our orders in. You need to go to the bar and place your order for take out. If you have time, it's good for an after-work gathering-but not suitable for most employees that usually have 45 min to 1 hour lunches.", "author": "Joujou N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "Really a 2.5.... and this pains me because I love tequila.\n\nHad dinner here the Friday after the grand opening around 10pm.  Had drinks at the bar while we waited for our table and this was the best part of my experience.  The bar is HUGE and the bartenders were super attentive and fun.  I had the antioxidant margarita and it was delicious.  If I go back, I will dine at the bar....\n\nSomeone approached us and told us our table was ready.  He carried my friends drink to our table but never offered to carry mine.  So I slowly followed behind my friend as I balanced my large drink, coat, and purse.\n\nAs soon as we sit down, the waitress approaches us and rudely tells us \"You can't just sit here, there's a wait for tables.\" Excuse You? I tell her we were just seated there and she says \"Oh didn't see menus so I didn't know...\"  I won't explain why anyone with common sense would never approach patrons in this way...  We then don't see the lovely waitress for 15 minutes.  \n\nI finally flag her down and we order another round of antioxidant margaritas and table side guac.  She asks if we want the guac mild, medium, or spicy.  We request spicy.  When the guy arrives to make the guac he asks again mild, medium, or spicy.  We say spicy and it takes him 10 minutes to create the blandest guac I've ever tasted.  It's not only lacking spice, it's lacking any flavor beyond avocado.  We request \"fuego sauce\" which was described as a 9 on a hotness scale of 1-10 but is really a strong 6, salt, and lime to save it.  We have to add these ingredients ourselves because they are not allowed to pour the fuego sauce.  Our margaritas taste nothing like the delicious ones we had at the bar, they are extremely tart and appear to be missing acai.\n\nWe once again flag our waitress to order entrees and our entrees: shrimp, mahi mahi, and california tacos are no better than the guac.  My california tacos are especially bland except for big chunks of pineapple.  The manager was awesome and graciously removed my tacos from the bill without being asked.\n\nAs we leave my friend realizes she can't find her scarf.  She asks the hostess if anyones returned it and the hostess has the biggest attitude.  She says she'll have to go downstairs and check the lost and found and she clearly doesn't want to do it.  I should note, this is not the hostess who greeted us upon entry... \n\nAll in all, I really hope this place works out its kinks because I live in downtown Brooklyn and have been waiting for a great Mexican place.  I also want to reiterate that the bartenders we encountered and the manager were lovely!", "author": "Monique H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "Went on a Sunday night, the place wasn't packed, but for some reason, our waiter,  Jonathan, wasn't too attentive. Took him a while to get our order. When we were finished with our water, he was no where near to be found, luckily another waiter gave us water. When we were ready to go, he wasn't around either, we had to call another person.......\n\nAmbience was interesting, guacamole was yum, all stuff were friendly.", "author": "Mengxue C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}