{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Here on a work party around Xmas. Didn't have a typical experience w the restaurant, granted. \n\nThe shrimp tacos were tasty. The guac was passable, not quite where it might have been for a mex resto. The design and environment were \"delightfully tacky\" but I'm not sure that was 100% the intention. Staff was kind of absent. \n\nWould happily return with cause, but wouldn't go out of the way for it.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Their passion fruit margarita was amazing!!!\n\nI wanted to stay, get a pitcher of the frozen margs and a whole bunch of tacos, but my friend wasn't feeling it. We ended up just getting one pitcher and a taco each. I got a fish taco, it was pretty good. \n\nThere was some left over marg in the blender and instead of tossing it, the bartender gave it to us in an extra cup. I thought that was pretty cool. The people next to us had nachos which looked amazing. I desperately want to come back here.", "author": "Stephenie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "So excited for them to officially open. The grand opening cocktail party was so much fun. It's a massive bi level space, which I wasn't expecting, and I think they will do really well. Our chips were fresh and warm, guac was really good. Sadly that's the only good they were serving since they don't open until tomorrow officially so I will just have to go back and test the food and service.", "author": "Desi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "I visited the restaurant for the first time today. The host who sits you at the table was rude and had an attitude when I asked to change my table, not a people person. I wasn't too thrilled with my meal. The chicken was under cooked which turned me off from the rest of the food. The server hardly came to the table to check on things and took forever to bring the check and when she did, she took twice as long to come back and get it. The only thing I did like was the Margarita. I don't think I'll be back.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Cool new spot in downtown Brooklyn. This place is definitely catered to the after work happy hour crowd. Luckily, I fall right in to that category.\n\nStopped by for dinner with coworkers on a Monday night. Place is spacious,decently crowded, and our server was knowledgeable and very friendly. The decor is pretty nice, with gaudy mexican chandeliers in every room. I could see this being a great spot for large groups. However, the music in the upstairs bar area is loud and obnoxious- so try to sit downstairs if you want to be able to have conversation at dinner without yelling.\n\nWe started with table side guac and queso fundito. Both were delish. Then again, you cant really go wrong with guac and melted cheese. For dinner, most of us ordered the molcajetes, which is Rocco's take on fajitas. Different meats and seasonings stewed in a lava rock bowl- very flavorful! All of us enjoyed the molcajetes and would order them again in a heartbeat.\n\nI also had a sangria which was just okay- not bad but also nothing note worthy about it. I would say Rocco's is a cool happy hour or after work spot. The food is not finely crafted or authentic but that's not why you come here. It's fun, convenient, and the menu has enough variety to please a group.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "Its like an under-budgeted Dos Caminos with bad pre-packaged tasting food. I know I got mild food poisoning because my stomach has been cramping for the last few days since the moment I left there. I had white sangria (terrible), guac and tacos. The guacamole was ok since they make it fresh in front of you. Service is slow. Overall very disappointing.", "author": "Fahrees M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "I love this place. Even my picky eater, my 9 year old daughter, loves coming here. Great food, great service (ask for David's section) \u0026 great drinks!!! I'm told they have a Dj, Tuesdays - Saturdays, after 6pm. Happy hour starts @ 7pm. I'll be back to review happy hour! Welcome to Brooklyn  Rocco's Tacos!!", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "My boyfriend and I went to the Nets game and saw this place advertised during the game. Since we wanted to grab a late dinner after that game anyway we decided to try this place out. \n\nAt first we wanted to just sit at the bar but one walk around that bar and you could tell that wasn't going to happen - it was packed. \n\nWe waited about 20 minutes for a table which wasn't bad at all. For drinks I had the pomegranate margarita, it was completely watered down, I did not like it at all. My boyfriend had the tequila mojito - that was really good, we both enjoyed that one.\n\nThe food at this place was mediocre at best. We had the nachos with guacamole, they put a kind of powder seasoning on the nachos that really doesn't taste good. It just makes the nachos spicy and makes you cough when the powder gets stuck to the back of your throat. We each tried the nachos, I had the carne asada and my boyfriend had the chicken - nothing to write home about. We also tried the flautas and these were actually okay, but nothing spectacular. Certainly not worth the price. \n\nOur waitress, started off very nice, sweet and attentive but as the time went on she became rude and harder to find. Not sure what was going on but certainly did not appreciate it. When I finally got her attention to ask for the check she just nodded and walked away then returned about 5 minutes later and just placed it on the corner of the table without another word. \n\nAll in all, the food is mediocre, the service is average but the drinks are OK. Wouldn't return here unless I was in the area and even then I'd just come in for a drink at the bar.", "author": "Melissa Rose P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Brand New Mexican Place. I love the food, the lights, the ambiance, the staff oh and the drinks!!!", "author": "Tabrina Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Loved everything in here. The decor is unique. Very spacious. The bar is almost the length of the restaurant. Had unlimited mimosas for $12. Also checked in to receive a free shot of tequila that may have laid me on my back if I didn't have water. Food was delicious! Can't remember what I had because after the shot \u0026 3rd mimosa, it was all about enjoying the game playing on the tv with my date. Definitely will be visiting this place again \u0026 again but not during peak times. It's located in downtown Brooklyn so on a Friday \u0026 Saturday, it will be bombarded.", "author": "T B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Awesome place. Yummy guacamole and the mushroom tacos are better than any meat taco, ever. LOL", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "Was excited to find a Mexican Restaurant in downtown Brooklyn.. Nice decor, large venue and lots of space at the bar.. food was good and drinks.. came in for happy hour.. so I thought.. prices were are not average happy hour prices.. 9.00 for a drink? very limited menu for happy hour also... will come back but lots of other options for happy hour one or to stops away on the train to manhattan..", "author": "Renee W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Omg I'm in love. The decor is amazing and the food is well seasoned and simply delicious. We ordered the shrimp and crab guacamole, trust me it doesn't disappoint, it's authentic guacamole. I also ordered a pitcher of the passion fruit margarita and tacos. If you haven't visited yet, stop by Rocco's. The BurritoBar on Atlantic can seriously take some tips from this place. Oh and the crowd is super diverse and the music is great.", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "So my friends dragged me back here last Wednesday even though I was adamant about not going. The location was very convenient for us as we all wanted to meet for after work drinks and we all work in different boroughs and use different modes of transportation. I must say the second time here was MUCHHHHHH better than the first. I wasn't extremely hungry as I had a late lunch so I only ordered the corn appetizer and they were soon delicious. We had about 6 pitchers of margaritas and everyone left with a buzz. Pricing is ok because of location and the service was MUCH better this time than the last. Last time I sat and the bar and this time I sat at a table. I might come back here just for the corn lol.", "author": "Nika R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-16", "description": "You would think that a restaurant would have a heating system in the winter. One of the coldest nights in NY so far and only one table had a plug in heater right next to them. My bones hurt from how cold it was in there. Food was ok. Drinks tasted like rubbing alcohol so I returned it. Horrible experience.", "author": "Joellie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "This was my first time here this past week. As I had a mini break, I decided to make a stop here. My server Lisa was exceptional. Since it was my first time I was unsure of what was good and what wasn't. She had great recommendations, which one was the California Fish Tacos. She also recommended a watermelon kiss Margarita. She was very attentive and knew what she was talking about. The restaurant had a great vibe to it. Food, drinks, and great service! I will definitely make a stop here again if I am in the area.", "author": "Monica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "I am very excited to have this new addition to the neighborhood. Went there with a few friends for brunch (their first brunch, actually) and, I have to say, we were pretty impressed. Guacamole is a specialty and they definitely do it well. What we ordered was the pomegranate and strawberry guacamole, which was very interesting. Every brunch dish was huge and satisfying. Can't wait to try their dinner menu!", "author": "Blaga S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "First I would like to say that my coworker and I are frequent customers.  We have our lunch there at least once a week due to the great customer service we receive from Kathy and Jason. On December 13, 2016 my coworkers asked me where did I want to celebrate my BIRTHDAY. I told them my favorite place ROCCO'S TACOS, of course. We arrived approximately at 12:40 P.M. The hostess sat us on the main level private room to the right of the main entrance. Our server LISA was very slow and inattentive. We ordered a pitcher of the Mango Margarita and a pitcher of the Strawberry Margarita, as well as the guacamole. She took very long bringing us the two pitchers. We were undecisive as to what our party of 7 were going to order. Since it was Rocco's Tacos Tuesday we were interested in ordering the unlimited Tacos, but a few of us were going to order other items from the menu. At that point my friend said well you can share some of my Tacos, when Lisa immediately interrupted the conversation and stated \"you can't share any Tacos\". My coworker then asked  \"but what if I want someone to try a taco, can they try it?\", she stated \"no that we will be watched on camera and that the manager will walk around to make sure no tacos are being shared\". Those remarks immediately offended us. We asked to speak to the manager who did not introduce himself and appeared as if he was being bothered when he came to our table. We found out from another server that his name was AL. We asked the manager \"If someone wanted to try one of the tacos why is it that they can't?\" His response was, \"The unlimited tacos are for individual orders only and that's the policy\". He left immediately after. Due to the poor service we  received we decided to pay for our drinks and leave. We asked LISA if we can get the check, she sucked her teeth, walked away and left us waiting. We had to ask another server for the check. In all my life I've never received such poor service or insult to my intelligence. We will never return nor recommend Rocco Taco. Thank you for making my BIRTHDAY SPECIAL.", "author": "Siul A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-14", "description": "Capital D for disappointed. Don't let the awesome decor lure you in. Service was poor, food wasn't anything special. Very bland. Quite possibly the only Mexican restaurant that doesn't offer you chips and salsa when you sit down. Come only for drinks.", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-01", "description": "The food and atmosphere was cool. The waiter was very polite and friendly and we were given service in a timely fashion. So why am I giving them two stars? Something the staff did towards the end of my night with my date really rubbed me the wrong way. \n\nWe finished our meal, paid for everything, and left a decent tip on the table. We sat for no less than 5 minutes to digest everything and finish our drinks before they had a guy from their security team stand awkwardly in front of our table, facing away as if to intimidate us into hurrying up and getting out of there. My date also overheard one of the waiters tell the guard to stand a certain way in front of us I guess so we can get the message. Now me and my date were not making a scene or anything - like I said we just finished our meal and were just chatting for a bit before leaving. But the way their staff tried to indirectly rush us out felt extremely unprofessional and disrespectful and ruined the entire experience for my date. I get that it was a busy night and business was booming but was it really necessary to try to rush us out as soon as we gave you our money? Until they treat customers well throughout the entirety of the experience I will be taking my money elsewhere.", "author": "Omari E."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}