{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Love having the guacamole made in front of us. The music was really fun too. I will be returning soon.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "As I sit here for over an hour waiting for a table. we went up to the host and was told 15 more minutes. I have worked in restaurants in the past and have eaten at top places in this country and over seas . So when I tell you don't even bother to come out to this place I know what I'm talking about. This place just sucks when it comes to service. So go to your small local restaurant and give them your hard earned money not this place. I gave them one star for the music that I haven't heard from the 90s.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "Service on the 1/21, was absolutely horrible. We arrived for a 9:15pm reservation was seated immediately with 3 empty tables surrounding us. Those tables were filled 30 minutes after our arrival, given guacamole and chips and ordered their entrees before us. I had to chase down our waitress in order to order our entree. Her excuse for not coming back to our table to take our order \"You had stuff already\". The only thing we ordered was salsa and drinks. The manager, Zena, was making her rounds and asked about our service. We told her about our experience with the waitress. She apologized for the poor service. The waitress came back to our table to chastise us for speaking to the manager making an excuse that the computers were down. As my friend and I tried to enjoy our entree, the waitress pointed over our heads to the general manager making us feel very uncomfortable. We couldn't understand why we were being targeted. I removed myself from the table and spoke to the general manager in regards to the waitresses behavior that was indeed ruining our experience. We could not eat in peace because she repeatedly came to our table to chastise us and argue. The general manager switched waitresses and offered free drinks with dessert. As if free drinks and desserts would retain our business. At this point our appetites were gone. We asked for to go boxes and our check. It took the restaurant over 40 minutes to get our check to us with the drinks discounted by 50%. We told our new waitress that this is not what was promised to us by the general manager. The general manager left for the evening without ensuring that we would be taken care of. We had to protest and refuse to pay the entire bill before we could get any resolution. This entire production not only ruined the service for my friend and I, but other diners as well. No one other than the poor manager Zena tried to help us but her hands were tied by the general manager. I will never step foot inside this restaurant and will definitely rally up my friends and family to never support this place again.", "author": "Parker K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "Do not go here. Went for brunch with a group of 15 ppl. The server was inattentive and rude. We all partook in the bottomless brunch. We were there for 4 hours and maybe each got 4 drinks. That's right, it took a out an hour to get each round of drinks out. Being that there are only two options for the bottomless brunch (mimosa and bloody marry) I'm not sure what took so long. The bloody Mary's were straight up tomato juice lacking in vodka. The food finally came out about an hour after ordering. My burrito was cold and inedible and my finances rice was not even cooked. It was hard and dry. I spoke to the manager several times who told me \"her skin was crawling\" bc of the horrible experience we were enduring. She then said that she would see was she could do. Needless the day the best she could do was take $30 off the bill. BIG FRIEKEN DEAL what really shoulda happened was a free round of drinks and remove that horrendous $13 pp for a bottomless brunch that was pretty much useless because our sever was incapable of handling a large party. Anyway,  WE WILL NOT BE RETURNING. this place is gross. Do yourselves a favor and avoid this place.  Rocco's tacos makes chipotle looks like gourmet food. Shame of Rocco's tacos, our server and the management.", "author": "C R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "Atmosphere is great and margaritas are up to par but the food is extremely salty. I even tried my sister's dish and still so salty!  My tongue felt like I had a bad cut on it after eating then sipping on my margarita.  I will give it another try, though!", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "Mixed feelings. The food is excellent. The wait times and service could be a little slow. Have gone a few times for happy hour. They could definitely use more bartenders as they often ignore you and take forever to get a refill. Stick to the beer. The mixed drinks are seriously watered down, not worth the money. Has potential if improves.", "author": "B K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "I really like this place for a nice tall strong frozen margarita and some enchilada. Food was plentiful and delicious. Cool vibe, nice for afterwork or mid day on a weekend.", "author": "Mimi V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Loved this Mexican spot!! Delicious food, great drinks (strong for your money) great atmosphere and pleasant staff. I gave 4 stars because the one downside is a serious hazard, They have some slippery ass steps, they are painted and have no traction to prevent slipping, especially when intoxicated. PLEASE WORK ON REPAIRING THIS PROBLEM ROCCOS! My friend and I watched a woman slip down the steps prior to our leaving and then I slipped down the steps myself, should've reported it to management and plan to ASAP", "author": "Coco B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Food was good. Waitress was awesome, and the decor was lovely. Loved the day of the dead theme.", "author": "Kendra S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-02", "description": "Not sure why this place is packed? Is it for the cheap food or the happy hour? Because the food was not good at all. I went with a party of 7 and we ordered the sangria, which was bland. We got the guacamole which took at least 30 mins after the chips were placed on the table for the guy to finally come over and start making it. Which he should have never came because this guacamole was the worst I've ever had in my life. I didn't even taste the avocado how does that make sense? Then for our apps we ordered a variety: the queso fundido, empanadas, quesadillas, flautas and the shrimp in tequila and I have to say I liked not ONE thing. None of it. The best one was the flautas and I give them a 3 out of 10. Wow was I disappointed. I came with a huge appetite and lost it all after trying it all. I already knew I wouldn't like the entree at the rate I was going but I gave them the benefit of the doubt and have the enchiladas Rojas a try. And yep, as I figured, I didn't like them at all. I left basically the whole dish. I think the best part was the dessert which we bought ourselves at a bakery near home. It wasn't just the food and drinks, but the service was bad as well. My friend had to ask 3 times for a fork, they gave us a dirty glass and were just very unorganized. This place must either have pure luck or the people going there don't know real, delicious Mexican food, no not even that, they must not know good food in general. I don't know if it's because I love Mexican, am half Latina and know real, authentic, GOOD Spanish food, but this place was bad for me. Most of my party seemed to like it but I couldn't eat it. I'm usually not picky and Am not hard to please, but this was honestly the worst Mexican food I have ever had. Sorry Rocco's tacos, I don't know if it was just a bad night or what but I will most definitely not be returning again.", "author": "Jovanna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-05", "description": "We arrived at 8 o'clock and was told that we would wait 30 minutes for a table. As an hour passed with no table we watched one girl assisted by friend's stumbling out the door and another who was having a difficult time keeping her eyes open sprawled across a chair in the lobby. We decided to leave to leave without being seated. One star is a generous rating.", "author": "Larry S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-09", "description": "Thursday about 4:30p.m. restaurant was fairly empty.\nWaiter was really DITZY and forgot most of the order and we kept having to remind him of stuff.\nGuacamole with shrimp was made tableside but very bland in flavor and we never got the shrimp with it.\nThe lady wanted lemonade but, DITZY waiter gave a long story about why they didn't have any???\nI ordered a hot tea with lemon.. DITZY waiter brings hot water and teabags...\nThe lady ordered The Pollo al Carbon and it came out warm...we were sittng a few feet from the kitchen.\nI ordered the California Tacos which had no flavor or presentation looks like someone just threw stuff on a plate and sent it out COLD...yes even the rice and black beans were cold.\nOur DITZY waiter disappeared after he took order so we had to flag down anyone we could to get more hot water and anything else we needed.\nDitzy waiter reappears just to drop off check and then rushes us to pay...REALLY\nEVERYTHING WAS DISAPPOINTING AND THE DITZY WAITER DID NOT MAKE IT ANY BETTER OR WORTH CONSIDERING RETURNING.\nNO STARS IF I COULD HAVE....\nTACO BELL WOULD HAVE BEEN A 100 TIMES BETTER.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "Bad management. Fajitas were horrible. The tortilla were dry - more then a day old. On the day we went for dining this place showed open until 12am on their website. When we got there at 9:40pm, the employees were having party starting at 10pm. So they did not serve after 10pm. We had to rush and order all food and drinks right of way. Was not pleasant experience.  The manager was not willing to help at all.  Would not recommend this place.", "author": "Minesh D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-17", "description": "Overly sweet, bad food; weak margaritas, deafening music. I suppose if you love tequila and are pre-loading before a night out at clubs or something, it might be ok. But it's not good for the food. I did not have the signature guacamole, I had tacos, rice, and a salad. All very weak.", "author": "Nyuta N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-11", "description": "the food was okay. they need some good bartenders that know how to make drinks. the drinks sucked. we ordered our first pitcher which was a strawberry margarita. it was terrible. then we decided to order drinks. i had a mojito. it was nasty. my sister ordered a long island ice tea, and that was nasty. nice place just need better bartenders.", "author": "Judy V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "As a frequent visitor of the Dr. Phillips location, I was so excited to visit the newest location up north near my home (Jersey)! My friends and I went for late night, excited for some delicious drinks. I ordered the sangria-red. It tasted like sour lemonade. Nothing like I'm used to in Orlando. I don't like to complain, but when you pay around $10 for a drink-it should be 'drink-able'. So, I did ask for a new drink after explaining what was wrong. Naturally, the bartender wasn't too happy with me, but did agree she thought the Merlot might not be good (Why serve it to begin with, then?)-and did offer to exchange my drink for what I generally feel is a safe option- a dos equis, which I love. As the bartender walked away, another patron told me I shouldn't have ordered that- he was wincing through his. Just my luck that night, of course the beer was turned- it tasted rotten. I alerted the bartender, just so they didn't continue to serve it- she thought I was putting her on, and though I didn't expect a refund, it would've been a nice gesture. Disappointing. I've never had such a bad experience at a bar, let alone somewhere that I love. I'll continue visiting the Orlando location. My friends had similar experiences, but Im sure will be back to at least try the food-which I always rave about! Hope it gets better, Rocco's Brooklyn.", "author": "Allison G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-12", "description": "Came here on a rainy/snowy Saturday evening about a month ago. The restaurant has a rustic look and is quite spacious. The staff was friendly. The guacamole and chips were delicious. The chips had a peppery taste. We ordered a pitcher of the Rocco Rita. I want to suggest less ice to maintain the integrity of the drink. We also ordered the Brooklyn: 3 flour tortillas with varieties of cooked pork. The tortillas were not fresh however the bacon was oh so delicious! Will possibly return for drinks and apps.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "I went on New Year evening, it was empty in the front but we were placed all the way in the back. Our server seemed as if he did not want to be working. We ordered guacamole which we did not even get to taste. My friend ordered two soft tacos she got two hard tacos. We ordered strawberry margarita but it seemed like the bartender forgot to add liquor we raised our hands trying to get someone's attention for over 10 minutes. Finally my friend went and got the waiter and I explained to him that the drink did not taste like it had liquor so he said \"ok so\". He took the drink, and I asked the lady who was making the guacamole to get a manager. He came back with no manager and suggested we get individual drinks so that we can taste the liquor. I told him I wanted a manager and he began to apologize and say he will take everything off the bill. We headed to the front and the person who was standing in the front was down the stairs on her phone when I finally got her attention I told her I needed a manager. melissa came and said that should have never happened and that if we ever decide to come back she works every day. I was beyond disappointed.", "author": "Trina N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "may want to consider hiring some staff. Waited 30 minutes to get seated and no waiter came after sitting for 20 minutes", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Good food. Good vibe. Amazing guacamole. Great service. Great drinks and they're well priced. I'll come back regularly. I want to give the all you can eat taco Tuesday a try.", "author": "Marc G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}