{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "This is my 3rd time at Roccos Tacos and I never came back for a bartender but after tonight the only reason I will ever come back is for the best bartender Michael (Babbs). It was his first day and he was so professional it seemed like he was the veteran on staff. His prompt service and attention to my group was the only my reason we stayed for 4hrs making jokes and enjoying ourselves. I will recommend this place to my friends because of him. Thank you Babbs and Rocco's Tacos for making this Wednesday night a memorable night for me and my coworkers! I will be back again soon!!!", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "Couldnt go wrong with the patron margarita i ordered. I feel like the food is overpriced and you can get same quality elsewhere. Lets not get to the staff those hostesses in the front were very rude and took a long time to \"try\" to get us a table , we ended up sitting in the bar", "author": "Melissa E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Angel was on point from the moment we walked in. I really enjoyed his service to our table and great personality. Great food in combination with his amazing service will have me coming back for more! #tacotuesday", "author": "Gerda G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-28", "description": "Meh...I've had a lot better.  I now live in Texas so I've had plenty of tacos and tequilas.  For 40 freaking bucks, I got 3 small soggy ass tacos (w/ no flavors) and a margarita!!  For a $13 margarita, I expected a lot more than a top shelf tequila, sour mix, grand mariner and some ice cubes.  WTF!!!  If it tasted good, that would've been one thing...but I could piss in a can, pour some tequila and that would be a lot better than what the bartender mixed for me.\n\nYou can go to taco cabana (its only in the south) and pay $15 and get better food than these imposters.  Just because you order a lot of tequila doesn't make you a Mexican restaurant.  You can fool the tourists, but not a Texan!", "author": "A D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "If your a guacamole lover, this is the best spot to go to! They make the guacamole right in front of you with all fresh ingredients and the setting and the vibes from the resturant are so friendly, fun and amazing! There food is great!", "author": "Jas R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "This place fucking sucks!!!!! The food is nasty and the service is worse. Way overpriced too. I was totally excited about this place and it straight up ruined my day. Never coming back.", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "If you're looking for authentic Mexican food THIS IS NOT THE PLACE. Everything taste pretty average. The ambience is pretty cool \u0026 the staff are really friendly \u0026 attentive which is why I rated this place 2 stars. Otherwise, I would suggest finding another place if you're looking for good Mexican food.", "author": "Ruthy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "I was a bit disappointed and maybe it's my fault because I had high expectations. I love Mexican food and the restaurant was quite full so I figured that would translate to great food. I ordered 3 tacos and they were lackluster and lacked seasonings. Maybe it was off night but everything felt \"meh\"", "author": "Topaz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Nothing better than excellent service and David was amazing...he was friendly, knowledgable and an  overall good guy. \n\nThe food was great...everyone at the table got so n e thing else and it was cooked perfectly.\n\nWe had the table side guacamole and it was expertly prepared, served with style and tasted incredible.\n\nI would definitely come back to Brooklyn for Rocco's Tacos again.", "author": "James M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Everything we ordered was delicious. The roast port tacos had so much flavor, I wanted more. There was a wait for the guac but our waitress was super sweet and attentive. Can't wait to go back", "author": "Melissa v."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "I would love to give this place a good review, however since it's a restaurant it should be rated based on the food\n\nThere is a great party mood in the restaurant and they make o.k. Margaritas. \n\nUnfortunately, the food is horrendous. It's sad that they couldn't have hired someone that knows about Mexican food to be the chef.  So tired of Americanized Mexican food. Brooklyn deserves better.", "author": "L M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "Ok so I sent to this place on taco Tuesday's it was a bittersweet experience the tacos weren't mouth watering but for some reason I couldn't stop ordering them it's unlimited tacos for $20 ( I believe ) your first serving is 4 then you get it in sets of 3s  . Then there's the margarita mug for $25 ( I believe ) soooo not worth it super tasty but filled wit ice was only able to make 4 glasses out of a mug that was ridiculous to me . As for my waiter I could tell he was over his shift but did his best to please us and keep us happy .", "author": "Ladella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Such a great restaurant. First the atmosphere of the place is amazing, soft light and full of fun. Our service was over the moon I wish I remembered his name. We came in a couple days before New Years around 10pm.\n\n We ordered a pitcher of margarita and burritos, all so delicious full of flavor and we only waited 20 minutes. We told our server we were celebrating a birthday and after dinner he surprised us with free tequila shots which was nice that it wasn't just for the birthday girl.  We wish we tried the guacamole because they make it right in front of you. Overall the best experience we had on our trip to Brooklyn and I recommend it to everyone.", "author": "Sarina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "This place is just ok. I wanted to like it because I LOVE Mexican food, but unfortunately the bad outweighs the good. However most of my dislikes were situational so I might have a better experience next time... if I go back.\n\nThe good:\n-The atmosphere and decor are lively and fun especially upstairs. It's an expansive restaurant with two floors. Good for groups.\n-Gauc made table side. \n-Large menu \n-Yummy tacos that can be ordered individually \n\nThe not so good:\n-Reminds me a bit of a suburban chain restaurant \n-They sat four of us downstairs in a fairly empty room at a GIANT round table made for 6-8 people... so we were a mile away from each other trying to have a conversation. Not sure why as there were plenty of normal sized tables open.\n-Our waiter, despite only having one or two other tables was totally MIA after taking our order. Of course he reappeared and was very attentive when it was time for the check...\n-Our meals took a long time, then came out one by one, and one of our sides was missing till we were nearly finished.\n-pricey margaritas that could not have had much alcohol. I drank two and didn't feel a thing which is not typical at all. They just tasted watered down and blah.\n\nI feel like with a different waiter and if we were seated at an appropriate table size upstairs by the action, our experience would have been better.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-08", "description": "The food was good, but the wait to get our guac was forever. We came in around \"happy hour time.\" I think they were short-staffed that day and my friend and I literally had to wait 30 minutes. Things happen. Other than that, the decor is really fab. They also catered to my friends needs and made her a skinny margarita (even though it wasn't on the menu). I love when businesses go out of the way to please customers  The decor is really cute and it's a nice spot to go grab some food.", "author": "Fashion Poet P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Came here during lunch to kill time while serving Jury Duty. I ordered a margarita and the Mexican Cobb Salad. Margarita was good but salad was eh. Salad ingredients were a little soggy vs. crisp/crunchy which made it not feel fresh. Overall not a bad experience though.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Angel was our server and he was very prompt and available with the service. Our mimosas were always topped so that was great, the tacos were a bit dry but I had the corn soft shell. Overall service was great and also the mimosa were a little strong so that was a plus", "author": "Adanta G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Great place with excellent service...Drinks and the food are amazing.\nCome anytime lunch,after work or Dinner.I really enjoyed myself.", "author": "Audrey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Devon was awesome!  Great margaritas, great fun!  He was prompt, creative and awesome!!!  This place has great chips, salsa, and guacamole but add Devon and drinks, it's the sh*t!!!", "author": "Blake K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Alonzo was superb great waiter; we had the pleasure to meet the restaurant manager very attentive", "author": "Delfin A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}