{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "Pretty good food. Great tequila selections at a great price. Had a shot of Don Julio 1942 for $29.00, f**king amazaing!", "author": "Robert G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "I love this place. Every time I come I usually sit at the bar, but I decided to sit at a table. My server was nice she made sure she checked to see if I had an allergy which I do, and the manager brought my food out. When I get home I find out that she took out more tip from my card than I left her. Glad I kept my copy of the receipt. This has made me not wanna come here anymore.", "author": "Elisa Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Love this place and been recommended it to everyone since I went. Had a whole nacho and enchildas mole poblano. It was delicious and could feed a small army.", "author": "Johnny G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "My friend ordered the \"Baja\" and the menu states the quesadilla is supposed to come with spinach and goat cheese. However, being so hungry and eating the quesadilla, we had forgotten, but realized that the quesadilla didn't have any goat cheese or spinach. We informed the waitress (who was great) and she went to inform the chef who then informed the manager. First off, the bald manager came up to our table with a rude attitude saying, \"you got a problem with our food?\". We explained it wasn't goat cheese and spinach and he lied to our face saying, \"the goat cheese is mixed with the mozzarella for consistency.\" As we explained that we expected goat cheese and spinach as the menu says, he says it's \"corporates fault for not changing the menu and we've been getting complaints from customers all the time\" and also \"well you ate most of the food anyway\"- which we DIDN'T. Perhaps instead of blaming corporate or the customers, be a manager and gather your employees to inform them of a menu change as well as the customers before ordering. In reference to the food, it was dry, reheated (not fresh) and slathered in awful sauce. I'd give Rocco's zero stars for the bald manager and food, but the waitress was great. Not worth spending a lot of money on microwaved, stale food.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "My favorite Mexican restaurant! Jenn the bartender is absolutely lovely (both to look at and in service). Cocktails are delicious and are a good size. The food is fantastic and the portions are huge. Happy hour deals are awesome. It's right next to the Marriot so it's location is ideal. Must stop by if in the downtown Brooklyn area!", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "If you want good food, good service, have a good conversation... don't come here. \nEvery single time I came here I got big time attitude from the 'greeter' (and calling them 'greeter' is an outrageous euphemism... it's more like: I'm fabulous, don't bother me...). The food is mediocre and overpriced, drinks are ok and overpriced. You want to have a conversation? Wrong place. Come here if you want to listen to loud R\u0026B, not for a dinner convo. \nMany great options in the neighborhood, this isn't one of them.", "author": "Karsten S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "Allow me to give you a quick and brief history on how I came to be at Rocco's Tacos and Tequila Bar. A few months ago, I went on a google search to find a new taco spot and I came across Rocco's. Unfortunately at the time, Rocco's had not yet descended upon downtown Brooklyn. So to my delight, just recently, I was on Facebook and a friend checked in. At that point, it was only a matter of time before I would partake.  That time was tonight. \n\nI'm a big lover of tacos and all things Mexican. I have been to a few places in my neighborhood that serve tacos and the usual Mexican fare. To be frank, every once and awhile, you crave the same foods but prepared in a different way or perhaps, you just want to enjoy the traditional Mexican cuisine in a new and festive atmosphere. Rocco's Tacos and tequila bar delivers this and so much more, on two levels no less. If your planning a party or private event, this is the place to be: especially since it's also so close to transportation. \n\nRocco's is authentically appointed with various traditional Mexican artifacts and art. It probably has the most extensive tequila collection in Brooklyn if not the five boroughs. The menus is very extensive and filled with both traditional and  nuanced Mexican dishes. The food was fresh, hot and delicious, end of story!!  \n\nIf you are so luck, try to get Sean R. as your waiter and if the managers are floating around, say hello to Melissa and Nick. It's especially nice that I was also able to thank the owner himself for pouring his heart and soul into his establishment; it shows! My next trip will be for Taco Tuesday's which is sure to be off the chain!!", "author": "Percy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Had their tableside guac w chips and enchiladas. Tasted fine. Then for whatever reason, I got food poisoning afterwards. Spent the rest of the day vomiting and gaging. Not cool.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Had dinner here during our quick weekend trip to BK. The decor and atmosphere of the restaurant is nice. The guac is freshly made in front of you and is delicious! Unfortunately, I was not pleased with the entrees I had a chicken dish of some sort- can't remember the name, but I didn't finish it (I was starving) and didn't really care to get a box to go. My husband had the shrimp and fish and said that it was just \"okay\". Would only recommend for happy hour, but not dinner. Oh, and the guac!", "author": "Fern S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-15", "description": "I've been here a couple of times with friends and coworkers. The guacamole here is really good and that's about it. I really don't think people come here for the food, but they are an ok option for small plates. You're not going to find authentic Mexican food here, but you will find decent tacos and such that are more Americanized in their flavors. Most of the time it's really about the drinks and the margaritas here are strong! The space is big with more seating and a bar downstairs. Service is alright, waiters aren't as attentive, but the bartenders are usually friendly. Rocco's isn't a must try, but if you're in the area looking for a drink or something small to eat, this place is a good option.", "author": "Geekar L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "\"Give me tacos or give me death\"\n\nI have waited for this place to open for the longest, because I teach around the block and sometimes you need a drink or five after teaching the youth. I had only pleasant experiences the two times that I have been here for margaritas and tacos. I've dined here only on Sundays around 3pm, so the place was not too crowded because the brunch crowd is gone.\n\nThere are many margaritas and other types of latin drinks and they are made pretty strong. The tacos are pretty tasty, especially the \"gourmet ones\" the Korean, the Brooklyn, and I forget the name of the other one (3 tacos for about 14-18 bucks, if the tequila did not cloud my memory). Unfortunately, you cannot mix and match the special tacos :(. I kind of wish that the Rocco's would have a taco sampler so you can try all three of the special tacos. But, if you have to choose one, I would go with the Brooklyn, which has splendid mixture of pulled pork, smoked bacon, chorizo, pork belly). I hear that the Brooklyn is a favorite of the staff. The chips and salsa portion is huge for 4 bucks. Plus, the chips are dusted with some sort of pepper mixture that makes them out of this world amazing. \n\nOverall, the ambiance of the two floor restaurant is drunkastically wonderful. There are so many things going on with the decor that your eyes my bug out by looking in multiple directions at once. Hey, they even have TVs on the walls of the urinals, so you can catch up on your Speedy Gonzales Looney Tunes. The staff was wonderful with drink and food suggestions. \n\nMan, after writing this review, I kind of want to go back to the restaurant and get dinner.  If you are in the neighborhood or even touring the booklyn bridge, skip Grimaldis and check this place out.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "Meh at best. You get a big portion because it's a chain. However you might not want it. \n\nCobb salad was made with Old brown lettuce. No charred corn; it came\nFrom a can. One small piece of\nGrilled chicken on a mound of old\nSalad. Skip this\n\nOrdered the Pork tamale combo. Not\nReally a tamale since the meat was outside the corn meal. \n\nI accepted the up charge to switch shrimp taco for ground beef but then they didn't give me the skirt steak taco. It came later-cold. \n\nNo wonder you get a tequila if you check in. It softens you up. Come  for the drinks. Eat first", "author": "Dina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Awesome food great service ok drinks and a nice restaurant to just come and take a load off after work with coworkers and friends....also great with the family... I come here once a week thanks to the service and great food. I recommend this place to anyone who loves Tequila bars", "author": "Nay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "We had such a nice evening here. Kavita was the absolute best!!! If you are here ask for her she is pleasant, nice smile and sweet.", "author": "Rah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Amazing Tacos!!! You won't be disappointed. These are the best tacos. I have had in a long time.", "author": "Luis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Their Guacamole is the business!!! The chips that came with the guac is a whole other love affair.  On my first trip to this place I was able to easily get a 8 oclock reservation for my crew of 8 and was greeted warmly by the hostess. I arrived quite early so I took a seat at the bar, unfortunately my friend introduced me to some fancy sounding margarita and the rest of the night was a blur. I know I happily chomped on the chips and my order of surf and turf.  This place is a bit pricey but we did have a great time. I def will come again!", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "I read the reviews and Candice was beautiful . I explained what I wanted for our party and she made it happen and cost effective . Thanks a million pictures to follow", "author": "Tina B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-28", "description": "Today I went to eat at the bar. Ordered a salad and glass of water.  And I was required to hand over my credit card at time of order.  I questioned that as an odd policy (as I had been there before) and was told it was standard.  \n\nAs I waited for my food, I witnessed 4 other individuals sit at the bar and also order food and drinks, however they were not required to hand over a card.  I proceeded to watch them finish their meals and have their checks processed in the classic fashion.  When I asked, both the bartender and hostess got super defensive and held firm that it's their policy. \n\nWhich I'll get over as the food is mediocre.  The ingredients showcased on menu do not necessarily show up on the plate.  Last time it was the kimchi and peanut sauce missing from Korean tacos.  Today it was raisins on a spinach salad that weren't supposed to be there.  Prices are also high for what's offers.", "author": "Phillip B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Thank you for a wonderful time \u0026 accommodating on short notice. I love Rocco Taco, exemplary service from all of the staff, thank you John for taking care of my party of 12 on 7/27/18. It was son's 16th bday \u0026 John was excellent as was the manager for the night. Didn't get her name but you handled my cake when it shifted. The front staff was great as well, food, ambiance \u0026 service. Look forward to dining again \u0026 sending others your way. Keep up the good work.", "author": "India B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "Don't get me wrong, their tacos are solid but not enough flavor for this LA gal. Perhaps, we are spoiled when it comes to Mexican food. It wasn't that the food was awful... To be frank, the food just wasn't memorable.\n\nAlthough the restaurant was somewhat packed, we were seated promptly and our waiter was efficient and friendly. I may go back if I am back in Brooklyn to give it another try.", "author": "Jessica T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}