{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "The place was awesome! Our server/dancer was Albert who not only was attentive, but had some good dance moves too! Rhonaldo made the guacamole that was ALL THAT! He's from Jamaica!! Oh and the margarita was made by the man himself, Kavon!! These guys took great care of us! The atmosphere was epic and the food was fresh! YES... We'll be back!!", "author": "Stacey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "My first and definitely not my last time at Rocco's Tacos. Came in here for the tacos and margaritas. AMAZINGGGG. At first I thought this was going to be a horrible experience due to one of the greeters who said her name was Keisha, was extremely rude and horrible at managing time to find me and my guest a seat. But thanks to another host Mary who was super nice and welcoming not to mention  extremely professional. She saved the day and attended me and my guess. Her energy made our over all experience amazing. I wanted to give this place 4 stars due to the first greeter but she put a smile on our face when we entered and left. Not to mention the food and drinks here are amazinggggg. Oh wait already said that :)... I'll definitely be back.", "author": "Ashley O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "I came here the day before Cinco de Mayo for tacos and margaritas.  I ordered 2 steak and 1 chicken taco. It tasted great and it was juicy. I came with my sisters so we ordered a pitcher of Mango Margarita, it tasted good but not enough alcohol it tasted like juice we probably would've needed 3 more jugs to feel anything. That's the only reason I give this place a 3. I will come back and try the margaritas again hopefully it's a little bit stronger", "author": "Shenna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "Great mexican place with great ambience. I loved the way how spacious the restaurant is! We were in a large group of 15-16 people so we were allocated the private dinning area. \nMust try- guacamole(You can thank me later :p) \nThe rest food was good.", "author": "Lajja M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "Came here with friends for all you can eat $20 taco Tuesday's for dinner. Best to make reservations and make sure most of your party arrives in order to get seated. It does get busy on Tuesday's for this frat deal. Appetizers- had the Rocco's chips and fresh guacamole which they make in front of you - choose how spicy you want it. The chips had a kick to it - a secrets Rocco's spice per the server.\n\nTried the shrimp and steak tacos with soft flour tacos. Tacos were a bit spicy but preferred the steak tacos more. They start you off with 4 tacos, then 3, etc.  how much can one eat? Gotta try and find out. Given it was busy a couple of orders were missed - 1 person never got their order of tacos til we asked and our server was helping Other tables. Other additional tacos didn't show up but we canceled after waiting as folks got full. \n\nThey also have fish and pork too...\nPlenty of other items on the menu if you don't want tacos. Margarita and drink specials too.\n\nWill have to come back and try other items on the menu.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-08", "description": "There's a mixes review. The food was excellent. I had the skirt steak with yucca fries. The chimichurri was perfect\n\nHowever, the bartending service was abysmal. They're only about 15 people at the bar and two bartenders. One was in the service well making server tickets. The girl working the floor was slower than molasses. A good bartender could run circles around her. It's took me about 15 minutes to be greeted, but she would not take my drink order. Finally the Barback after seeing I had waited ask me what I wanted and asked her if he could get me a corona.  He did and said that she would take care of my order.  About 20 minutes after I sat at the bar, she finally came to take my order and I swiftly asked to be closed out.  I watched several  people leave out a frustration because they were not being served promptly \n\nAgain, it was not busy on a Monday night. There were a lot of empty barstools.   There is  simply no excuse for being that slow and bad at your job.  Do better", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-12", "description": "I wasn't impressed with this place. The drinks were very sweet. I had a Paloma and sent it back. Then had a strawberry margarita and didn't like it either. It tasted like they had dumped a whole bottle of strawberry syrup in it. The bar tender was ok. But was hard to get his attention most of the time and that shouldn't been the case since it wasn't really busy. I gave up after the margarita and just paid and left. Happy hour tacos were cold.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-24", "description": "Pros: Great nachos, some good deals (AYCE Taco Tuesday, 13 buck bottomless -all OJ though, so drink them quickly for a buzz). Decor and party rooms are very pretty and well thought out.\n\nCons: Horrendous management (saw him laugh at a customer who's food was prematurely taken away when she went to the restroom, ignored other customers, rudely was in the way in general, waste of air). Too much OJ. Have to pay for chips.", "author": "Alyssa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "This is a special, sophisticated Mexican Cuisine establishment. The food is well prepared, Terry will make fresh guacamole at your table as an art form, and Nathan will be your most attentive and entertaining server.\nGo there now!", "author": "Tom B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-18", "description": "This place had a lot of potential- great decor and music, prime location. But the service was awful. The hostess seemed annoyed when we walked in and said it would be a wait even though we saw tons of empty tables. We cycled through several different servers that lost our order and only brought water after repeated requests. The chef messed up the order but by then we didn't even care.\n\nThe margarita was horribly sour. The nachos were good- the place has potential, but please, figure out a service strategy and get rid of the duds that are driving customers away!", "author": "Alyssa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "Rocco's tacos did not meet my expectations. I've been to the one in Orlando a couple years ago for cinco de mayo and it was a poppin' night. However, I came to have a quick lunch with my bf at their BK location and I was not a fan of their food. It lacked flavor. It was such a disappointment to me. They got pretty good deals though. I believe it's all you can eat tacos for $20. I did. Skip the drinks and stood with a glass of water. The decor is cool. Nothing special though", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-12", "description": "Waiter had just started so have to give him a break for reading the specials directly off of the newly printed sheet and for not knowing much about the menu. That falls on the management to ensure they are training staff properly and letting them try the food so they can give opinions and good feedback on the food to customers inquiring.\n\nThis is the second time I have been to this location as it is directly next to the hotel we are in again. I would not suggest it to anyone based on the entrees personally. The table side guacamole and the decorations/atmosphere are about the only consistently redeemable qualities about this location.", "author": "Allison E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "3 stars is generous considering... Just meh. I wouldn't eat here again. The atmosphere is kind of like an Applebee's. You can tell they cater to tourists who stay in the area. I sat for a bit before a waiter finally came by to pour water and take my drink order. This was even more annoying, since the person who sat down directly in front of me ten minutes after I had, got service before me. \n\nI ordered a margarita ($10.50) and decided to go with three tacos, though they were $4.50 a pop. I figured they would be a good size for the price. When my margarita finally came out it was super watered down. I was hoping my tacos would exceed this but I was pretty shocked when they arrived as MINI tacos. Are you kidding me? At least put that on the menu. They might as well have been taco bites. \n\nThese suckers were tiny and didn't even have a double corn taco shell. Eating them was living nightmare because they were overstuffed and so thin that they broke apart. It was like a food explosion every time I took a bite. But not in the good way. Thank god I wasn't on a date. \n\nI ended up finishing most of my taco contents with a fork because ummm at $4.50 each i'm not about to let anything go to waste.....\n\nSkip this place for sure and get some real Mexican food.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "My friend and I came here for lunch after a morning workshop at the hotel nearby. It was are really cute, casual spot with funky cool accents, such as tons of awesome star shaped lights, swirly blue and white lights and a deep blue with black wire light fixture. The ceilings were metallic, there was plenty of natural bright lighting from the windows and the space was large with wooden floors, paneling and chairs. \n\nWe were seated towards the back on a high square wooden table with tall seats. After being seated, we were immediately served a tall glass bottle of cold water, which was very refreshing. The base of the table wasn't that sturdy and when I applied pressure on it to get up on the seat, it almost fell over. While we were eating, it seemed to be fine though. \n\nWhile perusing the menu, I was debating whether to order a taco platter special or the fish filet sandwich. I found out that the type of fish being used was mahi mahi, which I enjoy and don't get to eat that often. I asked the waitress for her opinion on the fish sandwich but she didn't like seafood so I tried asking someone else who worked there, who said it was good so I decided to try it. \n\nThe sandwich was served open faced on a toasted bun. One side had two perfectly grilled chunky pieces of mahi mahi with avocado ranch dressing. The other side had fresh lettuce, tomato, red onion and there were skinny french fries on the rest of the plate. The mahi mahi was wonderfully tender and seasoned. It tasted really great with the zesty and unique avocado ranch. I am actually not a fan of avocado, but this sauce was awesome - So creamy, flavorful and also went well with the extremely crispy and delightful fries. \n\nMy friend seemed to enjoy her pork tacos, which came with Mexican rice. Her only complaint was that she would have liked to have more filling in the soft shell tortillas. \n\nOur waitress was lovely and she made sure we had everything we needed. I probably won't be back any time soon since I am rarely in Brooklyn, but there are definitely other items on the menu that I would try!", "author": "Kathy X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "have been to the original fort lauderdale (las olas! hayyy!!) many times. for years. had been wanting to check this place out in NYC for a whileee. finally had an opportunity. BEAUTIFUL SPACE, for no reason. gorgeous lighting. old wood. too bad.\n\nthe problem here? the service. young. slow. they talk in the corner amongst themselves. and just not good over all.\nthe food wasnt great, but a good service experience could have saved the day.\n\nall i have to say is that i ordered chips so it would be fast, we were so hungry. entrees came before the chips. ate the mediocre tacos, fine. said i wanted chips off bill bc i didnt need them any more. chips magically come 20 mins later. i tell bartender to just leave them, whatever. HE RIPS THEM AWAY TO THROW IN GARBAGE. an entire plate of chips, looked like pico and some salsa. said they were already off the bill.\n\nI DO NOT CARE ABOUT THE MONEY, i have enough if it. I DO NOT CARE ABOUT YOUR PETTINESS, bc i will write this review. they literally placed food in front of us and threw it in the garbage to prove a point. if the management cant see their problem here, message me and I CAN. wont be returning.", "author": "Carolina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "Terrible service. Not enough staff (waiters or bartenders). Food is adequate from a previous time I ate here. Candles are fake. Tables not level. My Puerto Rican friend has never has never heard of the word \"abarrotes\". Was seated at a table for 20 minutes before we walked out. Our server Mario was awful. \n\nUpdate: Raising this review to two stars. Katia stepped up and served us despite the fact we weren't in her table jurisdiction. She was an amazing waitress-both professional and competent. This restaurant would be better off if they could figure out how to clone her.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "I give this place 4 stars because the vibe here is always so lively! It's meticulously decorated, there are so many things to see! The aesthetic here is trendy and their music is too!\n\nOther than that, I would've given this place 3 stars. Unfortunately, I don't love their tacos. I wish they had an option to order traditional Mexican tacos. I also don't love the seasoning they put on their nachos, they're like Foritos, fake Doritos. I wish they offered me the option of traditional nachos for their guac. It would have been great if a server asked us ahead of time. But! This place makes up for it with they way they present their guacamole! They bring a tray to your table with all of the ingredients and make it in front of you.\n\nTheir piña coladas are great. I wish they were a bit stronger because I don't remember tasting any liquor in mine at all.\n\nThis place could be a SUPER 5 star restaurant if they provided the traditional foods in addition to their current menu.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Decided to give this place another try since our visit last time was okay. The service was really good, a great improvement from our last visit. However the food is not so good, neither are the prices. I was surprised to find that there was no meal that paired steak with rice and beans so I settled for steak with avocado fries. It was about $25. The fries were so dark and tasted like oil and almost bad avocados. The steak was delicious. However it did not pair well together at all. I ended up taking piece of my steak home and leaving the left over fries. I lost my appetite after those avocado fries.\n\n My husband ordered the pulled pork burrito. His meal was much cheaper and tasted phenomenal! He was pleased so I'm sure he will want to return.", "author": "Candice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "First time here nice place an hour wait for a table,we went to the bar for drinks my first drink was casamigos lemonade it was good and my friend had a strawberry daiquiri she said it was good.,my second drink was the red wine sangria with grand marnier it was good,we got a table over on the side of the bar in a small booth I thought was cute for the two of us,our waiter was David table 45/1 he took our orders after we got the order he asked was we alright and that was the last time he asked us anything he was running back and forth to a table on the other side with a group of about maybe eight and another table with a  group of girls I thought he might have had an interest in one of them because he was bringing out cake and all kinds of snacks for them at one time he looked over at us but never said anything he kept walking pass us not asking us if we needed anything,it was like we had a disease or something,but he was so attentive to these other two tables,I gave him a tip anyway even though he didn't deserve it,I saw that they had on the menu brisket tacos I couldn't wait to get them,they was horrible they had no flavor to them,they cost 19 dollars for three my friend had one and All I could eat was 1 and a half of that it was bad,had the Elotes corn it was good but wasn't as good as I thought it would be..the bartenders was nice and attentive..I would come here again and eat something else..I love the atmosphere but would never want David as my waiter again", "author": "Monique B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Great place to drink and have some great mexican food. Had Tacos and drinks all night the location is spacious and you can bring a large party to location. Guac and tacos were fresh as ever.  Waiter was nice as well. I would suggest going post work or anything after something you didn't want to do in the first place.", "author": "Julie J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}