{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Horrible Service the General Manager was rude beyond measures his name is Eddie. Food has no taste. I pass this place all the time I will never go back. I gave it one star just because the waitress was sweet and new so I can not blame her for working under someone so unprofessional. I would\nof probably got better service at taco bell. AGAIN I will never step foot back in this establishment.", "author": "Meryl P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I like this place . try the guacomole \n\nOH and the COBB salad", "author": "Seth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "OK atmosphere is amazing.   I admit I'm kind of biased.   Being from Texas I am used to good Mexican food at a reasonable price.   That being said, that's why I gave them four stars.   The atmosphere is amazing and the food is really good.    The prices are just a little too high for my taste for Mexican food, but it is New York so I'll cut them some slack.  Tacos are really good, and the chips and salsa make you wanna slap your mama.  .  Don't laugh because my god they are good.  Cool place for sure.  Especially on a Sunday walking around downtown Brooklyn.", "author": "D C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Love this place! Visit regularly as I live in the area. The chips and guacamole is to die for and is made at the table in front of you. The mojitos are my favorite in the area and there is so many flavors to choose from which are all great. The flautas are delicious and the taco salad is my fav go to meal! Service is quick and friendly and make you feel at home. Highly recommended for anyone looking tasty fresh food, delicious drinks, beautiful decor and a fun atmosphere!", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "My roommates and I are from Arizona and are always looking for a Mexican place to remind us of home. Rocco's tacos was a delicious upscale Mexican restaurant with great service. Our food was very delicious and we had a great deal with bottomless mimosas/bloody Mary's ($14 and the purchase of an entire, one of the cheapest I've seen in the city). A little confusing because on google and their website is says they open on 11am on Sunday and although we were there at that time they actually opened at 12pm on Sunday. But other than that it was a cute place with a fun atmosphere. They even make their signature guac table-side!", "author": "Leah O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "First time I ate here food was good. This time around, no Bueno! To make matters worse, had to take my food out because I didn't have time to finish. Got in the taxi and sauce everywhere!! \n\nWho packs a dish with sauce in a cardboard box and the tortillas in a plastic spill proof container?", "author": "Dana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Great homemade Mexican food feel. They make the guacamole right infront of you which is cool and you can put anything you want in it. Took a while to get served but may have been because of one server In high table section. I do believe the food is way over priced even for how good it is", "author": "Ric F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I visited Rocco's for a company event. The staff was amazing and beautiful .. the food was great and well seasoned, and the ambiance was comfortable and laid back. The area it was in (down town BK) is the perfect placement for this type of restaurant. The bathrooms were clean and... check this out... they got TV's over the urinals ... REALLY?!! that's dope \"AF\" they over pour their drinks which I'm into.. and they take pride in the fact that they don't go cheap on their drinks.. gotta love it when the bartenders want to make the customer happy.. I will be visiting again... and again... annnnnd again..", "author": "Progress R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Pretty good, no complaints on this end! Service was splendid and the food and drinks were good too!", "author": "Amber V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "The food is amazing.  Order the guacamole and it will start your night off right.  Portions are manageable and delicious.   Music fills the entire place as everyone enjoys themselves.", "author": "Ms. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Food, drinks, atmosphere was on POINT!!!! Ariel was friendly, attentive \u0026 made our trip to New York worth it. If you haven't been here make sure you stop By and make sure you ask for Ariel at the bar!!!", "author": "Luis N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "The food and drinks here are great! The service is good as well. Two stars is because of the experience I had with the hostess. When I arrived the hostess asked my friend and I multiple times how old we were... I guess we looked younger than 21? Understandable, laws are to be followed. However, if you're going to ask us multiple times and giggle with your co workers because you think we are lying, just ask for ID and maybe we can giggle together! When we were walking to be seated, I heard her shout \"Don't forget to tip your server.\" \n\nUh ok? Thanks for ruining my experience here.", "author": "Brooke D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I LOVE this spot. I've been here already three times with family and would definitely come back. The food and drinks are delicious and staff is awesome. We always are seated right away, the guacamole is made fresg in front of you and service is quick and attentive. The manager always stops by to make sure we are happy. My favorite drink is the pomegranate margarita.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Will most definitely not be coming back to this place. The service is absolute garbage, It's  appalling. When we got there we asked for a table for 2 and they told us it would be an hour wait. 3 more groups of 2 came and were seated right away. My boyfriend finally went up to the hostess clearly annoyed because they were scheming so much on who they were choosing to seat. \n\nAfter finally being seated the \"Cadillac margarita\" was \"highly recommended\" by our waiter. So we got a pitcher. It was DISGUSTING and resembled nothing of a margarita. My boyfriend couldn't even finish his first glass. It was so sweet and gave us a hangover before even giving us a buzz. \n\nThe ONLY reason I'd give this place a start at all is because of the fresh guac. But guac is not enough to keep us coming back. The food is also bland, over priced and not good. I highly recommended avoiding this place. Unless u flirt with the hostess and her friend (not co worker, because it didn't seem like they were doing much work) who would then get you a seat as fast a possible. After this horrible experience boyfriend and I couldn't wait to just leave and go home. Such a waste of money and time.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-12", "description": "I live near by and have dined at this location many times, even hosting my birthday here a few years back. However, I will return no more. After a handful of bad experiences and giving them another chance all I can say about this place is the service is horrible, the food is mediocre at best, and it is hideously overpriced. Don't bother. Save your money. Go anywhere else to eat, just not here. To any Rocco's managers reading this: 1) schedule a 2nd bartender for shifts 2) train your staff on how to serve people promptly 3) ensure consistent good quality for your food.", "author": "Tara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "I'm updating my old 1 star review.\nLooks like all the staff was fired and this place got lots of new great employees. We decided to give this place another try and had a dinner today 4/22/18 and I'm shocked how many changes were made since my previous really bad experience there.\nEveryone was very nice and professional, our waitress Ashley is the sweetest person,hostess and manager were very friendly too. \nToday we definitely enjoyed our food and time there, and will be coming back again.", "author": "Darina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-10", "description": "Food was decent service sucks took a group there for dinner. Had to complain multiple times to order", "author": "Terry W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "I don't remember the last time I did this, but I waited so long here to (a) get seated, (b) get acknowledged and be able to place my order, and (c) for my food or even my drink to (not) arrive, that (d) after 45 minutes, I just stalked out of here without any receiving any service beyond placing my order about 20-25 min after arrival.  Whether the food ever arrived or the order just disappeared into the ether, I'll never know.  I do know that they left me with 15 minutes to scarf down a sandwich and coffee before I had to get back to my nearby jury duty, where I silently fumed and wished it was Rocco's that I could indict on all counts.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Rocco's Tacos was pretty good.  They make fresh guacamole at your table - which is DELICIOUS.  The restaurant's set up is nice, but nothing out of the ordinary.  The food is good, and they give large portions and that is always a good thing.  The drinks are pretty strong, so that'll always keep the customers coming back for more.  The service was efficient and never left me wondering or needing anything.  This is a good restaurant if you are looking for Hispanic styles food.", "author": "Bradley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Love this place! Bartender named D is just amazing!\nThey have good happy hour food menu. Drinks taste lovely. Come here often", "author": "Katarina T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}