{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "The food and drinks are on point,my 2nd time here I've  officially made this my go to spot ,the staff are pleasant the atmosphere  is cool cannot complain,and they have televisions  in each bathroom stall..", "author": "Sha B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "Best part about this place is its decor. Other than that its overpriced, mediocre food trying (and failing) to pose as Mexican. The rice had the texture and taste of the rice from a box and my chiles rellenos needed way more sauce. Bottom Line, if you want a nice ambiance come here, if you want decent, even semi-authentic Mexican food, you probably have to travel far outside of Brooklyn for it and definitely won't find it here.  \n\nE.g.\nFriend: \"Do you have aguas frescas?\"\nWaitress: \"I don't even know what that is.\" [Eye roll]. \nMe: \"Do you serve Micheladas?\"\nWaitress: \"I don't think so, I can check.\" \nMe: \"Nevermind...\"", "author": "Lupe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Great service. Didn't know what to order so they guided me in making the best order possible. I checked in with yelp and got a big tequila shot for free ! Went there with a group and had a great time. Would recommend it to everyone.", "author": "Yar R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "Service is poor. Manager Of business, HECTOR, is very rude especially to visitors to New York (or could be that we are black) which he made very clear. We love to travel  and eat. Our family saw that the restaurant's door was open but noticed employees cleaning up. We started off by asking what their business hours were since they were closed. The manager came from behind the bar as we were asking him a question while walking to the door to escort us out. We said we were just asking for hours because they aren't posted. He rudely responded \"Depends\" and pushes us out we asked Again his response was \"Different Times\" and we said he didn't have to be rude. He says \"This is the North have fun going back South\".", "author": "Asia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Work right by this place and love coming here. Drinks are good and the food. Manager Natifah was very accommodating and server Bridget. Usually come with a big party and service is good.", "author": "Gabriel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "During a recent trip to NYC, a friend suggested we visit Rocco's so we checked it out. We arrived around 4pm on a week night and had to wait nearly 20 minutes for a table. The wait area is extremely small which would be a problem if the restaurant is crowded. There was an area to the left of the entrance that was empty as was the entire basement so I'm not sure why we had to wait. There were at least three other parties waiting as well. \n\nThe restaurants decor is warm, inviting and theme appropriate. We were seated towards the back of the restaurant near a group of very loud NYers... that was annoying but we made the best of it. Those ladies were drinking it up and enjoying themselves immensely so I take it the cocktails were good. (I didn't drink)\n\ni ordered a couple of the carne asada (skirt steak) and carne molida (spicy ground beef) tacos with a side of the refried beans. The tacos were delicious especially the carne molida. The skirt steak was a little tougher than I would have preferred. The beans were good too but not the best I've ever eaten. In retrospect, I would have gone with the black beans. We also ordered the chips and salsa which were okay. I didn't care for the seasoning that was sprinkled on the chips so I didn't eat too many. I think the chips should come plain if so desired. The server should ask rather than assuming if you ask me.\n\nOur server was named Kyle if I remember correctly. He kinda reminded me of a young Ernie Reyes, Jr. (from TMNT, Surf Ninjas \u0026 SideKicks). Kyle was very nice but he wasn't very attentive. We had to work hard to flag him down to get refills and our check. \n\nEven still, I'd visit Rocco's again if I found myself in Brooklyn again. I'd recommend that everyone check  it out.", "author": "Sonya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-09", "description": "I live around the corner and have been to Rocco's a few times now. This is one of those places that the menu sounds awesome with unique takes on traditional dishes, but when I get the food it just doesn't meet expectations. It's still good, but not amazing. \n\nThat said, it's a huge place and has a fun vibe, so it can be a great place to grab drinks and hang out with friends!", "author": "Sheela M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "I came here with my bf on Tuesday ( taco Tuesday's). I made reservations 1 week in advance and was there early to be seated. Once we were seated our waitress came and took our order. She was knowledgable and told us the best options from the menu. We ordered the guac and chips for app and have to say that it was great! We ordered a pitcher of margarita for $15 it gave about 4.5 cups :) which is a great value. \n\n\nI have been to Roccos in Florida and fell in love with their tacos but I was disappointed with the location in BK. The taco flavored were good but they were COLD! I hate cold food I asked the waitress to take it back and she gladly did. They came back warmer but not what I thought. This is the only downfall ! I will come back just for the guac and pitchers.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-23", "description": "It gets two stars bc the waitress was nice. Otherwise I wouldn't come back except for a night of guacamole and chips.  My cousin took me out to eat and we decided on this place since we each had never been. Once seated we waited about 15 min to be waited on. Not our waitresses fault since she had just walked onto the floor from her break. \n\n She recommended some dishes and I ordered a chicken dish with chimichurri sauce which I love and was excited to try. My cousin ordered a different dish of which chorizo was supposed to be a part of. It took another 15 or 20 min  for the food to come out. The explanation was that there was a health inspection that day and the kitchen was backed up. (Red flag).\n\n We get our dishes and my dish does not have chimichurri and the other dish doesn't have chorizo. We tell them what's missing and for another 14 min we get \"its coming\".  Later the manager tells us that they never had chorizo or chimichurri. At the end. After we begin eating. Wtf? \n\nHe offers us a reduction in price after taking off my cousins beer. Had I been paying, that would not have been suffice but my cousin accepted.  I felt they  lied n waited for us to eat so we'd have to pay for the meal. It was just bad business and I felt it from the start.", "author": "Jenn D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "To the person(s) who came up with the idea of this place and executed that idea! *Cheers to you! This place is so inviting with it's sense of Vibrance and Attraction. It calls you to come in when you walk by. \nFirst time i was busy and had to order from the ToGo window. The young lady was very nice and informed on the best nights to go inside. I then decided to stroll in there on a Thursday and sat by the bar. The bartender Joe was this beautiful girl with a welcoming smile and attitude. I had some delicious FLAUTAS and Shrimps along with their Signature MARGARITA!\n I had a great time overall.", "author": "Keeke K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Really great place. It can get quite crowded but my friends and I made it before it got crowded. They were so patient with us while we waited for my other friends. Not a fan of guac but lord was that guac good. The waiter made it right in front us too. The chicken taco was a little salty for me but overall everything was great.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-26", "description": "I'm only giving this place 1 star for the beautiful decor and speedy service. You won't have to wait long for your food but that's probably because its served cold. Tacos are $4-$6 which is rediculious. I had a steak taco and fish taco. Both were cold and not authentic tacos. The fish taco was horrible. The tortillas feel like they're microwaved and again the prices are rediculious. Definitely not worth it. I would have rather gotten tacos from a taco truck", "author": "Andres C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "i come for the guacamole!!!!!... hands down the best!!!!.... terry or keavon makes it perfectly every time... while i've  had some horrible experience with management at this location i've since been back 4times just for the guac...", "author": "Shavita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Been here a number of times with my wife and baby. They were very accommodating. Food is consistently good. Cool atmosphere.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Humphrey was one of the best guac makers I ever had when you come just ask for him.. The drinks are wonderful as well all the staff here are great", "author": "Yamile G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Went here with a friend of mine on a Tuesday night and we enjoyed ourselves. The decor is BEAUTIFUL the best I've ever seen in a restaurant. I ordered tacos one steak, chicken, and pork, all three tasted AMAZING. The drink had a little too much ice and not enough liquor for me but it was still good. Overall I will definitely come back. Oh and the music was good which I enjoyed a little bit of everything was played which I appreciated.", "author": "Shantell G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "I usually never leave reviews, but in this case I must help the common good. STAY AWAY! Terrible service and mediocre food. Not real Mexican food - you might as well eat at Applebee's. Also, quite pricey for the level of food and service you are getting in return.", "author": "Maria P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "Came here with a few co workers for a quick bite. Overall the food was good, the environment was a little odd. Had the design of a Mexican restaurant with a modern twist while blasting what sounded like club music at max. The music was so loud everyone else in the restaurant was shouting to make conversation it added to the background noise. Was very difficult to even have a conversation at our table or with our waiter.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "This is the fourth Rocco's location I've been to so I think it's safe to say I've given this place a fair shot. Boca raton is my favorite location and Brooklyn my least. My boyfriend and I ate at the bar on a Sunday for dinner and ordered margaritas and we got them without salt. I don't know about you but I've never ordered a margarita anywhere ever and received it without salt. We ordered guacamole at the same time and didn't get it for 20 minutes. Between that time we ordered entrees. The guac came out 5 minutes before our entrees so we were those people at the bar with 10 plates balancing 5 different dishes. The food was consistent and good for sure but I wasn't prepared for that and it was very annoying so from now on il stick to the florida locations.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-04", "description": "Food is really mediocre and the service is not hospitable", "author": "Shehan J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}