{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "We came here tonite for dinner \u0026 good conversation with old friends. This is a very nice place for both! \nOur server Brandon was Excellent!!!  We has guacamole made table side with spicy chips! Yummmm \nWe also had fish tacos, chicken chimichanga \u0026 spinach salad - we all devoured our food.  \nWe have to return on a Tuesday night!!! It's all you can eat tacos - all varieties", "author": "Ivette E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "The food was very solid! I had a brunch item and we also got the medium guac. The chips and guac were slammin' and as always it's cute when they make it in front of you. I was there on a gloomy Sunday afternoon and it was surprisingly empty. I also got the bottomless mimosas. They always came within 5 minutes of us finishing our drinks (usually less) and we had well over 10 (don't judge the glasses are tiny! haha), they were pretty weak but for the price and frequency I had no complaints. Would go back and would recommend.", "author": "Len N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "Rocco's is a good place for drinks and that's it. Oh and maybe some guac, which is prepared table side and delish. \nThe food is pretty terrible and I also kept having the most awkward interactions with our waiter (Richard) to the point that he stopped coming to our table and left us waiting for a long time. He was so adamant about me not getting enchiladas with just cheese and insisted that I get the veggie ones instead or a burrito - huh? \nNeedless to say the enchiladas stuffed with random veggies were not good and he was upset that I didn't want to take them home. And that's when he disappeared on us for 35 mins haha.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Their food was amazing  I must say for my first time they lived up to my expectations. The good was good. The drinks was alright. Well my second one was. Because the first one I think they made it virgin.", "author": "Rema B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Good food. The guacamole was great and freshly made in front of you. Can't remember our waitresses name but she was sweet and really attentive. \n\nTheir house tequila is also better than Patron!", "author": "Keys R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "I'm used to the ones in Florida. This one was less exciting/hopping. The food was okay, nothing spectacular. They only offered one GF dessert option and they were out of it so my friend had to miss out. I ended up ordering their brownie. Was not that good. Kind of dry and had no spice.", "author": "Bella L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "I usually cook dinner, every night. \nSo when I go out especially, to a tequila bar/ tacos, I'm excited. I love Mexican food.\nI love to feel welcomed, my server anxious to serve\nInstead we sat for 20min, stopped a waitress to grab our order, she did not recommend the guacamole, which I would have loved. Did not bring us water. \nThe refried beans, taste like hormel Chile..\nWe literally ask 3 times for water.. never again...", "author": "Maritzabel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-17", "description": "The service here is outstanding (5 stars!!!) It was our first time here and the entire staff was sweet and attentive. As much as I wanted to love this place, the actual food was O-K. I'm really picky about Mexican food because my mom's food has forever spoiled me (thanks, mom). That being said...there's really nothing great about the food. It wasn't bad but it wasn't great. It's more tex-mex than it is a Mexican restaurant. I will say that the chips and guac is worth the price $$. I wouldn't go out of my way to come here again but I also would give it another shot. \n\nTIP- if you check in, you get a free tequila shot.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "The food was good 8/10. Our server was in training, but very sweet. The young lady that was training her was just as sweet. My friend and i were patient and very understanding bc we know that others may not be. Only issue was we were seated right next to the check in desk and the employees who are really just young \"kids\" were a tad bit unprofessional... especially while people are eating. Joke around on your own time. Patrons do pay attention. I would return, but will request different seating‍", "author": "Tanya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Steak was pretty good. Drinks even stronger. Nice place to go to for a bite in down town Brooklyn.", "author": "Emma V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Typical NYC tex-mex offerings.  Spicy gauc was delicious.  My shrimp quesadilla was way too big for a lunch.  Their nachos were just ok.\n\nService was a bit disjointed, but to be fair we were a large party and the place was busy.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "No complaints, I absolutely love this place. Went for the first time last night and everything was perfect. The drinks were strong (Strawberry basil margarita), the food I had was well seasoned and excellent. I love the salsa and chips, was fresh. \nI would highly recommend this place for a quick stop to eat.", "author": "Teshanee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "I'm giving 3 stars, because I really like the space, decoration, and every single detail is amazing \nThe service was ok the  music nothing to do with the place is hip hop in a Mexican restaurant I was like really?\nFood well I can tell wasn't impress at all\n\n-Nachos and Salsa\nWas good, the tomatoe sause was a bomb\n\nFlautas de Carne\nI was thinking crispy tortilla but this one looks like a croissant, taste like a croissant once you put it in you mouth taste all suggy Quesadilla well was ok I guess \nPrices are so high is just not a place I will come back", "author": "Sandy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-12", "description": "Ambience gets 4.5 stars, food gets 2.5, but food is really the main thing that matters.\n\nThe tableside guac is decent but the rest of the food is sub par for the price.\n\nAll in all not a bad place, but I just wish the food was tastier or more flavorful.", "author": "Dinesh R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "A fun place, it seems as you walk by. However, as soon as you go in you're greeted with false hopes as they make promises that they cannot uphold.  The flaming disappointment of judging a book by its cover is exemplified here.", "author": "Mathew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "We went here after taking our shelf exam. We were a group people with varied dietary restrictions and this place easily accommodated all of us. They made us fresh guacamole and pico salsa with chips right next to the table and it was finished within minutes. The food tasted great and our waiter (who was on his second day of work, Joe) took great care of us. I had the California Fish Tacos and my wife had the corn on the cob with a shrimp taco. There were no leftovers from any of us 6. The best part that if you check in then you get a free tequila shot with the purchase of an entree, so of course we had to celebrate the end of our exams.", "author": "Jeremy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "I visited on a Sunday afternoon, it wasn't too busy. However this location is fairly new \u0026 its layout is very expansive.\n\nWe were greeted and seated right away. \n\nWe order the table side guacamole which as perfect. The only restaurant I've visited and they finally had ripe avocado's. I take this pretty serious lol because I LOVE avocado's. They added just the right amount of ingredients.\n\nWe ordered drinks which were also made very well. I had the house margarita I believe. It was strong too but not too strong where I couldn't enjoy it. \n\nWe ordered the wet burrito and the enchiladas. I was already beginning to get full from the guacamole. But the food was perfect. For a Mexican theme restaurant they have this under control. Hands down best Tex mex restaurant. I've visited Mexico and I've had pretty epic authentic Mexican food. They didn't over do it. \n\nThe ambiance also plays very well into the theme. It is 2 floors. The restrooms are equipped with screens, different. A lot of festive Mexican decorations.\n\n\nI would recommend this place for a night out, girls night, or a laid back birthday dinner, it's also good for a date for just 2!", "author": "Shardae W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Had a fabulous lunch there! Loved that they make the guacamole to your liking. Service was friendly and courteous really nice vibe. Will return for dinner to check out their Magaritas!", "author": "Tricia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "My personal review is just that, unique to me. It has taken months upon months for me to review this place. First off, a fantastic check-in offer: free shot of tequila! Woo! Yes, let's get the party started. I was here with my in-laws on a dinner out after my sister-in-law's wedding. The rest of our party downloaded Yelp for the check-in offer! The place was next to our swanky hotel, so I had been seeing it for days on end, and it had been calling my name. Finally I arrived with the family. Partly because of the check-in offer and the rest because of the company, my experience was pretty great. A shot of tequila and a beer are a combo that doesn't miss often. I opted for several specialty tacos for my meal. Overall a good experience, but my three stars are due to what I discovered upon exiting our booth, in the corner space that butted up behind us. Someone had been sick, and I'll leave it at that. Maybe too many check-in offers redeemed?? A complete let down after an overall fun and special experience. Like I mentioned I'm confident my unfortunate experience was a one time thing. A bummer nonetheless!", "author": "Harlan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Amazing! I took my boyfriend there last week for his birthday. The atmosphere is full of good vibes. The staff was friendly and courteous. The food is delicious. We'll be back.", "author": "Eleithia R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}