{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-02", "description": "We were put in a corner and essentially forgotten about for a while. Took 10 minutes just to get water. Then we ordered chips and guac. The chips came out first and though they were fresh and hot, they were unevenly spiced. When our guac finally arrived, we weren't asked if we wanted it spicy or mild by the person making it tableside, even though the another server assured us we would be. So it was pretty spicy. Also, it was chunky, but not in a good way. More like the avocados weren't ripe enough to be made into guac. But the presentation was decent - a \"guacamountain,\" as my friend named it. Dinner also took forever to come. It was actually not bad though. I got the enchiladas verdes with the tomatillo sauce on the side. Decent meal, but I've had much better Mexican food overall. Glad it's wheelchair accessible though, since it seems not many restaurants are in Brook", "author": "Emily L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-27", "description": "I attended an event here, downstairs in there private party room. The manger attitude is horrible. He had his staff come and clean while the party was going on.  He could of waited until the event was done. We had 45mins left to go. He closed down the bar early and was standing by the door and kept asking when will this event end. He needs to learn to treat paying customers better. I will not eat here nor dine here again.", "author": "Leah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "A very large gang of colleagues and friends gathered for drinks at Rocco's last night for a going-away party. Nathan took great care of us. He made it so easy and fun for everyone. He somehow managed to keep track of everybody's orders and separate tabs which was no small feat. He was friendly, professional, calm and attentive. We had a wonderful time! Thank you so much, Nathan!! Great job! And thanks, Carlos, for accommodating us!", "author": "Amy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Decent. More marketing than taste. The drinks (mojito and watermelon margarita) are tasty. The tacos and guac are just ok, especially when you factor in the price. The most flavorful taco was the chorizo but the tacos consistently felt on the light side.\n\nService was upbeat and good. If you're in the area it's a cool place to get texmex but not necessarily a spot I would travel to again.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Ladies night out we decided to go with this spot and I must say it was a good choice...the food we ordered was good shrimp,steak, chicken, beef tacos  with mango margaritas drinks, our waitress was nice and friendly so was the staff.", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "looking for some food after a movie, we tried rocco's. not much else is open late in the area. my plan was to immediately ask what time the kitchen closed, but the bartender walked away just as we, and a few others walked in. \n\nwell, we sat at the wrong end of the bar. when the bartender came back she greeted other patrons (a group of white men, not the people who happened to walk in with us) who had come in after us and gave them menus. then she started texting on her phone. the other bartender told her she had customers behind her. she blew him off saying she got them. but she hadn't. we were still waiting. i asked bartender #2 what time the kitchen closed and he said it was close to closing. \n\nour bartender finally gave us menus then said we had 4 minutes to get the order in. she looked annoyed and was rushing us. i said well we've been here for at least 10 minutes. she got an attitude. i got up to leave and asked to speak to a manager. the manager didn't seem to care. he said she was new and they hadn't gotten any complaints... well, here's her first complaint. if you're an old white guy maybe you'll get service from her, but tonight she didn't seem to see or care about the black folks.", "author": "Kay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Clearly I'm a regular here with over 9 + \"check ins\". I can honestly say that I have never had a bad experience during my visits here. \n\nLet me start with the food. I wouldn't say it's the best but it's definitely good. Every time I come here I end up getting tacos and the empanadas..... oh and let's not forget the guacamole and chips. Perfect for a quick bite after work or shopping as Fulton mall is nearby. \n\nThe drinks are ok. I've had some weak drinks as well as strong drinks. In other words it's a hit or miss. For the most part I've been served strong drinks. \n\nThe ambience is casual and chill. It can get a bit loud at times. So if you're looking for a romantic intimate place this is not it. \n\nI definitely plan to return to check out their brunch menu.", "author": "Lauren E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-19", "description": "Just drank there but the service was subpar, the bartender had an attitude (like most people in the part of Brooklyn) but the place is decorated really cool and worth the visit, probably better during happy hour.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Went there for lunch with coworkers...we made reservation and waited around 6 minutes to be seated.\n\nAmbiance: Colorful and lively. Place is quite large.\n\nService: The hostess could have been a little friendlier. Our waiter was awesome.\n\nFood: The guac was pretty yummy. The salsa could was a bit watery.\nI ordered the steak and pork tacos in a lettuce cup. They charge you an extra 50 cent per taco to replace the tortilla with lettuce. I was fine with this until I saw the size of  the lettuce. It was literary the size of a coin dollar. I was under the impression it would be the size of a tortilla, so that I could make a low carb taco.  I was so disappointed. I don't understand how they can get away with charging you extra money for less food. Lettuce is no spinach so they cannot say it's expensive. I e-mailed the restaurant to complained about this and have yet to hear back from them.\n\nIf you decide to give this place a try, do not order the lettuce cup!", "author": "Rosemary V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Until today, Rocco's was one of my favorite places. I've been a customer ever since they first opened their establishment. After today's unbelievable experience, I'll never patronize them or never ever refer anyone else there.  I was returning to my table from the restroom and as I was walking past the cash register in the aisle, one of the female worker was retrieving something from the cabinet below the register. She apparently was in a hurry because she  abruptly bolted up from the cabinet without looking around her. As a result of me trying to avoid colliding with her I grabbed the end of the table to my right and frightened the lady. The young lady employee kept on about her business and never looked back. I sat down and waited for her to come back by and I was trying to wave my hand to get her attention, she didn't see me so I said \"Yo, Yo\" as I was waving. She came over to me and I said \"Excuse me, you just almost made me fall on that lady across from us because I was trying to avoid colliding with you.\" She replied very nasty , \"I don't answer to Yo\" I then said, \"That's the only way I could get your attention.\" She then said \"I'm sorry\" I then replied,\nI understand that you're busy but you should pay attention to your surroundings\" she then replied, \" I've already said I apologize so if that's not good enough for you then that's on you\". I concluded that she has a bad attitude and I was wasting my time by talking to her further, so I thought. I then waved another employee and asked her to ask the manager to come over to my table and she did. The manager came and introduced herself as Nathifa Amuaku. I then said, \"wait one second\", and walked over to the rude young lady and asked her to come over and join the conversation I'm having with your \nmanager. Once I returned with the young lady, I said \"Now that everyone is here, let me tell you what happened\". The manager Nathifa Amuaku, abruptly cut me off and said to the employee, \"Go back to work.\". She then turned to me and said with a very nasty tone, \"I'm not going to allow you to belittle her on the floor\". My mouth literally fell open because I was in complete shock. I replied, \" I'm not belittling her, I want her to witness what I was about to say to you.\" The manager then said, \"You can tell me what the problem is and I'll discuss it with management.\" I replied, \"So, what are you going to do about this?\" The manager replied, \"You won't be informed of how we deal with it.\" I then lost my cool and cursed at her. The manager replied, \"You're using profanity so this conversation is over!\" I followed her shouting, not cursing about the way she handled the situation then I left. I would like to apologize to any customers that were distributed by our argument and I hope I didn't ruin your afternoon out. Plain and simple, I was profiled as \"Hood\" because of how I was dressed.\nI was wearing a black Brooklyn Nets cap, white v-neck \nT-shirt and Black jeans. I'm a power plant engineer, that's what's I wear to work. That truly was the worst restaurant experience I've ever had in my 43 years on this earth. Never again. My waitress was excellent!!", "author": "S S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "First time here and I love this place! Drinks are LIT! Guacamole and Tacos were great!!!!!!! Follow me on IG for more great food and bars ..... xquisiterose", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "We went today during lunch hr and sat outside. Our server was rude and obviously did not care about his customers experience. 3 of us ordered a chicken quesadilla. We asked for the chicken to be well cooked and for no chili. This is what we received. We all assumed it was grilled chicken. While two of us decided to make the best of this disappointing meal, my coworker just could not take the texture and asked for a veggie instead. She had to walk twice inside to find our server and when he finally came out he seemed annoyed to have to order a veggie quesadilla and dismissed her by claiming it would take 20 minutes. It all comes down to customer service. If she didn't like her meal because it was clearly pulled chicken with chili why couldn't it be easier to just place an order for another quesadilla.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "The dos and don'ts of enjoying yourself at Rocco's Tacos and Tequila bar:\n\nDo walk into the inviting space and prepare yourself to be blown away by the pretty Mexican-inspired decor, although the outside isn't very appealing. It's a very clean, modern (but nods to the traditional and authentic Mexican art everywhere) 5-star worthy atmosphere with Star Wars art on the walls and hand carved wood everywhere. It's a space that you want to sit in and stay for an hour or two or three. \n\nDon't peruse the menu for too long. You could spend ten minutes reading Rocco's extensive menu only to decide on the same signature Rocco's Margarita and adobo chicken tacos that you always get. If you dillydally, it might take just as long to get the bartender's attention. Also, the wait for the food can be a bit long even when it's not so busy.\n\nDo enjoy the spectacular service of the bar manager during the day. During my lunch yesterday, she was running around, taking my food order when the bartender closest to my end of the bar was chatting it up with another patron and not checking on me, taking other patron's orders, checking in with the kitchen, running upstairs and downstairs, and just generally checking on everything. She was absolutely fantastic and is deserving of a promotion. \n\nWhile the other bartender was a decent mixologist, his service to me was virtually non-existent after he made my first drink. Then, I hated doing it but I kept calling for the other bartender since she was extremely responsive, full of energy and positivity but also realness and a great understanding of a patron's needs.\n\nDon't forget to try Rocco's signature margarita! With every sip you should close your eyes and imagine Antonio Banderas' character from Interview with the Vampire whispering in naughty Spanish in your ear. The drinks here are better than the food, in my opinion, so don't come to Rocco's without an appetite for tequila. \n\nDo try the fajitas, the corn on the cob and any of the tacos. The woman sitting next to me during my last visit thoroughly devoured the corn and a couple of friends that sat next to us on another occasion recommended the phenomenal-smelling fajitas. \n\nDon't hesitate to make this picture perfect destination resto the setting for your next celebration. Whether it's a company holiday party, a family dinner, a girl's night out or a solo lunch-cation--a two-hour lunch where you escape to a fun, usually mommy-juice-induced and childless good time--this place was created for classy and clean, group-friendly fun.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "The food was amazing and had a great server, his name is floyd. Great service. I will be back again", "author": "Jaime C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "Albert, Albert, Albert. Big poppa showed up. Thank you Rocco's Brooklyn for the lovely experience. Terry cooking table side guac hibachi style.", "author": "Megan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "I was soooo satisfied with my taco Tuesday service. Dean was a joy to work with. Exceptional service. So bubbly and patient. An asset to the team.", "author": "Toni P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Would give 3.5 stars if I could. Hostesses aren't very friendly and look like they hate their job. Probably not the best way to greet people when they first get to a restaurant. Me and a friend sat outside and ordered margaritas to start which were good size and STRONG! So that was a plus. Ordered chicken quesadillas which were pretty good, but I prefer chicken pieces in my quesadilla not shredded chicken and I wish there was a little more flavor. My friend ordered the chimichanga which she enjoyed. 3.5 stars for the food and service. Prices were OK...seems a little more expensive than it should be.", "author": "Isabella S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "The atmosphere, decoration and service are great. I really liked it. But the food tastes more like canned food than home made.\n\nFor hanging out with friends and have a few drinks this is the perfect place. But if for that price you want a better dining experience with better food then I recommend you to go somewhere else.", "author": "Rogelio S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "This would have been a 5 star review however; our initial waitress Bella was extremely rude and unpleasant. We were so uncomfortable that I had to ask the Manager to change our waitress. Then the whole time we were trying to enjoy our meal she was walking by making ignorant comments including \"these customers get on my nerves I need a new job\". Rolling her eyes at us when she walks by, standing across from us by the order station making comments just being rude. \n\nThe waitress Madelyn  they replaced Bella with was very nice and she continuously apologized for her behavior. \n\nThe drinks were good and not watered down. The food was really good too although Bella placed my order wrong it still was delicious!", "author": "Key H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "I came here twice, and both were very different experiences.\n\nMy first time here a few months ago was GREAT, I would've given them 5 stars. Between 2 of us, we had guac \u0026 chips to start, Durango, and the Surf \u0026 Turf Molcajete for one. Guac was great, they make it tableside and the guy making it was friendly. I think we got mild or medium spice. Durango was pretty good. The molcajete dish was really flavorful and well marinated. It was HUGE, enough for 2 people - we ended up taking more than half home and making another full meal for 2. The chicken was a bit overcooked so it was tough to eat. Loved the sweet potatoes. I had the house sangria and my boyfriend has the house margarita - they were both pretty good.\n\nThe second time a few weeks ago was unfortunately pretty bad, hence the -2 stars. Between the 3 of us, we ordered the guac \u0026 chips (medium spice), California Fish Tacos, \u0026 Bistec Con Avocado Fries. Guac was really good, but the woman making it seemed really bored and annoyed, so the experience wasn't as exciting. Our server was nice but service was extremely slow. The CA fish tacos were very bad...there was no flavor and it did not taste like CA fish tacos at all. Disappointing because 2 of us are from CA and we were very excited for them. The steak avocado fries - when we ordered this we thought it was fries with steak and toppings. Our misunderstanding (we got too excited to read through!) - it was actually steak with fried avocados. Oh well, we ate it anyway. The steak was decent, but the avocado fries were very bland. You needed a lot of the dipping sauce that came with it to get any flavor. We left half the plate. We all had different margaritas, all were pretty good.\n\nSo sad because the first experience was so great! I definitely recommend the guac, the molcajetes, and the margs!", "author": "Connie S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}