{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "I've only been here for lunch. Here's the bottom line: very nice space, decent food, reasonable prices. Service is a complete crapshoot, an indication of terrible management. The bartenders are mostly very nice, but don't know squat about proper service--I've seen dirty plates sitting FOREVER in front empty chairs, or worse, patrons, including myself on more than one unhappy occasion. \n\nBy the way, when I say crapshoot, I mean it ranges from barely acceptable to downright bad. The workers are never rude or unpleasant, but they take too long to do.....EVERYTHING, take your order, check to see if your food is ok, even bring you water that you've asked for. You might ask, why give so  much as three stars? \nI guess I'm an optimist. The space is really nice; if they could just get their act together it could be quite a spot.", "author": "vladimir r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Came here for dinner and I must say my food was good . Sadly I left my ID in my other purse and didn't get to order a drink . However I did try a friends drink and the margarita in the rocks was great and strong . The frozen one was not the same. the guac is made right in front of you and it is yummy with the chips given . a the chips have seasoning on them which make it better . I ordered a beef burrito which was OK, nothing to brag about . The nachos are delicious .  Would go back for apps and a drink .", "author": "Liz D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-20", "description": "Was served by Jarren . Been to this place before and had a great experience the first time, second time I went I ordered appetizers and drinks before my food and everything came together. I've served before for a few years and it was just terrible. Servers should never say \"want anything before we close the kitchen\" . \"No rush but do you want a box for that\" after taking the second bite from my food. He Gave us the check when we didn't even ask for it. He was trying to kick us out and i dont know why I even tipped him. Overall the food was great but the service was not. I should've asked for a manager but I left before I gave the server a piece of my mind.", "author": "Alison C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-19", "description": "I'm giving three stars as the food and staff are both awesome. Great environment and if drinking is your pleasure you'll have a great time. From tv's in the bathroom to fresh guacamole this is a great lunch/brunch/dinner spot. However as for the 3 star review...the utensils I got looked like someone tried to lick them clean and put it back. For my first time here I hope this was a one time thing.", "author": "Keyser S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "I tried to give this place another chance tonight as I write this and they failed miserably. My party had reservations and waited for almost an hour in front of a half-full restaurant just to be told they are \"fixing the table up now\" twice at different times by two rude hostesses who have nasty attitudes and who work with zero sense of urgency. \n\nListen, if you hate your job, hate it off the clock, don't hate it in front of hungry customers willing to spend serious cash for a celebration. \n\nWhat a shame.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "2nd visit. Excellent service. Ask for Nevil or Tony. I recommend this place for an afternoon hour or large party", "author": "pamela j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Good food, great drinks and EXCELLENT service, thanks to ANGEL. He was attentive and very friendly!! Thanks Angel!!", "author": "Jenna V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "Sunday afternoon pretty empty ... But never once did any of the staff introduce themselves or look like they wanted to be there. So  before going to the bar we went to the restroom (which is 2 flights down) it was aMESS BUT I still stayed  now i goto the bar have a seat an wait for the 1 bar attendant who was trying his best to wait on everyone. The food came quckly an was  edible. A female came over to help the bartender an made me the worst mojito ever (she used a blender \u0026 the mint was everywhere like a broken tea bag) she then strained the drink after I complaint. The best think was the Takeaway containers that wil be great Tupperware  for my lunch", "author": "Josie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "The food was blah, atmosphere loud, music pumping. My waitet Miguel AWESOME i dont think I've ever laughed so much in one night ever. Only highlight of this place. Good to hangout after work with a few friends and grab a few drinks with some nachos that's all.", "author": "Shainice L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "Came here with my Uncle for a Graduation celebration. Food was a bit pricey. I ordered the cobb salad, which was enough for two meals. Was disappointed that they did not have authentic rice milk Horchata like most Mexican restaurants in New York. \n\nMy uncle seemed pleased with the food he ordered. \n\nCame back another time to celebrate Happy Hour at the bar. The drinks were great and we ordered chips and salsa, which were delicious. Most the people at the bar did not seem terribly happy and the special was only a $1 off drinks that day. \n\nThe ambiance and decoration of the restaurant is amazing with a Dia de Los Muertos theme. The downstairs area where the bathrooms are has lots of great rooms for group parties. \n\nOverall a nice spot that has moved into the new Downtown Brooklyn gentrifying neighborhood.", "author": "Jenee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Definitely an enjoyable place to get that taco fix.\n\nI got the Korean tacos which was everything I hoped for and more. Along side with those tacos came this pitcher of prickly pear margarita. Taste was great, but I felt that their was barley any alcohol in it, which is why I demoted one star from this review. Our waitress was nice, so that's always a +!", "author": "Shannon X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Passion fruit margarita pitcher is good! \u0026the chicken quesadilla is GOOOD! \n\nTaco burger and fries were ok, something i wouldnt buy again", "author": "Princess Prissy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "The drinks and food are amazing .  If Wes is working, I highly recommend that you sit at his end of the bar!!!", "author": "Brandon F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "I don't know if I caught this place on a bad day..but they're service sucks! I guess we sat at the wrong side of the bar (towards the front), but nobody could be bothered. They didn't even bother to clean it cuz there was dirty glasses and tip money in front of me. We grew tired of  being neglected and flagged a bartender down, when she decided to come, she just looked at us, no \"hi\" \"hello\" \"what can I get u\"..nothing. She took our food order and never came back for our drink order. Halfway into our meal flagged down another bartender and she made our drinks. A girl sitting next to us made a to go order with another bartender, and they brought it to her in the container and that was it..no bag, napkins, utensils. Totally not a good first impression.", "author": "Alana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "Let me start off by saying: you can get a good cheap lunch here, at times. However, your have to be careful what you order. Guac and nachos are great. Tacos are touch and go. I ordered some fish tacos and they were bland. Had some carnitas and plastic was in it. The service can be pure crap, but the jalapeno Margarita is EVERYTHING! So with this place, I stick to a couple of items and avoid the rest.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "The staff was very friendly and the margaritas were awesome!!! Went to watch football and they had big TVs that were conducive to watching the game;however, the TVs were muted. The food was not good at all. I ordered nachos and they were bland and my friend ordered salsa and was displeased. Other than that cool place to go for drinks nice atmosphere !", "author": "Chanel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-01", "description": "The service was slow. We had a server by the name of dave g. Drinks took about 15 minutes to come. Food took forever to come and when it did come they got my order wrong so that ruined my appetite and my experience. Even a bottle of soda and a take home container took long to come. So long we had to ask more than once.", "author": "Casper L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Kickin' back at Rocco's tacos.... Chillin' with the best server in da joint!!! Jarren's killing it with the recommendations on the margaritas!  Great food!  Excellent service!", "author": "Jenn F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "Service was great. Place is gorgeous! Food was ok. Definitely Manhattan prices. Nothing really special. Drinks were weak :-(. Though I do appreciate the free shot. Had to pay for the chips and salsa. It wasn't that flavorful. Most places offer that for free. I had the tacos and my hubby the burrito. It's a cool happy hour spot. Not many of these in downtown. But I'm not sure I'd come back.", "author": "Vicky M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Too bad the service was nothing like the FL restaurant... Probably the worst experience I've had at a restaurant. The waitress messed up the bill for our order, so instead of fixing it, we had to wait for the manager who was EXTREMELY rude and argued with us. \n\nWe ordered a mojaltes for 1 and another entree and were billed for the mojaltes for 2 and the other entree. We were brought the same 1 mojaltes portion size we had ordered before yet the manager told us it was 2 portions even though it came with 1 side dish. Why would we order 3 entrees for 2 people?!?! He kept saying we should have asked for the half portion even though we said for 1 as the menu states. It does not state anything about half or full portion!", "author": "Danielle M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}