{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Nice place to stop by in between classes or work. Food is ok, kind of pricey. The guacamole is good, nothing extraordinary even though they make it fresh in front of you. \n\nI ordered a black cherry margarita which came rimmed in black salt. The margarita itself was kind of strong and a little bitter, and the black salt was a horrible touch. Personally I would not order this specific drink again, I would go for something like the strawberry basil margarita. Again that one isn't that amazing either. \n\nThe margaritas range from $11-$13 a drink. The food is pretty pricey as well. I came with a friend and we ordered the guacamole, flautas(appetizer) and two drinks (one each) and the bill came out to about $60 including tip. Would I come again? Ehh as my last option probably.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "The food and beverages are great. I had the dinner chili relenos and I thought they were very tasty. The service however is not very good. The place was not that busy and I only saw my server at the beginning and end. And they brought the appetizer and the entree at the same time which I thought was super tacky.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "9pm Saturday night. No wait for a table. Nice server, but slow service. There for 3 hrs and checked on us twice and had to be flagged down twice for water and again for the check.\nGuac made fresh at table. Pitchers of margaritas are larger than any other place I've been to. Tasty pork and chorizo tacos. I'd go back if im in the area again.", "author": "Charlene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "We had a great dinner,Kevin as our waiter and he was the bomb! Excellent service with a amazing personality! Ask for Kevin when you visit Rocco's. Also if you are in the mood for a magnificent margarita please have Ashley mix you up a pomegranate margarita or any margarita she will have your taste buds smiling and asking for more!! \n\nLola K", "author": "Lola H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "I have been here a minimum of 10 times, but last night was the last time that I will be going back. The service is only ever okay, the food is good, but expensive, and the taste of the drinks varies dramatically each time I visit. \n\nIt's conveniently located near my job, so I have continued to go back. However, last night when I was sitting at the bar I saw a huge roach scurrying behind the counter. One of the staff members noticed it, and squashed it with a dish rag behind the counter. He then proceeded to use that dish rag to wipe down the bar top several times throughout the night. I told my friend what I saw, and she said that that's not the first time she has seen roaches there. We were both so disgusted that we vowed never to go back there again. I am so surprised that they could have passed the health inspection. If I were you, I would stay far, far, far away from this restaurant.", "author": "Sophie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "The food was pretty good and the decor is gorgeous. They were able to accommodate a large group of 9 people. Our server Angel was awesome! \n\nI had the California fish tacos (fried). The sauce used for the coleslaw was very flavor with pineapple chunks in it.The only reason I give 4 stars is because the mimosas were a little weak.", "author": "Nellie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "I've eaten here about four times now. The decor is beautiful, lots of seating, and I enjoyed the food. Nothing stands out that I absolutely have to have or that I'll make a trip to Bk specifically for, but there's nothing to complain about. The guacamole is prepared right at your table. Nowadays this isn't a novelty, but it adds a nice touch to your meal. The main attraction is that Rocco's offers over 400 varieties of tequila.\n\nIf I'm close by, I'll stop in for a meal. Keep in mind that the wait can be lengthy. Best to make reservations if you can.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "I came here with friends after work for the unlimited taco special. \n\nPros: festive and fun restaurant, good prices and very kind people. \n\nCons: The tacos were soggy and not great tasting.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "The most important thing you should know about Rocco's Tacos is that each individual bathroom stall has a TV in it...and it plays The Three Amigos on constant repeat. If that isn't amazing enough, the food is pretty awesome, too. I loved the Chicken Quesadilla and Strawberry Margarita, and can't wait to try the table-side Guacamole next time!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "National Margarita Day. Great day to go to tequila bar. Checked the yelp review 3+ stars. Got there about the 5pm. The hostess Iquana, long hair great personality, was very clear in explaining my options as to sitting at bar vs. Dinner deals. Decided to Sita at bar . Ordered the shrimp in patron. They were so good ordered more. We had the house margarita. Delicioso! Alana was great despite being short a bartender due to a huge private party going on downstairs. The chips and guacamole were okay. Appeared to be missing culantro/cilantro and lime . Very bland even though we ordered the medium spice. A little disappointed to have bad quacamole in a Mexican restaurant.The  crowd was diverse and friendly.  The empanadas were delicious as well. Will definitely be back for Rocco's Tacos", "author": "Genie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "I was disappointed when I went there. It was a nice day out and I arrived before my friend, so I put my name on a waitlist for an outdoor table (I was told a 20 minute wait). I went to the bar and asked about Happy Hour. They had $7 appetizers, but only $2 off regularly priced drinks. I had one house margarita and waited for my friend. I was very early, so I waited about 45 minutes, but when she got there, no one had even checked in with me about the table. When we went to the front, they pretended that I was still on the waitlist (if I had ever been ok it to begin with) and apologized. We went back to the bar to wait. Maybe 10-15 minutes later someone came to seat us- inside. I let it slide, because I was hungry and just wanted to get started. I think we waited 10 minutes before we were brought water; another 10 minutes before menus were brought over. It was still Happy Hour, but at this place, it's only applicable at the bar. I ordered 2 tacos. They were flavorless and mediocre. At least my house margaritas were good. The decor and ambiance is nice there, but it's not worth it to me for the service, prices, and food. I won't be returning.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I've been wanting to come here for long and just never have, I finally did and I came back twice in one week. The food is excellent. I came the first time for lunch and the second time for dinner. \nThe first time I came we ordered the mild guac as an appetizer, it's really entertaining that they come around and make it table side, and it was even more of a plus that it tasted so good. For my entree I got the pork and chicken soft taco with a side salad. My friend got the chicken and cheese quesadilla with a side of fries, she really liked her food. \nThe second time I came, we came at night and got dinner. I ordered the skinny cocktail which was so good. As an appetizer we got the guac again plus the beef flautas which were great. For my entree I ordered the Mexican Cobb salad which was good. \nThe staff is really nice and the managers that are on shift seem to walk around and see how everyone's dinning experience is going. I also noticed that they do a bottomless brunch time cocktail special for and added $12 if you purchase an entree. I would love to come back here soon for that.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Stopped for lunch with my daughter on the 6th of July after a brisk walk up from the ferry.  This is an attractively decorated restaurant and bar.  The bar is large - about half the length of a football field.  The restaurant was not busy when we arrived although the pace was picking up by the time we left.  We were greeted quickly by a friendly server who brought \"still\" water.  The guacomole made table side was excellent and when combined with warm homemade chips I think a good value also (despite what some other reviewers have stated).  My tacos, however, were unremarkable and bit overpriced.  I didn't try any tequila.  But there was a TV monitor at each urinal so I got to watch about 30 seconds of Zorro which took the sting off the taco misstep.  The bathrooms are downstairs in an area which seems to be designed for private parties.  There is a Taco Tuesday special where you can get all the tacos you want for about $20.  The food may not be 5-star authentic Mexican but it is plenty good enough and I bet Rocco's Tacos is a happening place to be on a weekend night or a Taco Tuesday. I would return if I ever found myself in the area again.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "One of my favorite restaurants in Brooklyn! Came here almost every Saturday after grad school! Drinks are the best \u0026 if you check in on yelp you get a FREE shot of tequila with your entree! The best part is they make the guacamole in front of you. The overall ambience is cool too!", "author": "Medina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Always love going to Rocco's Tacos. I can't think of another Mexican restaurant similar to it in Brooklyn. Tequila, tequila, tequila... everywhere. Besides the free Yelp shot when you check in, the margaritas are excellent. My favorite is the Mango Margarita.\n\nThe guacamole is a must order... even though guacamole is super simple to make at home there's something magical about Rocco's. They make it tableside and it's super fresh and perfect.\n\nMy 2 favorite entrees are the Brooklyn Tacos (which have a bunch of different types of meat like bacon and chorizo) and the Korean tacos. They had a special for day of the dead which was lobster tacos... they were good but not as good as the other options.\n\nThey have some cool decor. In the downstairs area they have a whole room with paintings of sugar skulls that are Star Wars themed. My favorite item of decor is something that most people probably don't get immediately. It's a nod to Pee Wee Herman and his iconic white clogs from the Pee Wee's Big Adventure Tequila scene. The white clogs proudly hang like a shrine from the ceiling. There's also a drawing of them on their to-go bags.\n\nI have never made it to the dessert round... always too full. Will keep coming back.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "I've been to this restaurant three times and it's time for me to show some love. \n\nFood: Every plate I have had at this place has been delicious. My last meal here was the combination fajita and it was by far my favorite. The bowl the meats are served in is massive and everything has so much flavor. I like beans with my fajita so that was a separate order since this meal doesn't really come with a side. My date ordered the skirt steak and she loved that as well. Everything was well seasoned. \n\nDrinks: the drinks were somewhat underwhelming. I ordered the red sangria and was disappointed  because it tasted more like flavored water. I then gave their mai tai drink a try and again I was left with the sadface. Too heavy handed on the grenadine. \n\nService: The hostess at the front who brought me to my seat was a bit cold and unwelcoming. I inquired on whether or not they were serving food downstairs and was met with a condescending tone . \n\nOverall: Great for groups and their taco Tuesday deal is a steal. The food is great so I will continue to visit.", "author": "Fred D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "The wife and I have been to several locations including this one and several south Florida locations. The food is good, especially the guacamole. The drinks are tasty! The service was good, they messed up our order and made up for it with a discount personally from the manager who came to talk to us.  Big restaurant, gets busy.  Place rocks.", "author": "Smith J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Rocco's Tacos \u0026 Tequila Bar provides such a great menu. I started with salsa \u0026 chips, and guacamole made fresh right at the table. Next, I shared The Brooklyn - pulled pork, smoked bacon, chorizo, pork belly, cilantro, onion, salsa verde cocida on a handmade tortilla. For my main course I had the Carne Molida - spicy ground beef served with taco sauce, pico de gallo, cilantro, pickled red onions and cotija cheese. It wouldn't be a fiesta without a beverage...or two! I had the strawberry basil and tanteo jalapeño margaritas, I also sampled the Michelada for good measure :)\n\nGreat ambiance, food, drinks, and service!", "author": "K. D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Not an authentic Mexican restaurant, the drinks were gross, the flautas not all that and the service horrendous.", "author": "Jocelyn R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "DELICIOUS GUAC!!! Seriously get the guac you won't be disappointed. The portions are huge! And the free tequila shots (which are really double shots....) when you check in are awesome. \n\nA group of us came here for lunch once and told the waitstaff we needed to rush, which they accommodated for. Another time we came for happy hour and got the margarita pitcher--I forget now which it was called, but it was perfectly sour and absolutely delicious (although I personally didn't think there was that much alcohol, while my friends definitely were affected....)\n\nBoth times I came with work friends, so didn't quite pay attention to the cost but I remember it being slightly expensive? If you don't care about that though, food is delicious and drinks are a perfect escape post-work.", "author": "Grace L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}