{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "Heads up that this review isn't just for the Bar/Restaurant, I'm writing it because of a bartender that made the experience here positive for me.\n\nIn late November I went to Rocco's on a Friday night around 5, when the downstairs bar was being set up. First off, having worked in restaurants for some 10 years in NYC you can tell when a place has good leadership or not. From the experience eating here the leadership at this place does not have it together: staff were for the most part extremely disorganized, with mixed messages from different staff members, food preparation not in order for guests by time wait staff fired/placed order with kitchen, etc. \n\nHowever, none of this matters because Ramon is literally one of the best bartenders I have ever had in all of New York City. And I can drink, so that's saying something. \n\nDespite clearly having a bit of a rough day, Ramon did everything possible to make my experience at Rocco's comfortable and professional. Even though the downstairs area had just opened and Happy Hour was just getting underway, he double checked my order with me to make sure I got my margarita exactly the way I wanted it. He took extra time to explain happy hour specials to me (they weren't clearly marked on the menu/in bar area.) He placed my order right when I gave it to him, and when another group of girls got their food before me (even when I'd ordered the same thing as one of them) and my app finally turned up and was basically still frozen, he handled everything with grace and, again, total professionalism. He re-ordered the food for me, even after going to the kitchen directly to check on my order after the other girl got my same order before me (again, bartenders should n-e-v-e-r have to do a runner's job, especially at happy hour!) so that I wouldn't be eating a cold mess. He even assured me that he would give me a complimentary happy hour drink just to make up for the egregious wait time and cold food/re-order wait in response to the kitchen's oversight.\n\nI'll be honest, this was my first time at Rocco's and they are so lucky to have Ramon. If he wasn't working that night I would honestly be leaving a one star review. As it is, I'm leaving a four star review and - frankly - 3 of these stars are for Ramon. Actually, five stars are for Ramon - with a negative one for the general lack of coordination with kitchen, seating staff, etc. \n\nThanks, Ramon! You made the night!!", "author": "Audra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "While visiting from Los Angeles we wanted Mexican! In L.A. we have Mexican restaurants as much you guys have Starbucks out here. We came in with no wait time ( Lunch Menu) we got service was right away! I will admit the food was not the best ( I have Mexican in me ) i have had in the past! Tasty ? Yes !! Fresh? Yes !! Spicy? No. It wasn't full of flavor. Great Service and the restaurant was clean. One thing I do look for is how clean is the restroom! Very clean and well maintained! They even were showing Nacho Libre in the restroom! The Bar was fully stocked and good service at the bar.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "One of my supervisors vehemently disliked the food and drinks here.  I decided to meet a friend there and try it for myself because it is near my job. Impressions:\n\nService:  Waitress said she was in a bad mood and had an attitude.  My friend and I disarmed her with our charm, but that was a very strange greeting. Most would have asked for a new waitress or left, we cheered her up and her service improved..but still...\n\nFood: We only had the guac and chips, which was made  table side. It was ok, but the chips had this weird seasoning on it and that took away from the flavor.  We didnt finish it, and usually I destroy guac and chips!\n\nDrink:  My friend ordered Tequilla and needed another short to make it strong.  This despite the menu advertising tequila as their best drink. The waitress said  we should come back on another night because the new bar tender doesnt make strong drinks..lol.  wow...\n\nAmbiance and atmosphere:  Good after work lively crowd, with a big bar space. If you are looking for quiet, lunch time is probably best.  We also went on a cold night and the door kept getting stuck open. I had to lend my friend my jacket since it was cold in the restaurant.\n\nOverall: I won't be returning.  The restaurant felt like the Applebees of the Taco world. I'm not sure if Rocco would enjoy his experience.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "Upon a friends suggestion we ate here on the early evening of, Feb. 13th, 2019. We were seated at the table directly behind the hostess station, which was way to close to the cupboard where the servers can leave their belongings. My friend was bumped twice and I suggested she move. The hostess apologized only after my friend moved, and I made a comment about the hostess not apologizing,  but not when the bump occurred. Moving on to our meal: the guacamole is clearly the star of the menu, but was lacking in flavor and texture. The addition of chopped jalapeno peppers didn't help. By including, chopped red and white onion( not in equal amounts) and garlic at the same time the avocado is mashed, plus using more lime juice, it would've been fantastic. Mixing them together would allow for the water in the onions to be released which would enhance the dish a lot sooner. The chips added some texture and flavor because the chips are sprinkled with what i think was chili powder; however as a a stand alone dish the guacamole was a little bland. It couldve been because it didnt have a chance to marinate, which is typical for a guacamole dish.  Secondly,  I had the tomato soup plain with crema, which while it was good, it couldve been great. The dish wouldve been brighter by adding a spice of lemon or lime to the side, which will be squeezed right before eating. Lastly, the music was a little loud, so it was hard to hear the server.", "author": "Bubblie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "No complaints, I am definitely returning, especially for Taco Tuesday.  Good food and great service!", "author": "Kenya A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "The drinks weren't what i remember. I used to come here when they 1st open to drink/eat to kill time b4 a movie. \n\nThe food was expensive but not worth the portions provided. My friends were upset their main dish was $21.00 each yet so that they had to order additional food because they were still hungry.", "author": "Nell d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-22", "description": "So disappointed! After hearing friends rave about the Ft Lauderdale location we figured we would try the one in Brooklyn. The space is nice (forget about parking in the area!!) and staff pleasant however the food tasted like it came from the microwave and the over priced drinks were disgusting! We ordered the table side guacamole which was a lemony bowl of mush! The chicken verde enchiladas consisted of a scoop of rice, some refried beans and 3 stale tortillas filled w chicken. The carne asada or some kind of steak  two tiny pieces and some yuca fries...BTW the yuca fries were the highlight of the evening. Very over priced and lacking! Sorry I gave up a night at Rosa Mexicana for this crap!", "author": "Lexa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "I came here to celebrate Cinco de Mayo. So naturally, it was pretty crowded.\n\nEventually, we got a table downstairs. Before we sat down we were told there is a 2 hr maximum stay. The ambiance is beautiful, and clean. I ordered chicken quesadillas, a negra modelo (served in a nice plastic cup), and a shot of tequila. I don't know how more Mexican I can be with that order.\n\nThe food is phenomenal. Chicken is succulent, seasoned well and the tortilla baked to perfection. Nice and crusty the knife cuts through it like butter without the whole thing falling apart. Gordon Ramsay would be ok with this.\n\nAfter having 2 beers, we were ready to leave (and were within our 2 hr stay). But at that moment the staff gave out a round of free beers. And it takes time to drink a beer after 2 shots and 2 other beers. You can't chug this, especially when it's served in a beautiful plastic cup (we were told by staff that they usually serve drinks in glass).\n\nSo we realized two things. \n1) shots were $12\n2) before we got a chance to finish our free round of brews, they wanted us out and gave us the boot.\n\nOverall, staff was not coordinated, and it seemed to me the establishment was not prepared for this occassion. I understand that it's a special holiday,  but standards have to be kept.\n\nI would like to come back on a normal day, because the food was bangin'.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "For starters I made reservations for exactly when they opened which was 11:30. We got there exactly on time and tried to go in but this guy stopped us (guess he worked there) and said we open at 11:30. Well idiot it is 11:30 so what is your point? What annoyed me was the fact that there were people inside but me and my friend couldn't get in yet. We were ready to take our money elsewhere but we eventually got in.\n\nOur waiter was the best, his name was Christian. Absolutely nothing bad to say about him or the food. He is honestly the reason why I gave the service 4 stars instead of 3.", "author": "Brianna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "The customer service as well as the drinks and food are amazing.\n\nMy wife and I keep coming back.", "author": "Kelly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-09", "description": "Staff is friendly, food is fine, but it's an over-priced tourist trap in downtown Brooklyn that serves expensive but weak drinks and management doesn't care about its customers (tho at least my server warned me the margarita would be watered down).  Don't waste your time or money. Find someplace else to eat.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Enjoyed @roccos_tacos seafood molcajetes on this rainy day here in NYC. This and the mango margarita's were amazing and highly recommended!\nshrimp, scallops, fish, poblano chiles, sweet potatoes, charred tomatoes, onions and cilantro. molcajetes are rocco's version of an authentic fajita baked and served in a lava rock bowl from mexico. served with flour tortillas, pico de gallo, cotija cheese, guacamole and sour cream.  Just what we needed ! #nomnomnom #nycfoodie #nyceats #brooklyn", "author": "Nic T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "The food and drinks are decent, but very very overpriced. Service was slow. Over all a decent time. Didnt regret trying the place but wouldnt go back anytime soon.", "author": "Belle a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "I was excited when I saw the \"coming soon\" signs. The space is huge so I though it would be great witb coworkers. Also, there weren't many Mexican restaurants close by. Well, it opened and it's my go to spot. I've been going there since the first week!\n\nThe decor is fun and vibrant, and the space is large with a few private room options for groups (downstairs and on the first floor off to the side).\n\nI started going there for lunch. It's a chill place with minimal music in the background. The menu is pretty much the same as dinner but I have to say... the first few times I went, I hated the guacamole. It was bland and slimey. I thought it was a bad batch but when it happened again I spoke to my waitress. She called the manager and we had a nice long chat. He explained that they order a certain type of avocado and some other people have complained as well. He said he would let the owner know and perhaps consider a different brand. Well it happened! The next time I went the guacamole was amazing!! And it's been great ever since.  That sold me, so i started going after work. A few nights a week they had a live DJ (thurs-sat) and the music selection makes you wanna dance with your taco! You just can't put it down! The food is delicious. And there is a good variety (even lighter options which can be rare in a Mexican spot).\n\nThe expansive bar is usually packed from happy hour to close so go early. A few times Rocco himself was there! He gets on the mic and gets the crowd amped. This is not a club but it was poppin the nights I went. And he gave out free tequila shots... to the entire restaurant! Who does that?! And it's happened more than once.\n\nGreat food, great atmosphere, great tequila.\nShout out to Rocco for this great restaurant. Cheers!!!", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Came here for a Sunday birthday brunch. It wasn't that packed when we came in. We had our own section since we were about 25 people. I've read in other reviews that the service was terrible, but the two waiters we had were very nice and attentive. We ordered medium and spicy guacamole, which the guy made right in front of us. So good! The guac with the chips are a must! I ordered a carne asada and pollo taco. Thank god that was all that I got. I got so full by the time I finished my carne asada taco. Maybe it was because I had so much guac. You can get unlimited mimosas for $12 during brunch. We also got free shots of tequila if we checked in on Yelp- way too strong, btw.\n\nI would come back for the guac for sure.", "author": "Kris L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-29", "description": "Went back for lunch on another stuck at court day.  Sat at the bar and ordered a chimichanga.  About 15 minutes later, another dude sits down and orders a chimichanga.  Lets just review- I am a clean shaved, 30-ish, balding, fat guy in a suit.  Next to me is a 60-something hippy (complete with dirty tye-dye shirt), thin, with long hair and a beard.  There are no words in the entire English language that could be used to describe the 2 of us simultaneously.\n\nThat said, when my chimichanga shows up it is promptly presented to my disheveled barmate.  He, obviously figuring he has arrived at a restaurant that mind-reads orders and starts cooking before you even enter, begins to eat my lunch before I can say 2 words.  The bartender comes over about mid-way through his meal and actually asks me \"didn't you order food?\" \n\nRather than reach over the bar and strangle her, I let her know that yes, I did order a chimichanga.  I did this loud enough for hippy to hear, but he was too busy eating to be bothered.  To her credit she apologized, and said she would check on it.  \n\nCrust junky hippy has now finished lunch when the food runner comes over and says \"someone missing a chimichanga?\"  I'm just glad hippy didn't think \"they make you 2!\" and grab my meal again.  Total time from order to lunch was over an hour.  I had to swallow everything whole to get back to court on time, so I can't tell you how it tasted other than \"hot.\"  No apologies by any type of manager or compensation on my bill.  Bartender didn't even offer to buy me a drink.  \n\nBottom line, there is no system for ensuring who gets served food when you sit at the bar.  Have your fork ready to lay claim to any food that is presented there.", "author": "Ian N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Had a blast at Rocco's last night. Went here for a family dinner. Prior to sitting at a table we were at the bar \u0026 ordered guacamole. They shaped our guac in smile heart face! It was adorable - this little touch made us smile! \n\nThe guacamole was so filling that I hardly wanted to order dinner... but I ordered the ceviche special. It was good- about on par with other ceviches I've ordered. \n\nService was great, food came out fast. This is a great spot for a family dinner!", "author": "Laura S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "Perfect way to describe this in as few words as possible - The Applebees of Dos Caminos. \n\nThey try to make this fancy and fun Mexican at the same time but still obtain that chain essence with super fruity watered down but still over-priced cocktails and plenty of decorative kitsch to try and distract you away from how just mediocre and sub-par everything is in the restaurant. \n\nI came here last night for catch ups with an old college buddy. Super convenient for both of us as it was two train stops from my job and across the street from her own and in Brooklyn. I love making people go or finding people to hang out with in Brooklyn. It's always Manhattan or Queens these days. Sigh. But honestly, take your duckets next door to the bbq joint. \n\nShe initially put our name in with the hostess. We were going to do a reservation but open table was down or something fell through. There was a twenty minute wait and that news wasn't the end of the world. About 30 minutes later we started getting antsy. Finally after about 40 minutes we went up to the hostess. She apparently never put her name in according to this woman. The other hostess came over and said she text messaged us that there was a table ready awhile ago. Not true. No text message. Though, after this awkward confrontation and saying sternly we waited 45 minutes in front of your faces to not have a table they seated us immediately.\n\nDrinks as I said above are super girly and not strong at all. I ordered a prickly pear margarita. I haven't been drinking much lately. I can attest that last week I was sloshed off of only two beers and after downing my delightful purplish-pink syrup prickly pear I felt nothing for an outstanding $10 (cheapest price of a margarita off of non-happy hour hours). \n\nThe drinks aren't the only thing over-priced. I was between trying their name-sake of tacos but after reading some reviews on how bland as hell the fish was I wasn't going to fork over $6 for a singular fish taco and leave starving. I went with the bland, flat, pancake thin cheese quesadilla with little but appreciated scoops of sour cream, chopped tomato, and guac. \n\nThe reason why this place gets 3 stars instead of 2? They have table side made guacamole that honestly tastes pretty darn good. We ordered it mild which I would normally never do because I like my stuff spicy as hell but it still tasted great. Fresh, creamy, wonderful consistency and flavor. The guy that makes them apparently does close to 250 a day. This guy is probably the best part of the entire restaurant. The chips are seasoned well with some kind of brown paprica looking seasoning. I would come back honestly only during happy hour (but be warned that this place gets insanely packed with feral animals on the prowl for fresh margs/guac), taco tuesdays (all you can eat tacos for under $20 and $6 marked down margs), or their bottomless brunch weekends which is only $12 for mimosas or bloody marrys plus your food.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-25", "description": "So I don't know if it was an off night last night but I was not impressed with this place. My friend suggested we come here for margaritas last night but what a disappointment. The margaritas was okay. I've definitely had better \u0026 the food was just not good at all. I had the chicken quesadillas and they were pretty bland. My other two friends ordered the jalapeño poppers and the nachos. The nachos weren't bad. \n\nAs for the service, our bartender was not welcoming. He seemed as if he did not want to be there. All in all, I more than likely will not be returning here.", "author": "Guitelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "I like this place been here twice one with my ex and the other with the best friend. Then I ordered lunch and took it back to work.", "author": "Jane D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}