{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I love Roccos! \nI've dined here on several occasions and have never been disappointed. \nI recently celebrated my 20-something birthday (heh-heh) with close friends and family here and the staff was extremely accommodating and friendly. \nThe drinks are very good (my favorites are the grand marnier peach sangria and passion fruit margarita -hold the salt!).\nThe food is great. \nThe atmosphere is fun and decor is definitely out of this world. \n\nKeep it up guys!", "author": "Chanell H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-14", "description": "Why three stars? First off maybe it was a hiccup, a mere oversight but we were told that the staff were changing shifts and brunch was ending on a Sunday afternoon. So we had no problem waiting in the cool lobby space. Couples started to walk in ahead of us and were immediately seated (before us). Once we saw we were forgotten we asked the hostess (there were two) what happened. Apparently I overheard the hostess we initally met she put us on the wrong list. OK no biggie. We were seated in the back of the restaurant. Waited, waited, waited for a server. Finally a manager saw that we were looking around and sent someone over to us. The server  told us we would have another server but she would take our drink orders. (the other server showed up at almost the end of our dinner right before we got our mains). So she took our order. We ordered the guac and it was super yummy. Although I would like to point out they do not wipe the inside of the bowls left out on each table. They just make the guac in the bowls that are lying out in the open. (I personally wiped ours with a napkin and saw residue on the napkin from the bowl) I ordered the molcajete surf and turf why quiet yummy I wouldn't order it again. It would help if the description read- soupy or stew cause that's exactly what was brought over. My husband enjoyed fish tacos that were flavorful. I would go back again. Hopefully my next experience isn't as bad as my first. I hope they don't seem so unorganized next time. Or maybe we should steer away from the shift changes lol", "author": "Karla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Review for BRUNCH only.\n\nI am ashamed to say that while I am still fairly new to this neighborhood, 4 solid months passed before I even considered stepping foot into Rocco's. Let me first say that I am not a huge fan of Mexican food. Rather, I am a fake Mexican food-eater (basically the only thing I will eat is a chicken quesadilla.) Also, it was because every time I walk by on my way home, the place is PACKED and LOUD. Don't get me wrong, I'm not hating, but sometimes you're just not in the ~mood~ for that vibe.\n\nIn any event, stopped in for their bottomless brunch on a Saturday. I was shocked to see that the place was relatively empty/quiet. Turns out their brunch crew is not as lively as their after-work crew. Also turns out they don't have quesadillas on their brunch menu. Honestly I was pretty bummed, but the bartender told me they would be happy to make me one and that quesadillas are not a \"popular brunch option\", hence they are not on the brunch menu.\n\nFood portions were large and tasty, mimosas were great and in true fashion, bottomless. Be sure to check into yelp while you're there so you can get your free tequila shot. PSA: FREE TEQUILA SHOTS WITH CHECK IN.", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "I came here last year for my dads birthday and we had a great time. I wish I could say the same for this year, out server took forever - she was to busy giving her undivided attention to a large group of me (perhaps she anticipated a bigger tip). Either she was there or hiding away somewhere. The bus boys helped us more. The managers presence was not apparent at all. We got the surf and turf and it was far too salty and did not seem fresh. Will not be returning and I do not recommend for large groups.", "author": "Monica G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "Carne asada tacos: Not sure if my flour tortillas were tortillas (cardboard?), and a bit vinegary with some sprinkled cheese that did not melt, but I was glad to get a taco with a good filling-to-shell ratio. 2 stars for benefit of the doubt. Touristy. May try again.", "author": "Debbie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "I went to this restaurant because it had a 4 star rating. The only thing in this place that deserves a 4 star rating was the decor!! \nSat at the bar because there was a 40 minute wait, which was shocking because there were a lot of empty seats. The bartender never asked us what we wanted to drink. We had to track him down to order guacamole because we were starving. 10 min later we ordered a soup and asked him about the enchiladas and which one was good to get he suggested one for us so we said sure we will try it and that's when he decided to put the guacamole order in. We get our \"enchilada\" which wasn't an enchilada we mention it to him that we specifically said enchilada. I asked him if we could still get it and he said he would have to call the manager (not sure why). Manager comes over super annoyed and had a really bad attitude. So we felt bad for the kid so we said you know what it's not that big of a deal. While she's literally 1 foot in front of us she lets out this big ugh and rolls her eyes and then walks away. At that point I was so beyond disgusted I wanted to walk out but my boyfriend said ignore her. We dealt with it. Stayed got our entree and soup. Had to ask for utensils, oh and this whole entire time still no drinks, had to ask for water. We finished ours meals and then they placed chips and salsa down. I couldn't help but laugh at how backwards this place was. We asked for the check and then comes out our guacamole which wasn't good at all. \nI was extremely disappointed. The service was awful and the food was not Mexican food. Don't waste your time or money. \nI almost forgot to mention the women's bathroom had no toilet paper !!! Out of 4 stalls only 1 barely had some left.", "author": "Johanna R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "I took the family to Rocco's for dinner. We ordered burritos, nachos and I ordered a taco burger. The burger was cooked as requested but had a sour taste. I ate 1/3 of the burger and no fries and got very sick. The manager walked by and looked at my family's cleaned off plates (their food was great) and my practically untouched meal and completely turn around and started walking away. I called him over and gave him my credit card to pay the meal, I mentioned my dissatisfaction in Rocco's. It didn't turn out as expected. So I left. \n(((( buyer beware of the Burgers, go next door to Shake Shack.  ))))\n\n* btw, the waitress was great. I also told the manager I would leave negative feedback on yelp. I would have liked to handle this in the store.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "Food is mediocre.. drinks are pretty good. Staff is absolutely disgusting on every occasion.", "author": "Sasha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "I don't really care for the food of this place, but the bar service Bridgette provided was accommodating and exceptional. The margaritas she made were the bomb.com. She ensures that every customer is happy and feels welcome. It is evident when you watch her work. Also, the decor is kinda awesome.", "author": "Deniz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "the manager Latifa was so awesome!!!! you can can definitely bring your concerns to her and they will be addressed. This place never, or should I say, has yet to disappoint me with the food, service, and atmosphere I have been to Taco tuesday twice and it has been awesome. The waiter Kenyatta I had last tuesday was awesome!!! and very helpful with choosing menu items Love it", "author": "Bugzie 5."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "My family and I were regulars at the Ft. Lauderdale location - we stopped by this location because we were in town and have moved from South Florida. This place is not as well run as the SoFla location. If this was my only Rocco's experience, I would not seek out another location. The guac was delish and drinks were decent. However service was slow and part of our order was forgotten. This location does not have the same vibe as either the Ft. Lauderdale or Boca Raton sites. The salsa was watery and we got the bottom of the chip batch - small broken pieces. I totally understand the 3.5 star yelp review. This could be so much better.", "author": "Holly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "I have been a fan of Rocco tacos since the original on Las Olas. I love going to Rocco's tacos until I moved to the Catskills in 2012.  I visit the original Roco's every time I visit south Florida. \n\nNeedless to say, I was thrilled that you are now in Brooklyn. Today I took the three hour journey from the Catskills to your Brooklyn location.\n\nI was so exited to see that you captured, duplicated, and even outdid the original!  I instantly told Zora (the girl making our guacamole) that I wanted a shirt.  I showed her a picture from 2012 of me and my now X at the original location. She said they didn't sell the shirt and was so great about it.  I went on to tell her I needed a shirt to make my X jealous and that I would gladly fill out an application to be hired just to get one.  Anyway we were all laughing and having a good time!\n\nThe manager Melissa then came over, as lovely as ever.  We went through the whole story again laughing at my obsession with your brand. My friend and I finished our meal when Melissa came out with two shirts, two $10 bonus dollars, and a desert!  By this point all the tables around us were conversing and having a blast as I kept pointing out the things I love about Roco's!  I was so happy I gave Melissa a hug.  I told her though I am in the mist of a divorce, she made me and the crowd around us smile and have a great time.\n\nThe food - fabulous!\nThe company - great!\nThe brand - better than ever!\nThe staff (Melissa and Zoro) - off the hook! \n\nI can't wait to return to the place that ignites that childhood joy within me. You not only serve food, you provide an experience that one can not forget!\n\nThank you - don't ever get so big you forget the brand that made you!\n\nAll the Best,", "author": "Marcus F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "A fun and inviting space with a good location. The drinks are good, the food about average. The guac is huge! I ended up taking some home. \n\nHad the Rocco's Tacos at the bar - basically a trio of tuna tartar mini-tacos with avocado and peach. Again good but undistinguished. Mostly I like this place for the atmosphere - they had a live band playing on a Monday night - and the consistency of the food. It's above standard generic Mexican. Nothing to write home about food wise but you won't mind  returning. \n\nGood times!", "author": "Susan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I've been here a few times - I love it here! The food is great, the drinks are awesome and the wait staff is fantastic! Tonight my friend and I were lucky enough to have an even more fantastic waiter named Jarren, who made sure that we were taken care of and good throughout our night here! :)", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "After hearing about this place from my sister that lives in the area we decided to head here for dinner on a Sunday when a bunch of our family was in town.  When we first walked in i really enjoyed the ambiance of the restaurant. The place was not too busy and we were seated quite quickly. We had 14 of us and we were able to separate the bills into smaller groups which was really helpful. The staff was very friendly and we got our free tequila shot that you get when you check into yelp. The reason I gave the place a 3 and not higher was because the food was good but the amount of meat in the taco my cousin and I received was kind of a joke. There was two small pieces and a little cheese but nothing else. I did not complain at the time because my food had come out a lot later than the rest of our table and at that point I was quite hungry.   You can also order fresh made guacamole which they make right at your table and can be customized so that it is less spicy to please everyone. Definitely would try this place again but hopefully the tacos would actually have a bit more filling in them.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "Rocco's is accommodating to large parties and has some nice decor. However, it's supremely overpriced for mediocre Mexican food and cocktails, and the service is excruciatingly slow and spotty. There's nothing noteworthy here to merit revisiting.", "author": "George S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-03", "description": "This is not my fave place at alll. Only good thing here is taco Tuesday but it gets so crowded it's no fun. Have been here for brunch for bottomless mimosas which essentially means \"get one mimosa and bottomless glasses of orange juice!\" The food is mediocre. Not bad, not amazing. A bartender once gave me a hard time about getting a drink even though I was clearly of age...just avoid this place.", "author": "Bernardo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "Very disappointed with this place. I read the previous reviews and I was looking forward to eating  here but I was very disappointed with the outcome. I wanted to take my mom to a nice dinner so we picked this spot. Of course there was a wait, we were told it would be 35-45 minutes, and I thought ok, we will wait. So over an hour later, we finally got seated.\nWe ordered the table side guacamole, and that was prepared in front of us, very fresh and tasty. However when it came to ordering, we went with tacos. The tacos cost between $6.50 and  $8.00 each depending on what meat you pick. So I'm thinking they must be nice portions, so I ordered two steak and my mom got the shrimp. About 15 minutes later our \"food\" was brought to the table. For $8 per taco I got one piece of steak that about 1 inch long and, that was cut in two pieces. It looked like a rib tip or something. The toppings were minimal, two strands of lettuce, about three cubes of tomato and some cheese that looked like fetta. My mom got two shrimp that were about the size of a nickel. \nWe didn't even touch our food, there no way I was gonna pay $20 for three snacks, that were supposed to be a meal and it was prepared sloppy. \nThe service was decent, but I will not be back.", "author": "Jenelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Enjoyed this place a lot!  \nThey mixed guacamole in front of our table! awesome! :)) all dishes was very good! \nMango Margarita's my fav drink there!", "author": "Erin .."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "We went for St. Patrick's day to grab a drink. We sat there for 15 minutes without any service. When the table next to us got seated, they were greeted within 5 minutes. We decided to tell their waiter that we never received service yet. He responded, \"I'm not your waiter.\" \n\nHe could've easily said, \" let me get your waiter for you.\" Terrible service. Smh!\n\n\u0026 it wasn't even packed or low on staff. I saw several waiters.", "author": "Brittany G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}