{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-19", "description": "I am currently standing in the waiting area as we speak. Seriously the worst customer service. This place could have five stars if they had any idea about the restaurant industry and what good service is. They have taken 15 minutes to clear and reset one table. As they have multiple people who have been waiting for at least a half an hour. The food brings me back here but now I don't even know if that is worth this service. Maybe if the hostess wasn't so rude I wouldn't be so willing to slam this place on Yelp right now.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Food and service was excellent. Ashley and Isaac were great. Isaac makes excellent guacamole. The  California fish taco was Delicious.....", "author": "Robyn L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "Wait persons were GREAT and the margaritas were good. But the food was AWFUL. THis is not TRUE Mexican food at all. As another commenter mentioned, the food was sweet, in the sense of sugary. I had beef tacos  with rice and there was some kind of sweet sauce in the tacos  that I have never before encountered in Mexican food. Who wants sweet tacos and rice? Yuk. This is Mexican food for children  (and the place was packed with super young corporates or corporate wannabes who don't know what Mexican food is at all. Chicken was tasteless and guacamole too. No flavor at all.\n\nIt's a really young crowd, kind of a TGIFs with faux Mexican style,  very loud, young professionals dressed up, impressed with themselves, and taking selfless. If the food was good I could tolerate the scene, but this is Mexican food for adolescents.I only want sugar in my dessert, please!", "author": "Annie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-23", "description": "Sometimes you need to have a terrible eating experience to remind you what a good experience is like.\n\nWe had 10 people for lunch and we were seated on time.  As we approached minute 60, we had not received our meals.  When I pointed it out to a manager, he shrugged, \"Well, the ticket only says 25 minutes.\"  Does that mean the waiter sat on it for 30?\n\nI then went to visit a former colleague, who was seated before us.  Two people at her table had already finished their meals and two people at her table had not yet been served.  I walked away to avoid getting caught up in their anger.\n\nAmongst our group, we ate every type of Rocco Taco on the menu.  The overarching opinion was, \"It's edible.\"\n\nIf you'd like to have a taco that's edible, you know where to go.  Bring some reading.", "author": "Jeremy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "My 1st there was last night. The ambiance was great, waitress great, food delicious but the hostesses were not good. After being told myself \u0026 my sister (just 2 of us) couldn't not be seated because there is a reservation \u0026 a waiting list we had to go on a list. They don't take walk in basically. I was told by a manger \u0026 1 hostess that we had a 35 min wait \u0026 once we received the text we could text back ok. We got the text, texted back within the allotted time we get inside \u0026 the girl have our table away because she didn't get the text. So now we have to wait additional time. This was very disappointing to me. If they have a text system it if a text is not received you have to work with the patron.\nMost of all i enjoyed the Cadillac Margarita..DELISH! My family seems to love this place but I'm not sure if I'll be back. I don't like the hassle just to eat, especially coming from Long Island on the train.", "author": "Leigh G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-27", "description": "Big pitcher of patron margarita $30..you get about 4-5 drinks which is not bad at all...tacos are OK not the best but OK...it is pretty big in there..upstairs and downstairs space..the bar upstairs is humongous!!! Pretty decent crowd...", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-18", "description": "Not authentic or tasty food. \nThe atmosphere is terribly it's a gigantic corporate cluster, with a chain like feeling.", "author": "Rose K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "I had a pitcher of margarita which was only $30 and gave us about 5 glasses of margarita.\nand the server David was super nice and attentive.\nOverall, reasonable price, good food and drinks, nice atmosphere, amazing service most of all.\nDef coming back to get the pitcher of margarita :)", "author": "H K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "The service was great for brunch. I really enjoyed the huevos divorciados. There was a nice layer of retried beans dividing the egg and tortilla. I'll definitely be back.", "author": "Eloy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "This used to be Morton's Steakhouse which was a favorite lunch spot of the local businesspeople set (including my father) so I think everyone was a little mystified when this totally unheard of (Florida-based) Mexican chain decided to open in the same spot. With that, I recently met my father for lunch in Downtown Brooklyn and he suggested Rocco's Tacos (surprisingly) and I being one who can eat Mexican for every meal said \"sure, why not?\"\n\nFor starters, I have to say this is the nicest looking Mexican restaurant I've ever been in. Seriously, I was looking around at the beautiful décor, light fixtures and finishes, and thinking \"wow, this must've cost them a fortune.\" Anyway, it definitely lends to the fun atmosphere here. The menu itself presents an interesting, if typical offering of Mexican fare including tacos, burritos, tortas, some plates, etc. and of course guac, prepared tableside (the famous and now seemingly ubiquitous upsell at every Mexican restaurant on earth (also why does it always cost $14!?)). Since it was lunchtime and I wasn't feeling like a coma-inducing burrito, I chose the spinach salad with honey-lime chicken which was (surprisingly) good. They might be doing a little bit of the Cheesecake Factory effect here convincing us that the whole is greater than the sum of its parts with the huge portions, but that helps. Seeing a lot of their more typical Mexican menu offerings pass by (burritos and such) makes me want to come back.\n\nFor the lunchtime crowd, service was fast and friendly - the waitress kindly comped us a basket of chips and salsa since our drinks took a while to come, and even those were great. The atmosphere here was fun and the prices are very reasonable. So, farewell Morton's and steak because Rocco and his tacos are here and I'm glad for that!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-07", "description": "Big, loud with gigantic, gaudy lighting fixtures throughout - loud because the lousy music being played was just too loud.  Want music like that, go to a club.  \n\nBefore we even got our coats off, two, not one server appeared to talk about the wonders of the table side made guacamole. \n\nHadn't completely sat down nor looked at the menu yet but I was being sold the $12.50 guacamole, which we ultimately declined because I watched this being made and it is 2 avocados with some cilantro, lime and some other item - (and saw the guy throw out 3 bad avocados before he came upon one he could use) - $12.50?  No.\n\nWe each had a wet burrito with pork - not much pork, overflowing with rice and, not very wet (very little of the sauce that was the \"wet\").  The red  sauce is strangely sweet, no heat or spice to it and when the salsa came out it was really nothing more than a dish of finely chopped tomatoes with a few specks of cilantro that you could neither see or taste.  Literally no taste to the salsa and again, zero heat. \n\nAsked for hot sauce - and also weirdly and unpleasantly sweet vs hot.\n\nThen there's the oh so peculiar decision to install televisions in the toilet stalls which makes a world of sense, especially for women with the TV behind them and who wants to watch even 10 seconds of television in that environment?  \n\nToo bad they didn't take that wasted amount of money and use it to install self-flushing toilets.  That technology has been around for eons and there's no excuse for new establishments to have flush handles for everyone's germs to pile up on.  The overall condition of the bathroom did not evoke a feeling of cleanliness in any case.\n\nI like restaurants that trust their food to be the selling point and I don't mind whimsical and clever atmospheric touches if done without overpowering all else, but between the awful blaring music, absurd bathroom nonsense and the odd appearance of a clothespin that comes with your check - this place is trying too hard and they would do better to focus on the quality of the food.", "author": "Lee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "Drinks were really good however the bartenders upstairs are unorganized. I ordered tacos that never came but someone who ordered the same as I got there's. Really annoyed by this", "author": "Torrie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-17", "description": "Food seems good but just can't enjoy the atmosphere because the loud obnoxious music is overwhelming and destroys all thought and conversation. Get rid of the DJ.", "author": "Byram S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-13", "description": "It was okay. I spending $5.00 on a taco is a bit much. I can get them for 2.50/3.00 in many other places. The margaritas were good too but light on the alcohol. The atmosphere was great and i loved the selection of tequilas in the small room as you enter ( was probably the best part )", "author": "Maribel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-17", "description": "Great option for those stuck over by Metro Tech. Good atmosphere, great guac and drinks. \"Taco Tuesday\" is a loud, busy night with a DJ. Has a great private room, in addition to some more private seating/bar area downstairs.", "author": "Kate H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "Besides the food being bland and unseasoned the decor is beautiful. Unfortunately I would not recommend this place to anyone else after my last experience there. My friend and I have been long time customers to the restaurant and bar ever since it's opening in New York City we've even met Rocco himself who was a wonderful man. Sadly our last experience at Roccos in Brooklyn was so unprofessional and rude that we will not be returning. Today we went for taco Tuesdays and margaritas where we were not carded or asked for any form of identification, after having an unseasoned but reasonably priced meal we decided to return that same night for desert after work. The waiter whom could not get our order correct the first and second time seemed to not know what he was doing due to the fact that it was such a crowded night. The waiter brought me my desert and my margarita after a long wait while my friend sat with nothing, as I decided to start chowing down before her she took a sip of my drink. Just as her mouth touched the straw the extremely rude store manager named Paul snatched the drink from her mouth and walked away. In shock I went to go find him to ask what the problem was he stated to me that we were underage and to get out of his store and never return he then proceeded to call the cops!! I am of legal age and had proof and had also been there that day when I asked him to bring me my receipt and name of the waiter who did not card us he refused. Never in my life have I been in an establishment where the store manager treats his customers like dirt! Even his own staff apologized to us because of his rude behavior. This place needs to seriously investigate and train their staff because no paying customer should be harassed and humiliated by Paul.", "author": "Ria H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "The food isn't that flavorful in my opinion and the margaritas were watered down. The menu gives you plenty of options. I had the guacamole with fruit (pineapples, watermelon and strawberries) but it didn't have much flavor. I could have done without it and the watered down prickly pear margarita. Eh, I love mexican but I'll pass on Roccos. The atmosphere is enjoyable tho.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "The quesadillas here are great. Also Curel the bartender is super sweet and great to chat with, to be honest he's one of the main reasons I go back for brunch and happy hour.", "author": "Casandra V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "I get down with Rocco's Tacos. It's my go too if I'm ever in the area and craving Mexican cuisine. The decor slays! You're totally mesmerized by the elegant chandeliers hanging from the ceiling. in the past, I've tried the sangria and that was solid. I almost always sit at the bar and I'm more than content with the service. The bartenders are awesome! They're quick, efficient and super helpful when it comes to offering suggestions, etc. on the menu. This time around my friend and I stopped by after an Ikea trip. It was 7PM on a Sunday and the restaurant was kind of empty. We ordered chicken nachos, I had a seltzer, she had a sangria. The nachos were flavorful, but the chips were kind of burnt. We also wished that the toppings were mixed in more thoroughly. I found myself have to de-plate and rearrange the entree. On my previous visits to Rocco's, I've had the steak quesadilla and that was actually perfect! Maybe they were just having a slow night on that Sunday!? Either way, Rocco's is awesome! I'm sure they'll see me again soon.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "I went here for my fiancé's birthday. All together we were a party of 9. I made reservations for 6:30pm. We arrived right on time and were seated within 5 minutes which was great! However our server that night, her name was Keisha, was awful!! She messed up our order.....we ordered a margarita pitcher which ideally would come first but it did not. I think she forgot about it because she didn't go get it until I mentioned that we didn't have it yet about 15 minutes later. The food order was wrong and she even brought out a dish that nobody even ordered! We were very unhappy with the service. I did however like the fact that the manager came around to our table to ask how everything was (and she complimented me on my dress!) And I saw her going around to all the tables just to make sure everyone was ok which I thought was great. But besides the awful service, and the noise level because it's definitely noisy as hell in there, the food was good.....and the place is nice overall. If I was to come back it would probably just be for a quick drink at the bar.", "author": "Kim D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}