{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-29", "description": "This place was so packed. I swear everybody in Brooklyn was there. (I say this because I saw like 6 people I went to high school with in 10 mins of each other). So my friends and I were told it was gonna be a 45 min wait for a table so we decided to hit the bar. They have two bars, one upstairs and one down stairs. It was obvious that the upstairs bar was crowded so we went downstairs. It was a tiny little thing but it served its purpose. I had a pineapple margarita (yes its my fave drink, give it a try) and it was ok. My friends drink was horrible. She had to get a new one that how bad it was. The food was ok, it could have been better. I'm gonna say the busy night is what made it hard for them to rise to my expectations. I'm willing to give it another try just not on busy night.", "author": "Sunny D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Today I   felt  like  celebrating ,  and the amazing  staff  at Rocco's made this day a special  in day for  me . Trevor my new favorite  bartender  ever ,was friendly and attentive ,  but most of all he gives this place the felling your  neighborhood  pub with a healthy  touch of class. Oh, yes the food is most awesome !", "author": "Maria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "I love this place and what Rocco has accomplished in his lifetime.  Great food and great scene.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "Stay at the Marriott next door regularly. Terrible food, terrible service, not at all like the south Florida locations.  Avoid this location, but you will love Rocco's in Boca.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-07", "description": "What horrible people! The hostess tells me to pick a seat anywhere in the bar area (as I was alone) then after sitting 20 minutes without service, another hostess tells me I have to move to make room for a larger party. Screw you. I will never be back.", "author": "Rocket M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "I had a great experience here on a Saturday night! Patron margarita is good but do not get the pitchers (very juicy) foods great atmosphere is cool and the \"tequila bible\" is cool... Nachos are on point and their spicy beef tacos are amazing!", "author": "Jay V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "This place is Awesome! ! Especially for Taco Tuesdays! ! Beautiful decor,  good music,  great crowd \u0026 the bar tenders are awesome! Definitely bringing my friends here!", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "Bland mexican food. Food came cold, and no apologies were given about that. Slow and unfriendly staff. So disappointing !", "author": "Arielle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "I really Love this place, I have been there twice with family and friends and had a great time. Good food and atmosphere and LOVE their Margaritas!!", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "Went here for date night with my fiancé. We both ordered multiple tacos and a few drinks. The steak tacos were amazing. The chicken tacos were good, but no where near as good as the the steak. Our margaritas were very good as well. The made table side guacamole was the best I have ever had. We eat guacamole often and make it at home as well. Theirs is by far the BEST. I can't wait to go back.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-22", "description": "Went with a group of 10 for lunch and was very disappointed. Service was super slow, we waited an HOUR for tacos and other basic entrees! There was at least a 5 min gap between when entrees were brought to the table (they came two at a time), and when dishes did arrive they were COLD! My enchiladas were pretty awful, they may have tasted better warm and fresh, but I was basically eating leftovers, they weren't even lukewarm. Table side guacamole was fine (two stars for fun decor and guac) but not worth coming to the restaurant for. I won't be back. Plenty of better taco places in Brooklyn and New York.", "author": "B H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "So disappointing. We arrived at 4:00--a group of 10 colleagues for Happy Hour. They would not let us sit at the high bar tables unless we promised to all order entrees. Finally they let us sit after letting us know that we could be taking valuable diner space since it was Taco Tuesday (which started at 7pm). The kitchen messed up our order 3 times. We waited forever for drinks and were never asked if we wanted another. The tacos were good. The guacamole was very good. But all in all it was frustrating. We will be looking for another place for happy hour.", "author": "Danielle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "I was out of class kind of early today, decided to meet up with my boyfriend, and have lunch since we were both on campus and had collectively decided to skip breakfast ( aka we overslept and couldn't afford the luxury of breakfast). He suggested Panera Bread. Instead of taking the basic way straight ahead down Fulton, he swear he knows short cuts to everywhere and he took us on this every lasting long winding walk down Hanson place. I saw 5 guys, metro café, chipotle and au bon pain. I was hungry and dying! The last thing I knew I looked up and to my hungry delusional mind I saw the holy grail...that one word...TACOS!!..ok ok and Tequila...*hangs head in shame* Anyhoo I liked how festive the building looked, it was colorful...or at least the bottles of Tequila was and I decided I wanted in. My boyfriend was hesitant until I gave the argument of all arguments... \"C'mon you cant mess up a taco\" He couldn't dispute that and we went in. \n\nAmbiance inside was very pleasing from the glass liquor booth display with the skeleton all dressed up to the right as soon as you walk in, to the wooden accents, and large picture windows. We were greeted instantly ( a plus in my book), we were early so we were seated near one of the huge windows (we arrived about 11:30a) and immediately the waiter came over and offered us some water while we gave the menu the once over. It took me very long to digest the menu because although it was sectioned off by groups ie appetizers, corn tacos, enchiladas ect. The headings were written in Spanish which I am not fluent in and I struggled a lot. My boyfriend has somewhat past a basic understanding so he helped decipher some of the categories. I get the whole Spanish theme but it was troublesome. What I had to do was read the description of the item which was in English instead of the name of the items being in English. I got pissed at that too because, dude what the hell am I reading a description to? corn, onions, lime salsa, hoison beef and rice on what sir? A donkeys ass perhaps?\n\nI ended up throwing caution to the wind and ordered what he ordered which was called \"Wet (insert Spanish word for burrito....was it Tortas?..yes! Wet tortas of some sorts - Spanish word)\" and I had mine with pulled pork which they should have called pulled heaven because that was the best thing I have ever eaten(taco/tortas/whatever its called - wise) and I added their cocoa cola that was claimed to be made with Mexican cane sugar. Everything was delicious. The food came out quick, not a long wait at all. Plate came out steaming hot, with 3 single scoops of condiments (sour cream, guacamole, and salsa) and I hate Guacamole but that was so bomb it didn't have a chance! Needless to say It was so good I ate the whole thing and I'm surprised because that thing was stuffed to the brim with red rice, meat, and beans, drenched in sauce and melted shredded cheese.\n\n I would definitely return and hopefully get to try their drinks. As tempted to give in to my inner lush as I was, I skipped the margaritas since it was nowhere near 12...or 1...or 7pm. You would not be disappointed with the food nor its atmosphere. I even ventured downstairs and was surprised to find among the restroom with TV's in each stall, there was another larger dining area and a second bar. This is a good change from the eateries in that neighborhood and I think that's the key that will keep this place around for a while. I urge people to go and try the food. Its very affordable. 2 of those burrito-tortas thingy and two sodas with tax was roughly 35 dollars. Keep in mind portions were huge so its well worth. Enjoy!", "author": "Imagine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Went with my mom on an early lunch date and our server Albert was excellent! Courteous, prompt service and a simulating atmosphere.. We will definitely return again.", "author": "Erica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "If you like texmex this is probably a good place for you. We went for a quick bite but the waiter forgot to enter our order so we waited around 45min until it was finally done. Aside from the unhealthy options and bad experience, i would say they have a good selection of tequila so you might want to order some to keep you entertained!", "author": "Mr. G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Came for lunch and very happy with the menu selection and food. Next time I'm deployed to this area for work I will be eating here again. The staff was super friendly and helpful. I really wanted to try a tasting of the different tequilas they offered but I was on the lunch from work. I don't think my employers would approve me coming back full of tequila. But the next time I'm visiting this office I will be going back there afterwork and trying a little bit of everything.", "author": "Q Malik F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Great place to relax and chill out after work...I went there few times  with co workers and it was fun. their food is good , their customer service was great...1time I went their guacamole was not as good as the last time  I tried but I guess it depends who makes it...lol  and their margaritas and mojito was just perfect... Try them out.!", "author": "Viviana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-24", "description": "the food isn't that good. it's food for drinkers who don't care about taste. drinks are good but one bartender in particular is rude. I bought a first round and went back to get another round at the bar, this female bartender asked \"are you gonna tip this time\" she was tipped the first time around. I've never went to a bar and had a bartender asked me that.", "author": "Shaun H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "I have been wanting to come here for a while, as I love Mexican food. We went on a Saturday evening, right before the Saturday evening rush. The staff was very friendly and we were seated right away. The decor is very nice and the place is very spacious. You are NOT seated on top of each other, plenty of room. They make the Guac in front of you. It was just Ok. Mine is better. The drinks were pretty good. The food was OK. Commercial Mexican food, not authentic at all. After 7ish the lights dimmed and the music was turned up. DJ was realllly good. I would go back because it is a cool fun spot, but if you are looking for reallly good mexican food, nahhh the food is just ok....Not bad, but ok.", "author": "Kisha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Great Bar, great vibe, and best of all Great food. It all looked good but I had the tacos. The pork, chicken, and steak tacos are fabulous. Fresh, simple and delicious ingredients.", "author": "David K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}