{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "A group of 4 friends and myself came here one day for lunch.  None of us had ever been.  We started out with the guac, which is made at your table.  Awesome service and it's fun to watch it being made.  It was great and just enough to split between the 5 of us.  No one ordered margaritas, as we were on our lunch hour.  Next time.  Our meals came shortly after and everyone was very happy.  I had the chicken tostadas.  They're like rolled up tacos and then deep fried.  They were presented beautifully.  Served with a sauce that was a little on the spicy side.  I would order this same dish again.  It was only $13, I believe.  It came with 3 rolls.  My two of my friends had the steak quesadilla, which was huge; and the blackened fish tacos.  No complaints from them.  Table service was average, nothing to complain about but nothing to rave about.  I will definitely be back when I'm in the area.", "author": "J K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "Loud Loud Loud dance music.  Big afterwork crowd.  I guess the alcoholic beverages are priced well to make up for the mediocre food.  The Pollo Asado was a total bore: 2 chicken breasts topped with chimichurri sauce.  A large portion did not make up for the snore-dom.   Although the tacos were well priced, the main plates were not (fajita-thing is $22 per person).  So much better food at Mezcals (without the thumping music or steep check).  I imagine this is a great place for revelrie, large groups and drinkers.  This is not a destination for fine dining.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "The margaritas were strong! The guacamole is a fav of my friends and I. Shrimp tacos were pretty good and everyone enjoyed their food, pork enchiladas and chicken Flautas. Happy hour on Saturday was $2 off drinks at the bar only .", "author": "Lori B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "I love this place! \nIts a big restaurant for sure- lots of tables and slightly seems at first like a Mexican Cheesecake factory .. though Roccos has a uniqueness to it and really fun staff. \nLove the drinks - table side made guac and the dishes we got were excellent. \nDefinitely a fun time to go for a drink or a large party !", "author": "Virginia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "I went there with my sister to relax for before the big GRE test. As soon as I walked in and I was amazed by how many good-looking gentleman there were. My sister was already sitting our the table and no more than two minutes later our server walked up and introduced himself. It was a really good experience the food was great, we ordered guacamole and they had this guacamole tree in the middle of our table I got came over with a cart of fresh guacamole and a bunch of other ingredients he made the ball in front of us and that was really nice. I had Floutas, it cost $12 for 6 and it felt really expensive but only because I wanted more.so we added 2 more orders. The manager came over to the table at one point just to see how we were doing and that was great. Overall I'm going back there next week after work.", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Living around the corner, I've been interested in trying this place since it opened but a little wary given the mixed reviews. We finally decided to roll the dice and I'm very glad we did! The food was great and what we ordered came in huge portions. We definitely ordered way too much for two people and went home with lots of leftovers. The tableside guacamole is a must! Everything was delicious and fresh, both our server and the guy making the guacamole were so friendly and the bill was really reasonable given our drinks and the amount of food we ordered. We will definitely be back!", "author": "Renee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Came with a friend this past week after wanting to try this place for a while. The drinks are strong and decent sized so I don't mind paying ten dollars. Plus you get a check on offer for a free shot so you can spike your drink even more. I wanted the taco salad. Mine didn't come with the beef in it even though it was supposed to. I asked for it on the side. It was really good and filling. The decor is trendy considering the surrounding area. I can tell it probably gets busy on weekends. I would love to come back soon.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-13", "description": "Enjoyable atmosphere, waitstaff was very friendly and accomodating..Nachos were a little on the well done side..but that was ok it added to the flavor lol..margaratas arent as strong as i had hoped but they were still tasty..will be back to try other items on the menu..dont forget to collect you free tequila shot with every Yelp check in..", "author": "Dee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Nice place to enjoy a drink and some Mexican fare. Those Rocco's chips with Rocco's spice is wack tho. Servers are nice. Decor is beautiful. But nacho libre in the bathroom is a bit much.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "Was pleasantly surprised. .excellent addition to the area....food was amazing had the half size nachos and shared. ..we both were satisfied so you know size was genorous. ...drinks were tasty ...not a fan of tequila but the margaritas were on point.....definitely a must return and become a regular. ....", "author": "Erika R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I absolutely love Rocco's Tacos, for the drinks, the food and the atmosphere. It's an awesome place to come hang out after a rough day at work, or when you and your friends want to link up for good food and drinks. But what makes me love Rocco's even more is the bartender Curel. When I say he is awesome, I really mean it. He's one of the main reasons I frequent Rocco's Tacos so much. He makes my visit to this establishment that much better. As long as I can order a Wet Burrito Con Rojo  (w/ chicken) and have Curel make my Watermelon Kiss Margarita, I'm a happy camper!", "author": "Cupcake S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "Good music. Good drinks. Ok Mexican food. \n\nThis is NY/east coast Mexican.  Good option for down town Brooklyn.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Had such a great time here at Rocco's. Bartender named Curel and he was awesome. So welcoming and spot on with his drink choices. I couldn't decide what to drink but he asked me what I normally like to drink and he made me the most delicious drink. Definitely would come back just for Curel.", "author": "Faustine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Went with a big group. I got California Fish Tacos (3 battered and fried mahi mahi tacos with traditional cabbage slaw and avocado ranch, spicy white rice, black beans) -- very tasty, nice combo, not heavy at all. We got both the Strawberry and pineapple guacamole and the original one to share -- both were surprisingly good! I loved the sweet tone of the fruity guac! And they make it right in front of you like art. It was K.C's 22nd birthday too -- so they got her a chocolate cake on the house. The service was very nice and welcoming. Loved their bottomless mimosas (only $12 extra) -- really got a kick, pretty strong drinks.", "author": "Wanmeng Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-07", "description": "This place deserves 5 stars, food is outstanding \u0026 most of the employees are really nice. The reason they get 1 star is having 2 really nice bartenders \u0026 2 total pricks. I sat at the bar 3 nights while visiting, I pay cash so everyone asks to hold a credit card. It was so loud Taco Tuesday I ordered \u0026 I told the dick I was paying cash you can charge me as we go, he gave me his piece of shit look \u0026 rudely said I asked you what kind of meat you want. Like I said if you don't mind running into a prick then definitely go here, I tip how you treat me 15% for dicks nice people get 30%", "author": "Stan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "The staff was not too observant of their guests and we sat for a little while. Ordered frozen strawberry margaritas and I kid you not it tasted like a strawberry smoothie. There was no kick to it and was very sweet, where's the tequila? She did give us the extra bit that did not fit in the glasses. So that was nice. We had ordered chips and salsa which the waitress forgot to put in the order and we had to remind her. The salsa...was just a plate of diced up tomatoes. It was okay, probably won't go back or recommend this place.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Really fun atmosphere (think Mexican Day of the Dead) with prompt service (willing to explain dishes in minute detail) and delish, fresh food. Do try the table side preparation of guacamole and the Mexican grilled corn. Fantastic selection of tequila to peruse... Conveniently located right off of Jay Street Metro station by Marriott Brooklyn Bridge.", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "The food is surprisingly very good. I give 4 stars to food and 2 stars to the service.  Bartenders don't care about their customers. The place is not very clean. We came around 9:00 pm on a Friday night. It was very crowded and by 10:00 pm people started to leave. It would have been an awesome place ,if the customer service and maintenance of the restaurant were proper.", "author": "Guzal R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "I Love their NACHOS ! But their drinks could be better other than that cool spot to hang w/ friends or as a lunch date !", "author": "Cassandra J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "I was determined to not like this place. Given it's location I assumed it would have bland chain food and indifferent service. Stopped in for lunch and discovered I was wrong on both counts. Ate at the bar and had the Mexican Cobb Salad (bold, no?). Did I mention I expected it be bland? It was actually flavorful \u0026 fresh, with the chicken being some of the tastiest I've ever had. I'm sure there are better and much more authentic choices around, but this is a solid choice if you're in the area.", "author": "Rob C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}