{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "I think the negative reviews are just because this place gets busy and you can easily \"get lost in the shuffle\" with your server.\n\nThe food is good, but the tableside guac is overpriced and overrated. Still order it, because you're at a Mexican restaurant, but don't prepare to be \"wowed.\"\n\nThe empanadas are good and so are all of the tacos. Can't go wrong!\n\nFun environment and has the space to accommodate large parties. Would suggest making a reservation on the weekend.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Just had the most amazing brunch at Rocco's today.  Found out the owner is from happauge Long Island which is where I grew up. Glad we could give to one of our own. \nGreat food.  Great drinks. Great staff", "author": "Table H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Went to Rocco's last night to have dinner with my friend. We got there and the place was already packed, the host let us know that there would be a 20 minute wait and they would text us when a table was available.\n\nWe got seated and our server was bibiana, she is so little and cute and her service was amazing! Now on to the drinks. We had the Roccorita pitcher, too much ice but it was 2 of us and that was basically 4,drinks each for a 29 pitcher! You can't beat that. We were nice!\n\nYou must must try the guacamole, its made fresh right at your table and it was amazing. My friend had the chicken enchilada and I had the chimichanga I believe, the portions were huge we didn't even finish all of it. I would most definitely go back.\n\nOhhh the ambience was so nice, TVs in the bathroom stalls how cool is that. The lights were beautiful throughout the restaurant felt like a real authentic Mexican spot.", "author": "Da D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "This place is amazing! From the pitcher margarita's, to the homemade guac (IN FRONT OF YOU), to the tacos, this place rocks! Especially on Tuesdays!", "author": "Angela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "I was looking forward to the opening of this place since it looked really nice and seemed to be serving some good food. Finally I got to come here for lunch. The space is HUGE. They also have a basement floor that is equally as spacious (if not more) as upstairs. We decided to get the regular medium guacamole, the taco platter, and a three taco dish. The guacamole is made table-side but the highlight is actually the chips! The chips come in a big basket and is seasoned. I can probably eat the chips on its own. I got three hardshell tacos with different fillings -- grilled steak, shrimp, and roasted pork. I'm not crazy about their tacos. The hardshell looked like the store bought kind. I thought they would've made their own. The salsa is a little strange. My coworker also commented on the pickled onions that changed the whole taste profile of the salsa and she is a salsa connoisseur. It was definitely more tangy than anything. Not something I'm used to either. As for the meat, the roasted pork is the best. I had too little grilled steak to even taste it. The shrimp was a bit spicy for me and the ratio of shrimp versus salsa is not proportionate at all. My coworker got the taco platter which came with two tacos, rice, and salad. She got the ground beef tacos and commented that the rice, despite looking spicy red, had no flavor whatsoever. I tried the rice and she was right. There was no flavor; not even salt and pepper. \n\nI wouldn't come running back for the food but I would give it another try especially their drinks.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-20", "description": "Tried to go there with coworkers for happy hour. Place was absolutely packed.\n\nI waited 10 minutes attempting to flag down a bartender, who saw me multiple times and continued to ignore me. If this is the kind of service I can expect, why would I ever bother going back?\n\nLet's talk about the atmosphere: annoying corporate-types. Finance bros. Loud, obnoxious music. This place is absolute hell. There are some great places if you walk a few blocks towards Atlantic. Hell, I'd rather go to happy hour at Hill Country.\n\nDrink prices are outrageous. Margaritas range in price from $9.50 to $12.50. I think some drinks are more. You're a mediocre Mexican chain restaurant, not a fine cocktail bar in Manhattan/yuppie Brooklyn.\n\nTerrible prices, terrible bartenders, nonexistent service. No, I didn't get my drink, despite repeated attempts to do so. I won't be wasting my time with this garbage.\n\nAvoid, avoid, avoid.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "I thought it was pretty good for lunch.  The vegetables in my enchilada were tasty and my refried beans tasted homemade.  The tortillas were a little hard, and the service was slow. The ambiance was nice. I liked all of the lighting.", "author": "Bonnie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "OMG! Ambience is tasteful, I was definitely expecting this place to look different but it's beautiful! Celebrated my graduation with my family here and when the food came everyone was quiet, so you know what that means.... THE FOOD WAS AMAZING! Definitely will be coming back to experience happy hour at the bar next time.", "author": "Octavia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Bitch get the Brooklyn tacos they were AMAZING!! We also got the Korean tacos and omg they were both bomb.com honey.", "author": "Guero D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "I've been to Rocco's Tacos more than I could probably count lol.... that being said, the ambience is great! I like the theme of the restaurant and it is very spacious but can become crowded very quickly. The food is good, I actually have no complaints about it. Whenever I go, I usually get the half nachos, which are huge and some regular fries. Their fries are very very very good lmao I almost always get them. The drinks are good, I don't always get a drink when I go but I can't complain when I do. You should check them out for yourself to see if you like!", "author": "Nicco K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "The only reason I take off one star is because the bottomless mimosas are WEAK. You're basically paying $12 for orange juice and as it was 4 of us we payed $48 for our OJ. We had three rounds and two whole pitchers and NOTHING. Food however was great! Guacamole was yummy with the right amount of seasoning. The freshly made chips are TASTY and crunchy! A couple of us had the California fish tacos and these were delicious and plentiful. My mother in law had the Yucatan and she loved it. My husband had the Baja fish tacos and he enjoyed them as well but these could use a little more fish as they were a little skimpy compared to the California tacos. Service was exceptional. The manager came to our table to ask about our experience there. Would have mentioned about the weak mimosas but we were only a couple of rounds in. Will be back but not for brunch.", "author": "Nilza M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "The Five Stars are for the amazing, delicious and out this world margarita made by the awesome waiter Luis. The pitcher is also worth it, serves almost 6. The chips are fresh and crispy and there is plenty to go around. The place is huge, so we did not have to wait on a Sunday afternoon. \nPassion Fruit Margarita a must try!", "author": "Yasmine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "I have been here 2x and although the food and drinks are good the service sucked both times.  The first time the hostesses were rude and gave away our table. The manager comped us drinks for the inconvenience.  This time the bartender was unfriendly and seemed annoyed with serving me.  I knew what I wanted and waited while he closed out checks, leisurely got a take out container for another customer and talked to a customer while I patiently waited. I tried to get his attention when he was standing in front of me but no dice.  He finally strolled over after 5 minutes and asked how was it doing. \n\nHe tcook my order and the only other interaction was refilling my water glass without a word.  He seemed friendly with others but not me - guess I gave off a vibe, who knows!  His job is customer service to all customers unless people are rude to you which I was not. Iwill go again but make sure not to sit in his statbion.  Perhaps management will read this and check who was working on sat, 7/23 @ 5:30p; it definitely was not the guy with glasses - he was super nice!!!\n\nThe food is ok but comes out fast but 2x subpar service, perhaps better training of staff? Don't think I will go back.", "author": "Patricia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "This was a Thursday lunch around peak time (1230pm). We popped by here even though my colleague had a bad experience last week here: determined to try again and hope we can turn around the perception. \n\nThere were three of us - we walked in and took only a moment to get seated at a high-top table near the front of the restaurant (close to the bar). The place was trendy, \"trying-too-hard\" with things like a \"tequila room\" that probably is never used and statues or rhinoceros (because those are all over Mexico), The place was packed - lots of business suitsy types hovering over a water with lime.\n\nWe had the guacamole to start - it was pounded into perfection and folded some onions and tomatoes in - I would have loved more cilantro, but I understand some people don't care for the taste. I DO wish the person making the guac had asked us if we liked/disliked anything that was being added to it (in case there were preferences at the table) - instead she silently pounded away and presented us with a big pestle filled with green goodness. The chips were fresh - slightly salty and dusted with chile powder - you couldnt taste it but i liked the color it brought out.\n\nMy colleagues ordered the Mexican cobb salad and the pork enchiladas - I had the mole enchiladas. Coming from LA, Im a big fan of mole-done-right, and was curious if this place held up to the standard. The waiter (super awkward but really polite and sweet) - asked if I had ever had it before... because its \"a distinct taste\". I replied that I had and thanked him for being so considerate.\n\nThe food came out warm and relatively quickly - timing was well executed. Everyone seemed to enjoy their food - we had several offers to refill the water glasses and wait staff checked in at least twice during the meal... Id probably give more stars, but they were all just so awkward - lingering a bit too long or just randomly offering up statements like \"You know mole? No one ever orders that here\". Made me feel like maybe I was eating month-old sauce....\n\nThey had to be prompted for the check (even after packaging up the leftovers to go) and took a bit to cash us out - but overall the service wasnt as horrible as people said in previous reviews.\n\nNot something I'd recommend going out of your way for, but if you're in the area, it may be worth checking out as an option.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Love the table side guacamole and the drinks are super strong.  The food is a little bland and the menu is on the small side especially for burritos and enchiladas.  The guac, drinks and convenient location keep me coming back.  Definitely make reservations to avoid the wait.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "I went here for a little dinner with my boyfriend and he place was packed at 10pm but pretty nice. Music is very loud. That's the only con I have. Other than that, the food is tasty, and the drinks are so good. My boyfriend and I had lots to drink that night. Service was amazing. Our waitress was Zalika. Very nice and kept checking in on us. I enjoyed this place a lot and will be back here soon !", "author": "Starr Ann H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "From start to finish:\n\n(Disclaimer: I know some of the staff; however, my review will be more impacted by the amount of tequila I imbibe than the relations--promise.)\n\nWalking in the door, the environment is similar to other popular places. People talking, networking and drinking. Two large bars cover the far left wall.  Just on entry, the large display do the different tequilas and there are lots of them ranging from $6 to $400 with a perceived median under $20. The \"glass\" is about 2 ounces, just larger than a standard jigger 1.5 oz.\n\nWalking to the table, I see couples holding hands, curling up close to talk, what seems like a business team meeting, and large groups chatting. \n\nThe environment upstairs is on the loud side, not good for a first date, however, it would be nice for a following date where you are looking to talk into each other's ear and allow for physical contact. Very interesting chandeliers and lighting make a calming warm ambiance. However, the TVs distract from the romance, understandingly, it is a bar and not a place to go on your anniversary. To note, I was sat in front of the TV.  Other seats would be less distracting and their are plenty of two persons booths and four person tables, if this is your intent for a romantic date, just ask for a different seat or a seat downstairs.  The down stairs and bathroom are nice, clean, and very different from the upstairs bar environment. \n\nFirst thing ordered, the fresh guacamole and chips at the table is a nice touch. The Rocco's spice sprinkled on the chips gives a pleasant variation in taste and you can pick around the spice chips or look for the spiciest one! (To one reviewer previously, dude, it is their house spice... Not burnt spice, but, the house spice which makes me think of \"old bay\" the Baltimore, MD spice.)\n\nThe passion fruit margarita is sweet without being overly sugary. After the second glass, the salt is a nice addition to the rim to cut the sweet with salty. \n\nSaid by my friend eating with me, the ceviche del dia is delicious! As a vegetarian, I didn't try it. However, the smile from ear to ear is a good sign.\n\nMoving on to the entree and first tequila glass. I order the Dos Lunas Reposado. It is smoky with a nice nose, if you like scotch, you will appreciate it. It leaves a nice warming on your lips, mouth, and esophagus. \n\nAs for my entree, the vegetarian quesadilla is a large variation of veggies: squash, red onion, string beans, spinach, red pepper, corn with a few cheeses. Some play with the marinade could improve the flavor. However, if you like straight veggies without over complication, it is very nice. Each veggie if served as a side would be very nice, although, as a quesadilla, it leaves a natural flavor which restraining bias and expectations, is very refreshing and when mixed with the avocado blend, sour cream and tomato diced with cilantro makes the blend much more flavorful--yum.\n\nSecond tequila is a fragrant Riazul, it is sweet with a warming effect. Would act as a very nice after dinner drink or digestivo. Recommended on ice cream by our server, and although I didn't, I understand how pleasant it would be on the palette.  \n\nCost, left overs, and resolution:\nFirst, the cost is competitive for NYC at about $70 for two for dinner with multiple drinks (Id est  / i.e. pitcher and shots), appetizer and entree. \n\nSecond, the bagger didn't scrape the salsa, sour cream and guacamole into the to go container which was a fail. However, I did it as a test which I knew they would most likely fail because they would assume the food becoming wet with sides would take away from reheating and eating it later. So just request it if you want to keep the sides/garnish--the more you know!\n\nFinally, nice place, I would go again. Ambiance, friendly staff, food taste, food selection, and over all great night!", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "Came here for a Sunday brunch after spending the weekend in the city. Really good tacos, service was pretty slow which was surprising because it was pretty empty for a Sunday brunch. It was very hot inside because something was wrong with the A/C so they had the doors and windows open which was just warm heat so that made us want to hurry and leave, but the waitress didn't come by often. You must get the guacamole, it's made in front of you and the chips are seasoned with something delicious and are fresh and very crispy.", "author": "Cheyenne D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-03", "description": "Let me start with I'm Mexican and from California. I know what good Mexican food is supposed to taste like. THIS IS NOT IT. I ordered the enchiladas verdes (chicken enchiladas with green salsa). Where do I start... rice was undercooked and tasted like uncle bens; beans tasted like they came out of a can; corn tortillas were also under cooked so they were hard to cut and chew; chicken was too salty. Couldn't even finish the meal.", "author": "Lucy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Came here for a \"End of the Semester\" celebration a couple of weeks ago, and I'll definitely come back here.\n\nFirst, we had a large party (about 16 of us), and they accommodated us well. We ordered two pitchers, one mango and one passionfruit. The mango was good. I don't know about the passionfruit but everyone said it was good. We also had some chips and guacamole going around. Now, I love guacamole, but it doesn't love me, so I didn't have any. But the chips were mighty tasty.\n\nI ended up ordering a shrimp taco and a chicken taco, both were good. And I took some tres leches cake to go, which was AMAZING. Probably the best I've ever had. \n\nService was great. They took pictures of our table which I thought was nice of them. And in total we had about three servers in total helping the table, and they were all sweet. No complaints!", "author": "Alyssa A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}