{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "This is an upscale place that sells downscale food. Our meal was especially bland for the price that we ended up paying. I paid over $20 for a smaller than average enchilada. That's without a drink or appetizers! The waitress we had kept acting like she couldn't speak English when we were trying to explain what was wrong with one of our orders. \n\nWhen we first got here, we waited over 20 mins for them to put together a larger table (probably so they could charge us more). We had previously told them that we could be split up as well. \n\nIn conclusion, I would not recommend to anyone on a budget or to anyone trying to have a good time. \n\nP.S. there are T.V.s in the bathroom BEHIND the toilets. Like WTH? Are you supposed to turn around and watch it while going? Are you supposed to straddle it? When I saw this, it became stupidly apparent as to why their crappy food was so expensive.\n\n0/5 Stars", "author": "Brie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-08", "description": "Staying at the Marriott which is right next door to this place. Came over about 3pm for some food and drink.\n\nA real Mexican look and feel. Separate room for tequila tastings. We sat at the bar under an amazing looking chandelier. I sampled some tequila's neat. Excellent. \n\nWe got some food - nothing special. The guacamole was delicious and freshly made.\n\nService was fine.\n\nWe all liked it. I particularly enjoyed the tequila's on offer. \n\nMark.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "If there was a way to give this place 0 stars, I would...\n\nThe customer service here used to be tolerable but as of late it has become unbearable. The waitstaff, hosts and bar staff are very unfriendly. We used to enjoy this place, then we noticed the service and quality quickly headed for a steady decline. \n\nThe food is decent for east coast \"Mexican Food\"... not the best but better than most Mexican Food restaurants in NY. Overly priced but we would pay the money for half decent Mexican Food. The cocktails were always inconsistent, usually poorly made (even their \"top shelf\" cocktails at $14) and on many occasions have been left on the table because of how bad they were. On various occasions the waitstaff would blame it on \"new\" bartenders. This establishment must have a high turnover rate as I've heard this excuse on many occasions. This would happen often so instead of rolling the dice I would order a draft beer, can't mess that up... right? Wrong! The mug was dirty with a lipstick stain... they brought a replacement but it was bad. For a XX draft beer it was way too bitter and sour! Clearly they've never cleaned or replaced the draft lines from the kegs for it to taste of old stale bitter beer. \n\nThe straw that broke the camel's back was Taco Tuesday. You pay $20 a person but you can't take your leftovers home. This was the first time we were denied a carry out container for our leftover tacos. The bar back later explained that it's their policy to avoid people taking home 60 tacos.  Clearly he's not a math major because the amount you can order at one time is 3 tacos; in my case I had 2 tacos left. I would understand the logic but another rule to their policy is not sharing tacos, which a group next to us at the bar was clearly doing. So are you profiling your customers to justify your judgment call? Maybe it was the sta friends so they let it slide, who knows...\n\nMy girlfriend and I used to come in about twice a month. When we dine out we order appetizers, cocktails and entrees. On this our tab was closed to $100, which is our usual tab here, and they denied us a carry out container for our leftovers that ended up going to the trash. \n\nAs a person who worked in hospitality to put myself through college, I usually tip 30-35% because I understand the nature of the business.  Not in this case. How do you justify even 20% on a $98 for terrible unwelcoming unfriendly service. \n\nSee ya, Roccos!", "author": "Miguel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "This is just such a great spot. Brandon our waiter was just the best!!! The market veggie quesadilla is great and of course the guacamole is to die forrrrr. Ask for margs without sour mix!", "author": "Kamya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "your typical taco joint, serving up tacos and nachos with all the predictable flavor combinations you would expect. the veggie taco was quite good and food was fresh, but nothing stood out about the meal and service was average. you can also only get the happy hour at the bar, which was a little confusing since we were at a high table @the bar. good for big groups, more of a drinking/ party crowd.", "author": "Samantha W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "The table side guacamole is great, unfortunately this was the highlight of my meal. The best part about this place is the atmosphere, its huge and full of lanterns and cool mexican themed decor. I ordered the shrimp tacos and the skirt steak tacos, these cost a bit more than the regular tacos and were a letdown. The shrimp tacos tasted fishy to me, and I had to return them. Luckily, they took it off the tab. The quality of the steak was ok, but the flavoring was a little weird-vinegary almost. \nI can't complain about the service, it was decent enough. I didn't have any drinks but could see this being a fun place to gather after work as it was a very lively atmosphere and there wasn't an empty seat at the bar on a Thursday evening.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "Went to DUMBO/the Brooklyn bridge on a beautiful summer afternoon on a Sunday. As you can imagine, this area of Brooklyn is incredibly touristy and pretty packed, but it is one of my favorite views of the city so we pushed through it. After walking around for quite some time, I was very hungry and was craving Mexican food! I had heard about this place once or twice and saw it on yelp so I decided to give it a shot. The inside is spacious and nicely decorated. The service was excellent (both my waitress and the man making our table side guac were so sweet and helpful). Because of the area it is in, most of the menu is incredibly overpriced. The table side guac was very yummy and the flavors were perfectly blended (and it was obviously fresh it was made right in front of us!) We got a pitcher of strawberry margarita and splurged on the patron, it was very tasty, strong, but not too overpowering. I enjoyed my steak quesadillas and my boyfriend enjoyed his tacos I just wish it wasn't nearly $20 a plate for Mexican food. Nevertheless, we may return on a Tuesday for their taco Tuesday menu, cool vibes, and reduced price drinks!", "author": "Gabriella T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "The service was great, the food came very quickly and with delicious. Taco Tuesdays great prices!! Drinks on point, go see Mike the bartender he's the BEST!!!", "author": "Tasha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "Horrible, watered-down/no discernible alcohol margaritas, terrible \"queso\" that has no business associating itself (via its name on the menu) with Austin, awful, over-seasoned chips served with said melted smoked paprika-laden cheese concoction that no one in their right mind would call queso, overwhelmed wait staff. 100% inauthentic Mexican food. If you're looking for a bro-tastic place to drink virgin slurpees with a bunch of tourists, have at it. If you'd like real queso and a stiff drink, walk a few blocks down Willoughby to the House of Wax at Alamo.", "author": "Eliana E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-26", "description": "The service is good the guacamole is delicious but their chips and drinks are not good at all", "author": "Cesar O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "It's a really nice spottt the decor is really nice.the staff is friendly spoke ,and the manager was really cool .the food was ok the fries was very salty I had the special which was pork tacos it came with a side of yellow rice .my friends had chicken, steak n a chorizo taco chorizo had the most flavor. All the topping were a little overwhelming. I came with two friends so we order a pitcher we got a drink n a half out of a whole pitcher. The margarita wasn't strong at all barely tasted the alcohol or the mango flavor that we payed 3 dollars extra for.", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-05", "description": "Terrible service. Had to wait to be served once we were seated and apologiy upon apology just followed for the rest of the night for each mistake made by our waitress. What was supposed to be an alcoholic drink was just syrup. When I asked to take it back and requested a beer instead, it was another 15-minute wait for a bottle. My friend's steak was bloody when she specifically requested it to be cooked well. I the utensils were dirty so one of the other servers was nice enough to bring boiling water to our table, but this was yet another unnecessary factor. I can go on and on about how the experience was overall negative. I would not recommend this place.", "author": "Hilda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This place is delicious!!!  The margaritas are great, they are not too sweet.  My waitress was  attentive without being overbearing.  there are so many kinds of fish tacos I asked her for a rec commendation   _ it was great! so fresh and light. I cant wait to go back.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "A week after my failed attempt to try this place, I was invited back by management. I had originally made a 6:30 pm reservation, but showed up half an hour earlier. I was greeted at the front desk because my name was already on their list. I was assigned a nice ample table in the back, which I sat with my guest. Soon after, the waitress(whom I apologize for not remembering her name) was so pleasant with her suggestions about drinks and food, brought us chips and salsa. It was a very decent portion, which one must be careful because they are so good and sprinkled with some kind of spicy powder that you wont stop munching on them, and then regret not leaving enough room for the entree dish. \n\nWe had flautas as the appetizer, which were three flour tortillas filled with chicken and meat, respectively. Following this, I ordered the California Fish Tacos. I must warn you that this is quiet a well proportioned dish. This is what I had referred to previously regarding filling your tummy with chips and salsa, and not leaving room for more delicious food. \nThis dish came with 3 fried mahi mahi tacos with pineapple cabbage slaw and avocado ranch, spicy white rice and black beans. I asked for hot sauce, and they sure did provide me with one. Our waitress warned me about it, but I poured it on my dish. Nothing to worry because I was able to handle it. One tip on this, if you are not accustomed to having hot sauce, please be mindful with how much you do use.\n\nMy guest ordered the unlimited Tuesday's Tacos, and was able to savor different flavors starting from shrimps, pollo, cochinitas achiote, carne, carne asada y pescado. I heard nothing good coming from his mouth. \n\nOverall, my experience visiting this place for the second time was very different beginning with the great service received, food and the decor of the place. Did I mention that there was a DJ playing all 80's songs on a Tuesday night? There is no excuse to stop by on any time of the week, and give this place a try. If you happen to get to tipsy, the trains are right around the corner.\n\nI think next time, I will try the margaritas which I heard are very good as well.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "I forget how many great restaurants there are in Downtown Brooklyn MetroTech, but this probably makes the top 2. \n\nGreat atmosphere, attentive staff, great drinks and very good food. \n\nGuac is prepared in front of you and very good. Although the guy mashed it to death. Sometimes it's nice to have a chunky bite. Today I settled for a smoother guac.\n\nCalifornian fish tacos are just okay. Battered with little flavor. Pineapple salsa was weird. Need to apply hot sauce for some taste. \n\nThe Baja - Grilled fish taco, shrimp taco with the goat cheese and spinach quesadilla was good. Very flavorful. \n\nIf you're getting any of the regular quesadillas, be prepared to be full. Very full. They are stuffed to the brink and it comes with rice and beans.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Great ambiance! Wonderful brunch menu...Loved this spot!", "author": "Jesica L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-10", "description": "Very mediocre for the price. Wasn't really pleased. Chicken tacos were dry. Queso wasn't flavorful \u0026 Waitress was uninformed. The best part was the quick turnaround on food \u0026 that's always skeptical to me.Won't be in a rush to go back.", "author": "Errinn A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "I went to this location with my daughter on a weeknight. It's conveniently located near many trains and has a very nice atmosphere. The Ambiance is perfect for hanging out with friends and family, date nights, and after work drinks with coworkers. The wait staff and Hostess were all very cordial and professional. Our server, Zelina, had good knowledge of the menu and checked in with us several times throughout our meal to make sure we were having a good experience. For the prices, there was nothing extraordinary about the food. Honestly, it was overpriced Latin cuisine. However, the food wasn't bad and when my daughter and I mentioned to our server that we were unhappy with certain parts of our meal she brought the manager over straight away. Hector, the manager, was wonderful. He immediately heard our concerns and asked how he could make it better. Hector and Zelina did their best to ensure my daughter and I had a great dining experience and, thanks to them, we did. We'll definitely return.", "author": "Chastity N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "The environment was fun and energetic! My server Christin was amazing and hospitable. The manager Lakiba (maybe misspelled) was exactly what you want a manager to be in your restaurant!", "author": "Jeannice S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "This is the worst spot ever! The service was purely horrible! To make matters worse, they took my their because I was sitting at the bar and apparently it wasn't fair for the people standing. Who tf does that! Stay away from here!", "author": "Jose F."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}