{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-04", "description": "The food here is bland as hell. I ate a chicken quesadilla and it was very flavorless. Guacamole was watery and the pico de gallo tasted as if it came in a can. I try to leave pictures to go along with my ratings, but in this case I didn't even bother. Only 2 stars cause with tacos in a name I expected a lot more with the food. Mediocrity at best.", "author": "Shamorra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Great place for some Mexican food. They prepare and serve guacamole right at the table site. \nService was on point, waitress was super attentive. \n\nFull menu of all kinds of Mexican dishes give you a lot of to choose from. You can see a lot of office workers coming here for lunch as well as young people just exploring food options in the area.", "author": "Natalia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "This is a very good restaurant. The salsa has flavor but isn't very spiced.. it could be better if it had some more jalapeño or even Serrano peppers. The hot sauce that came with my food was decent flavor as well but was mostly tomato flavored. The atmosphere is phenomenal and that's why I would return. If your from Brooklyn area Aztec Soul on Atlantic Ave is much better food but not a good place to go out and socialize with friends! This is a great place to go out with others and have a good time. \nI had the pork taco platter. It was so flavorful (the meat was slow cooked) and my husband got the Baja platter the mahi mahi taco was decent but the fish tasted like fish not too much seasonings. The spinach quesadilla had some odd cheese but it was unique and worth a try. \nThe sangria was very good a bit too much ice in the cup though ;)", "author": "Anyssa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Without a doubt the worst tacos I've ever had.\nYou're better off going to Taco-Bell....it's that bad.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "I've literally been sitting at my table for 15 minutes so server no acknowledgment. The service is horrible and I haven't been serviced. \nIf no one comes I will walk out. \n\nYou should be ashamed of yourselves!!!! \n\nUpdate- after 20 minutes still NOTHING- my boyfriend purposely knocked his plate on the floor, it shattered and still NO ONE FLINCHED. Eventually out server came she was very sweet, our food was great as we knew it would be but the beginning just ruined our initial experience. Fire both of the hostess girls, they do not care about customers at all. \nThe one girl was \"off the clock\" but seated us and then said to us \" I'm off the clock so my co workers better tip me out for this\" \n\nThe other hostess was either on her phone or chatted with co workers and ignored customers. Hostesses are the face of the establishment and they should be held accountable for customers first impressions. \n\nWe spoke with a manager who said he was new and came from Florida. He apologized and gave us his card and to contact him when we want to come back- however there should be a manager present at all time observing the front of the house. \nRocco's tacos you are great and we've waited for you to open here in NYC but please re train all front of the house staff before they shut your business down.", "author": "Brittany P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "I have been here several times with my co worker and the food is pretty good... The corn was Soooo delicious the first time I got it. \nBut my next visit not so great, I was dissatisfied with it .... But I will still return because the service is good and food.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "I was celebrating my birthday week \u0026 was invited by some friends to check this place out. \nWe had reservations upon arrival no problems being seated. \nOnce seated first thing I usually do is check in  score free Tequila Shot sweet .. I love it when u get free stuff for checking in. \nDrinks we went with the Rocco Rita Margarita pitcher , Passion fruit ... Great choice this was very good , good taste \u0026 just the right amount of alcohol.\nTo start we went with the fresh Guacamole \u0026 Chips it was delicious prepared table side u can have it to your liking we went with mild \u0026 it was just right , great tasting with the warm chips perfect combo. \nFor our main meal we decide to go with The Chicken Flautas , The Steak plantain \u0026 beans Quesadillas plus the Korean Tacos. \nChicken Flautas were very good , good tasting meat wrapped in a flour tortilla \u0026 fried these were great \u0026 even though fried not greasy at all.\nThe Quesadillas were also good nice combo with the steak \u0026 plantains a bit too much with the black beans since it had a lot of it but pretty good over all. \nWe tried to switch things up a bit with the Korean Tacos good call on this tacos were amazing hoisin  BBQ beef w kimchi cilantro delicious combination. \nAs for the place itself very cool fun decor , loved all the decorations from the skull murals to the very cool \u0026 elaborate ceiling lamps. \nThe restaurant is very big two floors plenty of seating upstairs they also have a gift shop, below the area seems like it's more for private parties than regular dinning.\nNice bathrooms ,cool idea with the TV's \u0026 the Mexican cinema playing. \nI think they really want u to believe u are in Mexico because the temperature in this place is hot hot hot !!! No idea why but after the food, a pitcher \u0026 some shots plus a birthday shot I was ready to hit the beach \u0026 pass out !!!\nGreat food \u0026 drinks , good service \u0026 reasonable prices We really enjoyed our meal.", "author": "Ginette P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "I hate reviewing businesses because I understand the Restaurant business is tuff but..\nI went here with my Wife  on a Thursday night, the place was moderately busy and its a beautifully put together place. Our waiter was attentitve and helpful. Our tabletop was right next to the bar area which was full of people standing and literally knocking into our table and spilling our drinks. We ordered 2 margaritas and they were watered down soo much we had to say something. The manager was friendly and helpful and took the drinks off our bill thankfully. We ordered Taco's. What came out was poorly seasoned, dripping in some fluid not sure if it was oil or what \"tacos\". Probably some of the worst tacos I've ever had.\nThis place has the Location, Decor and Crowd its just lacking QUALITY.", "author": "Sky D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "I am one of THEE biggest Mexican food fans and this place just isn't it. Tacos were bland and just boring. Nothing to brag about. The chips and guacamole were really good and the portion of guac is HUGE. They should offer it in a small and large serving tho, it's way too big for two people (coming from a girl that could win an eating contest) . Probably won't be back, wasn't memorable.", "author": "Laurie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Me and my sister came here today. What a huge place. There's a large dining area and bar on the floor below!  We're not huge fans of Mexican food but this place was quite the delight. Our server was very friendly and accommodating. If you check in on Yelp you get a free tequila shot! Be sure to take advantage :P\n\nWe started off with the nachos. DEAR GOD WAS THAT HUGE?! We got the half size of nachos and we couldn't finish it among us two! Good nachos. Not enough salsa. I'll overlook that because of the huge portions. Nachos was merely $7.50. It could have easily fed 4 people. \n\nSis had the taco platter. I can't remember the exact name. But she loved it. Devoured both tacos and still had rice and salad leftover. Gotta say for the price the portions are great!\n\nI had the burger. Goodness was that excruciating to get through. We had ordered so much food! I had a lot of fries to get through. The strawberry mojito was delightful. Couldn't taste the strawberry but I'm a huge sucker for mojitos. So I didn't care.\n\nOverall great time there. Super chill and friendly staff. I'd go back but definitely with a bigger group of people! Lots of food. Good pricing :D", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "This is by far my favorite restaurant. The food is just simply delicious! The service is amazing and fast. I love that it is child friendly. My son really enjoyed coloring before the food arrived. The chicken was so tender and juicy, the enchiladas were just amazing, and let me not mention the chips and salsa!!!!! I would definitley go back again!", "author": "Jolanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Very pleasantly surprised by Rocco's Tacos today. Walked in for lunch and was immediately greeted with a smile. The server was extremely nice and checked in throughout the meal to make sure everything met our expectations. \n\nWe ordered the table prepared guacamole which was fantastic. Great flavor and texture. Paired perfectly with their flavored tortilla chips. I ordered the Korean Tacos which were packed with flavor! The beef was tender and juicy. All the ingredients were tied together with a creamy peanut sauce. \n\nI highly recommend this place if you're craving some quality Mexican food!", "author": "Dan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "The food is mediocre, and the service is awful.  I sat at the bar with an empty glass for over 30 mins.  I asked for another drink which never came.", "author": "Gregg B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "Rocco's Tacos...where do we start with you?!?!\n\nThis past weekend, we had friends visiting and my husband was starting to fade fast in the rain and yucky weather. Our out of town guests spotted Rocco's Tacos (a place they are very familiar with considering 95% of the locations are in FL and his father lives there). We decided to give it a shot.\n\nI will say, upon entering the location is massive for NY standards, well kept, and has super cute decor. Very welcoming!\n\nWe sat down at the bar and were greeted by a young male bartender, who was not only charming but hilarious. \n\nBeing, about 2 PM, it was time for some beverages so we ordered a pitcher of regular margaritas and WOW, the amount of tequila that went into that drink was unimaginable. In fact, we discussed it at length through the first and second pitcher (which was equally as strong). The drinks were good, it was nice to finally spend money and get a good (ie strong) product in return. According to our friends, the restaurant itself is known for this.\n\nWe did learn that the reason there are 7-8 FL locations and one Brooklyn, is because the owner is from here, FUN FACT, blow your friends away with that one.\n\nWe also ordered spicy guacamole which came with tortilla chips. It was $12 but realistically came with a large amount of guacamole that sadly wasn't all that spicy. Our super friendly bartender did forget to put in the order so it took a little while but that is no reflection of the kitchen staff.\n\nOur group also ordered a chicken quesadilla (as you need to eat food when you drink massive amounts of tequila) and it was delicious. There was a ton of chicken in it, not just a wimpy amount. \n\nOverall, I was very impressed with Rocco's Tacos and would definitely return if I'm looking to just let lose on some Tex-Mex food and margaritas.\n\nTip: If you order an entree you get a shot of tequila for free (shot?) with a Yelp check-in!", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "The food was great, the ambiance was great..however, one of the waitresses had an attitude when she got a little impatient. Also, i was sipping on my margarita and something hard and a little sharp went in my mouth. It felt a little strange, I thought it was a piece of ice or something..I spat it out, only to find a chipped nail. Some of you bartenders need to take care of your grooming needs before preparing drinks for other customers!", "author": "Sally W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "Probably the worst Mexican food I ever had in the east coast. They make up the 1 star with their margaritas. Service staff seems lost. I will stick to Los Tacos No. 1 for my Mexican fix.", "author": "C K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Had dinner on Thursday. Our server Ashley was great. Hope she is our server every time we eat there. The White Sangria is delicious!!", "author": "Sonia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "Bruh! Bruh!\nThis place if freaking awesome!\n\nFirst visit, my friend and I were greeted with smiles, shown to our table and BOOM, the food was right here. I kid I kid.\nWe were seated quickly despite it being the lunch rush, our waiter recommended great items...sadly I forgot them and the drinks were well prepared. On my second visit (with my friend again) we sat at the bar for lunch. I had the Roccos margarita and she had the white sangria, both were potent and delightful. I ordered the taco burger medium well (which came with Cajun fries) and she ordered the chorizo taco (served as a pair). Both were excellent choices and are highly recommended.\nOur server Natalie was well informed and a magician behind the bar.\n\nThis might very well be my go-to spot on Fridays.\n\nCash and credit accepted.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "First time here \u0026 I had the chicken quesadillas .... we got the plate and there was water and oil residue all over them ; they were extremely burnt and un-edible.... $15 for cardboard tasting food.l that made me sick the next day. The mojitos were watered down and severely overpriced ; do NOT come here if you want an authentic Tex-Mex experience; not worth your money.", "author": "Martha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "I went to this place with my old co-workers and I must say that I loved it. This location is right next to the Marriot hotel and they do take out as well. It was about 8 of us that went our for lunch as a Christmas gift from our boss,the dentist which was very thoughtful of her. The decor of this place was beautiful. We were seated and ordered a large pitcher of sangria to share amongst ourselves. We ordered rocco's chips, which was well seasoned and guac. The guac was made tableside which was pretty cool. I then went to order a taco burger ,crispy tortillas,guacamole,house salsa,chihuahua cheese,sour cream,lettuce all on a bun and fries. It was delicious and I definitely would come back.", "author": "Faith M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}