{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "When you step foot into the establishment, first thing you will see is a lay out of onions, tomatoes, cilantro, etc. Order the guacamole and the tableside service will blow your mind!\n\nOur preference was the spicy, this paired with their chips seasoned with what seemed like chili powder were a match made. The meal in entirety came together so well. I had the wet burrito with beef, rolled with rice, beans, that was poured over with the sauce each time I cut into it. \n\nMy wifes chimichangas were even better. The chicken was nicely seasoned, and the shell was perfectly crisp. I found myself in her plate the whole way through.\n\nWeve been curious about this place for awhile and finally made it!", "author": "Devon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "First, I came in as a party of one.. looking for a table. Which is often dreaded among servers. \n\nBut let me tell you: \n\nAlbert absolutely killed it tonight. I had 4 awesome tacos, two amazing margaritas, and one mind blowing desert. He went out of his way to make me a special margarita not on the menu. Recommended the perfect desert. He was just an all in positive, fun, happy guy and the food was perfect. \n\nEddie, the manager came over to greet me and make sure I had everything I needed. \n\nAll in all, great service, great food, great drinks, great team.\n\nI'll definitely be back.", "author": "Dane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-09", "description": "Mediocre food, mediocre service.... the only good thing about this place is the tequila selection!!! Amazing tequilas!!! They have a couple of mezcales too. \nDefinitely not worth it. The place is beautiful, the bathrooms have TVs but I'm not sure if anything else besides the amazing tequila would make me come back", "author": "Enrique G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "WOULD NOT RECOMMEND FOR DRINKS!!!!! IT IS A SCAM!!\nMe and my friend split a full pitcher of margaritas on Tuesday, but we felt sober at the end of it. I am literally a one shot wonder and i felt nothing at all by the end of it. It's not worth your money at all. Better decision to spend 20 bucks from one drink that actually has some alcohol in it, because I get drunk off of one of those. The two stars are from the tacos, because the tacos were aight, but nothing mind blowing.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "I work downtown so it's a great spot to get some drinks and good eats. Every time I came here the staff and the food was amazing. The drinks are definitely hitting so you'll leave there feeling great lol. I've tried so many things on the menu and it was all amazing.", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "The energy here is always the vibe. The only thing they are missing is more authentic Mexican food. The seasoned nachos are good, but I'm not a fan. It helps when you are able order the original plain nachos instead. The tacos are very flavorful but not in a good way. If you decide to come here get the guac which is the best experience here. The guacamole is made fresh in front of you.", "author": "William G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-26", "description": "I researched Rocco's Tacos on line for some great Mexican food.  I went there around 5:00PM and the place was half empty. I asked for a table and was told that there is not one available. Again, I pointed to some empty tables all over the place. The hostess stated to me to sit at the bar. All I wanted is a chair to sit and not sit at the bar since I am not a drinker.\n\nEddy Fontana was called to assist me and he insist that there were no tables available and if I would like to wait, He will be more than happy to sit me. Again, I looked around and the place was half empty. I was told that those tables are two to four guest.  I am in the customer service sector and I will never tell my guests to wait when I have the authority to help them.\nIf this is this is policy at Rocco's Tacos, they need to change it and do what it takes to make the customer happy. Again, you guys are in the customer service sector and like the saying goes.", "author": "Julius M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "Terry makes the best guac we've ever had !!!!!! Man deserves a medal ! Fun personality and gave us fun guacamole making tips ! haha", "author": "Jean G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "5/7/18 was my first time at Rocco's. I had meetings in the area and was starving. I typically don't eat food outside because of my Celiac, but I had forgotten my lunch.\n\nI walked in and sat myself at the bar. The  woman behind the bar came over to me rather fast to take my order. When I ordered I told her that I'm Gluten, dairy, and meat free. I ordered the fish taco's with the lettuce bowl instead of the tortilla, rice, and black beans. \n\nI had to call her back 20 mins later to ask for water that she forgot to give me. I also took the opportunity to confirm that everything would be sent out Gluten free - she said she made sure of it.. Mind you she had the check in front of me before my food arrived so I signed and put a tip on. I worked as a bartender before, I know how it is.\n\nMy arrival time was 1pm, food came at 1:45pm. My black beans were missing so I had to again call over for help. The manager went to get them for me- cool. I then went to eat and realized that I was never given silverware... (Annoyed at this point)  I had to be back at 2pm. Asked for a fork - got it. \n\nTook a bite of my \"fish taco\" to my surprise when I ate it, it was chicken that was coated in who knows what - Gluten.. Immediately I felt the side effects of it. \n\nCall the woman over to let her know, she asked if I wanted her to switch it for the fish - NO, I asked for the manager at this point because I didn't have time for pleasantries\n\nManager comes over and says that he heard about what happen, and he apologized. By this point my tongue was tingling, belly hurt, and it felt like I was high on something. He offered to go downstairs and get me some sort of coupon to come back to eat there, I decline and asked for my money back. I was refunded what I had given. \n\nI left to run to my meeting but couldn't stay, I was so sick. Called my doctor to play it safe then went home and slept - still suffering from yesterday today.\n\nNever have I took time out of my hectic schedule for any type of review on here, I don't complain. \n\nThis mess up on Rocco's Taco part was careless and has cost me. This could have been avoided if staff here paid attention and took my Gluten issue serious. \n\nI'm still deciding what direction I want to take with this mess up. I give this place zero stars.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Best guac ever. Best tacos ever. Little expensive so i recommend going on taco tuesday. Will definitely be going back there again very soon!!! Great service as well", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I'm reluctant to give out too many five-star ratings, but this was worth it!\n\nThe experience alone warrants this rating... One walks in to be greeted by a glass vault of their finest spirits. Speaking of which, the overall them of \"Dia de los Muertos\" is done respectfully and tastefully. Not my thing, but my wife was floored. \n\nThe dining areas are huge and proficiently laid out. The bar was well-stocked, properly staffed, and efficient in their delivery.\n\nDave was our very professional and friendly waiter, and was well versed in the dietary accommodations in the menu. As my wife is vegan and gluten intolerant, we have to be hyper-aware of where we can dine. Rocco's offers a sufficient selection for her. \n\nGuacamole - made fresh at your table - it's not showy, but it is effective in getting one in the mood. Before this, I was not a fan. Guac was always tolerable to outright inedible. Theirs was worth the trip. \n\nTo sum up, the tacos were phenomenal, the chips and guac were the best one can get fresh, we didn't drink but that will be saved for our next visit (there will be many to come), but the prices and selection were appropriate.\n\nI'll leave the rest for you to experience. Check out the downstairs level, especially on a Friday. You have no excuse not to go - It's a short walk from eight subway lines. Go. Now.", "author": "Richie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-08", "description": "I was excited to eat here the other day after looking at the menu.  Sadly, i was disappointed with the food and service.  This place is fairly pricey, which is fine if doing more high-end Mexican food.  We got the queso fundido.  It came with three tortillas that were small and like what you might get out of a taco making kit at a supermarket.  Then I had the baja platter, a fish taco, shrimp taco, spinach and cheese quesadilla.  The quesadilla was pretty good.  The tacos, though, came on the same crappy tortillas that came with the fundido.  And, they were flour.  Tacos should always be on corn tortillas!  Service was fairly poor - I asked to move tables because it was loud by the bar, and the waiter gave me attitude. Then the next waiter let us sit forever with finished plates before clearing.  All in all, this place is a glorified Chile's, or Mexican TGIF.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Casual and friendly atmosphere - I was in Brooklyn on business and stopped in and sat at the bar by myself - the bartender was friendly and welcoming. The Jalapeño margaritas were delicious. Had Elotes and blackened fish tacos and both were also very good. Service was excellent and food was delivered quickly. It was a very enjoyable Sunday evening. I will definitely return the next time I'm in New York.", "author": "Keith M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "Waitress came with two glasses of water, in a timely fashion... she then said that she will be right with us, due to her assisting other customers... one issue is, she assisted everyone before finally taking our orders. By the time, half an hour had passed and I had a half an hour left for my break. Mind you, my girlfriend surprised me at work and took me to lunch. (Awesome on her behalf btw). We ended up ordering take out, chicken burrito. My girlfriend got the White Zinfandel Blanco drink. She said that was good. (I agree I tried it). I was disappointed because I didn't have the chance to really sit and have lunch with my baby. It turned out well though. Food was delicious. Service was just terrible!", "author": "C.J. N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "So my friend and I were going to a concert and couldn't decide what to eat so we ended up picking this spot. It was around 5:30 on a Monday, as we walked in we were greeted and seated at a table. A few minutes later, the waiter came to take our orders. While you wait for your food, they have a person come with a cart and make guacamole right in front of you. I thought that was pretty cool. \n\nNow on to the food part, I ordered a taco bowl w/ a frozen passion fruit margarita \u0026 my friend ordered two chicken tacos w/ a passion fruit margarita on the rocks. Everything was pretty good, the only complaint I had is when I received my taco bowl everything was cold. I know the taco bowl is pretty much a taco salad but everything was cold including the meat. It tasted as though It came right out of the refrigerator. After I told my waiter, I didn't like it, I ended up ordering a beef and steak hard shell tacos. Then moments later, the manager came out to figure out what I didn't like about the food. After I told him, he was offering to remake it but I already told him I ordered something else. Other than that everything was good.\n\nThe interior is pretty cool, the workers there seem to have great personalities and their bathroom has TVs in every stall lol. I think this place is a great spot for Mexican food and they have such a huge variety of food.", "author": "Tee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Good food, good drinks, fun atmosphere! Loved ordering the table side guacamole! Was sooo good! Really loved the spot. Want to try taco Tuesdays or brunch sometime!", "author": "Liz M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-04", "description": "Their chicken could be a lot more tender. I really like their chips with pico de gallo. I love Spanish black beans and I always order it at any Latin cuisine. Theirs is good. Overall, food is edible and it's a decent spot.", "author": "Ayaa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Would have gave 5 stars if I didnt encounter Bella as my server. But I will say the manager fixed everything right away. My food was great and the drinks were good as well. If you go please ask for Dean as your waiter, he's amazing. Picture someone who is so willing to help all while being off the clock. Not assigned to our table but still took  the time to welcome us, tell us about the menu and provide us with water. I'll be back soon just for dean.", "author": "Val S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-24", "description": "Very disappointed with my Visit to Rocco's, the place is really more of a tourist trap style restaurant than anything else. Food was nothing more then average at best, drink prices were high and weak, and parking was a nightmare. Definitely would not be going back to Downtown Brooklyn for Rocco's. There are plenty of other Mexican (real deal) restaurants in BK that will not disappoint.", "author": "Ny's Finest .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Love Love Love this place. First off.. the Guacamole is SUPER GOOD! I can order that alone and would be a happy camper!! I had the shrimp taco with yellow rice and black beans. My meal was good and filling, but did I mention the Guacamole is SUPER GOOD!!  Customer service is on point. This is not my first visit and won't be my last. Hey.... Did I mention the Guacamole is SUPER GOOD??", "author": "Tavia J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}