{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Had a wonderful experience here with a friend of mine. He told me about Taco Tuesday so decided to check it out. Got a Watermelon Mojito which tasted like a watermelon jolly rancher candy. DELICIOUS! We sipped on our drinks til the happy hour special kicked in @ 7pm. Got a pitcher of Mango Margaritas (23 bucks) plus all you can eat Tacos for 18 bucks. Not too bad for Downtown Brooklyn. Only downside to this place is that the crowd was much older and the bathroom is all the way downstairs in the back. This place offers 300 different types of Tequila so you really can't go wrong", "author": "Shazaad G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "I went to Rocco's for the first time on Saturday(4/18).  Me and my friends arrived at like 1030. I originally had plans to go to another bar but it had reached capacity when we got there. Good thing I had made reservations with Rocco's earlier that night. (Oh yeah MAKE RESERVATIONS!) But unfortunately the reservations didn't come in handy since we arrived way later than the reserved time. So they placed us on the waiting list and the wait was 45 minutes! Too long for me! It was very crowded so we just went looking for some seats at the bar and lo and behold, we found seats squeezed right into the corner of the bar. (Lol) But we were comfortable nonetheless.\n\nOur bartender was Joe whom we loved. She was so nice and patient especially with the young crowd she had. What I love most about Rocco's was the Margarita Pitchers. We had 3 in total. The variety of the different margaritas will make it so hard to chose one! Lol. And the prices for the pitchers ranged from $23-$39 if I'm not mistaken. \n\nThe food was good. It was just right for a night out drinking. It was not as bad as some of these reviews on here exaggerated. Seems like they were looking for 4 star restaurant cuisine. I had the Camarones Patron, my friend had a burger and I forgot what my other friend ordered. It was just fine, nothing crazy. \n\nOh yeah! When we originally Yelped Rocco's that night, the closing time stated 2am. That is completely wrong! They do not close at 2am. As we were enjoying our stay, Joe politely came with the bill and we were wondering why she was rushing us...which she wasn't, it was just closing time. She said because of a riot held there two weeks ago, where bartenders were harmed, the new closing time is 12AM! FYI! \n\nOther than that Rocco's was pretty cool. I'll definitely go back!", "author": "Tawana G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "This was my second time coming here and again it was an OKAY experience. My school's network always treat their staff to happy hour events at random restaurants and again this place was chosen. The pitcher of margaritas was amazing as usual. I can taste and smell the tequila drenched inside the pitcher! Yummy! But my only problem was that we asked for a vegetarian plate of nacho because a lot of staff members don't eat meat. After a few bits in, we noticed the nachos had beef in it. We told the waiter and he sincerely apologize for the kitchens mistake. He was able to bring us out a fresh plate of meatless nachos. I'm happy he was able to fix the situation quickly. I will try this place one more time. I think the guacamole and margaritas are the only two things that would keep me coming back.", "author": "Keyana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Best chile rellenos I've ever had. Not overly breaded and fried. Fresh poblano with full flavor. Great combination of cheeses. No yellow unidentifiable cheese here! And of course, table side prepared guacamole.", "author": "Mark P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Terrible service. 1.5 hour with no food. And they never felt guilty. The waitress was so arrogant like we deserve it.", "author": "Lianyu L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "I have been sitting at the bar for 15 minutes. All I received was a menu. Alex (?) Is serving other new arrivals. He just stopped by and acknowledged his was forgetting something. After 30 minutes I finally got to order a drink and food. The only redeeming factor was the bartender realize his mistake and took the drink off my bill without me asking.\n\nAdditional note: I returned the next night, was seated at a table, and had a better service experience.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I was there with friends for happy hour followed by getting a filling meal. David, our server, provided excellent service!", "author": "Saikrishna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Kathy was our server and she was AMAZING!! She was honest and treated us with respect! I really appreciated how honest her suggestions about the things we ordered were. She checked on us periodically and everything.\n\nKeep in mind that I was here more so for drinks than the food. I ended up ordering the mahi mahi tacos which were ok. I've definitely had better.", "author": "Chrystelle H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "Rude seating hostess. Empty restaurant at 1 in the afternoon and wouldn't seat me at a table. She wanted me to wait 20 minutes or sit at the bar.   As I walked around the restaurant there were at 20 tables EMPTY", "author": "Susie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Horrendous service and almost ineadiable food (if it ever comes after you order it). Avoid at all costs.", "author": "Roger P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "I first saw Rocco's Tacos when driving down Adams street, it's very eye catching. I decided to go give it a try. As I entered, I must say this place has some of the most intricate decor I've seen in a restaurant. The lighting was great and it's very spacious. \n\nThe menu was great. It had a very large variety. I chose the nachos which were HUGE. I was in meaty, cheesy, gooey bliss! I also tried 3 of their tacos. The chorizo, the carnitas, and the spicy chicken. My favorite was the chorizo. \n\nThe drinks here are pretty good. They have an array of choices, so I'm sure something will grab your attention. All in all I give this place 4 stars. It's very good but it lacks the authentic Mexican flavor. \n\nAlso, they have \"Taco Tuesday's\". Unlimited tacos for $15 and drink specials!", "author": "Gregory B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Just left here for lunch! This place gets 5 stars on the ambiance alone! It's simply beautiful inside. They have private rooms. Nicely padded elevator(I guess if you are too drunk off the tequila to stand straight) accompanied with a flat screen tv. Each bathroom stall has a flat screen tv behind the commode. I stood for a few minutes after using the facilities just to watch Napoleon Dynamite (don't judge me). The restroom was very clean which is important to me when eating out.\n\nMy waiter was amazing and very attentive. \n\nNow to the food I don't know if this is considered authentic Mexican but it was good to me(and I'm not a fan of Mexican food). I ordered a chicken Caesar salad with their house Caesar dressing and a pulled chicken taco...AMAZING!!!! My colleague and I shared the guacomole which by the way is made at your table. We asked for it to be spicy unfortunately it wasn't. But that's an easy fix...mixed in the house hot sauce which isn't for the weak hearted. \n\nUnfortunately I didn't have a drink because I went for lunch while attending a work-related workshop big I may go back after work for just that!", "author": "Lola O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "UPDATE 3/18/15: So I visited Rocco's again last night and I must say, the drinks were stronger and the food tasted better than on my first visit. The service was good as usual. They were VERY busy! It was taco Tuesday and it was definitely a full house and a younger crowd. Will be back", "author": "Maggie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-22", "description": "Fun and lively environment but extremely mediocre food. $16 for unlimited tacos on Tuesdays but they came out either cold or very salty.\n\nI would come here for fun drinks with friends but not for the food.", "author": "Gina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "Came here on St. Party's day and it was Taco Tuesday and $15 margaritas pitchers after 7PM. Made an appointment on Opentable and over the phone just Incase. Came and got table side guacamole which was $12.50, not bad for two people to share. I also ordered Queso Fundido which was odd, never had it ever with onions,peppers, and big chunks of sausage. I prefer the freshly grounded chorizo and queso. I got the pork Enchasillas which I didn't care for it was okay. Also hit 7pm so I ordered a Passionfruit Margarita pitcher for $17 I guess it was additional $3 for flavoring but whatever so worth it and delicious. For dessert I had Tres Leche cake which was good but overly sweet. Overall experience was good. The ambiance was nice and this spot is huge with 2 floors and right on Jay street Brooklyn.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Really enjoyed this place!\n\nI came here for a friend's birthday dinner after going to two bars in downtown Brooklyn that pretty much let us down food and atmosphere wise. Low and behold we stumbled upon this great establishment which come to find out, has only been in business at this location for 1 month!?\n\nThe service was great. We were seated right away and had the attention of two waiters to get us any and everything we wanted. We ordered some pitchers of the flavored margaritas ($23 each), passion fruit and mango. The passion fruit which was the first round of the pitchers, was amazing! Very tasty and a good amount of alcohol! The second  and third round however were not as good. They tasted watered down, probably due to the fact that the pitcher was loaded with ice!! No bueno.\n\n We also got an order of guacamole, $12.50, which was freshly prepared in front of us. We totally loved and appreciated that. You MUST try the guacamole here! Be careful though because the guacamole can really fill you up if you load up on the chips they give you before your meal. \n\nWe were seated in what seemed like a private area which was perfect for the birthday girl and the other 3 guests with us. We also had the tres leches for dessert. Simply fantastic and great for anyone with a sweet tooth! \n\nThe music! Oh em gee. The playlist or dj, not sure which one, but would bet there's a Dj, was nothing short of amazing. They played a variety from a mix of hip hop like Chris Brown, Bobby Shmurda, and Beyonce to the Backstreet Boys!! Yes, I said the Backstreet Boys. The music and variety was incredible. I really loved it. \n\nThere are two floors and although the basement was full of empty tables and a bar area (there's one on the main floor too), the bathrooms down here are very clean and have TV's where you can watch cartoons. Yes, cartoons lol.\n\nOur servers, Miguel and Dimitri were great. Very attentive and Miguel was highly entertaining and accommodating. The tacos I ordered, spicy beef and chicken tacos (about $3.25 each) were great and made me full after first chowing down on the chips and guacamole.\n\nAnyway, I'm rambling. If you like tacos, a chill atmosphere, and decent margaritas, please check this place out. My friend and I can't wait to come back here!", "author": "Tashana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Had lunch from here, went to the walk up window and ordered the steak burrito bowl. The salad a few too many white parts of the lettuce head that you shouldn't add in. But it was overall really good and flavorful.", "author": "Paula M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "First time visit; no lunch menu. I ordered the lunch special: unlimited tacos for 15 bucks which was worth it, because it allowed me to order/taste a variety of tacos. My favorite one's were fish taco (grilled), shrimp, and steak! Chicken was too dry \nPro: attentive staff\nCon: too commercialized, their taste did not live up to the appetite i had. The tacos were always coming out cold, when asked why they said due to the toppings.. Ok, then why are cold topping being added onto the hot tacos! #goodgrief", "author": "Viv O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "I arrived with a party of 5 for brunch yesterday 10/9/16. I was celebrating my engagement with my bridesmaids. Our server Aaron was THE BEST. So sweet, accommodating and patient. We definitely took advantage of the unlimited mimosas and Aaron was always there to give us a refill. \n\nWe also had table side guacamole from Humphrey (I believe that was his name ). It was fresh and very tasty! \n\n The manager came to our table to congratulate me on my engagement which was very sweet and unexpected. We even got complimentary shots which was given to us before the manager came. \n\nThe only reason why I can't give a 5 star rating is because one of my bridesmaids left her suitcase at the door but forgot to take it with her when we all left. \nMy fiancé went back about 10 minutes after we all left to claim the suitcase but the hostess told him they did not have it. \n\nI had my bridesmaid call to ask what \nhappened to her suitcase and they apologized for not giving it to my fiancé and assured her that he would be able to pick it up the next day. I'm waiting for Rocco's Tacos to open and I will try once again to pick up the suitcase.", "author": "Rose O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Been to the one in orlando many times. Was too happy to find out that they were opening one in Brooklyn!! It is gorgeous! The bar is super long so there is a lot of space to get a drink from a bartender. The food was super good. Ordered the Durango to share with two people and it was perfect. The best thing was the steak taco. The meat was marinated with such great flavor, not too much but just enough. Had the great Mexican touch to it. The Watermelon kiss margarita was delicious as well as the Mexican frozen drink. I can't wait to come back!! The DJ was super good, it was a Saturday night. His name was DJ Bamboo. He was great at mixing the songs together. Definitely worth the drive!!", "author": "Emery G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}