{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "This place went above and beyond when I went here for a special occasion. They gave us a complimentary dessert and the food, from the beginning (guac made fresh at your table where you can modify the spice) to the end (fresh made churros, hot from the oven, with ice cream), was delicious. The staff has always been great here, but our waitress Melissa was incredibly sweet and attentive. Great atmosphere, decent Mexican food, and wonderful service!", "author": "M W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I love Rocco's tacos the food is great the drinks are great. The service is superb I can never complain about this restaurant. The televisions are always in plain site for the games lol. \u0026 the waiter and waitress are very polite", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "The customer service sucks the one drink i had wasn't good and the bartender refuse to take it back it's bad enough that he doesn't drink alcohol so he shouldn't even be mixing drinks i don't think I'll be returning back no time soon", "author": "Meeks J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "My wife and I have been to Rocco's several times with friends. The food is always tasty and the bartenders are friendly. We've been there for Happy Hour and in the later evening - you can't go wrong either time. We've even watched several sporting events and consider it to be the best Sports Bar in Brooklyn Heights.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "This is my absolute favorite after work place. Ideal location.  Exceptional food, margaritas and service. Taco Tuesday is a must--all you can eat tacos for $20, you can't go wrong. Kivita is the best!", "author": "Miri G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "One of the best Mexican food bars in Brooklyn. The ambience is so lively and it's always crowded- mainly maybe cause it's right next to NYU! Had the veggie enchilada with green and refried beans. The beans had a tinge of lime which made it taste so good. The live guacamole is a little bit of a hype but was okay.", "author": "Anu P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "I have nobody to blame but myself... i should have stayed away from all the mediocre reviews but decided to take the hotel concierge's advice on the closest restaurant from the Brooklyn Marriott.\nAll fairness, the food didnt taste all that bad but food poisoning from salmonella and a trip to urgent care an hour later is not my way to spend my weekend. Not only do i feel sick and miserable, i have to pay the medical bills.", "author": "Bee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "I absolutely love Rocco's! My Co-worker and I happen to visit frequent on our work days . The customer service is always impeccable. I've never had a bad experience at Rocco's. And Sunday is Unlimited Mimosas", "author": "Diana F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "Food was good but service was horrible. We went for taco Tuesday and waited 40 minutes for our \"refills\" before we gave up and asked for the check. Our waiter was avoiding our table and we had to get the check from another server/hostess who was very helpful. Our server never even came back as we were leaving, so it was surprisingly terrible service. Maybe server needs more training.", "author": "Dan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "After having wanted to try this place for at least 3 years I finally went today with a friend and I have to say I am so disappointed. \n\nThe first issue I had was that both of our frozen margaritas came half frozen and not mixed. All the liquor was at the top and it became impossible to drink because the more I tried to mix it the more watery it became. It was like a watered down liquor slushy after about 5 minutes at my table.\n\nThe second issue I had was that my meal came to the table before the guy even finished making our guacamole and my friend and I felt super rushed because of this.\n\n\nThe third issue I had was that the place was so understaffed that it was hard to even get our servers attention. That's not her fault though, she must have had 3 sections by herself, we really felt bad.\n\nSo over all I'm giving 3 stars because the decor is amazing here, as are the chips for the guacamole but other than that I can't say I'm much of a fan or that I will be back anytime soon.", "author": "Allie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "The best Margaritas and Flautas .. perfect for chilling after work and your day off ..", "author": "Jason D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "I had is really nice time here. I love the decor upon entering thia place. I came here craving some mexican food and was not disappointed. I ordered a Lime margarita that was really bitter but the mango frozen margarita was everything. My food was hot and the wait time was low. We came on a Saturday night after 10pm and was able to walk right in.", "author": "Jamie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I came here for a dinner table service with two other friends and service was amazing. I was running late one of my friends phone was dying and the host allowed him to use her charger so we could stay updated with each other. It wasn't crowded at all, I did make a reservation but ran 30mins late of that (MTA issues welcome to NYC, right?) anyway they very understanding and pushed the reservation back. Upon my arrival I was greeted with a smile from the host, quickly seated at our table and 30 seconds later appeared our server. Quick and efficient service, we took quite some time trying to figure out what to eat and she had the patience of a saint. As for food the Texas Queso was really good,Elotes was good , and the Quesadilla was mediocre it wasn't as crunchy as I was expecting it to be, it tasted soggy. It did come with guac, sour cream, and something else,but that guac wasn't good. So me being me glucking for punishment ordered a table side guac where they make it right in front of you. That was beyond delicious it came with large chips, it was perfectly seasoned just phenomenal and fresh the person who made it gave the table a chip with some on it to check if it was to our liking, genius lol. As for the guac coming out that kitchen I don't know what happened but our table side was delicious. Our entrees came shortly after at an immediate edible temperature. \n\nYes the table ordered alcohol and we were all pleased with it's results. \n\nThe only negative is I ordered their California Taco and unfortunately it was disgusting. Not for the lack of flavor or the variations of texture that was perfectly balanced kudos to the Chef who created the recipe. But my fish just tasted like it was near or just past expiration and the cook tried to cover it up by adding extra toppings (here I was thinking it's my lucky day lol). The manager visited the table twice once upon arrival and once before leaving to comp my uneaten California tacos. We saw him near the door on our way out, he was present in a good way allowing us to enjoy our meal but if there had been an issue, easy to flag down. \n\nI'm not giving less than 5 stars because of the taco incident. It was quickly resolved, the staff offered amazing hospitality, the manager was kind, my drinks were done correctly, the place was clean, and the bathrooms were clean. That sounds like 5 stars to me one incident that I didn't get sick from isn't going to drop the rating less than the 5 stars I'm giving this place.", "author": "Tatianna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-07", "description": "The service and food were okay. My drink was good . The atmosphere was cool. Probably would go back and order something else . It deserves a second shot to get 5 stars", "author": "Candyy E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "This place was a huge disappointment.  I ordered the Korean Tocos and it was way way too salty. My wife did not like her plate either. The problem here is that the food was not good at all. The quality to price food ratio was the worst I have ever been to.  It's a shame because the place was beautiful.  I guess it would be good for a drink or two ,but that's it.  Sorry there are way better Mexican places to go to that is way better and cheaper.", "author": "Alejandro I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "What made this restaurant great was the great customer service given by Latifa the manager. My table has some concerns but Latifa quickly responded to resolve the situation.  She created a great cinco de mayo experience for my friends and I.  The guacamole was delicious and the margaritas were strong. I'll definitely be coming back to check out their happy hour.", "author": "Cierrah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Fun light and great food. Regular spot now for many and easy to get to. Margaritas are great here! Third time here and it's still good", "author": "Jenn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "The food was great and what really stood out for new was my waitress was amazing her name was Melissa and she was so awesome!!!", "author": "Crys A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Glad we weren't swayed by some negative reviews. Space is really nice, portions are generous, tableside guacamole is a must!   Price is consistent with other sit down restaurants in the borough. FYI bring your appetite #tacotuesday is $20 all you can eat.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Lunch downtown Brooklyn in the busy metro center. The hostess and waiters were attentive and pleasant they suggested the drinks and answered all my questions without hesitation the place was not packed and we received seated rather quickly for a mid-day crowd. \n\nThey honored my Yelp giveaway and I was sooooooooo surprised because most places I go do not honor those that give aways. I did receive a shot of tequila on the house, the drinks menu was original and tasty. Top shelf liquor has a visible glass walk in closest.....seriously.\n\nThe lightning fixtures are exquisite, decorative, unique, and colorful. This place is high on south western ambience and the attentive server Jason was on his job, knowledgeable about menu items, and suggested our lunch items.\n\nWe had the homemade guacamole which made right in front of us with ripe avocados, sources, and tomatoes. I ordered authentic Mexican steak tacos which were made to cooked rare and tender we did have a small concern in our order however once we spoke to the manager she made the necessary adjustments very quickly.\n\nPlease pay close attention to your final bill....this place is jumping with people someone else's items were on it, however it was swiftly attended to and we were happy with the services.\n\nThe the young and attractive after work crowd started to roll in so we called it a day it was a great experience and the after party looks as if it was about to jump off as I was leaving.\n\nI will be back for Taco Tuesdays.", "author": "Letty C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}