{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "My husband and I live a few blocks away.  When the restaurant first opened, I had one meal here but it was only meh.  Tonight we wanted to give this place another chance as it is one of the few spots in the area serving Mexican food and open until 1AM (so it says online).  We went in at 1140, the place was a mess. Napkins and dirty cups everywhere.  We were told to go to the bar in order to get faster service. Okay, short staffing happens... However, the bartender said it was last call, nearly an hour and a half before closing.  We left and notified the hostess as we were walking out and she acted like we were annoying her.  The place closes at 1145, advertise it as such.  Wipe your bar.  Don't give customers attitude when they're just asking to be served.  Simple stuff.", "author": "dreamsincolor e."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "So this review is based on two lunches, both times consisting of excellent guacamole and decent tacos that are nothing special- I've had far better from the taco truck near industry city for far less money.  The place is really pretty and the servers are very nice, so that plus the guacamole = 3 stars.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Amazing spot! Fab chicken \u0026 pork tacos! Absolutely moist \u0026 flavorful! Tres leeches cake is delicious also! My fave go to spot! Super delicious!!! Great staff. Friendly. Cool decor. Clean! Spacious!", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Best place for brunch and never too crowded! Unlimited mimosas for $14 is the best deal in town. Mike the bartender makes you feel right at home and is so much fun. Always a good time and atmosphere any day of the week. Love this place!", "author": "Carley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-21", "description": "The drinks, food and servers are wonderful and the atmosphere is out of this world. Stayed for three days in nyc and I've been here two out of the three because it's so good. Alex made our guacamole today and it was phenomenal yet his manager came up to him and put him down in front of our entire group making us all very uncomfortable to the point that we needed to praise Alex to make him feel great about the amazing food he made us. My group and I have all been in the restaurant industry and we have never been so appalled witnessing a manager Do this to a new hire in front of guests. ALEX YOU ARE WONDERFUL AND YOUR BOSS NEEDS MORE TRAINING NOT YOU! Also thank you to the bartender for making us specialty Margs! Y'all the real MVPS", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Love coming here for taco Tuesday its easy to get to and in a good part of downtown brooklyn. I usually get the carne asada tacos and they're always great. Other notable mentions is their nachos and guac.", "author": "Stephan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "So as a vegetarian I am always interested in how restaurants can take vegetables and turn it into something that is worth my money. \u0026 Their vegetarian taco is definitely good! Made of mushrooms and decorated with some Mexican flavors. Overall a good dish", "author": "Lia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-12", "description": "Food was good. The server KAMARIA was AMAZING. Ask for her. They also have a happy hour.", "author": "Valentina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Everything was A1 from the decor to the lighting. Our server was very friendly and helpful. The food was amazing!! I had the seafood molcajete and a mango margarita. Amazing!! My date had the taco bowl salad which was also amazing...", "author": "Dorothea C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "The inside of this place is very nice aesthetically.You are immediately greeted by a huge container/case/wall of Tequila that goes around the corner. If you've heard about this restaurant having over 400 bottles of Tequila and were skeptical, I guarantee your faith will be restored. The restaurant is fairly large. They have a bar the length of 1/2 a city block and an even larger dining area on the main floor. Downstairs is a whole different world as well. \n\nThe happy has mid-shelf cocktails and bites as well. $2 off cocktails with quality ingredients; large glasses as well. The only problem I had was with my Tequila Lemonade. I applaud them for trying and having a nice presentation, but usually tequila doesn't go with lemon. And to mask the taste, they used agave syrup....a lot of agave syrup. No exaggeration, but it felt like diabetes in a glass. I brought it to the attention of the bartender so he would know for future mixes. He agreed that it was too sweet and did his best to dilute the drink further. I appreciate that he did this. Didn't help, but I'm usually a bigger fan of service than food (55/45). \n\nIf you like tequila and want to taste a new bottle that you didn't know existed, I'd recommend this place. I'll consider coming back in the area if they're running a special or I'm seriously craving Mexican food that day.", "author": "Greg J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "The food is definitely good but so overpriced!! 7.00 tacos is crazy. I say go on all you can eat taco day (Tuesday) but it's still 21.99 :(", "author": "Sakala H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-05", "description": "The place was lively but I found the food to be very salty.  I ordered the chicken enchiladas and they entire meal was way too salty.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Jeff our server was amazing! The food was great and they even made fresh guacamole in front of our table!", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "I came here 3 times. 1st time for some drinks, were okay. \nThen came here because I was planning a farewell. The food was good. The third time, I came here to take my mom. We had the avocado with chips, beers to celebrate. I didn't like the fajita, I preferred it with hard tacos instead. The flautas was great! Street Corn was also okay, I didn't like the brown thing they put on it.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I have been here multiple times. It's a brilliant concept. You bring people from different walks of life a place they get drunk at. Behind it is the courthouse next to it is the Marriott hotel. It's gentrification at its finest!\n\n\nOkay I'm over doing it with my speech lol, social work major sorry!  Honestly I like this place. FOOD IS AMAZING! The vibe is always fun. THE DRINKSSSSSS.  (I had to write that plu-ral lol THE DRINKS ARE AMAZING!\n\nTaco Tuesday is so packed you would think it was a a weekend. I have eaten here by myself and with friends and every time the vibe is amazing.\n\nWho ever owns this picked the perfect location!", "author": "Doreen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "Shout out to ALBERT. Great personality and attentive to his tables. He periodically checked on us and was efficient with our food.", "author": "Karen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Awesome place to go after work.\n\nAtmosphere os feetive and staff very friendly.\n\nAim for hanging out every Friday!", "author": "Emma R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Great happy hour snacks great margarita  off the  Borough  hall stop and it's in Brooklyn ... Manhattan Who???", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "I used to attend school down the block from this place and became the place to go to grab some chips and guac (made table side) and some dessert before class. \n\nThe design of the place on the ground level is upscale Mexican restaurant. However the level downstairs has a different kind of upscale feel to it with individual dining rooms that have their own themes, I'm assuming for groups. \n\nMy husband claimed the men bathroom had pictures of playboy models in them. The women bathroom had tiny screens in the stalls that play movies. \n\nTheir queso fundido is amazing and the taquitos are just as good. The tres leche cake is moist and just as delicious. Service for me has been great every time.\n\nIf you're in Brooklyn, you need to check this place out. Great experience.", "author": "Abigail N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Great food, great drinks, great service from Albert! Good job!\n\nFood had me nice and full. The food was great and did not take forever to come out the kitchen. Definitely coming back for my birthdays and anniversaries. Love this place!", "author": "Arturo M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}