{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Excellent music and taste.. they prepare a guacamole in front of your table explaining all the special ingredients and spicy touch with a guy very friendly and funny.! They have tvs in the restrooms, which is the first time I see that hahaha so original. Its a good restaurant/tequila bar to go afterwork and with friends to have a good time.", "author": "Ingrid P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "The waiter started out enthusiastically selling $5 margarita's and table-side guacamole.  The drinks were AWFUL!  Sickly sweet.  The table-side guacamole never happened.  We flagged down the waiter (literally - waving hands) after 20 minutes, cancelled the guacamole order and placed the dinner order.  We also order some beers.  Another 20 minutes later we flagged down the waiter and cancelled everything and asked for a bill for the $5 margarita's.  He said he needed the manager approval.  After another 5 minutes, we flagged down the manager and he said you don't have to pay anything and he was very sorry.  Good to have him apologize and comp the awful drinks.  But the dye was cast.   So I can only rate the service which was one star.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "This place is horrible. After seeing many reviews I was excited to come check it out. However we arrived with a party\nOf 12. We were told it would be a 15 min wait time. 45mins passed still no table. We were finally seated and guess what there wasn't enough chairs for everyone in my party. It was horrible the hostesses were rude and on their phone not really trying to give us any information. They were \"cleaning off the table\" for 45mins !! Once we were finally seated we were told\nTo \"hurry up\" because the kitchen was closing soon. So unprofessional so not worth my money we walked out, asked for a manager who no one could find. I hate to give bad reviews but I also hate being treated horribly. Save your money and\nGo elsewhere.", "author": "Searrah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "A solid spot for post-work margaritas. The food is pretty standard fare for a Taqueria - nothing to write home about - but the tableside guac is awesome.", "author": "Melea M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "how do you fuck up a patron margarita? Nothing but salt, i mean the entire bottom of the glass was nothing but salt.  nectar the fluatas tasted like pureed baby food. ordered sour cream it never came. the restaurant has no freaking heat. what kind of place is this i was fucking cold.  another thing they need more workers cause the servers were null n void.  where da fack were they? they will never evet get a $$$$$ from me.", "author": "Kisa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-01", "description": "The server recommended the $16 pollo al carbon and we ordered it.  The chimichurri sauce on the grilled chicken was delicious. Regrettably, one of the two chicken pieces tasted undercooked so I did not dare eat it.  I let the server know.  She did not correct the situation.  More staff training needed.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "The portion are huge. I ordered an appetizer with my entries and when I was finished my appetizer I couldn't eat another bite. The food is good. The customer service (at the bar) is sub-par at best but they definitely make up for it in the quality and taste of the food.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-30", "description": "I just left the location and the \"alleged manager Jenn\" stated that  I needed to provide a method of payment or pay prior to my drinks being made and as a veteran of the USMC and a 20year veteran of the NYPD whose travelled the world has never heard of this type of treatment to a patron . I personally will never go there again and will urge my followers to do the same.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Server was very nice, the food was prepared quickly , the margaritas were very good. Parking is hard to find so you can use the hotel next door's parking lot. The hotel is \"The Marriott\". Overall everything was great and I look forward to coming back to this place again", "author": "DJ Cory P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "The food and ambiance are decent although I've definitely had better tacos in New York.\n\nThey make the guacamole in front of you, which is cool because of its freshness, but I've tasted better. The salsa could also be better. \n \nThe margaritas are pretty good but, again, I've had better.\n\nI've never had a bad waitress here however, they charge you for every little addition which I think is cheap and a reflection of poor customer service. \n\nI'll go again though if I I'm in the area and feening some Tex mex.", "author": "Toni B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "I cannot say enough good things about this place. The food is amazing. Perfect blend of authentic Mexican but with an American kind of flair to it. The food is just half the battle though. It is the amazing staff here that will keep you coming back. The waitress I had today is truly special. Perfect balance to getting everything we could need without pestering. She seemed to even predict things like drinks and choices. Shout out to her. Please come here and check it out. You won't be dissapointed. I can't wait to come back for drinks.", "author": "Mikey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "This place was surprisingly great! I thought it was going to be some corny chain but wow! The food was good...we got chicken enchiladas with fried beans and rice, Mole enchiladas and some beers. \n\nThe decor was so cool! Every detail is thought out. The place is brand new, clean, and there were interesting decorations all around. They also have tvs at both bars upstairs and downstairs....and even in the bathrooms. \n\nThe service was fantastic as well!! Loved this stop; it's a regular now.", "author": "lena p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "This place was soo on point. We had a waiter who was in training and he was very knowledgable about the dishes and drinks. Havnt felt this satisfied in a long time.", "author": "Adam T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "Waste of time and money. In short, service was slow, food was cold, place was too dark, and the money spent for the poor quality was outrageous!\n\nLong story: Valentine's night ~7pm. We initially  had reservations for El Camion on Ave A at 6:15 pm but couldn't find parking. We ended up in BK and remembered that there was a taco restaurant in the area we were in.  We found parking pretty quick and about a half block away.\n \nThe place is spacious with cool decor; ie., lots of skulls, different colors and patterns. Even though there were tons of different light fixtures and bulbs, the space still seemed darker then what I prefer. There were plenty of tables available.  The bathroom was dark and messy.\n\nWe told the hostess table for two. She wasn't very welcoming. She made comments to her collegue, looked at us and said that she can give us a table but they have tons of resevations pending and we had to be out by 9:30pm.  By the looks of how empty the place was, we didn't think there would be a conflict.\n\nService was very slow.  When our waiter finally arrived, he introduced himself then said that he's actually NOT our server but he'll help us anyway.  We ordered the table side guacamole which was pretty good. Keep in mind that the guacamole guy just makes guac. He doesn't supply the chips. We waited a while for our waiter again  but saw the guac guy instead and asked if he could bring us some chips.  He did, then said \"I'm sorry about that. I don't  know who your waiter is\". I said it's ok, neither do we\". The chips were fried and sprinkled with a spice that was a little too salty but overall ok when dipped in the guac.\n\nI ordered the chicken mole. It looked like it had been microwaved and was room temperature. Surprisingly, the flavor was ok. The portion was decent. 2 chicken breasts (one was very firm to the bite and the other was a bit more tender), a half cup of red rice and about a cup of black beans with about a dollop of cheese on top. My husband ordered the chicken enchilada Verde that also looked microwaved and was room temp. He said that the beans were the only thing that tasted decent. \n \nI opened a yelp account because of this experience.\n\nNeedless to say, we will not be going back.", "author": "Stephany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "When one of my colleagues said she wanted to go to Rocco's Tacos after work I knew I should have just passed. We arrived at about 12:45 on a Saturday afternoon. We were promptly seated. On my previous experience at Rocco's Tacos the food was disappointing just like today. We ordered \"spicy\" guacamole for the table which wasn't spicy at all so I can't even imagine what \"mild\" would taste like. I ordered a mimosaS (I literally said mimosas to the server) which the menu indicates are \"unlimited\" with any entree; well I had 1 mimosa and our server neglected to even ask if I wanted another. I was incredibly confused by this. Why didn't I ask for a refill myself you're wondering...well simply because all I could think about was getting out of the place I couldn't even pull myself to order the mimosa I deserved. Also the mimosa I did have was full of pulp and there was pulp sloppily on the side of the glass. Where they do that at? Why would anyone think that was okay to serve to a customer? \n\nI ordered the California Fish Tacos which was a mistake. I can't even get into the uncomplimentary flavors. My final issue is as people began to finish their meals, our server cleared some plates but not all. So there were 2 random plates (one was mine) lingering on the table while we were finishing our time together. \n\nAll in all, after 2 visits I've learned my lesson and will definitely not return to this establishment.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I couldn't have been happier about the choice of making Rocco's tacos our choice for a rehearsal dinner spot. The location is right next to Marriott and several other hotels which gave us ease with selecting the location for our choice. The food was on point and the drinks were great. \n\nAlso beyond the food the staff at Rocco's were very easy to work with and made the restaurant an incredible experience", "author": "Jeff F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "OMG YES! TACO TUESDAY!\nThis place is fantastic, the decor is gorgeous on the inside, the place is huge and pretty packed when i went on a tuesday night. We had a reservation, which i highly recommend seeing the number of people waiting for seats, and so we got seated immediately. Just want to start by saying that everyone working there was incredibly friendly and super nice, so Kudos on excellent service! The deal for taco tuesday is $18 for unlimited tacos, which we duly obliged :) The tacos come out as a set of 4, followed by sets of 3 everytime you order. Everything was delicious, i particularly LOVED the shrimp tacos, and also tried the chicken, steak, and fish tacos, and all were really good. Every other dish I spied at the place looked amazing and made me want to order it as well, except i was stuffed after about 8 tacos! The margharitas are tasty, go for the pitcher if there's two or more of you, it is totally worth it!\nLove this place, most definitely coming back again and again and again...", "author": "Hashem D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "Do you like screaming at your friend sitting across from you when you're seated for dinner because it's shockingly loud on a Wednesday night? Do you like your tacos drowned in grease? Do you like rude servers who forget your orders? Then Rocco's is for you!\n\nI really don't understand the hype about this place. The food is comparable to Applebee's, and the ambiance is somewhere between chain restaurant and dive bar in a college town. The only thing worth noting is the decent guac, which is made at your table by a guy wheeling a cart with a mortar and pestle. \n\nDrinks aren't worth mentioning. My tacos were covered in two inches of red grease. When I asked the server if they were supposed to be drowning in oil, she took it back to the kitchen, where I assume they just poured off the oil (since it trailed off one side of the plate). \n\nJust go to Chipotle in Metrotech.", "author": "Ann Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-23", "description": "The atmosphere is very laid back and relaxed!! I ordered the beef nachos and chicken taco and was not impressed. The meal was not authentic Mexcian food. I was very disappointed. My 10 year nephew could have done a better job making nachos.\nThe drink on the other hand was spot on and very tasty. The service was mediocre, the server never offered water when I order an alcoholic beverage or check in on me in a timely fashion.\nWould not come back for the food!!\nC", "author": "Christina R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "As part of a meetup event, I came to Rocco's for the Tuesday unlimited tacos and drink specials. For a group of 17 people, they accommodated us pretty good. Within 15 minutes of being seated, we were ready to order. I ordered the unlimited tacos with a side of plantains and a mango margarita. My drink was so GOOD! I don't like alcohol much, but this drink was very tasty. It wasn't too strong or weak, it was perfect. We also ordered the fresh guacamole. The guac with the seasoned tortilla chips were delicious and I highly recommend anyone dining here to order it. It was enough for about half of our party but the other half had to order another side. On the contrary, my tacos were mediocre. I ordered a variety including the chicken, ground beef, chorizo, blackened fish, and shrimp. Out of all them, the shrimp was probably the best. They were all missing some type of seasoning, but they tasted very fresh. I added a little guac and sour cream and it tasted a bit better. I'll pass on those next time. Never received the plantains, guess they forgot about it because it was on the bill. Another negative aspect was the slow service. We waited almost an hour for our food. I have no idea why but by the time they brought the tacos, I was full off of the chips and guacamole. WHY?! That's some Red Lobster type of feeling, where your full off the biscuits and salad before the entrée arrives.  Absolutely horrible on that aspect given the fact that only half our party ordered when we were seated. The other half received their food pretty quickly. Overall, the server was very patient with us and provided great service. I don't think I will be running back to eat here however, but I would recommend it to others. It's a great after-work place to unwind with drinks and small appetizers.", "author": "Monique M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}