{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "First off if I could give this place 10 stars I would.  Our waiter Miguel was so sweet and carried such great conversation with us today. Really nice gentlemen.  I ordered Enchiladas Mole Poblano ...wow I was absolutely taken! It was delicious!! We had Guacamole to start and Also had a Rocco Rita, which I highly recommend. The Ambiance of the restaurant .... Is something I can not explain ..... Just Beautiful.   I definitely will be back.  To the Owner of Rocco's ....Congrats to your beautiful establishment!!!!", "author": "B B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "First of all ...i love Mexican food. I love tacos, fajitas and enchiladas. So since this is my first time to Rocco's , I decided to order a molcajate de carne. It was delicious. But the reason I came onto yelp was because of Eddie. Eddie is either the manager or shift supervisor. But he has to be one of the best managers on the floor that I've seen in a while. I'm very observant and I watched him help in every department in this restaurant. He is very attentive. And for that reason alone... I'll be returning. Thank you Eddie so much. \n\nBtw....the restaurant has a beautiful decor.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Terrible service, awful food. I was incredibly disappointed. Food had way too much salt. Wrong meal brought the first time. Then screwed it up the second time. Meat was a unique combination of bland and burnt. Choice of seasoning was terrible. Terrible margaritas as well. Incredibly overpriced for the tiny portions. The server took our order and then completely ignored us until we hunted her down for the bill,which was summarily tossed onto the table. I downloaded yelp just to write this review I was so displeased.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Went for happy hour \u0026 absolutely loved it. Their guac is AMAZING. The decor is so beautiful. Its a mixy crowd. Try the watermelon margarita it wont disappoint you its reallly gooddd", "author": "Debbie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "fuckkk yess taco Tuesday! this place is incredible. the tacos are terrific! every single one i had, and i had all of them, was better than the next! my favorite favorite was def the skirt steak taco! the steak is so tender, almost orgasmed eating them haha! we haf a pitcher of the mango margs and they were gpod too, i like the fact that they use real fruit puree instead of just synthetic shit. i also had thr blood orange marg and that was my favorite. they make the guacamole right in front of you and the spice index according to your liking! def coming back!", "author": "Ann N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Cory the bartender is amazing! National Margarita day and it's a madhouse.... this girl is literally running up and down the bar and still making time to chat with us... all while training someone behind the bar as well. Great first visit, I will definitely be back!", "author": "Kayla P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-19", "description": "Very noisy. Music was VERY LOUD. Couldn't hear my own thoughts. Tacos were OK. Flan was hardened and rubbery.\n\nMay try brunch later", "author": "N C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "Horrible service. The hostesses are incompetent. Rude rude rude. Food is ok, pricey for Mexican but the service alone is just absolutely horrible.", "author": "Melanie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "I would give more than 5 stars if I could. The first time my coworkers and I came here Rocco's picked up the tab because they thought we waited too long. Not us. \n\nThe staff here is always smiling. They are fast but efficient. \n\nI have yet to step into the tequila store however. I'm just afraid I might never come out. \n\nI have yet to have a bad experience here and I don't anticipate one. \n\nThe Ranch Water is my favorite drink here. It's simple but effective. I'm not into 12 different ingredients in a drink. Definitely come here if you want to leave a restaurant happy and full.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Viva Rocco's Tacos!!!! OMG my first visit was yesterday and how fitting since it was Cinco De Mayo!!! The bestie and I arrived around 3pm and was greeted by two smiling beauties at the entrance. We were immediately seated into a really comfy booth that I swear is one of the most comfortable booths I've ever sat in! Tall people will love this booth because it's higher up and has great room for your legs...to those of you who are vertically challenged; no worries there's a foot rest present to help you out :)!!! The bar is huuuuuuuuuge and looks like you can sit 25-30 people at it! The DJ was doing his thing in the corner and because of the time we went we were able to see the late lunch crowd and the influx of the afterwork crowd including the tourists! It was a nice mix of people. \n\nThe decor from the moment you walk in is amazing!!! Your eyes will be pulled everywhere; relaxing earth tones,  beautiful ceiling tile, custom light fixtures, rich leather, and beautiful wood Rocco's is visually stunning. The Tequila Room which is front and center upon arrival is beyond impressive. I believe I was told at least 400 brands of tequila are available at Rocco's and honey if you're a tequila lover like I am this is the place for you!!! They even have a Tequila Biblia (Tequila Bible) so folks it's really not a game here!!! Rocco's is serious about Tequila! \n\nNow let's get to the food shall we?\n\nSince there were only two of us we really couldn't order that much but what we had was great! \nWe were provided with tortilla chips that have this really nice spice added to it- not too salty but just right. I've read other reviews about not liking it but not the case here I loved it! We ordered a medium guacamole which is made table side and Rocco's did not disappoint! The guac was excellent and the spice on the chips complimented it well!!!\n\nWe ordered a taco salad, chicken chimichangas and the blackened fish tacos for lunch... Plus my watermelon margarita and my besties pomegranate margarita OMG all of the above was soooooooo gooooooood!!! Everything was so fresh, wonderfully seasoned and bright!!! For dessert - oh man we could hardly even finish this because we were soo stuffed beyond stuffed- was the Tres Leches cake! YUMMMMMMERS!!! \n\nNow I have to save the best part of my experience for last because despite great food and great atmosphere the service was top notch! Emerald was our wonderful waitress for the day and she's incredible! She has a great personality, great smile and great energy! We thoroughly enjoyed her and her attentiveness! She provided us with some info about Rocco's Tacos and told us about the owner who designed the place from top to bottom! I'd love to meet him one day! Truly! I love his design aesthetic!!! So a great big shout out to Emerald who we will request EVERY TIME we go!!! She told us which nights are the most \"turnt up\" (Thursday's) and that the DJ is there every night after 6 (btw he's pretty good!) she also told us about the private rooms and bottle service for private parties!!! We just fell in love with Emerald so she's it for us!!! Now I cannot stop at Emerald because we also had the great opportunity to meet and talk with John D! John D... is the sexy but sweet bartender who came over to our table to greet us and give us some useful information about Tequila. He personally invited us back and we can't wait :) lol. We didn't ask for our bus boy's name but when he came over to take our plates he asked (with a great big smile) if we were enjoying ourselves and said he hoped we would come back again real soon! So shouts to the sweet bus boy and to Jonathan and Bonnie (who didn't wait on us but did say hello)! \n\nListen people, I try to give great energy everywhere I go with sincere hope that it's reciprocated. The wait staff that we encountered yesterday must have been on the same page because everyone that stopped by our table gave us great energy! It's the type of place that makes you want to come back time and time again! Even though it's huge and yes it can really get \"turnt up\" I feel like it's the kind of place where they take the time to learn your name and your favorite drink!!! So hats off to Rocco's Tacos, Emerald , John D and the whole gang! We had an awesome time and will be back - a lot!!!  I suggest you go, try every margarita (we also had the mango and it was perfection), ask for Emerald or Bonnie (I hope that's her name) and meet John D!", "author": "Tami B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-08", "description": "So I ordered \"Roccos Tacos\" which are 3 mini tuna crudo tacos with avocado, lime, cilantro, salsa de pina...I was given two grilled fish tacos. It was not worth bringing it up, easier to blast them on Yelp. The grilled tacos were fine and actually I would give them 3.5 stars but overall it was a 2 star experience.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "One of my favorite places to grab a drink downtown. Jen and Currel (sorry if I'm spelling it wrong) make the absolutely best drinks, they are my favorite bartenders in Brooklyn. Jen always greet you with a smile and a pleasant and funny conversation not to mention she makes the best Strawberry margarita's ever. In fact if one of them aren't there I don't even bother staying.", "author": "Daniella S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-16", "description": "Original encounter was in January 2015\n\n\nShawn was our server.... Excellent service.\n\nZack: the manager was very inattentive\nIt took us over 30mins to get a response from the hostess for another table. \n\nWe sat around the bar area for over 30 mins waiting god Zack, until I went to the hostess stand to request a table. They were able to seat us in 20 mins. \nWe ordered some guac while we waited, not even good. Ice had better avocado w/ just plain salt and pepper than what they presented as guac. \n\nWe were finally seated and Shawn was our server...... YAYYYY SHAWN. He was Awesome!!\n\nThe food was ehhhh.... Some dishes came out steaming hit, others room temperature.... \n\nThis place is sub-par for my standards. If you love the Applebee's and TGIF's of the world then you'll love thus place, if not don't even bother!", "author": "Shea G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-19", "description": "Okay place for drinks and empanadas. Didn't really like anything else on the menu. Was excited to try the nachos only to my disappointment they were extremely dry and tasteless and piles with rubbery cheese. They definitely need to try a different type of cheese for the nachos.", "author": "KT T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "This is the place that my boyfriend took me for our 3 year Anniversary. Since we went on a Friday night, it was busy. The setting was amazing and looked like a trendy modern Mexican restaurant. But sadly we were seated next to an annoyingly loud group of people. Our server Parker was amazingly nice and friendly and constantly kept coming by to check up on us, but not to the point where it was overwhelming. As for the food, it was delicious but nothing that blew my mind away. Although, the Guacamole was amazingly good. They serve it in the Guacamole marble bowl that's already on the table along with some freshly made tortilla chips. Plus the highlight of it is that they make it in front of you. As for the drinks, that was also really really good. The drink I had was a Black Diamond Margarita. Although the 2nd one they made wasn't as good as the first one. With the food your better off getting a combo dish. Overall, I recommend this place and I'm sure I'll come here again.", "author": "Yasmine H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-17", "description": "I came here for lunch and was left very disappointed. For starters, the heat was broken so we all had to eat our meal with our winter jackets on which was not very comfortable. Secondly, the place was empty yet it took an extremely long time to get our drinks and food. Our waiter was very sweet, but about ten minutes after we ordered our food a different waiter had to come back to ask us questions about what we had ordered. One person in our group had ordered a fish taco and a shrimp taco and he came back to say they couldn't do that, the tacos had to be the same. That was a little ridiculous.. when the food finally came one of us got the wrong dish. I had the enchiladas and did not enjoy them at all.", "author": "Kelsey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "An expensive Chipotle with booze.   The food is exotic but way out of line.  Careful if you want guacamole. They will make it for $17.  Oye!\n\nShould just be a bar like TGIF..   the food is way out if line.  \n\nLike the failed Morton steak house that proceeded it.  Stick to just booze.", "author": "Njboating C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "The only thing that is outstanding is their guacamole. They prepare it right in front of you so they can accommodate your personal taste.", "author": "Edvige C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Kathy was the best server and a delight to come across. She is a great addition to this company.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "The food was tasty but the service was the best part of this trip. Alex made our guacamole table side and was very personable. He gave us recommendations and laughs. Our server was amazing too. Just a very welcoming environment with tasty food. Thank you for the stellar staff!", "author": "Andrea L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}