{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-16", "description": "I have no clue how people can give this place more than one star! I visit this place last nite with a friend As soon as We walk in the place seemed to have a great potential, decor was nice and colorful, music was decent, atmosphere was welcoming, the waitress was really attentive and helpful, we order a \"guacamole \" the avocado was soggy and the ingredients looked old, the guy making it was a great guy but he's guac if you can call it guac was nasty and tasteless! From the menu we order fry plantain (BIG RED FLAG) what Mexican restaurant has plain rain in the menu!? They where burn and dry! I ordered 2 ground beef \"spicy\" tacos and 2 fish tacos, worst tacos I have ever tasted (who ever judge taco bell as best Mexican food must of gone to this place before, because anything is better) she ordered Brooklyn tacos they tasted nasty the cole and cauliflower was dry and cold. And please let me not even get stared on the tortillas! Cold, hard, tasteless, and dry. I'll rather eat dirty than go back to this place.", "author": "Alberto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "Ok place for a quick bite to eat. Parking is impossible in this neighborhood  The fish tacos were tiny and overpriced. Update: kind email from the owner so Im bumping this up another star!", "author": "Antonio P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "This is a review of their happy hour which takes place 4-7 M-F.  They have $2.00 off drinks and $7.00 appetizers.  I had 2 margaritas which were good however they're drinks are about $11.00 and above and the l drinks were strong.  For Brooklyn its not a great price for happy hour especially when there are places in Manhattan with just as good drinks half their happy hour price.  \n\nThe bartender was less than helpful too she gave me the happy hour menu and didn't take my order. She had a little attitude. \n\nIf I go back it would probably be on Taco Tuesday and maybe get the Sangria. \n\nOverall experience, meh.", "author": "Bklynzizi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "Albert Lugo has been putting this dining room on his back from day 1. Excellent experience once again. S/O to Dr. Guactopus Terry as well. Putting that molcajete to use!", "author": "Alex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "First time here. Very nice decor \nCame here with a party of 5 sat in the back close to kitchen. \nFood took longer than expected\nWe ordered the \nGuacomole with seasones chips (must get)\nFish tacos\nJalapenos poppers (must get) \nChicken and veggie (must get)\n\nEnjoy", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "Good food good service nice place.\nFloyd Leslie is a real professional waiter and explained me in details each and every delicious choices of the menu.\nStrongly recomended.\nJorge", "author": "Kaspar H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "The only two things i like about this place were: frozen margarita and nachos. I ordered them every time i came here... (and i only come here because it's next door to work). They were so bad I almost didn't want to pay for it. The margarita was frozen mango juice with no mango flavor. No a single drop of alcohol. The nachos were made with all broken chips. It looked like the left overs from the bottom of the bag. So disappointed. I told the waitress and she looked at them and didn't say anything. I'm not coming back here again.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "My inclination that this establishment was mediocre unfortunately turned out to be correct. While the margaritas and guacamole were decent, the fajita dish for two was both extremely overpriced and revolting. I'm not sure what type of sauce was used in the medley of different meats, but I will surely have nightmares about it.  Also, don't expect much of the sides that come with the fajita, because there are barely any. To anyone reading this, PLEASE try a different Mexican cuisine restaurant- totally not worth the 50 dollars a person that this meal cost.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-02", "description": "So far my experience has not been great. My little sister recommended this spot because she came here with her crew. She raved about the food and drinks. \n\nSince I walked in, I was immediately greeted by a pleasant hostess and an eager-to-serve waitress who took our drink order. When she came back around to our table, 15 MINUTES LATER, she asked what were the drinks we ordered. How difficult is it to remember two mango margaritas??\n\nWhen she finally brought the drinks, she wanted to know if we were ready to order. Of course we were! WE HAD 15 MINUTES TO CHOOSE OUR FOOD! \n\nWhen one of the managers, who came out of a Managers-R-Us kit, super cute btw, was walking around to check on the customers, I waved him over to our table. I asked him if he remembered the time that we came into the restaurant. He correctly answered, \"about an hr ago. Is everything ok?\"  I gave him the min-by-min of our experience so far. And I didn't even mention the fact that the ladies' room, that had 4 stalls, had no toilet paper NOR paper towels. What was I supposed to do? Bring my dinner linen with me to use the bathroom??\n\nFinally the food came... the order was wrong. I'm done. I'm OUT. BYE FELICIA!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "The guacamole is heaven , they make it fresh at your table with an assortment of toppings and a house brand of seasoning which is awesome. The seasoning they use is available for sale so that was a plus for me. The food was amazing , I had an assortment of street tacos (crunchy ) the chorizo, the ground beef , the chicken . In addition to my tacos I had the black beans and seasoned rice\nTo compliment those awesome tacos. The only thing that wasn't great about the experience was the wait . So once we where sat ,we waited about fifteen minutes before we greeted by our server. There was a gentleman who walked over to us and then said oh wait your not my table , but never did he say I will find your server , it was rather awkward . Now once we got a server she was very pleasant very efficient , the food wait took a little while but that wasn't a reflection of her that was the kitchen . I would definitely return , how ever they need to\nImprove on the time it takes for the server to greet the table , 15 minutes is a long time. I mentioned this to Management on the way out , I told him I set the timer on my phone so I'm not embellishing the time at all. The over all experience was cool despite all of the waiting , please please try the guacamole!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Great, chill spot for lunch and dinner. Went there for dinner with a big group and they were very accommodating which I love. I like the vibes in there and the food was good too. I had tacos shrimp and fish. I like the shrimp better because the fish was a little bit dry for me. My favorite part was the guac, simply because they made from scratch right in from of you. Overall chill spot", "author": "Jasmina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "This was my third time going to Rocco's and I was pretty embarrassed. I talked so highly about this spot, even had a double date with my best friend and they weren't too happy. \nThe host was pretty rude to my best friends husband...\nWe waited for about 15 min to get seated and tried to enjoy ourselves, I jumped on yelp to check the recent reviews and what food looked appealing. \nWe were greeted by the friendly server which changed the atmosphere, until we had to ask twice about our appetizer (The guacomole) We noticed people who came in after us were getting there guac prepared before we received it. We spoke with the server at first and she apologized and asked one of her co workers who made the guacomole whats going on; he rolled his eyes and walked away and she said thats what im dealing with. #MESSY...We just wanted our guac lol no drama. Sadly we waited so long I had to go the manager personally. Tifa the manager corrected the situation and noticed the same rude worker went to the wrong table to make the guac...all this confusion for guacamole ughh \nI checked in on yelp and showed the server she wasnt sure so she called the manager.\nThe check in offer doesnt work anymore btw prob should update it we were pretty bummed about it.\nI ordered the shrimp quesadilla that was really yummy and my boyfriend got the baja tacos.....his rice was not fully cooked it was as if they were rushing and threw some uncooked rice in his plate. I was in disbelief. We didnt have the energy to complain just got a margarita and quickly ate and exited.", "author": "Zenda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "Worst possible service with the bar server very selective un-attentive only to us, loud obnoxious rude shall I continue, we have never had that type of treatment before, and what I believe was a manager came and saw yet didn't do anything. We all quietly left and went somewhere else .", "author": "Sherry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Top notch service!  The food came out really quick for how busy they were. Kid friendly. The Jalapeño Margarita is worth a try. The steak quesadilla was phenomenal and the table side guacamole was fantastic!", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "Food is decent but pricey ($6.50 for a carne asada taco, really?). The service here needs much improvement as well.\n\nFirst, when my boyfriend and I approached the hostess, we asked for a table of two. The hostess knew I was addressing her, she was looking right at me but her colleague decided to keep talking to her about non work related issues and she turned away to pay attention to her colleague. Afterwards she had to ask me to repeat myself because it seemed more important to talk to her colleague, then to keep listening to me. \n\nSecond, our interaction with our server was brief and quite awkward. She came and introduced herself and then asked right off the bat what kind if spice level we would like for the guacamole. As if she just assumed that's what we were going to order it and then awkwardly stood there without saying anything. We told her we were ready to order and she just said yup, I'm ready and didn't take out a notepad to take our order. Which is fine, but she ended up getting our order wrong.\n\nWe had ordered the Enchiladas Rojas (Pork Enchildas) but we ended up getting up getting the Enchiladas Verdes (Chicken) instead. We also wanted to order a drink as well but since she never came back, it seemed like worthless to even bother. \n\nThe table side guacamole was a nice touch but there was a bit too much lime juice in it. The elotes (my all time favorite) were nicely presented but just tasted like warm corn. Needed a bit more mayo and cotija cheese. The enchilada and taco itself as okay, but not really worth the price since I've had terrific tacos for much less.\n\nDon't expect too much from this place. Wouldn't come back.", "author": "Yanni C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Went in today for lunch for the very first time and had an amazing experience! Our sever Melissa was incredible. She was welcoming, knowledgeable about the menu, and very informative about the tequila. The food was delicious and the drinks were fulfilling. We can't wait to come back!", "author": "Brittany L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "Nice place a little $$$$ not really mexican food( texnewyork) style \nThey have a great selection of tequila with a price??????. The guacamole did is very nice and plenty\nNice place to drink\nThe food???? Not really", "author": "A D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "It's a gaudy Mexican restaurant and bar. They deliver exactly as advertised. A guy will come by with a plastic mortar and pestle designed to look like stone and make overpriced guacamole for you, there are day of the dead decorations up year round, they make really sweet frozen margaritas, and there are bottles of every tequila imaginable all over the restaurant. It is nothing if not inauthentic. It really doesn't belong in New York. I am a sucker for it though. \n\nIf you come here, I recommend sitting downstairs, it's generally quieter. They also rent out rooms down there for private parties, if you're doing a birthday thing.", "author": "William J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-07", "description": "The problem w this restarant is customer service\nI have had a minimum of  15 visit to this Restrarant since  I live in Brooklyn ... and downtown Brooklyn is where most of my business takes place... Over the years my opinion has remained the same ... lack of customer service... not only do they not listen ... but the \"ck in\" will be minimum it will take you 20 min to get to order and another 20 to get a d", "author": "Sharon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Rocco taco is a nice spot in Downtown brooklyn. They do unlimited tacos on Tuesday and you can order different tacos every round which was pretty nice, the drinks are great, strong and tasty.", "author": "Duvesh N."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}