{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "This place is awesome! Came here with a friend to get some food and drinks. Ended up getting a pitcher of margarita with a good amount of alcohol, wet burrito for me and the corn thing for her. The waitress was nice. We took advantage of the free shot of tequila when you check into yelp. Only took of the star because I thought it was a little too expensive for mexican food.", "author": "Shema P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I took a friend here who was visiting Brooklyn heights, and not once stepping foot into Rocco's, I new this would be the perfect opportunity to check out this novel venue. Surely it was novel! \n\nIt is a rarity to come across a restaurant whose food and customer service complement one another in a genuine fashion. Rocco's Tacos is truly an upbeat experience seizing your curiosity with its warm outside lighting and spacious real estate. The decor in this restaurant is fascinating, filled with a variety of Mexican skull art, chandeliers, and tequila bottles in every shape and size one can probably imagine.\n\nThe food is delicious and the variety is plenty! Not familiar with the breadth of Mexican food, Whitney our server was the best match for our table. She took her time in explaining every dish at our disposal, from their texture to aroma. The vivacious atmosphere was perfect to catch up with a good friend and to unwind. \n\nThe staff here truly wants you to have a good time and  make the effort to be sure that you are. This restaurant is perfect for everything from family dinners, a date, friends, and even a work related meeting. Their two floor seating spread has every type of lighting and exclusivity to accommodate you.", "author": "Omid A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Best spot to go to for great food, fun drinks and music.   The ambiance is great as well.  Love it", "author": "Dawn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Food and service pretty good. Try the chicken quesadillas or shrimp quesadillas or shrimp tacos you can not go wrong. Drinks are on point. Bathrooms need some updating but each bathroom stall has its own tv where you can watch a Mexican movie as the forces of nature are released from your bowels. Anyway try this place out if you are craving Mexican food and in the downtown Brooklyn area. Next door to the Marriott so you can't miss it. Enjoy! :)", "author": "Alice A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "\"Guacamole not bad but not - ya know - NOT something that blows you out of your mind\". I did not enjoy the tacos....And salad seemed like it was pre packaged - dry, limp, tasteless. \n\nDecent for a corporate happy hour given limited options in the vicinity. Would not go otherwise.", "author": "S B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "This place is very cool from the Decor to the food. Also had an AWESOME waiter by the name of Milton!", "author": "Tatiana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Portions were really good. Had two fish tacos. Love the way the fish was a whole piece and not chopped into itty bitty bites.  You have a choice of blackened or grilled. Obviously I chose the grilled, love tasting my food. My friends ordered the quesadilla and pulled pork tacos. Service was great and we were seated within minutes. Must try the guacamole and chips! The only thing I would recommend it to not sit by the doors, especially during the winter time. There was a draft the whole time, my friends and I just got colder and colder. Would definitely go back again!", "author": "Judy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Finally decided to try this place and my experience was great. The salsa tasted great. I got a pitcher of the house Margarita for $30 which gave us 5-6 drinks (Definitely worth it!). The Sopa de tortilla I would definitely recommend. DJ was good he played every genre. I enjoyed the overall atmosphere. I will definitely be back.", "author": "Yomaira C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "The food was amazing came with a friend we both enjoyed the food i had the surf and turf Molcajete and she had the seafood molcajete had two maestro dobel siver shot and pitcher of cadillac margarita the guacamole with chip was amazing next time have to come on a Tuesday for the all you can eat tacos....", "author": "Rafael O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "I've had the fish taco which was not good, at all. Small piece of fish, lots of filling. The margaritas are ok...but not as good as you would think they would be coming from a tequila bar. They taste like they're poured out of a pitcher. We ordered 2 different kinds and could not tell the difference, which is odd considering mine allegedly had gran marnier in it. Couldn't taste that at all. The chorizo taco was way too salty, but the chicken tacos were good. It's a very comfortable atmosphere and I will go back mostly for that and the sub-par food.", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Today is National Margarita Day and the rockstar behind the bar tonight, Cory, is not only providing excellent service and making everyone feel accounted for, but she is also training a new bartender this evening!!!! We sat at the bar and she immediately told us the specials, asked what we wanted, and gave great advice on the happy hour options.... My friends and I have been here a few times getting a table in the restaurant and have been quite disappointed in the past. However, after tonight, I will definitely be returning (and sitting at the bar) with the hope that I get Cory's service!", "author": "Stephen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "The decor, service and food get 2 thumbs up! Met a friend for lunch and was allowed to have privacy while being attended to. The guacamole server was insightful and begun our meal experience with professionalism and courtesy. The sangria was smooth and offered the perfect drink to our salad and tacos. Will definitely  be back. Oh and the bathroom had tvs in the stall!!!", "author": "Darnise P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-05", "description": "No Mexican music, personally I didn't feel welcomed but the staff was helpful and the food was alright.", "author": "Leonardo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-16", "description": "LOVE the NACHOS and the food, but the service and consistency is bad.\n\nThe service is BAD!  teh Hostesses seem to all be very clueless. AND there are three of them, usually.  Everyone seems to have an attitude and their customer service skills are severely lacking!  Also\n\nTHAT said they can all kiss it, because the NACHOS is where it is at. reasonably priced for the size, this may be only reasonably priced thing on teh menu.  the Guacamole is good but its 12$ and made with maybe 4 avocados, and really cost about 4$ to make. for 12$ i want more guac, please!\n\nThe Quesadilla with plantains is amazing. and i love the nachos, its better if you get them at the restaurant but i cant always do that so i order at least once a week. - which sucks because the hostess on the phone is AGAIN, clueless, it took 10 -15 min to order an order to Nachos. and she couldn't give me a total on the phone and didnt even offer to get me one. maybe get smarter more qualified people with better attitudes for your establishment because there are lots of people who would be grateful to be working and could work there way around a phone and an nachos order.", "author": "Lorraine Lola W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "First off I would like to THANK Brittney SO much for putting up with a \"Annoying Pregnant\"lady . My friend and I ordered the empanadas ,and they were filled with grease , so we sent them back . I ordered the burrito and when it came i didn't  like it . I FORGOT it came with sauce and cheese . Although she reminded me it did , i just didnt care . Long story short sent it back again for everything on the side and everything worked out ! I Must've  sent that girl back and fourth several times but she not once showed  any kind of frustration . I was just being difficult and she made me happy ! But my tip made up for all my nonsense.  Everything else was great . Thank you Brittney again !", "author": "Millie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "The FRIES though. SO GOOD. I don't know what they do with those fries but for that alone I'll give this place 4 stars. Besides that the food is good and it comes in very large portions, the drinks are mehhh my drink was so watered down that I thought I was drinking straight juice.", "author": "Erika S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "The worst place in the world. I would never come here again. The food was nothing to brag about and the service was horrible. When I say that I would rather eat a taco from the truck I mean that with every fiber in my body. I don't understand how this resultant is still in business. It was truly the worst experience ever. The waiter Devin, never came to check on us to ensure that all was well. We ordered the bottomless brunch and was only served one mimosa and was charged for 2 white sangrias. To make matters worst, the food tasted as if it was scrapped from the bottom of a trash can and placed on a plate. I was too disgusted to even attempt to eat anything further. The guacamole guy was very respectful and polite, but he ended up splashing onions and spices in my eye and basically told me that was good luck. SMH.... This place will never ever see me or any of my friends here if I could help it. IT'S THE WORST DO NOT GO AND DO NOT WASTE YOUR MONEY.", "author": "Steven W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Love this place came multiple  times. Food is great drinks are great. Staff is great. Only one complain when they sit me rite next too a next table. If I'm on a date I don't need the next  table hearing  me word for word. Like give me some dam space  but even with the seating  issue  I can honestly  say I love this place love the food and that wat it's about for me", "author": "Nakita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Drinks are a little on the pricey side but it's well worth it. They use top self liquor so their drinks are super strong. Food was excellent and comes in large portions. I gave 4 stars instead of 5 because our server was not attentive and kept forgetting what we asked him to bring.", "author": "Tasha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Quickly becoming one of my favorite restaurants to eat at. With one of the most friendliest staff teams I've ever seen, the pure definition of great customer service and their choice of music is phenomenal. I truly suggest that everyone stop by and give this place a try!", "author": "Carl M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}