{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "The 4 stars are ONLY for the drinks \u0026 guacamole. The soft taco shells taste like they're from a box \u0026 the sauce that came w/ it tastes like it came out of a can.  The tacos at Chipotle or any other local taco spot taste waaaay better. If you're going to go here you must have the guacamole bcs it's freshly made \u0026 the chips that come w/ them are seasoned. Eat dinner somewhere else or make your own supermarket tacos at home.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "When I arrived, I was immediately seated, which was great! I don't typically like guacamole, but I liked theirs because it didn't habe all that extra stuff in it. I ordered the chicken taco platter, but when my food arrived, the rice was cold with a few warm spots. And the tacos were COLD. I wasn't sure if it was meant to be served that way. I asked my waiter about it and he nicely returned it to the kitchen. While I waited about 10-15 minutes I sampled my husband's mahi mahi tacos, which was delicious. When my food finally came back, the rice was warm, not hot, and the chicken tacos were COLDER than the first time. I had to ask the waiter about that again.  He was nice enough to send the manager over, who took $27 off of our bill. I do not know what was going on in the kitchen. Overall, the waiter was very nice despite the mess up with my food. I think I'll give the restaurant another shot.", "author": "Odessa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "My first time here was this past Friday afternoon.  I didn't like the food maybe I picked the wrong entree.   It was the mercado tacos it was plain and had no flavor. The drinks on the other hand were amazing! My friends and I ordered the margarita pitchers great deal and the drinks were strong. Will return again for drinks.", "author": "Aisha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-23", "description": "Came for dinner last night around 8:30 and got seated right away but once we were seated waiter took forever too come to the table and asked what we wanted to drink or anything....ordered chips and  guacamole, chips came out right a way but took over 20 mins to get the guacamole... Took over a half hour to order a meal and got my food over a hour later mind you the place wasn't busy horrible service!!! just couldn't wait to get out", "author": "S B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "Decent Mexican restaurant but waiters and hosts/hostesses are very good. Great service but I have had better Mexican food. This restaurant would make the upper 65 percentile though.", "author": "Joshua M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Does this place even need another review?! The guacamole is a must \u0026 the food is great. Our waiter was super nice and got us free shots when the bar messed up ours. The dj was great and better than most places I've been. Definitely will be back!", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Awesome food and great drinks by our bartender Curel... awesome night to say the least", "author": "Joey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "I went here on a date let me say the atmosphere \u0026 décor \u0026music was nice.  The wait was suppose to 15min but took much longer they finally called us and made us stand their for another 5 minutes or so to be seated. There was a lot of debate going on the hostess with the long hair seemed to have an attitude with us and didn't want to seat us. Another young lady came and sat us downstairs follow her instructions by the cocktail area not a table (we were there for dinner not drinks) it was very uncomfortable (we're both tall) and no one else was seated in this area the whole time we were there. When our waiter came over he was also surprised they sat us here. So we asked him and the hostess that sat us to change tables which they did. The food was good and our waiter was very helpful with food suggestion and service (didn't get his name) this saved the evening!", "author": "Channing G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "Let me be upfront- I LOVE this place. However, have to deduct 1 star for servers/bartenders. I've been here 3 or 4 times since they opened (my favorite spot on this side of town). Food is delicious, drinks are pretty good. Servers - meh. I'd say they're trying too hard to be \"Brooklyn\". Good spot though, albeit a little pricey.  \n\nI've had the molcajete carne and the guacamole. Chips are good too!", "author": "Jay L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "Too loud. Decent food, but impossible to have a conversation. We were there between 8:30 and 10:00 pm on a Friday night. Even if you yell at your table for four, odds are the person across from you won't get what you're saying the first time around. I mean like club loud. \n\nIn terms of the food I had the chimichanga and some of the wet burrito. Both were okay. The queso fundido was phenomenal appetizer, but the guacamole was super bland. It was essentially just avocado and needed salt.\n\n I'd just as soon skip it than ever go back.", "author": "Owen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-13", "description": "This review is regarding Rocco's Breakfast stand. The employees are polite however they NEVER open on time and when they do they hardly ever have the ingredients to make the breakfast dishes. After visiting Rocco's (on my way to work) in the morning over the course of 2 months, out of 10 times (the window was actually open) I only walked away with a breakfast burrito 2 out of those attempts! And one of those burritos had no potatoes. When I purchased the burrito without all of the ingredients on 12/21/15 I complained about it and my past grievances and the cashier was nice enough to offer a free burrito next time I visit for my trouble (or so I thought). I returned the next day 12/22 and they weren't open on time so I had to go to work. I returned the day after that 12/23 they didn't have all the ingredients for the burritos. (I wasn't in the area for 12/24 - 12/27 because of the holidays). On Monday 12/28 I attempted to get a burrito. I AGAIN no potatoes for the burritos. The cashier actually told me not to come on Mondays because they NEVER make the ingredients they need on Sundays for Monday mornings! 12/29 They are about to open (late as usual) and the cashier asks me to wait 5 minutes. It is ice cold outside but I wait.. after waiting in the cold, at her request, she informs me that there are no eggs! Clearly I'm a glutton for punishment so I come back on Wednesday the 29th. They are open, and they have all the ingredients I ask for by promised burrito and and the cashier says to me \"Oh I never promised a free burrito, I said Chorizo\". Now I had been to this stand 4 times since her promise on 12/21 each time I spoke to her and said burrito.she never once corrected me. Naturally I am pissed. I am a regular customer and have spent a lot of money in their establishment, but no more The food is good albeit pricey. If I am paying $10 for a burrito. I know I am paying not just for quality food but for impeccable service. While Rocco's does have good (not the best but good) food, the service is TERRIBLE.", "author": "Ayanda W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-19", "description": "Nice place. Great decor and theme the skulls are a nice touch and service was good but the food was blan no flavor at all. Would go back for drinks and guac but never to eat again.", "author": "manny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "The food was good, and the tequila selections were awesome. Really enjoyed ourselves.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "Party of 3 had to wait about 45 minutes on a random Wednesday night, but the guacamole, frozen margaritas, and decent grub overall made it a fun night.", "author": "Chikky T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-27", "description": "I've had better Mexican food at Yummy Taco", "author": "Cyreesa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Place is super ratchet , I went to eat with my wife and they ask me for identification before I was seated... I was never asked to show ID in my life to eat at a restaurant... They would never do that if it was all white people... I would never go back to this place...  Food was not even that great and service sucked...", "author": "kip c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Been here twice absolutely love the burgers and the place it self love and everyone is so nice and the bar is amazing and gorgeous", "author": "Ariel F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "Dear Rocco,\nI usually don't write reviews but I had such a bad experience today at brunch I felt it was necessary. I have dined at your brooklyn location the weekend you first opened and the service was better than today although there were less customers today. To start out we were seated at 2pm and our waiter didn't come till about 2:35 when we talked to the hostess. We were starving so ordered guacamole as an appetizer and our food at the same time along with the ulimited mimosas since we noticed the server was taking a while. It was almost 3pm when we got our entree and shortly after the mimosas. We asked what happened to the guacamole as an appetizer and she went to check on it. My food was room temperature like it was sitting in the kitchen forever but at least my friends was warm. Half way through our meal the (appetizer) guacamole was finally brought. We had been long done with appetizer and asked for another mimosa as soon as we saw server because she barely stopped by. We asked for another mimosa, our 4th, and the check. When the waiter finally came about 20 minutes later with the check she let's us know they were out of champagne for the mimosas! That was the last straw I complained to the server about what was going on. I waited forever to be waited on, got cold food, then had only 3 (unlimited) mimosas for brunch. I am not blaming the server but other tables were complaining as well and you could tell she was assigned too many tables. For a Sunday  brunch they seemed to be really understaffed. She explained to us that the general manager had quit and they had ran out of champagne and avocados this week. She tried to offer us dessert on them but we just wanted to go. Then the bartender asked us how our meal was and we told him what.had happened. He told us the same thing that they were going through lots of changes in staff and that he was sorry. Overall it was not the Funday brunch we were expecting but rather very dissapointing. Definitely not up to standards as the Florida locations.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I really enjoyed this place. Music was great. Food was awesome. Our waiter Shawn was really cool. Helped me out with food decisions. We even got free shots!!!!  I'm definitely coming back here.", "author": "Alessandria E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "I came here on a Friday night with my boyfriend. The first thing I noticed was they have really nice decor/atmosphere. They have mexican death mask stuff mixed with western cowboy stuff. They have a massive amount of tequila. There must've been six pages of types to choose from in their Tequila book. Anyway the chimichanga was very good and my waiter was nice and attentive. They have fun music blasting (sounded DJed) so it was definitely a party type atmosphere, which I liked. A few people even started dancing a little. The bad things about this place would be the long wait for a table (it was a peak time so we waited almost an hour--it's just very popular) and the lack of penis photos. Let me explain: The men's bathroom is covered in photos of naked women but the women's is not covered in naked men. Quite sexist. Add some beautiful dick pics and I will return the star I subtracted.", "author": "Milhouse N."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}