{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-08", "description": "Service was great, but the food made me sick the next day. It's a really nice atmosphere, and great service, the waitress was attentive and cared. But the food was just not good, and very over priced 2 tacos meal with a side if rice and salad 12.25 lol .. wow. I have been there twice and both times the restaurant fared the same way..", "author": "Yaniv A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "I absolutely love this place! I made reservations for my birthday for 16 people and everything went amazing! The service was great the food was amazing! The vibe in that place is so nice and laid back! The waiters are very attentive. I most definitely recommend this place it's great for a huge group as well as just a spot to have some good drinks and good food!", "author": "Vanessa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "The drinks are not strong.  We had a pitcher of margaritas, I wasn't \nImpressed.  The atmosphere was ok.  Even though a fight \n broke out.  Management did a good job handling the situation.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "I came here to  meet up with my friends and all I got to say is that Zena is fucking amazing! And she made our experience magnificent! =D", "author": "Anabel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Great time @ Rocco's. Jean and Zena are phenomenal! Ask for either one and you'll be more than satisfied! I have been here about 5x and every time as been excellent.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "The first time I went here was with a couple of girlfriends for Galentine's Day and we had Jean as our waitress.  She is absolutely amazing!!! She was very attentive to us making sure that we were okay and that are drinks were constantly filled for unlimited mimosas!  On Sundays NY isn't allowed to serve alcohol until noon so at literally 11:59 am she had mimosas ready for us! She was very personable and really cool to talk to!  Definitely my favorite experience I have ever had at any restaurant!  I've been back here and I only ask for Jean to have as my waitress. She remembers me and gives me a big hug!  I couldn't ask for a better experience at Rocco's Tacos!  It's a little out of my way since I live in Manhattan, but it is always worth the trip.  I can't wait to go back soon :) The food is super delicious and the portions are huge so you leave with a full stomach!  I recommend ordering guacamole and chips...it's made table side.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Nice environment, good food and drinks.  They could use and extra bartender.  Not bad for large groups of people.", "author": "Jason Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "I see the place all the time, I hear about it all the time and finally went. Great experience as a 1st timer. The waiter AARON was excellent. Very personable, outgoing and very attentive. The manager ZENA (hopefully I spelled it correctly) was also very outgoing and attentive. The food was excellent. I'm not really into guacamole BUT since they make it right in front of you I decided to give it a try and it was delicious. Only disappointment was that some of the drinks are not offered or available in a pitcher. One drink that should be offered in a pitcher is that WATERMELON KISS. That drink was so good. Please look into offering some of the other drinks in pitcher form. Definitely will be going back. As a matter of fact, maybe today just to see how the brunch is.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-08", "description": "The Applebee's of Mexcian dining.\nOn the plus side, it's a large menu.\n\nWe ordered the \"table-side\" guacamole and seafood tacos (shrimp, grilled fish, etc.). Food came out fast (good). Food quality seemed ok, but lacked any real substance or authenticity. Mind you, I'm not unaware that good Mexican food in Brooklyn is rare, but I was really optimistic about this place (despite that it's a chain). For what you get, it's too expensive (lunch with drinks was ~$70 + tip). \n\nWhen we walked in and asked for a table (around ~1pm-ish), the restaurant was largely empty; a few booths with people, but tons of tables and bar stools wide open. Oddly the waitress asked if we would wait 5 minutes to be seated so that they could clear a table for us. So, we just opted to sit at the bar rather than in the twilight-zone dining room. \n\nAt the bar, it took the bartender ~5 - 7 minutes to notice us (again, most stools open), but when she did, she gave us menus (good). From there, service was fine.", "author": "josh s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Went last night to Rocco's.... great spot. .. upbeat party fun atmosphere. ... decor was awesome. ...tequila list was great... the tequila room when you walk in was one of the best I've ever seen.. .. was like a Giant glass tequila humidor....loved the private rooms behind the tequila room with the milagro branded chairs... I want them.... the drinks were great... the dj was great playing dance music from all times...  ceviche of the day was out of this world.. . The roccos tacos app were very good... they were tuna with some sort of cinnamon seasoning.... nothing like I've ever had..   the queso fundido which is one of my favorite things to eat was just ok... was kind of in the soupy side.... wasn't impressed with that.... the chips and salsa were great! The chops have this Chipotle pepper type seasoning that's great and the salsa is a chopped tomatoe one...  like a Pico de gallo..... loved it.... the table side guac was good...I like mine chunky but they mashed it to puree.... so make sure you ask for it chunky.... the tacos were good... small .... almost like they should give you some more for the money but really good... at least you have room to try alot... service was good and the manager came around to make sure everything was good....  the only reasons for giving it 4 stars and not 5 was the queso fundido..... the size of the tacos.... and because my friend was just down in Florida saying let's go to Rocco's in Brooklyn for taco Tuesday's.... he had said how great it was with all you could eat tacos .. but they didn't have the same special in NY... guess ill have to take a trip to Florida ;)... still a must try in Brooklyn! !.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Great staff, nice ambience and plasmas in the bathrooms! I went on NYE the owner gave everyone free tequila shots!", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Very nicely decorated restaurant with 2 floors, food always comes out good and drinks are always strong. Will definitely continue to keep going here.", "author": "Met R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "I've been to this restaurant several times, but yesterday was one of the best experiences I have had there. My bridal shower brunch was held there and the service was simply impeccable. We were given a choice as to where to be seated since it was a special event and a large group. We had two servers so we were always taken care of, The manager also gave us tequila shots on the house due to the special occasion. Our drinks were never empty, our food was brought out in a timely manner and plates taken away as soon as we were done eating. Thank you all for such great service. My bridal shower was amazing. Highly recommended this Place!", "author": "Natasha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Went here with a group of friends for a surprise welcome back to NYC party. \nAmbiance: stunning!\nStaff: 10 stars! Our waitress was the sweetest and very attentive!\nFood: WOW! Had the Oaxaca Combo...umm best chile rellenos since I have visited Mexico!\nDrinks: This place is like tequila heaven. The margaritas are amazing and everything is top shelf with a prices that welcome you to try anything.\nOverall, its a great set up, organized and very well run. Highly Recommended!", "author": "LaLa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "Worst service ever. Sat for 25 minutes made eye contact with several servers and no one came to take our order. One server acknowledged that we were ready to order and never came back. This place is a joke.", "author": "L S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Not the best, not the worst. More of a \"I'm craving Mexican, and Rocco's is the closest place to me that does that well enough.\"", "author": "S. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Amazing food. Great staff. Unlimited brunch deal is great. Highly recommend this place. we had a group of 30 and our waiter was Jean and she was absolutely phenomenal.", "author": "Christana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Jean is THE BEST! Very attentive, great attitude, made my experience amazing! She handled our very large party so well. We will be back just for her. Went for brunch and the food and drinks are great.", "author": "Simone R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Most amazing mexican restaurant ever!The service was amazing thanks to jean our awesome waitress.The tacos were delicious I ate three.must I say! The Mexican brownie chocolate sundae was to die for. A must vist", "author": "Sullivan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "I came for brunch and was very pleased with my meal. I started off with the chicken tortilla soup which was a bit cold but delicious! I took advantage of the bottomless Bloody Mary which they couldn't serve until noon(since I arrived at 11:50, that's wasn't a big issue at all). The Bloody Mary was pretty good and a little spicy, just the way I like it. Lastly for my entree I had the grilled fish and shrimp tacos. They were pretty tasty as well so my overall experience was good!", "author": "Lanaia E."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}