{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-23", "description": "I had gone to this place last year for my 50th birthday, and this year on my 51st I decided to go again, but was not pleased.\n\nThe drinks, which I bought by the picture were weak, and while the food was fairly good the big problem was we were downstairs and it was like being in a steam-bath. Either the air-conditioner was out of order or it was way to low. My wife who is disabled asked several times for the A/C to be turned up (or on) or at least for some sort of fan to be brought in, none of our requests were honored and we had to cut the party short due to our guests complaining of discomfort.\n\nWill go elsewhere in the future.", "author": "Mitchell R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Probably my favorite taco spot in Brooklyn. The service is always great and the food is always fresh. You also can't beat their specials or their drinks. This place is close to my college campus and I stop in on Tuesdays during my dinner break.", "author": "Samantha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "A little pricey, but the food is always awesome.  Great margaritas, live DJ.... good music. And the decor... i absolutely lovvvve it!  Check it out. Ask for Kathy, she's a great server! Very Atttentive", "author": "Selina W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "In person it was so-so. Salsa had no flavor at all -- just diced bland tomatoes with some cumin or something awful. Decided to try delivery for a second chance. On Seamless they were advertising a 30-40 minute wait. So I ordered $65 worth of food. An hour and a half later, still no food. Called and was put on hold 3 times. The last person said I she would call the driver but he should have been there because he only had 1 other order (lie). She said she would call be back to let me know, but I never heard back. I called Seamless to cancel and they called the restaurant and told them not to come. Who do you think showed up a half-hour later? LOL. See ya. NEVER AGAIN.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "Let me first start off by saying this was my first time being here and I wasn't expecting much \nThe drinks they have are a bit pricey and not necessarly that great either - a Bit watered down for my taste , the tacos were good as me and wife had fish and chicken , Most of the staff were okay . NOW as of this date the NBA finals were on and most of us patrons were drinking having a good time and still eating watching the game which could have been the last game of the finals as The Warriors were up 3-1 in the series. AS SOON AS Half time kicked in at 1030pm the staff decides to turn off the Tvs and inform everyone that they wanted to leave early - a Whole hour and a half earlier then 12am. They started cleaning tables and taking pitchers with drinks still in them , needless to say this pissed off a lot of people there . Clearly its the finals we want to stay and watch the game and enjoy ourselves. As they start turn off the lights we spot the staff fixing their own drinks laughing it up and I had to call over to them to get my card back in which was practically tossed at me with my bill ( a whole 99 bucks) . This was the Rudest BS I have ever experienced in my life and me and my wife will not be coming back here ever again.", "author": "Roberto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Lots of tele's, and very helpful staff. Always busy.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-15", "description": "This place is a piece of shit, food wise. My tacos were sweet almost like candy and the wet burrito smelled and tasted like chefboyardee,  which I could buy in a can for a dollar. The ambiance is nice and the chips are good but the food was below par and way too expensive. Overall if I could give it half a star, I would. The service was alright though.", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "I will admit, I was skeptical about Rocco's when they opened (they occupy the space that was previously Morton's, and I LOVED Morton's. That, and I'm always skeptical about chain Mexican restaurants (with the exception of Rosa Mexicana)), but after my 5th visit I feel comfortable saying that it is a good spot.  Mexican/Tex-Mex food is one of my faves, so I am probably more critical than some, but I haven't had a bad meal yet.  I usually get the Mexican Cobb Salad (which I love--tasty and hearty portions), but recently I had the shrimp quesadilla and it was awesome.  Very flavorful, with big shrimp, and plenty of them.  Was there today and had the rock shrimp taco special...another hit!  Also had guacamole with shrimp and crab, and it was excellent.\n\nBut what I love the most is the customer service.  The waiters are always pleasant and professional, and today when my order took very long, they comped me for it, as well as gave the table a round of shots.  If they remain as attentive to their customers as they were today, they will always have a patron in me. Just wish they weren't so pricey. (the only reason this review didn't get 5 stars)  \n\nFYI, Neville is a great server.", "author": "Tene W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Went here after work one day and the atmosphere was amazing!! Tons of people with great music and margaritas!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-27", "description": "Front reservation could be improved. Was told a 30min  wait for a table, and they're supposed to text you when the table is ready. Never received text \u0026 table was cancelled even though I told the front girl I'll wait at the bar. She could've checked. Maddy the bartender is the greatest. Ask for her. Came on a wednesday. Food, especially the nachos \u0026 empanadas, are great.", "author": "Simone W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "The food is ok. It's nothing special honestly. Atmosphere is nice and the servers are friendly. I still prefer Dos Toros or Chipotle which are nearby.", "author": "Kurt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Loved their steak nachos. The waiter was great!! I ordered the 1/2 nachos for 7.25 asked for steak instead if ground beef and the price doubled. All i was told that it would be extra, but double was a little extreme. Definitely try the tequila of the week special, worth the price.", "author": "Jasmine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "For my first experience, it was great. The food was good and drinks were strong. I recommend the passion fruit margarita! My waiter Jason was very kind. I'll be returning soon.", "author": "Sophonie E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-20", "description": "Came with a friend and was told the wait was 25/30mins for a table of two meanwhile there are dozens of other people walking in and being seated without a wait and no reservation. I honestly believe it was because of the color of my skin. The sad part is I really liked this place this wasn't my first time coming and their food but that move they made has me thinking otherwise. Very disappointed but I definitely feel discriminated against.", "author": "Beverly B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-14", "description": "This place is really beautiful. The atmosphere is really nice. They even have their own liquor store inside with all the tequilas you can imagine. The decor is nice and the bathrooms have televisions in them lol \n\nWe sat down and a minute later the waiter came over to asked what we would like. I ordered water for the time being because we didn't even have a chance to look at the menus. Two minutes go by and he comes back with the water. Another two minute and he asked again if we have decided on our order. NO, we have not. It's been five minutes since we sat down at the table -_- \n\nAnyway, we decided to order a pitcher of the pomegranate margaritas. We felt pressured to order because the waiter kept coming back smh We usaully take time to decide what we want, so the pushy waiter made us feel uncomfortable. Since house tequila usually tastes awful, I opted for a substitution of Herradura Reposado in the margarita. It tasted great and for $27 per pitcher, you just can't go wrong. \n\nThe nachos were delicious. The enchiladas with mole were lackluster. I have had better and I felt the mole sauce was not flavorful enough. The red rice tasted a day old aka it was on the dry side, but the re-fried beans were yummy. \n\nThe mercado tacos were okay. The avocado sauce was very tasteless! We ended up asking for the mango sauce, which was really nice, but it could have used some heat.\n\nOverall, I liked the place, but I would recommend going there for the pitcher of margaritas and the nachos.", "author": "Irina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Watermelon margarita was so refreshing. I ordered the pollo alla carbon. It's grilled chicken with a chimmichuri sauce. The chicken was moist and flavorful served with sweet plantains rice and mixed veggies which included green beans, carrots, butternut squash and  cauliflower. So so good!", "author": "Karen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Excellent food, ambience and service! Blood orange margarita is to die for.....literally", "author": "Evelyn W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-30", "description": "This place is over priced and the food is just OK. My husband and I met for lunch here not long after they first opened and the wait staff was very nice and helpful. They got us in and out quickly, with no issues.", "author": "Beth C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-17", "description": "This place looks amazing inside . It has amazing ambience and great service . We were served right away and got our food shortly after we ordered.  I ordered the strawberry basil margarita which it had the right amount of alcohol and sweetness I'd definitely order that again .  But the very disappointing part of this whole experience was the food. It was not up to par, the food was not hot when I got it and the portions was a little skimpy . The taste ultimately ruined my experience . But the best part of all was the table side guacamole and the tres leches cake", "author": "Deena M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "I've been coming here since I attended School. And they always have met or crossed their expectations. The food is delicious and the drinks are great! I'll definitely keep returning !", "author": "Jendayi C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}