{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Went for dinner and drinks this week. The steak taco was great and drinks weren't stingy at all which made the Margarita well worth every drop. Also the waiter we had was do informed and attentive. He told us all about the restaurant the owner and furniture lol. He did an awesome job and the music was good also. This made for such a great afterwork spot.", "author": "Lelee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "I have been here several times. The food is always outstanding. I always get a prickly pear on the rocks margarita pitcher  The staff is always friendly from the hostess to the waiter to the bartenders. The have a ton of different tequila choices. Plus they make the guacamole once you order it at your table. I always come after work for Taco Tuesday n the specials.", "author": "Sinead S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "First time here at Rocco's ...Love the food..and the drinks..and my server Kevin is awesome ..attentive and very helpful. I'll definitely be back again.", "author": "Stephie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Constantly passing this bar on my way home from work, I just had to try or maybe because I'm obsessed with Mexican restaurant. I went on a Friday night which it was a little crowded but they told us it would be a 20min wait which was more like 10min.\nWhat more can you ask for who doesn't love fast service? \nI got seated in a cozy little booth which was nice. The first thing I noticed at the table was that they had a \"tequila. Bible\" amazing. The waitress was exceptional she knew the menu back to front she even started talking about the food to the point I couldn't keep up with her, all I know is that she probably was a food lover. We settled on the pitcher of patron margarita which was great and the price was  even better $30. Now let's talk about the nachos the best I have had by far. \nAll I'm saying is I love this place.", "author": "Shiniqua B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Have visited the Rocco's location in Ft Lauderdale and NY both are great. Corel the bartender in NY is friendly and attentive unlike other locations I have visited. Highly recommend the pomegranate margarita", "author": "Maribel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "It's more like a 2.5 stars. The staff was friendly and attentive but slow. The guacamole was the best part of the meal. I had the Benedict Aztec. It was alright but not great. My sister had the taco salad. She liked it but I wasn't impressed. The ambience is nice and relaxed. I will not be going back. I felt like the food was overpriced and felt short. Perhaps this place is better for snacks and drinks.", "author": "Carmen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Great Mexican place in Brooklyn. Nice atmosphere and great foods. \n\nDrinks are great as well.\n\nAngel was a great waiter", "author": "Jared G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Cristina the waiter was very nice and helpful with her recommendations. It was a smooth easy transition from receiving the guacamole. Anthony was very detail by explaining what he mixed in the guacamole. I had a very good time the food was amazing. I ordered the California fish taco wth rice and black beans.  I would recommend this place to everyone.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "The food was great! This is upscale Mexican so be prepared. \n\nHowever the best part of this dining experience was the service. We came in with a large group and the staff was more than accommodating. They put us in a room, and the server were great. Top notch service!", "author": "Libby D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "I've been here a few times and the service is just OK. The only reason I return is the ahhhhhmazing food. Everything I've tried has been fantastic. Spring for the guacamole they have a proprietary blend of spices and it's delicious. In my opinion Mexican food is a food group and I totally approve of their take on it.", "author": "Brandice T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "This review is solely based on my experience tonight. I have been to this establishment multiple times and tonight was exceptionally poor. The food was ok, not their best night. The customer service was subpar, the waitress Kiante was barely attentive. We placed our order and asked for the appetizers to be put in first, all of our food came out at once. With a party of four you can imagine how much space we had on the table. Kiante never came and checked on us throughout the meal, she never offered us water with our meal. Maybe she was having an off night, but Terry the man who made our table side guacamole was more attentive than her. Give Terry a raise, he and he alone raised this rating to two stars. Once we received our bill, Kiante was told to charge cards a certain amount, we were all over charged by $10 and my sister who paid cash didn't even get her change. When this was brought to her attention she had to get a manager to void everything, and brought the bill over and placed it on the table with no explanation of what was charged. By that point we all had an attitude and had to have the manager fix the situation. No apology from Kiante, just here have a good night. Hopefully she went home and got some rest.", "author": "Nichola B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Although the tequila is supposed to be the main draw of this Mexican joint, for me the table side guacamole is what keeps me coming back. The tacos are also phenomenal, and the flavors are insanity. \nIt can get a little loud if you go at peak hours (it's a tequila bar, what do you expect?) but the place is so massive that you can easily ask to be moved to a more quiet area. The size also leads to the fact that I've seated almost right away every time I've gone!\nAtmosphere is beautiful, and this place is great for date night", "author": "Sylvia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "AMAZING tacos, guac, and margaritas Ryan is an awesome waiter, there's cool decor- I love everything about this place!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "If you like Mexican food and your in Brooklyn.This is definitely in competition with El Cafe De La Esquina in Williamsburg. The waitress Christina is awesome as well as the Manager Xena.", "author": "Kenny V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-05", "description": "Pretty disappointing \"Mexican\" food. I have highish standards for Mexican food. The waitress asked where we were from.This raised a flag for me and made me feel like we were definitely in a tourist restaurant. \n\nThe only things worth mentioning are the guacamole and tequila selection. The guacamole is made at your table and is quite good. They have a large selection of quality tequila. Go for a drink and some guac, but pass on the rest.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Service excellent, fresh guacamole made right in front of you, fresh chips with Roscco's special seasoning, food was wonderful. Oh, did I mention service was excellent. With all that is written what more can you ask for. This place looked clean all around, they have additional seating in the cellar. The drinks are a little pricey but I would still suggest this place to anyone. Go have a round or two. I had the Cali. fish tacos with rice and beans. All for the price of $18. It was filling to the point of a dinner meal portion. I will most definitely be back again.", "author": "Dee D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "The food is decent but he staff and company as a whole are not accommodating whatsoever! Went here not once, but twice with 30+ people for after work happy hour drinks and appetizers. Apparently happy hour with food is a foreign concept to this restaurant. We wanted one or two tables for food and then just order drinks from the bar. We were told that we couldn't do that and that if we had a high top table, happy hour drink price specials were not valid. WELL!! Most of my party did not like that answer and removed themselves from the table and helped themselves to the bar. The other half was left confused as to why half of our party was getting drinks for 2$ less than them even though they were all of maybe a foot away from the bar. They also wanted to put all of our drinks on one tab. Excuse me, but are you crazy? People come and go during a happy hour. That's all I need to be stuck with a bill at the end of the night trying to figure out how much each person needs to dole out. Our party just wanted to be able to go up to the bar, pay for a drink and have some food while being able to place our things on a table. Instead, we were told by the staff that if we wanted to do the happy hour our way, we would have to get bar service. There was nowhere to sit around the bar let alone have 30 people drink by it on a Thursday no less! Wound up only keeping one table and had to bounce back and forth to eat and drink. This is the second time that Rocco's tacos had lost out on an easy 1-2K in 2 hours because of their inability to acccomodate large parties. The icing on the cake was at around 7:30PM they had to close because they had no running water. So my entire party had to leave because of this and relocate the party down the road to Custom House. One bad experience is excusable but two? Big mistake, HUGE! You just missed out on a ton of business.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-06", "description": "I ordered a to go meal called the Brooklyn and once I looked at the meal after driving 45 minutes back home. I only saw two little ass tacos there wasn't any beans or rice or other sauces to compliment the meal. I called numerous of times to speak to a manager and it was like I was playing phone TAG! Which is ridiculous! I went to to this place called a restaurant on Saturday 4/2/16 I am just now speaking to a manager in 4/6/16.... Some customer service, right? Huh anyway after finally speaking to \"Peter\" the manager he pretty much gave me an I don't care attitude. So rude after spending money here this is how you treat your customers. Never Never coming here again! He let me know next time I come to eat here remind him of the situation! Huh I won't be back anyways, save your money CHIPOTLE IS BETTER ANYWAY.", "author": "Bella D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "No wait for a table, the guacamole is made table side and is one of the best I've ever had! Our drinks and meal were served in no time, and the tacos were superb! I asked our waitress for her suggestions and she did NOT disappoint:)", "author": "Katie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "Having been to the Rocco's Taco's in Orlando, let me assure you this was a completely different experience!!! We went there last night (8 of us), having made the reservations ahead of time and indicating that it was a birthday celebration....we get there and they seat us right away - great, right? WRONG!!! They seat us at the very last table, all the way in the back, by the swinging kitchen doors - did I mention we had made reservations ahead of time and indicated it was a birthday celebration? There couldn't have possibly been a worst table in the whole place....ok, moving on....we order the guac, of course, which is made table side....both batches were watery, with no distance and no flavor....then we order our appetizers and entrees - absolutely no relation to the delicious food we had at their Florida location - empanadas soggy and tasteless....tacos, the same........so after a tasteless meal, they also let our plates sit in front of us for a good 40 minutes after we were done eating....no bus boys, no nothing....ok, let's go to the dessert - the flan was not flan, it was custard....the churros were not good, and the chocolate \"lava\" cake (with the birthday girl's candle in it) was pretty much plopped in front of her with no enthusiasm or fan fare....and it was not good either....long story short - service was definitely lacking but more importantly, the food was certainly lacking.... absolutely disappointing experience!! Oh and btw, I forgot the blaring fire alarm that went off for a good 15 minutes in our ears (the connected hotel next door caused it so there was no danger) and for that, do you think they would have apologized, never mind comping the soft drinks or something - anything, off the bill....they did not!! Again, completely disappointing....you guys totally need to step up your game - from the kitchen, to management on down....", "author": "Dina B."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}