{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "Horrible Management! Overpriced food!  My work group visited this place to celebrate a coworker. Five of us ordered the \"Baja\" for $19.00. The plate came with 2 small soft tacos with 1 strip of chicken in one and 5 baby shrimps on the other along with sour cream and salsa.I sent mine back. The pitcher of Passionfruit margarita tasted metallic.\nI recommend the burger.\nI called the restaurant prior to the visit to see if they accept American Express gift cards and was told yes, we accept everything. When we tried to pay the bill, they refused to accept the card! Poor Management! Needless to say, we did not leave a tip!\nWe will never visit this restaurant again!", "author": "Sonya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "The food was great, flavorful and fresh. The guacamole is made right in front of you and it is a MUST.", "author": "Tesiya K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-19", "description": "Real simple I order 3 tacos chicken grilled fish and a steak ...they were nasty..watery with no flavor and hardly anything in it..the picture looks great but don't go by the picture...stopped in here for lunch cause I had jury duty across the street...the best part was the bar due to the NCAA tournament being on...other then this place is WHACK!!", "author": "Joseph G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "The food was great. I gave it three stars because the happy hr isn't really happy hour. It's just $1 off drinks.", "author": "Miss C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-20", "description": "I was honestly so disappointed with Rocco's Tacos. The service was mediocre at best. In addition, the food was abysmal. I got the chimichanga which was completely under seasoned (including the \"spicy\" rice and beans) and the \"spicy\" chicken inside resembled the consistency of tuna salad. My friend got the tacos which were literally two tiny tortillas with a couple of pieces of meat thrown on it. Very overpriced for poor quality food. If you're looking for authentic Mexican food, don't go here. The only reason this place deserves one star is because of the decor which is pretty cool. I definitely will not be back.", "author": "Danielle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Went here for lunch. The food was really good and the waitress was really sweet!! Loved my pina colada and burrito. My friend had a cob salad n nachos. All the food was fresh and deleesh!", "author": "Ericaaa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-03", "description": "I want to love it here because it is such a nice space, but I have never had great food and the drinks are just meh. What really makes this place unpleasant is the bar staff and hostesses. Dismissive at best, but downright rude often. No personality and unhelpful. I think I'm done here. Been here 5 times and it's never improved.", "author": "Karin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-28", "description": "Went here with my girlfriend after walking across the Brooklyn Bridge. We were freezing and tired and a taco or any food for that matter sounded amazing.\n\nSo we get in and they sit us right beside the non-use door which made our area FREEZING. Whatever, we put on our coats and waited to stuff our face. We ordered the fajitas ($40!!!) for two and waited about 45 mins for it to come out. Like most Mexican restaurants, they didn't give us enough tortillas. I asked the waitress for more even though they charge (ughh) and waited....and waited......and waited. She even came back around to the tables beside us twice during that time. After about 15 mins I just ate the rest without a tortilla. She eventually brought them out about 25 mins after I originally asked.....just bring the check please.\n\nEven better, when my Mom came to town she wanted to get Mexican food for dinner. Rocko's was the only place I knew so I decided to give them the benefit of the doubt... Bad choice, table they sat us at almost fell over when I rested my arms on it. Next thing you know I'm on the ground trying to tighten up the damn thing. They moved us, and it happened again. Waiter was better and food was ok, but still over priced in my opinion. \n\nSeems like a cool place to drink though.", "author": "Charles H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "Salt on my rim? More like salt in my wounds. This restaurant was a disappointment. The margs tasted like toilet water and the food was mediocre.", "author": "Ashley I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "We went to the sister restaurant in Orlando earlier this year, it was fun and had great service, and food. Rocco's Tacos has the best tequila selection I have ever seen.\n\n We went to this location last weekend what a disappointment. It was an early Friday night, 5pm,  the bar was not full, the service was terrible. It took over twenty minutes to even get a menu, then another 20 minutes to get a drink. Two bartenders were on the bar,  who were not ready to take orders,  they most likely needed a bar back.\n\n We ordered appetizers, they were severed to us 30 minutes later, with no plates, no forks or knives,  no napkins. We did not get the attention of a bartender for another 10 minutes. We went elsewhere for dinner.\n\nI looked down the bar at one point and saw most of bar needing attention. Most customers did not have drinks, and were looking for someone to help them. \n\nThis place needs a bar manager overlooking the bar, making sure people are getting a drink and service. \n\nAbsolute beautiful build out, loved the atmosphere, loved the decorations and feel of the place.  They need to get some attentive managers, and train the staff. \n\nThis place has wonderful potential! They have spent the money to make a very successful place, now manage it!", "author": "Doreen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Food here is great and the lemonade. I didn't understand much of the menu but my waitress was really nice and explain everything for better understanding. Chimichanga burrito is very good", "author": "Caitlyn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Great service from Humphrey, it was our first brunch experience and it couldn't have gone better!", "author": "Edna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Food was decent. Not really worth the price paid. Nothing spectacular but overall solid.", "author": "Roger L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "This is the most horrible place I've ever been. First of all the chips they serve have some sort of smoky flavor to it, nothing mexican, they should let you know when you order although I wasn't happy with that I did not say anything I ordered pollo al carbon, they brought me some sweet chicken, like teriyaky flavor, looked glazed to me, It was terrible, I called the server, she said she will see what she can do for me, after 17mn she came back and offered to \"clean my chicken and recook it\", I asked to see the manager who arrived with her angry face asking me what happened, I explained to her about the flavor of the chicken and she look very mad and said it's being marinated not glazed, I told her that wasn't especified in the menu, she made me feel so uncomfortable that I asked her for the check and try to pay even tho I did not eat any of it!  The service, the food, the manager TERRIBLE, I would give this place minus 5 stars rating.", "author": "Julissa E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "SERVICE WAS TERRIBLE!!!\n\nFOOD is 2.5 out of 5.\nDrinks are 3 out of 5. \nService is 1.5 out of 5.\n\nWaited 10 min to see the server. Or get water for the table. Went to hostess and finally got a manager and server to pay attention to us. Service was great, FOR A WHILE. finally had to flag down a bussboy to get the check, and to pay...\n\nFar from great. .. may not come here again....", "author": "Eugene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "Stopped by for lunch, the food was good, the atmosphere was great!\n\nIt took ten minutes to get our margaritas, even longer for the second round.\n\nAll in all...it was okay. I would visit again.", "author": "Ajp F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "I'd give Rocco's a solid 3.5 if I could give half stars. I've been to Rocco's a handful of times. The drinks are always delicious and strong. Rocco himself made an appearance while I was there and poured tequila into everyone's glasses around the bar. Overall a fun experience for happy hour/ night out. The vegetarian food is mediocre, but chips, salsa, and guac are definitely worth coming back for!", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Came here for AYCE TACOS for $16 per person! Such a great deal!!! \nI love the mushroom taco, shrimp taco, and steak taco.\nMy least favorite was the chicken, beef, and fish tacos. Those were dry and a bit flavorless.\nThe drinks here are great, there are so many tequila and margarita options. Our server told us about their weekly favorite tequila, which was discounted, so we ordered a pitcher of that tequila as a margarita for $15! it was a bit weak for me but my server had no problem with adding more tequila in for me :).\nThe portions here are huge, especially the NACHOS which could feed 4 people!\nThey also make guacamole at the tableside, which is really awesome and fresh! Absolutely loved it.\nService was a bit slow with pushing out the food but it was quite busy. The space here is huge there are 2 floors.\n\nI would come back here for more tequila and to try their other food with more friends, this is a place for a party and get together meal.\n\n*super hilarious, go check out their bathroom stalls. there is a music video of Will Ferrell touching someones butt.", "author": "Michelle X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "OMG! So amazing, place was so nice looking food was amazing anddddd my server Emerald YES like the city was the best has earned my repeat business !!", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "Although the place has a warm atmosphere and the service was up to par, the food is a disgrace. How can a restaurant (even a chain restaurant such as this) serve such unbelievably plain ole lazy food? The fish tacos were so hard this non-picky eater found them inedible. Everything from the margaritas to the guacamole to the churros and chicken had a strange, bitter taste.  Incomprehensibly bad food. Not cheap either. \n\nInteresting decor though.", "author": "Erica S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}