{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "This is my second time at this restaurant. I had a awesome time the person I was with never been there before but also an awesome time. The staff was great we had four different waiters that was very attentive and very informative. We were located downstairs in the bottom floor, I can tell that a lot of people enjoy coming there. It was like Sinco DiMaio all over again.\n\nIf your ever in Brooklyn stop by if you feel for some great Burritos.", "author": "Dwayne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "The guacamole is made right in front of you, they being a tray with all ingredient \u0026 they make it for you, could not be fresher :) \nThe chips are fresh and tasty, and the margaritas are soooo good. \n\nHighly recommended place.", "author": "Ameenii M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "Wish I could give it more stars, and Would have given more stars if the service wasn't so bad. The bartender ( at bar 1, 7/5/17 , 6pm) rolled her eyes when I asked her for more salsa, then proceeded to talk to multiple other employees about me while glancing over at us, and continued to have an attitude. Very unprofessional and I wouldn't have visited this restaurant if i had known i would have such an unpleasant experience and left feeling judged.", "author": "Ajuma A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "Nice friendly atmosphere, it's a good social place. Good variety of Mexican styled drinks. The place is a little on the dark side, gothic. I thought this place would be great around Halloween, creepy fun decorations. \nI must say its a first that I've seen movie monitors in the bathroom. Each urinal and toilet stall had a monitor on it showing a movie. As you did your 'business\" you were entertained with a film of some type.", "author": "Arthur R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "Love there grill chicken pollo with red rice and fried beans. The frozen margaritas could be a lil strong\n. Love love the plantains", "author": "Troy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "\"Awesome place for great food!\"\n\nMy wife celebrated her birthday there over the weekend... THREE TIMES!\n\nShe has found a new place to call home for lunch/brunch/dinner... Very happy for her!", "author": "J R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Cool atmosphere, great drinks, our waiter was very knowledgable about the food options. The table side guac and chips were delicious. My entree was okay, wasn't amazed but wasn't horrible either. I would definitely come back for drinks", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "I was here for lunch today. The restaurant is pretty spacious, and kitschy (in a good way) decorated with skulls and tequila bottles, etc. Pee Wee's Big Adventure was on in the men's room urinal (with sound) so that earned a star alone.\n\nThe salsa doesn't come with the chips. It was fresh, chopped salsa which lacked some flavor, maybe needed more salt or lime? \n\nI wasn't too hungry so I ordered two pork tacos which were enough to satiate me. The tacos were solid. Others ordered bigger plates and man, was there a lot of food. I kind of wish they had more of a lunch menu, but overall I liked it and would return, likely for a happy hour.\n\nI think it is a chain, albeit a smaller regional one. Check it out.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Great service and atmosphere.   Bartenders are very attentive and kept my red wines coming.  Tried the jalapeño peppers, which was delish and the fried pork, which turned out to be pork rinds that I could've just bought a bag from the store for alot more of a cheaper price.  The pork was a disappointment,  hence why I took a star off.  Will definitely return again.", "author": "Keshia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Decided to have a celebration for a co-worker at Rocco's and I was not disappointed.  First I decided that I should test it out before everyone went, and had the Taco's, yummy.  I could not finish it all.  \n\nNext I informed my co-workers that this is the place to go.  So all 14 of us traveled from the Bronx all the way down to Brooklyn and were met by the nicest and most helpful receptionists and waitstaff.   This time I had the Mercado which is adobo rubbed grilled chicken, papalo,\navocado sauce, yellow tomato pico andchile de árbol.  It arrived with 3 on a plate, and the feasting began.  I could not finish all three.  \n\nIt's a very fun atmosphere, you are not rushed because some of my previous co-workers met me there and we hung out and everyone was tasting and sampling the various dishes.  We ran out of 3 guacamole's and had to order more.   \n\nNeedless to say fun was had by all.", "author": "Bonita A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-28", "description": "READ THIS REVIEW BEFORE YOU GO THERE!!.. Im going to cut to the chase. We ordered two pitchers of I believe it was the rosco rita. The first pitcher was fine (i hope) we get the second one my friend is pouring it out and I see something floating in my glass. I look closer and it's a fly, I'm in disbelief I tell my other friends to confirm what I see which they did it was in fact a fly. My friend who was pouring out the drinks looked into the pitcher and THERE WAS ANOTHER FREAKING FLY FLOATING IN THE DAMN PITCHER!!!! He brings the pitcher over to the manager who was behind the bar she then comes over and says sorry this has happened before we have fruit flies (they were bigger than fruit flies) and no matter how much we seal the tequila they still get in (I would love to know how that even possible) and we can't control that and I'll get you another pitcher a fresh one but you still have to pay for it. I then asked her to repeat herself because I had to make sure I was hearing correctly she then confirmed what I thought I heard and we told her no we do not want another pitcher and she took the ones we had and the glasses and walked away. I was seriously sitting there in disbelief until the server came over I explained to him what happened and how I worked in restaurants before which is a 100% accurate I've worked in high end hotels as well and there is no way we should be even told  we have to pay for another drink much less the whole Damn bill. He then goes back to the manager she comes back over and says she says still take off the food but we have to pay for the first pitcher. I said fine I was ready to go I was disgusted with the way the situation was being handled and the establishment. After hearing us talking the manager then comes back over and this is what took the cake for me. She goes what would you have wanted to happen what would have been a solution for you? I calmly explained to her for you to say we can get another pitcher but we have to pay for it just makes no sense. She then goes and I qoute \"IT'S NOT LIKE THERE WAS A BAND-AID IN THERE \". A freaking band aid she tried to justify two Damn bugs being in our drinks by saying atleast it wasn't a band aid. This place is absolutely disgusting whoever runs/owns that places needs to fire that manager she handled the situation extremely poorly I don't remember the managers name but she was a black woman with black hair cut into a Bob. You can spend your money here if you choose but I suggest you do it at your own risk. Flies in your drink is a no no and to be told atleast it isn't a band aid and you can have another but u still have to pay is just disgusting. I hope upper  management is reading this your establishment is extremely lucky I did not get a picture before my glass and those pitchers were taking away. I suggest you get whatever infestation you have under control and hire a manager that knows how to better handle a situation and is better trained in customer service because trust me she lacks it. Her attitude about the situation was disgusting, her trying to justify it was even more nauseating and you better hope you don't not have this happen to the wrong customer because your place won't be in business for long. I will never ever ever return here or suggest it to anyone I can only imagine how many customers swallowed a bug or two and didn't even notice. Patrons please take your money somewhere else it's not worth the risk Lord knows what's running around in the kitchen.", "author": "Molly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "They have the best tacos!! omg! food is amazing and you cannot forget the pitcher drinks A1 (:", "author": "Salenna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "My coworkers and I went here for lunch at about 1:45pm. We had a reservation for that time but for some reason we didn't get seated until a little after 2. Good thing we had a reservation or our wait would have been a lot longer. \n\nI have to comment on the decor as it was actually really cool. There are masks and skulls and tequila bottles everywhere and the light and ambiance were really great. Rocco's gets an A++ and 5 stars on the decorations. \n\nMoving on to food and service. The service was awesome. The waitress was really patient and attentive and didn't give us an attitude when we asked for separate checks. The food... In my personal opinion, the food was pretty tasteless and bland. The rice had no flavor and neither did my steak tacos. For a taco place, the tacos were really poor. I don't know if I would come back here for the food as I wasn't at all impressed. My coworkers all seemed to enjoy their meals but I thought there could have been more flavor to each item on my plate. I can't comment on the drinks because I didn't have any. My coworkers also ordered guacamole. The only thing I'm going to say about that is that by the time the guac was made... The food came out of the kitchen (lol). It took a year and a day for the girl to make it, oh well. \n\nI'm going to give this place a chance for happy hour and drinks because of the great service and cool ambiance but had it been for food, I probably wouldn't be going back anytime soon.", "author": "Lissett L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I came to Rocco's for a brunch party. I ordered the Baja, which included a fish taco, shrimp taco, and spinach cheese quesadillas. The food was flavorful, the service was phenomenal. The tacos are savory and to die for!! Our server Angel, was absolutely outstanding and went out of his way to accommodate this. I'd definitely recommend giving this place a try!", "author": "Hasanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "You love tequila?? You will love this place! They have such a wide selection of tequila that it's hard to make a choice. Nice place, central location right downtown. Parking is a bit of a headache depending on the time frame. Food is tasty, prompt service and the drinks are good.", "author": "Tyisha W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "I ordered @ the Take Out Window; Very Poor Service - Staff not friendly \u0026 simply unwilling to explain things to me. They looked as if they didn't want to be there. As far as the food goes; I had the Buritto - The meat had no taste @ all. Guacamole wasn't fresh. Poor experience - I would never go there again.", "author": "Louis R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "Very disappointing. Margarita without slated rim, messed up a simple order of two tacos. The mole enchiladas was way too cinnamony. The guacamole wasn't bad, but that's it. The whole menu is over priced for the amount of food.", "author": "Gabby G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I visit this every month! The food and drinks were great! The wait is never long and the service is always amazing. Our waiter Angel was fun and helpful, this is definitely my favorite place to get margaritas.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Very good! I got the brandie's skinny seniorita drink and loved it! Chips were really good. Salsa was chunky and yummy. Tacos were delicious. It was very very good but not the best I've ever had hence the 4 starts. Cool atmosphere too.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "My first time here was very enjoyable thanks to our waiter Aaron and his manager Zena, I definitely expect to be making thins a regular spot due to them. Also to the powers that be, please offer the \"Watermelon Kiss\" in a pitcher option, I was very disappointed to see that that was not available to me and my company. Till next time", "author": "D'Artagne D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}