{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "I used to work a block away and we would go to Rocco's Tacos for celebration lunches. The food was okay, but the service was spotty at best.  We always blew through the time we allotted. \n\nLast night I came to sit at the bar. I was ordering dinner but still needed to give a credit card when I got my drink. If this is the policy, it's not a great vote of confidence in the clientele. \n\nService was spotty again. The bar manager was great and attentive. Some staff behind the bar seemed to have an agenda that didn't include customer service.  \n\nThe real issue is that the food is good, but not great. Rocco, this is your name on the restaurant. I didn't think you aspired to the mediocre. To be fair, the ceviche was beautifully presented and tasty. It had just the right amount of heat. It did however take two trips to the kitchen to let me know what the ceviche of the day was.  The enchilada platter was serviceable, but not fresh tasting or even slightly memorable. \n\nIf your aim is decent, reasonably priced Mexican, enjoy.", "author": "Rick J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "The food/ambience was decent overall and the portions were quite good - but have to say it took a VERY long to have our order taken and have our appetizers/guacamole delivered. This - after we'd made it utterly clear that we were starving and needed to eat something right away. \n\nTo be fair, I think something was going on with servers/shifts as a second server took over our table AFTER the first one disappeared/took forever. But the second assured us we'd get our food \"right away\". We then waited another 20 minutes for the aforementioned guac and appetizers.\n\nWhen the guac was delivered, it was \"made fresh\" at our table (we watched agonizingly as it was prepared), which took another 5-10 minutes(!) Really, Rocco's - why would anyone make five VERY hungry adult men wait so long for appetizers, drinks, and guac when it was relatively quiet at 5pm on a Saturday afternoon. I'm sure it's a decent place, but I'm also sure this could have been handled much better.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "Tacos Were Good I Have No Complaints About The Food At All But The Drinks Were Mediocre. I ORDERED an Frozen Margarita And When It Arrived It Was No Where Near Frozen The Base Of It Was Loose Not To Mention Watered Down I Bypassed That An Decided To Order One On The Rocks And It Was The Same Results WATERED DOWN! Might As  Well Have Just Been At Applebee's For That Quality Of Liquor My Glass Wasn't Even Full When Brought Out To Me Like Come On Now!!!! I Came Here Before And The Quality Of Drinks Were Never That Bad I'm Highly Disappointed", "author": "S C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "Rocco's identity is kind of based on not being \"one\" thing - You'll always find a diverse crowd either unwinding after work, on a date, having a drink at the bar, for a graduation party, or just getting lit enjoying life. you'll almost always see them having a good time though. \n\nSomeone called Rocco's the Applebee's of Dos Caminos. Actually fits...kinda well but...nahhhh. Rocco's isn't as over-priced, stuffy \u0026 bland as Dos Caminos, \u0026 it's not as corny \u0026 hood as Applebee's.\n\nI've gone a few times, was always satisfied. The place looks great with 2 floors - both including well-lit, baller ass bars, wide dining spaces \u0026 everything is very clean. Even the bathrooms.\n\nFood is good, \u0026 the guac especially is freshly made at your table. Never had an issue with the drinks (margarita \u0026 mojitos in restaurants are always either too sweet or just strong enough), but their tequila selection is A-1!\n\n4 stars MAY be overrating, but 3 is too low. Considering the area \u0026 how accessible it is, it could go from \"younger Dos Caminos\" to \"Dallas BBQ\" real quick - \u0026 that's not a good thing. You always risk that in Downtown Brooklyn. Hopefully Rocco's can avoid that.", "author": "Von B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "I came here today with my friend for lunch. I got the taco salad which was really huge and worth the price. The salad was super yummy and very filling. I would define you get it again.\n\nI also had a margarita which seemed weak at first but definitely crept up on me. Note to self, never don't have a margarita from here during your lung break. \n\nMy only complaint would be the poor cellphone reception downstairs. There is absolutely no service downstairs.", "author": "Keisha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Rocco's is beautiful nice Mexican art work ! Tequilas and other Mexican rums displayed upon entering the restaurant! This is a great place to visit with family or with friends!", "author": "Ingassi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Let's start with my waiter, really courteous and attentative. When I explained I was vegan and that I usually order from the sides section of the menu he suggested a veggie enchilada and i'm glad he did! The refried beans were delicious and the veggies inside the enchilada were full of flavor. Cauliflower, sweet potatoes, roasted sweet red peppers and string beans.  Lastly, but not least the salsa verde poured on top of the enchiladas was a rich touch. Did I mention the food came fast? Last time I was here it was about 2 years ago and the food took forever... I also wasnt vegan then and ordered food that would take long perhaps. This was a fast, delicious experience. I highly recommend.", "author": "Jill D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "Amazing guacamole! Food is great but not a fan of taco Tuesdays or it's happy hour (possibly happy hour on Tuesdays). Paid $25 for a pitcher of juice. I've had very little alcohol in my drinks but this was definitely juice! And as for Taco Tuesday, it's sad that you're required to purchase at least 4 Rocco's Tacos for the Taco Tuesday special but can't doggy bag your food if you find yourself full after 6 really good tacos. I can't take the 7th one home?! I paid for it but they'd rather throw it out? Would go again but probably not on a Tuesday.", "author": "Luis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Needed food to please my soul. Came in with a few co workers and even though I had Mexican food yesterday had to get it again. Staff is friendly and they even changed the channel so we could watch the NBA playoffs", "author": "Dwayne M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "First of all, my dining experience was incredible. The wait for our table was a bit long, but then we were seated in a fantastic spot that even had an outlet for charging my phone! \n\nWe were greeted by one of the managers and asked how our meal was. Our waitress, Kathy, was very friendly, and even included us in some fun activities. She gave us good recommendations. The food was delicious! \n\nMy friend and I were waiting for one of our coworkers to join us after a long day, and by the time she got there, we had to close out the bill and move up to the bar. We had been there for around 4 hours enjoying ourselves and spent about $160 between the two of us. \n\nIf it wasn't for the incredibly RUDE interaction the three of us had next, I would have given this place 5 stars and been thrilled with my whole night. \n\nYou can thank the mildly unattractive male bartender with yellowish blonde hair for the 2 stars. \n\nWe moved to the bar, our friend tried stopping a bartender twice (even by flailing her arms). When she got someone she asked for 2 drinks and then asked to redeem a Yelp check-in \"free shot.\" \n\nHe told her she had to have purchased food for that, knowing full well that the kitchen was closed. I told him we just moved from our table where we had been sitting for 4 hours. I told him he was welcome to check with our waitress, Kathy. \n\nHis response to that was, \"Now you are asking too much.\" Honestly, at that point I began standing up because I have never been spoken to so rudely in a long time. \n\nI do Marketing for a small company where our team has to interact with some of the rudest people in NYC and still be courteous and provide wonderful service. The funny thing about our experience with this man was that we sat down and was not disruptive or rude in any manner, and he was a complete jerk. \n\nAt one point, as we were leaving, he shouted at us that we couldn't hold our liquor. Our friend had just arrived (her first experience at Rocco's mind you), and was tired and had no drinks yet. \n\nAnyways, my recommendation is CERTAINLY check out the restaurant and taste the wonderful food. AVOID THE BAR.", "author": "Taylor K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "I don't see what the hype is about. I came here for dinner. First off the Services sucks the waiter did not know about anything on the menus we had two servers who really sucked. Secondly the drinks was TRASH I asked for a frozen strawberry margarita it was so watery i had to ask for them to change it for a classic margarita, they gave us HOT DRINKS.  Third of all the food was beyond TRASH  the rice was boxed rice it was cold. When we got our bill we was charged for extra things one meal was $16 and they charged $19.50 they when it was brought up to the server he had an attitude so I had to walk up to the manager who still didn't do nothing about it. I would honestly never go back to eat here ever again. Waste of money to be honest", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-12", "description": "I really wanted to like Rocco's when it moved into the neighborhood. Sadly, I cannot like it. It's just not very good on a number of fronts. The drink menu is really big. I have had 4-5 different margaritas and none of them has been any good. The jalapeño one was the worst of all because it is made with sour mix. BLECH. Sour mix margarita is something I wouldn't wish on my worst enemy. The other ones I have tried are super sweet or crazy tart. Not one has a balanced approach. They feel like experiments more than cocktails. Tonight I had a Mexican Mule (Tito's vodka \u0026 Ginger Beer) which tasted like water. The beer selection is at least somewhat varied and reasonably priced. \n\nThe food selection screams mexi-chain. None of it is very good. My chimichanga (I know, bad choice) was warm at best when it arrived at the table tonight. It was ok tasting but I couldn't really enjoy it due to all the weirdly overdone bits of rice that made eating an unpleasant bite surprise. I was raised by a dominican woman who made amazing bottom of the pot rice that was crunchy and didn't make you feel like you were going to break a tooth. Rocco's rice is not that rice. Other visits I've tired the uninspired tacos and just gave them a shrug. Nothing special.\n\nOne interesting thing is that they offer guacamole made at the table. This is not unique but always better than getting guac scooped from a fridge bucket. However, tonight we had to have our first order re-done because it tasted like a salt lick. The second one the gave us was edible but still over salted. \n\nDecor-wise the place is schizophrenic. It's a mix of day of the dead, pop culture signs, bizarre art glass lighting fixtures and old time Mexico. The men's room is a has video screens above the urinals and toilets where they show odd movies. Tonight was Nacho Libre. Also on the walls are softcore T\u0026A 80's Spanish Playboy covers. Super odd. I had to explain that to my kids... \n\nThe only reason we come here is because they serve kids food like hot dogs \u0026 fries. Tonight we decided we can't use that reason anymore. I'd rather not eat. It really is too bad. The restaurant has tons of party spaces and really long bar. I've been there when it has been slammed with business but that is usually like afterwork business people. It has to be for drinks because it can't be for the food.\n\nAlso, I agree with other reviewers about the service. They are either all over you or you can't find them.", "author": "Luis F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "My two co-workers were waiting for me to join them after a long day, and by the time I got there, they had to close out the bill and move up to the bar. They had been there for around 4 hours enjoying themselves and spent about $160 between the two of them. \n\nIt was my first time ever coming to Rocco's, and I was very excited as I heard great reviews about the staff, the food, and the drinks. \n\nWhen we moved to the bar I asked for 2 drinks and then asked to redeem a Yelp check-in \"free shot.\" The incredibly rude male bartender in his mid-30's with yellowish blonde hair told me I had to have purchased food for that, although the kitchen was closed. My coworker told him we just moved from our table where they had been sitting for 4 hours. He also told him he was welcome to check with our waitress, Kathy. \n\nHis response to that was, \"Now you are asking too much.\" I was bit thrown off because my interaction with Kathy was pleasant so I expected my interactions with the rest of the staff to be just as pleasant. I did not want to cause an argument or give anyone a hard time, so I asked for the other drinks I ordered to be served. \n\nThe bartender continued to make snide and rude remarks, and at that point, my coworkers and I had enough. I asked the bartender who was making the drinks to cancel the orders so we could leave. The rude male bartender replied, \"Good because we're closing in 15 minutes anyway.\" \n\nI am an account manager at a small start-up company, where my co-workers and I deal with rude and difficult clients all of the time. Customer service is extremely important, regardless of the situation or the types of people you are forced to deal with. \n\nAlthough my first time at this place was very disappointing, I want to give this place another try. I recommend that the staff, or more specifically, the rude male bartender receive some type of training so that he can learn the meaning of good customer service. Without customer service, a company will not thrive. I hope that after my next visit to this place, I can increase the number of stars.", "author": "Keyosha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "Was visiting NY for a few days and this spot was adjacent to my hotel.  Walked over with the family to get a late bite.  Kitchen closed before time documented on entry.  Bummer...", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "We had reservations for 4 at Rocco's tacos while visiting Brooklyn. We arrived 30 minutes early and were able to sit down right away. The decor is awesome! We were greeted quickly and the waiter brought a few waters over. The guacamole was made fresh at the table and tasted amazing! My monitor was delicious and the food.....so good! I had a combination of steak Tacos and an enchilada. The bathroom was downstairs and the whole area was so uniquely decorated. I recommend this place!", "author": "Jacqueline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "The food here.... Excellent! The drinks...delicious! The service... Phenomenal! Our server, Christina, was very helpful when it came to suggesting menu items. She was very warm and welcoming. And shout out to Anthony! He made the most delicious Guacamole. I would recommend this place to all my friends and family. This definitely won't be the last visit.", "author": "Joni R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Perfect! I visited Roccos while staying in Brooklyn for my bday! To my surprise this gem was located next to the hotel. My experience from beginning to end was awesome. The waitress was very knowledgeable and gave me and my fiancee awesome selections. If you are ever in the area and interested in good food, great drinks with superb service to match Roccos is a plus! I will definitely look for this establishment in the Ft Lauderdale location! I miss my pitcher of Margaritas already!!!", "author": "Kesha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-24", "description": "Had a second visit this past week and have been disappointed both times. Mexican is not hard and their unremarkable takes on the basics make the \"juice not worth the squeeze\". The table side Guac is just fine but the entrees are flavorless and sometimes free of traditional sides. I ordered the lunch special, a Short Rib taco, and the meat was flavorless and cooked into dry strings. My waiter agreed (kudos to him) and he swapped that out for some chimichangas which were fine...\"just fine\". Our Mojitos were not much more than cloudy water and there always seems to be a temperature issue in the place...too hot or too cold. A nice space and good location deserve a better restaurant.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "My server Angel was an angel. He was very attentive and made sure we were taken care of. My tacos were so good and the maduros were cooked to perfection. On a lovely Saturday afternoon the restaurant was not packed, so make sure you stop by and take advantage of the bottomless brunch. 4 hours of unlimited mimosa or bloody mary's for ONLY $14. What?", "author": "Chloe H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "This is my second time here.  I thought maybe the first was a fluke, but I'm now pretty convinced this gets the coveted \"Ass on a plate\" award.\n\nEverything looks good coming out, but it ends there.  For dinner, I selected the salsa and chips, 1/2 order of beef nachos and the Koren BBQ tacos.\n\nThe chips that are served are very greasy and have some random spice sprinkled on them. Some chips have none, while other look like they were battered in this non-description and gritty spice.  The salsa is bland--basically diced tomatoes, a sprig of cilantro and a few pieces of diced onion.\n\nThe next order up was promising--beef nachos.  It looked beautiful, yet somehow that was its only redeeming quality. The fetid beef and black bean gunk from a can was repulsive, covered in cold melted cheese and tasteless guacamole.  I was glad to see my tacos arrive.\n\nThen I tasted them.  To the eye, they were three very generously-stuffed corn tortillas. To the mouth--utter disappointment.  The kimchi just tasted like spoiled cabbage and the beef was fatty.  Hoi-sin does not Korean BBQ make.  To call them Korean Tacos would be an insult to both Mexicans and Koreans.\n\nI would have been more excited to eat regurgitated Taco Bell.  And at $42 after tip, the Taco Bell would have been a much better deal.", "author": "Aaron G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}