{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-30", "description": "I love the food here! Really good and the food was definitely fresh. I especially enjoyed the guacamole and soft shell chicken tacos. \n\nThis is my 1st time and I was happy with the food but also a bit pissed. We arrived tonight around 8pm and was immediately seated. The service was good. At around 8:30pm I realize the food seems to be taking a little long given I ordered 1 taco and my boyfriend had the chicken quesadilla. At around 9pm I asked the waiter why the delay. He shared the kitchen was hit with a few larger parties, which was fine expect I noticed that the party of 4 across from me was getting their food and they were seated significantly after us. At 9:15pm I ask to speak to a manager.. which was a bit pointless! \n\nHe listened and said he would go check the kitchen. He ended up immediately brought out the food out and shared that the ticket was stuck to another ticket and the cook missed it! Clearly an honest mistake but that's it! After over an hour wait and the  only response is let me know if you need anything. \n\nI too work at a restaurant as a manager part time and at a minimum I would've comped the party a drink or decreased the bill! Of course different management styles but I won't be back for a while sadly it just left a poor taste in my mouth. In NY it's all about the experience because there are countless restaurants with good food!", "author": "Sascha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-23", "description": "We had a very weird experience here. Our bartender (female) took a long time to get our order in the first place, then only listened long enough to hear one person's beer order then immediately got distracted by a receipt that she was staring at with a message written on it. When she came back with the first beer, we attempted to order the rest of our drinks and food. She immediately asked for our credit card and asked if we wanted the tab closed to which we said yes... but she then took the credit card and did not bring it back. She then brought our blood orange margarita and proceeded to spill it all over a credit card in her hand without noticing. When our food was brought out, she essentially told us that \"this is not Rocco's tacos and this place sucks\".  The final nail in the coffin was she kept asking us for what we ordered and our last name and could not find the credit card that she had taken from us. Fortunately her coworker was able to locate and retrieve our card and we got one beer deducted off our bill. Needless to say, it was a bizarre experience.\n\nNot 1 star only because I've been before and had a decent experience with good albeit overpriced food/drinks.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "Met a buddy for brunch and decided to go to Rocco's Tacos to grab a bite to eat. The weather was nice, so we decided to eat outside.\n\nOnce there, we was asked by our waiter, Corey where did we wanted to sit, and we decided to sit under the awning for some shade (and to keep the birds flying that were over from pooping in our food/drinks!)\n\nOur waiter, Corey was shy, and a little nervous because this was his first time working there, as well as serving us. My buddy and I reassured him that he will be OK, and if there were any problems, we will LET him know. He gave us the menus so that we can order our food.\n\nAfter we ordered our food, me and my buddy enjoyed our drinks and settled in our seats to feel as well as enjoy the ambiance, as well as watched the people walk by, as they were going to their destinations.. The soon Summer Breeze upon us.. Feeling really good.\n\nOur entrees arrived. I had the shrimp ceviche, while my buddy had her food, (had to resend it back, was a little cold) Corey apologized, and corrected the situation.. But I will say, the drinks were very delicious!\n\nAfter our brunch, we decided to have dessert.  I had the tres leche cake, while my buddy had churros with ice cream... Damn! I should had switched my dessert for the dessert she was having... #LooksTooYummy!\n\nAfter our brunch was over, we asked for the check and prepare to leave. In all, the place was great.. I would had gave it a five star, had it not been for my buddy food being cold when served. Our waiter, Corey, did a great job for his first time there.. The check was paid, he got a tip, and we left.. Still enjoying the wonderful, warm, and breezy weather! #AGoodTime!", "author": "D R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "I'm giving this place a 2-star. One because the food was pretty good and another because we liked our waiter. We came after my brother's graduation and there was 8 of us. We got seated right away, but our waiter was so overwhelmed and busy that it took forever to get any and everything. It seemed like there were maybe 2-3 waiters serving the whole restaurant. As you can imagine for 8 people, one person wants water the other asks for hot sauce. You need some extra attention for a large party. The waiter was so overwhelmed and was clearly doing his best. The managers just kind of watched. At some point I got up and cleared our apps off the table to help. It just seemed like no one was bothering to help out with how busy the waiter was.", "author": "Milan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-17", "description": "I honestly wouldn't go back to this place. There was a lot of confusion when I went. The waitress didn't know all of the facts and basically charged me 10 dollars more for the shrimp burrito. And the burrito itself was subpar at best. The worst part was that the manager tried to make it seem like it was my fault before she corrected the price on the check. \nBasically everything that they have on their menu is overpriced and not worth it. The only reason why it is busy is because of their margs and also the fact that it's the largest sit down Mexican food restaurant in the area.", "author": "Janelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Came here last night to celebrate a birthday for a friend. He's always been raving about the legendary Rocco's Tacos and I finally got the opportunity to try it out.\n\nIt's conveniently located off of the Jay street Metrotech stop on the ACF lines. It's also a huge establishment with endless tables and a gigantic bar.\n\nWhen I sat down, there were lots of plates filled with tortilla chips, red salsa, and green salsa. They also made three different types of guacamole for us: mild, medium and hot. The chips were sprinkled with chili dust and it was such an amazing touch! Add on some salsa or guac (or both) and it's absolute heaven. I stupidly half-filled up on just those magical chips. \n\nFor my entree, I ordered the enchiladas verdes with a Dos Equis Amber draft. The entree prices were a little high, but the portions made up for it. I had three fat chicken enchiladas with spicy rice and beans. By the time I was done I needed to put my head down. \n\nThe servers were like sharks, always circling around us to make sure we had everything we needed. We were very well taken care of. I'll definitely come back!!", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "As you enter Roccos you're greeted with a wall of the \"dead\" , skeletal bodies eating and drinking and having a good time. There's so much to see at Roccos from the decor to the pictures hanging on the wall and other fixtures!  \n\nCame here with a friend of mine and had to wait 15 minutes as they were tidying a table for us. We sat In these very comfortable high chairs, on the side opposite the bar area. They were so super comfy, it helped my friend whose back was aching that day. \n\nWe got some pineapple juice drinks and followed with flour tortillas with the Molcajete carne!!!! .\n\nI must say seeing that meat sizzling in the traditional lava rock was amazing. The sauces and the meats were so good together and then adding a different toppings on my tortilla was exceptional!\n\nFor my first time being there I would definitely be back for tacos and tortillas!!!!", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "This is a great Mexican food restaurant in the downtown Brooklyn area. We were seated right away in a smaller area of the restaurant, it wasn't noisy and I could still follow the NBA games with flat screens nearby. However, the bar area had really good energy if your with a larger group.\nI had the taco burger\n1. Large burger party\n2. Toppings guacamole sour cream lettuce- absolutely a must try\n3. Slim fries were well done\n\nOur waitress kamaria was friendly and we didnt have any mix up with the food.", "author": "Darren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "I had the grilled chicken nachos to go and it was delicious. The waiter made a mistake with my order and he fixed it with no issues. This place serves great Mexican food.", "author": "Mimish I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-17", "description": "Great plce for that authentic mexican vibe we have all been searching for in NYC and around.\n\nCouple of train stops from NYC and in heart of brooklyn, is this amazing restaurant with intriguing decor. Dont miss the finer aspects of the interiors from a shotgun to tequilla collection to murals!\n\nDefinitely a top choice for mexican cuisine. Dont miss out on the Jalapeno Rellenos, margaritas and the live guac!", "author": "Anand S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-10", "description": "Nice service. They did get my drink wrong when I emphasized repeatedly that I wanted a skinny jalapeño margarita with no sugar whatsoever, and I ended up with a jalapeño sugar juice, but they were attentive otherwise! The food is okay, the bbq nachos were good and very filling. The mild guacamole was mildly good - but it wasn't terrible. Everything was also unusually overpriced, especially since it wasn't great - which made it hurt more. Just an FYI, this does not have authentic Mexican food, just the Americanized version of Mexican food.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-28", "description": "Go for the bar/ happy hour and the table side guacamole and chips. The decor lends a lot to the space in terms of character. There are themed areas where you can have photo ops and a mixture of lighting and artifacts lends ethnic elements that don't feel forced. The space has 2 levels with more than enough space to host large events/ private gatherings without any hassle or intrusion from diners. \n\nI have no idea what that spice is they put on the chips but it's the edible version of crack. So good! The drinks are typical and don't necessarily pack the punch you expect for the price. Service is rather inconsistent. This review is coming on the heels of my 3rd visit and whenever I've attempted to actually dine in , it's been a disaster. \n\nMy last experience was with a Meetup group of ladies, about 10 of us and we waited almost an hr for our drinks, the guac was being done when our waiter walked off his shift after he and the managers couldn't come to a compromise about how the tips for that area were going to be split and we ended up with 3 different staff members including the manager attempting to fill our orders and get everything right. \n\nFour hours later we got incorrect meals, drinks with no alcohol, missing items from the menu and way too much drama from the workers and their management staff. The night was a case study in poor management of staff and poor business practices . We should not have witnessed any arguments about money/ tips etc and workers walking off their shift while serving is largely unacceptable. At best Rocco's has a great location they can capitalize on but if they are not intentional about being more consistent with quality customer service the business will continues to take major losses.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-30", "description": "So this place is really cool to look at on the inside. I came here for lunch along with two coworkers a few weeks back and I have to say the food was delicious. Ordering was a breeze. The waitress didn't seem put out at having 3 separate bills open at one table.\n\nI had the gluten free shrimp tacos and it was just spicy enough that it covered up the fact that the taco was not piping hot when it came out to the table. On retrospect, I assume the temperature of the taco was probably on purpose considering the taco itself is spicy.\n\nMy coworker got the regular version of the shrimp taco and my other coworker got a half portion of the nacho plate. To be honest however, had I not been there to here my coworker order, I would have said that was a full portion.\n\nThat plate easily could have served 2 people comfortably. My shrimp tacos l - bought per piece - were more than enough for me and my other coworker.\n\nAnd the red sangria was very nice too. I'm looking forward to returning to check out more of the decor. Also the bathroom is downstairs and apparently small according to my colleagues.\n\nGive these people a try. It was worth coming.", "author": "Lori A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-27", "description": "My friends and I came here on a Tuesday evening after we saw that they offered AYCE tacos on Tuesdays. I should've gotten skeptical when I saw that and thought only restaurants that are slow on sales offer AYCE specials during midweek. \n\nNever mind that, my friends and I had reservations for 8 P.M. and we were promptly seated then. We had our own table in a closed-off area from the main dining area along with other parties dining at the other 2 tables in the area. \n\nOur server Brandon was very alert and on-point while serving us at first, but later did not give a crap about us as the night went on. My friend asked for lime wedges to go with his tacos and it was later brought out half-an-hour after he asked for it and dropped on the table without him saying a word. \n\nI suspect that Brandon got really annoyed at our party when we kept ordering tacos at an AYCE SPECIAL. The tacos were coming out from the kitchen at an unbelievably slow rate, so we ordered the next round of tacos once we received our original round of tacos. When I say unbelievably slow, I mean close-to-an-hour-wait-between-each-round-of-tacos-slow. Our party arrived when an NBA game was just getting started on T.V. and we were still there after only 3 rounds of tacos 48 minutes of playing time later (half-time and commercial breaks included). We saw the conclusion of the game.\n\nMy party and I suspected that the restaurant kept us waiting on purpose, so that we can ordering more drinks and appetizers while we waited, to spend more money. \n\nAs if the wait time for the food wasn't bad enough, when our tacos did arrive, they tasted like cardboard. The only decent taco was the shrimp. The fish and the steak specifically were extremely dry and tasted borderline rubbery. The tacos and it's fillings were also EXTREMELY salty and that my tongue still had that salty tingly sensation the next day. \n\nOverall, I'd suggest avoiding Rocco's like the plague. There's a reason why they offer an AYCE special on a Tuesday and it's not a good one. We witnessed tables cancelling their orders left and right because they were taking too long. At least the chips with pico de gallo and guacamole made table-side were good?", "author": "Henry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Ended up here in November while visiting family and the Guacamole is so good. We needed up ordering a 2nd and the server was awesome with her selection, It's huge and lots of space to sit and chat not to mention we didn't have a long wait to get a seat. \n\nThe decoration they had up was also fun and cool the kids really enjoyed it", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "I went here to celebrate Cinco de Mayo with my family, the atmosphere was wild and the place was packed, so the wait for a table of 4 was long, which we didn't mind as we found a space at the bar to start our drinks. The bartenders were dancing and singing along to the DJ mix, which we felt could of been better (sounded like someone phone mix and not an actual DJ).\nAbout an hour or 2 later we were seated downstairs right under the speakers which were super loud for is to even attempted a conversation. We ordered guacamole and chips: this definitely was not fresh guac and the chips were kept warm but not fresh either. We then each ordered 2 tacos: the pork was super salty, the chicken was okay, the black fish were okay as well. We stuck to  as drinks because getting a mix in the crazy rush wouldn't turn out well. \n\nAll in all we'll go back when it's much calmer to really get a feel for the place.", "author": "Rhenita C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "It's always a great time here! I've been here twice to this location and countless times to the one in Boca and Fort Lauderdale, Florida. They have great margaritas, that come in pitchers that will give you at least 1.5 glasses for 3 people. The guacamole is a must, they make it fresh right in front of you. Tacos are yummy too! With this particular location, the bar downstairs is a cool spot to be, especially for a girls night!", "author": "Sheynelle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-16", "description": "I came in here with friends for the first time. We all were walking around and was told by a friend that Rocco's has all you can eat tacos on Tuesday. When we first came in I requested a low table. They told us that none where available and if we wanted to be seated right away, we should the high table. We sat at the high table and near us was TWO EMPTY LOW TABLES. A brown skinned gentleman with glasses and locks (with a blonde streak and ponytail) helped us. He came to the table introduced himself and walked over to the table behind us (the booths) he was busy laughing and taking selfies with the table. After about 15 min sitting down with nothing not even water, we managed to make eye contact and he came over and gave us water and menu. We all knew we wanted unlimited tacos so he wrote down our orders and let us know that it was the end of his shift and that someone else will take over. He managed to pass us on to someone named FLOYD. The transition between the first gentleman and Floyd was horrible. The first gentleman was in a rush to clock out and continue talking to the ladies at the booths that he never put our order in for the tacos. He left his chicken scratch notes for poor Floyd to read and \"clocked out\" when the whole time he was chit chatting near us and didn't even let us know as a courtesy that he was leaving or introduce us to the new server. \nNow we've been waiting for 25 minutes with only water and no tacos. Floyd sent in whatever he could\nRead and 1 order of 4 tacos for 3 people to\nShare came out about 10 min later. The order was incorrect. At this point Floyd had to place a brand new order for all of us. That new order took about 20 minutes to come out even though we were assured that it wouldn't take that long. In that time\nframe we ordered a mild guacamole. Took about 25 minutes for that to come as well after I had to usher the manager and have a conversation with him and the horrible transition and slow service.\n\n\nBy the time all the food came to the table , I was filled with gas from waiting on it for so long.\nFloyd tried to offer complimentary dessert but I asked him to comp the guacamole instead because I was sick of the service I had received. \n\n\n\nIf there was one thing right about this restaurant was FLOYD! He was short and had short locks. He had a great attitude and tried to do everything possible to make things right. THIS REVIEW WAS NOT A REFLECTION OF YOU FLOYD! YOU WERE GREAT!", "author": "Sharlene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Had a wonderful time here and went like 4 times already. Need to get back and get tacos because they are amazing. Thanks Mom for the recommendation and we are going back.", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-14", "description": "This places stinks.\n\nI'm sorry that I have to say that but its the truth. I came here afterwork and it just wasn't a good look. I ordered the chicken verde enchiladas and the chicken tacos and both were terrible. The chicken was just awful. The rice and refried  beans had absolutely no flavor, it was just an overall fail. To add to that the service was descent but when the bill came she only gave us the bills and not the change (coins). She didn't have the courtesy to tell us that she didn't have the coins either. Don't get me wrong I can care less about some coins but the food was bad and that added to an already bad experience not to mention thats unprofessional. The food here is most definitely not worth the price. Do yourself a favor and skip right over this place and head somewhere else Downtown Brooklyn!", "author": "Stephanie A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}