{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "I went to Rocco's tacos about two months ago and the food was just perfect!  I ordered the shrimp quesadillas. Probably the best shrimp quesadilla I've ever had. I was impressed. Let's talk About the decor ! The interior designer put a lot of thought when decorating this place. It's authentic Mexican meets modern Mexican if you get my drift. The bathrooms have tvs in each stall which I don't entirely get if its Faced behind me, but still a great place to be ! I had such a wonderful waiter who was so helpful on meal choices and drinks.", "author": "Tashima V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "The tone of the night was set when after being seating our waiter not only failed to introduce himself to the table, but also went missing when he was supposed to bring us our water.  We waited over 20 minutes for water and over another 10 for him to come back to take our drink/apps order.  Let's keep in mind that this was a large party that included out of towners, children, and a pregnant lady, we made a reservation so getting up to just go was not exactly a suitable option.  He also took more way too long to come back to take our entrees down, while being more than attentive to the table behind us.  Our drinks came out after the apps and then half our party's orders were not even put in, so the children and our pregnant guest were made to wait even longer for their meal.\nAfter complaining to the manager, he offered us a free dessert to which we declined because we did not want to waste even more time for something that already left a sour taste in our mouths.  I see from other reviews that a free dessert is their go-to way of covering up bad service, but no, you can't just shove a free churro in my face and expect me to forget everything.  \nI wanted to like this place, I really did.  I have been to one of their Florida locations and had a great experience there, unfortunately it did not carry over to Brooklyn.  I have to note that the location, decor and food were all good but wasn't enough to outweigh the disaster of an evening I had with family.", "author": "Ana A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "NO. JUST NO.  HORRIBLE SERVICE - I can't stress this enough!!!\n1 - Couldn't find our waiter for about 20 mins \u0026 when we did, he told us he would get us water for our table...didn't see him again for another 15-20 mins. No water then either.\n2 - We order appetizers \u0026 drinks. At this point, we don't know when we'll see him again so I try to order our entrees in hopes that our waiter would space the order out accordingly. No, he refused to take our order then too.\n3 - Still no drinks in sight. My son ordered juice...it took so long to get to him that we forgot he ordered his juice!  We finally get to place our entree order.\n4 - HALF OF OUR FOOD ORDER ARRIVES!!!  Not the important half either - like the kids or a pregnant woman.  That food will take so much longer to come out.\n5 - We speak to the manager because our dinner instead of taking 2 hours, has now turned into a 4 hour nightmare! Why didn't we leave you may ask...?  Because of hangry children \u0026 you just don't mess with a pregnant woman!  Manager then tells us he will comp us 2 drinks \u0026 give us free dessert.  No thanks, it would've taken another eternity to come to us. We would like the check \u0026 our beds at this point!\nI will say that the one star for this review was due to the food itself.  It was good but so not worth the aggravation.  Never in our lives have we experienced such atrocious service.  We will definitely not come back here which is a shame because I had really high hopes \u0026  the décor is really nice.", "author": "HS S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "Wasn't what I expected Mediocre tacos I've had better from food trucks, fresh guac made in front of you was fun ...I guess if you're into warm guac what happen to nice cold fresh ingredients ...if I go back it'll only be for there extensive tequila options they've perfected that aspect of the restaurant", "author": "Chanee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Had. Great dinner, pork and chicken soft tacos actually do ROCK!  Also the table side guacamole is totally KILLER, u can get it as spicy as you like it.  Quick service and friendly servers!  I defiantly recommend stopping in.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Great food even better waiter.  Jarren provide excellent service when you come ask for him by name. Great guy.", "author": "Erik L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Not good at all save your money , so unprofessional! It's not worth it! The food isn't good they charge so much money for nothing! Horrible the girls up front were too busy worrying about what shoes we were wearing and how cute my man was instead of seating us the food was not good at all! So not worth it! Don't waste your time nor money! Trust me! For downtown Brooklyn this is wack!!", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "Good drinks, blah food. Do not sit at bar downstairs, bartenders get too overwhelmed and you wait longer for service! Just sit upstairs for better service period.", "author": "Tameka C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Food is disgusting to say the least! We order guacamole it was too salty. The taco meat was smelly. My wife got a hair surprise in her quesadilla. This restaurant have a serious hygiene issues.", "author": "Charbel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "It takes a very good or very bad experience for me to write a review, and this falls under the latter. This is the third time I've been here and all three times have been horrible experiences. I tried this last time because some friends wanted to get drinks after work. We waited an hour and a half for a table only to be seated downstairs where there were four empty, large tables next to ours, So we were pretty confused about the long wait. After we were seated, we were served drinks and received a round of shots that we ordered. Our waitress was very accommodating and lovely. However, it took us quite a while to receive our food. When it did arrive one person in our party received the wrong order and this did not get corrected until 45 minutes later when everyone else had finished eating. She never received her side order either. Due to the long wait, a portion of her meal got cold and she didn't touch it because cold cheese looks and tastes pretty unappetizing. We also waited 30 minutes for our second round of drinks. We received a round of shots that we did not order as well as an extra margarita that we did not order but thinking they were comped due to the wait we gladly drank them. When the check came we had been charged for everything including the drinks that we didn't order. we asked to speak with the manager. A gentleman named Naheim came to speak  with us. Not only was he extremely sarcastic and unreceptive about our complaints he said he did not have the power to take anything off of our bill unless we checked in on Yelp. He also said we drank the drinks so we should have known we would be charged, even after we explained what happened. I told him I'd rather pay then be extorted; left this review and paid our bill for the drinks. There are too many good restaurants in this area that would be happy to have your business for you to eat here. Even the fast food Mexican places nearby have more authentic Mexican food. My dad got food sick from the food once and I didn't enjoy the food or the experience  on my second or third visit so needless to say, I will not be back.", "author": "Britnie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "The ambiance was fine and the drinks themselves were great -- but I expected Mexican cuisine that was nowhere present. When everyone walks around with \"Hecho en Mexico\" t-shirts, you have to expect to get Mexican food, not food that tastes vaguely Puerto Rican (which is fine, in a Puerto rican restaurant) with Mexican words and accents applied. There was no way to get refried beans -- no authentic Mexican restaurant will fail to have refried beans available. They only had black beans, which are uncommon in most Mexican restaurants (though common in the Caribbean). I did enjoy the \"stuffed\" jalapeños (jalapeños rellenos), though they were not really stuffed (butterflied and fried) and they were very mild. The chile relleno (Campeche) was very disappointing. There was no rosa sauce on it, it was served dry and alone next to a fairly well done skirt steak, whole black beans and rice. The stuffing was unmelted goat cheese and the chile itself was too mild and undercooked. These folks need to go to a real Mexican Restaurant in South Texas to see how to prepare and cook a real chile relleno with real refried beans and real flavor. \n\nI don't want to knock the place too hard. It's not terrible, it's just not very Mexican. I would guess it was conceived and created by a Puerto Rican who went to Cozumel for a weekend and had a great time. They need more flavor in everything -- we tasted quesadillas, guacamole (too much tomato or too little avocado -- the avocado got lost), flautas, nachos (again with the whole black beans! At least refry them people!), and camarones (which were fine) -- and everything lacked spice. They may be serving the Brooklyn market with their flavor profiles, but they are not serving Mexican food.\n\n(edited to fix autocorrect problems)", "author": "Douglas P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "The guacamole is fantastic!! It's made right in front of the table which is cool. They have an extensive tequila menu The atmosphere is pretty chill, which can get loud which is annoying when trying to have a conversation or work in your favor if you don't really want to have a conversation lol they do get pretty busy... Portion sizes are huge and the drinks are strong :)", "author": "Liz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great service from Aja she made my dad's bday really special, I will definitely come here again we all enjoyed ourselves", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Ive been here a few times for lunch, as well for after work drinks \u0026 appetizers with co-worker.  food is good but a bit on the pricier price for mexican.  Guacamole is made fresh to order and is pretty good.   The atmosphere \u0026 the after work crowd is an older crowd mostly people who work in the area.   Def will be back.", "author": "Gloria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Good for lunch out with work friends and happy hours. The food is OK enough. Palatable, but not spicy enough for me liking. I do enjoy the breakfast and lunch to go window open to the side of the restaurant. Great options for food on the run.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "I met my Friend there as she was meeting coworkers to celebrate someone's birthday. Met up with her and her coworkers as they were getting their table. They must have order drinks at the bar or wherever they were waiting. I caught up with them as they were about to sit at the table they were waiting for. It was a large group, about 10-15 of us...So, as I was saying, they must have ordered drinks prior to sitting, and when I sat at the table, I ordered a Ketel One Martini. It took 20 minutes for ME to get a drink...I don't know how long other people were waiting for their drinks cause they ordered them before I had arrived. So, if I waited 20 minutes....they must have waited much longer.\n\nThe wait was SO unbearable that my friend's, friends started to go directly to the bar to get their drinks, instead of ordering them and waiting for the waitress to get the drinks! That is un-fuckin-acceptable! What is was worse......they actually got their drinks faster by doing so, than those of us who had already ordered them. Hey! I know it's a Friday night, and that is a busy time, but if you cannot handle the crowd...Hire some more fuckin' people! That type of service is ridiculous....and if it were MY party, I would have just walked out! The Waitress was very apologetic, and I do NOT fault her for the bar's lack of sufficient resources....BUT!! Do you think you should maybe buy us round of drinks? I dunno, like I said, this was a birthday celebration....you know we're all waiting, trying to have a good time, and it's hot and we don't have our drinks (NOT EVEN WATER)....Do something nice to show the CUSTOMER that you care, and it's a nice gesture that goes a LONG way!\n\nSo, after 20 minutes, I get the Vodka Martini I ordered and I have to say, it tasted like Vermouth and water! I had asked for a Ketel One Martini, and would not be surprised if they had given me well-vodka! We order some light food, like guacamole and chips, and crap like that. The appetizers were good. \n\nI had asked for my check to be broken out from the group so I could pay for myself and my friend, to avoid any money confusion later. I never carry cash and this is so much easier. The waitress was happy to do so.\nAfter being there a hour or so and spending over $100 JUST on MY BILL...that's like 3 drinks, and guacamole and some other dipping type of shit that my friend ordered......ONE HUNDRED DOLLARS! Oh wait...I forgot I ordered a shot for the birthday boy...If my bill was $100 for JUST two people, I cannot fathom what everyone else paid! Hey, I don't care about the money, and I'm only bringing this up to illustrate that we were not loafing at the table wasting time and not ordering things.....we were spending our hard-earned money!!!\n\nThe manager comes over to us, to say that we need to leave because they have other commitments to the table we were using.. ARE YOU FUCKIN' KIDDING ME? Is this how you treat paying customers?\n\nI spend over $100 and there was at least....at fuckin least 15 of us! I can't imagine what they spent, and like I said, If I spent over a hundred for two people....the bill for the rest must have been 5 times more than mine .....And they are asking us to leave? Such low-class ...the manager was so very unprofessional, and showed us no respect! He treated us like we were a bunch of children and not like paying adults. He told us we had to go....and then just walked away!\n\nFine! You'd rather kick out people who are paying, a lot of money, on mostly drinks....Let's face it...these places make their money on drink sales. So, you'd rather kick us out for customers who have not sat down yet and you don't even know what and how much they're gonna order? That kinda of logic, makes no.....FUCKIN' SENSE!!!\n\nFine....I'm outta here. I pack up my shit, and my friend and I head out....I hit the bathroom before leaving and when I come back the same disrespectful manager was talking to my friend when I got back from the bathroom, trying to explain, after clearly noticing that we were so Irate and pissed by his unprofessional actions....His explanation was vague at best and he said (this is good), that he just wanted to move us to a different location so he could use the table. That is NOT what he said to us at the table, and I called him out on that fuckin lie! He then starting spouting off some shit about getting his information wrong or something! At that point, I was SO done, and I kinda feel like he was waiting around, expecting us to forgive him....No, I will not! You were rude, unprofessional and so disrespectful! I will not accept that in any aspect of my life, and I will not accept that from him. I told him, \"I don't give a shit about your explanation....I SPENT a lot of cash here, and I'm sure the group spent a lot of cash, and that is how you treat us?\"\n\nI'd rather eat a Chipotle burrito bowl from a drunk bums pocket, then come back to this place!", "author": "Mickey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "After work ,Me and my friends decide to come here and good thing we did this is our favorite place to come and enjoy time after a hard day at work. They have good food and music plus there drinks are good.What more can I say This place is awesome!! I tell all of my friends to come here. And my favorite part is the fresh guacamole done in front of your table. The atmosphere is great, from there Waiters and there dj playing music and on time with food and it's not expensive at all. I work close by so most definitely coming back!", "author": "Ide I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-09", "description": "I really wanted to like this place. It looks so cute. First we walk in and we get carded. I've never been carded at a restaurant when walking in. Then they had a deejay and it was really, really loud. not sure why they had a deejay on a thursday night. They also had tv's playing so it was so noisy we couldn't talk. Next they make you pay for chips/salsa, which would have been okay had the chips not been so salty they were inedible. The food was okay and the service was okay.", "author": "Paula H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "WHAT AN AMAZING TIME. My boyfriend and I came in on a busy Saturday night and were told the wait would be 20-25mins. We were seated in about 15 and were sat by the manager Zanobia. She was very sweet and gracious. Our server Lauren was awesome. It was a great vibe great food. Great night. I'll definitely be back soon.", "author": "Dajah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "This restaurant is the GREATEST. The manager Xena was very attentive we got free shots. The food was great and the presentation was wonderful.", "author": "Barrington M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}