{"aggregateRating": {"reviewCount": 1198, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "First, let me start by saying that the food is very good despite the 1 star rating. The reason for the poor rating is the customer service. I tried to give this place another chance, but once again, customer service was below par. \n \nToday I came here after a long day at work. I was seated immediately; however, after 10 minutes no one asked me for my order. I had to ask a waiter nearby to take my order which he didn't look too pleased to do. Not once did anyone ask me if i needed anything (i.e. Napkins, a drink, more food, hot sauce... Nothing!). So I didn't tip and I rarely do that! \n\nAs a person who dine out frequently, I am highly disappointed especially since its located around the corner from my job! Please improve your customer service! Unfortunately, I will not return to this place even though I loved my food! I refuse to patronize a place that does not care for their customers...", "author": "Wanda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "Good happy hour (meaning cheap-ish pitchers of margaritas), pretty solid food (the one full meal I've had and many bowls of guac), but generally a bit pricey and overcrowded/loud.\n\nThe decor and vibe is fun if you're looking for a crowd, though.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "Food was mediocre/had no flavor/not worth the $. Service was horrible - they messed up our order twice. \n\nRestaurant was empty and they sat us near the door so it was freezing. \n\nTacombi in NYC is a million times better and has the same type of offerings when it comes to individual tacos and whatnot. \n\nNot a horrible experience, but nothing noteworthy to make me want to go back.", "author": "Becca K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Came here for brunch. First the service was great..the server was attentive and did a great job. 2 the food was good. It was better than expected. But we all had the unlimited mimosas and they were very weak. While the server was more than generous with the mimosas the quality was weak. Outside of that overall I would return.", "author": "Elvin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "Idk, I'm sure it's fun for a large group but it seems overpriced for the dish sizes. Chips/salsa not included with your meal, which is a Tex/Mex staple. Food was super fast though, about 5 mins for a 4-top.", "author": "Victor T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Great place for margaritas and food! We had enchiladas, guacamole and chips. Guacamole is made right in front of you, and they make sure your chips are fresh. Sawyer was our server and he was really nice and helpfull! Make sure you ask for him when you get here! We're definitely coming back.", "author": "Marta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "I've heard a lot of great things about their location in Boca so upon returning home from my last trip there I just had to try them out for myself. We started with the 1/2 order of nachos and even the 1/2 order was a large portion. The nachos were delicious and the guacamole on top was heaven. Next, I ordered the Yucatan combination which was 2 skirt steak tacos and a chicken enchilada. The enchilada was the best I've ever had and the steak for the tacos was delicious. To drink I ordered a pina colada which I couldn't even finish due to how strong it was. Yelpers also get a free shot of tequila upon checking in and our waitress was more than happy to redeem it for me. For desert, we had the churros with vanilla ice cream. I was rooting for the tres leches cake being that you can get churros from\nCostco whenever but these were way better and I'm glad we picked it. The bathrooms and decor in here are very creatively done. There are movie screens behind the toilets and they were playing Despicable Me while we were there. They also had dia de los muertos style skull head paintings on the wall. My only complaints were that there's no parking around so I had to put my car in the Marriott garage next door that cost me $25 for 2 hours (gotta love the city ) and our waitress literally walked off the job mid-meal so our service following that incident left a lot to be desired. All in all, I enjoyed myself and would return when craving strong drinks and yummy Mexican food!", "author": "Roxana J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-12", "description": "The only thing I liked was the guacamole and the chips lol. Drinks were cool. \n\nThe quesadilla was not good the chicken was dry idk how someone can mess that up \n\n\u0026 then the nachos meat taste like chile \u0026 Mmm too me that's not good. \nSo if you need a place to get started with your friends for drinks and chips. I recommend going", "author": "Janice J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "Food is good as well as the service. Sometimes it does get busy inside but it's worth it. The feel of the place is amazing! It makes you want to come back.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "I've only been here during brunch a few times...primarily for the bottomless Bloody Marys. The drinks are big, but it comes with a lot of ice. After a few though, it's still worth it. \n\nThe guac is great - regular and with the seafood. It's made table side so it's fresh. The chips that go with it are addictive--I can't stop eating them. The rest of the menu is decent. Nothing special but not terrible. Oddly enough, I like their chicken fingers.\n\nGood place for large parties and kids.", "author": "Bennie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Yesss!! So love there food and drinks but Ashley girl did her thing on the drinks . She super cool and amazing personality. M", "author": "Kori K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "Tacos were soggy, sour and had no flavor! I got the chorizo, chicken and shrimp tacos (hard shell). All fell short. P.S. They are small so in order to even get remotely full, you need like 6. The guacamole is delicious, but the chips they serve it with are too salty! Service is slow. Shouldn't be that slow on a Tuesday night. We got the classic margarita and pomegranate margarita and both were watered down. Would not return. 2 stars for the guac and decor.", "author": "Karissa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-15", "description": "It might just be coming from LA but wow was that disappointing. I've had better shrimp tacos at Baja Fresh.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "The food was terrific and the prices were quite reasonable but this placed earned a 5 star rating for service. Our food arrived quickly, they made the Guacamole right at our table, everything was so fresh and tasty. Our server, however, was AMAZING! I never had to ask for water, never had to flag her down, and she was on point with our orders. She was quite friendly and entertaining, you just got the feeling she genuinely enjoys what she does. Cheers to you Aja!! Will definitely be back, was a great time", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Pretty huge venue with great food and drinks. Really enjoyed our time there. Our waitress Aja was awesome with our party. Definitely will visit again.", "author": "Aseh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Angel is a fantastic server. Our food was cooked perfectly, fantastic for fun drinks with friends or dinner. Awesome marg pitcher deals!", "author": "Tori B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Our sever Angle did amazing good and made us feel like we was at home....Food was tasty and came out quick....I will be return for my next visit in NY", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "I like this place.  The food is tasty, the drinks are strong, and the staff is friendly\n\nI stopped in last week with some colleagues.  We'd only intended to get drinks, but we opted for food, as well.  Three of us split a pitcher of the white sangria with Grand Marnier Raspberry Peach. YUM. I then ordered the Queso Fundido, which is pretty standard for me when I go to to Mexican restaurants.  Rocco's version is full of chorizo, onions, and peppers, and is absolutely delicious.  It's a generous portion, so combined with the small tortillas with which it is served, it makes for a filling meal.\n\nOur waiter (his name escapes me) was very friendly, as well.\n\nI like this place so much, that I think I'll add it into my regular rotation.\n\nAlso, the bathrooms have TVs in the stalls.  Not the most useful for the ladies' room, but it's definitely a cute touch.", "author": "Cara N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "If you are looking for authentic Mexican food, this is not the place. If you are looking for American-Mexican food, I would look somewhere else. The place is beautiful with an attentive staff but the food...it just wasn't anything special (let alone good).", "author": "Raiana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Great food.  Amazing customer service.  Insane margaritas.  A tequila selection that could kill Mexico. \n\nOne of my wife and I's favorite date spots.  We are there every Tuesday, at the bar, getting amazing margaritas and chowing down on their unlimited tacos.  \n\nThe food is great.  Balanced, large portions and delicious.  Great house made salsas and guacamole.  Their blackened mahi mahi fish tacos are so great, the molcajete is amazeballs, and the margaritas.... The margaritas.\n\nThe margaritas are fantastic.  The sour mix is so great, and the bartenders are the best.  Literally: the best bartenders. \n\nWe've sat everywhere in the restaurant and the place is beautiful.  Well decorated and fun; art everywhere.  \n\nMy wife and I have both lived in California and miss all the great Mexican food and restaurants. This place looks and feels like some of our favorite spots on the West coast. \n\nWe usually sit at the bar because we've gotten to know the bar staff but the wait staff and all the managers are great too.  Shout out to our favorite bartenders Alex and Lewis!!  Alanna always takes care of us when Alex takes a day off, and is also awesome.\n\nEven the busboys and bar backs are amazing and keep the service friendly and fun.  Victor makes insane guacamole, is covered in tattoos and is incredible. \n\nAlso: Rocco stops by occasionally and that is an event.  He walks along the bar in white shoes from Pee Wee Herman, plays the tequila song, and pours hundred dollar tequila into any drink/person who is game.  \n\nThough its often crowded, their aren't usually long waits because they have two large bars, and two floors of expansive seating.  It's always a party in Rocco's as there's always a DJ mixing it up. \n\nI'm a fan.", "author": "Marc S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Rocco’s Tacos \u0026 Tequila Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "339 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/T0A2CwSjD6tS6SMi8t2shw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468226"}