{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "I love wine bars, so when I saw this one with what I think is a cute interior (sorry other reviewers) it was on my list for awhile. \n\nThe bartender wasn't particularly talkative or overly friendly but he was attentive. Drinks were fine and the sazerac was solid and well balanced. Wasn't a fan of the house rose but the Prosecco wasn't the worst. \n\nFYI, kitchen closes at 9:30pm on Friday. Overall would definitely be back. It's laidback and you can actually have a conversation.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "So glad we chose to have our company's holiday party at Olympia Wine Bar this year! Owner Karen was an excellent host. She made it easy to reserve the space, and made sure the bar was set up perfectly for our private event. Olympia has great ambiance, and we especially loved the holiday decorations (large wreath, soft white string lights, candles). Also super appreciated bartender Liz who was on top of getting everyone their drinks quickly and expediting when food was low. Highly recommend if you're looking for a cozy yet chic space for your next event!", "author": "Jess F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "I've gone to a few happy hours here. I've mainly gotten cocktails and they were nice, but not memorable or particularly strong. Always went with a group or people and didn't end up interacting with the bartenders really at all.", "author": "AnnaRose G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Hi.  I really liked this place.  It has a very chill vibe which lacks attitude \u0026 pretension.  Tall ceilings and nice soft lighting makes for a comfortable experience.  I had a glass of the crisp Gruner Veltliner and this awesome crostini of white anchovies, red peppers and nice olive oil.  Not canned anchovies but the real, specialty type white ones.  Those, with the bright red peppers, made for a visually beautiful treat that paired perfectly with the Gruner.  The bartender told me it was new to the menu so I hope they keep it.  Oh, and the music was awesome:  in a 15 minute span it went from classic soul, to downtempo hip hop (Tribe Called Quest) to Boards of Canada!  That's a sweet mix.", "author": "snoopy c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "Nice place in DUMBO, decent wine selection and nice place to have a conversation and meet people", "author": "Vijay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "I was so happy to find this new-ish wine bar in DUMBO. I learned it has been open for about 3 years. It was the perfect venue to meet up with a friend after work. It is a cozy and quiet wine bar. It was very cold that day so the hot toddies were wonderful to warm us up! We also had one of each of the crostini which were very good. Service was also quick and friendly.", "author": "Steph K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "I came here on a Saturday night for a drink and had a great time. I actually can't  drink wine but they offer great cocktail options. The cocktails are only $10 and I had a Reviver that was SO good.  The old fashioned was solid. The bartender was attentive and I enjoyed the unpretentious ambiance of the place. I will definitely be back for another date night- good drinks and seating and quiet enough to actually have a conversation.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "It has taken some time, but Slumbo finally has a wine bar that isn't way over in Vinegar Hill. This is really where Dumbo is anyway -- under the Manhattan Bridge overpass. It's beautifully done inside with a little kitchen where the cheese plates are prepared. It's classy-looking without a snooty attitude.\n\nHad a white wine there, which was reasonably priced and very good. Haven't yet ordered a red wine, though when I do, I will make sure to ask for a taste first. The person who chose the wines at 68 Jay is the person who chooses the wines for Olympia. (Was never crazy about the house red at 68. But for the price, never heard anyone complain.)\n\nThe cheese plate my friend ordered was small with cheeses sliced thinly, but it was a nice complement to the wine.\n\nWhat I liked most was being able to enjoy a well-priced glass of wine in a comfortable and visually-appealing atmosphere. Great job, Karen. Loved it.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-23", "description": "Curly sue has got to go! My friends and I went here and had awful service. My friend ordered the kings drinks ( a drink that should not be on the menu in the first place) and when we tried to rectify the situation, we were given attitude and the worst customer service experience. We are regulars and work around the corner and expect to be treated better.\n\nI like this place and want to like it more, but it's ripe with customer service and bar management issues that prevent it from reaching it's full peak. I want a neighborhood experience when I go to a bar and being that dumbo has so few options, this place has the chance to change it around, but it remains to be seen whether they will put value on their customers as much as their craft.", "author": "Tierra M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "After attending the Festival of Lights, my friends and I stopped by this wine bar for a snack and some drinks.\n\nIt's a nice cozy bar. It wasn't too loud and we were able to carry on a conversation. We ordered a cheese plate, meat plate and bruseel sprouts to share. Everything was decent.\n\nI ordered a Moscow Mule, which was a refreshing vodka cocktail. Perfect way to end the night.\n\nOverall a solid place to kick back and relax with some friends over a glass of wine.", "author": "Victor G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Amazing event space for a small/medium sized party! (30-60 people). Working with Karen was such a pleasure!! She was incredibly accommodating and worked so hard to make sure our party was a success. We rented out the bar for my brother's engagement party from 8pm-11pm on a Friday night. Everyone raved about the venue. We were able to decorate, bring in food from outside vendors, and enjoy the amazing drinks at Olympia. The staff was excellent!! We didn't end up leaving until well after midnight and Charlie (our bartender) and the barback remained enthusiastic the whole time. I would highly recommend Olympia Wine Bar for a birthday party, engagement party, etc.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-06", "description": "It is so typical of Dumbo where it's hard to find decent places like in Williamsburg, greenpoint and smith st. We came to try out this place since anything new on Dumbo is welcomed. But, disappointed when they seem reluctant to serve the tables. We sat by the window where it is nice and cozy. But no service for a long time. So we wave them down at the bar from where we are (would have gone up to the bar if we just wanted drinks) they simply ignored me and I had to go up and ask for some service. Then I got a lecture from one of them saying I didn't have to wave them down like that. Really? Was I rude that I wanted service? Anyway, she finally came over and take our order. We ordered a few tapas and wines. The tapas was small and not impressive but the bill was expensive! We walked out feeling ripped off. Will never go back there again!", "author": "Roxie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "This place is cool but service is horrific. Felt unwelcome on a nice spring day. Bummer! Great happy hour deal though.", "author": "Gabrielle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "I think this is a great addition to the neighborhood. It's very easy to meet people at, if you are passing through the hood. The service is very competent, quick and friendly, and I've enjoyed the 4 or five different wines I've tried there, all on the bartender's recommendation. 5 stars for being a good wine bar in an area that needed one!\n\n... although the menu is limited by the space, the food offerings have been getting more involved it seems. I had a very tasty salt cod dish there the other day, which was not on last time. Mostly you can choose from different meats or cheese... I'm looking forward to going back.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-20", "description": "Decent spot, but nothing special. I'm not much of a wine guy, though. That might be why it was only ok to me. They have a full bar which is nice. However the drinks are nothing special. I would definitely go to Atrium, Almar or Jack the  Horse Tavern for cocktails first. The beer selection on draft isn't good either. Overall nothing special.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Had my 30th birthday here. The drinks are great and food is delicious. The owner was extremely nice and accommodating. She let us come early to decorate and play our own music too! I've been here a few other times and the service has always been great.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "So many cute places in the Dumbo area. I think I can safely say come for happy hour, but then you can push on from this place. Keep looking - especially if you are looking for food. \n\nThe decor inside is very alluring and advertised as a wine bar. They have a good selection of wine and it's at a reasonable price. \n\nThe food selection that they offer is embarrassing. We ordered the cheese plate and then we added salami and prosciutto. It came out with lack luster portions. There was only 1 piece of prosciutto folded over to look like more meat. My friend and I couldn't even each have a piece.  Don't go there if you're hungry. Food is a bust.\n\nService was medium as well. It wasn't that busy in there, but there was only one person behind the bar serving everyone in the place. So, I'm sure it was a little annoying getting to our table from behind the bar. It's also a little annoying when I have to keep getting up and interrupting a conversation the bartender is having with a regular to reorder our water I've asked for twice, get a second round of drinks and ask for the check. \n\nI was clearly hangry. I'd go back at least for happy hour, but not for a meal.", "author": "Beverley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "This place is soooo cool.  The neighborhood needed another bar that was not so divey and this is the answer.  The decor is great.  Lots of woodwork in the Art Deco style. The staff is friendly and engaging.  The appetizers are great and cheap.  Order a platter and choose 2 meats and 2 cheeses.  The place is new and clean.  It is the antithesis of a dive bar yet you feel comfortable there.  Best yet, your beers come out icy cold right from the tap.", "author": "Harold G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-20", "description": "There was a mouse in the bar. The wine was overpriced. Happy hour was good. Only five dollars for a Moscow mule! Bartender was very nice. But the mouse thing. And the small plates were really really small.", "author": "Christine K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-27", "description": "why Dumbo why...why can't we get it together to have one decent bar. We had hillside but it closed and Olympia has so much potential to be great.  Alas, I've been here several times and always disappointed, the decor is meh... I don't understand why bar/restaurant owners do not hire or consult with designers, this place could be GREAT.  And the wine, it's fine, cocktails are ok the food is awful.  Seriously why have a cheese plate when you are serving crappy grocery store cheese and stale baguette. I've had a better cheese plate on jet blue.  I don't get it...but sadly I will be back because it's basically the only game in town.  The owner is a very nice woman and I hope this bar improves because I would love to keep going there but as it is every time I do I end up complaining about Dumbo's lack of restaurants.", "author": "Robin C."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "Olympia Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "54 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/WoJadLBBpf_rZJZUIPViWw/ls.jpg", "@type": "Restaurant", "telephone": "+17186247900"}