{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-26", "description": "To be honest i hate giving bad reviews but I wasn't too impressed with this place. The service was mandatory. I felt like our company wasn't 'welcome' both bartenders were EXTREMELY rude even though we were getting a good amount of food and drinks. Food was very bland and sparse but it's a wine bar so whatever. The saddest was the service.", "author": "Elena M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Went for a quick bite and a drink to Olympia tonight. It's a small bar/restaurant with a cozy feeling to it. The food was really good, it might be cooler if they had more variety, though. The staff was really nice and the area is super interesting to walk around. I would definitely recommend this place!", "author": "Carolina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "I stumbled in on this bar the other day randomly.  Really enjoyed it and I would definitely return.  The staff was really nice and friendly, the wine was great and the prices were great.  The only reason they didn't get 5 stars from me was because my friend and I both agreed their \"snack\" menu was a little weird in terms of options.  I got the cheese platter with salami which is always a safe choice at a new place and it was pretty good.", "author": "Frances B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Classy, casual, chill.  Not expensive either.  Staff was friendly and helpful.  Feels handmade, not contrived.  The zinc bar is beautiful.  Great place to pop in for a glass of wine or two.  Perfect addition to this part of DUMBO.", "author": "Nathan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "I love Olympia!\nBest Kendricks martinin in the neighborhood!\nGreat service.\nNice and chilled little spot!", "author": "Kate G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Like many, I was excited to hear that a new wine bar was opening in DUMBO. Olympia is a solid place but, in my opinion, it isn't really worth a trip from out of the neighborhood. The wines were decently priced and they serve a Douro, which was a pleasant surprise for a bar with only 5-6 selections of red. The cheese selection was pretty standard but all tasted good. I also expected a bit more from the interior/vibe, which really had no defining aesthetic.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-19", "description": "Both Olympia and 68 Jay suffer from the same lack of thought and attention to detail.  Whether its the lack of air conditioning on a humid day, the unfinished paint job, the woeful understaffing, the lack of any music, the odd choice of wooden chairs on an echoey tile floor, or really the lack of any interior design decisions at all.... Something about both these places makes them feel incomplete. IS this really a bar? Or is it just some friends who got together in an empty disused deli and opened a few bottles of wine?", "author": "J W."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "Olympia Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "54 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/WoJadLBBpf_rZJZUIPViWw/ls.jpg", "@type": "Restaurant", "telephone": "+17186247900"}