{"aggregateRating": {"reviewCount": 21, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "This is my go to place for dumplings. I love their steamed shrimp dumplings. You get eight to an order. Very affordable. I also love their soups and they have a special diet menu where you can get several items steamed with sauce on the side and a choice of three vegetables. Very tasty my favorite Chinese restaurant in the neighborhood.", "author": "Gwen G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-20", "description": "I spend over $30 in take out every time i buy from here. This time on my way home with the kids from school I picked up. Got home to find out they gave me something spicy that the kids couldn't eat.( Singapore chow mien fun, I order just pork chow mien fun) . They charged me more for this. Called to let them know they made a mistake and if they can please send me my order and not even asking for the balance refund. She just said NO! That it was not her fault that she didn't take the order and that I picked it up. I explain how I couldn't return to the store for it was a far walk and my kids already started their homework. She said NO! What happened to customer service? Never will spend my money at this location again. Cant believe how much we spend here and this was the service I got for being a loyal customer for 8 years.", "author": "Dwight V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "(TAKEOUT): Fast delivery, they were accurate with my order, and the food was great. Will order again.", "author": "Neil M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "The food is good. \n\nPlease understand and prepare..., if you order a combination platter, it's just that!  Truly, every item is combined in one dish.  Rice, Lo Meing, chicken, ....all in one dish....", "author": "Imat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "*REVIEW FOR TAKEOUT ONLY* The best general tsos chicken in the neighborhood!", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Chungchun is my go to place for Chinese takeout. And let's be honest, it's a greasy wok like most Chinese food joints in New York City. It serves American Chinese food and it does it well. They've never messed up an order, and the delivery is ridiculously quick (I live two blocks away, and I've received their delivery five minutes after getting off the phone with them. I have absolutely no idea how this is possible). The vegetables always taste fresh, and they nail every dish. If it's supposed to be crispy, it's crispy, tangy, it's tangy, you get the idea.\n\nTheir combination plates are very filling and inexpensive, and their dumplings are about as good as anything you get in Chinatown, except that they're bigger. Chungchun is also open very late, or at least later than most neighborhood delivery places in the area.\n\nOne of my personal favorites is their General Tsao's Chicken.", "author": "Trey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "best Chinese food on Myrtle hands down. best Lomein and sesame chicken . fresh eggrolls and soup.", "author": "Rose R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "The small broccoli with garlic sauce was an outstanding deal at $3.95. The ribs scored well in taste and meatiness but be warned, the abundant sauce might inspire you to go for a DeBlasio-esque fork.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "I'm the first to review this joint? Bet I know why!\n\n2 stars because my dinner cost only $5.95.\n\nThis is \"ghetto Chinese\" but just average, if not slightly below. I am a lifelong fan of ghetto Chinese. I love being able to get my fried chicken and my beef with broccoli at the same eatery. I also like the speed at which your food is prepared, because it's all fried somehow. Hell, I guess I just like fried food. Most fat people do.\n\nI got a whiting \u0026 fries tonight, and it was not remarkable. I know this can be a great meal if done right, and a lot of ghetto Chinese joints can do this justice, but not this place.\n\nThe fish didn't have too many bones, but it was probably some of the dirtiest tasting, southeast asian imported Basa fish that I've ever eaten.\n\nDid you know that sometimes what's called \"Whiting\", \"Lake Trout\" or even \"Catfish\" is actually an imported Vietnamese/Thai catfish known as a Basa? 100% true. And some people do think they  taste better.\nhttp://en.wikipedia.org/wiki/Basa_fish#.22Catfish_War.22_in_the_U.S.\n\nThe french fries are like Ore-Ida crinkle cut fries, and not the shoestring/Mickey D's type that I like.\n\nTheir tartar sauce ain't bad, and they'll give you all the ketchup/hot mustard/hot sauce you want, but the hot sauce is more like sweet\u0026sour with some kick to it, and not Tabasco or Texas Pete type.\n\nThere are 2 booths, and the screaming kids from the neighborhood are running all around getting cheese fries and making the dine in experience generally unpleasant. \n\nI'm quite certain I was the only white person here. \n\nI may in fact be the only white person who has EVER dined here.\n\nDon't be scurred, whiteys. Myrtle Ave. ain't THAT bad after dark!", "author": "Jason V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "I actually really like this place. it's just your basic Chinese restaurant but stick to the staples and you won't be disappointed. they also have pretty good chicken wings. Finally, at these prices you can't go wrong.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Delicious cheap chinese food! I love ordering pork dumplings and the general Tso's dish. They give nice portions that last a couple meals and the staff is nice and friendly. Right down the road from me, so it is close and I thought I'd try it out and the prices are inexpensive and the food is great for the price. Love it!", "author": "Stevie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "Fast, inexpensive, filling and decent. The inside was clean and the cashiers were friendly. \n\nTheir fried items could stand a tad more time in the fryer to make them more crispy, but everything I had (chicken-fried rice and crab rangoon, which seemed a little light on the actual crab--or imitation crab) were totally doable.\n\nIt's not five-star Chinese dining, but it certainly hit the spot.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "It's hard to compare all these identical Chinese places against each other, the food really is the same everywhere. Where the difference is, though, is that I had some really crazy Ambien-style dreams after getting takeout here. Coincidence? Maybe, but consider it.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "this review is for takeout only.\ni would never sit and eat here, because ambiance is extremely lacking. \nbut it is good for what it is! \nchung chun is way better than your  average chinese takeout hole-in-the-wall. \neverything i've had is fresh, and most importantly, the shrimp doesn't have a previously frozen taste.\n\ni'm very happy it is so conveniently located and cheap as hell!", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Food is fresh, my favorite dishes are General Tso Chicken with Plain Fried Rice, Chicken and Broccoli and Beef LO Mein. I usually it here on a regular.", "author": "Rick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "As far as takeout places go, Chung Chun is ok with me. It is steps from my apartment and doesn't have the same \"vibe\" as Kum Kau. The food tastes fresher than other take outs in the neighborhood and the prices are right. At the end of the day, Chung Chun is good for exactly what it is there for-a quick and cheap chinese take out meal.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "This is my favorite cheap Chinese take out in fort greene. They are clean, efficient, friendly and polite. Once when they were about to close they let me owe them my order rather than wait for the atm. They have a good variety. They are not gourmet, but I trust their food, and they make hot and sour soup to order!", "author": "sophie d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "This has become my go-to cheap Chinese place in Fort Greene. Some dishes (General Tso's and Beef Chow Fun are favorites) are better than others (not great Sesame Chicken or Fried Won Tons). The fried dumplings are particularly good. Add a quart of their homemade iced tea to your order - it's really good.", "author": "Stephane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-14", "description": "Look, this place isn't glamorous. If you want to sit and eat you're better off at the deli next door, but if you want delivery/takeout Chinese, this is a good one. I find myself coming back almost weekly despite the neighborhood being full of this tier of Chinese restaurant. Best meat-candy and fried rice in the neighborhood. If you want something Asian and a bit more upscale in this neighborhood, stick to Indian and Thai.", "author": "Luke D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "General Tso's is awesome. Friendly service and clean interior.", "author": "Jesse O."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chung Chun Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "338 Myrtle Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/BiQVxjC71uhb7KKQafkfdw/ls.jpg", "@type": "Restaurant", "telephone": "+17188552119"}