{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "Needed to waste some time before the start of a movie so we decided to try this place out. Good vibe, nice crowd and the bouncer was super sweet. \n\nGot there, walked into almost a small town pub atmosphere; the games were on in the back and there was amble seating and a juke box...a juke box people!\n\nGot the appetizer sampler: chicken strips, jalapeño poppers, mozzarella sticks, and potato skins....and it was all a delicious way to start off. We also got the wings which were pretty good. Some Stella and shots later I was even starting to care about the Mets who were losing *coughsurprisecough* their game. \n\nService is a little bit slow but everyone is friendly so I can't complain really and it seemed like there were only 3 waitresses servicing the entire sitting space. \n\nTwo of us, partially tipsy and fed - $45 which you would have killed with one drink and an appetizer in the city. \n\nI will definitely go back here...on a Yankee game night of course.", "author": "Anastasia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Good local sports bar with a number of TVs. Good craft beers and the wings are among the best that I've found in Brooklyn. The fries are awesome also and the pricing is very reasonable.", "author": "Ronald G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "One of my favorite bars in all of NYC. Although due to the mass departures of the old bartending crew, it's not as good as it used to be. However, in terms of pricing and deals, this place is still better than most bars in the area. The wings are to die for (always get hot, they're not that spicy and all the others are too bland) and there's always a story there. I've had so many strange and funny experiences there, from watching a man who resembles Frank Zappa drink tomato juice and Rolling Rock together while still in his white lab coat and carrying around a steel briefcase (contents unknown), to seeing a married couple bicker and fight constantly all while running a $100 bar tab nightly. There used to be an old African American man who wore a fedora and smelled like a garbage dump there as well, always adorned with one white glove like MJ. While I never attained the status of having a beer cozy put aside from me in their glass cabinet, I still look forward to going back to this place and having a new story to tell (they also are one of the few bars that still \"get\" it--buy three beers, get one free. If you become a \"regular\", it'll become buy less and get more very fast).", "author": "Dan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-24", "description": "If you'd like to order a chopped salad and do not get any apples, blue cheese, or cucumbers as advertised, or order a buffalo chicken sandwich and have extra hard and rubbery chicken and wait 15 minutes for utensils, napkins, and beer, or like to have your sandwich first and beer 10 minutes later, go to O'Keefe's and sit upstairs.\n\nBeen there twice, horrible service each time.", "author": "Bee G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "The good:\n\n1. The wings. Tough to get good wings in the Heights so this is as good as it gets.\n2. Beers. Decent prices for brand name beers.\n3. Sports. They have the MLB and NFL packages served up on 10-12 40\" plasmas.\n4. Waitresses. The turnover is high but they're all nice college kids making a few bucks.\n\nThe bad:\n1. The bathrooms. The bathrooms face the dining area on the first floor and the urine and fecal stench wafts over the tables. Absolutely disgusting and inexcusable in the year 2011. Hire a plumber, dikwads!!\n2. The night manager. He's a balding, fat bartender at the far end of the bar on most nights. He has an attitude, never gives buy-backs and \"dances\" to his horrendous playlist of bad funk. \n3. Menu items. Stick to wings, fries and quesadillas. The burgers resemble diner \"cheeseburger deluxe\" and the quality of the other offerings is FAR below average.", "author": "O U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-26", "description": "Food is great, price is not that great, drinks are bottom shelf, no good happy hour sales or anything worth coming here, SERVICE sucks, the middle aged woman behind the bar for lack of other words is a clown. Not coming back here again(came twice to try and see if it was a one time deal, not the case still a bunch of clowns)", "author": "Frankie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "Came here to watch the Women's soccer game. I was most definitely the only person at the bar who was happy that Japan won. YEAH!\n\nO'Keefe's has the front area where you can sit at the bar or the few tables next to the bar, and the back area where there are several more tables. They have a good amount of flat screen TVs, so no matter where you're sitting you'll definitely have a pretty good view of whatever you're watching. It's a pretty spacious bar (especially the front area) so it didn't feel crowded at all even with approximately 60 people watching the game.\n\nService isn't the best. Our waitress didn't seem very happy to be serving us and she wasn't that attentive. Food was mediocre as well. My onion rings were too greasy, it made me nauseous. The guacamole they served with the chips and salsa was very blah too.", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "We always end up here when we're Downtown and have a craving for some fast affordable bar food.  Food and drinks are reasonably priced and the bartenders are consistently friendly.  There isn't anything that particularly stands out about this joint but it gets the job done when needed.  That's what she said.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "First time in Brooklyn and first time at this spot. I was little hesitate at first. It wasn't very crowded for a Saturday night. But I ordered my first drink and was very impressed. The wings are awesome. I had wings several places and can honestly say not on this level of quality. I totally recommend that if you are in the area please check it out.", "author": "Dee W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-30", "description": "The Good:  This is a to go to spot for Buffalo Wings in NYC.   You can get the sauce on the side so as not to loose out on tasting the crispiness of the wings.  The Staff is friendly and the beer on tap abounds.  Their french fries are amazing too.  \n\nThe Bad:  The rest of the menu, you are on your own.  You can get better burgers at the Five Guys up the street on Montague and the nachos just like anything Mexican Food inspired in NYC, are just that. \n\nThe Ugly: Game nights are crowded and if you do not want to be in the room with so many lawyers just don't go there.  I think the Brooklyn DA, moves into this place soon after 5:00 pm.\n\nSubways to: Close proximity to the Borough Hall, Montague Street, Jay Street Station and somewhat walkable to Hoyt/Schimerhorn or Bergen Street Stations.", "author": "violette c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "We went for an after-work happy hour mid-week, and I was not overly impressed with this place.  On the plus side, they do have quite a few TVs for watching sports.  On the negative side...the food was mediocre bar fare, the service was merely okay, the bathrooms were not the cleanest I've ever seen, and the clientele was a bit sketchy (a ghetto cat fight almost broke out when we were there).  When all else fails, I would probably return...but it would not be my first choice.", "author": "Merrill O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "Great place to watch a game!  Wings are great! Drinks are great! and ample TVs.  And the bartender (I think her name was Vanessa) was really nice, great personality for the bar.", "author": "Frances B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "Decent bar for happy hour after work. Been here a few times with coworkers and they're reasonably priced and the appetizers I've gotten are pretty good. Spinach dip, wings, quesadilla...all good choices.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "I've been to hundreds of bars in my life. Usually, bar food is unexceptional. This is because food usually tastes better when your drunk. But this place is different. This bar had the best bar food I've ever had. \n\nI had their wings in honey and chili cheese fries. The wings were big, meaty, crispy and delicious. The chili cheese fries weren't soggy, each fry was crispy, the chili had excellent, robust flavor. \n\nThe bar itself is relatively large with 2 floors. It's pretty clean too, it didn't have sticky floors and smell like old beer. They have a lot of tvs up on the walls showing different games. The atmosphere is pretty chill and relaxed. It had a good mix of different people. It definitely didn't have the pretentious feel of a lot of bars in Soho or the feel of a dirty college bar in the west village.  \n\nThe bartender was friendly and service was good and fast. I recommend this place for a good meal and it's a nice place to relax and watch a game. I'd definitely go back.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "As far as buffalo wings go, O'Keefe's has some of the best I've ever had. Wings are made very differently depending on where you go, and a lot of them are lackluster, but i've been eating at O'Keefe's for about 8 years now and they are still some of the greatest. But what they really do better than any other spot is jalapeno poppers. Those are DEFINITELY the best I've ever had. Get 'em. Other than that, standard sports bar, waitresses and bartenders are generally friendly, prices are decent, beer selection is good, but the selling point is better than average bar food.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "I'm a tad confused as to why people are saying the food is good. It isn't. Its all pre-made, pre-packaged, frozen garbage. Definitely skip the food and just order a beer. Mixed drinks were weak.", "author": "Rianna G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "I'm a regular at O'Keefe's and I love their wings. Sometimes, I'll even place a pick-up order just for the wings. I recommend O'Keefe's to everyone, but this past Sunday, the bartender really got under my skin and made me never want to go back there. I've never had an issue paying via credit card there before and since I've ordered wings for pick up before, which comes out to $10.55, I know I can put that amount on a credit card there. However, when I went in on Sunday to pick up my wings, the bartender was just plain nasty to me and refused to allow me to pay via credit card. He claimed there was a $15 minimum! I've never heard of that there before! And I know I can place a drink order for under $10 and still be able to charge it to a credit card! Luckily, I had exactly $11 on me so I was able to pay but thinking back on it, I really should have just walked out after telling him to keep the wings; it was just the way he spoke down to me like I was there asking for charity instead of trying to pay for my wings! Next time, I'm walking out. The rude bartender was an old white guy with grey thinning hair and I'll go somewhere else for a drink or for food if I ever walk in and see him tending the bar. Also, he should read this article: http://www.creditcards.com/credit-card-news/credit-card-minimum-payment-purchases-law-1282.php\n\nBy law, the max credit card minimum is $10. If it wasn't for the fact that I know the establishment itself doesn't impose a $15 credit card minimum, I'd report this incident to my credit card company. However, it's just that disgustingly rude bartender who has taken it upon himself to impose his own rules.", "author": "E G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-31", "description": "If you're a customer, this place is alright.  The service can admittedly be slow on a busy night because only 2 waitresses are employed to staff the entire place.  The kitchen is tiny and understaffed as well, and food can take over an hour.  When it comes out it's usually fine, though the spinach dip has been rancid, the meat over/under cooked, the lettuce rotten, and everything of course starts frozen or powdered.  \n\nPeople also complain that the tap-beer tastes stale, and the glasses are dirty because they are not dish-washed, but merely dipped in sanitizer.  The waitresses are required to pick trash off the floor, but there is no sink in the waitress station for them to wash their hands, so all in all, it's not the cleanest place.  \n\nIf you're ok with that, the only remaining problem may be ethical; one reason your beer is affordable is that staff make about $1/hour, don't get overtime, and are sometimes forced to work 12 hour shifts with no breaks or 'span of hours' pay.  There are no sick-days, even when waitresses come in coughing and sneezing, which affects everyone.  They are also required to pay for your check out of their own pockets if you walk out, which is illegal, but if they don't, they fear they will be fired.  \n\nStill sound like a good place?", "author": "Cleo S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-12", "description": "If you like to relax in a bar surrounded by big TVs showing you a variety of sports, this is your kind of place.\n\nIf you like a bar with limited selection of stale beers served in a chipped glass, this is your place.\n\nThe food is edible.\n\nNot that I tried, but this would be a horrible place for a man to move his bowels.", "author": "Danny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-01", "description": "a favorite phrase:  \"This beer is on the house.\"\n\nSucks when that's followed up by a bill that contains said beer.\n\nStill, good basic bar food, perfect amount of TVs, and a nice balance of NYY and Mets fans", "author": "Barney B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}