{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-14", "description": "Sat upstairs for the 4 o clock game; was comfortably close to two 40 inch screens one showing the Giants, one showing the Patriots.  No complaints, standard sports bar.  The vegetarian chili was pretty good too.", "author": "Kiran S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "If you happen to be stuck for a place to get a drink while visiting your lawyer, this is the place for you.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-01", "description": "We were on a search for good wings. People said this place was great, but I think Bonnie's was better. \n\nRedeeming quality? Besides one crazy man who was making rounds harassing people, it was relatively chill and a great place to watch sports (with over 12 tvs in one room - we counted).", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "Good place in the area to just grab some food and chill with some friends over a beer. Bar and tables downstairs, and a few more tables upstairs.\n\nWings are not the best, but are pretty cheap. I shared a basket of 10 wings and chicken fingers+fries, and had 3 beers ($2.50 pints of bud and bud light on wednesdays!) and I paid a grand total of $20 including tax and tip. Not bad at all!\n\nThe service was also good-- our waitress was suuuper accomodating to our large group.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "This morning I woke up, stumbled to the bathroom, and turned on my shower.  It took me almost a full minute before I realized one of my roommates put the detachable showerhead back on it's holster upside down, made obvious not by the steady stream of warm water running down my wall, but by the conspicuous non-sounds of shower water.\n\nAfter fixing that disaster (throwing my roommate's towel on the floor and yelling \"Shit!  Fuck!\"), I then procured a new, freshly laundered towel from the Linen Box.  After drying myself off, I see that I have covered my entire face and head in cat hair.  Specifically, my roommate's cat Baby D, who, it seems, made a bed of my towel.  \n\nUpon arriving to work, I discover Wordpress still refuses to upload photos to my blog, and that because of Brownstoner and Curbed, my blog had gotten 1500 hits in the past two days, which is usually a good, no GREAT thing, but I haven't uploaded i single photo in two weeks, making me look like a Slacker Blogger, blogging only because it's an activity I can do while smoking weed and jerking off in sweatpants and still justifying my Vassar degree.  But that's just not the case!  I don't even have a Vassar degree!  Fuck you Wordpress.\n\nAfter trying unsuccessfully to make some phone calls (note to boss: save your notes about my phone etiquette til after the phone call, me being unable to listen because you're talking to me as well certainly can't be fucking helping.), I decide to go to lunch.  And have a beer with lunch.  Oh yes, my friends.\n\nI walk into O'Keefe's.  Surprisingly full; I've never been for lunch before.  I find a seat at the bar amidst what appear to be lawyers, construction workers, possibly some jurors, and various other people of employment.  \n\n\"Would you like a drink?\"  Why yes, I would.  I'll have a beer.  I open the menu.  They have buffalo wings.  My eyes nearly fill with tears at the thought of eating wings, drinking beer, and chortling with an amusing friend after work some time.  But not today, no, today I shall have a burger.  I drink my beer and let my eyes rest on various sporting events playing on hi-def tvs in front of me.  I eat my burger.  No one talks to me.  the Black Crowes sing.  I feel better.\n\nBest bar in the area.  I'm ready for round two of crappy day.\n\nWordpress is still down. Motherfuckers.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-01", "description": "O'Keef'es has Magners (My Favorite Cider)!\n \nI went last Wednesday, and the three of us shared Buffalo Wings (very saucy and pretty spicy) along with Jalapeno Poppers.  The wings were good, but messy.", "author": "Hideki K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-08", "description": "You need to keep an eye on the menu prices versus the bill. When you get the bill everything is 25-50 cents higher than the price on the menu. Further, when you get 20 wings you get one tiny little container of blue cheese. If you ask for more, they upcharge you 75 cents. When I called the bartender out on this he got very nasty with me on both accounts. The food is pretty good if you can negate the scams and overlook the attitude.", "author": "G. Elliot And Gretel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-28", "description": "The [female] bartenders and waitresses are very cute, the food is decent and they have a decent selection of beers. I like the place but it's nothing exceptional. The pasta dishes are surprisingly good, however, so I do recommend you give those a try if you like pasta.", "author": "Tony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "Always loved the food there, usually got a burger and fries. Service was always pleasant. Its not the best place for large groups bigger than 4", "author": "Mr M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-01", "description": "Still gets 5 stars from me.   Mainly, this has to do with their additions.  They finally got satellite there about 6 months ago -- the previous building owner forbid them from installing the dish.  That means Sunday Ticket for NFL and College Gameday.  So, now, definitely one of the best sports bars around.\n\nAnd, they just added a new set of taps (to go along with their 2 taps of classic beers).  This one has like 5 or 6 microbrews, which is just awesome.  Like Goosehead, etc.  I dunno if it will be rotating or anything, but this is Brooklyn.  We need some good beer here.  So nearby Brazen and Downtown Bar and Grill have some competition in this regard.\n\nAnd I'm not gonna lie.  This bar attracts some odd characters (I don't  think I count haha).  But I've had some good convos here with UN people, English solicitors (who told me they wanted an authentic American experience with sports and wings, which they definitely got -- but definitely random for some Londoners to go to O'Keefes).  And the regulars here.  Man.  They're characters.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Great spot to grab a drink and get some bar food. Mixed drinks are about $6-7, with some specials on beers. The wings are arguably the best in NYC. With Monday specials of 50 cent wings, you cant beat that. Has been my go-to spot almost every monday night for about 2 years in college. Friendly bartenders and bouncers. \n\nThe down side is that they close at 2am, so you better have a backup spot if you're planning on staying out later than 2.", "author": "A R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "This is probably the hang out spot for after class since there are so many colleges in the area. Waitresses are super friendly. Beer selection is pretty decent as is the typical bar food they serve. My food of choice would be the cheesey fries with gravy. Jalapeño poppers too though they came with a weird ranch sauce they my friends weren't too find of. The place gets pretty crowded after 7 but my friends and I were still able to find a table.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "I know that this review might change if I go back on say, a Friday night. But last night there were 3 dollar pints across the board. Guinness, Sierra Pale Ale, Woodchuck Granny Smith, Brooklyn lager, Sam A.'s seasonal, etc.\n\n3 dollar pints. In a clean large sports bar.\n\nI thought it couldn't get any better. And then the woman behind me was having fish and chips. And the bartender, she was a fair maiden, she was cute. And it hit me all at once that I enjoyed the place.\n\nOh, and one of the busser kitchen dudes is an awesome guy who used to work at Sunset Bagel. \n\nOh, and only greatness can happen on a slow Tuesday night. In the form of stumbling drunk 52 year old woman. \n\nSo there were three attractive late twentysomething, possibly early thirtysomething women here. Yuckin' it up. the one girl in the red shirt was doing stupid shit like bending over and screaming \"touch me\" and proceeded to flash her bra. Mind you the music isn't very loud, nor are the people. Her two friends were a little more sober but having fun. Then I notice the high table of older women next to them. Much older. And then mingle as if these three were daughters, and the table of four was full of moms and maybe one aunt. One mom stumbles a little, she's swaying back and forth on her stool. \n\ntwo of the other moms had to literally carry her out. Its a big space, and yet they still managed to almost bump into us sitting at a table. Good morning sunshine, college was 30 years ago. She was mumbling and slurring. I started laughing hysterically.\n\nThe drunk red top girl suddenly started screaming. This man with a horrid brown suit mixed with a slight grasshopper color and black shirt underneath, a man of no small stature, walks in and is like holy shit. From what we gathered, this man of no small stature bought the ladies drinks last night, and the point was made that it was in Manhattan. These girls obviously were tourists here for a wedding of some sort. Drunky decides to get photos of her all over this guy, while he's shyly and apprehensively drinking his pint. She then grabbed his balls. His full drink became a third less as he juked his pelvis back faster than the spring on a gun. \n\nI couldn't stop laughing as her friends were a little bit shocked as she proceeded to try to grab them again. This dude was an idiot. When a girl touches your balls, you let her have them. Instead he covers his groin as she tries to finagle her fingers around his hand. Then she stopped, probably noticing that he was a dud.\n\nAlright so maybe that wasn't a good story. It wasn't, at all. But I love the awkward moments like this. I can't get enough of them.\n\nI described her to the bartender as the girl who just ruins it for everyone.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "Used to go here when I was attending college back in the 90's. The staff was great. food was decent and the atmosphere was fun......ah, what memories", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "This is a great bar with good beer and a awesome selection of single malts, bourbons and irish whiskey. The is always good and service is excellent.", "author": "Charles V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Great local spot for food and drinks, especially before a hurricane!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-08", "description": "Not bad for the area. Decent burgers and salads. Prompt service. Not a bad place when you want a sit-down meal for lunch. Gets a little loud with the lunchtime crowd,  best to go there early if you want to have a conversation.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "O'Keef's is great because they really are a good balance between sports bar / grill. I come here with my wife sometimes on Mondays for the 50 cent wings and beer specials. They never disappoint - always consistent. The wings are very good and the beer is always ice cold. The service is always great. The place is clean and the crowd isn't crazy loud. People are respectful and friendly to one another here. Great vibe. I strongly recommend.", "author": "Buddy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "Large screen TV's\nFriendly staff\nFABULOUS french onion soup \nBEST mozzerella sticks I have ever had\nNice relaxed vibe\nGets really crowded when a game is on, but game watchers probably like that.\n\nReally enjoyed this spot.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-01", "description": "A good place to sit down with friends and have a drink.  Tuesdays they have $3 Drafts (as in EVERY DRAFT ON THE LIST), Thursdays they have $# Yuengling (YESSS!!!) and Killians (still good!).", "author": "Sergio L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}