{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "O'Keefe's is a great bar and grill and is thus aptly named. I'm originally from Minneapolis where bars often have, well, bar food. Not so much here but O'Keefe's most certainly does and it's good. It isn't fancy and it isn't gastro spotted anything, but the food is quite good and comes out quickly so you can have lunch and get back to work or jury duty or whatever. I like the chili (bean or beef) which is your bargain yet filling dish. There is a salad special everyday and those are good as well. The caesar is no joke. Plus the service is great. The bartenders will chat you up or leave you alone - whichever you prefer. Note that if the bar and tables are full there is seating upstairs, though you would never guess it.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "I came to O'keefe's Bar and Grill many many years ago. I remembered how delicious the hot wings were. Just recently went back and the wings did not disappoint. The medium wings are so tasty. I would agree with the some of the writers, The wings are one of the best I had. Addicting taste. The wings are about the only thing I order along with my beverage of choice. Nice crowd. Never had a challenge with service but there could be a little more happiness coming from the staff but the wings make up for that. To this, is why I give the 5 stars. Parking in the neighborhood is very, very slim, I mean very. Great spot for lunch or hang out after work. Not too many real bars in the neighborhood quite like this one. Great spot to watch sports... TV's all around. Definitely get the Wings.....Cheers!!!!", "author": "Irene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Best place to go if you work nearby and need somewhere chill for lunch. Everyone in the courts come here to eat and relax. The bartenders are super nice. Their wraps are not necessarily your typical wrap. They are like a wide burrito that you kind of need to eat with a fork and knife! Their chicken fingers are great. Perfect spot to go for lunch/after work that has a relaxed ambiance but still fun.", "author": "Tee J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "I few times a been in these place. I guess it's the only bar in Court st. But I have to said their alcoholic drinks are mix with lot of juice and ice like water. I end up spending lot of money when I see the bill. And feeling pretty much the same way I come in. I'm not recommending these place for drinks. At all", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Don't overlook this Irish pub, the food here is pretty solid.  We had the burger, wings and fish and chips.  All were so good!  Coming back for more and a definite go to spot.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "RECOMMENDED\n\nWhen I'm not lawyering, Yelping, trading stocks or hosting dinners I'm solving the JFK assassination(what should really be called the Right Wing Coup of 11/22/63)......More about that later.\n\nAfter the nice subpoena clerk in Brooklyn Supreme Court told me I had to come back in two hours because her office was closing, I had two hours to kill. I decided to plop my butt down at O'Keefe's Bar \u0026 Grill to enjoy a burger and brew and read \"The Dark Side of Lyndon Baines Johnson\", a book everyone should read.\n\nA pleasant young female server greeted me in the dining area.After she patiently answered my questions about the respective merits of two Sierra Nevada brews, I chose the Pale Ale.\n\nIt came just as I like it: cold, refreshing and delicious. I ordered a Bacon \u0026 Cheddar Burger. The 8 ounce beauty arrived perfectly medium as requested. It was full of mineral flavor and luscious, making my taste buds do Karaoke.The generous portion of accompanying fries were of the crisp variety. They were tasty and not greasy.\n\nFor those of you under 40, the key to understanding the 1963 coup is googling \"Lyndon ducks\". But I digress.....after enjoying my great burger and brew I'm handed a check with my server's name........ \"Marina\".....the same as Oswald's wife. Synchronicity baby!!!!!!", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-19", "description": "I attend this bar frequently and one night my girlfriend and I came in and Ellen the night bartender on Friday was horribly rude and accused us of not telling her our apps was separate from our ribeye. Hence all five courses arriving at the same time. No manager on staff and horrible service at night. So sad because her Male counterpart suffered.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "This was on of my Saturday excursions with my forever +1 and it was all the way around decent. It is definitely a sports bar seems like a great place to watch any sporting event. The food is basic bar/dinner food. Nothing that will change your life.\nThey have a jukebox if you wold like to play your own music which is pretty cool, and they also have another seating area upstairs.", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "I like it.\n\nMy girlfriend and I popped in early in the morning as tourists on our way to JFK. \n\nFriendly staff and decent service (then again, should be, since we were almost the only ones there, lol)\n\nYeah, I'd go back again..", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "Would give this place closer to a 4 star... awesome place due to the fact that they have so many TVs and make sure to show all the games. Good beer selection and have all of the bar staples. Food is good, but next time I'll eat before going. Would definitely go back to watch Sunday football! \n\nPs - hot sauce costs $0.75 extra, which I totally understand food cost, but it's not a gourmet establishment...", "author": "Isra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I seen this bar when I walked past it's a nice calm and clean atmosphere, the bar maid hasn't talked to me or tried to strike up a convo.\n\nAnywho I haven't seen any black bartenders here at all I'm going to shoot my shot and see what happens I have a lot of friends that would come out for some 50 cent wings.\n\nI'll have an updated review with an answer.", "author": "Latonya L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "I've been here several times for lunch with coworkers. There has never been a wait to get seated. \n\nWe always get the wings because they're priced well. Combine them with a basket of waffle fries and a drink and we're paying just about $15/person.\n\nFavorite wings flavor: Honey garlic. The wings come with blue cheese with everyone and there's some celery and carrots on top of the wings.", "author": "Simon Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-15", "description": "Came here to watch the Duke v Pitt basketball game last week due to proximity to my apartment and the 4 train for my friend. It had been recommended to me, so I was happy to check it out - however, I was VERY disappointed. \n\nAwful service - we weren't drinking, but our waitress never came to refill our waters. Perhaps we were ignored since we were just eating and not boozing? Not ok. \n\nThe food was fine, nothing special. They made me a buffalo chicken wrap despite it not technically behind on the menu - that was nice. It was good. Again, the service was the issue. \n\nFinally, the juke box was playing SO LOUDLY over the speakers that I couldn't think or pay attention to the basketball game. Also, unfortunately for us, screamo was the selection on the juke box. Yikessssss, my ears are still bleeding. Bad ambiance!", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "I've been a frequent patron of this location for years (thanks to my BFF, Pika). It has always been a super chill spot to hang out, grab a beer or some grub.\n\nA very unassuming atmosphere with amazing bouncers and bartenders. The waitresses are another story, it's often a hit or miss with them.\n\nSometimes, they'll be spot on in terms of service and knowledge on what the specials actually are. Other times, a couple are in a dizzy, fluttering about to no where with a lack of attention to details on service and your order.\n\nOne particular waitress had the audacity in positioning her self to educated me on 'tipping' before I left. I was seriously offended  (as I work in the hospitality business), I'm known to be overly generous when I leave gratuities.  I did express to her \"... not to allow the brown skin to fool her\".\n\nAside from that incident, it's always a grand time. I also came here on St. Patrick's day to celebrate. I usually have the sampler, which is quite good (nothing five stars) but it's bar food and washes down easy with beers or Margaritas.\n\nI wished I lived in the area, I'd be here weekly. Certainly a cool spot to check out before or after a movie at the near by theater or after shopping at Barns and Nobles or Sephora.", "author": "Andie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-02", "description": "Okay bar in Brooklynn my gf and I wanted to check out while in town. Inside feels like a good old school bar and I loved the atmosphere.\nHowever, drinks were overpriced. I got a Bloody Marry and it wasn't that good, asked for it spicy and all I got was the mix and vodka but I'm sure draft beer is fine.", "author": "Treytan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "Mediocre Irish pub, actually it is more of an American sports bar and grill despite of an Irish name.  It lacks all the traditional Irish food staples:\nCorned Beef \u0026 Cabbage Casserole\nDublin Coddle\nBeet Cabbage \u0026 Pecan Salad\nIrish Soda Bread\nShepherd's Pie\nShamrock Salad\nWhiskey Cake\nIrish Colcannon\nIrish Potato \u0026 Leek Soup\nPotato Farl\nBoxty\n\nSaturday night out in town with party of two.  We dined to bacon grilled cheese $8.70 and one turkey burger $11.95.  No alcohol intake for either of us.  My turkey burger was okay as it was not juicy but MEH.  Service is extremely too efficient as upon sitting down we did not have time to scan thoroughly the menu to make a selection.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Wanting pub grub, a pint or two, and a game, this place hit the mark. I had the blackened fish po-boy, and was happy. Unfortunately, the IPA choice didn't suit me; while Lagunitas is good I get it at home, and I think Goose Island is mass-market stuff. Still, the ambience was right, the food was quite nice, and overall it was the experience I was searching for.", "author": "Clark Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This sports bar is spacious and CLEAN! Once inside, it was warm and didn't have the typical beer soaked bar top smell, which so many old bars have. The bartenders were friendly and attentive. \n The basics: this bar is not trendy; the crowd is mixed. BUT...The tap beer is $4 on Tuesdays after 7pm; plenty choices. Lots of TVs, perfect for watching sports. I got a dirty martini and it was perfect. I know it's sounds like not a big deal, but I've got  my shares of bad dirty martinis. The burger was also really good, the bun stayed firm and the cheese was not extra $$. It was an tasty, high quality American burger with pickles, onion, a leaf of lettuce and cheese your  choice for $11, what's not to like? The sweet potatoes fries were fried just right. Food is NOT greasy! \nThey have top shelf whiskey, Macallan galore and other similar whiskeys. \nThis bar is better than a lot of bars and does not deserve 3.5 stars, so if you are in the neighborhood, stop by! We are fans!", "author": "Ruxi V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "EXPECT VERY LITTLE OF THIS PLACE\nAdvertised $4 shots on Thursday but when I got the bill our shots were not a part of the special. It didn't specify on the menu or anywhere in the bar what specific shots were included in the special so when we brought up our questions to the manager he told us \"you are part of the small minority who doesn't understand what a shot special\" \"I don't need to specify what type of shots are on the special, you should just ask\" \"I don't care if you write a bad review\", \"don't come to my fucking bar again\" \nScreaming at the top of his lungs to a table of us 3 women having a calm discussion. This place aside from that fact smells bad, has slow service, and the drinks are watered down. \nPLEASE SPEND YOUR MONEY SOMEWHERE ELSE \nThe manager clearly doesn't care for his customers just about his ego and everlasting power trip.", "author": "Selena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "They have the best wings I have ever had, even better than Buffalo Wild Wings. I rank the honey garlic wings as the best flavor. The onion rings and frozen margaritas are also pretty good. Their staff is always welcoming and food comes out fast. There's usually parking in the area so it's easy to drive out there with a group of friends to have a good food and drinks late in the night. The kitchen closes around 12AM or 1AM I believe.", "author": "Joshua B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}