{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "You don't have to be an attorney or law student to grab a bite or have a drink here. Happy hour prices are a thumbs up. Or just sit in the back and order food. Different groups of people/friends can stand around the bar but not be on top of each other. I have had the wings a few times here and I like them.\n\nGood:\n-Happy Hour = $1 off all drinks\n-Nicely sized spaced\n-I order the 20 wings for a few bucks more than the 10 piece (bring the rest home)\n-Beers come out as fast as you can drink them\n\nBad:\n-Being PICKY...you can only get one type or one sauce on your wing order (can't order 20 and say 10 hot/10 BBQ)", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-08", "description": "Food is bad.    Very flavorless.    I wanted to like this place.  =(\n\nThe staff is very nice and pleasant over the phone.", "author": "Rhobin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "Good ol Irish pub in Downtown Brooklyn!  I honestly find it hard to find this kinda place in my area - everything has gotten so annoyingly \"hipster Brooklyn-EY\". Big, American \u0026 Irish fare menu, with burgers, sandwiches, lots of apps, such as Potato Skins (cheddar, bacon \u0026 scallions) - - really yum----nachos, chicken fingers, quesadillas, etc.  I have tried the quesadillas, and both my husband and I loved them!!  I saw a woman eating their ribeye one day when I went in there for a late lunch, and it looked amazing - served with potato \u0026 veg.  There are lots of TV's, and sports on, and I believe there is an upstairs too!  I'm def going to try a steak or steak sandwich next time!!  \nThe bartenders are cool too!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-09", "description": "Found this place on yelp but was pretty disappointed ultimately. The place was extremely loud, service was slow (and the waitress seemed like she did not want to be there at all), and food was low quality/not good. No napkins or silverware were provided or available. The waitress didn't come to check in on us and after waiting over 20 minutes for the check, we just went downstairs to close out. The wrong order was also brought out. We will not be returning.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "Great place for drinks and amazing wings. They are well known for their honey garlic wings and for good reason. The honey garlic wings are very unique and original and is a must try. Their hot wings are amazing as well and have a great kick. Service is usually great but once in awhile you'll get a waitress who doesn't come around a lot.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "I want to love this place so bad, but it's hit or miss constantly. The food is great some days and awful the next. I do however love their wings. That's all they can get right.   \n\nBut let's talk service, it's just plain awful.  At the  end of the day their waitresses are like a revolving door and they have yet to get one attentive one. It's not brain surgery.  The bar can be empty and there isn't a person to be found. \n\nI keep returning here because it's a quick convenient spot, just wish their service and food was more up to par.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Best wings in Brooklyn hands down! They have $0.50 wings every Monday. There's no parking available other than street parking which is pretty difficult to find other than that this place is amazing.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "Came here for a 3rd time with a co worker \u0026 the I had the blackened salmon with veggies which was just string beans \u0026 carrots \u0026 yellow rice. The salmon was eh, the veggies were eh \u0026 the rice just wasn't good. My co worker had honey garlic wings which was good \u0026 waffle fries. I wish I would've got that. Since this is a bar, I guess it's not good to order anything besides finger foods.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "I went to O'Keefe's my very first night in Brooklyn, after a long day of moving. In search of a sports bar with decent food to stuff my face with and ample TVs to watch a game, O'Keefe's delivered on my wishes. While there are more than enough menu items to choose from, they kept it pretty straightforward, offering traditional sports bar sandwiches and appetizers. I opted for the Philly Cheesesteak Wrap with American, which was delicious. I even believe it would have been this good had I not been extremely hungry at the time! There is also a vast draft and bottled/canned beer selection.\n\nThe atmosphere was great at O'Keefe's, as well. This is a very unpretentious bar, great for either groups or those (like I was) hoping to catch a game by themselves. No judgment, unpretentious, and friendly sum it up. Lastly, there are huge and huger TVs everywhere, so no seat is a bad one. I'll be back to watch games and chow down in Fall.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-27", "description": "My sister and I went to have wings since it was .50 cent. I ordered 10 hot she ordered 10 honey garlic. Half the drums in the chicken was not done at all in either of our plates. Which was disgusting. Also we always had to find the waiter for our table but she was really nice. The best thing was the margaritas and the fries. I will go back again just for something different. If you do go here do not order the hot wings.", "author": "Alania A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "The food is average here. We Went there for lunch there was no lunch special so we ordered from the kitchen menu. My colleague ordered a burger but it was too salty and they changed it to fish and chips. I ordered the Cajun chicken sandwich it was average for Cajun chicken really liked the fries though.", "author": "Ferdous A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Bar is so amazing. I love coming here with my fiancé. Ceaser salad is delicious. Sometimes it can be a little packed but that's ok", "author": "Shade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "Decent bar and bruger joint to grab a drink and some burgers. Price is a little steep for what you are getting but that is expected in the neighborhood. The bartenders and staff are pretty on point.", "author": "Rivya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Your typical sports bar. It's never really been too crowded when I've gone in which is nice because you can usually just walk up to the bar and grab a drink or eat. The food is generally ok, but the wings can be pretty hit or miss. Sometimes they're outstanding and other times they're dry and kind of tasteless. It's a shame because their buffalo sauce is actually really good when they use enough of it. Wings should be messy and dripping in sauce, not half-covered. \n\nThe overall atmosphere is really nice though and the reason why I'm giving them four stars instead of three. It might sound weird to say this about a bar, but the place is really warm and inviting. The service is fast and friendly as well. Doesn't matter whether I'm alone, with my gf, or with a group; I always have a good time at O'Keefe's.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "The food is good and the service is excellent u can't beat it. The girls that work here are very polite and friendly", "author": "Danny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-28", "description": "Love the wings! We tried the garlic and the buffalo ones, we didn't really like the garlic ones though. The buffalo wings are amazing! Delicious fries too!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "\"O'Keefe's Bar \u0026 Grill\" is legit! It is a Sports Bar like no other. I'd like to tell you my story. \nParking is a huge issue around the business district, so I'm lucky I got there early. After a short walk it was hard to see the place because they don't have the name displayed above the building, just on the black glass windows, which is hard to see. Coming inside I immediately became excited with the look of the place. It's very modern and very clean with TV's everywhere. They even have a second floor with more TV's playing. When I was ready to sit there wasn't that many spots open because this place does business. They offered us at table and we took it. The waitress was incredibly nice and helpful, she was at my table often and cared about my enjoyment. The owner even walked up to the table and asked where we wanted to watch the Giants game. What! I thought that's cool. He was a really stand up guy and I'm not just saying that because he's obviously a Giants fan. What was better then the staff and look of the place was the food. I was completely taken back by how good it was. The popcorn shrimp was incredible and the sauce they used with it. Also the buffalo wings were delicious. They used a honey garlic sauce that was to die for. Finally my burger, now that was a burger. It had crunchy bacon, plenty of cheese and the onions were sautéed well. This place does sports well. I was completely satisfied and will return. What would make this visit better is if the Giants come away with a win.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "Horrible service. Overpriced food. No functioning air conditioning when it feels like over 100 degrees. This place is lame and should be shut down. $12 wings? What?!  And I'm posting a picture... empty, no service", "author": "Cindy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Love this place! Me and the future hubby love coming here for drinks and food. The wings are amazing. However, the chicken wings need less salt. Definitely a great place to bring your girl/man.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "This bar I have been to for years and by far the best experience was last Friday.My bartender forgot to get his name but he is very on point.This man knows how to pour a drink.Only thing that stop me from giving this establishment five stars is ,happy hour in my opinion could be better and no music really unless you playing a selection on the juke box.", "author": "Shorell S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}