{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "I stopped in on a Monday night for a quick bite. I've been here before and it's your pretty typical wannabe Irish bar. As it was Monday night they had a decent $4 pint special as well as $.50 wings. The wings were pretty good, especially for $.50 each. They were cooked well and a decent size, sometimes places with inexpensive wing specials give you these tiny baby wings. I'd probably go back for cheap wings again if I was in the area but otherwise there's nothing really special about this place.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Great bar, friendly people -- fans can get into it when NFL season kicks in and the bar is showing all the Sunday games, but that's part of the fun! Standard bar fare and selection of beers -- consistently good", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "The best place in Brooklyn! Food, drinks and people are really awesome... You can't find a better sports bar in the whole city!\nMusic, specially on Sunday, is really good...", "author": "Jacob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Nice local bar, decent typical bar food. I was happy to find a few nice craft beers including the seasonal magic hat elder Betty and the seasonal ruthless rye IPA from Sierra Nevada. \n\nVery reasonable prices  Two beers and a shot for less than $20.", "author": "Nikki T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "My mother and I came here to get a bite to eat and a drink before heading home. We came in at 2 pm. It was empty, with about 5 patrons peppered across the bar and 3 people at tables. We received no acknowledgement upon entering the bar or sitting at the bar. We sat down for 10 minutes and no one said a word to us. There were TWO bartenders behind the bar and nothing was said to us at any point while we were sitting there. One girl looked at me and made a face and turned back to continue a conversation she was having with a man in a suit about school and the the other girl literally had her back to the bar chatting with one of her coworkers the ENTIRE time we were there. We didn't even receive a hello a greeting, a glass of water. I couldn't help but feel discriminated against as my mother and I are black women, and I am covered in tattoos. I think the way they treat people in there is disgusting. Downtown Brooklyn has ALL walks of life. I work as a bartender and have been one for 6 years so I know the bare minimum and these people  didn't even acknowledge our presence. Will never come back and I suggest you stay away too.", "author": "Hadassah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I loved the chicken wings over here. Also the philly cheese steak was amazing.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "Meh, indeed. The only thing this place has going for it is location - if you're a tourist or if you're welcoming your touristy friends to the neighborhood this place has a lot of thing within walking distance that are great.\n\nI supposed if you're a sports fan this place might not be so bad either but there are better places in and around this quaint part of the borough to get your sports on. And you'll never know if you're gonna see your game since the staff have no idea what's on their TVs.\n\nCustomer service was ok as far as courtesy goes but I felt as if the bartenders were way too stressed out for having a less than full bar at the time. Not to mention they aren't good a taking an assessment of the entire bar to see who's next on the list for a drink. I waited for ever while people jumped in the bar line after I was already waiting and got waited on.\n\nIf this bar wants to get on the radar and take advantage of all the good things they have going, location, size, TVs, get better bartenders, better menu and advertise your games (my friends wanted to watch off the wall Rugby which I know comes on cable if you have a major sports package) - maybe also sell the place to the tourists with all the cool things they can do around the neighborhood so us locals with visitors in town don't have to do all the work (kidding not kidding).", "author": "Madeline Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "It doesn't look like much from the outside, but O'Keefe's delivers as a neighborhood hangout/sports bar. The servers are friendly and fast, the food is greasy and salty (in the best possible way), and the TVs are in ample supply.\n\nAvoid sitting near the bathrooms in the back, and instead grab a seat at the bar. Order some potato skins and RELAX. There is no judgment at O'Keefe's...so come as you are and have a good time.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Great place to come to watch a game.  The food and drinks are fairly priced and I love the atmosphere.  One of my favorite things about this place is their jukebox.  My Office held their Christmas party here, and we had a blast drinking all night and selecting music to play.\n\nI'm a huge fan of their hot wings and beer battered onion rings.  mouth watering!\n\nI'm a regular.  Looking forward to my next visit.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "Beers are reasonably priced, $6 for Corona w/ Grenadine and lime but I was half asleep the entire time. My honey ordered the Calamari, which she says she could've done without (this is her usual hang out spot, mind you). \n\nI know it's an \"Irish Pub\" so I shouldn't expect to be catered to but.....I like to be wiggle in my chair a lil or get up and hit a 2 step with a drink in my hand ya know? B.B. King ( as much as I love him) \u0026 other Blues artists are HARDLY my idea of a good time when I'm trying to \"TURN UP\" on a Friday night. When I approached the owner about the music selection, he advised me that Pandora was playing. As if that meant something to me, I have like 57 stations on there.  Sooooo you're basically insinuating that YOU like it so that's all that matters huh? *blinks*\n\nI wasn't impressed.  The end.", "author": "EBONY B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Fully-functioning, local sports bar. Better than you would expect from a Court Street pop-in. \n\nNice set up for NFL games on Sundays. Reasonably priced drinks, decent* food, and friendly servers. (*The wings I have had were decent.)\n\nNothing mind-blowing, admittedly, but you should get what you are looking for at O'Keefe's!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "If I could give this place half a star I would. The service and ambience weren't terrible, the misleading advertisement on pricing and the rude ass manager were though. We came in because of the advertised $4 shots, only to be hit with completely different pricing. When we told the waitress about the bill she got the manager who came over and didn't apologize nor show remorse but rather yelled at us and said we \"should have asked\" about the special, told us never to come back, and called us stupid for not understanding the advertisement. Well maybe if you would've specified it asshole, we wouldn't have been mislead. After recognizing his flaw he came over to yell at us some more and unapologetically refund the advertised pricing as opposed to the full price we paid....talk about back handed ass apologies \"just don't come back to my fucking restaurant\"...first and last time sir.", "author": "Sally M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "We have been here once before and thought it was a cool spot to happen upon.  Having gone back, on a saturday night around 12:40, we were served drinks, only to then basically be kicked out 10 minutes later.  We were sitting in the bar as the staff turned the lights out on us, locked up, and told us they were there as a curtesy and we should really hurry up.  It was super rude, and they really shouldnt have allowed us to buy drinks if they wanted us out at 10 min later.\n\nNeedless to say, we will possibly try this place again, hoping to have a better experience, but it wont be at the top of our list.", "author": "A C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "Promotes shot special but does not specify which shot then expects you to pay more when they advertised a different price. Manager was rude and disrespectful. He left the table telling us that we can choose not to come ever \"fucking come back\". Then decided later to refund the advertised price of our money. Don't come here it's terrible.", "author": "Kyunti J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Idk how I ended up here but I did, no one was the entrance to table us so I walked right to the bar, drink menu is basically beer + wine , no mixed drink unless you request it ! Bartenders are nice ..  Anyways I order 30 wings for 17 bucks an let me say the wings was popping !! Spent about 70 bucks for 3 adults no a bad deal ! Bathroom is small ..", "author": "Kimoralee K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "Food is great, but I'm currently sipping the worse Old Fashioned I've ever had. Literally. I asked for it to be made with Maker's Mark and it tastes worse than a well drink. I even question that it was actually made with  Maker's Mark even though I asked. This place would be great if they could pull the drinks together.\n\nUpdate: then they charge $11 for the drink. Tiniest glass with the most I've ice I've ever seen. Like WTF?! I'm officially both insulted and irritated. Changed to a two-star.", "author": "Tenasia E. H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-04", "description": "I stopped in for a drink with a friend at the bar on a busy Friday night.  I like the place I love the beer selection.\nThe only complaint I am not happy with was the guy bartender behind the bar.  Anybody can mix drinks, but isn't a bartender meant to have a personality behind the bar?  I'm a bartender who can talk to any customer in my place!\nThis guy had no personality, doesnt pay attention to anyone, when I finished my drink, it must have took him at least 10mins to realize I had no drink and I tried numerous times to get his attention! \nI don't know how he got a job working as a bartender he is hopeless! Never smiled or anything, I won't be back if he is on the bar again", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Writing this even before the food comes out, simply for the Irish lady who's the bartender. She's all over it, strong drinks, accomodating, handling 40 people without an issue. Lots of TVs and perfect place for a drink and watch the game.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-13", "description": "Terrible service, decent food, poorly priced. Took 20 min to get appetizer, and it came out with my food. After complaining to manager, nothing was done. \n\nLast time I eat here", "author": "Jon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "The food use to be good the people use to be good the wings use to be gr8 but now everything about this place is the Worst.", "author": "David M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}