{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-03", "description": "Food service is poor and inconsistent.  Today we had to wait for 10 minutes after our food arrived before we received silverware/napkins. And we only got 2 place settings for 3 people! Food is generally greasy and there are few healthy choices including condiments.  As far as drinks go they rinse ditty glasses in a soapy pan of water behind the bar.  That's it...then they serve your drink in one of those glasses!! Need I say more?  On the plus side, friendly young waitresses and good TV monitors.", "author": "Carl E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "5 thumbs up! They put the Twins game on for me (wildcard race) and had great chicken wings. My server Hollie was amazing and made an amazing Moscow Mule (or 3) for me. My only qualm was they didn't have WiFi.", "author": "Nicholas A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "This place is ok I guess- beer selection is middle of the road with a lot of low end beers and some more interesting choices, including a few from local breweries. Food menu didn't offer too many entree choices with more of a focus on wings, appetizers, and sandwiches- so I wouldn't necessarily make this my primary dinner destination. The fries were frozen which is a bit of a pet peeve of mine, but the Reuben was decent.  Bathroom needed a good cleaning. The staff working behind the bar at times seemed more concerned with checking out their cell phones which were plugged in by the sound system- and often times unplugging each other's phone which was feeding the music resulting in some awkward silence. This place has potential, but isn't quite maximizing it at this time.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "With the courts, DA's office, Legal Aid Society, and a law school, all within a one mile radius of O'Keefe's, this place is a neighborhood bar for many law students and lawyers. Do other people come here? I don't know, I think the bartender has a law license. \n\nIt's standard bar food; burgers, sandwiches, pastas, and fried appetizers. I'm a fan of their quesadillas and cheese fries. Most drinks are about $7, and they make them real, like you just finished a workday in Brooklyn. Bonus: Most bartenders do buy-backs (treat you to your fourth drink, if you can make it there) when you sit at the bar.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "Awesome little sports bar in an awesome little neighborhood.\n\nCaught happy hour here and boy what a deal for Brooklyn Heights.\n\n3 Sam Adams, 2 Blue Moons, and 1 Guiness....grand total....drumroll\n\n$29 bucks!? WTF those are Iowa prices. I saw happy hour is 4-7pm. If I lived here I would go everyday!\n\nPlenty of seats, a nice long bar and friendly service. \n\nTONS of TV's. This is a great spot to watch a game.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Lawyer bar. Law students and lawyers flock to this place after class and after court. Wings are some of the best you will get anywhere. Great specials and they will play sports game you like.", "author": "David W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-07", "description": "It is an okay place, but nothing special.  Atmosphere is so so.  Sports on the TV and I have never seen them run out of alcohol.\n\nPrices are good, and so are the wings.  But they could give you a little more ranch dressing.  It was way too little for the wings.  When you ask for more, there was a 75 cent fee.  I mean I guess the whole thing was cheap including the fee, but it was kind of BS.  It was one of those tiny tubs that probably costs 12 cents.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "I came here on a cold Sunday afternoon to watch the Patriots/Broncos game all by my lonesome. I was staying at my infamous friend Liz's place, who had just funded a weekend of debauchery at a hotel in Chinatown with 12 friends. Hailing from Seattle, she's not a 100th of the Pats' fan I am and preferred to nurse her long-developed hangover in bed. I couldn't really blame her, since I felt like complete death as well and wanted to join her. But my allegiance will forever lay with the Patriots, so I decided to go it alone.\n\nAt first I felt a little awkward, which was likely due to the solo nature of the visit mixed with the anxiety-ridden state that usually accompanies alcohol withdrawal. I found an empty barstool smack dab in front of the TV showing the Pats, and sandwiched between a Woodhead jersey and a couple of Brady's.\n\nIt wasn't until well into the 2nd quarter when a Ben Roethlisberger lookalike came in and started groping his girlfriend directly in front of me that I began to bond with my fellow fans. We exchanged a few low-risk jokes about the oaf and the bimbo, and before you know it we were trading war stories. True chums! Lifetime pals. I wish I could remember their names...\n\nI can't tell you how the food was 'cause I didn't eat. I can't tell you about the prices 'cause my newfound friends funded my entire visit. I can, however, tell you that the atmosphere is cozy, the beer selection is pretty extensive, and there are TONS of TVs showcasing every NFL game that's playing. Oh, and that the Pats crushed Tebow's celestial win streak =) \n\nFrom what I could see, it's a very friendly place for New England fans to camp out. The audio, however, will remain on NY games no matter the breakdown of the crowd. Still, if I'm ever in Brooklyn and faced with the same dilemma again, you bet your ass I'm going back to O'Keefe's.", "author": "Britt S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-08", "description": "Nothing really special about this bar. They play oldies music which isn't bad but if you want to dance then you're out of luck. I did go on a weekday with a friend so maybe that's why the music wasn't for the shaking, \n\nWould I go again? Maybe not.", "author": "Tequila B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "Great place to go to grab a quick lunch and beer in between depositions.  Dont worry, one beer does not make me drunk...enough to not know whats going on.  I can still lawyer just fine.  Although, there did seem to be more objections to my questions than normal.  Jussss kiddingggggg (in case the bar association is reading this).  \n\nAnyhoo, the grill chicken here is as delish as grill chicken can get when its thrown on two pieces of bread with onions and lettuce and tomato (not the bars fault, it was actually really good chicken, but in an effort to use my tummy fat, I could not order the burger like I wanted - the tummy fat came from eating out at all the places that i just reviewed, effing isht).  \n\nI have to say that the fries here are excellente!  that last \"e\" is intentional (i know i typo a lot).  I think they slightly bread the outside of the fries before dumping them in the oil but these fries were extra crispy and extra yummy.  nom nom nom mang.\n\nhappy eating, suckers.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "So I popped into O'Keefe's a few weeks ago. I was on Court Street and i was starving. The place was empty, but it was around noon, so I wasn't surprised.\n\nThe bartender was friendly, not overly so. The beers were ice cold. And the wings were DIVINE!!! They were hot, and crispy. I got them with the hot buffalo sauce (YUMM-O); the cooks know what they're doing; the wings were perfectly coated with sauce, yet they retained their crispness down to the last drop.\n\nAnd the onion rings!!! The right amount of batter; you can still taste the onion when you bite into it.\n\nI went back the very next Saturday. And the one after that ;)", "author": "ALISON E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Great place. Nice tv setup\n\nAttentive staff. \nDrinks are good \n\nTwo floors of space.", "author": "Dann'e M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "Good appetizers and drinks. Bartenders are friendly and attentive. The calamari was good as was the buffalo wings. I enjoyed the drinks long island ice teas and patron shots. I can see myself becoming a regular. Did I mention they offer Buy Backs.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Great little place with a lively,  open and fun atmosphere. The bartenders are attentive and friendly.  Beers were good prices, I paid $7 for a pint of Guiness. Lots of tvs all around with games on. This is gonna be my new favorite spot. I took a star away because the music selection can use a little work, I can do without hearing that much Warrant, the music is a little strip bar-ish. But, overall a great place to chill and meet new people of varying ages.", "author": "Yvrose C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "What does this place have going for it??\nSpecials:  $.40 wings on Mondays, $3 Draft beers on Tuesdays, $3 Bud/Light and Killians on Thursdays. \n\nThe wings are pretty good, not the best I've ever had, but as good as you'll get in the area. The fries though....amazing.  Crispy and just down right awesome.  I mean...what can make them any better? Ohh I know....add cheese and gravy.  Your heart stops. And not from the cholesterol...but from the sheer flavorific magnificence that explodes in your mouth. But I digress...\n\nThe bathrooms leave much to be desired.  If you happen to be sitting at the dining area, you will notice the lovely aromatic scent of what appears to be urine and fruity pebbles (yes...like the cereal).\n\nAnd about sitting in the dining area, it is quite possible to go unnoticed on one of their busier nights.  I mean....at least 15min before someone comes over to take your order. \n\nBut let's not forget the main reason people come by....Sports.  They've got the games you'll be looking for and this place can get live once the fans come out.  \n\nAll-in-all....nice atmosphere, good food, decent-good service. Recommended.", "author": "Clyde N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "Ehh...I don't know what to say, this place seemed only average in terms of beer (happy hour $1 off drinks) and wings ($0.50 wings after 7) in my book. Nothing so spectacular, but nothing bad about it either. The waitresses are pretty attentive to each party though, but probably because this place wasn't that crowded on a weeknight.", "author": "Ka Chun N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-20", "description": "The three stars are for the few times I've stopped in on the way home to grab a beer. Solid spot for that, however the few times I've eaten here, it's been interesting.....\n\nTry to avoid sitting in the back section. The bathrooms open in the directions of these tables and you sit there smelling the cleaning solutions, ammonia, and all other smells associated with bar/restaurant bathrooms. Not to mention, the bathrooms are not the cleanest...especially for an establishment that serves food.\n\nThe last time I went here was a Saturday, around 7:30pm, after checking out a movie down the block. You'd assume that they benefit from a lot of movie related traffic, especially on Saturdays to have the place properly staffed. Within a half hour of sitting down, all the other tables were taken, as well as a majority of the bar stools and they only had one bartender, one server, and one busboy working. It was impossible for them to keep up. It took a long time to get a beer, let alone the food...which is always at the very worst adequate and at the very best, satisfying.\n\nLast thing, they kept insisting on turning on the music at a ridiculously high, dance club level volume. The waitress had to ask the bartender to turn down the volume on more than a few occasions. Who'd think that a place called O'Keefe's would be blasting Usher songs.", "author": "Lee F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-26", "description": "The bar looks nice, the food is very dry and not appetizing at all, they don't serve sangria and their knifes are very dull...not coming back", "author": "Anastasia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "Somewhat of my go to spot for Yankees game.  Great service and decent pub food close to my place.... with 10+ flat screens, what more could I ask for?", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "Bad food. Bad service. Bad drinks. Unless it's coming from a tap or bottle the drinks are gross. The apps tasted like they came out of the freezer. The server we had had a bad attitude and was texting instead of minding her tables. $50 tab for greasy apps a terrible cosmo and two beers. I could have defrosted some TGI Fridays apps in my oven and would have found them better....how do you mess up apps?", "author": "Carla S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}