{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-01", "description": "O'Keefe's HATES BASEBALL\n\nAt least when Houston is playing the Colts on Monday night. Big NYC game I totally understand\n\nTo set the stage: Giants taking game 5 and the series is imminent:\n\n\"Hey man, would you mind switching the bar audio to baseball for just the last half inning?\" \n\n\"Ah, um, well dude, there's, like, a lot of people watching football so I'm just not sure\"\n\n\"Hey, no problem. It's only the WORLD SERIES\"\n\n\"Whatever dude\"\n\n5 minutes later listening to ads for cell phones, the bar erupts after Wilson secures the last out. \n\nNot that Joe Buck and Tim McCarver could ever do a call justice, but that is about the lowest class move I've ever seen in a bar. You should be ashamed of yourselves.", "author": "Jason J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "WOW! i haven't been here in years (well since my college days @ SFC in Brooklyn). This place change alot! quality of food...very good! Atmosphere very chill. crowd, hipsters, law students, lawyers, regular brooklyn people from DUMBO or  Brooklyn Heights). This place cleaned up alot! I was impressed! and for a crowd of 5 people the bill was really cheap...mind you were ordered food and lots and lots of liquor and beer!", "author": "Fil M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-14", "description": "1. 5 stars for their must have BBQ wings! You will want to come here everyday for them trust me!\n2. 2 stars for when you are at the bar and they do not know you they automatically charge you gratutity. \n3. The staff is pretty cool. Except when you start asking the waiters questions they have a AW FUCK look on their face.\n4. There is a wide variety of patrons. Which is cool because it is not only made for a particular group. Even though I attend school two blocks away and I see my classmates there getting a drink before religion makes you wonder. DO you really belong in a catholic college!\n5. Must attend for their wings and taco salad with chilli.\n6. ENJOY", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Probably the best casual pub in the area. Unpretentious...you can kick back, move tables and chairs around yourself, that sort of thing. We used to go here after work for years. The food isn't bad, it's just ehhh, even by pub standards. At least the prices are reasonable. The beer selection is good, and they do have Magner's. Good Internet jukebox, and a private room upstairs. This bar is perfect for after work outings. The service is usually very good, the wait staff is friendly without being annoying and they are always on point, probably because they're used to dealing will large groups of drunken cubicle dwellers at happy hour.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-26", "description": "The rude fat balding dude referred to earlier would be Damien.  He's not a nice guy and has given me the wrong change - and that of others- on more than one occasion.  I complained to the owner to no-avail.  The televisions are great for a game, taps are good, food is just okay.  But I can't in good conscience patronize a place that tolerates this kind of behavior.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "40 cent wing monday nights--sticky, sweet, and addictive honey-garlic wings. take my friend's rec and ask the server (if you can find one) for a cup of buffalo sauce on the side and dunk the wings in them for an even better experience.  buffalo wings are eh, just stick with the honey-garlic. \n\nthe food is the rest of your standard pub grub but the nostalgia for monday night wings and beer makes me give it a higher ranking. btw, in case you've never been to brooklyn and don't want to venture there, these are the same wings you can get at its sister restaurant, barrow st alehouse, in the west village", "author": "Eric K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "I go here about once a week (it's around the corner from my school) and it's a nice laid back place to get a drink in the Heights or Downtown BK. They have great nightly specials, from $3 draft night (Tuesday) to $0.40 wing night (Monday). The food is good, the wings are great, and they have a decent tap selection. Lots of flat screen TVs for watching the game. The staff is great and the vibe is a fun one!", "author": "Zia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "Beware.... Lots of lawyers in training and legal types haunt this place.  However, if you overlook them you can really enjoy the good food here.  Its traditional Bar food but it is well cooked to order.  There is a large beer selection with frequent specials but I like the lighter beers and think you should stick to bottles here because I don't think they clean the pipes well enough.  I find dirty beer lines a problem in a number of bars and restaurants but overall this is my choice for best Bar on Court street.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Don't except too much from O'Keefes, but it is definitely the spot for my coworkers and I to whine down. The drinks are affordable. The food is mediocre. We usually order the calamari, nachos, chicken tenders, and/or buffalo wings. The waitresses are attentive. Great neighbor or after work spot!", "author": "Yoshi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-10", "description": "I've been coming here often the past 4 years and has yet to dissapoint. It has about 15 variations of beers on tap and several more for bottle as well as a full bar for not so beer type. Their food is nothing more than special than what you find in an irish bar but their wings and fries will certainly satisfy. They have daily drink specials, filled with several tvs around the bar with different sports, great atmosphere, and friendly staff!", "author": "Steven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "Drink and Drink until you fall flat on your face and stumble home with no sense of direction, how I missed those days when every bar was walking distance from my home..Drink and Drink until you're dizzy, no sir I did not touch that lady..How I miss being 20 but now I'm just another old fart drinking coffee.", "author": "James V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-03", "description": "Good neighborhood place to watch the game over a beer and a decent but not memorable burger.  Inoffensive and competent.", "author": "Jack F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-22", "description": "Yeah the wings are great if you love FEATHERS!!!  These wings are so hairy I had to pluck a few feathers off!!!  DIGUSTING!!! I had the same problem about 2 years ago, I'd figure that I would give it some time for them to get better.  I decided to return especially after reading reviews about their wings being the best in the neighborhood but I went back last week and low and behold the feathers are still there!  It made me wonder do they even wash the chicken at all and if the other food is mediocre like others say I won't even bother to try it and just mark this place as a DEFINITE pass altogether.  It should be specially noted that I NEVER comment on anything I just read reviews to figure out what's good but this was so disgusting I was moved to report this as a heads up.  But if you love hairy wings, THIS IS 'YOUR PLACE'!!!  I must say however that I order my wings with the sauce on the side so the other reviewers may not have noticed the hair or feathers because it was covered in sauce.  That's why I usually order my wings with sauce on the side.  To make sure they are clean of hair.", "author": "Amber R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "i'm a fan of okeefe's, good spot to meet your lawyer friends, decent fish and chips, clean and warm.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "I've been here a few times, and generally the staff is nice and the prices are good. But the last time I went here, they had changed their happy hour to \"$4 pints.\" Over the course of a several hours, about ten of us cycled through, eating and drinking. As people left, they paid their share, leaving the last remaining of us to make sure the bill worked out. Imagine our surprise to find that \"$4 pints\" was completely made-up and arbitrary. The waitress, who admitted it was her first night, said that only *some* of the beers were $4, and we somehow happened to order a lot of beers that weren't. Nowhere did we see anything that specified the difference. So, we got stuck with a much higher bill than they advertise. When we contacted the manager, he simply said \"there should be signs telling you which pints are discounted.\"  Of course there shoule be. But there weren't. I even stopped in again that week to confirm, and sure enough, there was nothing. We contacted the manager again to let him know about the signage, and we didn't even receive a response, let alone any kind of meaningful apology!", "author": "B R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "Thanks to the positive reviews on yelp I will definitely be a regular customer. The buffalo wings were very good.  They were not the best I've ever had but the are in the top 5 which works for me.  The bar is spacious which I love. That means no reaching over you or saying \"excuse me can I order a drink\" while you're in the middle of a good conversation.   The drink prices were very reasonable for a bar in NYC when it's after happy hour and last but certainly no least, my fiancee can watch whatever the game and still enjoy time out with me.", "author": "Jewel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "O'Keefe's has great food, good happy hour specials and a nice selection of beers.  It is very clean, has friendly waitresses and reasonable prices.  Come here to watch your game, there are plenty of Tvs.", "author": "Sean G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}