{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "The spinach artichoke dip was GROSS. It was basically spinach soup... the tortilla chips were totally stale and I could barely eat anything. The Moscow mule is the only reason I give them any stars. It was tasty but hella expensive!! Overall this place is overpriced and they under deliver. I've been hard pressed to find spinach artichoke dip I don't like but this place succeeded.", "author": "Meghan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "We LOVED this place. The girls behind the bar were fantastic and made our \"made up\" drinks. The nachos were amazing and we loved the app that allowed us to play our own music. Such a fun experience full of recommendations for us out of towners. Highly recommend! Thank you Katie and Ellen!", "author": "Chandra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Good gin mill for some quick chow and suds.  Five stars because they have fair prices and they are old school Brooklyn- not any of that new hipster fusion garbage that's invading downtown on every block and corner.", "author": "B W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "First time to Brooklyn and stumbled upon O'Keefe's. Such a homie feel. The bartenders are extremely nice and make amazing recommendations for for places to eat and drink. The nachos are to die for  and the drinks are so delish! Katie and Ellen are incredible bartenders! I highly recommend this bar and grill and will definitely come back whenever I am back in Brooklyn", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Always been a fan of O'Keefe's. Every since I went here about 2-3 years ago. Service and bar Food is consistent. Always good to pop in when I am in the area catching a movie. The wings are the best to me.", "author": "S C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "So I was on my way to the court st theather to see \"Get Out\"  but all the tickets for the first airing were sold out. And it was a hour wait till the next airing so we decided to get some food and came into O'keefs. And I'm glad we did. The wings are amazing and the service was great. Will definitely come back", "author": "Ernst F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "A good bar place to watch football! The chicken wings are amazing. I come here on Mondays because the wings are just 50 cents. Too bad they only come in sets of 10 wings or 20 wings. They don't let you take it to go. But hey, wings are wings.", "author": "Cal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "This is a cool spot to hang and chill whether after work on a Sunday afternoon . Good food, good music, plenty of tvs and just a good overall vibe. Definitely my go to spot.", "author": "Lawrence B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-26", "description": "We were charged $4 over what we should have been. There is a typo on the menu that says \"house wine\" is $3 more than \"imported wine\". We thought it was weird and asked about it before ordering. The waitress is new and said she didn't know why, so my friend ordered the cheaper imported wine ($9). For the next round my friend asked how much a Jameson on the rocks was. The new waitress specifically asked at the bar and came back to tell us it was $8. \n\nWhen the bill came we were charged $12 for the imported wine and $9 for the Jameson. A manager came and explained that there is a typo on the menu and that the wine is $12 as though she was not going to charge us what the menu reads. Only after we argued back and said we specifically asked did she say she would change it. They would not relent on the $9 Jameson, as she said on the rocks is another $1. Never mind that we specifically had asked how much Jameson on the rocks was.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "This is the first bad review I've ever written and it's definitely justified. Visited this spot to catch the World Cup. Food looked decent, so I ordered chips/sals/guac. Prior to placing my order I specifically asked our server if the guacamole was made in-house (because, in case you don't know this, most places use guac from a plastic bag they buy at a place like Costco in which has green fillers that isn't even real food). She assured me that the guac was made in house/fresh, so I proceeded with the order. My order arrived with a basket of corn chips and two tiny plastic containers, one with a green paste and the other with something that resembled salsa. I open the green one and smelled - the scent resembled something like a combo of dirt and chemicals. Certainly NOT fresh. The salsa was straight up Tostitos, but I could at least live with that. There was no way in hell I was going to put that green slime into my body, so I thought, \"I'll double down on the salsa.\" I asked for more salsa and she brought me back exactly one additional tiny plastic container of the Tostitos salsa. When the bill arrived, I saw I saw charged .75 for salsa. FOR SALSA with my basket of corn chips. The regular order was ~$8. I essentially paid ~$9 for a basket of corn chips at this place. I want to also note that our server did not notify me that she would be charging me an additional .75 for salsa. I tried bringing this to her attention at the end of the meal and she was incredibly rude to me. \"I don't make the prices.\" NEVER a good move. So I mentioned that I totally get that and I would appreciate it if she can float the suggestion to management and with attitude she replied, \"yeah yeah it's been floated to them.\" That's a great response. You are essentially telling me this has been an ongoing issue. Lucky for you I realize your response was impulsive and thoughtless...like the pricing of that appetizer and the fake guac.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Just happen to stumble on this bar while walking through Brooklyn. Good bar food and salads. Service was good and prices were reasonable. I would go back again.", "author": "Michele T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Good place to catch a game and chow on some bar food.  Servers were friendly and drinks were reasonably priced.\n\nOn my first visit, I asked the bartender for some food recommendations, and got the loyal \"everything's good here\" response.  Knowing that couldn't possibly be true, I was back to square one and perused the menu again.  A friend and I ended up splitting an order of the buffalo calamari, which was a tad rubbery, but well-sauced, and accompanied by some bleu cheese for dunking.  Their buffalo sauce is VERY sweet here, to the point we almost mistook it for BBQ sauce.  If you're looking for some heat, you may want to ask them for a side of Frank's Red Hot or similar.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "I've been to O'Keefe's many, many times since living and working in the area. My opinion of the place has varied over time. But I walked in here randomly today for a very late lunch with a friend of mine, and I realize that I have become a fan of this place. My friend order a delicious beer in a very large glass, and I had a good oatmeal stout along with what is probably the best french onion soup I've had in a while.\n\nI'll expand upon this review a little later.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "I pass by this place all the time and finally took the plunge and walked in. I was thoroughly impressed with how big the space is (because it looks small-ish from the outside). They have an array of beers and liquors to quench your thirst. And even food! (I didn't eat but it smelled pretty tasty--I'll try it next time I go). \nFriendly staff, friendlier patrons, and great prices. Be sure to stop by if you're in the neighborhood! \nI'll definitely be back.", "author": "Chantalle U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "I've been an O'Keefe customer for years, I've seen dozens of bartenders and waitstaff come and go. The place has had a makeover, it looks good. The food has changed as well unfortunately not necessarily for the better. The burger has gotten smaller, thinner. All sides are served in clear plastic disposable, portion control, even. The pickle on the burger is now a few slices instead on a nice spear. Lost some of its \"home\" feel. Plastic give it a fast food feel.\nYeah, they have beer \"specials\" but  food is equally important.", "author": "Guy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "Surprisingly disappointing. Perhaps we should have sat at the bar because the bartender seemed really good. I watched her with the patrons, making drinks, and handling the panhandler as he TRIED to make his rounds. IF i were to go back, i'd try the bar.\n\nBut we had a table. 15 minutes after we ordered our food, we were told the kitchen did not have our order. Did it take 15 minutes to find that out? Then, we had to SUGGEST that they make amends by making us an offer. Then, the offer wasn't clear.\n\nWhat we did order was...well...okay, and the drinks were not impressive either. I have to go to that area after work regularly; unfortunately, i did not find MY PLACE TO GO in O'Keefe's.", "author": "T D A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "I'm going to explain this the best way I can, first of all I love this establishment it's a carefree relaxed atmosphere but here's the discrepancies now it has happened on a few occasions but yesterday's event I will address \n\nI arrived around 6 pm the front table the participants were leaving so we waited finally at six forty I flagged down one of the girls after she walks around aimlessly to no prevail or chit chattering with the other two girls at the register,  I simply asked her to clean the table and I would like to Order to which she responded how long you were here, I said roughly twenty minutes, in a stern way , \"There's Tables At The Back Why Are You Here.? I  kindly stated I would rather sit at the bar and not a table but ifs it's not too much trouble can I still place an order... \nI don't understand the persona of the day table staff always rude or too busy to get your complete order or you have the flag them down constantly meanwhile they are having their private meeting at the register I can never understand this... as I have mentioned before it's not the first time with the table situation, this doesn't change my opinion on how great this establishment is but avoid the tables it's a constant headache", "author": "Sherry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "+++\n- The wings; definitely four star worthy\n\n++\n- The medium wings are not that spicy; could be a minus to some people but a plus for me\n- The waitress catered to our every (annoying) need even going so far as to turn up the volume so we could hear the TV\n\n+\n- Good beer selection; if you'r into the sort of thing\n- Fries are good\n- My friend enjoyed the burger\n- Artichoke dip was pleasant, although I feel it could use more chips\n\n+/-\n- Idk if it was the snow, but this place had little attendance on a Saturday night, we were there from about 8-11, and left when the 'party' was starting, and still not many more people were there from when we first arrived\n- Idk if it was the snowstorm, but not many people were there for sports either. We would think everybody would be there fore the slam dunk contest, but only one other table were reacting the way we were (Oooing and Ahhing)\n- Only $2 more doubles your wing order, idk why, but it is what it is", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Service is great even when it was St. Patrick's Day. Stopped in for lunch and was thrilled to see Smithwicks on draft.\nHowever I have to say that I wasn't as fond of the fish and chips. The chips were good of course. But the fish didn't have a nice taste. It wasn't like the usual fish and chips I have at British places. Maybe a different type of fish?\nBut all things considered, I'd still come back because it was an overall positive experience. Just not get fish and chips. Or maybe just chips.", "author": "Jai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Very surprising 'type' of bar to find in this \"not-really-a-neighborhood\" neighborhood. This is a young bar with wide aisles; not one of those dark, narrow pubs so common everywhere. It is quite a  large space for partying and well-lit. Kinda geared for the tech/contractor/govt vendor workers (boro hall's government offices so close by). But this also means the establishment is clean, well-appointed, and well-kept-up. \n\nYes indeed. A solid, reassuring, secure place for drinks and flirting. Snappy bar service with the usual assortment of cold/hot bar girls. 3:1 ratio buybacks are not guaranteed at all, so do not even expect any. \n\nThere's numerous tables for co-worker happy-hour gabfests. Sizeable bathrooms (although the floors are typically covered in towels every time I visit). \n\nMenu: agreeable variety. Serviceable. Plates of sizzling pub-food standards (wings, tenders, burgers, etc) go gliding past you all evening long, the trays held high and level on the slender white wrists of the staffers hustling tables (inbetween gabfests of their own). \n\nOh well. If you're in the area and need a reliable type of place, (rather than a filthy hole-in-the-wall) this would be your best bet. Blacks (Fulton St is nearby) and whites comprise the crowd. \n\nThe only thing I can say to the negative is that it just doesn't feel all that 'intimate' (due to the high ceilings) and that its just a tad lacking in character.  There's the usual assortment of pseudo-nostalgic old-time memorabilia on the walls, (the way companies like Applebee's do). Picked by a marketing team. But nevermind that. \n\nOverall: O'Keefe's is a very efficient operation. And they have a Touchtunes Playdium wall-mount jukebox; very accessible; with a good speaker system. The Playdium is not that arrogant, annoying, neon-rimmed, full-size 'Virtsuo' model which resembles a giant smart phone and is as ugly as sin. Playdium is just as good and not so distracting. I approve this choice.", "author": "Jorge G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}