{"aggregateRating": {"reviewCount": 177, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-17", "description": "This place has \"specials\" but couldnt honor them because they didnt have the food or the ingredients to make the kind of drinks i wanted..i kept trying to check-in on yelp but it kept saying i was to far away even tho i was inside this place was pretty boring i felt like going to sleep..bartender was pushy and rude cant see myself coming back", "author": "Kamica N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-25", "description": "Ive been to this place a few times with friends back in 2009 and with a few years break I came back since I was in the neighborhood. \nThe place went through some renovations and unfortunately so did their customer service and quality.\nThe vodka drink I got tasted more like water than anything alcoholic. Surprisingly the lady near us at the bar had the same thing. The bartender, this girl with a weird nose and terrible attitude splashed some vodka on her drink like \"here ya go biatch!\" attitude. They both got into a fight, the  bartender acted like a bratty child. She huffed and puffed herself by talking to another patron about how \"tough\" she is when she mentioned about the time her dog had diarrhea and couldnt clean it up and how she acted all nasty to people who called her out for it. Real tough... This place is in the craps. The only saving grace is the food", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "We've been going to this bar for like 10 years. Hubby has been going longer. We usually get the same thing,  cobb salad and wings. We also buy wings to take to parties, most recently the Superbowl. I've never had a problem with my food order and it's always quick. We also rarely have a problem with our cocktails but if so, it's fixed quickly. We will keep going as long as they're open.", "author": "Nia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-29", "description": "I have never been to a bar, where the bartender was not interested in serving drinks . . .\n\nIt wasn't because of any racial/ethnic/gender bias on his part, but the bartender wasn't interested in having to work that evening. A friend and I stopped last Saturday while waiting for the 8 O'clock show for \"The Hunger Games\". Since it was only six, and freezing cold outside,  we figured to grab a drink and bite to eat at one of the closest places.\n\nWhen we arrived, we sat at the bar and the first bartender (female) after we placed our order wanted to know whether she could charge my tab as she was about to end her shift (Gee, she needed to get our sale under her belt that badly?). Then bartender two came on shift - a kid who looked barely old enough to drink himself and seemed not interested in working that evening.\n\nWell, bartender # 1 left. Our food took forever to come and it was definitely not good. The turkey burger my friend ordered was extremely dry and almost inedible. My chili was piled with too much cheese on top, and was mostly beans (not enough beef) and had not bite to it, it tasted like it sat in a tomato sauce all day.\n\nThe aforementioned service was the worst. I had to continually call to bartender #2 to ask for refills of water, and for condiments after our food arrived. He seemed to be preoccupied with cleaning the sink and washing glasses that he could not be bothered with taking drink orders from the patrons in an almost empty bar (lucky enough we ordered whiskeys so that could not be screwed up . . .). We had to ask for another drink. \n\nIt had been a long time since I had been in O'Keefe's and it will be a long time until I return, I will definitely try another place to go before or after a movie outing in the area...", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "This place is a little on the pricey side for the drinks however, the food is pretty good for a bar and they have really great wings. The service is on par with other bars that I've been to in the area and I would definitely recommend it to other people. Overall great place to catch up with some friends or watch a game!", "author": "Wade C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "First time I went there, was waited on by a young lady. She was very nice and polite. I felt welcomed. The second time I sat at the bar with a friend. The bartender didn't look like she wanted to be there. We ordered 30 wings and sodas. After eating we were constantly asked if we wanted anything else. To the point where it felt like we were literally being shoved out the door. We said no we're okay for now after having finished eating. She printed the check and said have a good one. This was one of the most rudest things you could do as a server. Mind you yes we werent ordering anymore at the moment, but we just ate 30 wings !!! The male bartender was rude as well basically kicking us out as well because we were sitting there watching the football game. Food is good, drink prices are a little high, depending on who waits on you be careful!!! Not sure if Id eat there again. Probably not.", "author": "Harris E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "FOod Is good but this bar is honest beyond words, I left my wallet there with 1800 dollars in it and they actually took the time to call me and give it back money and id in place. I cannot express the amount of gratitude and thankfulness I feel to this bar. 5 stars all around for good customer service and integrity.", "author": "Anahat S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "Everything was fine. The drinks were good until we ordered food that did not come for an hour in a half. Me and my friend were so busy catching up that we didn't notice until we saw people who were seated after us receiving their food order. One of the servers comes and explains the mix up which was a crazy lack  communication between the staff and the food will be free, but when another server brings us the check she denies it. The Shepards pie taste like the mashed potatoes were from the box. And because she said the food would be free we ordered more drinks. Nothing was done to ease the fact that we were forgotten about. I will never come here again... I'm disappointed because I really liked the place.", "author": "Shana F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "Server was nice ice t was horrible it smells like an old Fridays dumpster the Burger was little but alright wings was ok .", "author": "Joane G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "Went here with a co-worker for a quick lunch. \n\nWe were seated and immediately, I noticed the smell. I looked around and the bathrooms were right there. I checked to see where we could move but there was no where else to go. The smell was so overwhelming that it was in my nose. There was no let up. It smelled like the cheap brand pine sol. Not the regular pine sol and it was seriously very powerful. (can't possibly be healthy)\n\nMy co worker and I ordered our lunch and tried to ignore the smell. The place has AC and we didn't want to walk around looking for an alternative place to dine. So we get our food. I asked for honey-mustard sauce. They charged .75 for a smll tub of honey mustard sauce.\n\nOverall, the food was decent. My co-worker was pleased with her food too. Service was lack-luster, unenthusiastic, and just plain ole....blah..blah..\n\nDefinitely not a place I would return again. At least not until they did something about that smell. I hear the wings are good but didn't try them.\n\nI gave 1 star because the smell is so annoying and distrurbing that it's hard to concentrate on anything else.", "author": "Tiwana E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Great place to watch sports and have drinks, food is good can't complain on that. The waiters do take awhile to take your order, but they are friendly. It's very loud atmosphere not for dates or business matters. The prices are reasonable and the music is okay.", "author": "Ide I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "O'Keefe's holds a dear place in my heart as a SFC graduate, and as someone who worked in the surrounding area.  The food was good and the drinks were better.  Whenever I am in the area I stop in.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-29", "description": "Met my brother in law for lunch and told the waitress we were in a rush, but the food still tool a long time. I was forced to inhale my food. My brother on law liked his much more than I liked mine. I had the Buffalo chicken on recommendation from the waitress. Maybe I should have tried the French dip like I planned.", "author": "Brian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "I popped in around 1 pm on a Sunday to watch some football on my way home from Brooklyn Bridge Park, and had an overall good experience. Nothing special (and no drink specials I should add), but the beer was reasonably priced for the area ($6-$9), and they had every NFL game that was on playing on at least one TV. I can't say I look forward to coming back, but I'll definitely stop by if I'm in the area and just looking to grab a pint.", "author": "Paul F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-04", "description": "The bartender Grimmy is the absolute worst thing about this restaurant. He is sexist, extremely rude to the customers, and disrespectful to the waitstaff. Not only that but he has a weird relationship with the owner and because of this he is untouchable. If there is anything wrong with this restaurant it's because of this awful bartender. Do not go here!", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "Sitting here having a bar n shot n Jamie is the man!!!! kool dude n the atmosphere is relax and chill....if you're Dwntwn Bk must swing thru", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Great beer selection, good food, friendly staff and close to my hotel everything I needed tonight.", "author": "Robin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Best wings I've found in a long time. I go for the buffalo or teriyaki.\n\nDaily deals (Monday night is $.50 wing night), and decent regular prices.\n\nIts busy on game nights, and I've meet some classic regulars there ;-)~\n\nOverall, it was a bar I stumbled upon one night, that I now seek out", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "Beer selection is good but their wings are amazing. Good place to go watch sports. The prices are normal.", "author": "Benny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "Great place to watch sports - as long as you can get a seat. Not too much ambient space to stand where you won't be in peoples' way. Food is good, wings are truly top notch. Bartenders are always friendly. Probably the best place to have drinks in the heights.  This is an every-man bar.", "author": "Bobby M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "O’Keefe’s Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/S41rSbbDpGB7H5LZ42A5gA/ls.jpg", "@type": "Restaurant", "telephone": "+17188558751"}