{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "This place is a great addition to the neighborhood.  While it's not much to look at inside, the food is inexpensive and delicious and the people who work there are really nice.\n\nI got a bunch of Mexican food for a Thursday fiesta after work.  The chicken burrito was huge, with nicely cooked chicken, fresh black beans, and guac.  The quesadilla was really good, as well.\n\nI saw a guy in there eating fried chicken with pork fried rice -- I'm gonna have to go back to try that combo.  The fried chicken looked temptingly enticing.\n\nConsidering how inexpensive this place is, you really can't complain.  It's great value for money!", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "Simply....quality than quantity!\nNot excellent but for the price, Curry Chicken with Onion ($5.75) was actually good. I chose fried rice (+50 cents). Sliced white meat were tender. Sliced green peppers, Chinese cabbage and for color, I believe, there were sliced carrots but it didn't work for me. Portion was good for two of my size.", "author": "Taiyo O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-05", "description": "Pretty good food.\n\nThe proportions are amazing considering the price...especially for NY.", "author": "Sonia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "You know, this is a typical Chinese/Mexican (but really Chinese) hole in the wall that you find all over NYC.  Is it truly good food?  No.  Is it a guilty pleasure?  Hell yes.  It's also pretty cheap and quick.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-28", "description": "Disgusting and must be 3 times the normal amount of msg for an Americanized Chinese takeout dish.  Avoid the Chinese menu as at all costs.  I can't speak for the Tex-Mex one.", "author": "Kevin G."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Tex-Mexican \u0026 Chinese Food House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": "+17182465533"}