{"aggregateRating": {"reviewCount": 12, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "I stop in here once in a blue moon. The daily special  is 2 slices and a can of soda. Its located close  to 3 high schools in the near by neighborhood.  So, when school  lets out,  its a madhouse.  If you are broke, hungry, dont know any better, or all of the above. This place is the move. I have never seen anyone order a pie, there is no salt, or pepper, or  a little  parmesan cheese to spice it up. They have stepped up their game recently to garlic and red pepper flakes.  Other than that, in my estimation,  this is about as boot leg as it can get. Well, lets not underestimate  the 99 cent spot around the corner. All in all, it is what it is. And every blue moon, like yesterday and it was pouring  rain. I polished  off my 2 slices  and pepsi and kept it moving.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Don't order from Papa John's. The deals sounds good but in reality you get a really cheap product. Ordered the pepperoni and mushroom pizza. Putting two pieces of mushroom and pepperoni pizza doesnt count as topping. Contacted the store and all they did was complained that I didnt call right away. DONT WASTE YOUR MONEY here.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "Don't ever order from here.. they stole my money and the manager is a real a$$hole .. I used to come here everyday but i will never be returning to this establishment again.. they have terrible customer service and talk to people extremely rudely", "author": "Nyair Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Doesn't matter how much pizza sauce I order--one, or like four--they generally give me none.  Pretty irritating.  Pizza sauce I'm being charged for, mind you.  I mean, if I order breadsticks, what am I gonna do without pizza sauce?", "author": "Pravin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "K I wish I could do zero stars, Waited two hours for nothing. Rude customers services. If I could advise anyone of anything DO NOT order from here. Seriously, I can't advise more.", "author": "Jaelle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "My friend and I were shopping nearby and decided to order Papa John's for dinner--my go-to chain pizza. We placed an order online and received an order confirmation and an estimated time of when the pizza would be finished. However, when we arrived at 10 pm (the hours online and on the physical store door said that the store closed at 11 pm). The person who was mopping reluctantly came to the door and claimed that there was a person who came before to pick up our pizza. When the person explained that someone came and took our pizza, the wrong one, they offered us to take a different one that was already ready instead (pepperoni and sausage instead of the Works). When my friend who actually placed the online order came to clarify things, they told him the same thing but also offered to make our actual order, the Works, but we would have to wait an additional 15 minutes. We decided to take the already ready pizza instead of having to wait additional time, but throughout the whole process, the workers there were not very good at communicating the situation or if they were going to fix the problem and make us our original order. They also seemed as though they were lying and somehow either never made our order or mixed it up with another person's. Overall, an unprofessional way to handle this situation with terrible service. Will not return to this Papa John's location.", "author": "Jenni W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-29", "description": "Hi I'm a tell you my experience at this no good place sooo the manger or cashier or whatever was extremely Rude  shaking my head . I ordered a carry out and when I got to the place they said can I see ID and card , I said Okay. Not that big of a deal but when show them show card they said \"Fraud\" and I'm in my head fraud for what I am a good woman I'm kind at heart I give back to the community , donate to the hospital and I have a good a$$ job. Soo why tf I would be fraud. They Extremely ride to customer. I callled them before to check up on my order . They man answered the phone extremely rude and when I told him what time I had order he completely Screamed at me and then they couldn't find my order and they already took the money from my card soooo when I got there there telling my all these other things‍ this place needs to close down and put a Dominos there. NO GOOD PLACE AT ALL Or they just need better workers ‍and they didn't even make my pizza right the toppings was under the cheese wtf. Wasted my money on a piece shit. They only thing to get from here is A Slice of pizza not a pie.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "Order through seamless. And it shows the order was confirmed and food is prepared, the delivery never shows up. Don't ever order from this again.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "They advertised 2 pizza and can soda for $2.75. But they will take your $3 and not give you change. They will say that the 0.25 was tax.... See that's illegal. Because with tax, it should be 0.18 cents. Not only that but they falsely advertised the $2.75. Also they are just using the tax as an excuse. Every other time that I ordered either using card or cash, there was no tax on $1...... This guy is stupid. Also their cheese on their pizza is too melted and hot. Most of the customers are disrespectful inner city high schoolers that are loud. They always make fun of both the papa john's staff and the customers. They also think they can rap but they can't. They are always so loud and rowdy too.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "Terrible experience! I spent over 30 dollars on an EXTRA LARGE PIZZA, and when it came it was not  that size at all. It was 16 inches, which is a medium pizza. So I spent 35 dollars on a medium pizza. Huge ripoff. I will not be ordering from here again. Really bad experience. After grossly overpaying for the pizza, we all ended up very hungry and felt jipped.", "author": "Zoe A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "One time I came here, I came in with a 2Bros pizza box (I was going to bring some pizza for my sister, but I liked the pizza here better.) Anyways, they scolded me profusely for bringing pizza from a different store. (In retrospect, I probably shouldn't have done that; I later realized there was a sign saying \"No outside food\".) They were quite rude to me, despite me wanting to buy their pizza and blue cheese sauce. I was going to spend the same amount of money I spent at 2bros. However, because they were so rude, I just left, because they wouldn't even let me have what I wanted. A normal person would never come back to this establishment ever again, but being the nice person I am, I decided to give them a second chance. I came back a week after the incident happened. They weren't as hostile as before, mainly because I decided to buy pizza from them only, instead of 2Bros. I got 2 slices with a side of blue cheese sauce, and the pizza was delicious when combined with the blue cheese. The $1 slices are smaller than 2Bro's slices, however, they are much more delicious. I would recommend the $1 pizza and the blue cheese sauce. The staff is nice (just don't bring pizza from other places, for your own good.) I am a regular here now, and the pizza is good (better than 2Bro's) for just $1 per slice. After that incident though, it is going to take me quite a lot of visits until I increase their rating. Even 3 stars is a bit generous.", "author": "Timöthy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "One star, because it's fairly reliable in terms of taste, for a chain.  However, this particular store has consistently messed up delivery orders (not bringing soda when ordered, missing other items) and tonight, the delivery guy was almost a no-show.  After calling the manager of the store, who insisted the delivery was at the right address, we tried to cancel our order and get our money back.  He told us that because we ordered online, that it was impossible to refund our money.  What added to my overall frustration was that there was a distinct language barrier, no even though we tried to tell the delivery guy where we lived, he didn't get it.  We won't be ordering from them again.", "author": "Jen A."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Papa John’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/oTpghmDj2mr46-bD6kWJNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185967272"}