{"aggregateRating": {"reviewCount": 1, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "I've lived about a block away from this space for over a year, and I really couldn't tell you what was here before this new deli just moved in last week. I do know that they serve sandwiches, and as a sandwich-eater, I would be remiss if I didn't check it out. \n\nThere are a number of combination sandwiches up on the board, and they ask that you \"Order By Letter.\" I got a #9 (I see the problem here, even if they don't), which is essentially a grilled chicken BLT for $5.50. Almost all the sandwiches are $5.50. The guy took some care in putting it together, which is always a nice sign. \n\nI took a look around as my sandwich was getting wrapped up, and they have a lot of unused space in here that I'm sure will get filled up with something. As of now, they've got candy, chips, drinks, and the sandwich counter. The bagels look terrible, but what deli bagels don't?\n\nMy sandwich was ready quickly, and as I noted, assembled nicely. Unfortunately, it was eminently mediocre. The bacon was overly dry and lacked flavor, but the chicken wasn't too bad. It was A-OK, nothing more, nothing less. This was a relatively inexpensive lunch that I'll probably revisit when feeling lazy. \n\nIf you're willing to walk a few more blocks, there are better sandwiches to be had (Side Street, Hero Shop, and even Mile End which isn't even in playing the same sport). However, I'd still take this new joint over 3 in 1 on the corner.", "author": "Peter D."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Downtown Deli Grocery", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "42 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MD_4zKa9FTKpG9lCEDLH0g/ls.jpg", "@type": "Restaurant", "telephone": ""}