{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Delicious, friendly and convenient to performance at BAM.  Limited entree menu but allows the chef to take time to prepare each dish well. At our table was the short ribs soft and succulent, pork tenderloin, and spaetzl with squash and brussel sprouts. Service was friendly and dining leisurely.", "author": "Elaine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Wow had never been to the Cafe.  Visited as part of the Si Cuba festival to hear the O'Farrill family band play live latin jazz....for free! \nLoved the space, the vibe, the sound...the DJ was pretty awesome.", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "great venue and diverse crowd., they keep it real here.  Right nearby Barclays center\n\nlooks like the set of TNT nba on thursday.  Went for free concert on Friday, and nice bar, with lots of brooklyn local beers.\n\nAlso had sick dj spinning some classics before and after concert.\n\nWould def come back here.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "we had a solid half hour before the movie at BAM last friday night so the four of us sat down in the cafe with the hopes of having dessert and coffee. we were ignored for 15 minutes by the servers. ignored. was it because there was a celeb at the next table? i doubt it, and they were done eating anyway. i was incensed.", "author": "Pam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "I love this place. I have been several times for music events. The setting is intimate enough for you to be able to talk to the performers before or after the show. There are cafe styled small tables (4 people) and some cushioned benches by windows. It's a good place to go for a solo night, you are bound to meet some new people or for a date. The events are always free, which is a big plus.", "author": "Melia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "I love Friday Nights @ BAM Cafe! In the last four weeks my best friend and I have yet to be disappointed about any live performance we have seen thus far.  \n\nIts a nice chill spot for students (free friday and saturday nights) to unwind from a long week of books and professors.  Who knows you might see your professor there too! It is such a relaxed casual setting you would not even mind.\n\nThey serve Cakeman Raven Cake for those of you who are fans because I am!  \n\nIn total...I am a fan of Bam Cafe!", "author": "A. E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "This review is based solely on the food / dining experience at the cafe.\n\nwent there for dinner before a show and sat at a table for table service. hostess was a bit rude. food was ok, definitely not worth $18 for dry chicken and tasteless burger with freezer fries. my biggest issue was with service. my friend asked what cheeses were on the cheese plate and the waitress' response was \"i think there's a sharp one.\" when she came back to deliver the cheese plate, we asked her again, thinking she's find out since at least one of her customers asked and her response was \"i'm not sure.\" \n\nin short, DO NOT go here to eat. BAM is amazing for arts and performances but if you want to eat, go to the bazillion delicious and cheap places down the block from BAM before your performance. drinks are ok though.", "author": "Gemini S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "Great venue to listen to live *often FREE* music.  It's in a great old building that resembles a church but it has crazy cool fiber optic light displays instead of stained glass windows......so it's basically a temple of good music.  \n\nNot too crowded at all, nice staff, not too far from the subway.\n\nI haven't seen a film here yet, but they have lots of revivals and art films with unique speakers that I need to check out.  Oh BAM, why can't I live next door to you??", "author": "Madhu R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "The space in the cafe at BAM is awe-inspiring.  It's huge and has a great deal of aesthetic appeal starting with the space, to the lights, to the stage.  It's a great place to catch free shows on Friday and Saturday nights.  I caught a show from the Sounds Like Brooklyn Music festival and it was a great mix of jazz, blues, and classical music.  I would definitely say it's worth visiting for both tourists and New Yorkers.  How can you go wrong with a free show?  It's also not far from the 2 or 3 train. \n\nIf you're going to catch a show at the BAM Cafe, I recommend showing up early.  Seating is limited.  It wasn't packed on a Friday night, but there were a great deal of people who had to stand along side the walls and around the bar because all the seats were taken.  They have bar food here and serve good cocktails, but it is a little pricey.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "First visit to the cafe and was kicking myself for not having come sooner. The free lineups and interesting decor will definitely bring me back. The seating is a bit strange but I was able to find a comfortable nook with a plush coach and great views of the stage so can't complain. The people were a cool mix and the house DJ was fantastic. The drink selection was very small but the bartenders were friendly and pretty responsive. I would defiitely recomened!", "author": "Karina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Wow! BAM Cafe is beautiful. I can't believe my first visit to this place came more than eight years after moving to NYC! They have free music performances on Friday \u0026 Saturday nights. Yes, I said FREE. You just need to make sure to show up about an hour before show time so that you can get a table. There is a really nice bar in the cafe, so you can sit and have cocktails while you wait for the show to start. \n\nThey offer a few bar munchies like fries, pizza, chicken satay, etc. We ordered the rosemary pommes frites and while they were very good fries, they totally skimped on the rosemary. And the giant bowl of fries only came with one small side of ketchup. Some mayo would have been good with them too.\n\nWines range from $6 to $12 and they have special cocktails like a jalapeno margarita and a drink called The Coltrane, which was YUM! Cocktails are around $10. A little pricey, but you're seeing a show for free so it's kind of hard to complain.\n\nThe space is cavernous, with really high ceilings and lots of twinkly lights. It's really gorgeous and worth going at least once just to see the space. BAM Cafe, I will see you again soon!", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "I just love it, their space is just great! There is live music for free almost every friday and sat. I just to hang there almost every weekend, get a delicious burger and a bottle of wine, while listening to some great music. I absolutely recommend it!!!", "author": "Carmen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "I'm so glad that I finally made it here. Bam café was beautiful. the ambience was just right. Low lighting, good drinks, great live music. It was free and we got there early enough to be able to sit down. I will definitely be back for more shows. It was walking distance from the Barclays center as well which I did not know. Do not have the blackberry martini. It was the worst drink ever! They do serve appetizers(which smelled so yummy)but we didn't order any.", "author": "Mrs. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-25", "description": "Where else can you see new artists play live music without a cover in a swank space?\n\nIts a rhetorical question but seriously BAMcafe is a great spot to hand out, have a drink and listen to some great music. If you are really into who is playing show up early so you can get a seat and chillax in comfort.", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "If you are fortunate enough to find the enterance, and then again to find the cafe you're in for a treat.\n\nI don't mean the food, I mean with the people.\n\nI've witnessed break-ups, arguments over where a complete stranger should and should-not sit as well as numerous behind-beatings from mother to child.\n\nWhy pay the fare for a film when I can get my entertainment for free?", "author": "J. G. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Food, wine and atmospherics are generally quite decent, but ... It is almost impossible to get real scallops in a NY restaurant (they are almost always bland, mushy fish pieces cookie cut from dolphin or shark, with none of the distinctive, clear taste of a real scallop), but I thought BAM Cafe might be a respectable exception. Afraid not. \"Everyone does it\" is an excuse but not really. NYC restaurants should unite and suppress this scourge and insist on the real thing from their suppliers.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-20", "description": "Please tell me the last time you enjoyed totally FREE (but actually good) musical entertainment on a weekend night within a completely gorgeous, spacious indoor setting.\n\nThat's what I thought. \n\nBAM.", "author": "morecawfee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-16", "description": "I came here last Saturday night to watch Heather Park and Mahasin.  I don't think I've ever been to a \"cafe\" with an escalator.  Talk about fancy.\n\nBoth artists were fabulously amazing.\n\nThe crowd however, was not.  I'm not really into being subdued.  It's kind of awkward when you're the only one using vocalizations (instead of the more subdued applause) to show your love for artists at the end of a song/set.  Just a little awkward.\n\nI was also slightly agitated about the lack of seating.  Being the midget that I am, of course \"mister tall man\" would always hover right in front of me.  Just my luck.  Plus my entire bottom half of my body was so tired from all the walking around the city I did previous to the show.  It was brutal having to stand especially while so many other people were enjoying their tables, chairs and cocktails.\n\nSo I suggest coming extra early if you're expecting to be comfortable.  This way you can snag a table, chair and cocktail and enjoy the lovely FREE music every weekend night.  That is, if you're a subdued kind of person.", "author": "Monica R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-10", "description": "With every business there are goods and bads... unfortunately this iconic, historical place ,a place that is the first arts center in the United States, has more bad than goods....\n\nI will never say that BAM as a whole is bad. It is one of the great institutions of this country and more importantly a lasting staple of Brooklyn. They are definitely heading in the wrong direction.\n\nI went to a free Jazz show in the BAM cafe' Sat December 8 2012 ( the Band was outrageously good-Urbnergy is their name GREAT JAZZ BAND) . The building stunning, the Cafe', superb as for the aesthetics. Food hey , I have one word that can describe the taste of the food delicious. Yes it was. The BAM burger moist(not worth 15.00) , the meat did not taste old, fries did not feel like they were sitting in oil for hours, braised short ribs soft falling apart and tasty(definately not worth 28.00), crab cakes... well, I can get a thesauruses and go on forever and tell you how good the food was. You may ask than where is the bad?\n\nMenu, unknown, service horrible, prices ridciulous,portions childlike. Here is the problem BAM is a ARTS CENTER not a restaraunt/cafe....They have NO RIGHT doing what they are doing there. They are not geared for it properly. They NEED to stick to what they know ARTS.....\n\nThis being said am I saying close down the cafe? Absolutely not. Get rid of the restaurant menu type food that requires, menus,cooks,waiters,etc.... do what they have been built for. Intermissions a quick drink,snack and that's it.  Keep the free shows (ARTS) in the cafe and limit the area to drinks and light snacks products, again NO \"FOOD\".\n\nReasons:\n \nDinner menu/Bar menu YES two different menus, great right? More to choose  from a heavy entree or lighter bar food....WAAAAAAIIIIIIITTTTTT stop put on the breaks, that does not mean you can choose off of both. It means after 8pmish they will not let you order from the Dinner Menu.....WAAAAAAIIIIIITTTTTT the bar menu does not start till 9pmish...so here's the deal make a 730 reservation for 12, be told you have two different menus to order from, than find out when you get there yeah but you can not order off those two menus at the same time you have to sit here and starve if you don't want to order off the dinner menu and wait for the 9pmish \"bar menu\" to start. That makes no sense.\n\nAsk for a pitcher of water to be left at the table, so the waiter does not have to run back and forth and we wait 12 minutes for a water...get told it's in use...HUH? Yes the ONE pitcher they have there, IS OUT IN USE.....lol...no lie.\n\nGet three extra meals brought to your table that you did not order because they can not keep track of the orders....\n\nGet the food WRONG  from the food you did order... \n\nForget to bring three meals.....\n\nCan not keep up with the demand of customers of a restaurant ( why, BECAUSE IT IS NOT).....\n\nOne manager says ok to something and than just forgets to pass it on to the staff doing the work or the staff doing the work just outright lied.....\n\nLast reservation is 730 ( respectfully so they do not interrupt the show) but yet you can order food passed 8(ish) or wait till 9(ish) and order from bar menu and than get rushed out ( the whole venue not just us) the SECOND THE SHOW IS OVER\n\nListen I am not sayng the waiter is bad, the runners are bad, I am saying they, BAM cafe', IS NOT GEARED for a restaurant environment. We had a table of 12 and I can most probably assure you they never had to deal with that much at once with FOOD orders.Basically, it overwhelmed the staff.\n\nNow if I go on to tell you what the bill was for 12 people you would probably die...\nJust a hint\n3.00 to plate each slice of cake (that we knew about), Charged for every soda including club soda....I will just tell you this for the price they paid for my Bday we were VERY VERY CLOSE(maybe 12 pp difference) to the prices of such places like...Russos on the Bay, Grand Prospect Hall, Gargullios, The Rivera (wedding prices my friends)....with open bar (and no, drinks were  not the problem cause only 3 people out of the 12 drank) Get the hint.....\n\nGo there enjoy the shows, take in all the different type of Arts and entertainment that BAM showcases and provides us with....embrace the history of BAM and support it, but, do not do what I did and think you are going for a nice dinner and enjoy a show after wards,  do your family, friends and self a favor and DO NOT think about going with a real \"dinner\" or dinner experience in mind\n\nPlease do not let this mistake of theirs ruin how you feel about the shows and BAM as a whole. I know for me and mine, LONG TIME residents of Brooklyn ( long as in lifetime, bred, born and raised here) will NEVER attend BAM cafe' for a complete night out will Only come for the music and shows.\n\nGood luck", "author": "Mitch K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "I was just here for a free show (came to see Takka Takka) and it was really nice save for all the people who were clearly not interested in the music and talked the whole time and got progressively louder with each overpriced cocktail they  threw back. Bitter much?\n\nBUT. With that sad. I love the space upstairs. It's so large and airy and the floating body casts are really awesome. And even though it was so large the acoustics were still really good, there wasn't too much echo or anything. \n\nI look forward to going to more events here!", "author": "Holly T."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "BAMCafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave\nBAM's Building Lepercq Space at Peter Jay Sharp Building", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EdIfeK3c_TOSH7VA1Imx8w/ls.jpg", "@type": "Restaurant", "telephone": "+17186237811"}