{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "This may be one of my new favorite places in all of New York. The space is beautiful and large, and you can't beat free live music. Their house DJ is also great, with fun mixes that are relevant to the type of performer they have each night.\n\nDrinks are reasonably priced for the city, but definitely stick with beer or wine. The cocktails and mixed drinks are pathetically weak. \n\nDefinitely come a bit early to get a seat at one of the tables. Performances start promptly at 9, and they tend to wind down by quarter to 10.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "BAMCafe is super cool....Actually, I just really like coming to BAM (movie theater, auditoriums to see live shows etc.) and their cafe is just another one of the interesting places to visit. \n\nOnce I take the escalator upstairs and approach BAMCafe, I use a minute to take in the ambiance. The bar area is located towards the back near the escalator, followed by a mini art exhibit, multiple tables and chairs for dining), a small couch area on the right hand side closer to the stage (gives the place a semi-lounge feel), the stage and the bathrooms are located behind the stage area. Inner decor is really special at BAMCafe as the walls have a brick - like structure, there are decorative lighting fixrures in the windows and the overall lighting/color aesthetic is gorgeous.\n\nRecently, the BAMCafe Live Series has been quite entertaining. It is a free live music showcase featuring different types of music. BAMCafe Live has been taking place on Friday + Saturday nights at 9pm. Pleasurable does not begin to describe my experience as I have been going several weeks in a row to enjoy BAMCafe' s live music itinerary filled with great bands. Baraji is a Korean Music Group that blended the use of musical instruments and singing to give a lovely performance. Alvin Flythe and his band served the crowd with spectacular Jazz Music and Arthur Russell Concert last night was wonderful. \n\nStaff here at BAMCAFE enforce strict rules such as where you can stand etc, to ensure everyone's safety. The bar staff try their best to get you your order in a timely manner (it gets very busy w/ customers during live music nights). The happy hour is from 6 -8pm but one can get a alcoholic/ non-alcolohic beverage for the duration. I have only had a glass of juice which was $3.50.\n\nThe DJ is there and plays an excellent selection of music before and after the live band performances. He keeps the party going from the beginning to the end!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "I've been to BAM several times for movies, concerts and shows, but never made it to the BAM Cafe. Finally had a reason to go for a free BAMCafe Live concert. The space is gorgeous (the spinning lights you can see from Lafayette Ave are also visible on the inside). The bar is pretty big. Cocktails are reasonably priced (around $12) and when it's HH pricing, beers are more reasonable. The acoustics are great. Just keep in mind that it's more of a sitdown dining table venue with some standing/dancing room (but not a lot).", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "BAM Cafe is a cozy loft atop the Brooklyn Academy of Music that has a bar, food pickings, live music and readings. While up there, you are sitting behind their gorgeous spherical kaleidoscopic glass windows. It's a great spot to grab a drink before or after visiting BAM cinema or the theater. It's also great as a stand alone date spot for drinks and live music on a Friday/ Saturday night. It's one of those small, charming Brooklyn spots that (seems to me at least) is a well kept secret. If you're in the park slope or fort greene neighborhoods it's close enough and definitely worth checking out.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "This venue is beautiful!  They host a variety of events including films, performances, comedy sketches, and FREE live music.\n\nBAM Cafe is located on the second floor of the Peter Jay Sharp Building and is opened Friday and Saturday nights (6pm-11pm).  Last night (Friday 9pm), White Prism performed some of their catchy, breathy synth-pop songs.  The audience were all nodding to the beat, some even stood up to shake their shoulders!  I can't believe this was a free performance!\n\nAt 8pm, around the time we arrived, the tables were about half occupied.  By 9pm, they were all filled.  So my recommendation?  Come early, take a seat, have a drink, and enjoy the ambiance :)", "author": "Jing X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "BAM is probably my favorite local cafe because of how good their coffee and hot chocolate is. One of the better spots for live music, especially if you're headed to the theater.", "author": "Frank D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I have visited the cafe a few times, but it's been a while since I've been there. I just remember eating the most delicious crab cakes here (not sure if they still serve it). They often have free events in their beautiful, newly renovated space (you can rent the space for private events like weddings, etc.) featuring cool musical acts and other arts like dancing.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "This place was super cute. The environment was very welcoming and modern for a coffee shop. I had a chocolate and fried dough balls with ice cream and pecans. The friend dough balls were delicious! They were crispy and soft in the inside. The guy at the counter was helpful and willing to answer questions. Loved this place!!", "author": "Diana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "This is definitely about to be my new spot!! Didn't know much about it until my friend mentioned a free show. It's super close to the subway-- Barclays center. BAM is a great location for those wanting to delve into arts and music just as much as those that believe these things are their lives! The show was actually free and EXCELLENT!! The free shows are Friday and Saturday evenings probably ending btw 2200-2230. Nice timing. Coffee and hot water are also served--$3 per hot beverage. I was even able to snag a seat which was nice. Eclectic crowd", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Fantastic spot for live music, drinks, and dinner on Friday and Saturday evenings. Located on the second floor of BAM, it's a beautiful space with unique lighting features (and you can see the cool spiral lights that adorn the outside of BAM from the inside!). If possible, go early to beat the crowds (music usually starts around 8 or 9 so arriving before then can usually get you a seat). There's a large bar area and an extensive amount of tables/chairs. Service is top notch. Happy hour is from 6 to 8 and offers $5 beers and $6 cocktails. For food, it's a lot of small plates. We very much enjoyed the burger, chicken sandwich, and fries but the menu changes seasonally so it's worth a second visit to see what's on the menu!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "Can't believe I've never written about BAMCafe!  \n\nThis has been a great spot for a long time now, especially the free events they have on many a Friday and/or Saturday night, but even for the pay ones as well.  Beautiful during the day ornight, it gets packed for the free night concerts so get there early if you want a seat facing the stage.  Even if you're not though, the tunes carry through to the back couches where you can chill with a friend or three or with that special someone. This is also a great first date spot.  The drinks aren't cheap, but, they are strong - which I like!  \n\nCome check it out, but don't steal my seat!", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "Oh BAM Cafe with your weird seating policies and your great free lineups!\nI like this place, but it's so sad you have to get here so early to see someone for free. I wouldn't mind spending money to see a good performance and no one minds standing, but sometimes it's a little disheartening to travel there and find out you won't be getting in.\nWhen and if you do get in, you have to stand in weird spots. It's usually a good time, and I wish they would just do a fun afterparty, since there's always a great dj there, but alas, they don't. \nFun if you're in the neighborhood and can get upstairs to catch the show before they turn off the escalator!", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "This place really feels like it belongs in Brooklyn and in its own world. It's is absolutely stunning and filled with old art, beautiful paintings and more. Here you can see some cool, new age eclectic style operas, plays that push the boundaries of creativity and most importantly you can catch some good indie films. I love their upstairs cafe and full bar. They even serve food that isn't bad. It's a bit expensive, but you are at a theatre. I signed my husband and I up one year for their season package which allowed us to see 4 plays and 2 operas. Some were better than others, but the theatre is gorgeous and the stages were always very well done. Also the acting varies depending on the play but still very good. \nCan't wait to be able to go back.", "author": "Daniela T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "Came here on a Friday night hoping that it would be the BAM Live Music Happy Hour.  Unfortunately that didn't start for a couple of hours, so my friends and I decided to sit down and have some drinks and small plates.  My friends shared a bottle of red wine, which that said was subpar, and I had the Maple Lemon Sparkler, which was very refreshing and not too sweet.  I had the Pork Belly Rolls which were delicious, I wish there had been more of them.  My friend also ordered the Potato Croquettes, but they never came.  \n\nOur waitress was nice, but the space filled up while we were dining and the service got slower and slower.  It seems like a nice place for a drink at the bar, but I think I'll hold off on coming back for table service.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "BAM cafe is absolutely amazing!!!! The food is delicious! burgers are my favs! They also have live music performances all the time. Great place to spend an evening!!! And Barmen in the cafe are very professional and super friendly!!! Love that place!!!!", "author": "Laura C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "Cute little spot on the mezzanine level of the BAM Howard Gilman Opera House.  The place fills up during intermissions.  It would probably make sense for them to set up a clearly marked area to line up for beverages/snacks.  The place is split between the bar and a seating area (which consists of tables/chairs, food court style).  Some lounge sofas/small tables are scattered around the perimeter, which makes up for the food court style set up of the other tables and chairs.\n\nA glass of red or white wine is typically $10.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "Went last night before Threepenny Opera (which was quite disappointing). The cafe is fantastic. Beautifully designed, with steel and arches of amber colored lights, the cafe is stunning in the evening. I do miss the little book shop they had to the left of cafe, now a mini-art gallery, but I'll live.  \n\nThe bartenders were all very nice and casual, and the drinks were done well and promptly. The food was much tastier than I had expected (warm pretzel bites, and a very cool \"potato\" ring dish were both well-seasoned). I really loved the cheese selection for the cheese/bread platter - with these crispy mini-bits of raisin/nut bread. \n\nOne little \"concern\" more than a critique was the bar itself. From our side, by the host/hostess station the bar side was wobbly and may want to be looked at. A great place to meet up before a BAM movie or show - you can't go wrong here.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "The quality level of musical talent that performs here for free is so high that tonight's show that was the worst I've seen there was just good instead of great. Whoever books the talent there is to be commended. \n\nThey have made changes recently to where menu items seem more expensive and smaller portions than they were in past years (or maybe I'm remembering wrong?) and they put the kibosh on putting tables together, which my group of friends used to do all the time. But because you could in theory go and pay nothing at all, it's still a good deal.\n\nThe ambiance of the space is nice, and the vibe you get from the performers, the audience, and the bar staff is always friendly. \n\nI recommend getting there no later than 8 if you want to get a seat. How quickly the space gets filled up with people varies depending on how well known the act is, but know that sooner or later the whole place does fill up, especially at 9 o'clock when the show is about to begin.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "food is okay, but the place itself is a gem. Free live music during the weekend nights!!", "author": "YUQI K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "This a beautiful venue for some drinks and live music. I went there on a friday night with some friends and had a good time. There's no cover, the crowd is cultured and the music is diverse. The cocktails weren't even that pricey. Definitely will be going back again.", "author": "Mike W."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "BAMCafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave\nBAM's Building Lepercq Space at Peter Jay Sharp Building", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EdIfeK3c_TOSH7VA1Imx8w/ls.jpg", "@type": "Restaurant", "telephone": "+17186237811"}