{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-06", "description": "There's no need for heavy pockets if you're looking to enjoy a decadent meal (perhaps followed by or following a movie at their cinemas) at the BAM Cafe. I was awestruck upon my first arrival here. The atmosphere was calming and the staff was very pleasant and inviting- not at all snobbish. \r\n\r\nEverything you'll need from appetizers to desserts can be ordered from the $21 prixe fix menu. I had a wonderful salad, followed by tender short ribs with mashed potatoes and a DENSE (I'm talking two bites-will-leave-you-more-than-satisfied dense) chocolate fudge cake. My experience was nothing short of wonderful. I know you'll fall in love with this place just like I did; but beware! If you get hooked one particular selection their menu has to offer, don't be surprised if one fine day it fails to appear on the menu- typographical error? no. It's just a seasonal menu change.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-15", "description": "BAMcafe is located upstairs from the main level of the BAM complex. The cafe is where one can sit and eat dinner on certain nights (between 5 and 7 ONLY) or choose from the skimpy bar menu. I don't recommend this. There are plenty of decent restaurants in the 'hood. What the cafe is good for is grabbing a table with a bunch of friends, having a drink and enjoying music. The space is HUGE and there are plenty of bartenders. No crowding and shoving to get through or get served. World music is the order of the day, with lots of internationally famous musicians coming through here. The comfort and convenience of the whole complex, with its cinema, theatre, dance and music spaces, makes it ideal for a weekend visit.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-19", "description": "gorgeous place. great music. fun crowd.", "author": "Christine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "Check this S@#t out !  Free music on the weekend with a full bar in downtown Bk!  Getting a drink is as easy as getting an HJ in the meatpacking district thanks to the fully staffed bar.  Even if the music is awful, Erin and her Bass, you'll still have a good time soaking in the glowing ambiance.  The food is tasty and their Jalapeno infused Margaritas will make you scream \"Odale Guey!  Vamos a la luna!\"  It's tough to find a seat because it's free but that won't hold you back from some decent people watching.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "bam cafe is awesome. i go for the free live music on friday and saturday nights. its a great way to hear different types of music from up and coming performers.  the crowd there is generally chill and diverse. the space is gorgeous with high ceilings and huge windows. its one of my favorite spots in brooklyn. the only drawback is that a glass of wine is slightly overpriced.", "author": "emily b."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "BAMCafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave\nBAM's Building Lepercq Space at Peter Jay Sharp Building", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EdIfeK3c_TOSH7VA1Imx8w/ls.jpg", "@type": "Restaurant", "telephone": "+17186237811"}