{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "BAM Cafe is an experience that never disappoints.  The concept is simple, on select Friday and Saturday nights, BAM cafe opens it's doors for free concerts by top-caliber performances.  You can arrive early, sip drinks, chat, and if you want, eat upscale bar snacks while waiting for the performance to begin.  Of you can arrive a bit closer to the performance, stand along the walls, and watch the performance.  Either way it's a good time.\n\nThe Cafe space is absolutely gorgeous.  A tall-dimly lit loft-style space, with dark walls (brick I believe), several gigantic windows to one side, and small dim bulb lights flanking the walls.  The stage is all the way at the front of the room, level with the dining tables, with the bar, which is a large square shape with chairs on all sides, is all the way towards the back.   The only design flaw with the setup is that the bathrooms are located at either side of the stage. Each and every time I've attended a performance, there are issues with people walking in front of the band en route to the bathroom in the middle of a song.\n\nYou'll have to arrive at least an hour early for a seat.  And I've found that the back is generally noisy, due to the bar, so the closer you can get to the front, the better.   The drinks are reasonable enough for NYC, but the food seems to be overpriced for what you get.  I highly recommend having drinks at BAM before hitting up a restaurant on Fulton Street or DeKalb after the show.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Free music! \n\nBeen here 3 times! The best performances!\n\nGet there early if you want yo sit but as soon as the music starts you cannot see much unless you're standing. \n\nLove the decor!", "author": "Monica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "Great free live music Saturday nights. Gets crowded around showtime so be sure to show up 30 minutes before if you want to sit. The security does a good job keeping fire lanes clear so if there looks like a good empty spot to stand... You'll probably get asked to move.", "author": "Christina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "More people need to know about this place. They have great shows on the weekend and its in a very nice venue. The cafe is classy, modern, and spacious. The food and drinks are pretty good too!\n\nI have seen stand up comedians here, live music, and I'm sure they have even more than that. To my knowledge its free, and if I lived in Brooklyn I would be here all the time!", "author": "Lorenzo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "ARRIVE EARLY!!!\n\nThis place is always packed and it's always a great time. Low light, small seating tables, standing room. There is always an eclectic/artsy/musical performance going on. A great first date place. However things tend to come to a close early...11pm or so...so this is definitely a great way to start a date and finish it with dinner/dancing at a late night hot spot. Love it and plan to go again and again! \n\nmy amaretto sour tasted like someone scooped peanut butter into it...eek... 0_0 ...a very odd flavor...so not sure but just a heads up on that!", "author": "Sherry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "What a beautiful space! The food also happens to be pretty damn good too. I've had everythign on the menu. Drinks are a bit limited and there's nothing particularly special about them. The bar tenders are fast and responsive.\n\nI recommend catching a seat at the bar during a comedy show. You get quick service and a guaranteed view of the show! The seats up front are always taken an hour or two before the starts, which is very annoying. I've been there more than a dozen times and they're always taken.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "Perfect date spot, or place to take visiting family or a group for a chill experience. Get here early Bam Cafee Live-- it's free and Brooklyn.  I've seen many great shows here. Prime people watching. Very interesting crowd. Try a Bamhattan, delicious!\n\nMy boyfriend and I frequent this spot.  It's always a perfect place to have a drink or two while enjoying live music on a Friday or Saturday evening.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Love this place! Beautiful venue, they have great new talents and established singers performing and its freee! Great spot to come by after or before dinner", "author": "Jozi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "GAWD I loved this spot. I'm feeling sad looking at reviews for it, because my soul actually longs to go back.\nI had been working really hard for two days at the BAM Theater, which is on a different floor. After my show was finally over, I got to hang out at the BAM Cafe which had been seducing me all night, with its jazzy sounds escaping through the doors. I think I might have been treated so nicely because I was working there, but I'd like to think the bartenders are that awesome to all the patrons.\nI got a couple strong free drinks, and heard the end of the jazzy/fusiony set. \nThe part I loved so much was the atmosphere. The crowd was completely diverse, and everyone had their own sense of style. All kinds of great styles. People were having such a good time, laughing, talking and digging the music.\nThe room is beautiful. You could hold events in this room. I felt like it captured the feeling of hip Brooklyn. It's hard for me to put in to words, but the BAM Cafe seriously made me want to move to NY more than I ever have.", "author": "Leanne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Went on a Fri night for free peformsnce that started at 9. We got there at 8:40 and there was standing  room only. Nice crowd. Looked like the majority come after week. Ambiance is really nice. Only had a glass of wine for $9. Would return. Oh parking was hard to get I guess because the Barclay's center  isn't too far away.", "author": "Jacqueline G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "I went here last night (Saturday) for a free poetry and music show. This was my first time here and I loved it! The cafe is so pretty.  And it was FREE!!! The show was very good. Great singers and nice, entertaining poetry. It was cool because they mixed the singer/band/dancers and poetry together. Yes the show had all those elements and they were good! \n\nI gave it four stars because its kind of impossible to get a table. You would probably have to get there like 2 hours in advance if you want a table. We were lucky enough to get 2 good spots at the bar. But I really wish they would do reservations for shows because standing would totally suck. womp.\n\nI also ordered food. The pizza. It was okay. My fiance ordered a drink, bourbon and ginger, for $8.00. She liked it considering she ordered 2.\n\nAnywho, I really liked the crowd and the free entertainment! I def recommend checking out BAM Cafe happy hour and music. It's really NICE! and I will be back for many more shows!!", "author": "Vanessa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-21", "description": "One of the most stunningly beautiful spots where to have a drink in NYC.\n\nVery spacious, with barrel-like ceilings as high as a cathedral, with beautiful lighting[1], I never fail to stop at BAM Cafe before a performance at BAM, and I never fail to be impressed by this place. I also come here occasionally to listen to live music and DJ shows.\n\nLast time I came here the bartenders managed to reconcile me with the art of making a good cocktail[2]: my BAMhattan was nice and dry the way I like it, and my gf had a jalapeno margarita that was one of the best spicy cocktails this side of the East River[3].\n\nThe only minus point was that that night there was no music on, which was a bit odd...\n\nThis would also be a fantastic space for a private event.\n-----------------------------------------------------------------------------\n[1] http://www.h3hc.com/index.php?p=h3\u0026flashid=2282\n[2] see my review of The Vanderbilt... http://www.yelp.com/biz/the-vanderbilt-brooklyn\n[3] Kampuchea makes a phenomenal spicy cocktail with Cambodian katiev called Bon Om Tuk.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "One of the few places in this city, where cheapies can go and listen to live music for free :)\nNo, seriously - there's no cover to get in and to be entertained by young local musicians on some friday and saturday nights. Bravo!\nBut if you want to grab a drink or two after the show and your belly is more important for you than live music, BAM Cafe's bar has really poor beer and wine selection and there are much, MUCH BETTER places around...", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "Like coming here. It's a sophisticatedly and creatively decorated; dining and theater viewing  makes sense all together. Perfect venue to hang out and meet friends.", "author": "Ma-e M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-15", "description": "I love this venue. So spacious, beautiful, nice tall ceilings with beautiful lights. But what I am still salivating over is their kick-ass jalapeno margarita. Its a little spicy and all margarita ;-) MR had a BAMhattan and that was made very well too! When we went, it was almost 7:30 and there wasn't anyone playing, and the cafe just seems a bit weird without music. Bring on the music! \nI will go back just to have a few more jalapeno margaritas!! The best ever!!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "DJ IDLEMIND is the BEST!!!!!  He is the reason for the five stars.  BEST BEST BEST!!!  Seriously, it's almost sinful that you can catch him spinning for FREE on any given Friday night at the BAM cafe.  Makes me proud to be a member of BAM. \n\nThe cafe is spacious, modern, cool and is always filled with a diverse, fun crowd.  It is the kind of place that restores my love for Brooklyn (when everything else seems to be changing into an unfamiliar place). Some of the acts are a little strange, but always talented and entertaining enough.  Other acts are simply top-notch, and again, shockingly free.  It's a great place to go after or before a movie, on a date, or with tourists who want to see a little slice of Brooklyn. \n\nThe menu is limited  - bar menu - but everything is delicious. Specialty drinks are also very tasty. Great service.  My only tip: get there early if you want a seat.", "author": "Vered R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "I went for a Valentine's day date to see Mo Beasley perform spoken word. We arrive at around 7:30 for the happy hour. Great deals on the food and the drinks, though the quality of the food is nothing to write home about. It started to get more crowded towards 8:30 or so. \n\nIf you want to get seating for the \"free performance\" nights, I would recommend getting there around 8, though if you want to make use of the happy hour specials as well, a bit earlier would be great.", "author": "Sushil R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-16", "description": "Went for the live music and really loved the group that performed.  The DJ that kept us entertained before the performance was awesome.  He played \"old school house, club/lounge mixed with \"old school rap/r\u0026b.  My boyfriend and I had red wine, spicy curried lentil dip, marinated olives, and the cheese plate.  The lentil dip was really seasoned well (cumin coriander, \u0026 curry).  The olives were plentiful for $5.  The cheese plate was lacking (I shouldn't be eating cheese - so that is exactly \"what I get\").  Had a brief interaction with the \"manager\"-dude who was behind the bar and then announced the band.  He was super rude and \"important\".  Very funny since it is \"BAM\".  Won't run back anytime soon, however will go back for the music at some point!", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "Beautiful venue that slightly reminds me of Moulin Rouge. The space is separated with a small stage, chairs and table section, and then a bar in the back. There's also a small alcove to the side but I believe you have to book that private area. I like how the space includes some rotating artwork and the space is just big enough so you can bring a few friends with you but still intimate enough so that you can enjoy the performance on stage. I wish it wasn't just on the weekends and that they closed relatively early...I believe we were kicked out around 10:30/11pm, but otherwise, a great venue with a diverse program.", "author": "Wilkie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "BAM Cafe is awesome. The venue is huge and beautiful, and the free live music nights are fantastic.", "author": "Maria B."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "BAMCafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave\nBAM's Building Lepercq Space at Peter Jay Sharp Building", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EdIfeK3c_TOSH7VA1Imx8w/ls.jpg", "@type": "Restaurant", "telephone": "+17186237811"}