{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "I adore the BAM Cafe.  I ended up there one night with a male friend, when the movie we were planning to see at the BAM Rose Cinema was sold out.  We started our night here, before making our way to Bembe for some dancing.\n\nThe bartender was so friendly; he made us drink after drink.  My companion, very much a man's-man was not the slightest bit shy about sucking down several Malibu Sunrises (bartender's suggestion.) He said they were delicious--the best mixed drink he's had, if I recall correctly!  I was amused.  We relaxed here for several hours.  It is a very beautiful, minimal, wide open space.  I'll be back, as I live close by; never got to try their food, but I shall, soon.\n\nThey have some wonderfully chill musicians perform here on Friday and Saturday evenings; reason number 4580439539 to come back.  I'm open if someone wants to take me on a date :)", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "I loved this place.  I actually came out to see the Nutcracker performed by the American Ballet Theater - which was truly awesome and I highly recommend it.  So for BAMCafe - we had dinner here and it was lovely....the food was actually rather delicious and the ambiance was rather nice - it's not like a 5 star restaurant b/c the tables and chairs are metal and plastic - but the service was great and the food is pretty close to what you'd get at a 4 start restaurant.  It's super convenient if you're catching a meal before a show at the Opera house.  Also after the ballet I noticed lots of people in BAM Cafe enjoying live music!  Definitely a place I'd go back to on a regular night just to chill and listen to live music.", "author": "A.V. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "went here from 6-8 PM on friday after work downtown with a date. we both loved it\n\n3$ beers and 5$ wells\n\nbig nice area to sit down and listen to a free show on friday - i plan on incorporating this in my friday routine!", "author": "Joe N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-09", "description": "Best thing to do on a Friday night in a long time ! So much fun, great atmosphere, great people, great music - great everything ! Can't wait to come back next Friday night !", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-10", "description": "Upstairs, airy and calming..   beautiful arched windows..  relaxed boho atmosphere...  and what?   yes..   there is a very groovy bookstore with nearly any kind of book you would need for your hipster collection.. \n\npoetry, architecture, taschen books on design...  novels..  non fix...\n\nenjoy..  take your time..", "author": "greg j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "I've been to BAM quite a few times, but this visit was actually the first time I spent time in the cafe. We arrived quite early for our show, after running around shopping with family all day, so sitting down for a drink seemed to be the thing to do. \nFirstly, this place is just beautiful. The soaring ceiling and sparkling lights bring to mind a modernist cathedral to art and culture.\nWe were early enough that we had our pick of tables... they have free performances there on the weekends, which means that later it really fills up. No live music while we were there, but they managed a holiday-themed playlist which was actually enjoyable and inoffensive - a hard thing to accomplish!\nMy dad and I just opted for glasses of wine, which were good. My mom decided to get the seared scallop appetizer, which was both tiny and pricy, but was absolutely delicious. \nI'll have to check out the schedule of upcoming performances to see if there's anything I'd like to see.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "It's hard to dislike the BAM - they do everything well, including happy hour! $5 cocktails, $3 beers, $5 appetizers on Friday and Saturday evenings w/ free live music afterwards. My boyfriend and I were here for the start of the Si Cuba festival on a Friday night.  The food was good, the drinks were great, and the venue was fantastic!  \n\nGet there early, as it can get pretty crowded.  As we were leaving (around 11pm), there was a line out the door to get into the Cafe.  It gets packed out with the eclectic crowd that makes Brooklyn famous. The kind of crowd that gets on their feet and gets to dancing because music is hot and the bartenders have been making stiff drinks all night.  The kind of crowd that supports local businesses, local artists, and the local community while having a great time.\n\nThe crowd, the vibe, the venue, the free show, and (of course) the happy hour make the BAM cafe a great place to spend Friday and Saturday nights.", "author": "L. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "BAM is right, went to this place a few weekends back, it was a great time out, had a lot of fun and will probably go again!", "author": "Katherine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "We came for the Si Cuba! latin jazz show. It was beyond amazing. The energy is great and the staff is very helpful and accommodating. My boyfriend and I came with a few bags from shopping and they told us they'd hold it for us while we went to dance salsa!", "author": "Lit X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "Have been to this really beautiful space a couple of times. Sort of industrial armory meets art gallery. The only reason to come here is for the scene and free live music on friday and saturday nights. The quality of the music is touch and go and the vodka and sodas are borderline gross. But it's a cool place to go for a couple of drinks, especially if you're seeing some thing at BAM.", "author": "Nathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "Always a good time at the BAM Cafe. Great atmosphere, great music at times and the staff is very friendly. Food isn't bad either; pulled pork sliders are on the money. Come here on a Friday night and you may just see me posted by the bar.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "Great date spot. Unfortunately we came too late and had to stand. Should have listened to my fellow yelpers. The performances were great for the night we went. NOT a fan of the jalapeno margarita", "author": "Lucinda K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "An absolutely beautiful space with a great-looking bar and plenty of tables.  Only complaint is once the music starts it's so loud you are really forced to only listen or attempt to shout over the music to continue the conversation with your friends.  Before the live music started, my friends and I were having a great time drinking some tasty drinks and chatting, but were forced to leave once the music kicked in and we felt uncomfortable shouting over it (as most everyone else was silently listening - it was good, just not what we wanted that night - and we didn't want to be obnoxious with our conversation).  Still though, a sight to see and recommended for at least one visit.", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Gorgeous place with free live music every friday and saturday nights. Get there an hour before the band starts because you are going to want a seat and it tends to fill up pretty fast. There is a bar where you can get your drink on. I didn't know they had appetizers... next time I have to check that out. Definitely add this place to your list - check out who is performing from their website, and sometimes they even have a clip of their music. Love it!", "author": "Jenna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "I love stopping in BAM Cafe on a Friday or Saturday night. It's a cool place to start or end your evening. I love the variety of live acts and the fact that regardless of genre, they're all very good! This is a great place to people watch and chill out. Plus while there you can check out the galleries. And best of all, it's all free! BAM is such a breath of fresh air in BK!", "author": "Ola F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-25", "description": "Came here on May 16th for BROOKLYN UNCORKED.  What an awesome event.  The venue was perfect.  A bunch of wineries from Long Island came together to showcase their wines.  But we experienced more than just the vino...  They had oysters from Long Island (Widow's Hole) and cheeses from Whole Foods.  Oysters were outstanding!  They even had an ice cream/sorbet bar that served wine flavors.  Some yummy finds include:  Corey Creek's Rose, Osprey's Dominion 2002 Reserve Merlot, and the Roanoke 2006 Chardonnay.", "author": "KC L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "whenever i'm planning out my weekend, i always forget that BAM is a viable option ... a kick-ass convenient one since it's only a 15 min walk away from my apartment.\n\ni went here on a date - first one! - with this guy last year. he lived in the BK too, and since i'm used to hanging out downtown on the weekends, he was trying to introduce me to cool things going on in the 'hood which i gotta give him props for because it's pretty thoughtful.\n\nwe were a bit early and i remember having trouble finding the escalator that went upstairs to the cafe. i THINK it only started working when it was close to showtime, but don't quote me because the memory's kinda fuzzy. \n\ni definitely don't know the name of the singer, but her music was soulful, R\u0026Bish and catered to the laid-back, yet packed audience. methinks that she's a local performer who had a strong following in the BK. i totally understood why. \n\nsince admission was free, the only thing we paid for were stiff drinks - hence, this a great recession-friendly way to spend a night with good company. because funemployment has made me into THE recessionista, i'll be back. soon.", "author": "Aimee O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-07", "description": "At the top of an escalator from the ornate lobby of the Brooklyn Academy of Music, which also houses the BAM Rose Cinemas, you'll find this gorgeous, spacious restaurant -- the perfect place to dine before the show or have a drink afterwards.   The food I've tried there has been really excellent and quite fancy.  I seem to remember an outstanding fish dinner and incredible dessert.  There's also live music on Friday and Saturday nights and a Gospel Brunch on Sundays.  I've performed here, and it's one of the most beautiful spaces to play or catch a live act in the city.  Admission is always free, with a $10 minimum at tables.", "author": "Paula H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "I love BAM and I love the BAM Cafe.  It's a great spot worth checking out.  As other users have said it's just stunning and the free shows - fantastic!", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-24", "description": "Once again the BAM almost hit the mark. I ate here once before the Merce Cunningham \"dance\" (which I can't really review because I couldn't get away from it fast enough and left during intermission.)\nBut for the cafe'... I had gone out with the intentions of having a nice meal and show at a respected arts organization in new york city. Unfortunately, BAM could not deliver. When I arrived they had lost my reservations, but managed to pull a table together after about 20 minutes. They have an extremely limited and unimaginative menu and the waiter informed me they were out of 2 of the 5 entrees and 3 of the appetizers, I ordered the half roast chicken and they brought me two steamed chicken breasts, when I asked the waiter about it he told me that it was a better cut of meat and I should be grateful. later the manager came over and asked how everything was and I told him not great he attempted to improve the situation by brining us the cheese plate which consisted of a few pieces of over ripe fruit and stale cheeses. The dinner was expensive and of poor quality.\nThe only redeeming quality of the experience was the actual space the cafe' is in, the building is very pretty, but you can enjoy that for free by walking past it on your way to anywhere else for dinner.\nI am not normally this harsh about a place but BAM is supposed to be a cultural hub for Brooklyn but it seems to me that their director perhaps has not yet seen good theatre or eaten good food, but has constructed an organization based on the description of such things.", "author": "Patrick W."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "BAMCafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave\nBAM's Building Lepercq Space at Peter Jay Sharp Building", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EdIfeK3c_TOSH7VA1Imx8w/ls.jpg", "@type": "Restaurant", "telephone": "+17186237811"}