{"aggregateRating": {"reviewCount": 59, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Healthu, tasty, convenient location!\n\nI will definitely visit again when I'm in the neighborhood.", "author": "Gaby L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-10", "description": "Stopped by earlier for lunch today, and I really don't know what to think.\nIt wasn't that packed, which was great because I was in and out within 5 minutes. \n\nI placed an order for the beef bulgogi bowl, and it smelled amazing! Looked great, and the sauces were flavorful!\n\nI brought it back to the office, and I realized the beef bulgogi had a lot of fat on it.... I stopped eating at one point because I kept cutting the fat off and it got tiring.\n\nI think this is a cool place to try at least once.", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "Came in as a first time customer with a friend and was greeted by Gray. We told him we weren't sure what to get and he gladly offered us some suggestions/combinations we should try with great energy. After we decided on what to eat, Gray took care of the base and protein. We approached Danelle and she helped us with the sides and sauces. \n\nI had the Purple Rice (Base), Bulgogi Steak (Protein), Roasted Corn, Blue Potato Salad, Pico De Gallo (Sides) with Korilla and Green Crack Sauce\n\nOverall the food and atmosphere was great I'd definitely suggest this place to my peers. Amazing hospitality, I had to ask for the employees names before I left the door. Thanks again Gray and Danelle!", "author": "Nagi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "There are a couple of lunch options available at Metrotech, but I believe Korilla is the tastiest one. It combines the ease of customization à la Chipotle, the heartiness of Five Guys, and relatively healthy options like Bigeye Sushi. The lines move very quickly and there's usually seating available, despite the small space. Of all the protein options I've tried, I would recommend the gojuchang pork-- it's addictively sweet and spicy especially paired with their mild and smoky Korilla sauce. I miss the easy accessibility of their East Village location, but this Metrotech location is relatively easy to get to as well via Jay Street-Metrotech (A/C/F/R).", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "I randomly walked into this place on a Sunday and was pleasantly surprised. Fortunately for me, Korilla was pretty empty at the time of my visit. All I have to say is that this place is great. First, they really load you up with food with a low price tag of $11 (you really cannot beat that). My dish had enough food for two separate feeding . . . although I ate it all in one sitting. The restaurant, with the assembly line style of food preparation, reminds me a bit of Chipotle. Maybe Chipotle was on my mind because there is one a few storefronts down. \n\nI would highly recommend going for the spicy pork, the bacon rice, and the Korilla sauce. Actually, I can only recommend it because that is what I had during my visit; I'm sure the other selections are just as tasty. \n\nAlthough I dined here on a Sunday, I would image that this place would be quite packed on weekdays. There is seating at Korilla, but it gives me more of take-out vibe because the seating arrangement looks a bit awkward.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "After having Korilla in BK bookmarked for some time now, we made this the 1st stop of our food crawl a couple of weeks ago. I was a little disappointed at the 3.5-star rating on Yelp but decided I needed to check it out for myself anyway. And boy am I glad I did!\n\nFor those who have never heard of Korilla, think \"Korean food truck meets Chipotle\". I ordered a Salad bowl w. bulgogi, roasted corn, blue potato salad, \u0026 red kimchi and topped with Korilla sauce and Korean Hot Sauce. The flavors were quote nice and I liked the variety of items that this bowl was comprised of. The bulgogi itself was tender and all the ingredients were of good quality. The portion size was pretty good, and our server was very nice and made good suggestions when I asked her what I should include in the bowl.\n\n\nThe price itself was more than fair for what you get and there is seating around a large table in the middle of the place. Unfortunately, unlike other neighboring eateries, there was no outdoor seating available, but the table inside easily accommodate our party of 7 adults + 5 kids.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Omg, I discovered this place by word of mouth.\nThe inside is not so welcoming to sit and eat there.\n\nIt's more like a pick and go type of place.\n\nYou can create your own bowl or go by their recommendation. Usually meat or tofu, wild rice or kale, kimchee, purple potato, pickles with your choice of sauce.\n\nDrinks are pretty good: matcha latte is one of them.\n\nIf you are in the downtown Brooklyn area, check this place out. Price averages $10", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "*Rating is rounded up from 3.5\n\nI've heard about Korilla before, but never tried it. I wandered around the area and decided to eat here for lunch one day. It is basically Korean chipotle, but with fewer toppings to choose. You are limited to only 3 toppings here, but it was filling enough for me.\n\nI ordered white rice with bulgogi, roasted corn, blue potato salad, red kimchi, and Korilla sauce. Bulgogi was nice but wished it was warmer and came in a bigger serving. The corn was just regular corn, nothing too special but I love corn with rice bowls so it was nice to have as an option. The kimchi was authentic, more acidic than I would normally prefer. But it was good and spicy! Lastly, the blue potato salad was the highlight of my meal. I don't even know where the BLUE in my potato salad came from (blue potatoes perhaps?), but it was SO good. It was creamy, a little sweet, and the small chunks of potato added the perfect texture.\n\nI would say Korilla at this location probably isn't as high quality as their other locations only because it is kind of a campus dining establishment. The meat definitely could be fresher and have bigger portions for the price ($11), but it's next to a college, so it's expected. Seating here is a little awkward since it's more of a to-go kind of place. It's a smaller place so you could be eating in front of someone you don't know, or facing the workers.", "author": "Sammi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-09", "description": "This is my first time eating Korean BBQ, so I was unsure of what to expect at first. Upon entering the restaurant, I was impressed with their decor as well as the cafeteria style service. It is very similar to that of Chipotle. \n\nI had a bowl with Bacon Kimchi Fried Rice, Ginger Soy Chicken, Pico de Gallo, Blue Potato Salad (this was different for sure), and the Red Kimchi. \n\nI would definitely return here, however it is not a restaurant I would be able to eat at regularly. Korilla is a place that is a nice change of pace and scenery.", "author": "Dom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "I love Korean food and the food here is good. I used to order from the food truck that they had and now they opened up around my job. Had a salad bowl and it was good", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "Picture does not do this place justice, but Peter (he's the best) made this piece of art up there!! I adore Korilla, their food and staff and was the obnoxious customer when they were a truck, stalking their twitter to see when they would be near Metrotech next. We are so damn lucky they are now just downstairs! A gem for city employees and students alike!", "author": "Frances A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "Someone that eats korean food everyday I thought this place was going to be catered for the American crowd but I was wrong. It was surprisingly solid and the the spicy pork was really tasty. I am deducting a star because they could have put more meat inside the bowl. 10.50 for lunch and for the area you're in, that's a pretty good deal. It's right by a chipotle and instead of waiting on Chipotle's line for an hour just go here, there wasn't a line when I came.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "Again, Asians making food amazing! Taking the bland American chipotle style and elevating it to Asian level. Super gourmet ingredients, great space, employees etc. why can't all American restaurants be Asian level?", "author": "Marcus G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "I came to Korilla BBQ for lunch on a weekday during my internship training at the nearby Chase Metrotech building. The line was pretty long, but my friends and I were in and out of the store within 15 minutes.\n\nI ordered a salad bowl with gochujang pork, and my 3 sides were red kimchi, blue potato salad (so unique and delicious, but seasonal) and baby bok choy. I requested the K'lla sauce (the one they advertise as their spiciest) to be lightly drizzled on top of everything. First of all, I do not recommend getting a salad bowl - I don't think the heaviness of the ingredients complements salad well - if you're going to Korilla in the first place, go all out, forget about carb-counting and order the rice bowl. The spicy meat options go much, much better with rice than a few leafy greens - I probably would have enjoyed my lunch more. \n\nIt might have been my fault ordering literally the spiciest things on the menu, but this place would probably be a \"treat myself\" type of place, one I wouldn't frequent. Everything is just a little bit too heavy and dare I say, too flavorful! Which is a good problem to have if I'm eating by myself and starving, but probably not the best option for a weekday work lunch. This is definitely not a place I would recommend grabbing lunch, the ingredients are messy and are difficult to eat elegantly. In addition, the smells of the food itself are quite pungent, and the garlicky taste lingers in your mouth for about 3-4 hours after. Nonetheless, I cannot deny that the food is objectively tasty, deliciously spicy, and portion sizes are massive.", "author": "Claire L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-17", "description": "Best veggie dumplings in the area and great price! Their killa sauce is too good. I wish they would introduce tofu bao buns for the vegetarians.", "author": "Jayanti G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "I love this korilla. The employees are very courteous and they play the BEST music here. Lit ass korilla", "author": "Katherine Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "Fun, energetic lunch spot.\n\nYou can create your own bowl or get a burrito. Solid portion sizes compared to other restaurants who do the \"build your bowl\" style.\n\nI ordered the sticky rice bowl with spicy pork, kale, corn and beets. Great combinations of flavors. Pork seems to be a popular protein here, so I went with the crowd and was pleasantly delighted. Seasoned well for a fast food place.\n\nPrice is fair for what you get and the staff is friendly, upbeat and kind.\n\nWill be back to try some of their other options.", "author": "Whitney L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Just had this for the first time because I wanted to try something new  before class and it was pretty good, when did this place open?!? I had Korilla BBQ food truck book marked for the longest but never got a chance to try it and I am glad that there's a new variety around city tech. I got the purple rice with ribeye and purple potato salad with kale and cucumber kimchi, the potion was a little small for $11 but it was good overall and I really enjoyed the green crack sauce.", "author": "Annie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Korrilla BBQ food truck use to come bi weekly to Metro Tech Center and I was beyond impressed.  Once they opened this permanent location I've raved about it to all my co-workers.  \n\nThe ribeye is easily my favroite protien option.  With delicious sides like red kimchi, corn, black beans, pico de gallo, and pickled peppers there are enough options for everyone!  My vegetarian friend always gets the tofu which also looks delicious.  \n\nThis is definitely worth a try as it's an inexpensive lunch!", "author": "Joe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "NOT like korean bbq! Similar flavors. The staff is very friendly and patient. Meat was not hot - barely warm. Beans were nice n hot! Corn \u0026 purple yam ok,... sauces good. I'd return if I Really craved bulgogi....but will probably go to Ktown instead.\n\nRepeat- Staff was awesome!", "author": "VioletL P."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "Korilla BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr\nMetrotech Campus", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/R54brDgHUA4Ld4nia4PUvw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091297"}