{"aggregateRating": {"reviewCount": 59, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Really great twist on Korean food. Really cute atmosphere for a quick, casual meal. Something I can eat everyday. Love the to-go dessert and teas as well. \n\nMy new go-to!", "author": "Nari L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Great to see Korilla grow from their food-truck to another brick and mortar location. The location is hidden off of Jay Street in Downtown Brooklyn.  Nice new joint serving the typical Korilla fare.  The employees are pleasant and the food is great and up to par with the other locations.  \n\nMany vegan and gluten free options.  Welcome to the neighborhood!", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "I wasn't going to write this review but I do not like the way the office handled it. TIP was added to my bill without consent. The clerk rang me up at $10.50, I signed, he flipped the screen to himself after. Little did I know, He added a $2.62 Tip without my permission. I saw it on my card transaction.  I emailed the main office about this, and they refunded the tip but they were very unprofessional in their responses. I don't even know if it will be addressed with the staff! What a joke; what a waste of my time..... and the food was good. So sad. Check ur bill!", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Essentially Korean BBQ served Chipotle style. I enjoyed it very much. \n\nFood was great but selection felt slightly limited; not a hindrance though. I'm not originally from NYC, but read it used to be a food truck. If you're into Korean BBQ, I definitely recommend for lunch.", "author": "Eric V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "This place can't have 4 stars. It's a sad attempt at both Korean food and healthy food, it achieves neither. The tofu has no texture and is covered in some tasteless sauce. All the vegetable sides were bland or weirdly flavored. Nothing tasted really fresh, though that's clearly the vibe they're going for. You're really better off just going to Hale and Hearth or even Chipotle down the street, if you're looking for a healthy fresh option. Don't go here.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "Okay, this place was not good. For one, the staff was unfriendly and unhelpful. This was my first time going, and I had a couple questions about how it works and the different sides. Instead, they gave me sides I didn't even ask for, and when I asked for the side I actually wanted, they charged me extra. The flavors were totally off - the \"ginger soy chicken\" was off-color and not really gingery or soy flavored. I can't really describe it, but it just looked purplish-brown and tasted simply bad. They also barely added any kale to the bowl and the whole thing was a gross luke warm. \n\nI'm usually a kind reviewer on Yelp, but if I could get my money back from Korilla, I would.", "author": "L F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "I tried twice and it looks like super fancy in the plate but not for the taste. I don't like spicy food and it was too spicy for me. Good size dishes with correct price. The meat was good but I was not a fan of the side veggies. Maybe not the best person to rate this place.", "author": "Steve A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "One of the best places to eat in that neighborhood. The food is fresh and there are a lot of options. I had a pork combo for 11 dollars. It is well worth the money. The only facet they could improve on is the hotness of the food. Korean BBQ should be spicy. Make it more spicy! They also let me use the bathroom later on that night. I am going again when I hit up that neighborhood.", "author": "Tommy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "I really wanted to like Korilla because they just opened close to my work, and hey, everyone wants a fun new weekly lunch spot, right? Unfortunately I don't think Korilla will fit that bill for me. I actually quite like Korean food. I like Mexican food. I like quick service establishments like this, so I knew what to expect and what not to expect (i.e., fine dining). On paper, Korilla seems perfect...but it's just okay. The people working the evening shift seemed bewildered by my order, like each topping I requested was a hassle to add to my meal, and could not tell me which sauce was made with gochujang (which I think is a fair question, given it's billed as Korean fusion food???) when I asked. TLDR; the service wasn't great, which is fine, I wasn't expecting it to be stellar.\nThe problem is the food didn't make up for it. The rice was cold (which was unexpected, and as a result, unpleasant), the purple yams were cold (to be clear, they're meant to be cold, they were just unappetizing that way), and the chicken was hot, but the flavor wasn't bold enough to save the dish. The sauces were just okay. Also there isn't a soda fountain for water, so you are required to buy a drink (you need one to wash down all that cold purple yam mush). I give Korilla 3 stars because they sell La Croix (kidding...sort of) and the portions are huge, which almost makes up for the mediocre experience.", "author": "Hayley T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "The food is good if you are into Korean-style cuisine (spicy, sweet, and garlicky Kimchi tastes). My only complaint is that the sitting arrangement is really awkward. There is one giant table in the center, right in the middle of where the line forms. The setup makes it more of a take-out place than a sit-down-and-relax type of restaurant.", "author": "Bella L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "This is my favorite go-to spot when I'm around the area. Delicious food, personal customer service and excellent management. I really like the different sauces that go with all the meals. It's also a big plus having a fresh and healthy choice around the area.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "So good! I've had the bowl with sticky rice, beef bulgogi, kale, corn and bean sprouts with the green crack sauce - best combo ever. The beef and sprouts are the standout. It's kind of like a chipotle but for Korean BBQ. Get in and get out quick, so it's a great lunch option for those of us working in the area. Hardly ever finish the whole thing in one sitting, very filling!", "author": "Meghan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "This is a recently new place and since I was in the area, I wanted to give it a try. I ordered their rib-eye along with potato salad, black beans, and kale for veggies, with a base of wild rice(which means a mix of white and brown), and it was all topped off with their vegetable sauce. The service was good but their food was the opposite. The potato salad was tasteless and ruined the meal. Overall, very underwhelming.", "author": "Jeeper K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "Fast, good, perfect for a quick meal. Only thing I'd say is I wish it'd be a touch cheaper. Try the purple yams and chicken, green sauce also amazing.", "author": "Michael Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Super friendly staff (rare for this area)! Great chipotle-style Korean bowls. This is a solid lunch spot and welcome addition to the MetroTech plaza. Another great example of a food truck turned into a store front, assuredly due to demand? The only thing I'd say to skip is the $3 honey ginger tea. Too sweet and ginger-y, if that is a word. \n\nI had the chicken bowl with purple rice (funky yet tasty), black beans, kale, cucumber, and corn.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Came here for my first ever korean food.... it was amazing! I was a little scared, but i trusted my homie who recommended it. It was fresh, spicy and really interesting.", "author": "Kenneth W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "I love this place... the best closing dynamic duo is Chris and Brandel. They are so kind,attentive , respectful and caring. They understand my late night taste buds!!! They are very knowledgeable about the restaurant/food service business. The owner is lucky to have them!!! CHRIS AND BRANDEL need a PROMOTION. They always go far beyond what is required to make the customer feel welcome. Keep it up gentlemen... you guys are putting the soul back in Korilla!!!", "author": "Piper A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "I used to be a regular customer at the East Village location and had absolutely nothing to complain about as the food and service was wonderful. I've been to this location twice now and the service seems very inconsistent. The first visit was average, but the second visit the service was very sub-par. I received a significantly smaller portion and the presentation was very hodgepodge. The kimchi was soggy and far below the kimchi I've been served at Korilla in the past.", "author": "Stephen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "This is a great place for exactly what type of place it is - fast casual - lunch or dinner.  I've always been a fan of their food from the food truck to the East Village and other locations. Their flavors are great and it's a really nice change to have a new hearty, healthy and super flavorful lunch option in the area.  And for dinner - it's a great place when you want something that feels like dinner but quick.  I read some reviews that the price is a tad high but I think that's only b/c of the quality ingredients they use and most of their toppings have a recipe involved, not just a plain vegetable or other.  5 stars from me - I'm a fan of all of the proteins but I like the chicken with most of the veggie and kimchi sides on a salad bowl when I'm trying to be healthier.  I am totally rooting for this place - nice to have a Korean option in Downtown Brooklyn!", "author": "Amy Y."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "Korilla BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr\nMetrotech Campus", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/R54brDgHUA4Ld4nia4PUvw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091297"}