{"aggregateRating": {"reviewCount": 59, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "I honestly liked the food truck a lot better when it made it's visits every Thursdays. I'm happy for them that they have a storefront in Downtown Brooklyn so they can serve their customers not only just Thursdays.\n\nI usually get the bowl with spicy pork. The serving was less than usual for the protein. Upon asking for more, I was told extra protein costed extra. I said never mind. Beans is now one of the sides to choose from which was also really odd as other Chipotle like style restaurants (example Domo Tacos down the block) comes with a selection of beans.\n\nOverall I found the layout puzzling and others who were ordering for the first time found it really confusing to even place their order. It's a nice setup, but it's ehh...", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "The staff here were really nice and the space was very clean, but I was disappointed with my meal. This korilla spot just opened up in downtown Brooklyn next to chipotle and five guys. The concept is much like Chipotle's but with a Korean twist. You choose your base, protein (which is a little greasy), three toppings and sauce. One of my critiques is that there are only a few choices of toppings and they are all quite similar. \n\nThe portions are huge and the food is cooked in a lot of oil and there seems to be a lot of sugar in the sauces that are coating a lot of the toppings. This is definitely not the place to go if you want a healthier lunch option. Even though I got a kale base with chicken and all veggie toppings I still felt like I had just eaten a burger !!", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "This spot is extremely close to my office and is a wonderful location for a quick and delicious lunch meal. I am a big fan of their tofu, kimchi and signature Korilla sauce.", "author": "Jeremiah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Food truck turned store front in downtown Brooklyn and right across from my job is a win win. Been there a few times and loved all the times I tried it. There is not much of a option but everything is top notch so that's ok in my book. They serve the food chipotle style and you choose bowl or burrito. Next you choose which rice and I go with the sticky rice - next is the meat option and ask for double meat for $2 more. I have tried the spicy pork and the bulgogi and both where seasoned perfectly. Next is the sides and I get kimchi , kale and pickled spicy cucumbers. Next up is the sauces and I say skip the yummy korilla sauce and go for the even tastier korilla crack sauce. Spicy goodness in liquid form.", "author": "Nick C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "Noob alert : OK so I finally went in and ordered. I shouldn't have waited so long. I was greeted very warmly and all the dishes were explained since I had no clue what to order.\nSticky rice with bulgogi beef /spicy corn and purple sweet potatoes and a cucumber dish that rocked. All topped with korilla sauce.\nAll I can say is I wish I had more. I'll be back for sure. Can't wait to try other stuff.", "author": "Pat W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "Korilla provides for a satisfying lunch in Metrotech. For 11 dollars, you get a hefty portion of meat, carbs, and veggies. I opted for the bowl with half rice half salad, bulgogi, kimchi, purple potato salad, and corn. Simple and delicious. The sauces are also a good addition but I suggest getting them on the side to keep the meal from being too salty.", "author": "Eddie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "The owner couldn't have been nicer when I said I had a problem with an order placed a few days ago. Not only did he refund my original purchase, but also insisted on giving me a complimentary meal. It was delicious and I'll be back.  Highly recommended.   Outstanding customer service, way beyond expectations.", "author": "Elyce R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Korilla BBQ is a welcomed addition to the metrotech center. The food there is great--spicy, savory, sweet and chocked full of flavor for around a $9-$13 price point. \nThe k'lla sauce there is smoky and delicious and really addictive and a great addition to the bowls. I've learned that you can ask for multiple sauces so you can get the delicious k'lla and get one of the spicy sauces as well to kick things up a notch if you enjoy spice. \nAnother favorite of mine from there are the beans, they are sweet and super delicious so I always pick those as a side. They also go really well with all the sauces. \nIf you're in the mood for a drink the cold brew coffee was pretty good--it tasted like coffee mixed with an Oreo. It had some sort of gritty texture at the bottom but it just tasted like crushed up Oreo so I was okay with it.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "So this is really a 4 star for the taste of the food but the service is very sketchy so 3 stars for overall experience.\nI went in a bit skeptical since my coworker told me the prices are on the higher end. It took a while for me to get used to the menu and the way it's displayed. So the prices for building your own bowl are not clearly displayed, however the pre-designed bowls have prices.\nThe server was quick to give me a sampling of the proteins. The beef was by far the tastiest but also $11 when you build your own bowl with it as your choice protein. The chicken wasn't sweet but it was a little under seasoned but enough to not get under your skin. The pork was on the sour end and definitely not my portion. So I was caught between the beef and the chicken and the server was gradually aggressively encouraging me to get the beef although I said I've had too much beef recently. So he said ok I'll give you a little, I took that as a kind gesture of him offering me a little beef as I decided what protein I wanted but immediately after he went ahead to the toppings. So I essentially paid full price for half the portion of beef. \nI do have to say I enjoyed the meal, although feeling scammed, I got the purple rice which is a must(it's a sticky rice that adds the best texture overall), I also got the corn and beans and kale( kale was perfectly dressed in a light sweet dressing)\nTo balance the flavors you should probably get a sweet sauce if you get the chicken but I got the green crack which was perfectly creamy and balanced the sweetness in my food.", "author": "Achiaa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "A good fast casual option at Metro Tech. I like that you can mix and match ingredients to custom make your bowl. Everything is tasty and fresh. If you enjoy spice, make sure you try the killa sauce!", "author": "Denise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "This is a convenient plan in the metrotech area. It has a variety of bowls where you select the base such as rice -wild or sticky, greens, kale-greens. Then you select the meat - bulgogi, spicy pork, ginger soy chicken or organic tofu. Then you pick a veggie and a sauce if desired.    Quite filling.  The place is busy during lunch hours", "author": "Mei T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Checked the door - they said it was closing at 10pm. We walked in at 9:25pm and they refused to serve us saying they were closed.\n\nUnacceptable, if the door and the website both say 10pm, you serve food until 10pm.", "author": "Deborah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "My campus is at the same building as Korilla, so it has been my go-to place for lunch between classes. I usually get a combination of wild rice + spicy pork/ bulgogi + kimchi + blue potato salad + corn, and I love it! Sometimes it feels a bit disorganized, like blasting music all of the sudden, other than that this is great.", "author": "Yoon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "** Update\n\nI knew I said that I would never come again, but I was impressed yesterday. So I changed the review to 5 stars.\n\nThey are using rectangular box now, which gives you more food and veggies. None of things I ordered was the same amount as last time. Which made the price more reasonable.\n\nAlso, they are hanging forks, chopsticks and orange tiger bags on the wall now. Very convenient for costumers to reach.", "author": "Sui H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "Service is always excellent and I can't get enough of the Korilla Krack!! I usually get the chicken, black beans with Sticky Rice", "author": "Ericaaa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Good: they have greens. The quantities aren't bad and it's cheap. Servers are working hard and friendly. Atmosphere is nice, if you like medium-loud energetic music. \n\nBad: quality. All the ingredients are just really bland and stale. Even the chicken, which I got fresh out of the oven, was dry and kinda \"off\" if not straight-up turned. Lots of the items have hidden sugar to try to make up for the bad quality. Even the kale came loaded with a sugary sauce, not to mention all the sugary sauces that I turned down.\n\nAnd look, I'm no rice expert. But that's not wild rice, right? That's white rice with purple food coloring and a sprinkle of wild rice. Or maybe that somehow still counts?\n\nIf you want a Korean bowl, go to the Dekalb food hall and get one from Bunsmith. Way better ingredients, only like 2 blocks away. I won't be returning unless they get a new source for their ingredients. Blech.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "​Saw this place on TV before moving to NYC and was excited they were moving into my neighborhood. They have finally opened and the space is really nice, set up to handle a rush (head to the left to start your order and you pay on the right (subway style)). I had a burrito bowl with the purple rice (a blend of sushi, brown, and black rice) a big portion of rice. Bulgogi was my protein, it's shaved ribeye as opposed​ to some places minced version. It was cooked well and had lots of flavor, it is sweet so what out for that if it's​ not your thing. Roasted corn, beans, and pico rounded off the top. Corn actually tasted roasted, beans​ were stewed and tender, and pico tasted fresh and wasn't​​t overwhelming. Topped with signature​ korilla sauce which was almost like​ a spicy mayo if I​ had to compare it to something. Now the korilla sauce mixed with the sweetness from the bulgogi may of tipped the sweetness scale for some. Overall it was great and FAST. 11 bucks wasnt bad. Wish they had some appetizers or something to throw on the side, im just a glutton for sides though.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "This is a delicious alternative to the surrounding fast food spots (Chipotle, Five Guys, hangover pizza etc.). I've been here twice now so have been able to try both the burrito and bowl, and I've previously had food from here when the business was still a truck. Everything's as good as when it was a truck along with better options. For the both the burrito and bowl, I got the beef as protein which was fantastic. I thought that it might've tasted cafeteria-style like Woori Jip based on its look, but the beef was flavorful and great in texture. It should be noted that for the bowl, there are preset options that one can get as opposed to a build your own. I opted for the preset and everything was great from the portion to the taste. I consider myself a bit gluttonous and would disagree with previous reviews saying that this place was stingy. I felt quite full after both my burrito on my first visit, and my bowl on my second visit (seperate days, and a month apart). The staff were also really pleasant, the guy serving me seemed quite jolly and really made sure I knew about the options available. Overall, an excellent option for fast food - I'll definitely retur!", "author": "Rob C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-02", "description": "Just to update, the service quality significantly went down. There was no corn this early noon. Spicy pork tasted odd. I ordered two toppings and wish to keep the third topping the same thing as my second topping. The server lady refused and told me that's all i can have. And they still charge me for regular 3 toppings prices... Probably not gonna go back again. There's much better options around the area", "author": "Eva Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Oh, Korilla - I'm so disappointed in you. I've loved my visits to your Manhattan location on Third Ave. - I've seriously dreamt about those Kimchi fries in between visits to the city!  When I knew we'd be near your new Brooklyn location this weekend, a visit was a must.  \n\nRight off the bat, the first disappointment was the extremely limited menu. No kimchi fries and no wings, despite the fact that those items were being prominently featured on your video board in the restaurant.  My wife and I decided to share a bulgogi burrito, which led to disappointment number two. Our server must have been a brand-new employee, as the other worker had to look over his shoulder to make sure he was assembling our burrito correctly! He was extremely stingy with the ingredients until we politely had to call him out on this. The burrito preparation station itself was messy, with certain toppings almost empty or looking like they had sat for a period of time.  We paid and went outside to enjoy our meal in the pleasant afternoon weather.\n\nThe burrito itself was tasty, especially the bulgogi steak and the cucumber kimchi, until we both began finding overcooked pieces of rice in our teeth. We ended up having to take the burrito apart with a fork and eat it that way to avoid the very hard rice.  This was extremely disappointing given that our previous visits to the Third Avenue location were highlighted by the very fresh food served there. It seems like quality control needs some more attention in this new location.\n\nBottom line - we will definitely return to the Manhattan location, but I don't think I'll be visiting the Brooklyn location again anytime soon.", "author": "Jim D."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "Korilla BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr\nMetrotech Campus", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/R54brDgHUA4Ld4nia4PUvw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091297"}