{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "We originally went to Black Forest restaurant but the service was horrible. Walked next door and it was an awesome e experience with 4 kids and one with allergies. Everyone ate and food was delicious. A life saver!!", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "I live in the Bedstuy area and so I ordered from their new location on Broadway (they don't have an account up yet) so this review is based on that location. \n\nNever walked in here - all based on delivery. I called first to double check that this location was open because again they don't have anything posted online, only via seamless and that's where I ordered from. Anyhow, I placed an order for both the calamari and the rigatoni Bolognese. One of the guys called me to inform me that they were out of Calamari and so I chose their cheese pizza in replacement of that. Although pizza wasn't bad, I was craving Calamari and wish they had that. But it's cool, nobody died. Bolognese wasn't the best I've tried, but it was a generous portion and it did its job. The flavors were somewhat bland but not completely. The entire order just wasn't a \"wow factor\" for me, but still I wasn't all the way disappointed.\n\nThe guy that took care of the call and handled the service was extremely polite and patient. I appreciated his accomodations. \n\nI would try them again and hopefully they have calamari next time.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "I love it! it's the best! We really like the plain cheese pizza and the garlic knots. It's also clean and pleasant to eat at Lean Crust!", "author": "Courtney B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "I stopped in for a quick bite. I ordered two regular slices and a coke. The slices were fine, but nothing to write home about. I found that there wasn't enough cheese nor sauce, and the crust was dry. I think if you need vegan or gluten-free pizza then this is your spot, otherwise, I would recommend to move on to the next pizza joint. Service was friendly enough and the restaurant was clean.  There are also a bunch of tables as well as a standing bar so that is convient.", "author": "Albert H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "New York pizza! Sorry to share a photo of a pizza that I already enjoyed (I forgot to take one before). I stumbled on this place and really enjoyed the pizza, thin crust, cheesy and not greasy! The service was good. If you are looking for a quick bite I suggest stopping by here.", "author": "Alise G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "I was in a work meeting all say and the group was hungry. One of the gentleman recommended \"Lean Crust\" not to far away. Me personally, never refuse pizza so I was all in. When the pizza arrived it was brought up and the feast began. Sorry to report it wasn't the best pizza I've had in Brooklyn. The gluten slices seemed a bit stale, while the regular slice was just that, regular. It didn't stand out and the crust was missing that Brooklyn bite. I'm not saying I wouldn't eat the pizza again, mostly everyone liked it, but it's not a place I would rush to go back too. I will honestly say that if I do go back I will try a specialty slice, that's my pizza of choice. Perhaps my adult taste buds are looking for more then just a simple slice.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-21", "description": "I came here 6 years ago, and have been trying to find it since. We just came back to New York and found it again. It has a great gluten free selection! Great place!", "author": "Josie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-16", "description": "$3 for an incredibly mediocre cheese slice (not even the vegan one, the real cheese one). Not rays which is literally across the street is the same price but 10x better. Very friendly service. If you're going to go might as well check in on yelp for garlic knots (not great either).", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "So far, and feel free to correct me if I'm wrong, this is only pizzeria in Brooklyn that offers pies with non-lactose cheese and a gluten-free crust BY THE SLICE.\n\nI would otherwise rate their pizzas (both gluten-free and regular) a 4/5, but the availability alone earns them that extra star. It's not the best, but it's very, very, very close to perfection, and quite convenient.\n\nSmall but welcoming decor. You can sit and relax well enough.", "author": "Richie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Thin and crispy crust. The flavor of the pizza with squash and spinach is well balanced.", "author": "Lara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Once upon a time in my ignorant meat, cheese and egg loving  mind I could never fathom the thought of vegan pizza... I mean how good could cheese less pizza taste even remotely good...right?! Welp let me say I don't need to eat cheese to be satisfied. Their vegan pizza is dope. The crust is thin cause ya know...vegan... but it is so delicious. So filling, so satisfying. It's a great choice if your downtown and need some junk food. There are options for the non vegans as well!! They also have organic ginger ale that actually taste like ginger!!! Bruh!!! Healthy never been so damn  awesome! \n\nAtmosphere- typically pizza joint. Friendly staff. Quick service and clean.  \n\nI do plan on frequenting!!", "author": "Penny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I'm not vegan or living a gluten free lifestyle, BUT their gluten free vegan pizza is so good I would consider converting if I could have it weekly. Staff is always courteous and food is consistently good.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I'm somewhat of a pizza snob, so I was skeptical. The gluten free white pizza (one with spinach and artichokes and one with arugula and tomatoes) was delicious- crispy, thin, and had excellent flavor. I usually love gluten, but I didn't miss it at all!\n\nI ate it while I watched the ugly delicious episode on pizza, and like David Chang would say- authenticity is kind of prohibitory. This place is definitely worth a try.", "author": "Lauren O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "I'm gluten free and rarely eat dairy. I live in Bedstuy and this is off of my train line and close to BAM. There aren't a lot of affordable food options in the area so this is my go-to. Yeah, $5ish for a slice isn't cheap, but someday when you have dietary restrictions like me, you will see just how exciting it is to be able to get a slice now and then! Most gluten free pizza offered at regular pizza places is made on a frozen crust that is not so great, they make their own which is much better. Minus one star as they don't deliver to me and I live a five minute drive down Fulton, but I will continue to stop in for a quick bite when I'm catching a movie at BAM or taking a dance class at Mark Morris.", "author": "Brooklyn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "VEGAN PIZZA!\nVegan PIZZZZZZAAAAA!\n\nSo good! \n\nThey truly make their pizza with love. \n\nA tad bit pricy but the slices are super large!\n\nI always go with the typical vegan cheese slice (as it's usually the one most readily available) \n\nIf they could lower the price a bit I'd surely rate it 5 stars!", "author": "Sherry S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "It is good pizza and it has all the classic flavours available by the slice. They also have a good selection of soft drinks and beverages in general. I'd recommend going for the whole pizzas because they have more flavours/ingredients and it will taste fresher. It's not the best pizza in NY, but it will do if you are in the neighbourhood.", "author": "Rafaella A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "Very expensive for subpar pizza/ pasta. The last time I ordered penne a la vodka, the chicken had no flavor, and was cold in the middle, like it hadn't been thawed properly (uhhh why am I paying almost $15 for takeout pasta that's not even cooked  thoroughly?). Their specialty slices lack any flavor or spice that would make them special. For half the price, you can get amazing, authentic OG Brooklyn pizza somewhere else and actually enjoy the experience. This place is only good when you're in a rut or hurry with no other options. Not because they're great.", "author": "Priscilla M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I'll keep it short and sweet - this is the best gluten free pizza that I've ever had. Large slices like regular pizza, great ingredients and pie options that are unheard of for GF - personal, medium and large.  And they even sell GF pizza by the slice!  \n\nOpen one in Long Island please, preferably the Plainview/Syosset area. :)", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Chicken Alfredo Pasta ! Best I've ever had ! This was my first meal in New York and I am so glad we decided to try this place and I LOVE that it's less than 5 minutes from my house. \n\nMy boyfriend and I got 2 slices of pizza, garlic rolls, and fettuccine alfredo. I didn't really get to try the pizzas but both the garlic rolls and alfredo pasta were delicious. The alfredo sauce was different than anything I've ever tried before; it tasted as if they added bacon to the sauce and my boyfriend said he really liked the pizzas too. Overall, I will definitely be back every time I'm back in New York.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "WORST PEPPERONI SLICE EVER! Instead of cooking the pepperoni ON the pizza while making it they thought \"hmm how could i make this the grossest thing possible?\" and just threw cold slices on the pizza. So now when they throw it in the oven instead of a delicious crispy pepperoni slice, there are greasy wet floppy pieces of pepperoni on my pizza. Not to mention there was barely any sauce and the minimum amount of cheese they could put on. This is god damn NYC and you should know how to make pizza. As a New Yorker i am offended that this was even served to me. If i could i would give this place negative stars.", "author": "Nicki P."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}