{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Vegan \u0026 gluten free options! Fro Yo and Pizza, a surprisingly good combo", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I'm so happy to have gluten free pizza in the neighborhood. They even do gf slices.  I go here EVERY CHANCE I get (which is sadly only 1-2 times a year now).", "author": "Izzy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-13", "description": "I had what looked like an eggplant pizza. I quite enjoyed it, crisp, good cheese-to-topping ratio. One of the better pizza options in Fort Greene. Though my company quite thought the opposite, in their eyes, this place doesn't deserve more than a 1 star. I'm willing to give this place another try though, especially when its in the neighbourhood.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "This was a find on a whim!  And still dreaming about it.  I tried their quinoa crust gluten free/vegan free pie.  OH MY!  The crust was baked to a nice crisp to hold the toppings, but still could fold it.  Had I not known, it would have tasted like the old school pies I use to eat.  Most gluten free crusts to me are bland and hard ... maybe it was the quinoa flour, but it won me over!  The cheese was obviously vegan, but had a beautiful gooey-ness about it and creamed nicely between the veggies.  They put sliced butternut squash (I believe) along with standard veggies which made it a bit more hardy for a veggie slice.  Spoke with the shop keeper who shared a few secrets so that was pretty cool!  Highly recommend the place.  $5 to fill full was a very nice treat too!", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "This may just be the toughest most demanding neighborhood in the world for pizza... well, OK Bensonhurst can also claim that but my point is we don't tolerate bullshit pizza around these parts. Lean Crust ain't my fave but I must give them proper respect.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "I love the lasagna and sausage rigatoni.  Great reasonably priced food.  The service is good and delivery is quick.  I highly recommend this great neighborhood place.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "Wonderful!  What a delight to have gluten-free pizza, *delivered*, and it's delicious!  Yes, it's a little pricey but gawd, if it wasn't I'd probably order it every DAY, so it's not the worst thing, actually.   Delivery has always been fast, but I live quite nearby, so YMMV.  But yay, I'm so happy this place is here.", "author": "Saffron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "Amazing gluten free pizza!! Dough is wonderful and all ingredients are fresh! Also tried the pear/beet salad and loved it so much that I decided to make it myself at home. Will undoubtedly order from here again.", "author": "Alessandra Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-28", "description": "Love the vegan pizza but there phone never works.  I call every few weeks to  order from here and have had many occasions where there phone will not work. I call and call and get a busy signal.  Do they not have call waiting? is that even an option any more.I wrote them about this problem and never heard back. It took maybe 12 calls tonight to get through to them and I wrote them again after this. We will see if they ever give me an answer.", "author": "Chris J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Amazing pizza. My favorite place to go get a slice. So many interesting slices; all are very tasty. The garlic knots are some of the best I've ever had. Friendly customer service and atmosphere.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "i have had several gluten-free pizzas in nyc. this is by far the best one i have ever had. bravo!!", "author": "A W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "This place is awesome. There are so many vegan places that don't have gluten-free stuff, and vice versa. This place has 2 gluten-free crust options + vegan cheese + tons of creative and interesting toppings. Delivered usually within 45 minutes and always delicious, and the staff is really nice and helpful.", "author": "Cody P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "This might be the best gluten free pizza I've had! The crust is thin and crisp, with a good flavor and texture. The toppings were good too, and the price wasn't even that bad. So glad to have this place in the neighborhood. The missing star is because it wasn't clear to me how careful they are about cross contamination - a few extra measures to prevent it would easily move my rating to five stars.", "author": "Tara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "This place is incredible. I've eaten gluten free pizza everywhere I could find it in this city and in many others, nowhere comes close to these guys.  It is indistinguishable from very good thin crust flour pizza.  And they have slices! And creative toppings! Plus I don't know what kind of pepperoni they use but its great.  They keep experimenting, the owner and the staff are very friendly. Not a place to go for the ambience, yet--it's small and  they are still doing it over from being a yogurt shop. It is, however, the best gourmet slice place in Brooklyn, and has the best gluten free pizza anywhere.  I've moved away now, and miss this place dearly.  Thanks guys!", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "I gave Lean Crust another try a few weeks ago and they seem to have changed staff since my last visit, no more issues with cashiers touching your food after handling cash. And the pizzas are just as good as before. I'm back to being a regular!", "author": "L B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}