{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "Fantastic gluten-free crust, seriously. Wow. But at $5/slice, it better be great! Luckily, it is.", "author": "Jess K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "Good thin crust pizza, crispy just the way I like it! Fresh mozzarella. Garlic knots however leave a lot to be desired! Very mushy and bready. Not a fan of those.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-26", "description": "I'm not too much of a fan of the pizza.  It's not bad, but not great either.  The garlic knots are fantastic.  I might visit again for those if I am in the neighborhood.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Some days I would fight a baby to able to walk into a pizza place and buy one slice of gluten-free pizza that tastes real and delicious. This place granted that wish for me, minus a baby fight. But, regardless, look out babies, because next on my list is a good pretzel.", "author": "Erin A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-11", "description": "pricey pizza more suitable for gluten free people to go to. not many options. taste is ok. but consider the price, I could find other better place instead.", "author": "Lulu X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "thank you for making delicious gluten free pizza. you are awesome!", "author": "HanaKyle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Nice pizza! It is sadly my \"go-to\" pizza spot because the NY Slices have gradually become horrible around the city, which makes no sense. I blame the 99 cent pizza places. \n\nNot your traditional NY Pizzeria, but a good spot if you need a decent slice. \n\n$2.75 for a regular slice.", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "Is this the best tasting pizza I've ever had? No. But that's not what one should expect when walking into a place called LEAN Crust. It's not fair to give them three stars for being innovative. For us gluten free folks, this is probably as good as it gets.", "author": "Erica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-06", "description": "1st impression was a great one. They didn't complain about delivering to me when they are further than most places from me that refuses delivery. I ordered the vegan option on one of their medium pizzas and was worried it would be to small, but it was perfect. Delivery was quick and friendly too. Looking forward to doing it again, thanks.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "This place makes you wonder who ever said that pizza wasn't healthy. The Service was great, staff was very helpful in letting me know the ingredients in each pizza. I had the vegan cheese veggie pizza. It was very tasty and the pumpkin slices added an extra kick of flavor. Its a bit pricey for one slice but its worth it.", "author": "Ashana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "The gluten free pizza is delicious. Pricey but delicious. The manager does a great job at keeping things separate and sanitary. I won't go in if he's not there!", "author": "Jane G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "EXTREMELY DELICIOUS, INTERESTING, GORMET PIZZA! Apparently any slice can be made vegan or gluten-free...very nice option! My slice had brussel sprouts, bell peppers and sun-dried tomatoes on it (probably some other veggies that I have forgotten about) and it was just delicious! HUGE NY style slices, roughly $3.00 a slice if I remember? Quite tasty and not as guilt-inducing as other pizza places with its semi-healthy options! If you're in the area, give it a try!", "author": "Angela O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-13", "description": "I've tried Lean Crust a few times and it's just okay. I tried their Buffalo Chicken slice and it was good but it's also hard to mess that up. About a week later I tried the gluten free grilled chicken salad slice and another slice with chicken and peppers. Both slices just seemed to bland and flavorless to me. If I were to order from here again I'd avoid the gluten free options all together and probably get the most unhealthy slice there is because I'm not willing to sacrifice taste for a slice that might be marginally healthier for me.", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-15", "description": "Well, I would review the pizza if the delivery had arrived before I went to bed.  2.5 hours to have a pizza delivered 4 blocks...  I would have loved to go pick it up, but my son was asleep and I couldn't leave him in the apartment.  So 4 blocks, 2.5 hours, no pizza.  FAIL!", "author": "Shawn F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "Gluten free pizza here is really good! I've had their regular slice which was okay, but the buffalo chicken one was insanely good. I ate 2 slices and wanted to go back for another one even though I was full to the brim. \n\nI have also tried a gluten free vegan slice which was also really good. I have no idea what the \"cheese\" was on that slice, but it was nice and would've fooled me into thinking it was actual cheese if I didn't already know it wasn't. \n\nI wish I lived in the delivery range though, but I'm in the neighborhood often so that's okay. I also sometimes take slices home on the train for later because it's that good, and way better than your typical gluten free pizza from around here .", "author": "Alison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "This place is AWESOME! The gluten free crusts are so good, not too thin or hard. The vegan cheese they use is awesome and they put enough on it so that you really get the melted cheese feel!\nAnd they have gluten-free AND dairy-free SLICES! Unbelievable!\nThank you to the owners of this place, seriously it is invaluable to have a good pizza place that can do both vegan and gluten free!", "author": "Clara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Crust was lean as advertised, but not any better than your typical pizza (maybe just a little pricier).", "author": "Anny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Seriously this pizza is super tasty. They changed the crust recipe- it tastes like its all rice flour mix for the gluten free crust. The sauce is well seasoned, great mozzarella and delicious pepperoni. I wish I lived closer and could get pizza delivered to my apt all the time. Yum yum- you wont disappointed. There are only a few places where you can get a gf pizza in the area. This is one of the places and its money well spent.", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-28", "description": "Great vegan pizza!! Only 3 stars because it's one of those places where the kitchen is blasting music while the dinning room has other music blaring. Very stressful very annoying. It's only one room the kitchen and eating area! Hilarious. Get it to go", "author": "Bud S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "I came by here today drawn in by the gluten free slices that they have. I had one with a variety of toppings which were eggplant, olives... I'm not really sure but it was full of flavor. It was definitely an interesting slice. I also got the garlic knots because yelp gives them for free on the app and those were very tasty! I was surprised and I guess I failed at trying to be gluten-free. Oh well.", "author": "Tiffany D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}