{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "It's the best gluten free pizza ever. I've been going since they first open and the quality has never changed. Fantastic pizza. Great salads. Good gluten free pasta. One of my favorite Brooklyn joints.", "author": "Yon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Now that I live within the delivery zone, I am BEYOND excited. I have already had it twice in 2 days--don't judge me, I just moved and still don't have a microwave or a working stove so it's justified!\n\nAnyway, I love that they offer a home made gluten free crust (not the pre made frozen one size crust other pizza places sell) and have different sizes. The crust is thin, crispy and a perfect amount of chewy.\n\nThe toppings are always fresh and NOT skimped on. My go to is veggies with spicy Italian sausage and they include mushrooms (two types), green, red and yellow bell peppers, and broccoli. They are super generous in the toppings which make every bite a celebration for your tastebuds.\n\nThey have dairy free daiya cheese which is a super plus for my stomach. The best part is they charge a standard $3 more per pizza for vegan and GF instead tacking on two charges.  On top of that, the woman who has taken my order twice is super sweet!!! I am in love with this place and will always be a fan!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Came in for a quick bite while heading to Brooklyn Tech. We had some BBQ slices and a margarita slice and they didn't disappoint. The thin crust was delicious and the pizza as a whole was very flavorful.", "author": "Maribel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "This is our go to pizza delivery place. Salads are superior to other pizza places and the pizza dough is a bit thicker  but I especially like that their sauce isn't sweet and more on the tangier aide. I hate sweet sauce. I'm writing this 2nd review bc the delivery guy was so sweet and Honest. I paid him cash and he realized that I'd already paid online. He immediately came back and I gave him a $20 tip. Honesty does pay!", "author": "mj b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "This was near my school, so I gave it a go. I was fascinated by the prices of the items. My friends and I ordered the fettuccine alfredo, penne vodka, two slices of pizza, and 2 orders of garlic knots.  The pastas also came with an order of garlic knots, so that was very worth it. The pastas were both $12 plus the 3 garlic knots that came with it. The pizzas were $2 a slice, and the garlic knots are 3 for $1. The pastas took long to make, which I understood, and when it came out, the portions of them were pretty large. It definitely is meant to be shared if you can't eat a lot. I got the fettuccine, and I could barely finish half. There were very decent amount of chicken in it as well, as I couldn't even finish the chicken.  My friend (a guy) finished his pasta and the garlic knots and ended up very full. In my opinion, $12 for a stuffed belly is very worth it. The taste of the pastas weren't bad, though I enjoyed the garlic knots much more. I would come back; it's a great place to hang out with your friends.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "VEGETARIAN, GLUTEN FREE REVIEW:\n\nReview is for their gluten free pizza.\n\nFinding good gluten free pizza is a struggle and this is one place I will not ever go to again. The crust was so dry, so thin, and so cracker like I can't even call it pizza.", "author": "Liz W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Their pizza slice is par superb, I was more impressed by the garlic knots, which seemed to be just the right amount of baked to be soft in the middle, with a generous portion of garlic and oil that made eating them effortless.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "This pizza parlor is tremendous. The staff are exceptionally respectful full and the pizza is extraordinary. They offer healthy pizza such as, gluten free. Anyone in the area looking for pizza should no doubt visit this pizza parlor. Pizza is averaged price, quick and delicious.", "author": "Hayes C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-22", "description": "Skimpy Topings:\nWe have given this business many opportunities over the past few years.  The margarita pizza says it has Basil on it - you need a magnifying glass to find it.  It's little flakes that are far between.  Based on their healthy come on, one would think there would be Basil leave like the picture on this page.\nEGGPLANT topping:  it isn't slices of Eggplant, it's little cubes - and, I do,mean little!  And, if you're lucky there will be 2 little (1/2\" x 1/2\") cubes per slice.\nI like the crust and the cheese but I'm tired of the disappointment.\nVery good delivery boys.\nThe middle photo below is deceitful.", "author": "Local And World T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Excellent customer service and delicious fresh pizza. Everytime I come i am greeted the staff knows what I usually order on the phone and has it ready for me to pick up", "author": "Rifatul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Loved the pizza and to top it off they also take Bitcoin! I highly recommend.", "author": "Tommy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "They have gluten free pizza by the slice!! Need I say more? I am beyond excited to make this my new pizza spot. There were three amazing choices, clouding a gluten free vegan slice. I got spinach and artichoke hearts and it's delicious!", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "I sent out my husband to pickup my pizza from here! It's kinda pricey but so good!! I got the quinoa crust with all the veggies and vegan cheese. I will be going back shortly :) Highly recommend !", "author": "Sufora S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "good gluten free and Vegan pizza is difficult to find. Lean Crust is worth the trip for those with dietary restrictions who don't want to give up on taste", "author": "Martin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "Used to be my favorite pizza spot in the neighborhood. Recently they reduced the size of their pies by over 25% and started putting on a lot less toppings but left prices the same. \nThey still list the old sizes on their website, by the way. So don't be fooled by that.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This place is great! We tried this spot because I am gluten free, and my dad who was visiting is vegan. They can accommodate both and are very knowledgeable. My husband and mom had the regular pizza (not gf or vegan) and they said that all 3 kinds of pizza were delicious. I had the gf sausage and mushroom- yum! And we also got the Margherita. The toppings were certainly generous. Next time I'm going to get the veggie-- it's completely overloaded with veggies (see pic).", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "As a Chicagoan, I'm not allowed to praise the pizza of other places - especially east coast cities...\n\n...but Lean Crust's arugula pizza is heavenly. I nearly wept.", "author": "Rayshauna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This is my favorite place to get pizza in Ft. Greene! The crust is truly lean and super crispy - reminds me of the pizza I used to get when I was in Italy! They have the best gluten-free crust I've had in NYC and are able to make vegan pizzas if you want. Also the staff is super friendly - I once had a wrong delivery order and they were amazing about fixing the situation. I HIGHLY recommend eating here!", "author": "Marcos S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Perfection in gluten free pizza. If you are searching for good gluten free pizza search no more - lean crust is the BEST. I've tried very few gluten free pizza options in NYC that can come close to Lean Crust. The first time I tried this place I honestly thought they made me a mistake and sent me regular pizza boy was I happy when I found out it's just that good.\n\nWings are good too. The only thing I'm bummed about is that there aren't Lean Crusts all over NYC!!! I want Lean Crust everyday!!!", "author": "Emily B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Good pizza and quick service at a good price. Lots of options for regular pizza, gluten free, and vegan. Love the spicy olive oil.", "author": "Brian C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}