{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "I've lived in Fort Greene for years but usually order pizza from Clinton Hill (Graziella's or Emily's..or I trek to Speedy Romeo's in Bedstuy). I live just down the block and thought I'd try Lean Crust after reading favourable reviews and liking their menu. \n\nI ordered a large pizza and had two slices for dinner and chalked up my queasy stomach to tiredness and having an off day. I spent a portion of my evening in the bathroom and thought it was 'evening sickness'.\nThe next day I didn't feel well, but had an appetite so I heated up two more slices and was violently ill a short while later. I'm lucky it wasn't worse- I heaved my entire stomach contents and felt lethargic and nauseous for the rest of the day. Stuff happens. I write this because i called Lean Crust to ask if maybe the batch of goat cheese on my pizza was off...the restaurant said the manager was not available and insisted it couldn't have been their pizza that made me ill. I called today and got someone else who was polite but offered the same insistence and disbelief. Never again.", "author": "Hadiza A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "I don't even remember the last time I had a slice of pizza before I came here.\n\nI went to NYC for a trip, and I was determined to find a solid gluten-free pizza joint. I don't love pizza like the average person seems to, but I definitely missed it a little. It seemed like a worthwhile pursuit to take whilst in the big city.\n\nLean Crust was exceptional. I ordered two quite massive slices on the quinoa crust. One had just vegetable toppings, and the white pizza with chicken. The texture was perfect - I didn't feel like I was missing anything with the gluten-free option at all. It was perfectly crispy and it held together well.\n\nFor the giant slices you get, the price is right.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "The place itself is clean with an A rating. One thing that sets them apart is the option of non-refrigerated water (my preference). \n\nI had the vegan pizza which has unlimited toppings (mushrooms, broccoli, peppers, pumpkin, \u0026 spinach) all for the same price! It was flavorful and filling which is not always the case with a veggie option. \n\nTheir refreshment selection is quite limited (they have 2 flavors of Perrier)", "author": "Shanice W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-03", "description": "Please do not get the calamari from here. It's flavorless and tastes like cardboard. I've always gotten the mushroom pizza and wings which are pretty good. But the calamari sucks.", "author": "Shelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "The #1 reason why I love lean crusts is that they offer vegan, gluten free SLICES let alone entire pizzas. Finding gluten free slices is hard, finding vegan slices is hard, finding both of them together is nearly impossible and I haven't seen anyone else do that so bravo Lean Crusts. The sauce was delicious, and the vegan cheese tasted so similar to real cheese (they use Daiya I believe but somehow it tasted better than Daiya usually does)! The only downside is that each slice was around $5 but it's understandable because gluten free crust and vegan cheese are more expensive.", "author": "Meganne N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "This is your typical no-frills pizza place with good pricing and some really excellent toppings, like the mutli-mushroom pizza with truffle oil slice for only 3$. \n\nI cannot complain, and I think the prices are more than fair.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "I am a fan of their pizza, but that's about it.\n\nThe guy I talked to behind the counter didn't have any answers to my questions about making  pies vegan and which slices were already vegan. He had to ask someone else. Not sure if it was a language barrier or if he just didn't know. If he didn't know, someone should let him know so the business can run smoothly and not discourage customers.\n\nThe prices were really high, too. Two slices of vegan veggie pizza for almost $11. Yup, you read that right. It probably would've been more worth it to order a small pie for $14, but I couldn't finish it all. But, the pizza was good, so I will give it that. The crust held up to the abundance of veggies (zucchini, carrot, eggplant, etc.) that were piled on. The amount of cheese (probably Daiya from the texture) was just enough to not overpower anything.\n\nOverall, a solid slice, but not something I would eat too frequently because of how expensive it is.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "I have traveled far and wide in this world searching and trying my favorite food item: PIZZA. Every kind, even deep into southern Italy's oldest pizzerias, Brooklyn, NYC and beyond...and this is GREAT sliced pizza! \nNow to me, all types of pizza can be great. This type is something of a rarity, as they have gluten free, soy cheese as well as salad style pizzas and regular nyc pizza. \nI am having the amazing salad pizza and am thrilled and stunned i haven't stopped by here ever before! The staff is fast, friendly and owner is a lovely local person...\nVery happy and highly recommended!", "author": "Elle V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "I've been coming here for years, during my time working for BAM. Fort Greene to me has always felt a bit lackluster when it comes to dining places, but Lean Crust is a true gem.\n\nStaff: The staff is always friendly and delivery is often, if not always, quick.\n\nFood: Is budget-friendly and the ranges are solid. I've often ordered their freshly handmade pasta, which takes 10 minutes to make and 15 minutes to receive. If that's not consistent, then I don't know what is. Their pasta dishes have variety and each are great IMO. The Penne a la Vodka is a personal favorite, and so is the Lasagna. As for pizza, I recommend the Buffalo slices/pies. They're delicious and  quiet affordable and then the remainder of their menu, is fair game. I'm modest and usually just stick to what I like, but I haven't tried anything so far that I haven't liked. The gluten slice is popular, but I'm not bold enough to try it. Calzones are cheap, but extremely filling too.\n\n\nOverall: This is a great place to come to if you're in the area. The food has quality and the prices are well-affordable for the neighborhood. I'm a fan.", "author": "Murphy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "The pizza here is great. They offer some delicious options via delivery which aren't usually available by the slice. The only thing that really bothers me is that if you order delivery the delivery guy is too lazy to actually bring the pizza to your door (you know, like every other restaurant in the city) and instead will call you and ask you to come downstairs to get it from him. On the bright side, you get to see the dismayed look on the jerk's face when you then stiff him on the tip!", "author": "Peter T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Best gf pizza in NYC. So yummy and folks who work there are super accommodating. Definitely worth a trip from Manhattan or queens. Delicious gf pizza.", "author": "Michal F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "I'm going to say this has to be the BEST Gluten-Free pizza in America.   \nWhy, because they have so many flavorful options and GF Vegan, GF Non-vegan. You can't beat it and it keeps the BROOKLYN pizza taste!  and GF by the SLICE, WHAT!!! \n\nI've had GF pizza at some top pizza establishments in NYC and they taste more like science than pizza. Plus you can't get GF slices at most places you have to buy the entire science project and it's never worth it!   These guys have GF locked-in and I wish they would open more and more locations. \n\nThat is all...", "author": "Aisha F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "Two words: blurgh, blehck! When our pizza arrived, it looked as though a male witch (warlock?) had ejaculated in a swirl across it-- tasted like it too. How they had the gall to call that green stuff, \"pesto\" is beyond me. The crust was also unbearably dry yet chewy--the best comparison I can make is \"crouton jerky.\" Just save yourself the damage to your wallet and stomach, and order elsewhere. I thought there wasn't such a thing as bad pizza. Lean Crust proved me very wrong.", "author": "Mystery B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Should be called \"Not Real NY Pizza\", bland, soft, hippie shit. I'm guessing they are leaning towards the health conscious individuals. I am all about health food that taste good, otherwise I'm wasting my calories for something undesirable. I had the plain slice, thin crust but did not hold any crispness, tasted chewy and bland. Added garlic and olive oil, that helped a bit. It was a waist... But now Brooklyn has a Artichoke pizza and I will waste my calories there.", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "The Best GF Pizza By the Slice in the World!\nI eat here about once a week.\n\nI'm glad the logo and the ambience and the paper plates sort of make you feel like it's a chain.... because this is one of the best kept pizza secrets in the universe and unlike other GF pizza places that will cost you an arm and a leg, this place is really inexpensive!\n\nThe crust gets a 10 out of 10 stars from me. They should actually take out a patent on their crust. Gone is the rubbery, bland, tasteless crust that infects most GF places around the city. This is the REAL deal! (I think it may be from the Quinoa flour combo they use).\n\nIn addition, the sauce is superb and the topping are always mucho fresh!\n\nFinally, GF pizza lovers can get a really great slice without having to order an entire pizza, which makes us all feel a little more normal. \n\nEveryone in the place is super nice, including the owner.", "author": "Slash C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "I took shelter from the rain while eating pizza. It was quick and yummy. Thanks pizza.", "author": "Nick E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "This is some of the best pizza in New York. Get the margherita and be amazed by a beautiful amalgamation of flavors. The cheese, sauce, spices, and thin crust combine for a delightfully light yet deliciously sumptuous flavor!\n\nIf you are in the neighborhood do not miss it!", "author": "Ben M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "I'm so in love with their Portofino gluten free pizzas (mozzarella, tomato sauce, pesto, pine nuts) as well as their avocado-tomato slices. So good!\n\nPricey if you order delivery (can't order a slice, needs to be a whole pie if gfree) but if you come into the store, you can get gluten free and vegan slices to eat in or to go.\n\nDelivery guys are very nice and prompt- one of them is already well known in our building that he's allowed to go up without getting buzzed in :D", "author": "Ro C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Love the pizza and people who run it. best quality. I don't order vegan gluten free pizza but good to know it is there if I had friends who need it.", "author": "Ina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Arrived in the last hour before close. The kitchen closes 1 hour before the place closes...what the hell. It didn't matter bc I wanted to try a \"lean\" pizza slice as I was walking by. Idk if lean means toasted or well done or cooked crispy, but that was what myself and my fiancée got. However, the slices were very good. I got the dairy free slice and she got the cheese with ricotta. Good place of your in the neighborhood, but I wouldn't take a train across the city like I do to go to Vinnies in Williamsburg.", "author": "Thomas S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}