{"aggregateRating": {"reviewCount": 115, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Pizza is good... service is good. If you want a healthier pizza fix, this is the place.  I expected the gluten-free pizza to be tasteless and dry but it is actually very good. Give it a try even if you are not on a gluten-free kick. \n\nI can't comment on the Yogurt. I have had it maybe once. Nothing I remembered about the experience.", "author": "Michele B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Its really nice to have an alternative to my favorite neighborhood pizza Not Ray's.  The pizza at Lean Crust is very different, the crust first of all is super thin.  The few times I've gone there I've gotten a pepperoni slice which has tasty tiny pepperoni's on it, and a thin layer of sauce.  The chicken and broccoli pizza is great!  The broccoli is super fresh.  I've also had the buffalo chicken which is very good as well.  This place is all about the fresh toppings - I don't really come here for anything else, the crust is hardly there, there's not a lot of cheese or sauce - but the toppings are fresh and make you feel like you are eating a hearty fresh meal, in the form of pizza - win!  No fountain drinks.  And frozen yogurt with lots of toppings - a great one stop shop.  They've got a few tables and chairs out front, which is so nice to have to eat outside option in the summer.  A welcome addition to the neighb.\n\nLast time I was in the there the staff guy made a point to clean off a table for me, even though I said it was fine.  He said there had been a big rush.  Ordering my extra side of sauce (I have to have with every slice!) is never a problem - excellent service.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Nice casual place to grab a slice of \"healthy\" pizza for lunch. The restaurant is small but there are limited seats and tables for customers to sit down and eat. Wide selection of both traditional and non-traditional pizzas, with gluten-free and vegan options that don't taste terrible. The ingredients taste fresh, the pizza isn't greasy, and the size of the slices is reasonable. The garlic knots are fairly delicious as well. Overall a decent pizza place and I wouldn't mind coming back here again.", "author": "Jazzy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "I absolutely adore this place.  \n\nThe prices are uber cheap, the food is delicious and the delivery is incredibly fast.  Everything from the pizza to the spaghetti is top-notch and my friends with food allergies say the gluten-free pizza is awesome.  The staff is friendly and I love supporting this neighborhood jewel.  \n\nDelicious, affordable and fast -- what's not to love?", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "I ordered lasagna for myself, rigatoni for my partner, and spaghetti with meatballs for my daughter. They enjoyed their food but my lasagna was something else. It seemed like it would have tasted good if I could actually eat it. The lasagna noodles were literally burnt together. There was no way of cutting thru it. Both top and bottom were burned. I'm not sure if it was old and it was reheated and forgot about in the oven but I'm mad. I was really looking forward to having a nice meal. The 2 stars are for my partner and daughter's food.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "Some of the yummiest quinoa crust I have tried. So excited to have more gluten vegan options in Fort Greene!", "author": "Scarlet R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "I've picked up slices here and ordered full pies for delivery... and it's been awesome every time.  We've ordered a variety of pies for my office from here, too, and people went on and on about how much they loved it.\n\nMajor plus: Not greasy AT ALL.  \nFan favorite: four cheese (but only if you like gorgonzola.) \n\nHighly recommend!", "author": "Holly C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-19", "description": "I was really disappointed with my first experience here.\n\nWe ordered a large gluten-free Portofino Pizza which is described in their menu as coming with 'homemade pesto sauce, fresh mozzarella, tomatoes and pine nuts'.\n\nSeveral issues here:\n- It wasn't cooked through enough \n\n- When you list the first ingredient as 'pesto' - you expect to receive a pesto sauce pizza - not a regular pizza with marinara sauce with (I kid you not) a DRIZZLE of pesto sauce on top. The combination of the pesto drizzle with the marinara was disgusting.\n\n- The description clearly lists 'tomatoes' - we got no tomatoes, instead our pizza was covered in the marinara sauce previously described.\n\n- Pine nuts - there were maybe 5 on the entire large pizza. Really??! \n\nSEVERELY DISAPPOINTED. And not only all of the above, but our pizza was room temperature by the time it arrived, which meant the last couple of pieces were cold. \n\nWe didn't even finish it. I won't be back.", "author": "Megan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-02", "description": "The gluten free pizza is the bet I've ever had. Reasonably priced. The marghuerite and mushroom w white truffle\nOil. Are amazing. And being Gfree let me tell you the taste of stone baked pizza oven bricks w that crust w that certain smokiness. It's heavenly divine. Love this place. They deliver too.", "author": "Ian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "No thanks. It wasn't very good. Had a margarita pizza and it had almost no basil on it at all. The price was right but the taste wasn't. I won't try it again.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "First, let me say how exciting it was for me to order pizza by the slice, I haven't been able to do that in over 12 years! (I am gluten and dairy free). There are many different topping options and you can make any pizza gluten free or vegan or both. The slices are HUGE and pretty tasty, but pricey. Lean Crust has a very \"no-frills\" type of interior, however, it is clean, but their beverage selections are too limited.", "author": "Alexandra A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-10", "description": "NOT SAFE FOR CELIACS this place has great tasting gluten free pizza but unfortunately it is cooked in the same oven at the same time as regular pizza!", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Affordable and delicious gluten-free pizza. Run don't walk. Best to get take-out, but eat in okay, too (for that near-zero traditionally-romantic experience).", "author": "Barsista K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Awesome gluten-free pizza (and spinach salad), great customer service, nice delivery guy. What more could you ask for? And I agree about the Portofino pizza, it's amazing :)", "author": "Susan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "Best gluten free pizza crust.  My boyfriend who isn't gluten free just thought it was a thin, healthier crust and didn't realize it was gf.  Definitely not your traditional New York greasy slice, which was a good thing.  Light and fresh and yummy.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Decent service for a by-the-slice place, and I LOVED the gluten-free pizza!  A little crispier than their regular slices looked, but still just as delicious!", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "best vegan pizza place by far my favorite! i cannot find another place that makes truffle / vegan cheese / pepporoni pizza like them ! and the workers are super nice and always smile ! so worth every buck.", "author": "Rose R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-25", "description": "While there are gluten-free options. The servers blatantly cross contaminate gluten products with gluten-free products using their bare hands to touch both. .", "author": "Jordan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "Best gluten-free crust I've had by far. Thin and crispy. Nice vegan options available.", "author": "Leah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "I have no issues so was not about to try their gluten fee pizza.  I ordered a pasta, penne a la vodka,  that was surprisingly delicious.", "author": "jude t."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Lean Crust", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "737 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8NNe5XEvqpZ11F6Leew/ls.jpg", "@type": "Restaurant", "telephone": "+17188527567"}