{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Can't eat too spicy but the guys there were awesome and made a really delicious hanger steak platter. Roasted cauliflower so good. Definitely a fan.", "author": "V. Monki. W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-06", "description": "For all of the non Pakistanis out there, your being scammed lol BK Jani can go ahead and scam the heck out of Cobble Hill and the surrounding overpriced neighborhoods for all I care, but when they try and get one over on a fellow Pakistani by selling me overpriced FROZEN pratha from your local desi store and pass it off as \"original\" and then serve me some basic chicken smothered in mint chutney from a jar, that's when I have to speak out. \n\nIf your in the neighborhood and you have a craving for quick \"Indian\" takeout, go at it, otherwise, travel to a more authentic place that serves freshly made oven baked naan or real ghee paratha with fresh cilantro mint chutney and deliciously perfectly spiced meats. True haraamis lol but also very genius, so I can't knock their hustle. ‍", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "People, we need a universal spice scale. There are just too many different entities offering food using entirely different barometers for what constitutes \"mild,\" medium,\" and \"hot.\" \n\nThere's the American Scale, by which I mean Taco Bell and how it offers packets of sauce at Hot, Fire, and Diablo...none of which are particularly spicy at all.\n\nThere's the Thai Scale, on which medium can mean inedible for my wife, and \"brutally spicy\" can mean they know I stole a t-shirt when I worked at that retail store when I was 14, and they are just now bringing the wrath of the gods down upon me as punishment.*\n\nThere's the Clown Scale, by which I mean the woman in front of me at BK Jani who was returning her fries because they had black pepper on them because she asked for \"no spice\" and she's the only person that thinks black pepper is spicy. \n\n(BK Jani Staff, you guys are heroes for dealing with her so nicely.)\n\nAnd there's the actual BK Jani scale, where the hanger steak roll that is \"medium\" spicy is actually hot as hell, but in the most delicious of ways. \n\nI don't actually have a solution to this problem, but if you made it all the way down here I think you should go check BK Jani out. The hanger steak is a perfect medium rare (if you ask for it that way), and the wrap (not really wrapped) is filled with spicy deliciousness. I wish it was a bit easier to eat, but you can't have everything in life.\n\nI can't wait to eat the lamb chops I keep hearing about.\n_______________\n\n*See Ugly Baby.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-14", "description": "My mouth is currently on fire as I eat the chicken Tikka roll.  I asked for the least spicy version possible, but I guess this food is just inherently ridiculously, mouth aching spicy!  Although spicy, I found the food lacking in flavor, if that's possible.  Chicken is very tender and the roll itself is yummy with an interesting texture, but the spiciness is just too much for me, so I will not be returning here.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Food: 7/10\nService: 7/10\nAtmosphere: 5/10\n\nBK Jani is fairly centrally located in the Dekalb Market Hall, and offers up a handful of Pakistani options.  Virtually everything on the menu is grilled, and at least for my order, my steak went down as soon as I finished paying.  From what I can see, the quality of the meat looks pretty decent, and it appears that their ingredients are fresh and well-maintained.  \n\nI ordered the hangar steak roll, expecting something like a stuffed pita - to my surprise I actually essentially got an 8oz steak with some yogurt sauce sitting atop of bed of veg resting on a flat bread about the same size as the steak itself!  This definitely didn't make for the most portable of meals, but it's hard to complain about the value.  Overall the flavors were pretty nice, and the cook on the steak was good, but beware that the menu items can be a bit more sit-down than grab-n-go.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Wow this place is amazing. The pictures surrounding the booth made me decide to try this place, particularly the steak. Though the steak was not as large a portion as I hoped, each piece was tender, cooked perfectly at medium rare, and sprinkled with enough spices to make my steak and masala fried the perfect end to my long day. \n\nIt was my first one at this market hall and this was the chosen place for dinner and I was blown away. The veggies were also very good, so definitely try the fries and veggies. Sadly they had run out of the cumin rice so we couldn't try that. I can't wait to come back.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "I'll give five stars because the food at this location and the Williamsburg one is great. The best, actually. Only problem is, the burger is $12 and fries are $3 on top of that. The fries are overpriced, it should be included with the burger considering the amount they actually give. \nOther than that, great experience every time, and helpful staff.", "author": "Ghazal K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Ate her with a friend for lunch at the Dekalb Market location. I order the salad with the seekh kebab. I asked the guy at the counter what level of spiciness the kebab was from 1-10, he said a 7. He was not lying! This was a true 7 and I can deal with some spice. If you don't tolerate spice well this will be a 15 out of 10 for you. If you eat spice all the time like my lunch buddy you will register there is a hint of spice... but you won't respect it. They offer a dressing that's made with mango juice and lime and a bunch of other ingredients. It was okay but with the well seasoned spicy kabab all I needed was olive oil to compliment the salad. The salad didn't look like much, but it was a battle to finish- I wasn't going to let the salad beat me. Furthermore some things are not yummy the next day so I had to finish it! I do feel that the price is a bit high for salad and some meat but I guess it was the \"experience\" of trying their food. I wouldn't say run here it's the best thing ever - it's good but I'm sure you can find food like this for a better price... just not in Dekalb market. \nGive it a try, it's good, but I'll have to try more places in Dekalb places before I return to this place. I was so focused on eating that I didn't take any food pics, my apologies.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "I wonder what the BK stands for . This is one of the more delicious options at Dekalb Market. Their masala fries are delicious. Everything is well spiced. The burger is thick, moist, and flavorful. The mint chutney adds a unique and refreshing twist to it. It was a super satisfying meal. I will definitely be back to try their chicken tikka.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "This is by far THE BEST veggie burger I have ever had in my life! So flavorful and I had to ask myself multiple times if it was really not meat lol. I would def go back! Price point was very reasonable and serving sizes were huge! Fries were also well seasoned and the staff was very friendly.", "author": "Cola D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "Amazing lamb chops. Chicken worth a 8 dollars chipotle bowl. Beef is a crap. I almost throw up from the beef.", "author": "Fred L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "I went to this BK JANI in Dekalb market. I had the chicken on paratha. It was just okay.... It just had too much chicken on it for my taste. It was very difficult to pick up and eat.  The ingredients were fresh and I would return knowing that if I ordered anything else , it would be great quality. Besides my food, I thought the gentlemen working the eatery was very helpful (see him in my pictures) and patient with me while I figured out what I wanted. I'll be back!", "author": "Brittni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "To die for... enough said !!\nTried the burger, lamb chops and azee Kh kabab, all are far better than any other Halal shop serving in Brooklyn... don't miss their rice and lentils..", "author": "Tanveer Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-26", "description": "I highly recommend the lamb chops! I saw their video on Adnan N Samia youtube channel. Very small space but boy the food was great. Go and try it.", "author": "Arafat R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "This is by far the best food in dekalb market. They do an incredibly spicy impossible burger and fantastic masala spiced fries. All their sauces are so flavorful and delicious, I could eat this every day.", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "The first time I tried BK Jani a few months ago, I got the chicken wrap and I probably would have given it 3.5 stars.  I thought it was fine, good cilantro sauce and tender meat, but nothing that blew me away and the price is a little steep given the good street food places will sell you an equally delicious version for half that.  Now I just got the Seekh Kabab with included Paratha and some Masala fries, and it was *really* good - 4.5 stars (so I'll average to 4).  The depth of flavor of the meat was really good, it was juicy and tender, and the paratha and fries were both deliciously crispy.  That was some of the best Paratha I've had outside of India.  I'll definitely be back soon to try the rest of their offerings.", "author": "Pat L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Ok these fries were perfect. We argued plenty about what this means, and if there even such a thing as perfrction - but here it is. They are seasoned with a spicy masala. It's got some kick, some saltiness, and the seasoning is great, but even in its absence, these fries would have been perfectly cooked. Soft, fluffy, moist on the inside and crisp and brown on the outside. The spice is a bonus and a delightful surprise, but these are nonetheless impressively cooked fries. They're not perfect fries because of the seasoning, but perfect  AS WELL as being delightfully seasoned. Not shoestring, not too fat. We've found our Goldilocks.", "author": "Potato F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-03", "description": "Food was good but not great. I got the kabob with grilled veges. I asked for spicey and I got spicey. Felt it in the morning. Next time I'm in the DeKalb market, going to Katz's.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Tried the lamp chops based on a recommended from the two girls next to us who said they eat it at least once a week.  It didn't disappoint, very flavorful.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Me and the hubby had a craving for grilled rack of lamb. I've had this place bookmarked for a while and it's close by. I'm glad we decided to give them a try. I ordered the lamb with roasted cauliflower, he had the same with the cumin spiced rice. The prices were very reasonable considering the quality of food. The lamb wasn't over cooked and it was wonderfully seasoned. The pieces we received were a nice size. The cauliflower was very tasty, it can be eaten alone. The rice didn't skimp on the cumin but it wasn't overpowering. I also love the fact that everything is Halal. We will definitely be back to try everything else on the menu lol.", "author": "Nisa L."}], "servesCuisine": "Pakistani", "priceRange": null, "name": "BK JANI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Sq", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gBDcF6C961RdXcOJL2Xw2Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293596555"}