{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "Go here constantly, great place. Never disappointed. \n\nGood ramen. Good sushi, every roll I've ever had", "author": "Marco D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-27", "description": "Mitoushi Sushi, why must you break my heart? This has been my boyfriend's go-to sushi restaurants for over a year living in Brooklyn Heights. This rating does not reflect the kindness of the staff but comes down to the attention to detail and customer service.\n\nI recently ate at Mitoushi only to find a large piece of metal in one of their sushi rolls. Mid-dinner I started choking only to pull out a long piece of metal scrap from my mouth. When I confronted the staff they apologized and immediately took it away before I could take a picture. Instead of offering me a free meal they asked me if i wanted a free dessert? I said no and then instead they offered me a beer.... For a restaurant that was just shut down by health inspection I would have thought they would have done more for a resolution from almost sending me to the hospital had I swallowed the large piece of metal.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "Love, their lunch specials here. Sushi is always fresh. The staff is friendly and the establishment is clean.", "author": "Shakima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Hey, do you want to eat Mitoushi?\n\nThat sounds so dirty.\n\nAnyway, first came here during Atlantic Antic because they were serving $3 Sapporo's out of Solo cups. Best deal in town!\n\nAlso got some pork gyoza and shrimp shumai from their street stand, which were both pretty good.\n\nHad to order some delivery from them to test out their sushi offerings. Went with their sushi and sashimi lunch combo (at a cool $15). Actually a surprisingly large number of sashimi, all of which was pretty good. Couldn't tell you exactly what was what, but the salmon and yellowtail were both good. Also came with a California roll and your choice of soup/salad.\n\nDefinitely stop in for their awesome lunch specials!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "My #300 review goes to a nice brunch with dear friends in Brooklyn. Modern decor plus comfortable and spacious seatings. We had a late lunch around 2pm and were seated promptly. Service was quick and attentive.\n\nDecent lunch specials seven days a week! $9.95 combo box that comes with salad or soup, rice, shumai and California roll. I opted for beef teriyaki and my friend got teriyaki chicken. Other friends got the eel rice rice bowl, sushi sashimi combo and a hand roll. We also got Tatsuka Age which was fried chicken chunk as appetizer to share.\n\nSushi and sashimi was fresh. My beef teriyaki was a bit tough even though I ordered medium. Eel was yummy. The best part must be the ice cream. Both were delicious but red bean was a winner with some chunky red beans.\n\nGreat food, reasonable prices and attentive service along with awesome company. What more can you ask for? Would love to come back again when I'm in the hood.", "author": "Teresa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Mitoushi never fails to disappoint me. Missing the old spot on Staten Island I luckily have this one near work. The food is always fresh (even on a Monday) and fast. You can't beat the prices either!\n\nThe decor needs to be updated a bit but who cares about ambience when you food is that delicious. \n\nStaff is super nice too. Check them out!", "author": "Chre G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I love Mitoushi! When I lived in Brooklyn Heights, this was my go to Japanese to-go spot. They have great specials on Sushi and a delicious bento box. I never dine here without ordering one or two plates of the Rock shrimp Tempura. While the taste and flavor of the tempura has changed over the years (probably different Chef), the taste is still amazing.\n\nEven when I pass by to this day, I can't help myself and I end up getting some of that Rock Shrimp Tempura!", "author": "Charles R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Work lunch with the ladies. We ordered Shrimp and Salmon Hibachi from the  lunch special menu and Caribbean rolls. The lunch special comes with salad  or soup  . Service was on point. Food was delicious. I would definitely come back again.", "author": "Meline V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-05", "description": "Mitoushi Sushi provides Atlantic Avenue with a substandard level of cheap sushi. As seems to be the norm in affordable sushi, the fish tasted like it had been sitting out for a day and a half.  The spicy salmon roll and the spicy tuna roll looked and tasted identical, and the yellowtail roll tasted fishy. The staff is friendly, but this sushi spot fits into the category of cheap and for those with Teflon stomachs.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "Pros. Sashimi lunch is worth it.\nLarge salmon sashimi piece's\n\nCons. \nEel sushi was warmed with microwave\n\nMight come back later again :)", "author": "Joo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "This is my go-to sushi spot! The people are always friendly and the sushi is affordable. I always go for the three roll special, which is more than enough sushi served with soup or salad. I would definitely recommend!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "If you're ordering take out or delivery, do yourself a favor and go somewehre else. You will spend 10 minutes on the phone, get passed around to different waiters, and then repeat your order several times. Food is ok when u eat in but take outs were not my favorite", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Celiacs beware--this place doesn't get it, though they think they're trying. I walked in tonight to meet my wife and some friends, and asked about gluten-free soy sauce and wasabi. I was told that they had GF soy sauce, but had to check on their wasabi. Waiter came back and said that according to his manager, the wasabi was indeed GF. Seemed safe, so I sat down with my group.\n\nTwo minutes later, the same waiter brought me a bottle of what he said was the GF soy sauce... but it was in a regular Kikkoman bottle, and wheat was listed right there in the ingredients. So I brought it up to the hostess, who said they had put the GF soy sauce into that bottle. \n\nOK, first of all, why? Why not give it to me in the original GF bottle? Doing it this way creates doubt and concern, and now I gotta wonder if you washed the bottle out sufficiently before putting the GF sauce in it. It's just a weird thing to do that undermines my trust in what you're telling me, and also makes me wonder how much I can trust your word with regard to the wasabi.\n\nSo we left, with no dinner. We told our friends to stay, but they lost my wife's and my dinner orders. Why? For just plain sloppiness. If you know GF soy sauce is important, why does your staff have to come ask if the wasabi is GF? And why in god's name would you serve it in a regular soy  sauce bottle and tell me to trust you?\n\nSloppy and careless, and with the tiniest bit of forethought and common sense, you could have two neighborhood sushi fans ordering from you regularly, instead of adding yourselves to our must-to-avoid list. We won't be recommending the place to friends, either.", "author": "rev r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "First time trying this place and they have a pretty good lunch special menu.  The fish is of great quality.  Their service could be a bit faster...", "author": "Lillian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "Def a neighborhood joint.  My friend lives in the neighborhood and for sometime I've wanted to stop in and try some sushi here. There are pros and cons. Here they are\n\nI glanced over the menu quickly and ordered the rolls I frequently have at any sushi joint I go to. I saw some interesting stuff on the menu. But thought maybe I'll try it next time.  So we started our evening by ordering some shrimp shumai very tasty. Can't really mess up shrimp shumai.  However when my rolls came the salmon in my alaskan roll was definitely not fresh salmon. It was 100% smoked salmon. I eat smoked salmon all the time. I know the difference. I didn't bother to tell the server or staff. I just didn't have the patience to wait. I just made a mental note not to order that ever again. Tuna was also questionable. The fish tasted of a lesser quality than I am used to. The lighting in the restaurant was super dark. I know it was a loose light bulb because light would occasionally come and go from over our heads. Just a little annoying. What was really annoying was the fly that buzzed by us every few minutes.\n\nEverything came to our table quickly.\n\nPROS: super friendly staff, fast service, and great open seating area.\nCONS: alaskan roll (salmon tasted like smoked prepackaged salmon), lighting and this annoying fly that we swatted all night.\n\nService: 5\nFood: 3 \nAmbiance: 3\nTotal I want to say a generous 3.5\nI would go back if my friends insisted otherwise I would go somewhere else. There are a few places in the neighborhood that are better.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "I have to admit that I was skeptical, I have my doubts. Between the yelp comments and the low occupancy on a Friday night, I really second-guessed my girlfriends for picking this local sushi spot for dinner. \n\nWe each ordered some basic rolls, priced at less than five bucks a roll, I was really impressed by the quality. The service and ambiance was nice but not too impressionable. \n\nThis review was based solely on the rolls we had while eating at the restaurant, and the additional rolls I had ordered for take-out. \n\nI will be back to try out their specialty rolls and other stable Japanese menu items. Consider this my quest to either overthrow the Yelp bullies, or to nod my head in agreement with the average 3 star rating.", "author": "Yannie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "We had a great dinner and great service here tonight.   Over 50 different rolls and a variety of fresh fish.    I enjoyed it.   It was great value and overall, a nice little sushi joint.", "author": "Mark W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Price and value is the the deal maker here. You can't expect to much for the small money you pay. Big portion, quick service", "author": "Christoph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Started off with a whole bottle of plum wine for only 15 bux. The rest of the food flowed in wonderfully.. Aged(fried) Tofu was so tender and crispy, tiger eye(smoked salmon wrapped in octopus) was small but packed with so much flavor, worth a try and I had a lobster salad roll which was wrapped in cucumber than rice. All delicious and nicely plated.\nFor dessert I had the Fried Green tea ice cream and man.. it is better than cake! I'm so hooked!", "author": "Edith R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "A good sushi place, not much else to say. Very comparable to most other sushi places. A good place to stop for a healthy lunch", "author": "Harley H."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}