{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Tasty sushi rolls at a great price! Everyone in the restaurant is very nice and attentive. I have been a customer for several years and have never been disappointed.", "author": "Ewa O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "To preface my review: for people living outside of Brooklyn Heights, I'll admit that this isn't the kind of place worth going out of your way for. On a street with an ever-growing roster of trendy, interesting restaurants, Mitoushi feels somewhat like the ugly sister by comparison. However, with its affordable prices and spacious seating, I can see how this place would make it into the regular rotation for locals, especially neighborhood families looking for an un-pretentious dinner at the end of a long day.\n\nThe food was filling and perfect for a sushi fix, nothing glamorous or innovative--though the staff really flexed their creative muscles when naming the rolls (not sure how much I want to put something called a \"Putin roll\" in my mouth). An order of tempura offered a nice variety of veggies, but unfortunately the batter was heavy and cake-like, making it hard to get more than a few bites before feeling bloated. The typical sushi rolls (California, tuna, etc.) were what you'd expect (inoffensive, B-quality ingredients).\n\nSimple, straight-forward, and utterly \"normal\" on every count.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Great Sushi even better prices! \n\nThis is definitely my go-to place for reasonably priced sushi in Brooklyn. I have never been disappointed.  It's a mellow spot, fresh sushi, friendly and fast service. \nI really like all basic rolls like the yelowtail cucumber, spicy tuna, or shrimp rollat $3 but the special rolls are awesome.  The vixen roll,sweetheart roll,Kamikaze roll are among my favorite.  The miso soup hits the spot everytime and their salmon and scallop sashimi melts in your mouth!!\n\nGreat spot to go before or after the movies at Court Street!", "author": "Malika R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-27", "description": "I am very confused by the high ratings for this place. I feel like some reviewers have given high ratings because they're less expensive than other sushi places or because they're open late.  \n\nThe first time I decided to venture in was for sushi. Subpar on all accounts... not fresh, not well cut, not satisfying, not in the least bit. \n\nAfter avoiding for over 2 years, I noticed a sign for ramen. I decided to try it again. Bad idea. I think I could have cooked a better meal with frozen vegetables (which they seemed to have used) and a package of Top Ramen. I barely touched it. I left hungry so I decided to go two doors down to Damascus for a snack. \n\nThis is the kind of place where you ask yourself... \"How is it possible that they're still in business???\"\n\nI don't like giving negative reviews, but I also don't like forking over $ + tip and leaving like I just got taken.", "author": "Josephine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-23", "description": "I ordered sushi from here last weekend and it was ok. It wasn't bad enough I would never eat here again but it wasn't good enough that I would run back and re order. The sushi was ok but I have had better and the teriyaki vegetables were not what I expected. They came with nothing on it and were basically just steamed. If that is what I wanted to eat I wouldn't have ordered Teriyaki vegetables.  My bf like his meal a lot better then me but for the price I will not be ordering from here again.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "This is definitely my go-to place for sushi in the area. It's a low key restaurant, but with great food, friendly and fast service. \nI really like basic rolls, and Mitoushi's are perfect. Salmon hand roll is excellent.  \nThey also have a large selection of hot items (such as noodles, tempura, etc.), and plenty of more elaborate rolls.", "author": "Michel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "A cheap convenient neighborhood sushi spot. The sides are great, like garlic broccoli, crabmeat mango salad. Delivery and service is very fast as well.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "Order takeout from here at least once a week. Quick delivery and great quality fish.  Favorite items so far .. salmon sashimi salad (with seaweed salad) and the summer roll. Everything I have had is great and takeout sushi is definitely a touchy subject.", "author": "Dara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-27", "description": "S usually comes here, but I haven't been here before and I am thinking is this place any good?\n\nThe service was nice, but when the waitress was telling S the special. I went to the wash my hands and so I didn't hear the special.\n\nS informed me that we got a \"special\" roll.\n\nS said let's get shu mai - I said, you know that's just like packaged shu mai and not homemade. Nevertheless, I said order them if you like them.\n\nS was in between Wasabi Lobster Roll spicy. crunchy shrimp, kani, lobster meat wrapped with soy paper or the Michelle Roll mix spicy. crunchy tuna, salmon, mango, cucumber wrapped with rice paper no rice.\n\nI thought the mango might be on the sweet side and it's not mango season, so I said let's do the Wasabi Lobster Roll instead. \n\nWe ended up sharing the following:\n\nShu Mai - same stuff you can get at the Asian markets - seriously. I wouldn't waste my money on this, yes it is good, but crap it is processed food and you can just buy it yourself for half of the price.\n\nPork Gyoza - standard, nothing special...perhaps if I got the shrimp, I would have more of an opinion. \n\nTuna Tataki - I got this, since I love tataki and S never tried this before and S loved it.\n\nSpecial Roll - seriously, when this roll and the Wasabi roll came out - they both looked the same. If I knew S ordered this Special roll, I definitely wouldn't have gone with the Wasabi route. They were to similar - they totally tasted the same and there was nothing special about that special roll. Was not into neither rolls - supposedly the special roll was fried, but both rolls tasted like they were fried. Like seriously, the waitress was nice, but she should have said oh the roll you ordered before is exactly like this wasabi one. Since unbeknownst to me did I know S got this \"special\" roll.\n\nSpecial Ramen - the broth was full of flavour, a tad salty, but pretty good. Could be better if it wasn't as salty as it was.\n\nBut still, the service was nice and friendly.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "Love the food but most of all the service. I come here often with my bestie but she comes here more than i do. The owners always send us complimentary appetizers and sake. Love the fried squid appetizer", "author": "Rosanna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "It is cheap. \n\nI don't want to be to hard on this place. Simple, affordable sushi is tough to pull of in NYC. But it was very so so. \n\nFish was bland. Miso soup was thin. Tamago was not good. \n\nThe sushi options around here aren't great. Perhaps go for a burger or middle eastern food instead.", "author": "Erik F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "Seriously, the sushi here is spectacular. I mean, for the price you really can't ask for more. I've been here twice and plan on coming back until I've tried each of those special rolls.. hahahaa. Man, they're just that good. \n\nLast time I went I had the caribbean roll. It was so yummy.  The sauces were incredible, the sushi tasted so fresh. And they take such care to make sure the food is visually appealing, too. I think those chefs are having a lot of fun back there. But who can be  mad at that?\n\nNext time I come I need to get my hands on one of those entrees as well.", "author": "Ana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-25", "description": "Came here with a friend for lunch.  I'm not big on sushi, so I got one tonkatsu combo box lunch special.  The soup and salad came out first..my soup was a little too cold for me (although it made it easier to eat).   Everything else, however was pretty decent.  The pork was deelish and I was happy with my choice.\n\nService was acceptable and price was decent.\n\nI would probably come back if I'm ever in the area again.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "Alright, so I obviously am not holding Mitoushi to the same standard as I would higher-end sushi restaurants like Yasuda and 15 East, but as far as midrange sushi restaurants go, my lunch today was about as good as it gets.\n\nI sat at the sushi bar, and after ordering, the sushi chef passed me a tempura fish appetizer on the house, which was obviously really nice of him! Miso soup was standard. The sushi was amazingly fresh, and the fish had a much better texture than I've ever tasted at such a casual spot. Not to mention, this place is cheaaaap, or rather, inexpensive (I don't want to suggest at all that the quality is cheap). \n\nI could definitely see myself taking a slight detour on my way to Trader Joe's fairly often to take advantage of the $6.95 sushi lunch. Yes, you read that correctly! Less than $7 bucks for wonderful quality.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "Mitoushi is my favorite sushi spot in that neighborhood. It's a casual place, but the food is above par. My boyfriend and I take advantage of this place a lot; in fact, we're heading there later this week. I'll usually get sushi or some maki rolls while I'm there and since the selections is so big I haven't got through it all yet. Some of my favorite maki rolls are the Lion King (shrimp tempura and cream cheese on the inside, eel and avocado on the outside), Snow Beauty (spicy tuna, mango on the inside, crispy kani on top with eel sauce). As far as the sashimi I'm big on Tuna's and have gotten the Toro, Yellowtail, and a few other pieces that have all been really good. The sashimi is fresh and seems to be of good quality. \n\nOne reason I wouldn't give them a 5 is the service. Some of their waiters can be a little pushy and extremely unfriendly. Not enough to make me hate the place because the food really is a great value, but it's something I think they should work on. The decor is pretty modern from what I can remember. Nothing crazy nice, but definitely sets a nice atmosphere. \n\nOverall I would recommend this place to anyone that asked me for a good sushi spot. They also have entree's that I'm sure are great. I've seen plates on other tables while there and the presentation and value looked just as well as the sushi.", "author": "alicia c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "I use them a lot on seamless. They're great. I've never been disappointed. And there ginger is always fresh and never died pink!", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "I always like to wait until the next morning when reviewing sushi, juuuust in case I get food poisoning.  Happy to report I have not!\n\nI spent $3.21 on dinner here.  Win win win.\n\nAfter moving to the new 'hood, I was determined to find a good sushi restaurant.  And I am pretty sure I found it!\n\nI walked in to get take-out.  First impression: wow, restaurant is nicer than I expected.  It looked clean, not cramped, and pretty new.  Decent business for a Wednesday night at 9PM too.\n\nCan't beat $2.95 for rolls...specialty rolls were on average about $8.  Pretty good!\n\nI only wanted one roll, so I ordered the alaskan roll ($2.95).  I noticed on the menu it said it came with smoked salmon, which i really dislike the taste of.  So I asked if it could be regular salmon.  The bosslady nodded but I honestly wasn't sure if she understood me because a) she never really made eye contact, she was always looking elsewhere b) i didn't see her tell the chefs b) i didn't see her press any special buttons on the computer either.\n\nSo when the my roll was ready, I asked her once again if it is just regular salmon and not smoked salmon, you know, just to be over anal about it.  And she reassuringly said yes :)\n\nWhen I got home, I devoured the roll. And it indeed was made with regular salmon.  \n\nI'm a fan of this place not only for its speedy service and very reasonable prices, but also because they do not put a lot of rice in the sushi.  Just a thin layer, which is perfect.  And my salmon chunks were nice and big.  So happy.\n\nI will DEFINITELY be ordering more from here and I plan to sit down to enjoy a meal as well.  Looking forward to it!\n\nP.S.:\n$10 credit card minimum.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "I was craving soba noodle (something) and ordered the soba noodle entree for delivery along with the gyoza's. The delivery was fast and the food was ok. Though I think I should order sushi next time around, since that's what most of the reviewers rave about...", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-14", "description": "Had a nice dinner with my girlfriend here last night.\n\nI think this is the same restaurant that was here before and now remodeled and shiny new.  They were playing everything from the Lady Gaga/Britney Spears/Rihanna catalog. I think they stole my 9 year old niece's iPod.\n\nAnyhow, they do have quite good sushi here, and the rolls are only $3 (not the fancy \"chef's special\" rolls, but your standard spicy tuna, salmon, etc) which is a great value, and the house special rolls are between $7-10, and are twice as big as the regular $3 rolls. This = good value as well. Nigiri sushi is $1.50 apiece.\n\nJapanese bottled beers are $3.50, and with shumai and gyoza appetizers ($3.50 each) we ordered several rolls, several pieces of sushi and the aforementioned beers and the total was about $43.\n\nService was attentive and definitely not annoying, and it was kind of dead at 7pm when we walked in. There were only 2 other tables and they both finished by the time we rolled out. They were CRANKING the A/C in here, which I am a fan of, but my girlfriend asked for them to kick it down a notch and they did so right away.\n\nI'll keep this place in the rotation for delivery/carryout and dining.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Good Food. Good Lunch Specials (Choice of Shrimp, Chicken, or Beef served with rice, veggies, and vegetable dumplings) + 1 California Roll + Misso Soup + Salad all for under $10.00.\n\nI like this place!", "author": "Tiwana E."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}