{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Yesterday owner here with 3 other crew members during our walk away lunch. The place is very quaint. They have plenty of house style rolls which provided a variety of flavor and options. \n\nSince I was there for lunch I ordered the Undanon which is eel over rice. I also order a Bay Bridge roll which is eel and cream cheese fried. As you could see I was in the mood for eel. \n\nThe lunch special Undanon was very beautifully done. It was placed into a plate and kind of like a deconstructed eel roll. It had long eel pieces over a circular bed of rice. The Bay Bridge roll on the other hand wasn't what I expected. The taste and flavor were spot on but I was expecting a crusty outer shell since the description said fried. In reality it was covered with soft fluffy white rice with an inside crunch. \n\nIn the end I was fully satisfied with both the food and service.", "author": "Jonathon H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-03", "description": "Yelp, you led me wrong! After reading the good reviews, we went to this place last night. Maybe it's because it's Tuesday and fresh fish comes in for the weekend, but we were served bad fish. Because of the good reviews on yelp, I made the rookie mistake of ordering a bunch of rolls instead of testing 1 or 2. The reviews are right - this place is cheap, so imagine how many rolls I got when my bill came up to about $60?! My husband and I both hate to waste food, but we couldn't bring ourselves to eat the rolls - I powered through and ate the shrimp tempura roll since it's cooked, but the other rolls were drenched in mayo (to hide the bad taste), or tasted like they shouldn't be served. We didn't make a big fuss of it (I know it's hard to be a small business owner), paid our bill and tipped our waiter 20% on the total, as we do. \n\nOn the way out, I whispered to the owner that the fish was not fresh. She just got defensive and said, \"No one's ever complained\". So, that was that. \n\nIt was so bad that we had to go to Hibino to save the night or else, we may be scared of sushi for months to come. On the way to Hibino, I was praying that I won't burp because of the gross feeling we had (I later got sick). \n\nMaybe it was an off night, but I will never go back. And if you're considering going here, I'd probably not go on a Tuesday.", "author": "Susan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "Came highly recommended. Very disappointed. Delivery took one hour. Sushi was warm. Tempura was soggy. Miso soup was best part of the meal. Next time I will order sushi elsewhere.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "This is my first Japanese restaurant outside of Manhattan.  Okay, so I didn't expect a river separating two boroughs to be a cause for concern.  Needless to say, Brooklyn lived up to expectation.  Okay, now on to the review.\n\nThe first thing I noticed upon entering was how nice the ambience is.  The place is really nice.  You can tell they spent a decent amount of money on the decor.  \n\nAs for the food, I had the sushi love boat and it lived up to Manhattan's Japanese restaurants.  I would venture into saying that the sashimi is better than most Japanese restaurants in Manhattan.  Really.  I highly recommend this place.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "Excellent customer service, try the spice girl roll. Not crazy busy but you know know it's good because it's a spot where all the locals go.", "author": "Louis S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "I stopped by this restaurant with a friend today who had previously recommended it to me. Right off the bat you notice the quaint, relaxed ambience of the restaurant. There were but 4 patrons other than my friend and i who were sampling their wares. Being about midday i chose the lunch special sushi/sashimi combo along with a side of gyouza and shumai. I was a tad disappointed that takoyaki wasn't on the menu and our waiter smiled and apologized. It's not his fault but i had a craving for octopus. \n\nAt any rate, the miso soup that came with the lunch special was nothing more than salt water and the gyouza and shumai, while tasty, barely had any meat inside and were nothing but wrapper. The sushi and sashimi, while aesthetically and artistically well presented, were lacking a bit in taste and portion size. I expected a little bit more bang for my buck that what i received. I wanted to try a dessert but given the disappointing portion size of the sushi and the nothing but wrapper gyouza and shumai, i decided better of it and passed. Would i come here again? Quite possibly but only if it was the third or fourth choice in a list of restaurants my friends and i wished to visit.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-29", "description": "Mitoushi is the former Shinjuku and apart from the name change, everything else is pretty much the same from the decor, decent sushi, and great prices. \n\nI can see the appeal - $1.25 nigiri and $2.95 rolls make it a cheap place for a sushi dinner. I had the lunch special - miso soup or salad, 5 pieces of nigiri, and a california roll for $6.95. It was a good deal but the sushi is average. Not that it's bad sushi. The fish is fresh but the rice is just too dry. You can pay a little more for better sushi around the area during lunch.  \n\nThe new management and staff are really attentive and polite though and combined with the good prices especially during dinner time, Mitoushi is not a bad place for sushi on that stretch of Atlantic.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "Beware the user. I have ordered delivery from here numerous times however this past week will be the last. It's exhausting to place your order and end up receiving something else-or nothing at all time and time again. Wrongly prepared items, missing food and uneven dishes have finally convinced me that it's time to move on. Do yourself a favor and don't waste your time (and moreover money) \"ordering\" from here (I emphasize ordering cause that's the only successful part of the transaction-you won't get what you ordered) and order elsewhere.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Great sushi, I ordered the combo.box, California,  Shrimp Tempura Rolls, Philadelphia, Spicy Salmon and Alaska Rolls. They were all fresh and delicious. The waiter was very kind and attentive! Would definitely come back!", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Been coming here for years. The food was amazing or at least it used to be. Sushi is good but quality hasn't been the same for a while... not sure if they switched the staff...", "author": "Ching I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "I just love this place, they have a great selection of fresh sushi, great service in a charming atmosphere.  I've been here 5 times and haven't been disappointed in the least. Nigiri pieces and rolls are a good fish to rice ratio and worth every penny. The spanish mackerel is to die for, the best I've had. The only reason they don't get 5 stars is because their selection, while great, still lacks unique choices like butter fish sushi for example. Still, an enjoyable meal overall. I'll be back everytime I'm in the area. I would highly recommend this little place.", "author": "Yvrose C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "No complaints really but not blown away. Between the two of us we ordered 3 of the chefs special rolls. It was quick service but there weren't that many people in there for 6:30 on a Saturday night. To be fair, they seemed to be doing a pretty steady takeout. The rolls themselves were tasty. We ordered the Lion King roll (this was by far the best one), New York roll, and the Hot Lover roll.  The ambiance and decor were pretty average. If you want pretty good sushi at a good price check this place out.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Delicious!  Can't say enough about this place.  Their sushi is consistently good.  Came here last here and food was still good.  The spice girl roll is my favorite.  \n\nService was great.  The waiter was always nice and attentive.  The place is always clean.", "author": "Diana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "This is my go to place!! Love this place. The food is fresh and very delicious . The service is great and it's not crowded like other sushi spots. This is a great spot to relax and feel comfortable in.", "author": "Gina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Stopped by on my way back from Red Hook.  Service was prompt and courteous. Prices in line with Japanese restaurants in Manhattan.   My friend and I each ordered a bento box and while we ate what was served, neither of us was impressed with the food--maybe we should have ordered sushi.    The tempura batter was more like the coating on a French fry than a typical tempura batter, and the sauce that accompanied it was watery.  The shumai was served in vinegar.  In sum, reasonably priced for the quantity of the food but quality could be better.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "Before I moved in the area, I knew of this place and have come many times in the past for sushi and drinks. I can honestly say I had no complaints. The sushi was always fresh and the drinks were cheap. One night, I was about to order for pick-up using grubhub. Before I placed the order, my roommate insisted that the prices on grubhub were incorrect and that she'd never paid that much, however I was there a week prior and ordered take-out and paid over $10.00 for just two rolls. To prove me wrong, she called up, ordered her usual two rolls with a miso soup. Needless to say, she paid less than I did, and the prices that were on grubhub were significantly higher than what appeared on her receipt. \n\nI'll be generous and give them three stars for the great specials they offer.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Yelp's rating here is wrong.  This is just not good food.\n\nI should have listened to my gut and passed when I walked by, but we were hungry and it was going to rain.\n\nWe didn't feel like sushi, so I went with chicken teriyaki app + salmon teriyaki entree, she went with the nabeyaki udon.  Both were poor choices.\n\nFirst, my chicken teriyaki.  I wasn't sure it was chicken, the texture and taste was just out of whack.  The teriyaki sauce was watery, flavorless, and marginal.  My salmon teriyaki entree was marginally better in that it was somewhat edible.\n\nThe rice I got with it tasted like it had been made at 10am that morning and left out - just old, a bit rough, a bit crunchy . . .old.\n\nHer nabeyaki udon was pretty funky too.  She described it as \"everything that was supposed to be something, was something else.\"  Cooked veggies were raw, noodles were underdone.  Her egg, which would normally be poached, was a hockey puck.  The broth was bad.  All in all, not a good dish at all.\n\nNet net, if you want quality Japanese food, go anywhere else - this is not a winning restaurant by any means.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "Decor/Ambiance 4/5\n- Very clean inside. The place was kept well, and looked newly renovated (even if it wasn't). The lighting is a bit more bright than I am used to for dinner. But maybe I'm just a vampire. \n\nService 5/5\n- 1st time: We arrived very late into the day ( I believe it was almost 11). The staff made no complaints and were enthusiastic in helping us. We sat at the sushi bar, and the chefs were always smiling as they made our orders. My drink refilled within seconds. \n\n- 2nd time: We ordered delivery with 10 minutes left before closing. They delivered with a smile in the cold. Dedication folks.\n\nFood 3.5/5\n- Not the best sushi I ever tasted, but well worth it for the price. The titular roll (Mitoushi) was pretty good, as well as the Tiger Roll. The Lobster King Roll was kind of bleh. But you can't win 'em all. The Spider Roll was also pretty good. \n\nBottom Line\n- Go for the price. Stay for the kindness and good service.", "author": "Edward Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "I came in for their lunch special!  Sashimi special for $9.95 even on weekends.  Talk about a great deal!  The servers/waiters are very nice and patient. My waiter was happy and offered us hot water to drink as we came in today.  It's a bristling 32 degrees Fahrenheit outside.  Great timing for some sashimi, I say!  I loved the quality of the fish used in the sashimi.  The salmon was meltable in your mouth, and the tuna was smooth and refreshing.  I must add that their miso soup is well balanced, plenty of seaweed, enough tofu(fresh, not freeze-dried) and sweet. There is light FM/top 40 playing in the restaurant, yet I cannot expect every restaurant to play John Coltrane or Bach/Mozart.  Overall, it was a very pleasant experience.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "Low on price, high on quality!  For ~ $25, we ordered: \n--- Salmon sashimi at $1.25/piece x 5 pieces (most a la carte sushi or sashimi is at this price)\n--- Sweet shrimp $1.95 x 2 pieces\n--- Yellow tail roll at $2.95 (most rolls starting at $2.95)\n--- Chirashi $14.95\nhttp://www.yelp.com/biz_photos/61HfCnnk6-SlvAuutOFntQ?select=bmEYd6_8z2yncDMOOMYr6A\n\nEverything tasted so fresh!  And we had very attentive service!\n\nWord of warning though: if you sit by the window on a sunny day, eat your sushi fast!  Warm sushi does not equal fresh sushi!", "author": "Jeanne L."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}