{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-04", "description": "Decided to visit this spot with the hopes of contributing to the local neighborhood small business. MISTAKE!\n\nOur waiter had the most bored look on his face almost a \"I hate my job\" face. We sat down and it was 3:35pm and our waiter said we were too late for the lunch special....really? It's only 5 min COME ON!\n\nOK OK ...fine well just order some appetizers and rolls. BLEH the rice on the rolls seemed soggy, tuna kind of old and just bland and boring. \n\nUtensils, glasses and plates spotty...\n\nJust an unpleasant first and only visit.", "author": "Raymond T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "I love this place!! The sushi is fresh and delicious.  Their rolls are interesting and flavorful.  Favorite rolls : Sheepsheadbay Roll - Lobster, avocado, kiwi, Snow Beauty Roll - White tuna, spicy tuna, avocado, mango, and kani crunch.  I usually order a side of fried noodles, odd I know, but its stir fried ramen noodle with scallions.\n\nthe staff is just  as good as the food.  Friendly and welcoming.  the prices are so reasonable that I refuse to go anywhere else because i will spend double and get half.  \n\neveryone needs to eat here!!", "author": "Cindy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "YAYs! \n- It opens until 11pm or 12am! (perfect for late night miso soup cravings)\n- It's pretty darn cheap.\n- It's super close to where I live...AND...if I am super lazy, they also deliver for free! I never do this...hahaha....\n- Mmmm...salmon skin salad \n- For some perhaps odd reason, the manager encouraged us to sit down when we walked in close to closing time and promised to bring over sake (on the house)...and drank with us...and brought over more sake...and proceeded to stare me down until I downed my whole cup...which was a little crazy but a lot awesome\n\nHMMs\nMy only minor quibble with this place is that they tend to use a lot of the spicy fish mush instead of nice slabs of sashimi for their sushi rolls. However, it's not like anything is seriously expensive, so it's really kind of a you pay for what you get kind of thing :)", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "Lunch was a good deal but pretty much average.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Love boat for three. Freaky three-way number for a love boat, but I was left satisfied. The fish was fresh and the variety of fish really gave you a different taste and consistency with every bite. Some of the fish were cut into 4 pieces, so we had to do some diplomatic exchanges to who eats which fishs' last piece.  I'd trade a white tuna for a red snapper easy.  Damn, that sushi/sashimi boat was good. Highly recommended.\n\nAlthough there wasn't anything special with the lighting or seating, I felt like it was the right theme for eating good sushi and getting out to the next adventure.  \n\nThe waiter was attentive, but not annoying. He gave an excellent suggestion for the red snapper sashimi.  Enjoying this place and writing a great review was effortless.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "One of the cheapest sushi places with rolls for $2.95 and with the number of people that go here, the sushi is pretty fresh. Have never been disappointed.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "Chirashi delivered to my front door. Winning!\n\nTheir lunch specials are amazingly priced and the fish was thoughtfully separated from the sushi rice. The pieces of fish were cut thick and evenly (no see-thru pieces here!) and packaged very pretty. Most of the time when I get delivery my boxes are all crushed or haphazardly thrown together. I even had fake sushi grass and a wedge of lemon to keep my sashimi fresh. I haven't visited the restaurant yet but its only a matter of time.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Best place for inexpensive sushi in my experience. I won't be too detailed but here goes. The rolls are incredibly CHEAP ($3-4) but they are good. The fish isn't going to be the best you've ever had or close to it but it's fresh good quality fish. Had the shrimp tempura also, a lot crispier than most tempura I've had, generous on the panko? I have no idea.\n\nBut whatever, this place is great. It's cheap for what you get. Actually it's almost twice as cheap as some places I've been to yet retrain a higher quality. I find it odd that I pass by mitoushi and see it relatively empty sometimes.", "author": "De C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Deliciousness at incredible values. My go to delivery place in the nabe.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "This place is very nice. The sushi and sashimi are good for the prices, the ambiance was very nice also. The staff was nice too... The only thing was that the waiter seemed a little distracted with the other customers because he did not check back with us, like other waiters would.", "author": "Bert K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "i love this place! Best sushi in Brooklyn. 3 rolls for $10 special is always great. Hibachi dinners are awesome. I literally traveled in a blizzard to get their sushi I was craving! I recommend everyone to at least try this place. I've never been disappointed", "author": "Leigha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Such a friendly staff! I find that sushi places often have rude/non English speaking staff, but this place is opposite! They speak very well English are very nice. Their delivery guy is soooo friendly! Food is great too I order here often and they are pretty fast too. Good spot!!", "author": "Sannie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "Cheap but not very good. Messy. Fishy aftertaste. Not authentic. I live right near but never go here. The atmosphere is sort of sterile and depressing and not many people come. I have no idea how it got 4 stars.", "author": "June K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "I love sushi. But it's soo expensive, especially in this neighborhood (Cobble Hill/Boerum Hill/Brooklyn Heights). That's why discovering Mitoushi was such a pleasant surprise. Finally, affordable decent quality sushi! Now I can stuff myself with raw fish without feeling guilty about never cooking dinner at home.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Evening starts with the waiter coming over with a complimentary dish from the chef; I'm sold. Beyond that, the service and sushi are great! Did we mention cheap? Spicy tuna roll $2.95 cheap. Throw some biz their way if ur in the area and want to grab sushi", "author": "Chris B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "You know, I really can't argue with a sushi joint that speaks to the soul with a rhyming name \"Mitoushi Sushi,\" that also has interesting rolls that speak to my own identity, such as \"The Russian Girl Roll\" and \"The Putin Roll\" on their menu.  OK, maybe not the Putin Roll, though I can definitely relate to his love for ABBA.\n\nAnd aside from all this, their rolls are appallingly cheap and still pretty damn good, especially considering the price! I'm a fan.\n\nThey also have an inexpensive beer and sake selection, and a series of fried ice creams that I will certainly be coming back for.", "author": "Julia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "I have been to Mitoushi twice and, yes, I will keep going back but I can't say that I am impressed.\n\nThe first time I went, I did the $9.99 2 roll and soup special. I also got their Kani salad. I got the spicy tuna roll and the yellowtail roll, along with a miso soup. Neither roll was great, neither roll was awful, but I just wasn't impressed. What made this go from 3-stars to 2-stars was the Kani salad - I paid $5 for a small crab stick salad with cucumber, which would have been nicer if it had had more roe or better tasting dressing. All in all it was not awesome.\n\nI decided to give this place a second chance. I got an order of shumai, of shrimp tempura, and three rolls - the Ginza roll, the spicy tuna roll and the shrimp tempura roll. The Ginza roll was awful - dry and the flavor was so bad that I had to drench it in soy sauce and pickled ginger. The spicy tuna was OK, but not at all spicy. The tempura shrimp roll was probably the best out of the three and, compared to a roll from Yoshi, it was a minus. The shumai was all right, but it was clearly packaged. The tempura was a bit greasy and undercooked. \n\nI wish I could recommend this place a bit more, it is so close to so many good bars and local places, but I recommend that people walk down Court Street a bit to one of the Asian or Thai places instead.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Went here with a fairly large group the other night and had a great time. Across the board everything worked at this place, fresh sushi which was excellent as was the service. I was a bit surprised that when we ordered some Japanese beer ( I think it was Saporo.. at that point I was well on my way) that it came out in pitchers.  I don 't think I've seen that before in a sushi place but we had no problem getting rid of the contents. The eel hand rolls were particularly good. If your in the area and looking for sushi this would be an excellent choice.", "author": "Bif P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "I came to Mitoushi on a Thursday night with a large group of people, but we were seated immediately and the servers were accommodating for those of us who had to leave early and pay separately.  \n\nOn top of the great service and nice atmosphere, this place is cheap and delicious.  The only other places I've seen with $3 rolls have been sketchy or only offered takeout.  For a sit-down sushi dinner in Boerum/Cobble Hill, you can't go wrong at Mitoushi.  Aside from a great value on sushi, their beers are also affordable and I will definitely be back!", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "For all the expensive sushi places in this neighborhood, this place offers a good quality delivery service at a very reasonable price. \n\nI've ordered from them a handful of times and have been almost consistently impressed by the portions and quality of the food.  From the soups to the sushi rolls, this place is my go-to for sushi delivery. \n\nI can't say that the fish is the absolute best, but for $2.95 a roll, it's good enough to keep a picky low-income student very satisfied.  Plus, the delivery service has yet to disappoint.  Some of the deliveries have been substantially faster than others -- but never too slow. \n\nPretty good place. I recommend it.", "author": "Richard G."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}