{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-02", "description": "Have been back a few more times and am happy to say that they've gotten their act together.\n\nThe current management team does a much better job than the previous one, which tried to ingratiate itself with customers by giving them free hot sake that was 1. cheap sake and 2. overheated to the point of screwing up the already crappy taste even more.  Now they no longer give out free sake, but do a much better job with their food in the first place.\n\nThe grilled whole squid is pretty good, and they have a good variety of specials most of the year.  Many other cooked dishes were also decent.\n\nThe main point, however, is of course the raw fish, which has improved substantially over what was offered by the previous management.  Though you only get one piece of sashimi for each a la carte order, remember that that order is only $1.25.  Stick with the sushi for better value.\n\nFor my part, I am doing the low carb thing, so I order sashimi platter with soup AND salad instead of rice and soup or salad.  They are happy to make the substitution at no charge, and service is very polite and efficient, though at times a little pokey when the place gets busy at lunch.  But I don't blame them for this because lunch crowds from work tend to ask for separate checks which take a lot of extra time for waiters.\n\nIn any case when I don't want to cook and don't want to splurge at Ki, this is my preferred place.  Now that Migita is closed, this is pretty much the top budget sushi place in the area.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "This is one of the best places to get sushi in the area. The quality is great and the prices are even better! Two dollars for a bowl of miso soup? Yes please!! \n\nMy husband and I come here very often; the neighborhood is very conducive to taking a walk and this is a common stop for us during lunch or dinner hours.", "author": "Dora E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I order here at lunch and I recommended this place to my coworkers. Their prices are reasonable with great lunch deals. My miso soup tasted a bit watered down but the rolls are great. The spicy salmon is my favorite.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-22", "description": "Just had delivery from here for the first time. It came quick but is pretty mediocre.", "author": "anna w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "Walked in here after I successfully persuaded my friend to try Japanese food.She ordered the California Roll (perfect for an introduction) and I ordered a huge plate of sashimi.The service was swift and the food was fresh and well-made.Did I mention that this place is squeaky clean and super well-organized?I'll definitely be back here,especially now that the weather is steadily heating up and fresh seafood just makes sense as the perfect summer lunch.", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Sat at the sushi bar for dinner and although we didn't have much interaction with the chefs, the rest of the wait staff were great. I'm giving this four stars based on the sashimi and rolls we ordered. Although none were original, the freshness of fish was great as well as the prices.", "author": "Lance W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "This is my go to sushi place when I want cheap tasty sushi. You can leave here stuffed for less than 20$ for a dinner with two. Great for a date, and awesome for big lunches. The reason I don't give it 5 stars because the quality of the fish and rice is not always 100% fresh but what more can you ask for with 3 dollar rolls?!?!", "author": "Trae L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "When I first started to eat here I was a fan. It almost became a hidden gem. I have eaten here multiple times. But, one of my most recent times my friends and I were served old sushi. It was so gross. I wouldn't believe it we were so disappointed. But, I decided to give it another chance. I decided not to order sushi but, it came with my meal. After finishing our meal the waiter came over with the check. She wouldn't stop looking over and seeing if we had already put the money in. We were uncomfortable but, still enjoying our conversation. As my friend started to sign the check the waiter came over to wait for it. She brought back my friends card and say I hope you know the tip isn't included. My friend and I were baffled we laughed because it was so absurd. Of course we left no tip and I have no desire to go back there again.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "Ordered through grubhub. Delivery time estimate was 40-50 mins. The order arrived after 2 hours. I called the restaurant 4 times and each time they assured me it would arrive \"any minute\".", "author": "Albert H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-13", "description": "When the current owners/management took over 5 years ago, the fish was DEVINE. Melt in your mouth sushi. Over the years, they have slowly brought in cheaper quality fish. Flavorless. And the size of sushi has shrunk to nearly half it's original size  . Yes it's $1.5-2 per sushi piece and that's sounds like a deal but not really when you take into consideration how flavorless and tiny each piece is. Will never go here again. If they are cutting corners on their fish, they are sure to be cutting corners elsewhere. Do yourself a favor and walk to Ani on Montague. Ani actually improved their menu and fish from mediocre to something worthwhile.", "author": "lea h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "A standard, very friendly, and cheap sushi restaurant with all the favorites.  No. it's not sushi of gari, or yasuda or anything else.  Just a serviceable restaurant for a quick and relaxed dinner.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Favorite local sushi place.  The restaurant is never crowded as I think they do killer on delivery.  We probably order delivery from them about twice a week and eat there every other.  For the outstanding sushi, they prices are hard to beat.  Delivery is always fast and friendly and dine-in is a totally pleasant experience.  Wait staff is beyond friendly and attentive.  If you live in the neighborhood it's a must.", "author": "Catie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "I'm lucky to have this right in my neighborhood.  This is our regular sushi place and they really do have some of the freshest fish that I've ever had at a sushi restaurant.  The service is nice and so friendly!  When you, definiently see what is fresh and what the specials are for the day, you won't be disappointed.  We've tried things like live scallop and tuna belly amoung others, and they are always amazing.  The rolls sound standard, but are elevated by the freshness of the ingredients that they use.  The rolls are a great value, standard rolls are $3/roll.  Delivery is always fast and fresh!  So lucky to be so close to this place!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "I liked this place!  The prices were great, for a sushi place ( $2.95 for a roll, 12.95 for a 9 piece sushi platter with soup).   The sushi itself was good, especially for the price.  \n\nI was surprised that this place wasn't more crowded, considering.  They seem eager to get you to come back:  when we mentioned we lived in the neighborhood, they gave us a free serving of sake!\n\nA solid choice, if you're in the neighborhood.", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "After a movie, wifey and I needed some grub in the area so we scoured Yelp and found Mitoushi. It's a nice atmosphere, tall ceilings, attentive wait staff, and reasonable prices. The food was good and I'd definitely go again.", "author": "Seth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "I love the veggie udon soup. And practically everything else, for that matter.  The ambiance is nice, quiet but not overbearing, and the staff are friendly and attentive.  Rebecca the hostess is my favorite. Lunch specials are great. The only problem is that I eat out too much :(  Good for them and my belly, sadness for my wallet...", "author": "Zen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-23", "description": "A great place to order take-out from!  The sushi is the freshest of all the places I've ordered take-out from in the area.  I have never been to the actual restaurant and  would most likely not go because there are some pretty amazing sushi restaurants around that are probably superior.  However, when it comes to take-out sushi dinner extravaganza time, this is a solid choice.  Everything is available with brown rice, even the rolls and sushi a la carte.  The BBQ squid appetizer is one of my favorites.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "Super cheap and super delicious. I get their delivery all the time. If you're on a budget, and love sushi, definitely check this place out.", "author": "Jared A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "I order from here once or twice a week and have been working my way through the menu. The food is always fresh and delicious- I've had miso soup at numerous Japanese restaurant's and usually it's all the same, but here it is SO good, and so flavorful. I live pretty close, but even so they are so quick that I know they must start working on my order as soon as they receive it. It also helps that the rolls are inexpensive!\n\nDefinitely one of my favorite sushi spots.", "author": "A G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "This is my first review of a business ever but I am so disgusted I had to write about my experience at this restaurant. 1. flies hovering over my food. 2. they moved me to another table and flies continued to hover, 3. dirty glass. 4, USED MY CREDIT CARD FOR A DIFFERENT TABLE! and then asked me if I had received my check yet! They ran after the people and got my card back. I pointed out that the other table had signed the receipt and and they offered to void my receipt and not charge me. They gave me the void receipt and guess what? yes, today I see that I was charged. And I never even signed the receipt.  5. I called the restaurant just now and asked very politely to speak to the manager and the woman hung up on me TWICE. Yes, as someone else who reviewed this restaurant wrote, I am wondering how this restaurant stays in business.", "author": "Michelle K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}