{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Super fresh fish. I even make sure to check for uni on Tuesdays - and you don't want to eat that just any old place. Decent portion sizes. Good prices. I have been eating sushi/sashimi all around this neighborhood. No one else even comes close for quality. There are so many other Japanese restaurants in the area who are closer. But if you want the best...sometimes you've got to walk a few extra blocks (or call for delivery) Chill room room. Big space. Nice music. Never a crowd at lunch.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Excellent Japanese food at reasonable prices. Waitstaff is always incredibly friendly and the food consistently delicious. Highly recommend the lunch boxes if you work in the area.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-11", "description": "We decided to check this place out as we were craving sushi so with a quick spin of urbanspoon we were on our way upon arriving here it was pretty empty and seemed to have the ominous feeling (one of those places people avoid because noone is inside). I ordered small order Gyoza, Moscow Roll (Spicy Salmon,Yellowtail and cavier wrapped in cucumber) and Putin Roll (Spicy Tuna, Avocado, Tobiko wrapped in rice) Note: Moscow roll is the most oddball piece of sushi i had here i couldnt place the taste and not thought out well because its impossible to eat without it falling apart, Putin Fresh and very good overall its  a nice little place with high ceilings and a fresh coat of paint is what is mitoushi it seems like their still trying to set themselves apart and hopefully next time i visit ill be able to give it a better rating", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Absolutely loved eating here. The wait staff is clearly experienced and respectful, the prices are the cheapest I've ever seen in Brooklyn, and the atmosphere is both soothing and refreshing. Stop what you're doing, pause the newest episode of Scandal, and enjoy a night at Mitoushi.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "I visit Mitoushi at least once a month. Every time I bring a friend here for Sushi they are so surprised at the prices because it actually taste great. On one occasion there was a loud party happening behind me, the hostess offered me and my friend free appetizers for the noise. She keeps apologizing for the noise but actually it didn't bother us at all. Really happy with the service, food and price.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "After coming here pretty much every week for the past couple months, I must say that they are the best deal and service in the area. I love that their rolls aren't overdone with too much rice and they are prepared delicately and with care. Service is friendly and quick and they constantly check up on you and refill your water glass if needed. Prices are great, the only thing I wish is that they had a lunch special with just two rolls instead of just one with three. I will be back again and again.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "I have come here for dinner several times because it's so close to my apartment, and I'd say it gets the job done. I certainly don't expect super high quality fish for the price I'm paying, but whenever I have a craving for Japanese food (which is quite often, mind you), I stop by Mitoushi and leave content without a gaping hole in my wallet. \n\nI usually get the Chirashi (my fave, typically at least $25 in Manhattan and nicer restaurants including Hibino down the street) or the Nabeyaki Udon (another fave especially when it's cold out!). I also love getting the Sweet Potato Roll (fried) as an appetizer. (Helloooo 2.95 rolls!) Though I've personally never ordered the other rolls here, my friends have been happy with them.\n\nRefer to my review on Iron Chef House for quick comparisons of the Japanese restaurants in the Bklyn Heights area (namely, ICH, Mitoushi, Hibino, Tenda, and Nanatori).", "author": "Esther C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-14", "description": "For $2.95 rolls and $1.25 nigiri, you shouldn't really expect much else other than a reasonably low chance of food poisoning. And the rolls, actually, were not awful, probably because the relatively small amount of fish in them helped mask the problems. However, the nigiri was basically a $1.25 lesson not to eat discount nigiri (a lesson I will immediately un-learn the instant I see a sign for $1.24 sushi). It tasted not so much \"fresh\" as the chemically preserved equivalent of fresh, as if there were some sort of party in my mouth and everyone's being forcibly embalmed. Actually, it wasn't too bad at first, but the more I ate, the less I wanted to finish. And in fact I didn't finish, which is essentially unheard of for me.\n\nService was friendly, speedy, and very attentive--then again, it should have been, seeing as we were the only customers for the greater portion of our meal--but neither that nor my considerable love for deals is enough to make me return here. This is mall food-court sushi at best, maybe even a little worse. I did pass by recently and see from signs in the window that the store will be closed for a bit while they undergo renovations to \"make for better dining environment,\" so maybe there's hope for Mitoushi yet. Really though, their \"environment\" was just fine--it's their food that needs renovating.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-31", "description": "Tried this place for the first time. Ordered from seamless.  Took an hour to get delivered, was cold, when we called staff was rude.  Not going back cant say anyone should try.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "I've gotten delivery here about 10 times and I've eaten in once. Great for delivery. Very cheap basic rolls. A tuna roll is like $3.50. They have a great lunch special too.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "Somewhat disappointing.\n\nHad seaweed salmon salad, sushi lunch special ... My friend had avocado salad and spicy tuna bowl.\n\nAvocado salad was ok. Spicy tuna was ok to me, but my friend didn't like.\n\nSeaweed salad had salmon sashimi slices on it, and I wished I just got the seaweed salad. Salmon was very mushy, not great tasting. Lunch sushi combo has an avocado roll and 5 pieces nigiri sushi, salmon, tuna, mackerel, shrimp and what I think was fluke. None of the sushi was very fresh looking, and made me wish, once again, that I just got the California roll alone. \n\nWouldn't come back.", "author": "Levi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "This is me and my friends sushi spot when we're in school. 2.95/roll? I'm down. And it's not just a cheap sushi place, their sushi tastes like it should be more expensive. I've tried appetizers and entrees, haven't been disappointed yet. It's a nice place too", "author": "Maimuna I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "the delivery service is great - friendly and in time. I enjoyed Herumaki (spring roll). Avocado roll ($2.95 before tax) was delicious! After eating only these two things i felt so full already.\nHowever, i also ordered spicy tuna. It tasted good as well. But i had no extra space in my stomach so i had to save it for next meal. And it was not it! Spicy girl is huge (10 large peaces) and will make feel full maybe 5 people....so be careful and not order too much since you may not be able to eat everything in once.", "author": "Bella T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "I have now been here three times and I think that it is very good. The fish is fresh, very, very fresh. I have had simple salmon and tuna rolls, sashimi and sushi. Each time the fish quality has been excellent. I think that this is a great place to go in this area. They have filled a void here and they deserve the five stars for their attention to the quality of the fish.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Outstanding food and service, some of the freshest and best tasting and presented sushi and Hibachi we've had!! Loved the Summer and Moscow special rolls, as well as Hibachi Chicken, all with brown rice, and loved Thai iced tea and matcha green tea shakes with low fat milk! 5 stars both times I've eaten here!!", "author": "Jabster L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-26", "description": "I just had a terrible experience with this restaurant. First, it took well over an hour to arrive. Then, the delivery man tried to charge me for the order - even though I'd paid by credit card online. THEN, he berated me for not giving him a large enough tip - even though the tip was MORE than 20%! Insult to injury, this fish is clearly unfresh and poor quality. So disappointed.", "author": "Aly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "This new place is RAW! Can't be too long until the spot gets blown, incredible prices for the amount of quality food you get.\n\nThe staff are extremely attentive and pretty good company if you order enough sake. There's a private room and no-shoes-allowed tables by the windows.\n\nOther places can kiss mi toushi!", "author": "Louise R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "I LOVE this place. Fresh sushi/rolls, and CHEAP! 2.95 rolls, 1.95 sushi pieces. Staff is very friendly and after a few times going they become friends. A lot of locals and regulars come here and if you go on certain days regularly, you'll see the same people and everyone will sort of like become a good group of restaurant friends. Hot sake is bottomless and thier ice cream tempora is great. Decor is very nice and play a diverse selection of music. They seem to do very well with take out as I see at least 20 deliveries leaving during the time Im here. I come here at least once every other week. If you love sushi and eat it often and want an inexpensive but good place, Please come here.", "author": "Cynthia V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "Very cheap, but the fish isn't fresh. The sashimi was tough, and the spicy tuna rolls didn't look right nor did they taste ok. Staff was friendly and the cooked food was ok.", "author": "Alisa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "The manager/owner called the next day to apologize for the fact that we never got the food and that they took to long, and also to make sure we got refunded by seamless.  I think that we are going to try it again one day, and hopefully we can put the awfulness behind us and try the food (and change our rating!) although, when she called, I didn't like that she lied to me.  First she said that my husband had talked to someone else, but then she said some things that indicated it had been her. I'm not sure that I appreciated that....", "author": "Cecilia H."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}