{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "I've eaten her 2X, once we stayed and once I did take out, on both occasions the sushi was super fresh, reasonably priced, with a very nice staff and luckily it's close to where i work so it's an ideal lunch spot. $2.95 basic rolls, you can't beat that!!!", "author": "Steve D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Came here for dinner last and were blown away by the quality and the quantity for the money.  We had fried calamari which was light and lovely in panko crumbs.  We all ordered bento boxes and they have a lot of food in them.  Most of us needed doggie bags.  The tempura shrimp and veggies were huge and wonderful, the california rolls very fresh, the shui mai good, the beef teriyaki yummy.  We ordered a bottle of cabernet and it was a good value.  Will definitely be back next time I hit Brooklyn.", "author": "Katharine G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-11", "description": "Food may have gotten a 3 (somewhere between a 2 and 3 likely). But, the delivery brings this down to a 1. I made the mistake of ordering one of their cooked dishes for delivery....and while I can sometimes understand food taking an hour to arrive, I don't understand how they could send something that is the temperature of my fridge. And I'm only two blocks away.  The side salad was warmer than the grilled dish. And the response when I called to let them know was \"really?\". No apology at all. Good luck....", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "I love this sushi place. There are a few sushi restaurants closer to us (in Boerum Hill) but we prefer to go here even if that means a longer walk. The quality of fish is great. I like the maki and special rolls on the menu. The green salad has delicious ginger dressing. Dumplings, gyoza, and soup are also very good. The price for quality can't be beat!", "author": "Tamara F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "Lazy, rude delivery guy called my cell instead of coming in the building. Refused to even come in the lobby let alone upstairs. The food is fine but not worth the hassle.", "author": "Debbi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "Coming from the Canadian Pacific, I despaired of finding high quality, reasonably-priced sashimi in NYC. Until I found Mitoushi. Good prices for some of the finest salmon sashimi I've ever had, combined with gracious and courteous servers who remember your orders and frequently toss you freebies from the kitchen, and sometimes comp your dessert or sake. My wife and I have become very happy regulars.", "author": "Zachary G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-27", "description": "A quick lunch yielded disappointing results with four of us sharing a few bento boxes and kitchen items.  The most promising dish was the Beef Negimaki, slices of medium-well beef rolled with scallions in the middle.  Although the beef was overdone, it wasn't dry and the beefy flavors made a hardy entree.  I got the Japanese curry shrimp.  Like the beef, the shrimp was overcooked and not too fresh.  The Japanese Curry sauce was as expected (from a package, probably), but although it was a large portion and there were lots of veggies in it, the combination was strange, especially with the addition of pickled radishes.  Just didn't hold together in terms of flavor.  We had the Spider Roll, and perhaps it is a bit unfair to judge an item when it's out of season, I couldn't tell if it was canned crabbed (swimming in mayo) or if there were tempura'd soft shell crabs in it.  The tuna roll lacked a whole lot of white tuna and was pedestrian. \n\nService was very accommodating and nice.  Water was filled regularly and servers were affable.", "author": "Perry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "This restaurant finally got me to sign up to write a review on Yelp.\n\nI first tried Mitoushi when I moved to this neighborhood in June.  I went twice, but a few days later it closed for renovations.  It's finally open, and I went again and it's still great.\n\nThis place is probably the best value for sushi I've had anywhere.  They have a full selection of more expensive rolls, but they also have a big selection of $3 rolls.  The $3 rolls are normal sized rolls, and delicious.  If you get 3 of them, you also get a free miso soup or salad.  So for $9 + tip and tax, you get a full sushi meal.\n\nThe sushi I've had has always been fresh tasting and great, and a good quantity too, especially for the price.  The service has mostly been good (one waitress made a mistake on an order, but then she replaced it as soon as I told her) and very friendly.  I also like the atmosphere of the restaurant.\n\nI hope it does well, it's a real gem for its neighborhood.", "author": "Mitch C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "UPDATE: Turns out, delivery is an entirely different ball of wax. Food arrives fast and hot, delivery guy is always friendly and the hibachi is quite good. Seems you don't have to take your toushi to Mitoushi--let them bring it to you!\n--\n\nDisappointing--especially after what seemed like some decent reviews.\n\nFood is pretty mediocre, service was inconsistent and awkward. Ambiance was like a strip mall in the suburbs--bright florescent lighting and an endless Kenny G. shuffle.\n\nSushi was okay and kitchen items were bland. Cooking oil had been reused too many times and everything had a very similar taste.\n\nI won't be going back and am praying that the tempura smell eventually leaves my clothes and hair. \n\nMy advice? Don't take your toushi to eat at Mitoushi.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "Excellent service, good atmosphere, and delicious rolls at unbeatable prices. I'd be here every day if I could!", "author": "Melanie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "I walked by this place on a regular basis after it opened recently, but only stopped to pick up a take-out menu last week. The selections and the low prices on the basic sushi rolls and sashimi both intrigued me, so I stopped in for dinner on an evening when my wife was tied up. I'm very glad I did. I went with one of the \"Tri-Color\" entrees, getting 9 pieces of sashimi on rice, and a specialty roll, along with soup to start, for only 12.95. All of my sushi was fantastic -- I even ordered a couple of rolls to go for my wife to have later. Oh, and the warm house sake was nice, and also quite inexpensive. I will be going back there, or ordering in, whenever I have a sushi craving from now on.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "Three and a half stars! The sushi is often good. It can be a little hit or miss, but on a good night the fish is excellent. We like the \"tri-color sushi combo\" which is an excellent deal -- a variety of sushi and an interesting salmon-tuna-yellowtail roll -- but sometimes I just get a few pieces of salmon sushi and come away very happy: the salmon is *always* great in my experience. It is not the best sushi in the neighborhood (go to Ki or Hibino for excellent fish and Japanese chefs), but a good little spot for cheap sushi cravings.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-29", "description": "My friends and I wanted to go to Chip Shop but there was a 45 min wait for 3 people so we ended up walking down Atlantic and found Mitoushi. The place was not packed so we decided why not. They have 2.95 rolls all day and they were GOOD! They spicy tuna was actually spicy and they did not have to put extra sauce on top, the eel avocado was delicious and did you ever hear of a sweet potato roll? you have to get it! The staff was attentive, giving us water without having to ask, and even sending over a complementary Sake! We saw our waitress doing Sake bombs with the table next to us. If you're looking for friendly staff and good cheap rolls I say stop on by, you wont be disappointed! Oh we asked for two separate checks and they were happy to do it for us.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "Love this place. Very cheap, fresh sushi and great attentive service", "author": "Tomas R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "In the world of standard and run of the mill sushi places, this is the place.  I have been going here since it first opened and I have never been disappointed.  Reasonable prices, fresh delicious sushi and great service.  I still come back to the old neighborhood to meet friends for dinner.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "After leaving Nature's Grill (I waited over 20 minutes and the waitress never took my order--it wasn't even crowded!), I was looking for something fairly healthy, and quick.  I passed Mitoushi and noticed the Grand Opening sign.  There was only one other table filled, and I enjoyed the nice quiet atmosphere (it was about 2:00 on a Friday).  The waiter was very attentive and the food was good.  I got miso soup, veggie dumplings, avocado rolls and sweet potato rolls, which came to about eleven bucks and I ended up having all the rolls wrapped because the servings were more generous than I had anticipated.  If I am in the neighborhood again I'd come back.", "author": "Albert Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "Ordered from Seamless. Order was delivered (with every specification done right) in under 30 minutes. Great prices! Delicious fish (and I was worried that it wouldn't be fresh since it was 9PM). Their house dressing is amazing. Very pleasant transaction: the delivery man did not pressure me for a tip as I gave it with a credit card. Recommend!", "author": "M H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "I don't think I've ever had exceptional experiences from average sushi places.  Mitoushi falls right in line like a perfectly timed tetris piece.  Came here after a day of exploring Brooklyn.  It was a very late lunch or early dinner, however you see the clock, but the place was pretty empty.  However, they seemed to want to take their time with greeting, and taking orders.  A bit peculiar, but forgettable.  The food itself when finally served was not bad.  The portions were larger than expected, or maybe our stomachs shrank so much from the walking we were getting full faster.  I had the sashimi, which I'm always wary of in NYC due to mixed quality.  Here it was ok, not the best, not the worst, but then again, I didn't expect much.  I guess I was hoping I had the winning sushi lottery ticket, but like 10 million others, came up short.  It was a nice lunch, allowed us to recharge to go out again....and that was pretty much it.", "author": "Chester N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "Literally just left this place. Excellent service (both friendly and timely) as the other yelpers have mentioned. I just really have to stress that the portions are SO generous (sashimi, sushi, bed of daikon, ginger, wasabi). Each piece of fish was fresh and tasty. However, I will have to say that the prices have risen a bit since the first few yelpers? The tri-color sushi is now $14.95 and the tri-color sashimi is $16.95. \nI didn't quite understand this option since the Sashimi Platter which is what I ordered was $8.95 for lunch, and that consisted of 10 pieces of fish (2 pieces each of 5 different kinds of fish) plus either a soup or salad. I chose the miso soup which was good but really nothing out of the ordinary. The same goes for the green tea. \nBasically, this is the best sushi spot for Brooklyn Heights. Other good spots include Iron Chef or Nanatori, BUT those places have smaller portions than Mitoushi and are a tad pricier. \n\nAs an aside, I know that since this place is still relatively new, they are very nice to their regular patrons. This couple ordered things off the menu, almost like In N Out style. just sayin'. Feel free to get chummy with the staff and see if you get to VIP status. :)", "author": "Sandy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-14", "description": "I suppose the sushi was fine but I cannot get over how GROSS their Dynamite appetizer was...they melted some big glob of cheese all over it.  What real Japanese restaurant uses cheese on ANYTHING?  I've had scallop dynamite all over this country and I have never, ever witnessed such a thing.  Ew.", "author": "Theresa Y."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}