{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "What a great dinner the 4 of us had!  The service, ambiance and fried squid appetizer and wine was a wonderful start.  Fresh food all around with all of us taking a \"doggy bag\".  Bento Box is A++++!!!!  Great food, quantity.  Can't encourage you enough to try this great find!!", "author": "Dori L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Very, very good.  They're the only place my bf and I have encountered that makes his favourite roll to his liking (cooked salmon - Ginza roll).  Have had their fancy rolls (delicious) and unagidon(really good, highly recommend to eel enthusiasts and noobs alike.)   Also notable are their vegetable gyoza and chicken yakitori appetizers.  Staff is patient and attentive and their recent re-modeling turned out great.  Cherry on top is that they are open way later than other places in the area on the weekend.  This will likely become one of our preferred pre-movie dinner spots. Definitely strongly  recommend to any sushi enthusiasts in the area!", "author": "Maysa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "I'm a big fan of this place. I order from here 1-2 a week. The staff are friendly and the service is good. I will keep coming back for more.", "author": "linda m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "The staff tends to hover (a lot!), and it's not the best sushi in the city, but at $3 a roll and $1.25 (i think) per piece of sushi -- all day every day -- there's no beating Mitoushi when you want sushi in Brooklyn Heights.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "I cannot tell you how much I love this place!  I never went in because the atmosphere is a little bland and not crowded.  The food is an amazing value!!  I get the spicy tuna rolls (have them add crunchy bits)...Great...The handrolls are excellent too.  I'm stuffed to the brim for about $10-15.   Sushi is big, fresh, and inexpensive...what more could you ask for.  The fried rice is buttery and good as well.  There's a japanese fried chicken appetizer that's delicious as well. We order or go there about every two weeks and have been doing so for about a year.  I'm never disappointed and always happy.", "author": "S L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "I love this place because its cheap, fast, and fresh.  I swear i order from here twice a week- I usually get a tuna/ avo roll and 3 pieces of sushi for under $8.  I always takeout so i have never dined in, but everyone that works there is very nice.  I cant say it has the atmosphere of some of the more expensive sushi places in the hood (like for date nights, or a nice dinner out with friends) but i havent had a bad takeout meal from here!", "author": "Hillary B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "bomb, seriously, for the price, just plain bomb", "author": "The M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}