{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Fresh sushi. Good takeout spot, have not dined in the restaurant but I would definitely order again from here", "author": "Don C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "1) One of the yelp reviews is from a guy with the name \"Mitoushi\" who gives it 5 stars and says \"Nice restaurant.\" Obviously the owner and says a lot about the honesty of the establishment.\n\n2) Sushi rice was barely seasoned. Tasted like normal rice.\n\n3) Chicken teriyaki used breast meat and was dry as cardboard as a result. Teriyaki sauce tasted watery and gross.\n\n4) Soft shelled crab used regular breadcrumbs rather than traditional light, airy panko (Japanese breadcrumbs). Felt like I was eating stale bread instead of rich crab at some times.\n\nI could go on but what's the point? \n\nHorrible.", "author": "Lawrence H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "Oh boy. I ordered delivery from this place. Teriyaki chicken and three pieces of sashimi.\n\nTurns out I didn't get three servings of sashimi, I got literally three *slices* of sashimi. For $8. Iron Chef House gives you four times that.\n\nI'm not sure why they decided to use white meat in the chicken teriyaki. The meat was dry and overcooked and the sauce was watery and flavorless, more like a sweet tea than a teriyaki sauce. The vegetables were strewn haphazardly about the stew as if an afterthought and half the sauce was spilled inside the delivery bag soaking the paper right through.\n\nNaturally they didn't include any napkins in the bag. Or extra sauce. Or chopsticks. This place is not happening.", "author": "Jarrett S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "I had:\nTuna tataki appetizer\nSalad that comes with entree\nEel with avocado roll\nSalmon roll\nOmlett roll\n\nDining companion had:\nGrilled shrimp appetizer\nSalad with entree\nChicken roll\nShrimp tempura roll\nCant remember the third roll\n\nPlace is very clean.\nMy eel rolls had more rice than eel which was disappointing but the flavor was good across the board. You MUST try the tuna appetizer as it was beyong delicious. A bit spicy but totally the way to experience seared tuna. Grilled shrimp were perfection! Chicken roll was an interesting texture and great flavor, however, not something I could commit to for a full roll.\n\nOverall, pleased and happy to return.", "author": "Mardory V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Great decor and awesome drinks! Came here with a few friends to try this place out and was amazed with the quality of food. Fresh fish, uni and live scallops. Definitely ask for the specials as sometimes they don't put it on their menu. Will definitely recommend this place to my friends!!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "Sushi is cheap here. About $1.00 to $1.50 for a la carte sashimi/sushi and $2.95 for regular rolls. Quality is actually not too shabby for the prices they offer. They also deliver which is a plus.\n\nI would recommend this place if you're looking for cheap sushi. It's comparable to Chikurin.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "If you're ordering take out or delivery, do yourself a favor and go elsewhere.  You will spend 10 minutes on the phone, get passed around to different employees, and repeat your order several times.  If you're ordering online, you're unlikely to get what you paid for.  \n\nThere's nothing special about the food. Pretty average for take-out sushi, and the prices for normal rolls are the best in the neighborhood.   If you're looking for better quality or a much nicer ambiance, try Ozu or Iron Chef House in Brooklyn Heights.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Solid neighborhood sushi. There's nothing too showy about this storefront restaurant, but it's clean, quiet, and convenient for those who live or work in Cobble Hill and Brooklyn Heights. It's great for a casual lunch or dinner; I wouldn't choose it for a date. Since I'm nearby, I end up there alone now and then, and it's comfortable for the solo diner since it's never crowded and the staff is friendly but low-key. \n\nI stick to the sushi basics and the occasional special roll, and I am never disappointed. I have made two discoveries via the appetizer menu, both of which I recommend: Avocado Sashimi and Dynamite Appetizer. \n\nTheir delivery is quick. I've often ordered plates full of rolls when I have visitors, and now they ask for Mitoushi by name.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "Food: the food here is awesome for the price they charge. My group usually orders the Rolls and have tried little else. We have yet to discover a roll that we absolutely disliked. The hot sake is also great.\n\nService: they are so responsive to our needs all the time! Never had a problem.\n\nDecor/ambiance: clean and generally typical of a Japanese-themed restaurant that is run by Chinese speaking people.", "author": "Marcus C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "No matter how many times we come, the same delicious, fresh, quality sushi and friendly staff are consistent.  It's a great value and now you can get $3 Sapporo drafts all day and night!", "author": "Nick R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "This review is in reference to a delivery order I placed and received from Mitoushi. \nI ordered several special rolls, and 2 were completely inedible due to severe fishy taste on the crab. I could not believe they even sent these rolls out.  They need to require the chef's to taste test the old fish first, to see if they can even get away with passing it off as fresh. \nI made the mistake of ordering on a Monday, thinking it fish on a monday can't be that bad?   But oh Boy was I wrong,  I paid 20.00 and threw them out.   Super disappointing.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "I went here with a coworker and some of his friends. I liked the ambiance here. The staff is super fun and friendly. The service was relatively quick. I liked how they did sake bombs together as a group. That made it really entertaining, kind of like a big party. \n\nWith that said their food was really average. Nothing special to note about it. But I had a great time with friends so that's a plus.", "author": "Cici X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "My favorite go to local sushi spot! Service is great, staff is even better! Talk about bang for your buck! Great spot in the neighborhood!", "author": "Saddia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Went on a Sunday after church. Delicious pork gyoza and chicken katsu. Such a huge portion. I was stuffed.", "author": "Abi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Great sushi, with delicious well presented tempura ice cream\n\nFood: 4.25 Stars\nSusi \u0026 Sashimi Combination Platter / I Love Tuna\nIt is your standard combination platter. Everything is fresh and delicious.\n I just can't put my finger on the name of one of the fish/cucumber roll/wrap in the dish. It's a piece of fish tied around 3-4 sticks of cucumber. It was good, but I have no idea what it is.\n\nThe Hibachi fried rice is an excellent side dish to have especially after a long day of walking around Manhattan and Brooklyn getting lost during a scavenger hunt. I found it a little dry but the flavors were blended well enough to make me almost lick the plate clean.\n\nThe tempura ice cream would be the most likely reason for me to return to Mitoushi. The tempura batter is very thin and the ice cream is ever so slightly melting at the ends. Surprisingly when I ordered this dish I expected the typical tempura ball, but it was sliced and beautifully presented. \nIf you think it's too much for yourself (and you likely will after a big meal), the dish is easily shareable. Not to mention it's extremely well priced for the quantity you receive.\n\nThe only thing about the food that annoys me is the lack of ingredients for some of their desserts on multiple occasions (which means it's not able to be ordered). An example of this is the lack of chocolate syrup for one of their dessert dishes two weeks in a row. I don't know if this is a common occurrence, but it has sadly happened both times I came here.\n\nWhether you are on a date or with friends I highly recommend ordering the Love Boat for 2 or 3 because it looks amazing. I haven't tried it personally but I saw it brought to other tables and it looked cool.\n\n\nDrinks: 4 Stars\nLove me that Lychee Sake!\n\n\nService: 3.5 Stars\nStandard solid service. \n\n\nAmbiance: 3 Stars\nThere is no real ambiance in this restaurant. It is a very open area with a sushi bar close to the entrance. There is some nice art on the walls, but overall the place feels huge and bland. Maybe I am being a little too picky in this situation, but I feel it is too open. \n\nThe big plus is the quiet atmosphere. It is a nice place to get away from the hustle and bustle of the nearby hipster armies.\n\n\nOverall: 4 Stars\nI came here with a small group of friends after another restaurant we tried to go another place with over an hour wait. I am happy the other place was overly packed because I wouldn't have eaten here. The sushi is good and fresh. The desserts are amazing and nicely presented (I have added a picture of the chocolate tempura ice cream).\n\nThe service is standard and the decor is bland, but how many people go to a restaurant based solely on decor?\n\nI would come here just for the tempura ice cream.", "author": "Philippe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-19", "description": "The service is unbelievable. It took over and hour to wait for 7 rolls. Never order Alaskan Roll. The fish was not fresh and I got food poisoning. The door was broken I had to squeeze in.", "author": "Mihail G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "My review is for delivery only. Ordered here on several occasions - the delivery is hit or miss. The food is consistent however. The grade of sushi isn't the best and their Sheepshead location is defiantly better. Their chicken teriyaki is very dry. Big portions. Will order again given the proximity but I've defiantly had way better sushi.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "We usually order sushi, but decided to try the chicken teriyaki and nabeyaki udon yesterday - FANTASTIC! Mitoushi continues to be my #1 choice for delivery.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "The place is quiet around lunch time and the prices are reasonable....but their meat portions in the ramen are... small thin sliced pieces of meat... very disappointing!", "author": "Raheem W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-13", "description": "Tried this place for dinner for the first time. The food came very quickly, which was a plus.\n\nHowever, my order was not at all what I was expecting. I ordered Japanese curry with rice. It came with the option of getting it with either fried chicken or fried shrimp. I chose the former. I was thinking it would be the smooth, dark brown curry you get when you order katsu curry. \n\nInstead, I get this large portion of vegetables with some chunks of grilled chicken in a thin sauce flavored with curry. Is this what my dish was supposed to be? It looked like something I would get from a Chinese restaurant. It wasn't bad, tasted pretty good, but it was just completely different from what I was expecting. I'm not sure if I'd order it again though. The salad that came with the dish was also good. Great ginger dressing.\n\nI might give this place another shot, but for something less ambiguous.", "author": "Steph C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Mitoushi Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "177 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K8sVNCuZ3XMmi_ARa-_nmg/ls.jpg", "@type": "Restaurant", "telephone": "+17189351600"}