{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "The place wasn't fully packed when we arrived. We ordered water and it took over 15 min for us to get our waters and the only reason we got it, is because we asked another waiter. The the table beside us got their drinks and salad before us even after they arrived after we did. I don't recommend the wings but we got 'The Pizza' and it was really really good. The crust was thing and the basil was delicious! If you come here, make sure you bring cash because it's a cash only place. The restrooms are gender neutral but it was dirty and not flushing properly... To conclude, Iwould come back for the pizza but don't expect the best service.", "author": "Carmen Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "As a native New Yorker I am proud to say that all of the pizza places that call themselves \"the best pizza in all of New York\" are lying unless they are Ignazio's. This was by far the best pizza that I've ever tasted. The location is great! I would love to see Ignazio's open up pizza resturants in Manhattan or the Bronx as well. This is the perfect spot to go to in the summer after a nice walk in Dumbo. I would recommend this restaurant to anyone. If you are looking for the real New York slice than come to Ignazio's!", "author": "Ali M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Found this place completely accidentally meatballs are amazing but unfortunate didn't have time to take a picture of them because It smell so good I devoured them in a matter of seconds and the margarita pizza was perfectly crispy crust just the way I like it not cheap water down marinara sauce great experience great service we will be coming back here PS don't forget about the awesome lemonade", "author": "Allen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Bring cash or your ATM and a healthy appetite.  Got off the subway not knowing where I was or going and made my way to this pizzeria almost literally tucked under Brooklyn Bridge. The pie was HOT and good enough to eat 3 slices one after the other. Great experience, great service.", "author": "J R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "The pizza is very average, and not worth the price. The ingredients were used sparingly and the dough is really tough. If you want good pizza in this area I suggest you go to Piz-zeta, much better pizza for a better price", "author": "Shelby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "What's with all the bad reviews?\n\nThanks to a friend who never checks Yelp, we stumbled into this place after seeing the lines for Grimaldis and Julianas and were pleasantly surprised. Sure, the wait was still long even though we were the first in line. Sure, they told us 5 minutes when in reality it was 25. Cash only and pricey pizza... but hey, it was good! \n\nWe got the special: avocado bacon tomato. It wasn't really anything special but it was pretty tasty. I got a cappuccino which took a long time also. But maybe that's their trick: make you wait a long time to get your appetite roaring.", "author": "Elsie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "We ordered pepperoni,bacon and black olives pizza. It was the best pizza we have had on our trip. Thanks guys", "author": "Rhiannon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "$4 bucks a slice which is way too much IMO, but the pizza was really good! I actually came back later for a second slice lol.", "author": "Chelsea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "The pizza was good, But the music was SO loud that we couldn't have a conversation. The hostess didn't smile once while we were there. I would recommend to order as takeaway", "author": "Morten M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "Average to below average pizza.\n(Extremely) slow service.\nUnorganized management.\nLots of octopi.", "author": "Jess S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "pizza is  definitely try the proschutto and or artichoke with spinach. beautiful location under the bridge. one of my favorite's in brooklyn can't wait to come back", "author": "Steven G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Wings are probably the top three wings I've had. Not too much sauce and love they put pepper on it. Ordered a bottle of sparkling water and they brought a huge bottle out for cheap. Pizza was great. Atmosphere and view was amazing. Great music too!!", "author": "Dan O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Cash only and $3.75 charge for the ATM inside.  It's not Peter Luger.  Learn to accept credit cards, it's costing you customers and money.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "Went here on a Sunday evening after visiting the Brooklyn bridge park. We went here because it was the closest place and it was pouring rain. The hostess would not let us enter the restaurant and made us wait outside in the rain while they got the seats ready...it was relatively empty inside so this was just rude. At first, she would not let me enter with the group I was with and that was just icing on the cake. \n\nI ordered a wrap and it was awful. Very bland, no flavor. We also ordered some pies and they were subpar as well. Didn't think it was possible to mess up pizza in NYC, but I was clearly wrong. \n\nDon't go here even if a hurricane is about to blow you away. More than likely the rude hostess will make you wait outside as the winds blow you away while they get your table ready and cook you some terrible pizza.", "author": "Taraqul K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "To expensive for mediocre pizza. Also 8oz glass of coke is $3.00. I wouldn't recommend this place.", "author": "Elliot V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-24", "description": "First, they accept only cash, and you can use an ATM inside the restaurant in case you don't have enough. \nThey don't trust your credit, but their ATM does? \nThe medium pizza costs 17$ and extra topping costs 3$ for each. \nI hoped it will worth it, but I was horribly wrong. \nThe dough is too thin, and all the topping fell of the pizza. There wasn't enough cheese, and the 3$ extra topping was a few tiny pieces. \nThe crust was dry and not edible\nIn the check we got a 20% service included!\nHow rude!", "author": "Liav H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The pizza here is delicious. Thin crust. Not greasy. I will be back next time I'm in Brooklyn", "author": "C F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Food was good but the wait staff was not attentive. The place was also very empty for the waitstaff to not be attentive.", "author": "Gabrielle T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "Pizza tastes like cardboard!! No flavor at all and super uncomfortable seating arrangement and the staff makes you feel like you are inconveniencing them", "author": "Zeiad S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "We're big fans of Juliana's and Grimaldi's but today we just didn't feel like waiting so we decided to check out Ignazio's. Big mistake. Although the crust was nice and crispy, the top was a soggy mess.  It felt like a slightly more upscale version of whatever local slice joint, except 3x the price. Service was mediocre. It's also cash only and the onsite ATM charges a $3.75 service fee. Ugh.", "author": "Sarah G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}