{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Ignazio's is an alternative for people who don't want to wait in lines to get in. Instead, the waiting happens at every other part of the meal.\n\nGratuity added - 20% - to parties of 4 or more. Cash only!\n\nAfter our seating, no one came back to us for 15 minutes. We ordered the white pizza which came back maybe 20 minutes later. It was good. We shared a medium between 4 people so the size was good too. It came out HOT!\n\nAfter our meal we sat around for another 15 minutes hoping someone would approach our table. At that point we asked for the check. But since it's cash only, we had to ask for change. After a long time, someone comes back to pick up our money, but never comes back!\n\nWe flagged down a server and asked about change. He replied, \"I don't know,\" and walked away. Frustrating. \n\nEverything turned out fine in the end. The pizza was good. All the waiting was long. Gratuity was a little more than I would have given. I know they might have needed more help but still... \n\nI wouldn't refuse to come back here... I'd just avoid it if I at all could.", "author": "Darren P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Never wrote bad review, but $4 for a slice, that's not a different from a regular $1 pizza. Noting special. Not worth it. Very disappointed", "author": "Fatima K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Went to water front before walked Brooklyn bridge. Went in here in spite of some lower reviews. Thought pizza was excellent. Got a Sicilian with toppings -- bacon chicken and asked for spinach but came with sausage instead. Thought four of us would need large but after 1 order appetizer of meatballs we were wrong   We couldn't finish the pie - and that's a shame. Thought price was reasonable considering  touristy location right off pier. And staff was very friendly.  Sorry Grimaldis but I thought this was better.", "author": "A T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "What an excellent establishment. The food: impeccable. The cleanliness: immaculate. The servers: very kind. I visited this restaurant tonight with my girlfriend. We have just recently started having sexual intercourse. We ordered a pizza to go and ate it in nearby Brooklyn Bridge Park (it was only a few steps away!). After our delicious meal, we were feeling rather sexually aroused so we had sex in the bushes of the park at night. I don't know what they put in that pizza but it really turned us on!! Thanks Nazi's!!!", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "I am giving this place 4 stars because I can't do 3.5.\n\nMy husband and I stumbled upon this restaurant. We were seated right away and it took a waiter about 5 minutes to come over and take our order. Once our order was in, my husband went to go get cash being that it is CASH ONLY. The ATM that they have was not working, so he had to go around the corner to another ATM. We ordered a medium pepperoni pie. It came out in a timely manner being that it is made fresh. The pizza itself was really good. However, the service was iffy. We got our pizza and that was it. No one else came over to see how it was and to see if we needed anything. By the time I got someone for napkins, he had to go get someone else to give it to us. Then I asked for a box and he had to go get someone else to wrap it up. We have now been waiting more than five minutes to ask for our check. \n\nThe place is great. The environment is good and the food is excellent. However, they need more wait staff because the amount they have does not fulfill the volume of customers they experience. \n\nAlso, a heads up... If you're going to try this place with  4 or more people 20% gratuity will be added to your bill.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "Now I know why this place had the shortest line. Food wasn't bad, but then again they didn't have our first choice off the menu. \nSaved a lot of money though. Since they ONLY accept cash we elected against drinks or appetizers. Would have likely spent twice as much on this night out with my wife. (I'm always skeptical why a legitimate establishment would refuse common payment options)\nIf you don't care what you eat, have enough cash on hand and don't want to wait, this place is for you.", "author": "Brett P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Great pizza. I strongly recommend eating here. Got a table quickly and the service was excellent and friendly. Only issue was bathrooms were limited and not separated for men and women. Still, eat here, food was great!", "author": "Kevin D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "We are on vacations and my son wanted pizza Ignazios was the closest. I did not think much of the place. We had a calzone, good size but not that much flavor. As for the staff they were not attentive at all and the service to slow. For the price it could do better", "author": "Sandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "The food was great and the service is excellent.  I've been here many times and it's always a good place to grab a bite.  I would recommend this place for anyone to go and have a quick lunch or a early date by the Brooklyn Bridge.", "author": "Joaquin G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "Let me start off by saying the owner Ignazio is one of the most rudest people I have ever met and I'm a life long New Yorker who can handle himself. My wife and I walked in with a stroller and wanted sit by the bar to order a few slices like we did a few weeks before. Today this jerk Ignazio said no we must leave out stroller with our 3 month old off to the side of we choose to sit at the bar which was EMPTY!! My wife tried to explain that our son is just 3 months so we can't leave him and we already had our stroller at the bar and he said no it's not up for discussion. I asked him why he was acting rude and he said it's not about being rude it's about economics. He said it's Saturday and his restaurant is a full house so we either take a table where we are forced to order a pie or we must leave.\n\nI just don't understand why this Jerk is standing out front working with customers. This jerk Ignazio should be in the back mopping the floor or peeling the potatoes. I respect house rules but talk to my family like a human being instead of a jerk who has no business facing off with customers. Ignazio's family should convince him to stop standing in the front door like a prison warden. What a jerk!!!! What ever happened to the customer is always right?!\n\nIt's a shame that such a friendly and quaint neighborhood has a jerk like this as a proprietor. \n\nThe next time I step foot inside this place is when I find out Ignazio is dead or retired and then I'll come back.", "author": "Larry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "After reading a couple of reviews I  was  a little skeptical but I went today with my family and was amazed. Great location , freshly baked pizza and very delicious best one I ever had so far and am a New Yorker. Yes I have tried Grimaldi's down the block yes also amazing pizza but lines are out of control and well Ignazios much nicer inside , they did have a.c and well customer service wasn't bad at all , also they do have bathrooms and we dint't had to wait at all .  I say give this place a second chance or if You don't  want to wait 30mnts -1hr for pizza like come on is just pizza this place not bad. They only take cash also and a 20%  Gratuaty is included that was like $4 -$5 on a $22 Large Pie which was for 4 of us", "author": "Jorge G T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "It's a good pizza place that serves slices. Plain or margherita is my pizza of choice and they do a good job.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "Ignazio's gets 1 stars in my book ONLY because the pizza wasn't half bad. Not a huge fan of the crust, which was like a dry breadstick, but the toppings were good. The experience as a whole though deserves zero stars. It was 90 degrees outside and about 100 inside. No AC, maybe just not working, but still. The hostess was rude, didn't give us menus when we sat down, the waiter forgot to take our order. We all left to sit outside and get our pizza to go. Even then, they told us 10-15 minutes and it was over 30. If it's going to be 30 minutes, tell me 30 minutes please. Manage my expectations! \n\nThis place could be fine with better service and AC. Also a more prominent Cash Only sign would be helpful. Again, expectations. Don't make me scramble for cash at the last minute.", "author": "D L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Came here this past weekend after seeing lines for Grimaldi's and Julianna's. The all white pizza was the best one in my opinion. Very tasty. A bit thin but I guess thats how gourmet pizza is made? LOL quite pricey but none the less-- good. The owners were extremely nice and we were first on line but waited about 20 min which is pretty standard. I would've given it 5 stars but our server took forever to come back to the table for everything. I probably wouldn't return due to distance (unless I'm actually in the area) but I thought it was good experience. \n\nPS; location was BEAUTIFUL! Literally right under the bridge. The area is wonderful.", "author": "Yara R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "There lucky they even got 1 star.....people come here only because it's never busy on the busiest corner of Brooklyn....your better off waiting at another restaurant", "author": "Steve V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "We came here since there was a humongous line at on the other side of the street. I'm not exactly sure if there's a theme to explain the octopus paintings on the ceiling. Service was strained for the busy weekend rush. I felt bad for the waitresses since their hands were full while some management members just looked on.\n\nI like New York style pizza, but I wasn't amazed. But it was nice to see families and their kids in the restaurant. I don't know why they started to blare music halfway into our meal though.", "author": "Lily Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "TIP: This is a Cash only business. Nice view of the Bridge, was seated very quickly, The meatball and mozzarella appetizer was very tasty, We ordered the medium cheese pie and it was good but too well done. When we asked the waiter for grated cheese he simply said no....and he was serious, okay there buddy!", "author": "Angelina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "The wait at Juliana's and Grimaldi's were 1.5hrs long so we came here to find a shorter wait. We were so pleasantly surprised. The service was great and Fast even during the rush. We had \"The Pizza\" in the thin and thick crust and it was delicious. Their sauce is to die for and the crust is perfect. We will be back!", "author": "T N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "We had the pineapple and ham pizza. It was actually pretty good. My complaint is more with the services and price, although I guess I understand the pricing (being the area it is in). Service was subpar and the seats were all stained and pretty dirty looking.", "author": "Mike I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Shrimp pizza was delicious. Service did start out a bit slow.  Overall a good experience- came for the pizza and it did not disappoint!", "author": "Kristy S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}