{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Took a little while to get our pizza, but was worth the wait w/ the lovely view and the pizza tasted great.  Will definitely come back again.", "author": "Asia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "It was really bad experience in this restaurant I didn't know that they are charging me 20% gratitude fee:( And Also They didn't take credit card!! It's 21 century not a 20!! Me and my friends are not from New york and If somebody charged gratitude fee, It was usually we were big group like over 20 people but we were only 3 and also our culture is not a tipping culture If I know that one before I order I didn't eat this restaurant I was so disappointed and I forgot about really good feeling after seeing great view of brooklyn bridge", "author": "Yeon Ju K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "We had amazing service and great pizza, the sangria is great. Fast and friendly service. So glad we found this spot and did not choose to follow others to the first two long line spots. Recommend to all. Cash only and  if you need they provide an atm.", "author": "Lorraine E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "This place was okay. The Sicilian was more of a Chicago style pizza. Very good however, not New York pizza if you wanted that. \"The Pizza\" menu item, probably more New York style if you are looking for that type of food. The medium is enough to share with 3 people (me and two other girls) may want a bugger pizza if you eat more. Over all, nice venue near the Brooklyn Bridge and could see myself going back with visiting friends. Not terribly expensive.", "author": "Juliana J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Perfectly cooked pizza!  It was really a great experience. The owner took time to talk with us and made sure we were on the right track to enjoying our visit to the city!", "author": "Chris I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I like New York style pizza, that said I also like Chicago style pizza. I don't care if anyone thinks one is better than the other, there a great things to enjoy about both styles. End of story.\nI have never tried Ignazio's thin crust pizza, so I can't tell you what it's like. I can tell you though that their Siciliana Pizza with fresh basil and a wonderful thick crust is one of the best thick crust pizzas I've had. Toasty on the bottom and sinfully moist on the inside. I love to order it with red peppers garlic fresh garlic.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "We were made to stand outside half hour. Walked in, restaurant is half empty. They are trying to create a line outside to appear busy.\n\nIf you're gonna wait, wait at one of the other restaurants in the area. Service is not great, food is not great at all.", "author": "Elina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "just picked up some meatballs to go they by far the best meatballs and gravy ever worth the trip and price", "author": "Steve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "I have to agree with the majority of the reviews -- the pizza here is delicious but the service is very poor.  I noticed that the wings appetizer comes with carrots and blue cheese dip.  I like to order carrots and dip before entrees come out in other bars and they gladly bring it out.  I asked the waitress if I can order just some carrots and dip and that I didn't care about the price.  She said that she couldn't do that.  I simply do not understand why not.  The prices for the pizza are decent considering the location.  Throughout the warm months, you can take your pizza to go and enjoy a good ol' slice, or two, or three ... along with some great scenery.  I'm a bit bothered by the \"Cash Only\".  I'm sure that many people will disagree with me but I believe that when you say \"Cash Only\" you're implying come here if you have cash, if not, we don't need you so you should go elsewhere.  I believe that businesses should be honored when customers come in, regardless of whether they are paying with cash or cc's.  There's simply no reason as to not accept credit cards in this day and age.  It's also kinda odd that the owner has a \"thing\" for octopus -- they are drawn on the walls and its also the wifi password but there's no octopus or any seafood on the menu.", "author": "Leonard G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "This is one of the best pizza places around. There's heavy competition around the corner (Grimaldi's) but this regular pie is amazing. A light tomato sauce and basil just makes it so perfect. \n\nLots of tourists waiting on line to get in. The only problem is the confusion of take out or eat in line outside. It's all on the same  line so if you are looking for a pie to go and there's 15 people ahead of you on line waiting for a table, you're  going to have to wait till everyone is seated  before you can give your takeout order!!!\n\nThere's got to be a better way!!", "author": "Dona F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "Straight up tourist location. For us New Yorkers, this is very average low budget corner store pizza. Bad crust, bad cheese from a bag probably. You'll know what I mean when you taste it. Service was ok, location is killer, so you'll get a lot of out of towner's who don't know any better. But that's what makes it very expensive. If you have pizza, get it with a bunch of toppings, because it's cardboard without extras. No real cheese( taste like bulk graded mozzarella),no real crust, no bueno!  If you want NY pizza, this isn't it.", "author": "Bernard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Great pie literally hands down the best slice I have ever had calzones are tremendous and amazing had a really short wait to get in but it was so worth it 5 stars they even give you the real soda in the glass bottles", "author": "Anthony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "Good pizza, I had a nice time here. Maybe bc I was with my boyfriend and everything is more pleasant with him around. So much so that all I noticed was the nice rustic table between us and our ice cold drinks and conversation. I think the yummy pizza was the only other thing to notice here. It's a very simple, plain shop. \nDespite the spartan appearance of the place, they do have a few nice aesthetic traditions here.... they place the pizza on a footed tray which makes it look special. I also specifically liked that they served water in a metal cup (it stayed icy the entire time we were there) and the little glass bottle of coke was cool. Our pizza took a long time to arrive but when we got it, it was very fresh and good! You can tell they use real tomatoes for the sauce. We ordered a medium pie. Called \"the pizza\" and personalized it - half olives half plain. \nIt was ....a $17 ouch... But I definitely enjoyed it. Not the ouch.:P\n\nThe service was good and if you don't want to wait on line at Julianna's which is around the corner, this is a great alternative:)", "author": "Tal O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "This is my first Bad review on Yelp, maybe the last. The Worst Pizza experience. Almost self service, 30 minutes wait for regular pizza and 20% tip included after waiting for the bill 15 more minutes. Waiters so afraid of eye contact or just don't care.", "author": "Elan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "The reviews on this place are absolutely preposterous. Easily one of, if not my favourite pizza in all of New York. Now I've never had it by the slice, so maybe the full pie is better, but this place is amazing.\n\nIf you are in DUMBO and wait in line at Grimaldi's or Juliana's, you are an absolute sucker. The pizza here is better and without the hassle.\n\nI make it a point to take the ferry over from Manhattan a couple of times in the summer to grab some Ignazio's and it never disappoints. I will be here again and again and again.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-29", "description": "Really bad pizza. Also had the stuffed mushrooms - 6 for $11... It's a spillover place for Grimaldi's and Julianna's. Don't expect much.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Excellent. Much better than Julianas in every way including the fact that there's no line any time I have been there.", "author": "John A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-24", "description": "Their on line menu doesnt match their restaurant menu.  For example, the prices are less on the online menu and so are the food descriptions.   I did mention this to staff and showed them when I was there so hopefully they fixed that.  Also, the food descriptions are different, such as in the way somethings are prepared. The pizza was ok, nothing great.  The dough/pizza crust is tough and rubbery.  This is Brooklyn, there's no excuse for tough dough.", "author": "JustSaying C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Pizza is simple with fresh ingredients. The meatballs were to die for. Will definitely be coming back if ever in town. Simply delicious", "author": "Tina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-20", "description": "Great pizza, bad experience! I ordered a medium pizza, ate 3 slices, and asked for the rest to be boxed up...however after 10 mins I'm asking how long does it take to box up some slices?!?! Turns out they threw it out! They gave me three slices to go...but still i felt cheated out of my perfectly good leftovers slices. Not happy to pay $30 for pizza and then be given 3 slices as a substitute.", "author": "Ess C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}