{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Been here a few times now and the pizza is really good. Today we had \"The Pizza\" with meatballs.  I thought I had died and gone to heaven. The food is always so good here. Today I was not impressed with the service. Not one acknowledged me for a good amount of time. My wife was in the restroom but still, I would have killed for some water.  The hostess told me that it was because my wife was in the bathroom. But, the table beside us got immediate service with the same situation. I'm not impressed.", "author": "Lenny W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-26", "description": "'Blech' was the first word that popped into my head when thinking about ignazio's pizza. 'Blech' is probably an exaggeration, but I definitely won't be eating here again. \n\nAnd their little \"Pizza this way\" sign is lame. You're not fooling anyone.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Yes, Grimaldi's was crowded, but here they have solid pizza, if I say so myself. I went here with a group and we had the The Pizza and Sicilian, freshly made and just as good. There is Brooklyn Lager on Draught and Coca-Cola in bottles. Friendly staff. Great view of the Brooklyn Bridge, as it is right on the edge. \n\nAll in all, it is a place for good conversation among friends, with good food and drink.", "author": "J G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "If I could give this zero stars I would. Front door staff incredibly rude, food took 40 minutes and was wrong and most importantly the pizza tastes like the cheap 1.00 slices you get on street corners. The cleanliness of this place also is questionable.", "author": "Zee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "We had the regular The Pizza with smoked chicken as one topping. What an interesting combination. I really enjoyed the smoked chicken because it really enhanced the flavor. The crust was perfect. It was crunchy and oily in a good way. The service wasn't that great though. It wasn't a busy time either. We had to hunt down the servers. Overall, it wasn't bad but it wasn't great either.", "author": "Taylor K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Wow the fact that this place has stayed in business within 500 ft of Grimaldi's means something, 2.5 stars really? I might have been starving or something but I thought this place was pretty decent. \n\nI had olives artichokes and mushrooms, yum!  I thought the service was fast and the view was actually really cool.  If you sit near the window you can look up and get a glimpse of the bridge and the water.  \n\nFor less than $20 per person for half a medium pizza and a drink, I thought it was a good deal.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Great location! Brought some friends to Dumbo to take some pictures at the waterfront area and thats where we saw this place.  We had great deep and thin-crust pizzas and good beer.", "author": "Nino S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-16", "description": "Dear Mr./Ms. Tourist in Bklyn:\n\nYou may be hitting up Yelp on your smartphone because you've learned that the fabled Grimaldi's around the corner is closed, and you want some epic Brooklyn pizza. So this Ignazio's place can't be too far off, right?\n\nWRONG!  It's TERRIBLE.  Stay away, repeat, stay away.\n\nWoody Allen once observed, \"Pizza is a lot like sex, when it's good, it's really good, and when it's bad, it's still good.\"  Ignazios proves this saying  false.\n\nWhere to start:  How about taste--just awful. Nothing tasted fresh from the tomato sauce that tasted like the inside of a can, to the funky rancid cheese, to the non-salty metallic anchovies, to the limp tasteless onions.\n\nThe pizza was utterly SOGGY and GREASY to boot.  Ugh.  And, to add insult to injury, it was $36 with tax and tip.  \n\nI'm a native Brooklynite and I'm ashamed this place exists in one of the pizza capitals of the world.\n\nOK, you're standing in Dumbo and you want good pizza, now what to do?  Unfortunately, you're kind of SOL (sh!t out of luck).\n\nThere's some amazing pizza at Sam's in Cobble Hill, but that's at least a 30 minute walk, and there's also great pizza at Lucali's in Carroll Gardens, more like a 45 minute walk.  If you must have pizza, take a cab to either of those places (you can find the addresses on Yelp).\n\nYou've been warned about Ignazio's.  Don't screw up.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Not bad. Not great. Pretty average pizza.  Atmosphere is nice and location is great.  Staff was good.  This place is cash only so remember to bring the green.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "NOT that I even got in the restaurant.........As a couple, we were asked to wait for a table. There were open tables with seating for four, a second couple came in and asked to be seated and were again told to please wait, and wait outside....... When questioned as to why were we still waiting to be seated ....the greeter responded \"those tables are for four ......and I said \" And am I needing to wait till when a two becomes available ? You have got to be kidding ... I truly believe this strategy was to create a \"LINE\" outside of Ignazio's much like that of Grimaldi's or Juliana's ......POOR customer service at the front door.....PS  I live in NY and am very frequently in the Dumbo area......you can be sure I will not be trying to get a table at that establishment again", "author": "K B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "Like every other review, we wanted to try Grimaldi's but ended up at Ignazio's. Is that a bad thing? Not necesarily... Is that a good thing? I'll let you know when I get to try Grimaldi's.\n\nSo after waiting the 20 minutes vs the who knows how many hours we wouldve waited on the Grimaldi's line. We finally get to order. \nSince we were taking my Tita (aunt in Tagalog)  around and being super touristy, it was her decision to order. So, she went for the bacon, avocado and cherry tomato pizza. I snuck in the baked anchovy appetizer.\n\nBaked anchovies. I never order baked anchovies. Why now? Why not? They were tasty. Baked in tomato sauce with lots of garlic. downside? Could've come with some more bread...or less sauce. Tita ended up using her pizza crusts to keep enjoying the sauce.\n\nBacon, Avocado, Tomato pizza. man, I wasn't sure what to expect. but whatever Tita wants, Tita gets. How bad could bacon,tomato and cheese be? But avocado? The flavors complimented each other pretty well. The crust could have been a little crispier, but it wasnt bad.\n\nService wasn't all that great and it didnt seem that busy. But if I didn't ask three people for some napkins, who knows how dirty my pants would have been. While waiting to be seated, I did hear some people leaving complaining about the waitresses, so maybe it was an off day for all of them..\n\nPS. Cash only!", "author": "Cassandra M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-28", "description": "Great meatball appetizers but pizza is below average. And they are pretty pricey for the quality of food you get. Definitely better pizza elsewhere all over nyc but not bad for that spot.", "author": "Sung K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "Rude rude rude. The view is worth a star. The pizza is worth a star but nothing special. The host was beyond rude. Overpriced. Did I mention they're incurably rude? Never again.", "author": "Jamin D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "SERVICE  is a dirty word here.  I strolled in primarily to get out of the rain and although there were only a few patrons the Hostess #1 Tried hard to get me to take a seat at the bar, then a wall and seems perturbed that I asked for - and got - a window seat at a small table.  #2 Her very first words was a warning they do not take credit cards BUT they have an ATM.  Which is a pure evil genius move on the part of the establishment, instead of paying the bank money to let a customer pay with a credit card THEY get paid by the customer to use a credit card. #3 It took a LONGGGG time for a server to show up and take my order, a meatball hero and a Sprite.  I honestly didn't know they made bottles of Sprite that small.  A millennium later, my food arrived with a few store bought potato chips as decoration, I received what was a pretty decent meatball hero.  Now I truly appreciate the fact that the food was freshly cooked and delivered HOT, but the time it took was enough for the famer to raise the cow, the butcher to slaughter it and for them to cook it.  In all, it was an ok place to get out of the rain, but I won't be back.  The actual time I was in the resturant was about an hour and I left as soon as i finished eating.", "author": "Brian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "I'm usually in the ballpark with my fellow yelpers, but not in this case. I'm puzzled by how this place can be only 2 1/2 stars.\n\nWe came to this place for the same reason many others did, the line at Grimaldi's was too long. This was going to be our third time at Grimaldi's (if you haven't been to Grimaldi's you should get back in line, it's something you have to try at least once), so we had the experience.\n\nWe found the pizza to be right up there with Grimaldi's, only without the wait. The crust was just right, as was the sauce and fresh mozzarella. Scored a table for two by the window, and really could not have asked for better pizza or service. Usual bottle of wine, coupled with the food and people watching out the window - we had a great time. The owner or manager even came over and asked how things were, both while we were seated and again on the way out. There have been some complaints about the servers, but we didn't experience it. A small line started to form while we were seated, but we never felt any rush to get out.\n\nI found the prices to be on par with what you would expect based on the circumstances. You'll get a great pie both here and at Grimaldi's, the uptick in price in one is for the name, at Ignazio's it's for the location.\n\nA recommendation if you want to make a day of it - take the subway down to the Manhattan side of the Brooklyn bridge and walk across it, you'll get some great views of the city and IT IS the Brooklyn bridge. Ignazio's is less then a five minute walk from the BK side of the bridge. After you're done with pizza, and hopefully saved some room for dessert, head to the ice cream place across the street from Ignazio's, right on the water. Grab a scoop or two and head a couple hundred feet to the East River for some more great views. Instead of walking back over the bridge, or taking the subway, catch the ferry back to the city. They run every half hour or so. It made 3-4 stops in Brooklyn, 1-2 in Queens and then drops you off at 34th street in the city. The $4 ferry ticket may be on of the biggest bargains in the city.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "My wife and I found this place and had a lovely evening with a pizza and a bottle of wine.  The pizza rocks.  It is fresh and crisp and perfectly cooked. The service is good and it is cool being under the Brooklyn Bridge.\n\nWe came back with the whole family and everyone loved it.  After dinner, we walked along the waterfront in Brooklyn Heights.  Next time we are in town, we are coming back to Ignazio's.\n\nDon't forget to bring cash.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "Ignazio's pizza is VERY VERY VERY GOOD!\nIt's hands down one of the best pizzas I have ever tasted.\nI have ordered delivery from this place and the service was super fast.\n\nI have also been to the restaurant few times and it has always been a great experience. This place has a nice atmosphere, with the great views of Brooklyn bridge, just stunning, very memorable place, perfect for romantic pizza dinner or friends get together. The combination of amazing pizza and great views/location makes this place VERY SPECIAL.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "White pizza was great! Cannolis were awesome! Clean, bright, and open. We were seated quickly but the fresh food takes awhile to come, especially the pizza.", "author": "Justine S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "Cheers for the beer selection for saving this review. Blueberry beer all the way! The friendly service and patrons make the experience. \n'The Pizza' is disasterously thin and lacks the topping you actually request.", "author": "Regina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "This Place is great!! It's literally under the Brooklyn bridge, and the the view is really nice. \n\nEverything they have is delicious. Everything they use is clearly fresh, whoever makes it really knows what they're doing. If you want real pizza this is the place to go. The atmosphere is great, everyone is really friendly, and the place looks great. I don't know why peoples reviews complain about the price it's definitely worth it.\nIt also beats waiting in line at Grimaldi's just to get in only to wait again (forever) to be served mediocre stuff!", "author": "Samantha A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}