{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-06", "description": "so, the place was cash only, the sanitary inspection grade was B, and the proprietor was a grade A A-hole, screaming at people waiting to be seated, screaming at customers in the restaurant.  the pizza was imminently forgettable and over-priced.  there are thousand pizza places in brooklyn, all of them better, better priced, and with better attitudes.  no one should waste their money on this dreck.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-03", "description": "The waitress (with the tattoo of a 1 eyed Abe Lincoln) had a terrible attitude. She asked what we'd like to drink, it was our first time so my friend said 'what r the choices?'. She looked at him like he was an idiot and, after hesitating, said they're on the back of the menu and then flipped it over. Her attitude never improved. The white pie was ok, but 'the pizza' was blackened and crunchy. The live music was a bit loud and there were a LOT of children. Don't think we'll be going back there even though the white pizza was quite good.", "author": "Dick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "Wow, went for Grimaldi's long line and went around the block and found Ignazio's.  Man on line recommended it saying pizza just as good if not better. Went back to the wife who needed to use the BR  to P but long line there also. Told her to go check out Ignazio's.  Celled me back and said I'm starved let's try it.  Found the service below average. But we were starved and found the pie very crispy crust not soggy at all. In fact it was delicious.\nI would recommend it.  Of course we still need to try Grimaldi's. Maybe when we have a little more patience and time.", "author": "Ed M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-12", "description": "We had to wait 15 minutes for service and the waitress was rude when I confronted her. She replied saying it was host's mistake. Either way I had to remind her several times just to get us water. The prices are high for the quality of the food being served...and its cash only! You're lookin at almost $30 for a medium pie! It tastes like overpriced Tostinos pizza. No A/C!! Im sweating like a pig. It's so bad the waitress is fannin herself as I type this on my phone.", "author": "Ro D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "The Pizza is great!! Meatballs are outstanding!!! Service was OK but all around the place is worth the wait.", "author": "Keith H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "Lucky for us, Ignazio's is around the corner from Gribaldi's; otherwise we never would have eaten there. A former coworker gave some suggestions for spending the day in DUMBO along with walking the Brooklyn Bridge. We had a beautiful sunny day, but the line at Gribaldi's was too long for preschoolers to handle. Though the pizza was a bit pricey, the quality was top-notch: Perfectly crispy thin crust with tangy blend of cheese and herbs. Also it filled our bellies with two pieces left for home. And the view of the bridge was fantastic. Save room for Bklyn Ice Cream Factory across the street.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "Walking around under Brooklyn Bridge, it was a gorgeous day, and I was getting hungry.  There was a pizza place that opened up I think last year that I wanted to try, so we ventured to the place around the corner from Grimaldi's on Water street.  The ambience was nice, open space with lots of open windows.  Probably good for kids too since it's pretty spacious.  It was nice for brunch on Sunday since there was live jazz playing.  Service was good too.  \n  However the 8 dollar baked anchovy appetizer was really bad.  6 anchovies or something floating in pizza sauce with a couple pieces of bread.  The pizza was ok.  Not anything to write home about either.  The sauce is pretty bland.  If they upped the sauce ante, the pizza would be so much better.  The crust is pretty crunchy, and the cheese ik ok, just bland sauce.\n  I'm going to have to say that they beat Grimaldi's with everything but the pizza sadly though.  I really hope it improves, I'd definately be a regular patron then....", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "I love this place.  Maybe it's the contrarian in me, but I think it's far superior to *That* other place where Gen X spend their time waiting on line, but the ambiance is scruffy perfect for pizza, and the views of the Bridge are fantastic.  The pizza is fresh, the crust admirably thin and crunchy, fresh tomatoes and basil.  Get a Brooklyn Beer on tap, and wander over to the Pier for some ice cream afterwards.", "author": "Asher J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "I really wanted to go to Grimaldi's, but the line was way too long, so I chose this place with regret. After waiting almost 45 minutes to get in, it took another 45 minutes just to get my appetizer. I understand it was a holiday weekend but for pizza?? Food was average but the service was horrible. They brought my appetizer out and it was incorrect. I ordered the stuffed artichoke with prosciutto and it was missing the prosciutto. How did they correct it? By throwing a few slices on top. When the pizza finally came, it was warm.\nAs for the service, the waitress took our order, came buy to ask us how was everything before giving us the check then had the nerve to suggest a 20% tip. I had to ask for water. So there wasn't really any service. But here is the best part, my payment was c note and she return with the change minus the 20% tip no choice in the matter. I'm a native New Yorker and will tell you that there are soooo many other better pizza restaurants. This place doesn't know how to keep repeat business.", "author": "Jasper C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "This place was horrendous.  They got a B rating from the Health Department, which I'm not always convinced a place is terrible based on the grade.  So me and my girlfriend went in.  Suffice it to say, the grade may as well have been an F. The atmosphere was cold. The salad we ordered for appetizer was drenched in dressing. The plates were plastic, and weathered.  The waitress was rude, and she had the nerve to sit at an empty table next to us so she could study for her yoga certification.  When we asked the waitress if we can get another salad she said \"do you have a complaint about the salad?\" Seriously, who says the word 'complaint' when asking for feedback. After a few minutes of this ridiculous service, we came to our senses and walked out and still left a non-deserving tip.  We then went around the corner to Juliana's where it was warm and they know how to treat people with class. Ignazio's needs Robert Irvine, Gordon Ramsay, and Charles Stiles to save this place.  Seriously.", "author": "Vincenzo F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-18", "description": "Givin' it a 5 strictly cus there are a lot of passive aggressive \"wah wah wah\" tales on this page and these folks deserve it. I had a great time here and the service was lovely! The Sicilian pie was very well put together and the bottle of wine we split was very reasonably priced! So its not the infamous Grimaldi's big effin deal - I am not one to buy into hype anyhow. That line proves how ridiculous New York gets. How do you sell a piece of poo? Silk screen \"Brooklyn\" on it! Quality!", "author": "Hugh J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-29", "description": "Should have read Yelp before going in.  We ordered \"the pizza\" with sausage to go and had a couple of beers while waiting.  $7 for a beer?  When we got to our place (2 blocks away) we found the crust was so soggy you couldn't pick up a slice without it sliding off, leaving us holding triangular pieces of disintegrating crust.  Service was friendly, but this stuff is nearly inedible.  No wonder they only take cash:  I would have disputed a credit card bill.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Like many others, my wife and I tried to hit up Grimaldi's on a Saturday afternoon... until we saw the line.  So like others, we wandered around and stumbled upon Ignazio's.\n\nEven Ignazio's was fairly packed so we found two seats at the bar.  It turns out, we were sitting next to one of the owners, Billy.  Ordered a few Brooklyn lagers (appropriately) and Billy actually shared his own personal pineapple/ham pizza with us- how kind of him!\n\nThen we had our own pizza- pepperoni and artichoke- and it was really delicious.  The ingredients were fresh, the dough was perfectly crisped, and the cheese was really flavorful.  Some more proof: My wife almost never eats her pizza crust, but by the end of the meal, I noticed the absence of the crusts on her plate.\n\nAll-in-all, it was a nice experience.  The decor was a little off (more my wife's comment than mine), but to balance any soreness of the eye, Ignazio's definitely had a cool view of the Brooklyn bridge.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-14", "description": "Crooks...\nBe careful. They tried to shortchange us $10 by not giving us back the proper change for our bill and the service charge (which by the way was poor). The waiter tried to blame it on the owner/bartender/cashier saying \"I didn't count it when it came back from the cashier....\"\nI went to the owner/bartender, told him of the problem,  and he gives me a look like \"tough s---\" buddy. \nWe ended up there because we didn't want to wait for the 1 hr line at Grimaldi's with our out of town guests (including their 4 and 6 yr old) but I sure wish that we would have. I was really angry and embarrassed knowing that this guy probably pulls this on lots of unknowing out of towners...\nOh and by the way, the AC was broken (87 and humid outside) and they \"ran out of straws\"...what restaurant runs out of straws ????!!!", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "So happy I found the awesome pizza store.  The square pie was off the chart, the crust was crispy and the dough was light top with a sauce made of pure perfection. I also order a side dish of meatballs and I afraid to say they were better then my mom's.  The service was friendly and free spirted.  The view of the Brooklyn Bridge speaks for it self. It's a must have to experian", "author": "Bob P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "I don't know why a pizza place gets points taken off for decor when Grimaldi's is not remotely nice inside and they play annoying music.\n\nIgnazio's has really good pizza for the area, although a bit on the pricey side. They are baby/stroller friendly (go ahead, hate me for saying that) and I never have to wait for a table. I have been eating their pizza weekly, delivery or dining in. For delivery, it's the best in the area.\n\nIf you want a decent pizza without the line and are sick of Front street or Fascati's, go here. I can't speak for the loud music because I have never been there during a live band session.  The servers are extremely nice and accommodating. When we had issues, they politely addressed them. Keep in mind that any reviews from April should be considered lightly as they opened that month and were still working out their kinks.", "author": "s h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-02", "description": "Ignazio's is very disappointing. I don't even know where to begin. I guess with the food. The pizza is pretty terrible in that the crust is soggy, and the toppings lackluster and flavorless. To make matters worse, it is really overpriced. A large pizza with one topping, two beers and a bottle of pellegrino ran $50. Then there is the service, which is probably worse than the food. It took a solid half hour from the time we ordered for the pizza to appear. The place itself is really weird in terms of the decor, it feels thrown together and unprofessional. I'm guessing it won't be around very long. At any rate, I will not be going back.", "author": "Megan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-10", "description": "Would Never Visit Again!! like  most people, we ended up here because of the line for the Grimaldi's unbelievably long.  We were the 3rd group on line waiting for a table at the Ignazio.  The hostess told us it was about 15 to 20 min wait... 40 min later, it was still 15 to 20 min!   once we got in, the 5 of us were led to a table for 4 with 4 chairs and 4 sets of utensils.  no one bothered to check on us or give us an extra chair or utensils.  We managed to get an extra chair ourselves.  No one came by until 15 minutes later.  The appetizers (meat balls and stuff mushrooms were good).  Our main course, Sicilian pie took 55 min to come out, mean while the table who came 10 min. after us has gotten their 2 pie of pizza!  I asked for cup of tea, took 20 minutes.   Pizza was ok, nothing special, def. not worth the wait.  \nthe whole dinner took about 3 hours from the wait to getting our check.  We had to ask 3 times to get our checks.  and the bill came out, she charged our 18% gratuity!!  You've got to be Kidding!! either she was incompetent or she was working for the big tips at the birthday table next to us. \n\nIn short, decent appetizers, Mediocare pizz.  nothing worth an hour wait on line.  \nThe service is horrible!\n\nThey make you use their ATM machine cuz It's Cash ONLY!!!", "author": "Cadence R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-29", "description": "BAD PIZZA, BAD SALAD, BAD SERVICE, CASH ONLY!!! I have no idea what happened to this pizzeria! I used to come over a few years ago and had a great experience together with a great meal. But on my last visit it was a sad disappointment. The pizza was not fulfilling, yes I love the thin crust but it's better when it has plenty of cheese. My pizza didn't have the amount of cheese it used to have. I also order a salad, and they serve me a bunch of lettuce with a few slices of cucumbers and tomatoes. They charged me $13 for it! Apparently, they are trying to cut some corners, and they are loosing business and customers at the same time. It's sad, because I really used to enjoy this place. The location is great and the view is spectacular. My children love it. But if the food is not of the same quality for the price they're charging; I will have to drop them and use the pizzeria around the corner.", "author": "Luis C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "I did the tourist thing- walked over the bridge and back, took pictures, the works.  Afterwards there was no way I was waiting in the Grimaldi's line (especially when there are other Grimaldi's locations without the epic wait).  Ignazio's hit the spot: I waited 10 minutes instead of hours in the cold; the \"The Pizza\" pizza was delicious, with a crisp crust \u0026 fresh tasting sauce; and the view over the water was a nice bonus.  Oh yes, and it still is cash only, so hit up the ATM first.", "author": "saru k."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}