{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "We came here for a late lunch since Juliana's was not doing take out and their line was absurd. The pizza is good, nice crispy crust, good sauce, great cheese and plenty of fresh basil on top. This is classic NYC pizza, tasty and satisfies a craving but not worth going out of your way for unless you are in the area.", "author": "Jennie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "First, the Pizza is delicious! I don't know why all the hype with Grimaldi half block away. This place offers amazing authentic Italian pizza with many options for toppings without having to wait one hour in line to get in. We had fennel sausage and mushrooms on our pizza and I was delighted by how tasteful it was. The price was very good and came out to about $30 for a large pie with 3 toppings. \n\nSo, why only 3 starts? Well, first, they do not take credit or debit cards. Its only cash. They do have an ATM inside which charges a transaction fee. Second, their beer selection was limited and third, this place probably has one of the best storefronts in NYC and apparently they are not doing very well in keeping the place up to standards. The restaurant closes very early and the decor is mediocre. Hopefully management will invest more money and improve these deficiencies. Otherwise, if you're looking for good pizza around BK park do not want to waste huge amounts of time elsewhere, go to Ignazio's. You won't be disappointing.", "author": "Miguel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "My wife and I ignored all of our friends recommendations for pizza in Brooklyn. A local who was on a triumph stopped at a light told us about this place. I asked \"from one triumph rider to another, what's the best pizza around here?\" He said Ignazio's hands down. I'm glad I listened. The pizza was some of the best and the staff was great. I wish they had a west coast location (it's really that good)", "author": "Chris F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "If the pizza wasn't so good, this would be no stars. Absolutely appalling customer service. We asked for extra sauce on the side that we never received, the waitress spilled water all over my friend's foot, it took 5 minutes to get extra napkins, the waitress dropped our check without offering dessert or anything else to drink, and then the busser cleared our water glasses before we had paid. On top of all of that, the bathroom was filthy AND it's cash only.", "author": "Andy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "This resturant is a discrace! I advice everyone to stay away! The food was overpriced and there consideration for customers is zero! We ssked for the ac to be lowered several times and no one made an effort to do anything. I truly never experienced this kind of disturbing service. It was freezing! Everything was blowing around us you could not keep a napkin on the table. We decided to leave ...no one said sorry no one tried to make our stay pleasant . Any other restaurant would have compensated us somehow... this place simply didn't show any respect for its customers.... I regret going and only suggest go to carmine's it's worth the long wait! At least you will be satisfied with the food and know it money was well spent! This place is a joke ! It's a shame they state its Italian, its everything but Italian!", "author": "Gago U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "the workers were very nice, we were the last visitors, and they waited for us, although the restaurant was closed. minus one star for the fact that pizza we did not really like. But the establishment is very good", "author": "Irene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I can't imagine why this place isn't rated better- the pizza is AWESOME.  The service is top notch.   And there's typically NO WAIT!   We've been coming here for the past 8 years, and we have never had to wait.  Tonite, we had 8 people in our party, and we were seated immediately.  On a Saturday night.  \nGo ahead- wait in those lines for the other two places.  I'll be here, eating my prosciutto and artichoke pizza and drinking my Apricot Wheat from @Ithacabeer", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Very welcoming. Slices are available, and the margarita is PERFECT.\nGreat location cause you can take it and enjoy the view :)", "author": "Yoni B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "While Sunday nights are unusually busy (and I know this well), we ordered more than 2 hours ago from this location and were told it would be delivered within 30 minutes. When we called to inquire we were told either cancel the order or wait another 15 minutes. How much better a bad situation would have been had the woman who answered the phone simply offered to take half off, or offered ANYTHING really. Cancelling was not an option. After 2 hours, my kids were beyond hungry and a riot would have ensued. Very poor customer service indeed.", "author": "Jill M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Omg, this pizza was to \"die for\" The sauce on this simple pepperoni pizza was popping with flavor.. The basil and oregano all fresh. The tomatoes added sweetness to the sauce instead of the typical acidic after taste .. The light, crispy , airy crust was heaven. And dripping with the pepperoni oil. Omg . We bought the meatball sub because I have to taste a meatball everywhere it's presented on a menu.. Flavorful , not too compact , just my kind of meatball !", "author": "Carol F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Thin crust, but large, pies and slices. Margherita slice is a true fold and flop NY style slice with chunky tomato sauce, fresh mozz, and lots of basil. White slice is just fresh mozz, olive oil, and lots of garlic. Less floppy than the Marg but still foldable.\n\nCash only! Also annoying because you can't call in your order. Otherwise, enjoyable slices...not the best not the worst.", "author": "Denise D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Pizza is pretty good. Service could be better, but I don't think there is any incentive since there is an automatic 20% gratuity regardless of the number of people at your table.", "author": "Nirali S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "We came to Brooklyn to get pizza at Grimaldis but the line was ridiculous, we rounded the corner and found this gem. It's CASH ONLY to just keep that in mind. We got a straight up pepperoni pizza (medium was big enough for 2) and it was delicious! \n\nLeaving out the last star because the service was good but not amazing. The soda comes in glass bottles which is fun but no refills. The view right outside was awesome! Would come back!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "This has nothing to do with the food because I'm sitting here waiting for the pizza to be done. I'm in all how the lady that works at the bar here has such a nasty attitude.  If it wasn't for the somebody from the kitchen ( Javier (super nice guy) sitting at the bar we may have never been asked if we needed help. Hey lady if u don't like ur job leave. The bathroom smells bad but stuff happens lol but no tissue is crazy to me it's basically nobody inside of the restaurant so why aren't the bathrooms properly attended.", "author": "Destiny H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "CASH ONLY but ATM available in the restaurant.\n\nThe original plan was to try pizza in Juliana or Grimaldi's. However, at 2pm we really don't have much patience to wait on the long line for a slice of pizza. We ordered a medium white pizza with mushroom and two sodas, which is the perfect portion for two people. My advice is to eat the first slice asap without burning your tongue. The pizza came out steaming hot, but the first slice was the best. My third slice cooled down already and was not as enjoyable as the first slice. The flavor of the pizza is just right, it's not greasy at all, and it doesn't taste heavy enough that you would feel guilty about it.\n\nI don't know how the pizzas are in Juliana or Grimaldi's. Ignazio is definitely not a bad option if you don't want to wait on the long lines.", "author": "Ivy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "DELICIOUS PIZZA . This is NY pizza. Authentic, the real deal. THE BEST. \n\nService is great, location is good and really, nothing to complain about.", "author": ". .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "The pizza is good, not great. The sauce is certainly wonderful. Liked the view as well. Perfect cheese amount. However, the crust wasn't the best. Would have been better coal brick oven fired. For that, it is  4 star.", "author": "Mr P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "This is BY FAR our favorite pizza in NY! (SO much better than Juliana's and Grimaldi's.) It's so good, we went back again the next day and got some more! So glad our friends recommended this place!", "author": "Sarah Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Such a mess. Zero service. They will have 5 people cleaning table but no body take order. We need to remind them 4 times to bring our drink( just regular coke) poor management and extremely disappointed. 2 tables walked out next to us and they will leave their old drink on the table over 30 mins. Shame that they took the best location in Brooklyn. I would rather pay more next door. Pizza is good but not worthy for this kind of service. Sad place", "author": "Marshall L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Come here and enjoy the view with amazing pizza! The Siciliana Pizza is really delicious! The crust wasn't too hard nor too soft, it had the right crunch to it. The sauce was good too, not too tangy, or too sweet, just in the middle of it with the mozzarella balancing out the flavors. I loooooved the touch of basil they added, it enhanced the flavors of the pizza even more! You won't be disappointed, a great place to come by if you enjoy pizza!", "author": "Shanjida B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}