{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Great place to stop into and have a few beers, pizza and enjoy the view. The crust is always thin and crispy like any toasted bread product should be. A little on the pricy side for pizza though. We had 4 beers, prosciutto pizza and a salad all which came out to about 65 bucks.\n\nFood: Excellent (but pricy)\nAtmosphere: Good\nService: Excellent", "author": "Dane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Awesome pizza. Probably one of the best pizza's i have ever eaten. There is nothing overly special about the place but the service is great, food is amazing. Highly recomend anybody to check it out at least once. I go with my girlfriend or friends here anytime we want pizza or just want to have a relaxing day. The pier is right outside and its beautiful. The windows give you a nice view of the brooklyn bridge and a bit of the city landscape. Really great place to just eat pizza and enjoy your party's company.", "author": "Gerardo T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "Really enjoyed the pizza here. Nice crust, fresh tomatoes, wet mozzarella. And the chicory salad was surprisingly good.\n\nFriendly staff too.", "author": "E P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "I came here to meet my friend for lunch. nice location that is under the brooklyn bridge and nice view of the pier and the view of the brooklyn park. we had pie of pizza with pepporoni, prosciutto some pork, basil mushrooms, tomatos. it was tasty and the crust was not too thick. bit salty from the pork toppings. \nit was just another pizza joint.", "author": "Eleanor W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "So this place was Ok... went there to celebrate my nieces birthday and to tell you the truth I don't think it was really worth it. \nThe service was good waitress was attentive kept asking us if we needed anything which was good. \nThe menu selection is pretty small only has 3 appetizers a couple wraps ,salad and pizza . When we ordered the waitress tells us that they were out of green peppers which sucks because I like to order pizza with pepperoni and green peppers. How does a restaurant run out of green peppers maybe different Peppers but green come on.\nThe view is amazing you get to see the city you're right under the Brooklyn Bridge and you get to see little bit of the water so once again the view is amazing and the restaurant is right at the corner so you have a great view from where ever you sit.\nI do feel though that the amount of money we spent for two large pizzas was not worth it 1 I didn't get my green pepper on my pizza and 2 the crust was ok could have been baked a little longer. Only reason I'm giving it 3 stars is because of that amazing view.", "author": "Michell B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "Just dreadful. And to think there are 2 world class pizza establishments less than 5 minutes walk away. Plus one WITHOUT an hour wait (at peak times) a different (towards Dumbo) 5 minutes walk.\n\nService is just so bad you think the owner/operator must be in Colombia and this is just a way to launder some money.\n\nPizza is mediocre at best, ... but I only regret having read reviews like mine AFTER we threw away the better part of $60.\n\nYes, as they (several others, for sure, re this one) say, 1 star is only there because Yelp isn't perfect either - a zero star option is needed and with \"Iggie's\" the only accurate rating.", "author": "Ed T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Really amazing sauce. I could eat spoonfuls of it by itself. But the pizza(called \"The Pizza\") needed a bit of salt. I've heard there is better in Brooklyn but it's pretty dang good. The Pistachio Gelato was great too. Cute little shop right under the Brooklyn bridge so you get a view while you eat.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "I'd give this restaurant three thumbs up if I had a third hand! First off, I really enjoyed the food at Ignazio's. Second, the waiters were fantastic (specifically Tosh) and were always ready to help if we needed anything. Third, the amount of food served was enough to serve four people at least three times.\n\nThe cicillian opus pepperoni pizza pie that we ordered was very well balanced with the ingredients and the basil leaves that they topped it with expanded its flavor enough to the point where it was different, but still very enjoyable.\n\nThe restaurant itself is very nicely put together and if you sit in the right spot, you get a great view of the Brooklyn and Manhattan Bridge (as well as much of Manhattan itself).\n\nAgain, the service was great and I really enjoyed the food.\n\nIf you ask me, I think I may be heading back to Ignazio's for some more soon.", "author": "Lucy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "This place is the worst pizza place I've been to in NY! The food takes FOREVER to come and when it does it's mediocre at best. The heavyset man who was there the one time I went was incredibly rude!!! It took the waiter 20 mins to bring my friend a cup of coffee. When I asked about it he tells me sometimes it takes 20 mins to get the machine working then proceeded to argue with me. So much for customer service and caring that they people who you are serving are happy. Trust me as a life long New Yorker this behavior is unacceptable. Spend your money elsewhere.", "author": "Aruna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "It's Sunday night.  The sun is hovering inches over the horizon at the end of a brutalizing hot summer day.  And then.  You step into the double doors of Ignazio's and a refreshing blast of cool air embraces you.  Gotta love that industrial air conditioner.  ;)\n\nGreat place with a fantastic view.  Price tag is decent (i.e. $34 for a medium pie w/ basil, red cherry tomatoes \u0026 bbq chicken ...slices, not chunks ...and only cause they were out of prosciutto) BUT when you factor in the view of Brooklyn Bridge, the almost unobstructed view of downtown Manhattan and the cute date sitting across from you who is smiling and isn't cross cause we didn't wait 1/5 hours to be crammed into Grimaldi's... perfecto.  That is, seating is easy if it's 2 people.\n\nBut yeah, cash only.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Went here for lunch with my mother after visiting a school in the fall. Cute little pizzaria. We split a pie and an order of Estelle's meatballs with mozzarella as an appetizer. Meatballs were very delicious and was such a big serving we ended up taking 1 home. Thought pizza would be better since we were in BK but maybe it was just an off day. Would definitely come back for another shot if I am ever in the area", "author": "Janel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "No wait on a Friday night.\nIts not a fancy-pizza joint by any mean. It actually reminds me of a family-chain ex: Califronia Pizza Kitchen, BJ's, Yardhouse..those type of place.\n\nThis imply, portion are extremely generous and expect kids running around everywhere.\nThe pizza isn't Brick Oven, but at least they don't cheap out on toppings.\n\nIf you're craving pizza for a good value this is a good choice.  Sad to say it's not interesting enough for me to hike back out to DUMBO for, but nonetheless I don't regret trying it.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "A solid spot for good pizza.  I have eaten more then a few slices here - the baccon and avacado pizza?  Yes please!   \n\nNo bones about it - It's touristy, and slightly overpriced. However, the food had always been consistently good and when the line at Grimaldi's is too long...  Agree, \"cash only\" is annoying in NYC these days but... deal with it.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "CASH ONLY and the ATM doesn't work. People working here have an ATTITUDE.\n\nWe are in 2015 and credit cards are going to be a thing of the past soon with Apple Pay and the like. And here we are with \"cash only\" places still.\n\nWe eat our bland pizza (too much cheese) and they say cash only but we have an ATM. \nI go to the ATM thinking ok, 3 or 4 dollar fee, not good but whatever. Of course the ATM didnt work. I asked them and nobody knew anything or could help me. It seemed they felt embarrassed about it. One waiter told me that it breaks all the time. Other people working here seem to be family members who don't take the job seriously.\n\nThey told me to go to another restaurant around the corner. I go there and it's broken too. I get my phone and search for ATMs. There is one by the ice cream store. I finally get my money after 15 minutes. Go back, pay and when i ask for the change they COMPLAIN!!! They said they want the tip. I was so angry. After making me walk for 15 minutes looking for an ATM they DEMAND a tip? RIDICULOUS.\n\nThe place looks outated and doesn't fit at all in the area. Skip this one. There are better ones around the corner. \n\nI would give it 0 stars if i could.", "author": "J989 M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "Cash only.\n$3.75 ATM FEE - no other atm's around.\n\nGood pizza.\n\nI live in the neighborhood. These guys definitely operate under a \"screw the customer\" rule. Their pizza is good, but the cash only / atm fee is despicable. It is not in keeping with all of the great things going on with food in Brooklyn. \n\nSave yourself $10 on a pizza, go around the corner to one of the two best pizza places in Brooklyn.", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Came here for Fourth of July with a friend and we had to wait. It was packed ! Their service however was still phenomenal. They were on top of everything and the pizzas were damn delicious. Friend and I ordered a white pizza and paired them with some wine for her and beers for me. Their prices for the view you get are unbelievable, like am I really getting a view of the Brooklyn Bridge and Manhattan with delicious food for such a reasonable price? Definitely coming back here and trying out other pizzas.", "author": "Sasha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-08", "description": "Service was terrible; pizza was mediocre; beer selection very limited. Wait for Juliana's down the street.", "author": "Sims P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "I was invited to a surprise birthday party. Our hostess, a very charming platinum blonde, more than accommodated our needs. She was superb.  Thank you so much.y grandma's friend --- and guests ---  very much appreciated all the effort...down to music.", "author": "Tara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-01", "description": "We ate at this restaurant because the line at Grimaldi's was an hour long. Every other restaurant nearby had a wait. In retrospect, this should have been a red flag but we were starving. \n\nThe waitress was rude right away. The service was horrible and the good was mediocre. They charged us extra for rubbery cheese on my meatball.\n\nWhen we asked the staff how we can catch a cab from Brooklyn. They ended up calling a cab for us even though we still had half a bottle of wine left. \n\nDon't waste your time and money.", "author": "Adele B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Can't beat the location! Right under the Brooklyn Bridge, water \u0026 city views. It's also walking distance to Fulton Landing and the ice cream shop and all that. \n\nThe pizza is definitely better than average and they carry a good selection of beers, including local ones. Service was prompt and very friendly!\n\nThere's a very authentic Italian-Catholic vibe going on here too. I ate my pizza and had my Brooklyn Brown Ale with the Virgin Mary looking down on me the whole time. She was cool about it, though.", "author": "Jul J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}