{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Living in the neighborhood, we thought we owed it to ourselves to try all local establishments, so one Friday night we popped into Ignazio's for a pie. We were greeted by a hostess guarding the door, yet we could obviously see the place was nearly empty on the inside. Empty tables in NYC is usually a warning sign, especially on a Friday night.\n\nWe ordered a White Pizza (Fresh Mozzarella, Pecorino Romano, fresh garlic, cracked peppercorn, select oregano, parsley and olive oil) off the barebones menu, and it arrived fresh at our table in about 10 minutes. The pizza has some interesting qualities to it. There was oozing, stretchy cheese when we pulled the slices off the tray, yet the top was completely rubberized. The crust had zero stability and the cheese slid right off, even with a good fold. The chef was very heavy handed on the parsley, throwing in all the stems as well. This led to a heavily parsley-flavored pizza, not necessarily the topping of choice. After a minute or so, that oozy cheese solidified and we had floppy crust topped with an oily hockey puck, toped with mounds of parsley. Not quite up to our standards of good pizza.\n\nAre we being harsh? I think not. Perhaps if I lived in the middle of nowhere, this pizza would have been ok. It it probably better than a Dominos or Pizza Hut style, but still an average to sub-par pie through and through. In a city like NYC, where you have a million great pizza options, you should skip the ones like Ignazio's. If considering this place, instead just go up the block a little to Julianas, or, if you prefer a lesser slice but still great, Grimaldis.\n\nTip: Cash only. ATM inside restaurant charges $3.75 to pull out cash.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "Came here with friends on Friday night for a quick dinner. The pizza is meh not super fancy but not super bad. It's tourist trap coz they charge 20% tips no matter what. Is it even legal?! \nCASH ONLY. Or $3.75 ATM FEE.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Hidden Italian restaurant! First of all, I want to mention their PHENOMENAL customer service. My girlfriends and I decided to sit at the bar. The ladies there were so nice and constantly checking in on us. They also helped us decide what to get on the menu and was so patient. In addition, we observed the team work of the staff and they really worked together as a team to make sure customers are taken care of. We ordered wings and the Sicilian pizza. The wings came out steaming hot but it was delicious!! The Sicilian pizza was amazing, we got half pepperoni and half cheese. The crust was nice and thick.", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "In July, I found myself in Brooklyn feeling the Dumbo vibe.\nWhat better way to top it off than having some wine and pizza on a hot summer day?!\n\nWe came here through the recommendation of a friend. I wasn't too excited to be eating pizza coz it's one of those things that's either a hit or a miss\n\nThis  place  though  was quite impressive. We got in at a time it wasn't too busy and were quickly seated. Our orders were taken speedily and after much deliberation we made our selections. I can't recall which pizzas we had coz I am doing this review a few months later ‍ At least I have a pic. \n\nThen the unimaginable happened. I got a pizza burn... yeah I tried serving my pizza slice and the delicious slice of steaming hot heaven landed in my lap. Cheese down.\nI wiped down the mess and kept eating and the next day I noticed a blister  I now have a small scar on my lap and it's evidence that this meal will remain with me for life.\n\nI will be back.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-15", "description": "Waitresses disrespectful. Food and drink overpriced and be careful because they charge you a service of 20% of device as a mandatory tip", "author": "Omar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "First time visit. Pizza is delicious. We most definitely return again. The restaurant is right next to the Brooklyn Bridges", "author": "Tuarise S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "person that greets you at the door is definitely rude, treat family with children like it a crap and won't let them in. I'm placing a complaint with NYC government agency", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "Thanks ignazio for the food poison. We had stuffed mushrooms and a large pizza for the 4 of us and the only one that ate the mushroom were my wife and I. This happened Sunday March 3rd around 5pm. Around 7pm my wife started to fell sick and then around 11pm was my turn. We spend the whole night going to the bathroom several times and it is 12 noon and still we are in bed in pain and very indisposed. We didnt have anything else after ignazio's, and we had breakfast around 10am.  we left our house very early for a city tour in Manhattan. We are new Yorkers and we fell very disappointed and worried when situation like this happen. It was our first and for sure our last visit to this establishment.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "The white pizza hands down is a must try. We order half white half red and I found myself wanting to exchange my red slices for the white ones. The pie was so tasty with the fresh taste of garlic  (real garlic not powder) and  fresh green herbs ( not dried out of the shaker bottle). The cheese combination was great they all complimented each other. And none of that white bachemel other places pass off as more cheese on this pie. \nIt was an ugly day so it wasn't very busy. I must go on a pretty day when they get packed to se if anything changes. It's a popular place and honestly I enjoyed it more than having to go through the Grimaldi long wait to just get a pie. \nTourist this is great pizza. Try it.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "LOVE this place! Love the food! Love the staff. The meatballs are to die for and the white pizza is the best I've ever had. Staff was friendly but not obnoxious- which is always great. There's a competitive place right around the corner which is great too, but we've eaten here several times and it's always been wonderful.", "author": "Susan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "Omg! I love Ignazios! We came here after walking across the Brooklyn Bridge. The pizza was the best and we had a perfect view of the Brooklyn Bridge.  The owner and his daughter were the best. They along with their staff took great care of us! I highly recommend Ignazio's.", "author": "Kathleen U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "Wish I could give ZERO stars! Terrible \u0026 rude staff. Wait on line for Grimaldi's or Julianna's Pizza. We bought a sausage and meatball pizza and only sausage came ! I told the blonde waitress and she said they are there --- They were not and we were charged. See the photo , you be the judge because we ate it and there was no meatball taste ! To add insult to injury, they automatically add 20% to your bill and had the audacity to give me a dirt look when I asked for my change back from a $40 (bill was $37.62 with the 20% already added).  If you do decide to not heed this warning at least have cash , the ATM charges $3.75!!   Criminal !!", "author": "Jess L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-22", "description": "Zero Stars. Didn't even make it to a table.  The host, wearing a giant Jesus button, was extremely rude. Walked out, after he was rudely talking about us, in front of us. The staff should be trained in customer service, or move that individual to back of house.", "author": "Bryanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I tried their pizza once before on a food tour in DUMBO and fell in Looooove. Came back here today with my bf for a cheese slice. At $4 a slice it's pretty insane cost wise but the pizza is amazing! Such a unique spin on your traditional cheese pizza, the added basil is really what sets it off. \n\nI will say though they treat this place like a VIP nightclub. There was a girl at the door who opened it for us and informed us that the restaurant is cash only, luckily there was an Atm inside. A bit bougie of a place for my taste but if you want to enjoy a beautiful day at the park in DUMBO with a good slice this is the place to stop.", "author": "Kendra H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Pizza is mediocre with too much oregano but the worst part is the owner who is rude to his guests and disrespectful to his employees.  It's upsetting to see people treated so poorly.", "author": "Christopher K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "The wait was a little long (2 hours) but Also because It's December so I understand but hands down it was so worth it . The Pizza was amazing . The crust was super crunchy . Really good taste . Good Prices \u0026 also the owner was present and he was very attentive that everyone had what they needed . One of the bilingual waitresses was super sweet and charged my phone for me while I ate. The boss boy was so nice when we asked him to bring us red pepper \u0026 cheese. Good vibe after all .", "author": "Karen V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "Grimaldi's was closed and Juliana's had a line down the street, so we gave Ignazio's a try.  We were not disappointed.  The pizza was excellent (Sicilian and a white).  The owner was there greeting guests.  He seemed genuinely interested in making sure everyone enjoyed their experience.", "author": "Greg G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Visiting NY. Juliana's and Grimaldi's had lines longer than Escobar can handle. Gave Ignazio's a shot. I've had some amazing pizza's in my life before but \"The Pizza\" is the greatest thing I ever had in my life. The crunchy crust, the savory toppings. Even the Caesar salad was bomb. Our waitress Nicole was very attentive and extremely nice. In fact, the whole restaurant staff was very pleasant and the view outside is perfect. Also, the music is amazing. Will come here every time i visit NY.", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "This place is clearly a \"tourist trap\" and catered for tourists. We ordered two things, wings (well done) and a pie. The waiter asked us if we wanted the wings as an appetizer which we said sure. \n\nAfter waiting for a little over half an hour I asked what's going on with our wings?! They said you asked for well done, lol. I ordered wings many times, it shouldn't take 30 plus minutes to get an order of wings. They finally came and was not all that, definitely not worth. \n\nThe pizza was nothing special, not much flavor. I definitely recommend staying on that line around the corner, they bring the pizzas pretty quick ;) and worth the wait. \n\nNever coming back and do not recommend. \n\nTo add they are cash only!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-09", "description": "I jumped in here at the last minute expecting longer wait times at Juliana's around the corner.  The service was awful - no greeting, no request for a drink order -- the place was empty and the waitress, bartender and busboy were too busy BSing to cater to us. \n\nThe pizza is decent however there is much better ... and just around the corner. Adding to the inconvenience is that it's a cash-only establishment.  So when I went to the restaurant ATM (which they advertise prominently) it was not dispensing cash -- look stuff happens.  However the response from the staff was \"Is this card from here?\" Huh?? Reading further reviews, I noticed the comment \"Tourist trap\" -- which probably clarifies the comment meaning they're used to out-of-towners -- however I was wearing a NYMets hat and my daughter was in a lacrosse uniform that read Brooklyn. Regardless, they sent me on a wild goose chase through DUMBO for an ATM and when I returned only commented \"oh i thought the ATM was around the corner\" - not a real compassionate crew.\n\nIt's a shame that DUMBO area has become a home for mediocre restaurants looking to take a dollar and not add to the fabric of what makes Brooklyn...Brooklyn.", "author": "Alex R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}