{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "great pizza place to eat and drink\nwent saturday on a beautiful day with my girlfriend \nwe got a pepperoni cheese pie and sangria drinks \nwell made !", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "First of all, Tourist tip, if you are walking the Brooklyn Bridge and then looking to get a pizza, you will head to Brooklyn Bridge park (back towards the river). You will run into two pizzerias with HUGE lines (why do people stand for 40 minutes for pizza?) keep going and the 3rd pizzeria will have a short line as it's at the end of the block, tucked around the corner. Good pizza, their regular \"The Pizza\" will satisfy most, clean, friendly staff.  \n\nI recall this area when I lived nearby in the early 80's, my God what a positive change. Few tourists braved it then, for good reason, and there was nothing in this area once they got there, except trouble.", "author": "Eddie Coyle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-16", "description": "Pizza was adequate but not as good as what we have had in Manhattan. \n\nHowever the service was horrific. Slow, Rude, exasperated....\n\nBeer selection is very poor, mushrooms burned.\n\nThere are better options within 50 yards.", "author": "Dave P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-29", "description": "My biggest complaint with this place is the extremely slow service. I visited this place during Memorial Day and maybe that's to blame, but when I look at some of the other reviews, I'm a little skeptical, and maybe this place is just always super slow and unattentive? The pizza, however, was pretty good.", "author": "Amber B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "Very nice pizza place. The pizza is amazing and the crust is very crispy. The soda comes in cute small bottles and the location is incredible right under Brooklyn bridge. We always order margarita pizza pie well done and it's amazing.  The garlic bread is also incredible too. I would recommend this place to anyone by downtown Brooklyn.", "author": "Lonnie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-24", "description": "The pizza is decent tasting but once it cools down the crust turns into carton hard.\n\nThey take forever to actually just give you your pizza.  I don't recommend this to anyone in a hurry. \n\nThe service is ok and the person that greets you at the door is a big cold.\n\nAlso they only except cash and the atm machine never gave us our cash....", "author": "Carla N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Pizza was delicious and the service was outstanding! I would highly recommend trying out Ignazio's", "author": "Asna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "I love the way how the pizza is being displayed on the table. We ordered pineapple and ham speciality, medium, which is just enough for two people. Also, nice interior design, which adds an extra point to the overall rating. \nHowever, they can definitely improve more on the service. I placed my coat at the back of my chair. The waiters kept walking through the narrow space between my chair and another chair. Eventually my coat fell on the ground after one waiter sneaked through. Just a personal feeling, they could have avoided this kind of inconvenience caused to the customer. \nOverall, would recommend to give it a try.", "author": "Sisi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "I avoid this place. Perfect sauce. Brilliant crust. Great cheese. It is all yummy and because all of the tourists leave as soon as the stores and carousel shut down, it becomes an oasis of calm Italian goodness. The service is good and the pizza holds up for a cold breakfast the next day. So, yes I avoid this place. One should not consume great carbs that make you think about them days later.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Pizza! Pizza! Pizza! \n\nTo be honest, this was not our first choice when we were looking for a pizza place but since the line wasn't long (YET) and the wait time was shorter, we opted for Ignazio's. We had three medium sized pizzas and we got the Sicilian, the White (with chicken and bacon), and the pizza (with ham and pineapple). The white was pretty creamy and tasty and my friends loved it. For me, I liked the Pizza better--the pineapples were not cut up but it seemed like it was seared or something. For drinks we had your regular soda but in a cutesy size little bottle--really enjoyed that. \n\nThe waiters were really nice and hospitable. The music taste was pretty good! Their playlist was really enjoyable! It's worth a visit!", "author": "Camile R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "I love this place \nIt's our second time going on a vacation to New York \nI'm not sure why the reviews are so terrible \nThe service was great\nPizza good fresh and hot \nSauce and meatballs amazing \nWe'll definitely be back", "author": "Theresa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "The plain cheese pizza is super delicious, a 9/10.\n\nWhite clam pizza is pretty dry- lots of clams but no cheese and sauce make it dry and more of a flat bread- still solid though.\n\n\nGive me Juliana's over Ignazio's but when the lines for Juliana's and Grimaldi's are ridiculous Ignazio's delivers super solid pizza at a fraction of the wait.\n\nWould go back here!", "author": "Raphael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "It is a Sunday night in march and the setting is beautiful and the ambiance is perfect. My lady and i sat by the window and enjoyed such fresh and delicious pizza. The service by Nicole was Amazing .Our get away spot for sure.\n\nTony Brown  and Dedra McMillon\nThe Harlem Table Neighborhood Bistro", "author": "Tony B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-04", "description": "This place is like a factory :-) we where there on Saturday and the weather was perfect maybe that's why it was so busy,there is a line so you will wait. The food is very good, we had meatballs that just melt in your mouth and pizza which is also very good.I would say this place would be a 5 star if it didn't have two big negatives:it's only cash and they have only one bathroom...but we will definitely return and", "author": "Frank F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "Stopped here to have some pizza for lunch while in the area. The line was too long where I really wanted to eat and they were about to close soon to stoke their oven so this was the closest alternative. Now of course when you go somewhere and there is no line compared to the other two guys that have long lines there must be a reason... This was definitely the case here. First off the place is pretty rundown with frayed chair upholstery and dilapidated tables... don't even get me started on the disaster they call a bathroom. \n\nAnyway we just wanted to get a quick pizza and keep it moving. We ordered two sodas which they have the mini 8oz glass coke bottles and we got a medium pizza half white half regular. \n\nWhen the pizza arrived it looked good but when pulling out the first slice the crust was soggy and dripping. I took a slice of each. Neither was very good but I would pick the white slice as the better of the two. Besides it being soggy it wasn't very flavorful and there wasn't any salt, pepper, garlic, or grated cheese on the table just a shaker of hot pepper flakes to use. I was so disappointed... I was thinking a couple of dollar slices from Manhattan would have been better then this. Oh well you win some you lose some... Next time I go to Brooklyn I'll go earlier and wait in the line elsewhere... \n\nTwo stars is for the service because the people were really nice and friendly.... Unfortunately I say skip it...", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "If the application had no star, i would have given ZERO. We were waiting on the line and the hosts infront of the door were the most rudest people that I have seen in the New York. They stucked us infront of the door and there was so dusty and sunny, and when we wanted to move they told us you can't move, even there was empty tables we were waited, and we were exposed their rude behaviours. They told us if you don't want, don't wait. So if you don't care your custemers why you are open I really don't understand. And when we decided to leave after these rudeness, they yelled us saying bye bye. And not only one time more than three. I don't wanna even walk infront of this place.", "author": "Ecem A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "Visiting the old neighborhood in Dumbo and craving a slice, we stopped here. Loved the greeting by Louis, the owner. This is a cash only establishment. We had an excellent specialty pizza with fennel sausage, pepperoni, artichoke, onions and arugula. Steamy and hot and a perfect table to people watch.", "author": "Julie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "This place is great! My fiancé and I needed to eat a quick dinner and the staff here were extremely accommodating. We were seated immediately and they offered us a taste of the wines. We ordered a salad and custom pizza and both came out within 15 minutes! Even better, they were both super tasty.  Thank you Ignazio's!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "We stopped in the area with the intention of going to a different pizza place but came here because the line was shorter. We are so glad that this pizza adventure worked out the way it did! We got a chance to chat with Louis, the owner while we waited and he was so personable. The ladies from Texas love you, Louis! The pizza ingredients tasted so fresh. The bacon was perfect! I highly recommend for some tasty pizza, fun music, vibrant atmosphere and beautiful scenery!", "author": "Paige G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Great place to take in the view! Plus the food is delicious and their sangria is so good. Try the shrimp pizza", "author": "Mayra A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}