{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-30", "description": "I hate mushrooms on my pizza, I always have. I am not a fan of mushrooms in general, but on pizza it just grosses me out. So when my father returned with slices of mushroom (after visiting me for the first time in months), I decided to suck it up for him and not act like a child by \"picking them off\". I subconsciously wanted this pizza to change my mind about the mushroom topping...it didn't. It redefined all my judgements about that gross idea. So besides my mushroom problem, the pizza was terrible. The sauce was badly seasoned, the cheese was bland, and the crust was dry and not crispy....or whatever they were going for. It's in a great location, but unfortunately it is not up to par.", "author": "Emma H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Pizza was really delicious. The view from the restaurant is amazing. Perfect płace for \"pizza date\".", "author": "Lilia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-03", "description": "DON'T FALL INTO THE IGNAZIO TRAP!\n\nThis is how it goes EVERY time. Grimaldi's is packed. You want Za. You say, \"Oh look there's a pizzeria and it looks decent too!\"\n\nWRONG. You just fell for into the Ignazio trap where he will devour you slowly, bite by bite.\n\nit saddens me to say that this was one of the worst pies I've had in years. Let me start by saying how beautiful the pizza looked! (for $25 dollars it better!) Regrettably, the pizza was bland...bland! How could a pizza with such bright, vibrant, red, whites and greens be so bland? \n\nUnfortunately, this place will continue to thrive because tourists fall for the Ignazio trap by the dozens; a unique victim every day.\n\nWhy did I fall for this trap you ask? A native New Yorker and enthusiast of pizza? Because Grimaldi's had a long line and upon turning the corner, we were caught in a massive downpour. \"Let's pop in here for cover it doesn't look so bad.\"\n\nAnd so it happened. Another trap? The ATM...$3.75 for withdrawals, the restaurant is cash only. Expensive meal, pizzeria uno decor and one of the worst pies I've had in years in NYC.\n\nSave yourself.", "author": "Morris B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "The restaurant's delivery car parked in an illegal parking spot and the owner warned of towing other people's car if they park in front of the restaurant. And one of their waitresses yelled at us saying we hit their illegally parked car, which we clearly didn't. If that's the way they treat their customers, I have no surprise that the restaurant was completely empty while nearby pizza restaurant was packed in the new year eve.", "author": "Vanessa W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "Ehhh I kind of agree with everyone else... This place was subconsciously/purposely built in mind to collect the runoff from Grimaldi's. The pizza isn't that great. The crust is out of wack and soggy. Also the traditional margarita pizza is kind of bland. I don't understand?? I made a homemade pizza the other night in my kitchen that tasted 10x better than theirs. However, I did enjoy their stuffed artichoke appetizer though. It wasn't the conventional stuffed artichoke (you know, steamed standing up with breadcrumbs, parsley and cheese) but made with only the hearts with a giant dollup of ricotta cheese on each and some breadcrumbs. I also enjoyed half of my blueberry ale as well... but that's not of their own creation. Gorgeous view of the Brooklyn Bridge though. You can't deny that.\n\nSeriously though, either man up and wait in line for Grimaldi's or go up towards Brooklyn Heights and get Fascat's or Monty's if you want real (i.e. good) New York pizza..... NO excuses! (play like a champion)", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "I ordered a regular large pizza here and it was excellent. It was one of the best pizzas I've ever had. The only thing about this restaurant is that it takes a while after you order to receive your food. I was waiting for a long time and I had to ask every time I wanted a refill for my drink. Overall though this is a great pizzeria and I recommend anyone who comes to DUMBO to eat here. I am a New Yorker and i have to say it is one of the best tasting pizzas in the city", "author": "John-Carlo B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-09", "description": "I feel bad for giving this place two stars - it really wasn't that bad - good, passable pizza that you'd be glad to find around the corner (if you didn't live in Brooklyn).  But let's be honest, the primary reason this place still exists is because Grimaldi's has outrageous lines at time.  I don't think anyone would be coming to DUMBO just to sample Ignazio's pizza (again - it's not bad, just not *that* good).\n\nI was one of those people a few weeks back.  Having previously dined at Grimaldi's (on a weekday, when the line was just slightly out the door) i considered waiting in the \"wait - that can't be the line for Grimaldi's can it?\" line, but eventually hunger won out and we ventured off for different options.\n\nThe other reason Ignazio's gets two stars is the prices.  To say i felt taken advantage of is fair.  I had a very nice dinner later that evening at a place in Manhattan for about what i paid for half of the pizza.\n\n(and that, ladies and gentlemen, is how you write a review about Ignazio's that talks more about Grimaldi's)", "author": "James F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Went back. Impressed as ever. The last time I went, it was pretty good, but it seems that Iganzios gets better as time goes on. This is the best pizza on the block, even better than Julianas and Grimaldi's. His calzone is still to DIE FOR. And his pizza is still the best tasting on the block. He added a coffee/espresso machine recently, and it looks like he's finally gotten it right. The service was great, the food was excellent, and the wine was tasty. All in all, he's gotten better and if your still attracted to the tourist traps of Grimaldi's and Julianas, give Ignazios a try. Trust me, you wont be dissapointed.", "author": "Frank B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-20", "description": "The pizza was pretty gosh darn delicious.  I suggest getting the Sicilian and then adding what you will from that.  We got it plain and the basil was nice and fresh, the sauce yummy, and the dough just the right amount of gooey. \n The service was okay- nothing to complain about, but not good either.  \nBut the thing that got me was that the beverages are all bottled.  When my friend ordered an iced tea, it was a bottle of black tea with lemon.  Just seemed strange.  The sodas were also a bit expensive.  With that though, 7 people were able to have a nice lunch for $100 tip included.", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Let me be honest...me and my dude were heading to Grimaldi's but the line was hella long and our appetites were freakin through the roof! We crossed paths with a fellow foodie who recommended Iggi's instead of Grimaldi's - and we were like seriously?! So we had to check it out (yep our tummies were barking).\n\nIggi's is right under the bridge and you can see the East River...great food with a view?! Coolness! We had the half and half medium pizza...he wanted basil and cheese and I wanted my meat (fennel). \n\nWe improvised and the relationship was saved!\n\nThanks, Ignazio's!! ;)", "author": "Chante R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "First time trying Ignazio's pizza and it ended up being a really bad experience. Delivery was over 10m late(after 50m wait), pizza was soggy and stuck to the top of the box. I wonder if this is how their pizza always is or just a bad order. Will never give them another chance unless I get a refund and explanation of why this order was so bad.", "author": "Lubomyr S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "Absolutely Fantastic. I love this pizza. I crave this pizza!\n\nLarge Pie (21$) + Pepperoni ($4) = 8 Slices of Glory \n\nI have also ordered their Spinach Calzone, which was good but not as delicious as the pizza.  \n\nApricot Beer - Check Plus\n\nCons: Cash only :(", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "There's Grimaldi's just around the corner and the lines are always long. This has always been my go to spot for pizza after a day of playing in the park with the kids. The pizza is just as good and the Service is always great. I miss the Manhattan Special though. Don't know why they stopped carrying it.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-15", "description": "Was here for a private event.  Service was great! Very friendly, helpful and also made sure we had everything we needed.  Selection of drinks was awesome.  Seems like they sell lots of local sodas and beer!! The pizzas was delicious as well.  We tried a variety of their special pies but I really wished I tried a simple cheese and sauce pizza.  Taco pizza was very spicy but it tasted true to a taco from Mexico.  The bacon, avocado and tomato was surprising yummy.  The creaminess of the avocado really pulled all the flavors together.  As for the shrimp pizza, it was my least favorite.  I just felt like they just threw some shrimp on a pizza and called it day.  I think if they chopped the shrimp into smaller pieces it would really blend all flavors together in each bite.  My favorite and the reason why I would return here is for their tender and flavorful meatball app and house salad with their house dressing!  Seriously so good.", "author": "Cindy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Wow, a little shocked that this place does not have higher ratings.  Besides the prime location and view (under the Brooklyn Bridge) the food is pretty good.  Had the stuffed artichoke with prosciutto app and a Margherita Pizza, with two glasses fo Montepulciano. \n\nThis place is a fantastic alternative to waiting over an hour for another famuos pizza spot around the block.", "author": "Mark V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "SO GOOD. Really so delicious. Perfect crust and sauce. Great atmosphere, service and pretty cheap!!", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Is $21 too much for a very good, large cheese pizza?  I don't know.  I guess based on these reviews it must be somewhat.  I really liked it though, and am only holding off on a 5th star because I had carry out that someone else bought--seems like I should have a more first hand experience for a 5th star.  To be clear, pizza was outstanding.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "Pretty good. Service was SLOW but the staff was super nice. Prices were pretty good for a pie.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-05", "description": "It was pouring rain. We had trekked out to DUMBO for the pizza at the Flea, which is amazing, but it was rained out. So, we figured Ignazio's would do. Well, we were wrong.\n\nWe got 'the pizza' with fennel sausage. It took forever to come, and when it did it looked like it had a grease puddle in the middle. It was floppy and soggy, and there were NO NAPKINS for de-greasing. We were each allowed one small, thin, non-absorbent napkin. When we asked for more we were given one more each. Seriously?\n\nThe pizza tasted pretty good, I really liked the mix of spices on it. I think it was just basil and oregano, but it was nice. The fennel sausage was good, but there was hardly any of it. For $3 extra, I expect a decent amount of sausage. Maybe the rest of our sausage drowned in the grease? The crust was nothing special, but probably would have been good if it had been cooked in a wood or coal-fired oven, but it was just a regular oven. \n\nThe interior was weird. Such a wonderful piece of property with windows on two sides and you fill it with weird outdoor bistro tables and uncomfortable chairs, with virtually no other decor? So much potential! The bathroom faucet is awkwardly positioned so that it's more over the counter than the sink - water splattered everywhere. This place also seems to be a magnet for kids, which is great, but it just added to the whole Am-I-in-an-upscale-Pizza-Hut vibe. \n\nThere are too many good options to waste your calories and your dollars on Ignazio's.\n\nCash Only.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Excellent pizza place with a view of the Brooklyn Bridge \u0026 manhattan skyline. Service is quick \u0026 the pizza is delicious!", "author": "Alexander S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}