{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "We choose to go here given the lines at the more 'famous' pizza places in the area (J and G). We had a chicory salad and a sicilian pizza. Having dined at Grimaldi's last weekend, we found that the pizza here was quite comparable. The service was a bit slower but the pizza was fine.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Recently,a very special family we know traveled from London to New York for the first time.  Like most tourists, they wanted to try NY Pizza and, of course, we brought them to our favorite NY Pizza/Italian Restaurant of all time, Ignazio's!!!   What a joyous way to start their NY Experience!  We ordered  2 pies; both fresh mozzarella cheese, plum tomatoes, pecorino romano fresh garlic, oregano and olive oil and a sausage and mushroom pie.  We also ordered stuffed mushrooms, Estelle's meatballs and stuff artichokes.  As always, the food was amazing!  The staff, as always, was wonderful and the view of the Brooklyn Bridge was the cherry on top.\n\nHow proud we were to to start their vacation with the best.  They plan on starting future NY visits to Ignazio's as a tradition.  Our families and friends love it and people pass it down to their family and friends, etc.  I wish I could give it 10 stars, it's that great!\n\nWithout question, I encourage everyone to visit Ignazio's; you will be back again over and over.  It's our absolute favorite and it will be yours too.", "author": "Paula R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "Delicious pizza, friendly attentive server, and great atmosphere. \n\nGreat authentic tasty pizza with fresh ingredients are hard to find in NYC. This place is the real deal. The two of us ordered \"The Pizza,\" with fresh mozzarella, Italian plum tomato, Pecorino Romano, fresh basil leaves, oregano and olive oil, then added mushrooms and artichokes. The crust is thin and crispy, exactly to my liking! All the ingredients and toppings taste market fresh. The friendly server drops by intermittently to check if she could bring us anything. The interior of the restaurant is open, spacious, cozy with high ceilings and huge windows providing direct view of the NYC downtown bridges and lower Manhattan. The location is ideal, across the street from the Brooklyn Bridge Park entrance. \n\nThe prices are a bit steep for NYC standards. Our large pie with 2 toppings cost $29. To me it's well worth it. The large pie amply feeds two grown adults. In a city where most mediocre pizza with canned ingredients gets passed off as good pizza, I'd much rather pay more for the real deal.", "author": "Jeani K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Nestled in the corner near Brooklyn Bridge Park and around the corner from Julianna \u0026 Grimaldi's, one could say that Ignazio's is a hidden gem. Grimaldi's has really dropped off but Julianna's is still good. Ignazio's pizza quality lies somewhere in between the two - but the best part is they also deliver and sell slices! Service is spotty tho.", "author": "Lily N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "This place is an embarrassment to pizza and Brooklyn. My boyfriend and I only came here because we were starving and did not want to wait on line for an hour @ Julianna's. \nThe service is awful. Our waitress barely said a word to us, only when it came time to order did she say *anything*. Didn't come over once to see how we were doing or anything. Asking the busboy for napkins seemed like a chore. \nWe ordered their regular pie, which I asked for well done. Not cardboard done.\nThe crust was virtually impossible to bite into, and you couldn't fold it. I've asked for well done pies before that were completely edible. I don't think anyone understands what \"well done\" means in there.\nI asked our waitress for the check along with a refill of water. She dropped the check off and proceeded to come back about a minute later ready to pick up the bill when I said \"hold on! We didn't even look at it yet!\" So, we're sitting there figuring out how much tip to leave, when she comes back, AGAIN, not even 2 minutes later when I had to aggressively wave her off! I'll let you know when it's ready! Geezus. I've never seen anything like that before in my life. Way to make it awkward. \nJust an unfriendly and awkward place. Nope. Never again. This place is crap.", "author": "Janelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "My friend and I came upon this place accidentally. The wait wasn't too long to get  in however we did wait  awhile for our food. Once our pizza arrived though it was piping hot and delicious! Crispy thin crust (they have thicker crust if you want) the sauce was perfect and the price was reasonable. As someone mentioned it's cash only and an ATM is inside.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "My daughter, friends and I went for a late lunch yesterday - a busy Sunday.\nThe service was extremely slow - waited 30 minutes to order water and wine.\nThe pizza was OK - nothing special.\nThey only accept cash and the ATM was broken which caused quite an issue as the nearest ATM was around the corner in another restaurant - this was not said when we entered the restaurant. We did ask...\nI will not be going back.", "author": "Sandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "They have really good authentic pizza. The ambiance is rustic yet charming. The service is good but, keep in mind they're maling fresh pizza so be patient! I would recommend this place for families, date night and casual lunch.", "author": "Brianna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Waiting in line for grimaldis was not an option; the last stop on my pizza to do list for the day, wasn't going to be prolonged, so, I called in my order to grimaldis and walked around the corner to Ignazio's to give it a try. Glad I did, good pizza, brilliant crispy crust, nice flavor, attentive service, and a great view. All the other reviewers may buy into the hype of grimaldis as did I perhaps... But, Ignazio's pulls through and really isn't overshadowed by Grimaldis at all. Check it out with and open mind and enjoy.", "author": "Doug W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "The Sicilian is delicious! I was debating whether to go here or take a trek to one of the higher-rated Sicilian joints on various \"best of Brooklyn\" lists. Glad I chose this - the crust has just the right amount of crunch, the sweetness of the sauce is balanced perfectly with the fresh moz, pecorino romano and fresh basil. The only problem is that you eat beyond your point of being full because it is that. good. Will not disappoint!", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "As a Brooklynite who loves good pizza,  this place it's not it.  If you are starving and just need to eat fairly quickly this place will suit.  I personally cannot stand loud and dirty places but I don't judge a place by its cover.  Cash only is another unwelcoming feature of this place.", "author": "I I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "I went there Saturday night at 8:00pm.  There were tables available and we walked in hoping for some delicious pizza.  The staff is the RUDEST; even for Brooklyn.  We are Brooklyn natives who have eaten all over from Brighton Beach to Brooklyn Heights, Bay Ridge and Fort Greene.  The boy who greeted us at the door at 8:00pm Friday, July 15 literally put his hands on my arm and chest and lead me and my wife back to the front door and said you can't wait inside.  The waitress of hostess followed behind him and told us there was no waiting inside.  There were tables available and nobody waiting.  \nGuess the boy at the door still trying to figure out how to be a man.  Maybe the food is good but we will never know.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "After walking over the brooklyn bridge we decided to check out this spot for out pizza cravings. There was a small line and the hostess told me that there will be a wait of 15 mins for table. We were able to secure the table in less 10 minutes.\n\nThe design of the place is nice.  The menu is not huge but has all the staple authentic pizzas. We went for the medium size silician pie with chicken topping, red wine and beer..I really liked the pizza and two of us could not finish it and we had leftovers :).\n\nThe staff was very friendly. Our server was very courteous, overall the service was great.\n\nFYI - Cash only.", "author": "Vineet S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "I feel like i just got really robbed. Lunch for 2 at $60.00. The pizza was nothing and i do mean nothing to rave about. Full of sauce, came apart, cheese what cheese it seemed like it was just sprinkled on there. House salad $10. $10.00 for lettuce soaked in oil. Their sodas are at 8 ounces. I left the customary tip but believe me for the amount of service we received that was a joke. I am in this area often but this will certainly be the first a last time I ever eat there. To the tourist and other Newyorkers good luck getting ripped off. They told us off the batt only cash accepted and the ATM is in the back. I think they are more interested in the fees they charge that the enhancement of customer relations and experiance. My dear friends save your money and eat somewhere else.", "author": "Frank A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "If you don't feel like waiting on the 10hr line around the corner...you can come right here.This place is really 5 stars but isn't b/c I have to make sure I have cash on me whenever I want pizza from here. \n\nThe white pizza with extra garlic \u0026 arugula is sooooooooooooooo good. Just don't plan on kissing someone for a few hours...its definitely strong! \nI usually hit this place in the warmer seasons and sit out looking the NYC skyline...NICE!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "This pizza has absolutely no soul. The only acceptable reasons to come here are a) if you have a screaming two year old and can't wait in line; b) if you have never been to Brooklyn before and don't care about food at all or; c) if you just finished a hastily planned wedding in Brooklyn bridge park and need a table for 6 on a Friday evening.", "author": "H P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-01", "description": "The pizza was good by the slice but nothing to write home about. The servers were friendly and definitely the high point of our experience, the food was just ok.", "author": "Tom O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "Disclaimer- I didn't eat pizza...\n\nSo why am I writing a review for a pizza place? One Word- Valerie! I was in Brooklyn for the day, and I was so irritated for some reason. Anyway, I found a parking spot outside of this Ignazio's, which is right under the Brooklyn Bridge. In desparate need of wine, I sat down and notice the tiny restaurant  with cute decor and hipster servers. My server, Valerie was amazing! She was able to save the night with a beautiful personality and great wine. \n\nAlthough it is situated in DUMBO, it was rather empty on a gorgeous Friday night. Not that I was complaining... It was just an observation. I can't wait to come back and explore the pizza and more wine. Hopefully, Valerie will be there to make my next experience as beautfiul as my first one.", "author": "Taheerah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Need to catch up on my reviews ... Went there in the late summer .. cash only place, but a good pie, even though it was really busy.  Good service and attention, and playful atmosphere ... I would go back", "author": "Floyd H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "The pizza is OK, just OK - the crust is crispy and good, but doesn't really have much flavor. Same goes for the pizza overall - I am a firm believer that the sauce and crust make the pizza (mozarella cheese melted is always good) and their sauce again, doesn't impress me. For the price (~$4/slice) it just isn't worth it to me. Not to mention the bartenders here are super rude and have an attitude - they didn't say a single word to us, not even a \"thank you\" \"you're welcome\" \"have a good day\"....why so snotty when you have no reason to be?", "author": "Becca K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}