{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "I thought the pizza was really good here and a great back up plan when Grimaldi's has a ridiculous line.  I got my pie to go so I can't review the service or the decor, but on pizza alone, I was very happy other than the $21 I paid for a plain cheese pie.  Also, cash only.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "yes we tried to go to Grimaldi's but the line was ridiculously long so we came here because it was just around the corner 30 seconds away... the pizza and starter were both good. thin crust and tasted really fresh and flavorful. the cheese tasted nice and prosciutto was decent. there was fresh basil all over the pizza. the anchovy in tomato sauce was alright as well.  the bill came to 39 excluding tips for a large (we picked the toppings), starter, and a ginger ale.  The place had some empty seats but we were made to seat at a combined table (basically we were sitting in between two tables with strangers on either side).  Depending on your seat, you get a view of Manhattan Bridge. It's not an amazing view, but nice enough. we only had Grimaldi's in Hoboken and I remembered the pizza there being cheesier, but this one was good also.", "author": "june Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "I'm honestly surprised at the negative reviews for this place. I admit I came here only because the line at Grimaldi's was too long but I was definitely not disappointed. Great, gourmet, crispy, tasty pizza. can't wait to go back!", "author": "Victoria D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "I don't understand all of the bad reviews, either.  The pizza was delicious and the meatballs were sublime.  Service was wonderful.  The whole experience compares incredibly favorably to the tourist-trap up the block.  Would definitely go back.", "author": "Cameron G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "We really enjoyed this place.  Quiet, beautiful view of the bridge (seriously, the view doesn't get better), the meatballs were delish.", "author": "Langy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-13", "description": "Went for lunch on Saturday before catching the plane back to So Cal.  It was just fine but nothing special.  Started with anchovies in tomato sauce -- quite nice.  Had a white pizza and a sausage and pep.  Crust was good at the outer edge, but suffered from the same soggy sodden tip issues (particularly the sausage and pep) that plagues Grimaldi's.  White pizza had sauted onions and ricotta.  Oddly, the ricotta was cold.  Further, the sausage and pep was a bit light on the cheese.  The meatball (free!) and gelato were excellent.  I know it is heresy, but I might have preferred an extra-cheese pie from the evil Fascati on Henry Street more.  Frankly, I could care less about the decor, but the chairs were less than comfortable, and at those prices I cannot get behind an all-cash policy.  I'd give it one more chance before I said not again.  But barely.", "author": "Greg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "I went to this charming restaurant on one of the most desireable streets downtown brooklyn.  Across the street from the River Cafe with an unobstructed view of the city skyline and the Brooklyn Bridge. I was blown away before I even ordered. I went with my daughter and son and being a brooklyn native it is hard to get 3 people on the same page on who makes the best squares (pizza). Well once you taste Ignazio's square hands down this takes FIRST PLACE and we all agreed. The service was a beautiful sweet young lady who was helpful in choosing from the menu and the food came out in a timely fashion . We started with a salad which was so crisp and fresh you thought it was picked from your garden ,then for apps. we had the meatballs (and my son only eats his grammas) well for the first time I was glad my daughter was a vegeterian cause my son and I fought over the 3rd one , he won. The baked artichokes are also a must have you never tasted anything like this in your life all my daughter and I kept saying was \"what is that great taste\"! Then the Civelatta, OMG die \u0026 go to heaven for those of you who don't know thats skinny sausage with potatoes. We ended this meal with the best suare pizza in brooklyn, the crust was perfectly crisp. You never find this crust left on anyones plate and the sauce you know the saying \"its all in the sauce\". AND, heres even more good news, this pizza travels well . I brought the rest of the pizza to my pop in staten island and it held its integrity still as delicious and crispy as when we ate it at Ignazio's. Great place for the whole family , a date or out with your friends and you can take that to the bank . BUONO APPETITO !", "author": "jennifer p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "Reading the reviews here I expected the worst from this place. I shouldn't have. In fact, I'd say this is the best pizza in Dumbo/Brooklyn Heights. (And it's far better than what Grimaldi's has become.)\n\nFirst off, yes, the space is horrible. Almost criminal given the view it has. But who cares if you have a good product - look at Difara's.\n\nLuckily, they have a great product. Started with an unorthodox shrimp pizza - breaded shrimp, bacon, cherry tomatoes, and parsley on a white pizza. Excellent, with a flavorful, chewy crust. High quality ingredients and a decent amount of them.\n\nWe then moved onto the Sicilian (a large one) - 16 slices of one of the best pies I've had. It's upside-down Sicilian style (or Grandma-style, or \"la nonna\"), with the cheese on the crust, then basil, then the sauce. Apparently the chef was really agonizing over this pie - opening the oven to check it a few times over the 30 minutes it took to create it. It was outstanding - one of the best I've had of this style. In fact, if the crust had been just a little thicker and the cheese hadn't \"separated\" a little in the sauce, I'd probably rate this a tie with Dom's pancetta-laced Sicilian slices down in Midwood.\n\nI don't know if it was the ultra-low expectations that I had that made this place come off as a gem, but I'll definitely be back.\n\nAs far as service, we were among the only people there for a lunch on a weekday, the service was friendly and professional (the cook is a bit interesting - traipsing around in his kilt and boots), but it did take a while to cook the pie. (With the attention lavished on our Sicilian, it might get bogged down during busier times.)\n\nAnd yes, it's pricey - two pies and three sodas came to $70 with tax and tip. But if you get it to go, the medium pies are as little as $14 and the most-expensive, the large Sicilian, is $24, and well worth it.", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-25", "description": "I would have given a higher rating except that for a table of 4 they added a 20% gratuity to the bill.  The menu said that a 20% gratuity is added for parties of 6 or more.  \n\nWe enjoyed the pizza and the waitress was attentive.  The tables are not crowded together.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "After hearing about Ignazio's and being a pizza freak, I decided I had to get there and try it. I cannot believe that this hidden gem is close to where I work and not far from my home, lucky me. First the stuffed mushrooms. They were insane. They tasted like my italian nonna's.. then the meatballs.. If you are italian, you never order meatballs out.. We were tempted and tried them. I brought an extra order home. they were fabulous. The bread they give you with them too was homemade and if I didn't have to save room for pizza, I would have eaten a loaf. Now, the finale... This pizza is one of the best I have had.. EVER! The crust was perfectly cooked and crispy. The sauce was mouth-watering and the mozz was devine. The shrimp pizza had huge pieces of shrimp perfectly cooked with applewood bacon, something I ordinarily wouldn't eat, but once tasted, I almost couldn't stop. The Sicilian pie was absolutely phenomenal.. What a crust..", "author": "jill m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "I went here this past Saturday with friends after deciding not to wait in the two hour line for Grimaldi's.  The interior of the restaurant and lack of a line was also much more inviting.\n\nThe pizza here was quite good.  The server was also very pleasant.  We were told that they were \"out\" of medium-sized pizzas for the night which sends a clear message that the dough is not fresh but the pizza was good nonetheless.\n\nIf you need a comfortable restaurant to eat at and don't feel like waiting in the tremendous Grimaldi's line this is a fine alternative and very affordable.  Though cash only is a little strange.", "author": "Nathan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "After seeing so many negative yelp reviews, I was pretty wary when my roommate chose this place for her birthday dining.  I'm glad she's bolder than me and ignored the hype. I don't know if  people are being nitpicky or if Ignazio's has just finally started to get their act together or what, but the food was delicious, the service lovely, and the views spectacular.\n\nWe ordered 2 salads--the apple and the chicory Romano. Yum city.  I was more excited for the apple salad, but once I had a bite of the crunchy, Parmesan chicory I didn't want to let go. \n\nThen came 3 pies--each a variation of \"the\" pizza (margherita)--one with sausage and red peppers, one spinach and Parmesan, the third with black olives.  Honestly, I was really impressed with the pizza, and I'm from Queens.  Crust was crispy and sturdy, sauce was fresh and bursting with flavor, basil leaves were whole and thick and fresh.\n\nService is always going to vary by individual, and thankfully we had a waitress who was attentive without being intrusive. Service was great.\n\nLots of people seemed upset with the decor. Honestly I didn't even notice. It's pizza. I don't expect too much in that realm.\n\nIn sum, I'm not trying to discount other people's bad experiences, but I went and was happily surprised. As someone who was born and bred in NYC and spent much of her life critiquing pizza (what's up to New Park in Howard Beach, Del Mar's in Shepshead Bay, and the other quality outer-borough joints that most city-folk have never heard of), I give it my stamp of approval.", "author": "clare m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-15", "description": "I went here on a Saturday. I wanted a meat pizza (sausage and pepperoni). I also wanted a glass of wine. What I learned: ignazios was out of pepperoni on A SATURDAY and only had \"two types of red wine left\". WTF?! Making do, I had sausage and onion and got a weird ceramic goblet of the red wine I did not order (I wanted the other one they had). The pizza was good. Maybe not the best but enough for me not to wait in line at Grimaldi's. Now...things causing this place to only get 2 stars - aside from being a nice reviewer - what sort of pizza place does not have pepperoni on a holiday weekend? What's with the terrible decor? Where are the wine glasses? Also, it's cash only. And their bollocksing ATM machine charges $3.75. This place is not worth it.  For better pizza, ambiance and the freedom to use a credit card go to Graziela's.", "author": "ashling f."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-15", "description": "We ordered out from here the other day.  They put a couple of delivery menus in with our order.  The best part was where $18 for one of the specialty pizzas had been crossed out and replaced with a $25.  Not that we would have ever ordered it in the first place but I think you can infer all you need know about the value for your $ here.\n\nPizza was meh.  Meatballs still quite good though but way too pricey.", "author": "Peter W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-04", "description": "This place was horrible.  I went on a Sunday afternoon with my two young boys.  We sat about 8 minutes before anyone spoke to us.  After ordering, our 1 pizza took 40 minutes to arrive.  The top crust was burned black all the way around.  I have literally never once in my life returned a meal, but we couldn't eat this.  So I asked the waitress to replace it.  She told me it wasn't burned. ?#$\u0026?  I was flabbergasted, but tried to be firm and polite: we needed an un-burned pizza.  The replacement took 20 minutes to arrive.  And the taste was mediocre, at best.  (BTW, waitress didn't offer me or kids a drink or anything -- her attitude was that I was wrong for not wanting to eat blackened pizza -- just ridiculously bad service.)  The place was filled with tourists, and it made me think that the staff might have the tourist trap mentality:  b/c customers are never coming back, why bother treating them well?", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-20", "description": "Wanted to go to Grimaldi's but did not have time to wait. We found this place right around the corner with only a 10 minute wait so we gave it a try, big mistake. That 10 minute wait was accurate but by the time we waited another 15 minutes for a server and then 15 more for water the actual wait for food was much closer to am hour. The 8oz bottles of Coke were $2 each, not really reasonable. The pizza was OK but no better than any corner pizzeria.  While I am sure it was just a mechanical issue, I do have to mention that the resturaunt was about 85 degrees, it was very uncomfortable.  Next time I will definitely wait for Grimaldi's no matter how long the wait is.", "author": "Stephen R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-09", "description": "This restaurant is terrible!  My wife broke one of her teeth on something that was in the pizza!  The pizza is basically tomato sauce.  The anchovies are raw and the peppers are horrible.  The owner does not believe in providing his customers with garlic powder.  Hey, if I want garlic powder, I don't want some over age hippie telling me I can't have it.  This is America, not a Communist country or a dictatorship!  Maybe he's trying to be like Mayor Bloomberg. The restaurant looks dirty.  The carpeting should have been removed years ago and this restaurant hasn't bee open that long.  The wait staff is obnoxious and rude!  I ordered anchovies and they only put them on half of the pizza.  I told the waitress this and her reaction was as if she could care less.  By the way, the anchovies were terrible.  The soft drinks are miniature in size so you may have to order more than one at $2.25 each!   Stay way from this dive!", "author": "Robert B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-05", "description": "never again!\n\nthey just lost 2 customers\n\nordered a pizza to stay, and said we may want to also order one to go.  our pizza arrived, and on looking at the size of it, we said we'll probably not take another to go, but will just take what's left. server says, \"too late, we've already made the second one\".  \n\nit's one thing to say, sorry you can't cancel (which in itself is ridiculous), but that they made the pizza to go before we could even start on our meal is even more ridiculous. when we brought this up to the server, is answer was \"the owner said, you can't cancel\" - OK OWNER, good luck, good bye, we are never coming back.  i give this place another 3 months tops.\n\ni am going around the corner where the owner actually greets the customers", "author": "Kavi O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-20", "description": "I just find this place awful. Like most others, this ended up being our backup to Grimaldi's, which I've never tried. But Ignazio's doesn't even compare to bad pizza because its just really bad. Overpriced, over-salted, lacking flavor, and awful service. I swear our waitress was dodging us, and in the time that it took for us to receive our pizza I realized that we could have waited in the line at Grimaldi's and probably had a much better experience.", "author": "Rupam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-18", "description": "We did not feel like waiting the hour for Grimaldis because the kids were hungry but after eating at this place I wish we did. After waiting what felt like forever for our pizza, it came out wrong. My kids are fussy eaters so we had to wait for another. We ordered a salad while we waited, small and pricy with hardly any dressing. We finally got our pizza and it was not worth the wait TASTELESS...The place is very loud  and the decor tacky and the prices high. There was not much of a choice on the menu so when all you serve is pizza it better be great. I read in the profile that this owner owned pizzarias in CT maybe this is considered good there but not for Brooklyn locals, maybe the tourists would find it ok. On the plus side our server was good. GOODBYE Ignazios, Grimaldis here we come.", "author": "eve s."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}