{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-05", "description": "Cute environment, just ok service (our waitress was very dull and the service slow), nice location however the pizza itself was truly disappointing. We ordered a large veggie and I must say that everyone at our table was truly disappointed. Not only was the pizza's crust partially burned along the edges but it was soggy...how is that possible I ask, and there was no flavor whatsoever. We had to ask for salt and Parmesan cheese to drown the slices in to try and give it flavor. It was amazingly disappointing because even that didn't work. We would have been better off either waiting an hour for one of the other pizza places just feet away around the block (our wait here was 20 minutes)or getting a slice from the dollar pizza place. Maybe other items on the menu were better but I won't know because I won't be back.", "author": "Bridget U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "Pizza wasn't terrible.\nService was horrendous (bussers were doing their job).\nHouse salad was the biggest waste of money. \nFor sure wait for Julianna's or Grimaldis.", "author": "Donald T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "If you look at my reviews / profile I try to be honest on my reviews. We ate here last week (end of Oct ) the place was not crowded. We ordered a clam pie which was nothing special plenty of chopped clams but dry. We ordered a regular pizza again nothing special crust was hard and chewy to the point my mouth hurt from chewing. We ordered baked Anchovies which we saw on the web site menu for $8. Our order comes and its more like stewed Anchovies in a tomato sauce. The Anchovies tasted a bit like lemon. We also ordered a Ceaser salad which had lemons on top with Anchovies as well. It seems to me they use the Anchovies from dish to dish. We told our waitress what we thought about Baked Anchovies the quality and taste and price . We showed her the website menu as she took away the mostly not eaten Anchovy dish. She apologized. Even though we told her how bad they where and what we thought we would get she still charged us. Not the $8 we showed her but in fact $12 that the restaurant menu showed. To me this is bad service which upsets me greatly. We are not tourists we live in the area and enjoy the neighborhood. Funny enough there are 2 other pizza places around the corner. So DONT waste your time going to Ignacio's where the food is soso and they DONT value the customer", "author": "R P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Overall was pretty good experience. Walked in and was seated right away. Took a little bit to get our drinks but wasn't to long. I got a Coke which came in a 8oz bottle that cost me 2.50.. We ordered two medium pizzas and it filled 4 of us up. \n\nDoesn't accept cards which kinda sucks but over all id come back again. Great food", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Just delicious!!! Best pizza that I've ever had  \"The Pizza\" is amazing and extremely tasty. Highly recommended, the stuff is nice and kind! \nPrices are fair.", "author": "Liliana Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "Watery pizza. The cheese slides off. No line, no wait, for a reason. Service was decent. If it's not your server, it's not their problem.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "The pepperoni pizza was delicious, the sauce was a bit sweet which I love. The bread was perfect not too crispy. I do recommend this place and will come again.", "author": "Ab B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Soggy pizza and bad service. Don't waste your time here! Seriously. The worst meal I've had in NY. I don't understand what the good reviews are. My pizza seemed like it was dunked in water. I could only eat the crust.", "author": "erin s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "The pizza was pretty expensive, in fact one of the most expensive pizzas I've ever got. It was worth it though! After this pizza, I finally get why people say Brooklyn pizzas are the best. Also the view is pretty spectacular from the restaurant and the ambience is perfect for a good chat. Decent spot if you're in the area!!", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "After walking the bridge, we decided to get pizza at Grimaldi's but the line to be seated was ridiculous and we were starving and exhausted. We got on Yelp and found Ignacio's. We waited 5 minutes.  Our server was very nice but I think she was the only real server in the place and it was full.  She had kitchen help/bus boys that brought food out but she was the only one who checked on us so it wasn't very frequently.   Later we saw her being the bartender too.  We did arrive later in the evening but two of us wanted manicotti but they were out.  My husband ordered iced tea and when he asked for a refill she said they were out of that too.  She brought him a Sprite instead but then charged him for both a tea and a Sprite.  With all that said, we ordered the white pizza with chicken and wow was it delicious!  If I lived there, I'd buy it all the time!  We also ordered a house salad that was very good and fresh with a great vinegar and oil dressing. My son ordered the cheese calzone for $20.  It was huge and could have fed 3 people.  It was too cheesy if that's a thing.  There was just too much ricotta.  It was like you were biting into a block of ricotta cheese.  All in all we were happy we stopped.  The pizza was worth it.", "author": "Becky O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Great service, great pizza. Simple . Came in for a slice and a beer . Pleasantly greeted.  Great experience . Much better experience than the over rated Juliana's crap or other over rated tourist traps in the area.", "author": "Andrey D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "$80 for two pizzas and two salads. Pizza's were OK but the two salads we ordered were not edible...the salad was brown and wilting and the Three Apple Miso not as described on the menu...have eaten here in the past with no issues...may take a break and try again ...", "author": "Susan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "Tried this restaurant for the first time on my way to a yelp elite event on a Monday night. The restauant itself had one family dining at a table and the posted menu offered several other options besides pizza so I opted to try a wrap sandwhich. \nService was immediate and the staff was very friendly. I chose the smoked chicken wrap (Cucumber, Lettuce, Tomato, Mustard, Mayonaisse, Olive Oil, \u0026 Red Wine Vinegar but minus the avacado) and asked that it be packed to take out. \nThe restaurant itself was very spacious and casually furnished. Although I did not order pizza Im not sure I'd return for the pizza because I noted from the menu that the pizza prices were pretty steep. My wrap was about $10.00 but it was pretty tasty and very filling.", "author": "Celeste B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Love this place! Brought my kids here, so kid friendly! The Sicilian pizza is my favorite and the portions are really generous for a medium! The lemonade is freshly squeezed and tastes really good, we had 4 each of us!! Really love the staff, very kind and attentive. The music selection is really great too! And the view makes everything better!", "author": "Angelica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Wow, I'm really surprised this place has mixed reviews. The pizza here is really good and much, much, better than Grimaldi's without the dumb wait and long lines.\n\nDumbo is not what it used to be and has turned into a tourist mecca which thus has created all these restaurants with massive lines and CASH only service which really bugs me. Because of this (massive tourist area) I barely come here but when I do its usually on a long run, or to walk along the promenade which I did today. After our nice long walk my friend and I popped into Ignazio's to eat some pizza and were quickly seated. Service was ok. Our main waiter was friendly and attentive, but the busser and other staff were clueless. More on that in a bit.\n\nOnto the pizza, they offer a good variety of different styles of pies with options for toppings. Unfortunately, due to location, you're going to pay higher prices than you would at a regular bklyn pizzeria. A medium pie is $17, a large is $21, toppings are $3-$4 each. We decided on large pie with pepperoni. The most we waited was about 15 minutes or so, it definitely wasn't long. The pizza was perfect to share between two people and the taste was really delicious. Crust was just right, had the right crisp and bite, not too thin or soggy like Grimaldi's up the block and I love that they put fresh basil on the pie. Overall, we both enjoyed the food and after two slices we were full. My only complaint was that during our meal the bussers kept coming around asking if we were done with our food when clearly we were still eating and had pizza on the plate. This happened 3 times and my friend was visibly annoyed. Aside from that and the not accepting credit cards the restaurant definitely has my support and I would come back. Oh wait, they should think about adding more appetizers to the menu, wasn't too much variety!", "author": "Marcie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This is a great hidden gem that does not have a long wait like nearby Juliana's. The pizza is great and we were not waiting long for it to come out! This is a great option if you don't want to wait the hour or more for Juliana's.", "author": "Drew K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "My friends and I decided to come here after we were all exhausted and hungry from walking throughout the Brooklyn Piers.  \n\nThe atmosphere was really nice, like modern meets hipster. Clearly the establishment was understaffed as we had to wait 20 minutes for any service. What disappointed me about the place was that we didn't get any water or beverages while we were waiting until 30 minutes later. \n\nI saw that the establishment had some empty seats but people that were coming were told they had to wait, so I saw these people leave. \n\nWe ordered a The Pizza with mushroom toppings. The Pizza tasted okay, but splitting the pizza among 6 people was not filling at all.  Taste-wise the pizza was more crunchy than most pizzas I've tasted. Personally I found this pizza overpriced especially with the total being around $30. Though the pizza was big,  the slices were not very small and not worth the price of 30 bucks. \n\nI also ordered a lemonade for about 3.50 thinking it was homemade sadly what I saw was them putting an excessive amount of ice into a cup and pouring lemonade that came from a carton you would find most supermarkets. \n\nOur overall total came out to be around $50 minus tax and tip", "author": "Ladiny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Best veggie pizza i have ever had. The tex mex pizza with drizzled honey crust. You can taste and relish every ingredient on the dish. Totally worth doing the long brooklyn bridge walk for this.", "author": "Aditi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-12", "description": "Do not order from this place.  They are awful. Their service is terrible.  They say they are going to deliver you a pizza and then they just close for the night without delivering it.  This would be a zero stars if possible.\n\nThe pizza is pretty bland anyway.  Cheap-tasting ingredients. Wouldn't surprise me if they went out of business soon.  Seems completely mismanaged.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "There was no line compared with the other places nearby, but it is because you can only pay in cash! The food is reasonable on time, the taste is good, but the service is hard to qualify, there is not enough waitress/waiters!", "author": "Mariana Irene V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}