{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "Ignazio's is located under the Brooklyn Bridge right next to Grimaldi's, arguably NYC's most hyped pizza joint. \n\nWell in my opinion Ignazio's is one of the top 4 pizza places in NYC (though haven't tried them all yet : ) . My current top 4 are iL Porto (brooklyn one), John's, Patsy's and Ignazio's. \n\nIgnazio's stand out ingredient is Fennel Sausage - if you didn't grow up in nyc like me and you're a pizza fan, you probably prefer ground sausage (fennel) to the typical ny sliced sausage. Ignazio's is the only real pizza place I've found in Nyc with fennel sausage. Also the view and the ambiance of the place make it a perfect place to show your friends (out of towners and natives alike). If you're a huge fan of the Grimaldi's and Lombardi's style pizza then you probably won't love Ignazio's. There are definitely two types of pizza lovers out there so it's important to figure out which camp you're in!", "author": "Aaron H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Came here with my sister who only eats NY (she lives in Maryland). Pizza was delish - thin crust, well done, fresh cheese, perfect.  We loved it.  Service is fantastic.  The owner, Louis, was kind enough to charge our phones, and we chatted with him for a while.  Really nice guy, truly takes interest in his customers.  Our waiter was wonderful, a lovely young man from England looking for work as an actor.  He was so pleasant.  I don't know why people wait on the long line at Grimaldi's, this place is so much better.  I'm definitely coming back en famille...", "author": "Glee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "What a awesome place so close to broklyn bridge, tex-mex pizza was superb and spicy,  crust was super tasty crisp. A must go if visiting.", "author": "Sarika S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-12", "description": "This place seems to exist just to take all of the people that don't want to wait in the ridiculous Grimaldi's line.  The wait for the Grimaldi's when I went was probably about 1.5 hours which is just ridiculous, so we decided to just try whatever else was nearby.  We found this place and gave it a try.\n\nThe pizza itself was pretty good.  Some of the other people in my group thought it was either too salty or not salty enough.  I thought it was okay for the most part.  The crust was nice, thin, and crunchy which I enjoy.  The rating would be higher if not for the ridiculous prices for what you get ($20+ for most pies), especially when you compare the prices to Grimaldi's. \n\nOverall, if you walk across the Brooklyn Bridge, want to get pizza, and don't want to wait 2 hours in line, this is a place you might want to consider.", "author": "Josh W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-27", "description": "BF and I consider ourselves to be pizza connoiseurs so normally i wouldn't waste my time on mediocre pizza places.  It was a beautiful day so we took a walk along the waterfront and found ourselves in front of the ridiculous Grimaldi's line.  I had a major pizza craving like no other.  Having vowed never again to wait in a tourist-laden line 20 deep (i made that mistake a few yrs ago at Grimaldi's and was sorely disappointed), my BF pointed out Ignazio's down the street where there was only a few people waiting.  \"Why not?\" I thought.  I'll tell you why.  Because even though the wait for a table is seemingly only 10mins... once you actually get a table is when your wait really begins.  Fine, it was a busy weekend... We'll grab some beers and just chill out.  The round pies didn't look very good at all and again, we know the places to get pizza in brooklyn so figured we'd try their sicilian pie instead- what they're famous for, after all.  We also ordered a side of meatballs.  We hold annual meatball competitions so we like a good meatball and I'm happy to report - this place has really good meatballs:  flavorful and moist.  Delish.  After 2 beers our pizza finally came out....... Eh.  It honestly was just OK.  The crust was super crusty, which is nice in a thick sicilian pie, but the dough was totally unflavorful.  I did not feel moved to eat the crust at all.  The sauce is really good but the whole ensemble just didn't melt in your mouth the way a Spumoni sicilian slice would have.\nService was mediocre.  There was a guy who kept our water filled and served our food and he was polite and attentive but our waitress was completely over it.  She asked to move us to a smaller table mid-meal and when we agreed, barely even thanked us.  Food was ok, service was blah.  I probably wouldn't go back.... it's not that it's bad, but it's just not all that memorable.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-11", "description": "Besides for the ridiculously amateur, confusing and jumbled decor (octopus drawn on the glass by the front door), the staff here doesn't take their jobs seriously at all. It's like, the only way you get hired here is if you're a completely loopy floozy. The waitresses huddled at times, laughed, broke up and walked away into separate directions \"spontaneously\" at other times, danced like they were in a nightclub, and at one point, when 3 of them were huddled, they were obviously pointing at me and snickering. I'm not offended for myself, I'm embarrassed for their employer - but something tells me that whoever hired these ingrates is not very concerned and he/she is probably convincing him/herself that the money will always be there as long as Grimaldi's is there. That's the kind of leech mentality that is obviously going on in this place.\nOne girl was dressed as a fairy (I think), another as a victorian women and another as a stripper - but I don't think she was trying to dress up.\nSome dude near the kitchen with a long beard was wearing a KILT!!! If you're not Axl Rose or Scottish, don't wear a kilt!!!\nThe beer that they claimed was Brooklyn Summer Ale on tap was OBVIOUSLY either Coor's or Miller Light. THIS IS THE MOST EGREGIOUS CRIME OF ALL!!! I drink beer every day and I know a lot about beer. They mislabeled and misrepresented the beer. So immoral.\nThe pizza was OK. It was fine but who wants to give money to such a sham of a place. Anyone can rip off one of the former employees of Grimaldi's and have them make pizza (not nearly as good, but OK), but a person that actually opens up down the block just to capitalize on the well-deserved line is simply a leech on society and vermin that should not exist. I'm all for open market and capitalism but this is just sick... And yes, I'm only saying that they shouldn't be there simply because they SUCK. If they were half as good, fine; let people go to both places but this is simply taking advantage of people that came a long way for good pizza and, simply because they are impatient, providing them with horrible decor, horrible staff and only half mediocre pizza.\nAnd just to mention it one more time, the class-less fact that they are simply cashing in on Grimaldi's success (via the long line and spills into their joke of a restaurant). I REALLY wish this place didn't exist so that I WOULD wait in line for Grimaldi's no matter how hungry or impatient I am!!!", "author": "Yitzie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "took some friends here who were visiting New York for the first time and had never had New York Pizza before. We came here because Juliana's had a long line and wait. Would not have known that this place was around the corner down the block if it wasn't for the large sign saying \"slices\"\nPlace is nice with open space but not as large as it looks with wood interior and mirrored walls. fun art work. Water is served in tin cups.\nThe staff was friendly but was not as professional as we would have liked. Another waiter came to take our order after we had ordered so I will give them attentiveness points but could be more organized. They also seemed to have more of a coffee shop mentality - not that this is a fancy place but needs a bit of polishing in customer service standards.\nThe advertising was a bit misleading as the signs said \"slices\" meanwhile they did not serve pizza by the slice. There was a long wait for our order so our waiter came to offer us a round of drinks on the house. We ordered \"the pizza\" with basil. Very tasty ! Not traditional Brooklyn dough pizza if that's what you're looking for, had a thinner crust. We really enjoyed it. We also order a calzone which we were under the impression would be in a pizza pie style due to the menu description. It was in fact an actual calzone, however; still very tasty. Soft dough. It was obvious that everything was freshly made.\nDownside is that they take cash only but overall, good place. I would come back !", "author": "Maya D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-23", "description": "This place is terrible. The only reason I'm giving it two stars is because we got ok service from the staff there. We checked out this place because we live in the neighbourhood and has never eaten here before....for good reason apparently!!!! The pizza looks appetizing when seen on pans from their large glass windows but this is all a misleading charade. We ordered \"the pizza\" as it's called on their menu, and it was no more than eight 99cent slices artfully displayed on a pizza tray at the premium price of $25!!!!! Ingredients were low quality and they do not have a brick oven. Seriously,do yourself a favor and skip this place and all others (including the new grimaldi$$$$) and head a 5 min taxi ride away to sottocasa where your mind will be blown!!!!!!!!!!!", "author": "M L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "I feel like everyone who rates this is giving it lower stars simply because it is not grimaldi's and people go there out of desperation due to grimaldi's ridiculous line.  Fact is- Grimaldi's isn't that amazing either.  It's good but not worth the line.  I thought the pizza was good- maybe a little pricey but it's Brooklyn and the cash only was a bit annoying (but G is cash only too).  Maybe it's because I grew up on Louis Tremini's Luna Pizza in CT that I love this place.  Chill out people, Grimaldi's is not the only pizza to eat in DUMBO.  Check out Ignazio's.", "author": "Jennifer T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Great Pizza! Just as good as Grimaldi's around the corner, but much less of a wait.", "author": "Raquel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-01", "description": "I feel like this place exists to steal impatient Grimaldi's customers away, but maybe just because that's what happened with me and my friends.\n\nI was so damn excited to finally do the Grimaldi's and Brooklyn Bridge thing after 4 years of living in the city, but one impatient \u0026hungry member in our group (ahem, fellow Yelper Jeff Z.) didn't want to wait in the crazy Grimaldi's line, so we walked down the street and found this place instead.\n\nAfter a 10 minute wait (as opposed to the 1.5 hours or so we would've spent in the Grimaldi's line), we got a seat inside. The hostess was very pleasant, and the service was nice enough. We split a large \"The Pizza\" ($20), your basic margherita pizza with basil, among 3 people and were pretty satisfied. It came with 8 regular-sized slices. I'm not a huge pizza critic, but I thought this was actually pretty good.\n\nInterior is nice and woodsy, and there's a great view if you sit facing the windows. Not sure how often this happens, but there was also a kid who was playing piano while we ate-- I was disappointed that we decided to leave just as he began playing Bohemian Rhapsody, wompwomp.\n\n**CASH ONLY** I think they have an ATM within the restaurant as well.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "Ordered from here last night for the first time and man it was good.  I ordered the medium with half pepperoni and half meatball with a diet coke.  It cost me 20 bucks but it was good.  Old style glass bottle for the coke which I didnt care for.  The pizza was thin, sauce was perfect, cheese was good, some basil leaves for flavor and I am hooked.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-13", "description": "Thwarted by the ridiculously long line at Grimaldi's but neverless determined not to be denied pizza, we took a whirl and allowed Ignazio's giant sign \"THE PIZZA\" to suck us in.... \n\nMediocrity ensued.\n\nThey only have one beer on tap, which is some form of Brooklyn (our luck? Pils. Blech).  The white pizza was bland, lacked cheese, and was salvaged only by a healthy dose of oregano, parm and red pepper that the waiter thoughtfully brought over to our table after only three reminders. \n\nA weak second option to Grimaldi's, whose line I eschew but whose tastiness will never be doubted.", "author": "Mag M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "My friend and I wanted a quick bite to eat and stumbled upon this place in our wanderings.  We split a chicory salad and \"The Pizza\", a basic margherita pizza with fresh basil.  The salad was nothing spectacular (just a bunch of chicory greens with four cherry tomatoes and dressing?), but the pizza was good to my taste.  Crunchy crust, just the right amount of toppings, good flavor.  Only possible complaint was that it wasn't cheap - $17 for a medium pizza - but the medium was plenty big for the two of us and we even had a couple slices leftover to take home.  Service was fine.  If I'd known about Grimaldi's around the corner, I probably would've tried to go there first, but we were happy with our lunch here.\n\nCash only, so come prepared.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-17", "description": "Joe's Bottom Line:\nDon't run there, \"Oh, I gotta have this\" style. But certainly don't avoid like the \"pizza plague\". The best part of the meal was the meatballs (soft and flavorful). Also ordered the baked anchovies and the stuffed musrooms. The pizza was eh...I have had better. Crust was good. Stuffed mushrooms were the lowlight. Don't order them. Tasteless and unidentifiable. Truthfully, I cut the crust off the edges of the pizza and used the crust as little \"scarpetta\" (in Italian that means \"little shoe\" and scooped up bits of the anchovies and meatballs, so I was happy. Not thrilled, but happy. Also, you're there to see the bridge and the park, so location being what it is, enjoy it. Don't aim here, but if this is where the arrow landed, you'll be close to the target.\n\nTop line:\nIm not a Brooklynite, so not jumping into your local vocal pizza war. I've never been to Grimaldi's, don't know what a Spumoni Gardens is (a garden of Spumoni?...really, that's the best name you could come up with for your pizza joint),  which doesn't mean I don't know pizza. While I would rather starve than eat Domino's, Pizza Hut, Sbarro, on this day, while meandering through Brooklyn Bridge Park, exhausted and hungry, we did wander into Ignazio's.\n\nAs mentioned above, ordered a white pie, some baked anchovies, stuffed mushrooms, order of meatballs. The sauce with the meatballs or the anchovies was exactly the same; fresh, but kind of non descript raw or fresh version of marinara. Not my favorite. Would have like the flavors to meld a bit more. They serve the meatballs and anchovies with bread...but it 's not warm and not toasted. So you have this nice plate of stuff that's begging to be scooped up, and you have some dense brickette of bread from which to scoop. Not worth it. You're located in Brooklyn. Go find a baker. No excuse for that.\n\nThe cheese pizza needed some salty cheese on it, The whole idea of white pie is the richness of fresh mozzarella juxtaposed against the sharp saltiness of a romano, some gooey funk of ricotta, some nice olive oil, maybe the bitterness of some arugola. Yeah...none of that here. Just not very tasty white cheese on a crust. The crust was nice, but the rest, was just...eh.\n\nThe \"cash only\" thing didn't bother me. Been through that program a million times. The metal water cup was a little funky. That's a first for me. I'd like it to be the last. So, overall, if you're starving and you can't wait an hour for what folks say is far superior pizza at Grimaldi's, you will be fine at Ignazio's. I was, and I'm somewhat of a pain in the ass.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Doing the tourist thing in the DUMBO neighborhood and started getting hungry.  Walked past a pizza place with a huge line (this was at about 2:00 on a Sunday no less) that featured coal fired pizza.  Passed on that. Ignazio's had no line and an attentive staff.  Ordered \"the pizza\" -- thin crust tomatoes \u0026 mozzarella.  Great tasting pizza and nice crunch to crust.   Over all good experience.  Only wish  they accepted credit cards.", "author": "Peter v."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-31", "description": "Count me as another one of the \"holy #$!, that's the line for Grimaldi's?\" crowd.  So being in the mood for pizza, we stumbled upon this place.  We tried the bacon, tomato, and avocado pizza, which sounded so promising.\n\nFirst off, the pizza was almost $30, and no medium pizza should cost almost $30.  The bacon was good, but otherwise the pizza was kind of watery.  It was one of those pizzas where you bite into the slice, and next thing you know the cheese and toppings come off of the whole slice; then you're hoping that the cheese doesn't get onto your chin and burn you.  \n\nSo if you're scared by the line down the street, just find something else to eat, and don't get suckered into this place!", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I ate here with a group of friends, there were 6 of us. Admittedly we came to the area to try the Grimaldi's Pizza you always hear so much about. And like many other people we arrived to find a very long line at Grimaldi's so we ate here. Not everyone was ready to dismiss Grimaldi's so quickly just beause of a long wait. It took our group quite a while to decide to eat at Ignazio's. I took note of the last customer in line at Grimaldi's, a woman wearing a bright green shirt and her exact location, which was well away from the front door down the street. I was quite sure finding another place to eat on this day was going to be better than waiting. \n\nI found Ignazio's to be a very good experience and I'm glad we gave it a try. The location is great, right under the Brooklyn Bridge. I found the restaurant to be clean, the staff friendly and the food no more expensive than anywhere else I've eaten in The City. The six of us ordered and our food arrived quickly. Everybody agreed their pizza's were very good.\n\nThey only accept cash, that would be my only complaint, but they're certainly not the only place with that policy. Leaving the area after our meal, we hung out around the prommenade by the river for a while, then we walked past Grimaldi's again and the lady in the green shirt had moved ahead just 15 feet at best and it was now over two hours since we first walked by and she was still nowhere near the front door. \n\nI have no doubt Grimaldi's is worth the wait, but at some point eating in a timely manner is the priority, especially when you're in NYC often like I am, and I can come back to try Grimaldi's another time, which I will do.\n\nBottom line, on my visit Ignazio's was clean, friendly, quick service and good food at a unique location.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "The Pizza is delicious, but the prices make me want to come here once in a blue moon. A medium pie is $17 and a large is $21. The coke products are $2.25 for a tiny little coke bottle. The decor of the restaurant is a little confused. They have painting on the wall that I think you can buy, the lightning is very hindu inspired, and the tables  have this marble iron feel. To tell you the truth I wouldn't mind going here again and paying $30 for a large pizza is probably the least of my problems. The problem I do have is the customer spending money on the food and we can't even get scratch free plates! LOL The place seems under staffed and it seems there are people just standing around looking and only one waitress was working the room. In the end I was pleased.", "author": "Kathleen R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "I am one of the many who could not stand to wait on line at Grimaldi's, so I decided to give this place a try because there was no wait.  I don't know what to make of this place, everything was confusing, down to the decor, to the carpeting and the wait staff.  Something weirded me out about that carpet.  It definitely was way too loud in there with band playing live music and a million kids running around.\n\n The pizza was not inedible but it wasn't good either.  The best part about it was the fresh mozzarella cheese, which was gooey and creamy.  The worst had to be the tough as shoe leather crust.  It wasn't crusty and chewy and charred like a brick/wood/coal oven pizza should  be.  It was too crisp, almost like a thick cracker or stale bread, and very very bland.  \n\nI ordered prosciutto on the pie and it was chopped up thick pieces.  Something I don't like either.  I like the whole thin sliced piece of meat on there and for it to get crispy like a thin salty meat cracker.  \nThe chicory salad we ordered was watery and the pecorino that was meant to be in there seemed nonexistent. I was looking for thin shavings off it but I guess there was very microscopic gratings of it.  \n\nService was terrible, I don't know if the waitress was new or not but she was all over the place and everything took a really long time to come to the table.  \n\nNot worth the money at all.  I'd rather stand in line at Grimaldis or  take out a Grimaldis pie and eat it in the park.", "author": "Chris F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}