{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "This place is extremely overrated and overpriced. I went there on saturday 7/26 and after waiting for over 50 min for 2 pies of pizza, the overhyped expectations came to a screeching halt!!! The pizza was \"ok\", nothing to rave about. I ordered two pies , one pepperoni and one veggie with a couple of drinks. My bill with tax was 85.00. This was for two freakin pies!! I have had Alot better Brooklyn pizza for alot cheaper... Dont let the hype of this place bamboozle you. Definitely no wheres near close to a true representation of Brooklyn style pizza.... Oh yeah and to top it off, they only take cash!!!!", "author": "Joel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Bad pizza. Bad service. Totally overrated. Couldn't even finish my pizza when the waitress was already cleaning our table for the next customer. Above that, the tip was imposed in the check.", "author": "Juan Pablo V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "We order delivery from here all the time: fast service, love the ingredients, very polite. Will continue to order from here as long as we live in the neighborhood. Love the white pizza, and the regular pies. Meatballs are really great too.", "author": "Brooke R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-04", "description": "Beware: Tourist Trap.  The pizza is fair at best.  Chewy crust, dull sauce.  $58 for two pies is ridiculous, they don't take cards, and then have the audacity to charge $3.75 at the ATM.  Don't mind paying good money for good food, but I hate being taken advantage of.  Definitely wont be back.", "author": "Greg D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "after stroll across the broolyn bridge my friends and I had meant to get a pizza from Grimaldi's but the fact the the line was an hour wait and we were hungry from the walked we decided against it. We walked around the corner and found this little pizza place.\n\nWe ordered 3 large pizzas for 7 of us and were completely stuffed. We got a margarita thin crust pizza called 'The Pizza' and a thick crust 'Sicilian' pizza which was square. And a Bacon Avocado pizza. \n\nThe sicilian and bacon avocado were my favorite. The thin crust was a little too thin for my liking. I would come here again if in the area.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-12", "description": "We were in the area shooting photos of lower Manhattan and starving...so we certainly weren't going to wait out the line in front of Grimaldi's.  Popping our heads in the door this place smelled delicious.  And peaking at the other diner's food is looked good too.\n\nUnfortunately it just didn't taste nearly as good as it looked and smelled.  Started with a garden salad.  Really nothing special.  Then had a large \"The Pizza\" with prosciutto.  It was a soggy mess.\n\nAnd what's most offending the entire bill (w/ a couple drinks too) came to $70+ for two people.\n\nWe should have known better.  The place is a tourist trap.  Save your", "author": "Ira M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-29", "description": "3.5 stars...\n\nWe had just walked across the Brooklyn Bridge and were in need of some NY pizza.  We were planning on going to the famous Grimaldi's pizza, but the line was insanely long... so we walked around the corner and found ourselves here.\n\nIgnazio's is a nice, clean sit down pizza restaurant... a little different than most pizza spots.  Service was OK, the waiter took the order and brought out the food, nothing special.  \n\nWe ordered the Sicilian style pizza.  It's square and thick.. not your big, fat, greasy pizza slice that you have to fold in half to eat... so you have to use a knife and fork.\n\nThe food was expensive but good and the service was OK, but still kinda disappointed I didn't try Grimaldi's,,\n\n\n\n**note, if you get the Sicilian pizza, don't try to pick it up and bite it. You WILL burn your mouth.  Use your fork and knife. I don't know how that works but it does.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-05", "description": "Ignorio's. \n\nThat's the nickname my partner and I have given this place after being seated and ignored for 20 minutes earlier this afternoon. No one came to take our order. No one brought us water. No one who appeared to be a staff member would make eye contact with us. The customers at nearby tables finished their meals, left and new customers were seated. At about the 20 minute mark, a waitress came and started to take the order of the girls who were just seated behind us. I turned around to ask her to take our order, and she disappeared through the maze of mostly-empty tables. \n\nI'm pretty patient about waiting -- when there's a reason. If someone's new on a job but they're trying, it's cool. I've been there. If a place is busy and I can tell they're in the weeds, we'll entertain ourselves until they're caught up. If wait staff ignore me because they clearly just don't feel like working? I have no patience for that. And it's doubly insulting to witness uneven service. Maybe the girls at the table behind ours can tell you if Ignorio's pizza is better or worse than the pies at Grimaldi's. We didn't stick around to find out. \n\n. \n\nOn top of the garbage service here, they engage in illegal tipping practices. Their menus state that they levy diners with a charge of 20% for parties of 4 or more. NYC law says that restaurants can add a gratuity to the bill ONLY for parties of 8 or more persons, and only up to 15%. [ http://www.newyorkology.com/archives/2009/02/nyc_prohibits_b.php ] If Ignazio's staff finds their pockets empty without auto-gratuity strongarming, I suspect that the problem is not with the customers' generosity or knowledge of US tipping protocols.", "author": "Emma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "Sicilian was meh. Not worth waiting paying $30. 20% gratuity automatically added on check when there was only 2 of us, what nonsense.", "author": "Kenneth T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-27", "description": "I live in Dumbo and always try to support stores and restaurants in my neighborhood.     I decided to give Ignazio's one more shot since my first experience was horrible.    My three friends and I sat down only to be told, by an extremely rude waitress, that they were out of EIGHT pizza toppings (out of 12)..  seriously, how does a pizza restaurant run out of onions?    The grocery store is that far away to buy more??   I said that this was the case the last time I visited Ignazio's and the waitress, full of pointless excuses, basically said this is what happens in restaurants in New York City.   Really?  \n\nThe pizza is average at best and extremely overpriced.  Worse is that they automatically charge a 15% service tip whether you have good service or not.   (!)\n\nI hate to complain and be negative about restaurant in my beloved neighborhood, but I will never return and will steer my friends far way.", "author": "Dan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "Great service, great food! Can't complain...\nI love their sicilian with artichoke, pepperoni, and mushroom. It's delicious! Also, tried their artichoke appetizer...it was yummy!", "author": "Monica G. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Was able to be seated immediately at a table in the window with a great view of the Brooklyn Bridge.  Service was nice and the pizza was good.  I ordered 'The Pizza' and was very content. Be advised, it is cash only. Also, look out for all the fun little octopi decorations and paintings.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-19", "description": "I don't write very many negative reviews I figure why bother -but in this case I feel it a public service to warn people about the douche bagNess of such a place as this. They know what they are doing.\n\nA friend of mine and I took our two kids each to the pier to play, walk and enjoy the views  - of course we all got hungry and the food consensus for Brooklyn kids is always about PIZZA. Our blood sugar levels were hitting that off kilter zone so we stopped in Ignazio's without realizing what a tourist trap it is. \n\nThe menu was giving us a headache and so we just ordered a pie for the kids that was $23 plus $3 extra for pepperoni.  Each kid had 2 slices of pie and a drink (ginger ale and a sprite like drink) and me and my friend had a non-alcoholic beverage. The BILL CAME TO $58 for that. They did include the 20%  tip which the waitress was more on the 15% scale (if that) we had to ask her for the bill after finishing for quite awhile and she was not helpful at all about the obscure details of the menu. \n\nAlso let me say this is a cash only restaurant - which seems strange for a place that doesn't even serve slices. They even provide a cash machine in the restaurant lol.\n\nThe pizza - was super greasy you could smell the grease coming off the pie and the bottom was super super soggy because of the heavy grease. The actual pepperoni slices on the pie were good though.\n\nAfter we paid the almost $60 (for pizza and soda) for a lunch bill - I went straight to the taco truck and had a couple tacos for less than $6 - they were HEAVEN and next time I am at the pier with or without my kids I know where I am going and it won't be Ignacios...\n\"fool me once shame on you\"", "author": "eva a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "SOLID!  I got to go to NYC and eat real NY pizza under the Brooklyn Bridge!  It wasn't the famous Grimaldis because their line was absolutely ridiculous, but ya know what, I would easily tell my friends to eat here!  It was delicious pizza.  Of course you are going to pay the NYC price for it, but you know what, it is worth it to say you ate some real pizza under the Brooklyn Bridge.", "author": "Big J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "Good pizza rarely comes in slices.  Ignazios knows this and only makes pies.  They use excellent ingrediants and everything is always fresh.  There is another famous pizza place around the corner ... famous for long lines and high prices.  This might equal better pizza, but I like my pizza fresh and without fighting huge touristy crowds.  So if you have a choice walk around the corner, relax and enjoy a good pie.  If you are a tourist and in the neighborhood, and you want real Brooklyn pizza, then try Ignazio's.\n\nPS.  If the pie is really good hopefully with a litte soda or beer you will let out a satisfing \"belch\" as one reviewer suggested.", "author": "Barre F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "Great sauce with the meatballs.  Pizza: meh.   Lacked salt, not great toppings.  Expensive.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "MEDIOCRE food. HORRIBLE service. I tried this place twice, because my kids were desperate for pizza and too young/antsy to wait in a long line. First time the food was TERRIBLE. The pizza was bland and rubbery. The salad was something I could have made with whatever was handy in my fridge, and then the insult to injury were the ridiculously high prices and then the ATM (Cash Only) in the restaurant that charged a $4.00 FEE!!! The second time I tried (similar deal - cranky, hungry kids insisting I give it one more shot) ... we waited 20 minutes for a table without being acknowledged and eventually gave up.  This place is a TOURIST TRAP. Juliana's on the other hand is MAGNIFICENT and WORTH THE WAIT, and Grimaldi's is also excellent. SAVE YOUR MONEY. This place SUCKS.", "author": "Drew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "Let me first start by saying that I am not a pizza lover.  I can live without pizza.  We were actually planning on having lunch at the River Cafe except that they weren't open til 5 on a Saturday.  So anyway, we chanced upon this place.  Yes, I have heard of Grimaldi but I have better things to do in New York than wait in line for pizza - and I don't even like pizza - so we decided Ignazio's is it!  We were seated right away but it did take a while for a waitress to come over only to tell us that another waitress is coming to serve us shortly.  WTH, right?  Why couldn't you just take our order?  But anyhow, our waitress came looking like Tinker Bell with her sparkly eye make-up so we were pleasantly amused and we forgot that we were waiting awhile to be served.\n\nWe had The Pizza with Pepperoni \u0026 for appetizers, the 3 of us shared the Sicilian Tuna.  The tuna was wow delicious - I never had tuna this good before.  Super yummy!  The pizza was wonderful too - brilliant crust and full of flavor from fresh ingredients.  The best.\n\nI wanted to give them 5 stars but I didn't like the wait plus the fact that they're CASH only.  Otherwise, raving reviews for the food!  Simply Delicioso:))", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-19", "description": "We came here only because the Grimaldi's line was too long \u0026 we were hungry. We ordered the sicilian pie, which was plentiful. Nothing extraordinary, but decent. Aside from the view, there is really nothing spectacular about this place. The pizza did not come out fast enough \u0026 we waited a long time. I guess for not wanting to wait on line, we waited for our food anyway. Service was okay. Not a very busy place. Next time I think I'll just wait on line outside for Grimaldi's instead.", "author": "Giovanna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "Could not be ____waiting for Grimaldi's. The sky opened up and it started to piss down HEAVILY. The Spiderman shoot down the street was on break and David Sedaris was only up to fan#700 @ the Powerhouse arena. It is a lovely joint and the waitress and hostess were lovely. The pizza is pretty decent but you have the best view of the BK Bridge since your sitting right under it. Decent crowd not too many tourists. No wait and I was able to use a wall socket to charge my phone. Meatballs were definitely the go for the appetiser and the pizza was pretty good. A bit pricey but your not waiting hours in line and or out in the hurricane outside. Its fun to look out the window and people watch especially as they come around the corner and get blown away. The drinks are miniature the coke only comes in a 4oz bottle.", "author": "Sheryl S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}