{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "So happy a good pizza place has gluten free options! Their sauce and flavorings were amazing!", "author": "Allison B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "This spot is meh. Ordered 2 pepperoni slices and 2 lemonades for $15. Not outrageous. However, our slices were given to someone who ordered after us and it took about 20 minutes to get them as they didn't even realize until we told them. \n\nSlices B+ \nService D", "author": "Isaac H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "I must confess - I was pretty skeptical when one of us (clearly wasn't me lol) suggested that we should get a pizza to go with the view - can't ever get enough of that! \nPros: \n- perfectly thin crust with well balanced crunch to softness ration (ha! Even I'm impressed by that one)\n- amazingly delicious thick cut bacon eeeeverywhere! Bacon does make life better\n- yummy pepperoni\n- pretty good sauce (if only a tad bit too spicy)\n- no line!!!! (Who needs shake shack with their mile long line! Ha!)\n\nCons:\n- cash only\n- if you don't like red pepper flakes, you'll find the sauce too spicy\n- my toppings kept falling off the end every time I picked up the slice because it was just so very thin at the very middle (tip of the slice)", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Excellent location right under the bridge. While everyone is at the hotspot pizza place with a long line out the door, we walked in and got settled in by a wonderful staff. The service was very homely welcoming and the waitress gave lots of tips of their area. Pizza is always fresh and hot and taste marvelous.", "author": "Dan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "I was photographing a bride a groom at Brooklyn Bridge Park when the groom decided to take a break and go for pizza for lunch. He suggested Ignazio's and since he was buying off we went. I'll get to the pizza review in a moment, but first.....\n\nAs we were entering the restaurant two women with baby strollers were exiting the restaurant and a man who looked like Bob Ross (the TV painting instructor) was holding open the inside door and TOLD me to let the women out first so I held the outside door until they left. As I was entering the premises he stopped me and in a rude and brusk manner while looking at the camera in my hand told me I was not allowed to take photographs in the restaurant. I asked if he was the manager and resentfully told me he was the owner. I assured him I was only there to eat and would like a table. He told us to wait a minute then showed us to a table. And there we sat, a busboy put some plates and silverware in front of us but no menus. He said a waiter would be right with us, we waited some more. Finally a waiter came over and asked us what we wanted, without ever seeing a menu. My client knew what he wanted and placed our order. But I still would have like to have seen a menu. Rude greeting by owner -1 star, no menus or proper greeting by waiter also -1 star. Now on to the pizza.....\n\nI was really surprised by the pie. It was a margarita pizza and it looked perfectly cooked, we had asked for it to be slightly well done and it was. My first impression when picking up a slice was that it was well done as we asked and the slice did not droop. The crust was perfectly cooked with the right amount of \"tooth\". Flaky with a good flavor. The sauce was not too sweet with just the right amount of tang. The mozzarella was right on point flavorful and properly melted the fresh basil was also very good.\n\nIf I lived in the area I could see this as being my go to pizza joint but as I've read on other Yelp reviews, and I quote, \"The staff was extremely rude and disinterested and this completely took away from the experience.\" After my encounter with the owner I would agree. Remember a fish stinks from the head down. It's also cash only!! So if you decide to try Ignazio's your results may differ, you have been warned. Mangia!", "author": "Alan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Simply the best pizza I've had in New York!\n\nWe were visiting family and playing tourists (walking across the Brooklyn Bridge) when we found this gem.\n\nBefore we got here a few of our friends raved about the best pizza place in Brooklyn being right at the base of the bridge. Well there was this place and one other that was popular, and on a hunch we chose Ignazio's. We are so glad we did! \n\nThe pizza was out of this world amazing! If I remember correctly we had two different pies, but I only remember The Pizza. That is actually what it is called, and justly so! Once you've had this pizza you too will refer to it as \"The Pizza\". It was fresh mozzarella, italian plum tomato, pecorino romano, basil, select oregano \u0026 olive oil. Absolute perfection!\n\nMy family also ordered their stuffed artichokes, and the ricotta in them was the perfect consistency. \n\nIt's a small little restaurant, but absolutely amazing! You must try this place if you find yourself on this side of the bridge.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This is a great summer pizza spot. I was kind of skeptical since it is so close to the Brooklyn Bridge I thought it might be touristy. The line to sit down was long so we got a take out instead. Maybe it was because it was so nice to sit outside in the grass at the park eating pizza but that thin crust is one of my favorites.", "author": "Brittany N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "This place has one of the best locations in Dumbo, but it is managed very poorly. I'm guessing the owner is the man holding people up at the door, but micro managing the staff and patrons. He actually asked people to move their seats at the bar to squeeze more people in. I was also seated right by the door, which the owner kept leaving open while people were coming in to prevent them from coming in if they had no tables, but the cold breeze was less than comfortable.\n\nOn top of that, this place is cash only and the ATM they have inside has a $3.75 fee. For one large pizza and 2 sangria's, spending $70 was a bit much for my liking. \n\nThe pizza and sangria were decent, but not amazing and not in my mind worth 70 and an extra 7 in ATM fees.\n\nBecause of the great location, this was a place I wanted to check out, but I won't be back.", "author": "Bethany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "The wings were banging! The sauce is homemade and amazing! Meatballs were delicious too! I would avoid buying sodas, they are very small bottles that cost almost $4.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "Pizza was totally mediocre. Burnt on the edges yet floppy in the middle. Crust and sauce had zero flavor. Sangria was $13 for overly sweet mixer. Cash only and 20% gratuity. Do not waste your time on this place. It wouldn't last a week if it were not by the bridge.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Best pizza . Fresh and ready in 20 mins. Excellent ambiance. Friendly staff.on scenic water Street under Brooklyn bridge. Have a glass of wine then go to barge music.", "author": "Lydia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "I'll start by saying that the pizza is delicious. With Grimaldi's and Juliana's around the corner, boasting unnecessarily huge lines, this is a hidden gem down right down the block with comparable pizza. The pizza is thin, crispy, and very tasty. What's not to like?\n\nNow the reason for the 3 stars is twofold. Firstly, the pizza is overpriced. Secondly, and most importantly, the service was lacking. The staff was extremely rude and disinterested and this completely took away from the experience. \n\nI'd suggest coming here to grab a slice and taking it to go.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "Amazing view, very friendly service. Just walking in the delicious smell of good pizza sauce- overall great. Very delicious sangria as well. Just know you must pay with cash but there is an ATM inside.", "author": "J H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "The absolute WORST restaurant known in the nyc community!!!! Worst experience ever! I can't express enough how disturbing my experience was ,first the food was overly priced for the quality ! It was not Italian in any shape or form ! There is no way that there is an Italian chef in that kitchen ! Disgrace ! \nI advice everyone to stay away from this place . Second it was freezing we couldn't even drink or finish our food . I asked three different servers to lower the ac a bit . For gods sake the chandelier-was swaying to and fro that's how strong the air was blowing . No one cared! I finally asked for our food to be wrapped up and we left . I truly wanted to leave the food there but I felt bad that we had to actually pay money for this awful experience ! \nI regret going here in every way ! But it's a lesson learned the only reason we stopped here is because Carmine's had a two hour wait ! I learners next time I'll wait! Carmines is a great pizza place a worth every penny ! I STRESS AGAIN WORST PLACE EVER!!!!!", "author": "Slavica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Great place !!!we will never ever go to any other place  great view great view  and even better service  love love love it! Pizza best in Brooklyn", "author": "Christina D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "We ordered the white pizza and it was mediocre, nothing that I would go out of my way to try again .. The service however was terrible . The blonde woman was terribly rude and almost dismissive. Also, the fact that they automatically include a 20% gratitude fee on the bill is a shame because our server did not deserve it . I would not come back to this spot and I would not recommend others to come either .", "author": "Beatris B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "It was very plain and not that exciting we had some drinks and waited for a ride nothing to brag about", "author": "Dolly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "Sangria was terrible, surely bought pre-mixed at Costco or Walmart... and then sold at a whopping $40 a pitcher.\nPizza was poor. Bland, uninteresting, bacon topping was burned.\nThis places survives simply because of the location and thirsty tourists on hot days (which was my case).\nThe rude-ish lady at the front door supposedly is there to greet and seat the patrons, but I actually think her job is to make sure no one leaves without paying, which is what I felt like doing.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Forget the bad reviews. This place was phenomenal. My cousins and I have had pizza for every lunch of our week long vacation, and this beats all of the famous spots around the city. I had no regrets burning the roof of my mouth to eat this pizza hot out of the oven, and would come back every time I was back in NY. We had a half of \"The Pizza\" and half of \"The White\" and it was absolutely phenomenal. Cheese to sauce to bread ratio was absolutely phenomenal. Highly recommend.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-24", "description": "A superb location and a beautiful interior. Spacious, clean and cheerful. Good place to take a date. Decor? Charming. However, the pizza ...is ~not at all~ exciting. Its almost hilarious how lackluster the taste is. It was so underwhelming that--considering the posh surroundings--I wanted to bust out laughing. \n\nEverything was a write-off. Cheese, crust, toppings, sauce. All bland. All unmemorable. No better than you'd find at the dinkiest little corner pizza stand in say, Hoboken. Or even, Iowa. In fact, I'm not sure I haven't had better pizza at a 7-11. Oddly enough, it also seems to be staffed by Mexicans. \n\nIts bewildering, with Julianna's and Grimaldi's just steps away--how can this place not step up its game and compete? This whole block of Old Fulton Ave is all about alluring, trendy, 'glam' pizza. That is the 'program' on this block. Here under the Brooklyn Bridge, its all about dumb tourists and lines of schmucks stretching around the sidewalk and friggin' velvet ropes and \"maitre de\" service. \n\nIgnazio's wants to be a part of this, so how hard is it to make the utterly simplest dish in New York, by which I mean classic thin crust New York pizza? Apparently its too difficult for Ignazio's. \n\nNow for the kicker: EXPENSIVE. Embarrassing prices. Exorbitant. I would be ashamed to tell you how much I paid for this pizza. I'd be ashamed to tell anyone. That is the only thing \"classic New York\" about this place--the boosted charge. Hype FAIL. \n\nAcross the street is Luke's Lobster. 'Nuf said.", "author": "Jorge G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}