{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "This place doesn't have the greatest reviews and I am not a fan of throwing 5 stars but I just really liked this place. My friend and I walked by twice thinking about it which restaurant to go to. This was walked by just because it was super empty which is not a good sign.\n\nWe took the risk and went in. The servers standing around were really nice, mostly trendy looking females. We choose to sit near the window facing Brooklyn Ice Cream Factory. Great people watching and sunshine factor. \n\nWe ordered and got the prosciutto and basil pizza pretty quickly. It was really good and had a nice crisp to it. Some places try to hard with that brick oven taste and blacken it while regular pizza spots give you floppy slices. This was right in the middle. There was also a nice amount of topping to get a bit in each bite.\n\nWe got the large pie and it was a good size for 2 people. A nice surprise was the root beer. I forgot the brand but it was the extra dry type. The extra dry of it was a nice palate cleanser between slices. \n\nDo I think the pizza alone is 5 stars? No. I just really liked the atmosphere, food, drink and super sunny seating all together.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "First time diner.  Clean.  Took a while to be served but afterwards the service was very good.  6 of us so we ordered  2 salads,   Meatball appetizer, very good.  Order regular pie with anchovy.   Delicious, but very little anchovies.  Clam pie, covered with clams, but the crust was too hard.  Square pizza with pepperoni, soft doughy and very good.   Will be back again.", "author": "John P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-12", "description": "Not as good as it used to be ! \nVery slow service ( 60 min wait) , half of the items on a menu not available , and those that are available are awful. Pizza is still OK , but you can die waiting for it . \nNot coming back", "author": "Ella c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Pizza was unreal. All fresh ingredients, I mean truly a phenomenal pie; even with no cheese (vegan stylo).\nDecor is really nice. People were great. And again the pizza is incredible.\nSlight attention to detail from owner would make this a 5/5. Bathroom had a broken light fixture, and was virtually pitch black; and he was just sitting around not doing much.\nBut seriously, great pizza.", "author": "Uncle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "The location is worth four stars alone, and the pizza probably another four stars. So this place should have about 8 stars right now. \nYes, a few staff members are kind of slowpoke frumpypusses, and I've had to wait for checks and refills and silverware and napkins for extended periods of time on a few occasions, but the bacon topped pizza under the Brooklyn Bridge is as good as it gets. \nThey need to expand the beer menu though, they have had the same two choices for way too long.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-19", "description": "Pizza is but the service was terrible. They told us they ran out of pizza dough and are only serving pasta. We got up to leave and they changed their mind! Nice going IGNAZIO'S! I'll just stick to Patsy's or grimaldis.", "author": "Nala L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "Service poor; pizza very poor; tiny napkins. But beer was very cold so get a star for that!", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "Where to begin with this review.. \n\nIgnazio's, yep, the worst pizza spot in DUMBO. If you live in NY/Brooklyn you will want to die when you see how they rip people off with their ridiculous pricing. \n\nWe ordered a salad with apples, cheese, dates, etc. They should have just given us a cutting board to actually cut up the array of the mess they put on the plate, an old plastic plate at that. There was so much dressing and vinegar I could have poured it back into the bottle. \n\nOh and don't worry, when I asked if we could have a new salad, our waitress was nowhere to be found- until my boyfriend sees her sitting at the table behind us, studying to become a yoga instructor! I couldn't believe it and yet, I don't think she could either when she asked me \"What is your complaint with the salad?\" Complaint? I'm sorry you're over in the corner, practicing downward facing dog and I'm trying to enjoy this terrible mess of a salad. \n\nAfter that mind blowing conversation, we left and even graciously left a tip, which she did not deserve. \n\nIf you want an amazing pizza spot in DUMBO- hands down, go to Juliana's. The best! \n\nNamaste!", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Service is terrible. Long wait time. Charge 20% tip for party of 4 and more. One star is for the white clam pizza, which is excellent! Keep the chef and replace the rest.", "author": "Cindy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "I came to Ignazio's on Wednesday with my son. He loves pizza. When we entered I placed my order. The restaurant does not accept debit cards, which is ridiculous in 2016. Nevertheless, I used their conveniently placed ATM which was practically in the bathroom area of the restaurant.   At no time were we asked if we wanted to dine in. The woman who took out order had us standing for about 10 minutes. When the pizza was finally ready it was being packed up into a box!!! At that time I had to inform her that we would be staying inside to eat. The woman behind the counter begrudgingly seated us at her table of choice, placed the pizza box on top of the pizza tray and walked away. I was dumbfounded with the awful service. We had to take our drinks to our tables ourselves. \n\nDuring this time I surveyed our table. The pizza tray was dusty, the plates were dusty. I was pretty annoyed. I looked around to see a very inactive wait staff idly sitting around. One waiter was serving a middle aged white couple who happened to be peering at my son and I often, making me uncomfortable. This couple was seated, served, and waited on while we were left to fend for ourselves. If we hadn't traveled far And my son wasn't so hungry, I would have left the establishment. The service was HORRIBLE!!!! Needless to say I will never eat here again. Very disappointing. The one star I gave was for the location. Otherwise I would have given 0 stars.", "author": "Wendy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "great location and view!!!  I didnt have wait in line like the other pizza shop close by. Their pizza is tasty with basil but!!!! not enough Cheese on The Pizza(item1) I ordered with halfmeatball and half smokechicken. I recommend their meatball :)  good service, clean, spacious.", "author": "Fooooo U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Yes cash only is annoying... However despite that the timing was perfect so we sat right away and therefore we also got great service and awesome pizza!! Obviously they used fresh ingredients creating a simple but delightful flavor!! Cons also include no refill on my coffee but plenty of water lol and I didn't like that the hostess was wearing a crop top... Not while I eat PLEASE!!", "author": "Mara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Love, love, loveee!! Great ambiance, even greater pizza. A little pricey but definitely worth it. The service is a little slow, but the pizza IS handmade. Great crust, fresh ingredients and toppings. Great ratio of cheese to sauce! Definitely one of my favorite pizza spots in NYC if not my all time favorite!! Definitely check it out if you're in the area.", "author": "Jasmine P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "This place has really gone downhill. I'll never come back.\n\n#1 The waiting time for a seat was unbearably long. We had a large group of about 9 but those of 6 were let in way too many times before us. After we waited 2 hours to be seated, the waitress had a table to give to us but was told by her manager to give it to the group of 6. We were very upset! The hostess avoided us like the plague! The manager had no idea what he was doing with this many people.\n\n#2 The manager kept asking us \"where we were from\" before we even got in the door. He insisted that we weren't from Brooklyn and asked us \"where were we really from?\" How dare you Mr. Manager. I've lived here all my life and I've never been ridiculed like that before. And next time you talk under your breathe to your waitress, make sure we can't hear it. Go do your snickering about your customers in private. And when you snicker, make sure we can't see you point at us.\n\n#3 When seated, we were told by the waitress that half of the menu was out of stock. This is all due to bad management on a really big weekend. If you're going to make us wait 2 hours, the least you could do is tell us what is out of stock. It's a Saturday night. How can you be out of stock of calzones and sicilian pies at a PIZZA restaurant?! I don't understand your difference between \"The Pizza\" and \"Sicilian\". Is the dough not the same?! \n\n#4 A forced tip of 20% on parties with 4 or more is a terrible idea. I don't mind graciously tipping but for the lack of service, I'd rather not. \n\nI've eaten here before but now, I will never come back. You've lost 9 gracious customers because of your subtle racism!", "author": "Adil K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "Good pizza place in Brooklyn Heights and this is with Grimaldi's just down the block. Better service, better pizza and just a better place than Grimaldi's. Do not get single slices as they are expensive at $3.00 a slice or $4.00 a slice, the lady that took our order at the bar didn't seem to know and charged us the latter.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "Pretty standard fare pizza joint and nothing too tasty here. I only came here because I was in the area and hungry and it was one of the only places that didn't have a 50+ people line out the door. Bit overpriced if you are looking to buy by the slice and they only take cash. It's strategically placed in a tourist spot so lines do form during prime dining hours but there are much better brooklyn style pizza places if you wander away from this area.", "author": "Annie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Order \"The Pizza\", large. The size is right and so is the price. The location and views are breathtaking. Right under the Brooklyn Bridge and within an eye shot of the Manhattan Bridge. Fresh out of the oven thin crust pizza.  It is hidden behind a burger joint. It is quite the pleasant surprise. Moby is now playing on the sound system.  It is quite the pleasant surprise just when you turn the corner. It feels like being at home with an amazing. Alyssa, is a sweet soul that offered the best house wine, Ilice, which is a nice pairing with \"The Pizza\" and the size of the wine glasses.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-07", "description": "I went to eat here in the afternoon for 4th of July first lets me start as to why 4 stars where taken off. \n\nThe host was nice great welcoming took us to our seats and everything looked good she gave us the menus. Almost 25min later when we were about to walk out the server comes over. In the entire time that we were waiting not even water was brought over to is. And honestly the place wasn't that busy no lines outside for people waiting like the other pizza places on the corner. We should have taken that as out clue, in the time we waited we read other people review about the service. So now that our server is there and taking our order we decided to stay and give it a try. The give the tiny glass soda which I didn't like very much because the one I got was a little flag not sure how when I've had them in the past. While enjoying our pizza I see the guy cleaning the table next to us, he checks the napkin put it back and just added new utensils I almost drop the food in my mouth. That was just nasty whether it's dirty or not you should not be reusing napkins and I know what I saw along with my friend. We decided it was time to go, The pizza was just okay thin nothing to rave about. So we signal out server she was at another table pouring beer from a bottle into a glass and we asked for the check. We wanted the last 2 slices to go I don't like to waste food so I decided to get the slice to go. Because I was sure we would see someone that was begging for food we could offer because we passed 2 before we decided to get food \n\nThen the table next to us was telling their server how his calculation was wrong when she added the numbers there was just too much errors going on in this place at once. \n\nWhat made us rate this place so bad was when asked for the check. And this was just nasty our server leaves the check goes over to the side where they pick food up and drop off ect. I'm just staring over my friends shoulder when I see her grab the slice of pizza with her hand I tapped my friend. Who looks to see her touching the second slice and doing the same. She brought it over I was speechless, we left the cash ontop of the to go pizza and walked out \n\nServers should not be touching peoples food with their hands, they should be wearing gloves.", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-24", "description": "This place is not good at all. Its the worst pizza place in dumbo. Ridiciolous pricing for the kind of pizza they serve. Waited over an hour on a friday night outside, then took forever to get our pizza. They said that it was because we ordered a starter..................\n\nWould not recommend this place at all.", "author": "Al L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "Good, but expensive. More than 4 at a table, 20% tip was added. 70 bucks for 2 large 1 topping pizza. If work wasnt paying for, I might have gone somewhere else.", "author": "Kevin T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}