{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "So the only reason we really went here was because Grimaldi's was a long wait and we were starving and wanted some pizza. If that is you, then this will do. Be forewarned though, it is cash only and they add a 20% gratuity no matter what your experience and how little you order. \n\nWe found this place just around the corner from Grimaldi's-a prime location if you ask me. They are near the most popular pizza place in NYC and under the Brooklyn Bridge. I guess that's why they charge so much. The pizzas are large so if you're solo and not a huge eater don't even bother going here. If you are a big group, at least you are getting your money's worth?\n\nWhen we came up to the door it looked nice enough. Definitely a step above Olive Garden in decor. We saw about only half the table's were full. So not a ghost town, but not too popular either. My instant reaction was that it was because it was the next pizza place near Grimaldi's.\n\nWhen we walked in we were greeted by a guy who looked more like a Portland  organic foods store or head shop owner. No offense to Portland folk, which I love. This guy just looked misplaced in this  seemingly nice Italian restaurant in tourist area of New York City.  He must have seen my look of judgement because when we asked him how long of a wait he said 15 minutes, despite tables being open. Then he asked if we could wait outside even though there was a large door area and nobody else around waiting. My husband had been waiting in line this whole time at Grimaldi's, just in case. So my friends went to grab him, as I waited out in the chilly NYC night air. As I waited, I saw two other parties, one our size go in and be seated, the other  at the bar. I also saw the B rating which was a big turn off, but I guess in big cities it's hard to get an A? Almost exactly 15 minutes later, trying to figure out why we had to wait outside, and lots of back and forth of should we stay or should we go, we got a table. \n\nWe were so hungry we agreed what to order right away from their sparse pizza menu. We were glad we got a medium because it was plenty for four people. The pizza was okay. It said Sicilian style, but was more like a cheap Chicago deep dish but probably closer to Pizza Hut's deep dish. The flavoring was decent though. The house wine by glass was the worst wine I had ever tasted. If I was not in tourist trap central, I would have asked them to take it back, being $9 for a glass. I can get a full good bottle at Trader Joe's or any other grocery store for that, but it was NYC so this seemed cheap and it was. \n\nOverall the service was decent. The water tasted funny, but was refilled regularly and the food service was fast, much to our surprise. The only other down side was when the bill came-20% gratuity included! We were so annoyed but also not surprised, and in that moment I knew I had to write this review. \n\nSo if you are in a bind, and Grimaldi's is packed as it often is at dinner hours, feel free to try this place with cash and medium-low expectations on hand. A better choice if you're up for a walk and real New York style pizza would be Fascati Pizzeria, in Brooklyn Heights. It's a bout a 15 min walk if you don't get lost. Great garlic knots and pretty cheap comparatively! \n\nIf you have time and want a real treat go to Eataly near Madison Sq Park or Frank off 2nd Ave near Astor place with good Italian (long wait there too though). Eataly is like an Italian heaven! Hope this review helps.", "author": "Kelly J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "I seriously cannot figure out what these other reviewers are talking about!\n\nI went to Ignazio's with high expectations because a friend of mine raved about eating there a few weeks before... and they exceeded them!!\n\nThe design of the restaurant is simple, but the big windows and beautiful views of Manhattan in the distance and the Brooklyn Bridge proved to be the stars of the show visually anyway!\n\nThe stuffed artichoke hearts might have been one of the best things i've ever tasted (and I am an Italian food aficionado!). Somehow every bite was better than the last, I could eat these all day, every day! The salad was a simple house salad, just how I like it with fresh, crispy lettuce and a light refreshing dressing. My brother, who is ridiculously picky when it comes to meatballs, could not get enough of their meatballs and sauce! At first he refused to try them, but once he did, he finished the whole plate! Next, we got the sausage ring with potatoes (which was amazing-- and the leftovers made for a great sandwich!) and a small square pizza. \n\nThe pizza was delicious. All of the reviews that say its greasy do not know what they're talking about-- typical pizzeria pizza is greasy, this is anything but. The sauce is delicious, very bold and flavorful, and the crust was crisp and delicious. Was it diffcult to get it to stand stiff when  you picked it up? Yes, it was but that's only because it's loaded with delicious, fresh sauce and, of course, mozzerella! \n\nBottom line, I already have plans to take my boyfriend back here with a bunch of friends this weekend! It's a great location with delicious food and the same prices you can expect from almost any restaurant in NY. Before you listen to any of the nonsense reviews below from people bitter they didn't get to Grimaldi's, go to this restaurant and see for yourself and when you leave, you'll be saying 'Grimaldi who?'", "author": "Tiffany P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "I have to admit I came here because the line for  Grimaldi's was extremely long!! So out of hunger and desperation we saw the sign on the corner and stumbled across Ignazio's. There was a line in front of Ignazios but not nearly half as long as the line for Grimaldi's. The restaurant is cash only and we were seated after 20 minutes of waiting in line. The pizza was not bad but nothing special either. We also ordered the meatball appetizer, which was three meatballs spattered in spaghetti sauce...way over priced. I  would say this is a decent alternative to Grimaldi's for those who are extremely impatient and hungry. The location is excellent for a night out =)", "author": "Christina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-03", "description": "We showed up at Ignazio's at 3pm on a very rainy Friday, and found the restaurant nearly empty as I would expect.  As far as the previous reviewers' complaints about the noise are concerned, that was no problem for us, because all we had to compete with was the somewhat-louder-than-usual AC.  \nAgain, this is still the soft-opening period.\nThe wait staff were very friendly and attentive, and we simply ordered a plain 14\" pie and two sodas.  We ordered the plain pie by design - I feel that's a must in order to judge the main ingredients properly.\n\nThe pizza came out in a reasonable amount of time, and overall we agreed that is was very good.  The crust was very crisp , if not a fraction too thick, the mozzarella was sliced (not shredded - a plus) beautifully, and the sauce was excellent.  So like I said - a very good pie.  Not the best pie, and not better than Grimaldi's right around the corner.  On the other hand, you don't have to wait in a ridiculously long line and be herded in like cattle. \n\nWe paid just under $20 for the 14\" plain pie and 2 (small) sodas.  Very fair, I believe.\n\nAnd for what it's worth - here's how I rank the best pizzas in NYC (just to get a sense of where I'm coming from)\n\n1) John's of Bleeker\n2) Lombardi's\n3) Grimaldi's\n4) Di Fara's", "author": "Matt S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "Great alternative to grimaldi's. Very attentive friendly service. Fantastic views. No lines!", "author": "w b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-03", "description": "I feel bad for all of the people waiting in line at Grimaldi's. They have poor service and are riding on a reputation for having been a hang out for Frank Sinatra. Only thing is... Frank Sinatra stopped hanging out there 50years ago. The pizza is good at Grimaldi's but better at Ignazio's.  Ask about the oven at Ignazio's and you will see what I mean. It came from Italy with an Italian that stayed and lived with the oven for 6 months once it was shipped. The ingredients are fresh and the view is unbelievable. It is typically not crowded so you can enjoy the food. You also get treated with respect and don't feel like cattle being herded to your food. No body who lives in Brooklyn eats at Grimaldi's. Only tourists eat there. Try Ignazio's for a real slice of Italian Pizza.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "Just had to chime in because I can't believe all the obnoxious reviews on here.\n\nWe found this place like most people -- after ditching Grimaldi's line. But the pizza was fantastic! So pleasantly surprised. The view is beautiful (looking out under Brooklyn Bridge), our waitress was awesome. The manager (owner?) seemed a bit dodgy, but we didn't go to hang out with him, so who cares? The pizza was pricey, but this is a more upscale pizza restaurant -- they even played live classical music. But what we liked best was the cheese on this freakin' pizza. I just finished some pizza in Manhattan and I'm salivating thinking about Ignazio's cheese.\n\nListen, if you had your heart set on Grimaldis, you're gonna complain about the 2nd choice place around the corner. But don't listen to those whiners. This is good pizza, nice view, pleasant music. Sometimes you gotta open your mind to the unexpected changes of circumstance. If you do, you'll like this place.", "author": "Just M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "I'm sorry, but it is ridiculous that this place gets only 2.5 stars.   What are you people talking about?  I am as big of a pizza snob as there is, and have been to Grimaldi's, DiFara, etc., and this place is right up there with all of those places.  I'm convinced that people are giving it subpar reviews only because it gets most of its business from people who don't want to wait in the line at Grimaldi's, and, thus, people think less of it for that reason.  That's all I can imagine, because anyone who really understands pizza will realize that Ignazio's makes a wonderful pie.", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "So I know many people here have given it a bad review but the truth is that the pizza is awesome. I agree it is a bit expensive and they sort of force you to tip 20% by including it on the bill. If you don't want to pay a minimum of $20 for a pie, then don't go to Ignazio's. If you want great pizza then Ignazio's is the place. Best pizza I've ever had. As far as the service goes, when its crowded, it can be a bit slow but not to the point where its upsetting. Overall, I think that although a little pricey, the pizza is worth it.", "author": "Pedro G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "I grew up with Luna's in CT which the owner of Ignazio's opened (and I think later sold). \n\nIgnazio's is what Luna's was when it started out, not overly cheesy, thin crust and tasty!", "author": "Liz S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-08", "description": "First of all, the pizza here is actually pretty good. \n\nMy friend and I had planned to takeout at Grimaldi's, but didn't realize that there is no takeout line there. So we followed a chalkboard sign around the corner to Ignazio's, which leads me to my first all-caps question:\n\nWHY IS THIS MORE EXPENSIVE THAN GRIMALDI'S??\nIt makes no sense that a shop decidedly less good than the one that hundreds of people are waiting for, charges $4 a topping on a $20 pie. That's $8 more per one-topping pie. $26 after tax=ridiculous. Now....\n\nWHY ARE YOUR SERVERS RUDE?\nGetting takeout here means waiting in line at the bar, while a very friendly and courteous cashier takes your order. This also means being asked to move closer to the bar by one server, and further from it by another. When I came back 25 minutes later to pick it up the waitresses seemed horribly bothered by my request for hot peppers and napkins. In typical New York fashion, they must have realized they weren't being paid for this service. I felt like I was dealing with angry post office workers.\n\nWhatever though, the pizza is really not so bad. It's not significantly worse than Grimaldi's I say. You could do much worse.", "author": "G L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Came here w fiance and future in-laws, IMHO this place is a gem hidden in plain site. I laughed as I walked by the pathetic tourists waiting in line @ Grimaldis. Don't get me wrong, Grimaldis is good, its not wait in line good. So we walk right into Ignazios and immediately sit, this is our 1st visit here, it only has 1 Yelp review which was eh, what do we do? We've lived off Yelp for the last 2 yrs, ok breathe and think logically. We decided on the sicilian pie w 1/2 anchovies \u0026 the meatball appetizer. NOW, l am Italian American born and raised in Bklyn, in my world u do not order meatballs at a restaurant, you just don't. But there weren't many other apps on the menu. On the menu was an anchovies app which we weren't into, and artichoke app which we tried ordering but they were out of and the meatballs.... well you know what? They were good, really good, comparable to my Ma's and the sauce too, it was light and fresh tasting, 3 meatballs and 3 pieces of toasted Italian bread, the 4 of us shared the one app and we all enjoyed it.\nNext the Sicilian pie came out, the crust was slightly charred (which i like) the top was cheesy and bubbly with fresh basil leaves. the half with the anchovies had real deal anchovie fillets, not the little brown ones you get from the can. you were able to taste the freshness and brininess of them (i could see them being overpowering if you're not a big fan) but we enjoyed them.\nAll in all it was a little pricey, but the view of the Brooklyn Bridge was worth paying a little extra for. The service was good and so was the food. We will be popping in again. \nLASTLY..........CASH ONLY!!!! THEY DON'T TAKE CARDS!!!", "author": "Steve D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "I don't get the bad reviews -- this place is great.  If you go at dinner time during the week there is no wait and the pizza is so good!  And it's not some flash in the pan -- these guys are famous in CT.  The pizza is really tasty -- we had 1/2 onion and 1/2 sausage.  It's not coal oven like G's, but if there is a 1/2 hour or more wait at G's, go to Ignazio's.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Incredible pizza, and the appetizers and salads are amazing too. My favorite is the Sicilian pizza, which is thick-crusted but still crispy and not too heavy- the tomato is perfect . Their meatballs are my favorite appetizer- I believe the recipe is from the owner's grandmother, and they are always cooked just right. The vibe is comfortable and friendly, and the decor is cool", "author": "Angela M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-03", "description": "I went to Ignazio's for dinner around 6:15 on Thursday, the third night, I believe, of their soft opening.  If I hadn't been in such fantastic spirits anyway this might have been a more scathing review, but this place's numerous shortcomings were not enough to sour my mood.\n \nI cannot comment on the music or noise since there was no live music when my boyfriend and I dropped in for dinner, and the place was only about 3/4 full.  I can comment on the decor, however, which is borderline appalling.  The red motel carpeting is just bad, the color scheme indiscernible, the layout a bit awkward.  Bathrooms are incredibly spacious and clean, so that's a plus.  But on a busy night, a lone women's restroom will probably pose a problem.\n \nThe place was really warm and humid I felt because the pizza oven is in the same space as the dining room.  It's a nice visual, but the place needs better ventilation.  That being said, I still think the best seats in the house might be at the bar, which, though near the pizza oven, is spacious and well lit and has a nice view out the large windows facing the bridge.\n \nThe beer selection is good and not overpriced.  I noticed the bizarre ceramic chalices others commented on, as well as the paintings of Jesus and Mary over the servers' station.  Some kind of weird Christian theme going on here.  I assume the name of the place refers at least in part to the Saint?\n \nWe had the meatballs as an appetizer.  Four very good meatballs with bread to sop up the sauce and cheese.  A little pricey at $9.  We waited 40 minutes or so after ordering for our pizza, but frankly I expected delays and at our comfortable table by the windows I was content to nurse my beer and have a leisurely conversation.  Our pizza-- the Niman Ranch bacon, avocado, and plum tomato special-- had a tasty crisp yet substantial crust and a nice balance of sauce to cheese, with very little grease.  The bacon was delicious, the avocado nearly flavorless.  $18.  Strangely, they do not offer the bacon as a topping alone or I'd order that the next time I stop by.  But overall I enjoyed the pizza.  A medium was a good size for two people, and I liked the way it combined the good features of NY style thin crust pizza and the real Neapolitan stuff.\n \nService was attentive and friendly despite the obvious opening-week confusion.  I'd say this place will get a return visit from me at some point, though maybe only for take out.  It's definitely not a destination restaurant, but certainly not a bad place to get a meal if you're in the immediate area.  The place could be vastly improved by slightly lower prices and better decor, but I'm not holding my breath for either.  I think this is really a 2.5 star review, but I'll give a generous 3.", "author": "Romy V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-29", "description": "I went to Ignazio's with my husband after hearing reviews about a glorius white pizza with clams. To my surprise I was told they never had that pizza at Ignazios and then the maitre'd told me it was a special pie served only durig the \"soft opening\". \n\nI ordered the house pie which was only just bearable. Soggy crust swimming with sauce. Service was worse than awful, from three different servers... there were only a handful of people seated for dinner on a Sunday and they couldn't handle it. We sat for about 20 minutes trying to place an order, any order... no one even brought a glass of water. No napkins, no beverages when the salad finally arrived. Getting the server's attention was almost impossible. The special salad recommended by the server was expensive, tiny and overdressed so badly it was ruined... what a disappointment.\n\nI dropped my one and only paper napkin on the floor and when I went to pick it up... Eeeew, the carpeted floor was covered in chunks of pizza crust, a few pepperoni slices and it smelled sour.\n\nWe waited almost 25 minutes for the check after asking 3 different people for it. I left cash on the table and we ran out the door.\n\nI will not go back. I will go around the corner and stand on the ridiculous line at Grimaldi's with the tour bus people in order to get some really good pizza instead.", "author": "D G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-25", "description": "I have tried to go to Grimaldi's several times, but I just can't bring myself to wait on such a line for pizza. I don't feel bad prefacing this review with a referrence to the business around the corner, because Ignazio's is fully aware that their business thrives from the run off of Grimaldi's and they take full advantage of the fact that by the time people arrive they're starving and had their heart set on pizza.\n\nThe pizza is passable here. The view is beautiful. The problem is the service.\n\nI have been here twice. Once on a date and the last time as one of a group of five people. I experienced bad service both times, but my last visit just blew my mind. I won't be returning.\n\nWhen she came to take our order, we had a conversation with our waitress about the size difference between the medium and large pies. She suggested we order one medium and one large for a party our size, so that's what we did. 45 minutes later, she arrived with two medium pizzas, which wasn't enough for us. She then avoided our table. We kept trying to flag her but she'd avert her eyes. Finally, she went to the table in front of us and my friend sitting closest to her said \"Excuse me.\" In response, she grabbed the busboy who was standing nearby pulled him behind her toward our table without turning around and said in a hushed voice \"bus the table.\" We gave up.\n\nIgnazio's is cash only. The ATM charges an astronomical fee. We tipped her 15%, which, considering the service was very charitable.  We collected our belongings and left.\n\nWe were out the door and walking up the block when we heard someone running toward us yelling \"Excuse me! Excuse me!\" The waitress appeared beside me and one of my friends and said \"I'm SORRY...but was my service NOT worth 20%?\" We were taken aback. I'm a waitress myself and would never dream of doing something like this. Especially if I screwed up the order, avoided my table and then was downright rude. I said \"Well, actually, I'm sorry, no it wasn't. We ordered a medium and large, you brought us two mediums and never came back. We're still hungry.\"  She looked at me like she was going to sock me in the jaw and said \"OH! Well then you have a GREAT DAY!\"", "author": "S V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "You won't go wrong with the white pie w/ caramelized onions and pepperoni. Everything was super fresh, we didn't feel gross afterwards... totally worth the trek down to Water St. Waitress and server were both attentive without being intrusive. Solid spot.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "Good pie, though a bit expensive. Delivery was fast - estimated about an hour and was at our door in 30. Also, we usually have to ask for pizza well done (I like a crunchy crust), fortunately we forgot because it was cooked to perfection. Medium pie was plenty big for two people.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "UMMMM I dont know what is up with the bad reviews. How much better does it get in NY? I mean seriously? I am from Chicago so you can bet I am pretty damn picky when it comes to pizza and after eating pizza at Ignazio's I have decided that I am a NY fan. This is by FAR my favorite place to eat pizza at. The flavors made my taste buds feel like there was a rave party in my mouth it was that good! The crust was perfectly crunchy. I did try Grimaldi's which was good as well and is better than pretty much every place in Chicago but I was sold when I had Ignazio's...seriously..the best pizza I have ever tasted. I can not wait to come back because Ignazio's will be one of the first places I will visit.", "author": "Andrea P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}