{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Ignacio's is a hidden jewel around the corner from the Brooklyn Bridge! The pizza is to die for. And the staff is helpful and fun! The owner comes to the table and makes you feel at home. If you want a taste of Italy come to Ignazio's!!\n\nAnd eat the homemade ice cream! Yum!!", "author": "Alicia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "I brought my parents who were visiting for the weekend to Ignazio's and we couldn't have been more pleased with the food and service. We showed up without reservations on a busy Saturday around lunch time and they were able to seat us quickly. \n\nAs far as the food goes, we ordered the large bacon avocado pizza and it was fantastic! A large pizza consisted of 8 big slices and was more than enough for us. The service was also fantastic as our waitress was very attentive and checked in to see how everything was.\n\nI highly recommend going here if you are in the Dumbo/Brooklyn Bridge area.", "author": "Jake Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "Don't expect to be seated when arriving, there is almost constantly a minimum of 20 min queueing (which is not a bad thing as long as the experience is worth it!!). However, once we got a table we had to wait for another 20 min to place the order and the customer service was miserable. We left even before being served as I can take anything but disrespect.", "author": "William L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-26", "description": "The only way to describe the pizza here is adequate. If you're hungry you'll eat it. If youre looking for amazing NY pizza, look elsewhere, or better yet wait in line at Grimaldi's or Juliana's.", "author": "Mercedes E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-14", "description": "For the location of this place I give it a 5/5. However the pizzas were just 'alright' and it's cash only. Service was extremely poor too. I'd rather go somewhere else or wait in line for Juliana's.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Great Sicilian pizza and Caesar salad. Well worth the subway ride to Brooklyn bridge to enjoy this meal on our weekend in NYC.", "author": "Paula B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "I don't get it.  I don't see the big deal of NY pizza. \n\nBefore my trip to NY, I gave up pizza for the year.  My one exception was going to be my trip here since everyone raves about it.  Well, poop.  I really thought NY pizza would be better.  Is it because I didn't grow up with their 'style' of pie?  I was perplexed.\n\nI was told by a local on the plane ride here to go to Ignazio's.  She was sure I would love it as it was her favorite place for pizza.  Since we knew we were walking the Brooklyn Bridge across it worked out great.  The service here was good with no complaints. The dining room is large and kept very clean.  It is a Cash Only establishment so be prepared.  They do have an ATM but I'm sure it would be an expensive fee to use.\n\nUnfortunately, I was underwhelmed by the pizza.  The fennel sausage used was fantastic but the pizza itself was not to my liking.  I know you're supposed to fold the pizza and eat.  It was really soggy except for the outside crust.  Not at all what I was hoping for. \n\nI guess I'm just not a New Yorker thinking their pizza is the best.  I would head elsewhere.", "author": "Bethany E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "TexMex pizza has the best crust. I expected more from the garlic bread. Location is great.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "I thought the pizza and meatballs are very good. Service is great. The location is ver Con isn't and close to the ferry", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Delicious food, an at-home, comfortable atmosphere, and no waiting in line ~ I am so glad we found Ignazio's! Cash only, but there is an ATM on the premises. We had the Prosciutto Calzone and it was amazing. Brimming with cheese and served on a steamy plate of delicious homemade tomato sauce ~ one calzone is plenty for two! Overlooking the Brooklyn Bridge and the bright lights of Manhattan, Ignazio's is a wonderful place for a Friday night dinner in DUMBO.", "author": "Kathleen J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "We were in NYC for my 30th birthday and my BF purposed while we were in Brooklyn looking over at the NYC skyline. So we had to celebrate with Pizza of course!! He is a pizza lover so he had some \"one bite\"app that we followed all over NYC to find the best pizza. we ate here after he purposed and it was the best pizza we have both ever had!!! We are so sad we live so far away.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Just OK pizza. There are better food options in the area, in my opinion. Cash only I believe.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "As with a surprising number of places in NYC, this joint is cash-only.\n\nFairly outrageous pricing - but given the location, understandable.  You're not coming here for the food - you're coming here because you've been walking around DUMBO and this place (right on the water) offers fantastic views and spectacular lighting depending on when you're here.\n\nI'm a big fan of the White Clam Pizza - and by White Clam Pizza (capitalized), I mean Pepe's White Clam Pizza (New Haven, CT - best pizza in the world).\n\nThis white clam pizza is of the lower-case variety.  Canned clams, desiccated buccal presence.\n\nUnlike many places in NYC, there seemed to be more focus on turning over the room than taking pride in the product / service itself.  Servers and floor managers didn't seem all that interested in creating an experience - just processing bodies.\n\nFrankly, three-stars is kind, considering the fare itself, but there is an extra star earned just because of the location itself.  \n\nSo, there you have it.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "I ordered the \"Pizza Filia Rex.\"\n\nThe ingredients are very fresh and creative. It tastes like a pizza with some history to it and I really appreciate that. The pizza also has a fantastic scent and overall good taste.\n\nIt doesn't align with my pizza preferences hence only rating it a 3/5. I also felt it was a bit too black on the bottom but this is also a matter of preference. Overall, I think Ignazios is a good place and I would give 3.5 stars if I could.", "author": "Justin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-03", "description": "If you're going to do pizza in DUMBO, you're going to have to really stand out. Unfortunately, Ignazio's stood out for all the wrong reasons. Pretty empty during lunch rush, and nowhere as good as the other two big names around the corner. Somehow, their tomato sauce is incredibly watery. Crust was solid though. Not too thick, but thin enough to still be crispy (just the right amount of burnt).\n\nYou can order from their pies, or make your own based on their toppings. We did a standard cheese pie, a pepperoni, and constructed our own fennel sausage and peppers. The pepperoni was the best of the three, which was a bit disappointing. They top all their pizzas with fresh basil though, which I always appreciate\n\nNot sure if I'll come back, especially since it's cash only!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "My Husband and I ate here on Saturday afternoon, we sat at the bar and it was wonderful. This is a Family owned and operated business and it was really nice to see how well so many Family members worked so well together. Everyone was super friendly and the pizza was to die for. We have since come back home to Connecticut and I can't stop thinking about how delicious the pizza was. If you're in the area Ignazio's is a MUST!", "author": "Sandy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Grabbed a togo slice of pizza from here. They were super fast and cheap. I'm not sure why the ratings are so low, pizza wasn't bad and they were quick and convenient", "author": "Angela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-10", "description": "Went in here yesterday as i have heard good things about Ignazio's.  Juliana's and Grimaldi's were packed.  While those places are good, they are a bit hyped.  Sat at the bar and ordered some single, cheese slices.  \n\nThe slices were excellent.  The sauce was tasty.  The cheese was good.  The crust had just the right amount of crunch.  The cheese was running off a bit but that could be to the heat and with the quality of ingredients - it really didn't matter.\n\nI have been around Manhattan and right now in my opinion the best slice is from, Sauce but Ignazio's cheese slice has dethroned the king.\n\nAs for the rating. I give Ignazio's cheese slice an 8.8.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "I would like to give no star but I have no choice then least 1 star! I have been to this pizza place twice before, had a wrap, Brooklyn lager, one whole big clam pizza with my friend! I loved the food. Today I wanted to try something new, may be another wrap, salad and a drink during my work break. As soon as I walked in asked for table for one. The host (elderly looking Asian woman) looked around the restaurant ( few 2 tabs tables were empty) and shoot me super surprising question -\"are you having slice or pie? We don't sell slices here!\" I said I know- but she persisted to try somewhere! Shamelessly I even told her I'm there for wrap! But she wouldn't let me in! I walked out saying 'you are very rude'! She said yes thank you!!!!\nHow the heck you add 20% tips to all your checks on the first place? I understand it's a tourist place but how do you deny serving one person???? I wasn't there to eat for free! Shout out to this freaking bad service and yes I'm going to let as many people I know about this senseless act!Completely bullshit and unprofessional!\nGood luck!", "author": "Smita C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "Talk about bad customer service....Juliana's and Grimaldi's were both out of the picture for my mother and I, since my 1 year old was in tow and waiting in line is NOT his style. My mother is visiting from London, and really wanted pizza, so we gave this one a try, since Brooklyn Bridge Park is one of her favorite spots. We arrived about 12:20 on a Thursday, and the hostess told us that we would have to be out by 1:00pm to accommodate a reservation they had. Excellent! My 1 year old would also prefer that. So she seated us. We ordered a medium margherita promptly, and waited for our food....and waited...and waited, while others around us who were seated after us were served. After 30 minutes I asked the hostess/waitress what was going on, since it was now 12:50pm, and she told us we had to be out by 1pm. Her reply? \"I warned you that you'd have to be out by 1pm. I'm not responsible if the kitchen is slow. I'll go check\" and literally walked away before I could respond. So I am responding on Yelp. WOW. Indeed you are not responsible if the kitchen is slow, but you ARE responsible for making a note to make sure we get our food quickly so we can get in and out if you decide to seat us. As far as I know, pizza cooks pretty fast in a hot oven. You are also the same person responsible for delivering food to tables around us who were seated after us. And you are responsible for having a terrible attitude. You could have at least offered to make sure it was out and packed for us to take out after we waited so long. I was frankly appalled by the customer service, so I simply left, happy that I had packed a sandwich for my toddler. The pizza did look and smell good, it's unfortunate that I can't review it since we never got any. Thanks for nothing.", "author": "Laura Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}