{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "Two words: tourist trap!   Cash only!  Who wants soggy pizza and inefficient service?   Situated next to the world famous River Cafe, this place offers limited alcohol options (only 1 chardonnay and 1 red wine brand, really?).  DUMBO has plenty of better food choices.", "author": "Rushan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "Great view of the Brooklyn Bridge. With limited venues around the area, this is not a bad spot for a quick bite or just a cup of hot drink to warm the body. Cappuccino was really good. Great service!", "author": "Jack K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "So, my company's HQ is in DUMBO, and all I hear about is Grimaldi's this, Grimaldi's that.  Well, Grimaldi's sucks!  Located just around the corner from Grimaldi's is Ignazio's, which is AMAZING and without the stupid line of tourists.\n\nEverything about the pizza at Ignazio's, minus the price, is fantastic!  The crust - OMG, it's soo good...and sourdoughey...the toppings are so fresh.  My favorite pizza there is the artichoke and basil pizza with a side of their red sauce to dip the crust in when you're done.  Make sure to get a side of their red sauce.\n\nAlso, I had a spinach calzone from there which was sooo ridiculously good.\n\nGo to Ignazio's, and avoid the line at Grimaldi's.  You won't be disappointed.", "author": "Jayson O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Excellent pizza and incredible meatball sandwiches...not 5 stars because service is variable", "author": "Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I don't know why this place hasn't gotten better reviews!\n\nFirst of all the bacon and mushroom sicilian is the best I have ever had, I love it!!! \nSecondly their sausage and pepperoni round pie is great.  If you loved thin pizza this is the place to go...everything is made fresh so it takes a while to get your order but hey waiting for good things is fine with me.\n\nTheir meatballs are also delish'  i would totes recommend. \n\nAlso its DUMBO so its a nice area, nice for a chill date, family dinner or just hanging with friends.", "author": "Claire A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "I truly do not understand all of the bad reviews. I came in by myself, so after waiting in line outside a little while the gentleman  seating folks in line notified me that there was a spot open in the bar. I had two Brooklyn  lagers, and two slices. Reasonable prices. It was a back up plan for Grimaldis....and Julianas who both had lines long as hell. The service was awesome on a Saturday night between 8-9. This place was great. Give it a try.", "author": "Brianna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Very good pizza. The only thing that bothered me is that we didn't know it was cash only and when we asked how long the wait was the hostess didn't tell us cash only. They should advertise that. They do have an ATM machine but who wants to pay a surcharge? I don't. Overall the pizza was great. Customer service ok.", "author": "AF B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "After have spent 1 hour to wait for this pizza we expected something special...and were disappointed - the squared siciliana pizza was mediocre and the crust was so hard that it hurt the top of the mouth badly. Really nothing special. Wait, one thing - it is just under the Brooklyn bridge so 1 more star for the location!", "author": "E. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Pretty good pizza (Sicilian in particular). Nice alternative to Grimaldi's around the corner which has the most absurd line I've ever seen. No wait here which is nice. A-ok in my book.", "author": "F. A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "I can't help but laugh reading some of the other reviews that mention intending to eat at Grimaldi's, sighing at the line, and then coming here, because that is exactly what we did. \n\nI enjoyed the miso salad, but the white pizza was nothing memorable. Mediocre service, cash only, not particularly good prices... \"meh\" indeed.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "Why do people complain about cash only places?  Complain about the food, or the service, complaining about accepting cash only is just not productive.  Some of us, whom are responsible, still do bring cash along with our debit and credit cards; I do not see it as the establishment's fault for something someone should have when they are out and about.  \n\nNow, to the review.  I have been to Ignazio's before and had a regular pie, it was great.  Nice views, nice service.  This time around I had the white pizza.  It was ehhhhh... I would not recommend it.  My GF and I wanted to try something different, but it was not good.  I mean, its not like it was not edible, just that it didn't have the sense of a pizza anymore.  I was disappointed, but since I had my prior experience of the regular pizza in my mind, this place is A-Ok.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-08", "description": "DON\"T EAT HERE!  PLEASE read this review.....\n\nAs much chest-pounding as this owner likes to do about his pizza, it is no better than a frozen pie from the super market.  More importantly, the price for this no-better-than-a-frozen-pie is awfully expensive.\n\nCrust - should have flavor; this crust does not.\nSauce - you should taste the reduction of tomatoes and the herbs and spices used as to flavor the sauce; there is no depth\nCheese - the cheese has to have been frozen at one point, is not creamy or fatty; lifeless\n\nWhat really annoys me (I live nearby) is that the owner continues to call his pizza The Pizza when it is anything but.  It is a disgrace.\n\nWhat is really going on here.......this place is a fly trap........It traps all of the folks who come to the neighborhood looking to eat at Grimaldi's / pizza.  Then, b/c the line is always so long and there is no other place to eat pizza in the neighborhood, Iggy's traps their guest like flies; hungry, desperate, fooled by a sign that says The Pizza, strategically placed near Grimaldi's with arrows pointing toward his front door.\n\nDon't be a silly, hungry, fly - eat elsewhere.  You and your wallet will thank you.\n\nIf you need to eat here b/c you want pizza and can't wait an hour for Grimaldi's, don't let this place cue you in a false-line in front of the restaurant.  The owner always does this when there are plenty of tables open and areas to stand and wait inside; he is trying to create a false sense of demand to passer-byers.\n\nDon't eat here.\n\nNeighborly Disappointed.", "author": "E. W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "I have eaten Ignazio's pizza a bunch of times when I worked in Dumbo and our company would occasionally order pizza for us on a Friday. After enjoying but not paying for the pizza at work my wife and I finally ordered pizza at home.\n\nHOLY CR_P! We ordered a large pie with three toppings and it was THIRY FIVE DOLLARS! (Okay, $34,90). When the delivery person came and told us the total my wife almost fainted. I looked at their website and a large pie is $21 and the toppings for a large are $4 each so we had $21 + $12 for toppings so it was $32 plus tax. That is waaay to expensive for pizza. With the tip it cost us $40.\n\nThe pizza is delicious but at those prices I won't eat there unless someone else  is paying!", "author": "Rich M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-17", "description": "Does grimaldis pay this plus to suck so hard so you'll want to wait on their line?\n\nFood: Meh. We ordered the traditional pie with smoked bacon and caramelized onions. At first I thought we had chosen crap toppings, but when you start with a mediocre base pizza, theres really no way to salvage the meal.\n\nThey served me water in the same aluminum cup I store my toothbrush in.\n\nDecor: Tin walls, Moroccan lamps, saxophone murals, octopus window treatments WHAT?\n\nThe waitress gave us two complimentary lemon cookie cakes, thank you. Entenmanns maybe?\n\nThe roof of my mouth is burnt for no good reason.", "author": "Cydney T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "I've been here only once but I really liked the experience. The pizza was delicious! Piping hot, fresh, and so well seasoned. The location is wonderful - you get a beautiful view of the Brooklyn Bridge from the restaurant. I didn't have a problem with the service, actually. They were patience, kind, friendly, and everything good actually. I would definitely come back to this place. My only caveat is that it's a cash only place. For someone who rarely carries cash, it's a bit of an inconvenience but it is what it is! I'll be better prepared next time!", "author": "Annie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-29", "description": "Went here for a birthday dinner . Tried to get into the famous Grimaldi's but the wait was too long. Came here, seated quickly and the food was awesome. That's the only good thing I can say. Waited a good 15 minutes for Waiter to come take my order just for drinks. Than waited another 15 for him to take my food order. Mind you it was myself and my boyfriend ordering. We ordered apps, and a pizza . The appetizers came out and than we waited over 45 minutes for a pizza. We finally got out pizza after we flagged down the owner, I am assuming she was, who had an attitude, coming over saying \" I am guessing you are waiting for a pizza.\" Uhh, yes we are for almost an hour. It was also in no way packed that it should have taken that long for a pizza. All do a sudden, two minutes later our pizza was there . Mind you, in between all of this, not once did our waiter come over to see if we needed any refills on drinks or anything. It's a shame that the service was horrible here because the food was delicious. I would not recommend this place on just the fact the service was so horrible. It actually ruined the rest of my night, as I planned on going to the Brooklyn Farmacy ice cream parlor after and by the time I got out do Ignazios it was closed.", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "My family came to the City for Christmas fun, and chose to stay in Brooklyn to add something new to the experience.  Great idea!\nThis afternoon, we visited Brooklyn Heights and wandered down Water Street in the late morning.  We found Jane's Carousel and loved the view of Manhattan and the bridges.  \nIt was a cold morning, and we were getting hungry.  Someone recommended Ignazio's for pizza.  We walked over shortly before it opened at 11:30, and they opened the door for us and allowed us in to warm up until they were ready to serve.  Nice!\nWe sat at the window under the Brooklyn Bridge, and there were only 2 other people in the restaurant during our meal.  The location is made for a romantic movie scene.  \nAbout the pizza - Fantastic!!  Thin, crunchy crust; Fresh, sweet sauce, and the right amount of cheese.  It compares very well with the tomato pie in my favorite pizza city, Trenton, NJ. \nSalad also fresh and tasty.  \nBottom line - we would come up from Pennsylvania for another pizza and window table at Ignazio's.", "author": "Gerald S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Best pizza ever! The white pizza is the best ever totally great. So is the regular. The service is very nice and friendly and always wake up on the right side of the bed.the pizza is incredible and so is the salads. Great hang out place for you and your friends . It has no line like Grimaldi's so you can walk in and eat!", "author": "Ethan V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "I was told this place use to have terrible service but i think they must have changed staff or the boss must have cracked the whipped because everyone was friendly and the service was quick. The hostess was pretty and quickly sat us down. The floor was bare because the restaurant had 6\" of water after Sandy so they were fixing it up. So i felt bad for them and I didn't mind supporting their business. We ordered the silician with apple smoked bacon. The pizza arrived at the appropriate time, not too long. The pizza was hot and crispy. The bacon was awesome. The beer we ordered was refreshing. The waitress checked up on us a couple of times and even the manager, at least I think he was the manager, came by to say hello. I had a pretty good time.", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "We came in for pizza last jan. Despite freezing cold outside, the interior was warm, and very welcoming. We were seated just under the Brooklyn bridge which made the experience when more memorable. Pizza was fresh, hot from the oven and one of the best tasting ones. Loved every single bite. Definitely recommend it!", "author": "Ann J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}