{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "I don't understand all the negative reviews. I came here and ordered the margarita pizza and it was really good. Honestly pizza is pizza. As long as your crust isn't too mushy or too hard and as long as your sauce is delicious, you have a good pizza and that is what I had here. Also, I don't think it's worth waiting a ridiculous amount of time to eat at grimaldis around the corner. ALSO, you get an awesome view of the brooklyn bridge as you happily eat your pizza. The only reason I left out a star is because they only accept cash.", "author": "Jane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Delicious pizza. Enough said. Possibly better then Grimaldi's. I never write reviews but had to for this spot.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "Poor service, mediocre at best pizza. Grimaldis too busy so we settled for this. Wouldn't make that mistake again", "author": "Kyle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "If I could give this place 0 stars I would ... After a day at Brooklyn bridge park for the mets music festival, dropped by for what we wanted, pizza. But this was not pizza. \n\n1st, the service was slow .. And The staff was incompetent.  We walked in wanting to just grab slices, because the babies were tired.  But it seemed like they wouldn't let us order slices (despite the huge sign saying, \"slices\"!) and instead they sat us in the dining area so we had no other option but to get a pie. \n\nTook about 15 mins for someone to come take our order for drinks.  So when he came we immediately ordered \"the pizza\" with sausages. \nWaited about 35 mins before we got our pizza.  I'm sorry but pizza should not take this long. It was not even busy!  \nIt was brought to the table and when I pulled the first slice out, the pie was soggy!!  The pizza was wet!  The pizza dish had water on it. How gross!!!  I was eating super soggy pizza.  It was not appetizing when I cut up the pizza into bite size for my daughter. She had three bites and was uninterested in it. \n\nNo one came to ask how our lunch was. I had to get up to ask someone for the check and the girl gave me a nasty look .  Rude. \n\nI told my husband to not leave a tip but of course he didn't listen to me. To me, this restaurant and staff does not deserve to be tipped.  We will not be revisiting at all.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "I came to DUMBO on a date and I wanted to show her some pizza (she'd never had Brooklyn pizza before, obvious dealbreaker) so I brought her here! No lines, decent pizza, great view, what more can you ask for? **Warning: Cash Only!**\n\nWe were seated fairly quickly (that #2TopLife) and we ordered a Margherita Pie to share. I also got a beer, which came in a bottle with a chilled mug.\n\nThe pizza was good, not the best I've had, but a solid pie overall. Definitely better than waiting in line for over-hyped and over-rated pizza around the corner. It'd be pretty hard to find a bad pie in DUMBO anyway.\n\nDefinitely a solid choice if you're in the area and want some food with a view!", "author": "Tom Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "Ordered the famous meatball sandwich And a salad.  Consisted of 3 meatballs Luke warm and sliced mozzarella cheese barely hot.  Sorry the bread was the best part.  Salad was so plain, 2 olives , a wedge of great Romano cheese and some apple slices with greens.  Maybe pizza is the way to go.  Loved the ambience and location.  I think they could do better!", "author": "Donna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "We came to Ignazios after walking the bridge because the other more famous names in that area had lines out the door and around the block. We were hungry and not willing to wait and ignazios didn't have a long wait. The ambiance is rustic Italian and it is all very charming. Server was friendly and our order was taken quickly. We got\nThe white pizza and some stuffed mushrooms. Pizza came piping hot and beautiful!! I liked the touch of fresh parsley on top and the crust was chewy/crispy perfection. I would have preferred a bit less grease on top but when eating something so tasty that's not a huge concern. Stuffed mushrooms were a winner -- hot and flavorful without being overwhelmed with bread crumbs. This place is cash only so that was a bummer but not a big deterrent to us. If you want really good pizza but don't want to wait in line at the more popular spots up the street, ignazios is a solid option.", "author": "Nikita J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Very good, reasonably priced pizza. Nothing more, nothing less. Had a few slices while I was shooting a film in DUMBO this week. Someone on the production crew apologized for the fact that it wasn't Grimaldi's. I've never had the opportunity to sample Grimaldi's-not being a tourist-but from what I've heard I didn't miss anything.", "author": "Gerard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Great pizza and incredible location. Staff friendly and service is excellent. Came to Dumbo area to eat at \"that other\" pizza place but fortunately they were to busy so we ended up here. Glad we did. \n\nRecommend it!", "author": "Darin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-14", "description": "For $15 I had the most distasteful \"house\" salad in my entire life. I wanted to run back and get my money but I'm sure those fools woulda said a big hell no. For $15 I was given a salad worth $3.50. For $15 I could have eaten a whole beautiful meal elsewhere, I will never step foot in their establishment. There's plenty of good ass pizza in Brooklyn that give free house salad I'm sure. I'm straight..", "author": "Jackeina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Try the meatballs with mozzarella. Good flavor and great service. Love the view of the Brooklyn Bridge, ice cream factory, and Manhattan via the East River.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "In Brooklyn for the first time and we had to try some pizza. We were sent to the famous one, i forget the name, but the line was around the corner! No thanks, we 4 girls were hungry NOW. \n\nSo we went to Ignazios which is right under the bridge. So beautiful to eat your food and look up to the Brooklyn Bridge. \nThe pizza was delicious! Freshly made, fresh veggies, melted cheese, wowza! \n\nGreat small business environment and they had sodas in glass bottles. Perfect! Would come back next time in Brooklyn.", "author": "Harlow H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Best NY pizza I have tried to date. There are a few other pizza places walking distance but ignazios is the hidden gem. Classic Italian style pizza with a beautiful view underneath the Brooklyn bridge. There's a waitress who is so sweet I think her name is Alexa she's awesome so ask for her !! The only negative ? It's a far drive from my house in Hoboken - but that definitely won't stop me from coming back !", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "The location is great, literally right under the Brooklyn bridge.  At peak there's about a 15-20minute wait.  Not a big deal considering you could wait a few hours around the corner at Grimaldis.  We ordered two different pizzas, the white pizza with artichokes and spinach and the Sicilian (which they were out of)....how do you run out of pizza?? Anyway, we switched to \"the pizza\" and added prosciutto.  We had one soda, one beer and one glass of wine.  The pizzas were both pretty tasty, however, one was much more crispy than the other.  Not sure why as the both came out at pretty much the same time.  Not much to say, the crust was tasty, the toppings were pretty good.  When the bill came, a few things:  \n\n1).  They are CASH ONLY. it's plastered on the front door, the menu, and the hostess tells you again as she seats you...don't act surprised when the bill comes.  They have an ATM inside.\n\n2). The bill was $83.00 for two med pizzas, one wine, one beer, one soda.  Seems steep.\n\n3). They auto-add 20% gratuity to parties of 4 or more.  First of all, I've never seen a gratuity added for parties of 4.....6 I see all the time, but never 4.  Secondly, 20%?  It's usually 18.  Yeah, in the grand scheme of things it's only 2%....but it's the principle...they're gouging.\n\nAnyway, if you must eat pizza in the area and don't want to wait a few hours for Grimaldis, give it a shot...I wasn't terribly disappointed, just had me raising my eyebrows at some of their practices.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "I really wish the service was better, because the food is actually very good. I love their pizza and calzone, like the location, and appreciate the lack of crazy wait. But most of the staff seems disinterested/neglectful and I've also had very rude experiences on the phone when ordering takeout, as if she is annoyed I ordered (and forgets to say things like \"hello\" or \"bye\" before slamming the phone down).", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Very nice pizza place right under the Brooklyn Bridge.\n\nThe pizza was very good. The wait staff friendly.", "author": "Duana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "This pizza wasn't the best but it was pretty good. The crust was too crunchy on the bottom and it was pretty expensive for what we got.  There wasn't enough cheese on it and we waited and extremely long time considering we were the only people in the entire restaurant.  We also had to ask for our check 3 times before it was brought to us, never got refills on our water and they only take cash.", "author": "Sara E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-06", "description": "WORST pizza and customer service hands down.\n\nWent here this past holiday and waited a hour to get in. Once in ,our waitress (frizzy brown haired girl with permanent scowl), flat out said \"Hey...so what do you want?\". As we gave our order, we actually laughed at how rude she was, but didn't let it ruin our time.\n\nAfter waiting about a half hour for our food (1 pizza by the way...), the wrong order came out. A blond (very nice) waitress brought it out and apologized for the mixup. She offered to let us eat the pizza in the meantime until or next one was made. Now we had already waited over an hour and a half just for this wrong pizza...and the fireworks already started. \n\nOur original waitress(rude one) then came back and said \"No you can't eat two pizzas, you're going to be full. You get one or the other\". She said it abruptly, no sorry, no my mistake for messing up your clear order, just decide what you want. She then told us they'd make the right pizza but \"you know...it takes time to bake a pizza\" she said condescendingly. Yeah I get it, dummy. \n\nMy friend and I were rightfully furious at the way she was rude and called over a manager who was equally as useless and actually said \"oh well you know...it's a holiday\". I explained to get that I work in customer service, and I get it but I didn't appreciate being talked to that way. She shrugged it off, and that made me livid. We wanted to get up and leave but because of the packed crowd we stayed. \n\n\nThe pizza was a wet joke. Definitely not worth the rude staff (on exception of the blond server and bus boy). Never returning to this place, and BEWARE of the frizzy brown haired witch. I know life is rough just saying \"sorry\"...", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Ignazio's is fast becoming our go to spot when we cone to Brooklyn Heights. Their TeX Mex pizza is epic! And a welcome vegetarian option for us. They have a good white as well. Definitely will keep coming back. And bring friends as well! :)", "author": "Chaitanya I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Pizza was delicious. I had the white with spinach and broccoli and lots of ricotta. My husband had the delux with everything. The personal size was more like ablarge to me. Service was good and the place was nice and clean.", "author": "Anita B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}