{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-08", "description": "My husband and I went to Ignazio's last week.  We couldn't bear to fight the line at Grimaldis and were curious about Ignazio's.  We ordered \"The Pizza\" and added meatballs.  I was about to bite into my pizza when I noticed a strange looking \"piece of cheese and/or artichoke heart\", which upon more careful examination turned out to be the finger of a latex glove.  I was skeeved of course..... but just notified the waitress.  She was skeeved as well, but in a professional way.  She disappeared into the kitchen where she spoke with a bearded man who turned out to be the owner.  She came and apologized and asked if we would like a new pizza, I said it was okay, if she could just remove that slice from my presence.  She said the pizza would be \"on the house\", we were grateful and tried to return to the meal.  Then the owner came from the kitchen and apologized and asked if he could do anything for us, and offered to buy us a round of drinks.  Great.  He left us and went to speak with the waitress, at that point things got hairy.  He was definitely reprimanding her for something.  Turns out he went to tell her that drinks were on him, and she said she had told us the pizza was \"on the house\", which upset him greatly.  So, the waitress came over said, apparently we are buying you drinks, NOT the pizza, sorry if I misspoke.  The waitress was wonderful and professional, but the owner is ridiculous for creating that situation and not buying our glove finger pizza AND a round of drinks.  After all that, the crust was cardboardy, the sauce was insignificant, the cheese was bland, the center of the pizza was soggy, and the owner was a jerk (to us and our waitress).", "author": "Whit M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-24", "description": "We wanted to eat in the neighborhood early on a Friday night before heading out of town for the weekend. At around 8PM the place was about 80% empty which we should have taken that as a sign.  About 10 minutes after we ordered, the waitress came back and said they were out of ingredients for the pizza we ordered and what else would we like? A little odd to run out of ingredients early in the night at the start of a weekend but we ordered a different pie. The waitress disappeared hung out at the bar with the other wait staff. Another server brings the pizza, looks at our dirty plates from our appys, and walks away. My wife gets up and asks her for clean plates and we are given a dirty look. By the way, she never gave us any serving utensils for the pizza either. She also never offered  a glass for the bottle of soda she brought over. The waitress finally checks back in with us well after we have started eating our pie. The pizza is ok. Good crust,   bland toppings. Overall lousy service. We will not be going back.", "author": "Michael G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}