{"aggregateRating": {"reviewCount": 448, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "Unfortunately, due to time constraints, a friend and I couldn't wait for Grimaldi's.  Ignazio's didn't have a line and welcomed us with open arms.  We ordered \"the pizza\" (basically a margherita) and it came out within reasonable time.  Unlike some of the reviews on here, the pizza was tasty and had thin, crispy crust.  Oh, and they used pecorino romano on it...mmmm I love pecorino romano.\n\nOf course if I'm looking for pizza in this area, I'm going to go to Grimaldi's.  However, if you need some instant gratification, I feel that Ignazio's can help.  Good pizza, good service, and I enjoyed staring at the Brooklyn Bridge as I ate.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-26", "description": "Quite possibly the worst service in the world. Can't get the waiter to come. Won't deliver the check either. Unreal.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "After walking across the Brooklyn Bridge on a beautiful Sunday afternoon, we planned to come here, knowing about the lines at Grimaldi's, and couldn't have been happier with the choice. The service was friendly, our waitress was very helpful with her suggestions, she came back several times to ask how everything was, and brought our food in good time, all with a smile. The meatballs and the pizza were probably the best I've ever had. Go to Grimaldi's if you must, it'll leave more room at Ignazio's for me!", "author": "Cheryl G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-26", "description": "Hostess had an attitude problem. The water glasses were super weird- I agree with whoever said they were like toothbrush holder cups.\n\nHouse salad was overpriced for what it was.\n\nTook forever for the pizza to come out.. it was okay. the crust was burnt.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "Being a CT Native, I couldn't be more excited to have a \"Luna's\" in Brooklyn. \n\nI haven't gone because of the bad yelp reviews that frankly shocked me. This is the pizza I adored as I grew up. \n\nI just moved to DUMBO and finally went tonight for take out. \n\nIt's perfect. Really, it's not the same as CT, but its perfect. The line at Grimaldi's is ridiculous and the pizza is dry. This is a tad greasy, but what good pizza is not? It's loaded with amazing sauce and cheese. Grimaldi's puts 1-2 pieces of weak basil on the pie, Ignazio's is loaded. Full of flavor, excellent. \n\nGlad it's here.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-20", "description": "If you can't wait for that special pizza place around the corner, then come to Ignazio's, the line isn't stupidly long to get into here.  First and foremost, this restaurant has some interesting waitstaff, definitely colorful Brooklynites.  The pizzas aren't particularly remarkable, they  turn out a decent crust and their sauce/toppings are pretty standard.  Not much ambiance in here but definitely great views of the city from this restaurant.  Just be aware that they only accept cash so leave your plastic at home!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Great pizza. Nice view. Female wait staff dress as if going to a Woodstock concert-not professional. 20% tip suggestion written on bill, I didn't appreciated that.", "author": "Gerry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-04", "description": "I recently went to Ignazio's and I thought the food was excellent. The pizza was delicious and you definitely should try the meatballs. If you want good food for a great price, Ignazio's is the place! Also, I have been to Grimaldi's and the service was terrible and the pizza is overrated. It was not worth the hour-long wait outside!", "author": "Denise V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "Was in the mood for pizza one night and a friend brought me here. Luckily I had cash on me since she forgot to inform me it was cash only. The atmosphere was alright, pretty decent service. We shared a large  white pie which was rather big for the both (neither of us finished our halves). I got arugula and proscuitto....it was pretty good. I asked for a side of marinara sauce which was quite flavorful. I found it interesting that they served water in the small tin bar shakers (just a side note).", "author": "Shaquana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-03", "description": "Let me be the first of what I'm sure will be many to note that Ignazio's is \"nestled\" or \"tucked\" under the BK Bridge, which naturally allows for spectacular views of the Manhattan Bridge as well as Lower Manhattan.  How nice.\n\nWith that out of the way...the bad news.  The space doesn't know what it wants to be--Moroccan lanterns meet standard restaurant catalog chairs meet clashing shades of puce meet MADDENING wrought iron-based tables that I literally had to sit sideways at in order not to keep banging my legs. Now, I'm admittedly 5'10\", but I honestly don't think Peter Dinklage could have sat comfortably at these tables (was that in poor taste?  No, right?  Say no).\n\nNot only were my legs unhappy, but my ears were unhappy, too.  Having live music at a restaurant always seems like such a nice idea--a throwback to days gone by when men wore hats, ladies wore pearls, and every restaurant had a Steinway in the corner.  But the thing about live music, especially in a small space, is that it's usually too loud, and you're either forced to yell to have a conversation with your dining companion, or just sit and smile dumbly at each other and pretend to be enjoying the music or carefully examining your silverware.  Ignazio's boasts a baby grand as well as a xylophone (???), and while the music itself wasn't bad, it was not what we wanted on a casual pizza night.  My throat hurts.\n\nAnd the food?  The food was a total yawn, and WAY overpriced.  When our very very sweet server came over to ask if we liked our pizza, I literally almost said, \"I don't know--it doesn't taste like anything!\"  I lamely covered by saying that it was still too hot to appreciate the flavor, but it wasn't; there just wasn't any flavor.  And it was $27!!  The wine came in these awful ceramic goblets that concealed the fact that we were only getting maybe 1/2-2/3 a full glass, and our salad was small, boring and under-dressed.  \n\nI realize that I live in a touristy area, which affords businesses the luxury of jacking up prices on their mediocre food.  But I really didn't think it was too much to hope that my hood would finally get a quality affordable restaurant.  And the truth is that bad reviews or no, $80 pizza dinners for two or no, Ignazio's is going to be fine.  There will always be tourists at the Fulton Landing.  \n\nHmmm....maybe I should open a restaurant here...anyone want to back me?", "author": "Becca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-29", "description": "Outraged. We were charged, not suggested, but charged a 20% tip on our bill in a way that was not very straight forward. When I asked why, we were told because many Europeans don't tip. What? There is no doubt the three of us were not European. I have worked in restaurants half my life, even restaurants where the boss encouraged the waitstaff to chase after non-tipping diners, but I have never heard anything like this before.\n\nThe pizza was so-so, the waitress not even... huge disappointment and an embarrassment for me as my two guests were from out of town and angered at this practice. There is better pizza in New York with better 'customer practices' and waiters who actually work for their tip. Lame!", "author": "Morgan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-09", "description": "Before I beat down on Ignazio's, let me begin by saying their pizza isn't bad and it's the only reason this rating has two stars instead of one.\n\n. . . ATMOSPHERE . . .\nFor one they were very smart to setup a pizza place near Grimaldi's otherwise I am not sure they would have as much business. I went there like many others because the line for Grimaldi's was insane and as much as it's my favorite pizza, I was not a tourist that just HAD to have Grimaldi's before leaving NYC and was not about to deal with the line. There was no wait at Ignazio's and looking through the window it looked like an alright place.\n\nOnce we entered the restaurant, it was extremely loud and there was a somewhat overpowering herby smell (I think they could do with keeping the door open and getting some ventilation). The loudness came from a man playing the piano (normally would be nice, but it was just too much in this environment), screaming babies, children running around and just general conversation that seemed to be amplified by the setup of the restaurant, which wasn't even full. They also had rather uncomfortable tables. I had to keep shifting in my seat because the legs of the table were awkwardly placed.\n\n. . . FOOD . . .\nI suppose this should be the most important part. The pizza was pretty good considering we didn't have to wait for it and had no expectations. We got ricotta, bacon and roasted red peppers, which was tasty but the ricotta was put on with a frosting piper which I think gave it a (pardon the pun) cheesy look.\n\n. . . WINE GLASS . . .\nMy friend ordered wine that came in a thick and heavy ceramic \"wine glass.\" While it looked interesting, I'm not really sure why you would serve wine in something like that.", "author": "Ramune R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "Was in the area and was dying to try Grimaldis. The wait was 45 minutes and as much as I love pizza, being in NY and there being an abundance of good/great pizza, we weren't waiting. We saw Ignazio's around the corner and from the window, the pizza looked good. My finace and I ordered \"The Pizza\". Fresh mozzarella, Italian plum tomato, Pecorino Romano,basil, select oregano \u0026 olive oil. The sauce was great. Spiced perfectly. The crust was crunchy and the whole leaves of basil were a great touch. The service was good and the only problem was that they were out of all draft beers. We will go again.", "author": "Corey M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-25", "description": "This is obviously the place you go to when you don't want to wait the 2.5 hours to get in at Grimaldi's. The pizza here is average, good sauce, decent crust...pretty reliable, but pretty reminiscent of a Pizzeria Uno. \n\nAttention tourists...Just suck it up and wait for Grimaldi's. You came here, all the way across the brooklyn bridge, for New York's \"best\" pizza. Might as well put in the time to actually get it. If you are impatient, don't be lazy--better to walk an extra 5 minutes up Henry Street to find other options.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-29", "description": "In search of delicious pizza and tired of Grimaldi's and its lines, we tried Ignazio's tonight.  First let me say that the food was good.  Our meatball appetizer was tasty and the pizza was definitely more flavorful than a slice you'll get on the street.\n\nNow, unfortunately, I get to the bad part.  As someone else mentioned, this restaurant didn't seem to know what it wanted to be.  Part of it seemed like a semi-elegant dinner spot, but the horrible red carpet begged to differ.\n\nOur appetizer took too long to arrive and it was followed only moments later by our pizza, which had cooled significantly by the time we were on our second slice.\n\nThroughout the meal, there was a jazz band playing.  And even though we were about as far away from the band as we could possibly be, we still found ourselves having to raise our voices to have a conversation.  Combine this with all of the other people who had to shout to be heard and the music significantly detracted from our experience.\n\nThe price was probably about $2-$3 too expensive for our appetizer and our pizza.  We overheard another group mention to the waitress that the prices had gone up quite a bit since they had last eaten there, so beware if you've gone before - expect to pay more now.\n\nI had walked by Ignazio's many times on my way to and from the park and I really, really wanted to like it.  I love pizza and I love the park, so this seemed like a perfect fit!  But alas, I do not think I'll be going back.  Lower the price, drop  the band and get rid of the carpet, then maybe I'll give it another shot.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "I thought the pizza was good! The ingredients were fresh (and there were ample amounts of the toppings ordered - artichoke, prosciutto, mushrooms) and the crust was crisp and just thick enough to not get heartbreakingly soggy. \n\nOur waitress was also very charming and nice. We were seated quickly and she was always attentive. Granted, it was a weekday lunch, and there were only a handful of tables occupied. \n\nThe decor is, in a word, haphazard. There's purple and gold, and lanterns, and iron tables with marble tabletops?! What? The mirrors are fab, if only you could see them at night; they're made from reclaimed copper building siding. You can see the molding. \n\nAs a wine person, I can appreciate a selection of NY wines. The ceramic goblet - I'm sure it's by a local artist (or a renn faire) - was a bit odd. The amount of wine that was served in it seemed pretty typical, but the size of the goblet (and weight, and un-swirlability) made it seem like a trite amount. And I hate when I can't see the color of the red. \n\nI can't say anything about the prices... I didn't pay.", "author": "Ingrid C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "I thought that, being alone, it would be easy to get seated at Grimaldi's, but no, I was sent to the back of the line behind all of the groups and couples waiting. \n\nToo hungry and tired to wait in a line 100 people deep for anything, I turned around and walked back to Ignazio's. \n\nI sat comfortably alone at the bar and ordered a white pie and a glass of prosecco. They were out of prosecco \u0026 so I chose the only white wine by the glass that wasn't a chardonnay. The bartender mentioned that not many people liked the \"grassy\" flavour of the white I had ordered, so poured me a taste (from the freshly opened bottle) first. She was right, I didn't like it, it was really overly fruity, so they opened a bottle that wasn't on the menu for me, a delicious cheap ruffino. \n\nBottom line - excellent service. Unfortunately the white pie was pretty flavourless. The crust was acceptable, but the sauce needed a ton of garlic thrown at it. I would have been better off grabbing a slice from Front Street Pizza. \n\nShould be noted that they're cash only.", "author": "Jenn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "bacon and caramelized onion pizza is my favorite! the crust is thin and it didnt take too long for them to deliver (about 35 mins). the pizza was a little pricey ($25 plus tip), but it was worth the splurge. i highly recommend it.", "author": "Brandice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "Opening another high-end pizza joint within spitting distance of Grimaldi's to catch the frustrated run-off from their longest-line was way smart.\n\nMy expectations were low, but I was pleasantly surprised!\n\nPros:\n* Pizza was surprisingly good. Favorites are \"The Pizza\" and the Sicilian.\n* The pizza is also tasty as take-out and after a lot of testing, I would argue it's the best delivery pizza in DUMBO and Downtown Brooklyn. Keeping in mind that a bunch of great neighborhood places don't deliver: Grimaldi's, Lucali's, South Brooklyn Pizza, etc.\n* Good beers on tap.\n\nCons:\n* Service is uneven. We've had some great waitresses and some terrible ones.\n* Atmosphere is uneven. When it's busy, it's often full of loud tourists. We once had a meal ruined when a handful of little kids turned part of the room into an active playground and the staff refused to put their foot down. But when it's slow, the atmosphere is totally fine.\n* They're quick to run out of core supplies and ingredients. I've been there when half the beers on the menu were tapped and they ran  out of \"The Pizza,\" which is their signature dish.\n* It's higher-end pizza so it's more expensive than the typical pizza joint on the corner of every block.\n\nStill, all in all, I'd go back. :) It's good pizza, best tasting delivery in the area, and the wait is a small fraction of that at the more well-known places.", "author": "Oliver H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "Don't get fooled into coming here!\n\nRight when we exited the Brooklyn Bridge station, there were people outside offering directions to the Brooklyn Bridge footpath entrance.  \n\nWhen we told them we were heading to Grimaldi's, they kindly pointed the way.  What seemed like a kind gesture at the time, they suggested that if the wait at Grimaldi's was too long, there's another restaurant right past Grimaldi's and around the corner called Ignazio's that was just as good.  \n\nAfter dining at Ignazio's, I began to wonder if they were hired barkers or paid to promote Ignazio's.  Seriously though, I would have to agree with the other yelpers that probably a good portion of their customers are just their because Grimaldi's has a line 60 people deep!  \n\nThe food was disgusting!  Very sparse with the toppings, even the cheese.  All I tasted was the pizza sauce (more like a spread) and then dough which wasn't very good.  They burnt it!  On top of that, it was cash only and they tack on 18% gratuity knowing that no sucker getting conned into eating at Ignazio's would pay even a pittance of that!  \n\nMore like Ignazi-HELL-NO-!!!!!!!!!!", "author": "David C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Ignazio’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "4 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QI7Ccurqz2OPGD2iUrqB3g/ls.jpg", "@type": "Restaurant", "telephone": "+17185222100"}