{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "A day without Baba Cool is like a day without sun -- depressing af. The Fall Bowls are addicting, the wine pours are strong, and the butternut squash toast is a magical gift to your taste buds. The only thing you'll regret here is that your stomach capacity isn't larger!", "author": "Beth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "So happy to find a restaurant that does plant based options! Hard to find healthy California cuisine style places in NY so finding Baba Cool was a huge relief. The produce was fresh and delicious and the dish compositions were sophisticated. Gluten-free vegans have plenty to choose from here but the menu is robust enough that you can take the people who give you crap about being gluten-free vegan with you and they'll be fine, too. We loved the dragon fruit bowl and activated chocolate drink. Excited to come back regularly!", "author": "Tara R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "Nice little trendy spot. I had the jerk chicken sandwich and a glass of red wine... very good. Would stop by again for coffee if I was in the area.  Very small. Service was great.", "author": "Brian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "had such a great lunch here today; staff was super pleasant, eggs/bacon/gfree brioche {!} were on point, \u0026 had a nice seat in a rocking chair outside to enjoy with my pup. I know it gets crazy at peak times/the space can be awkward at times but A for a great experience today", "author": "Lauren D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "One of my favorite spots in Fort Greene. It's a great place to work during the day (unlike some other spots in the neighborhood, their wifi doesn't expire so you can stay as long as you like), or just stop in and grab a coffee and go. Everything is delicious, but the butternut squash toast and Baba bowls are exceptionally good. For your sweet tooth, the lemon ricotta biscuits and chocolate chip cookies are amazing!", "author": "Lara T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "I've now been here 5-6 times since moving to the neighborhood, and I have consistently found: \n\n1. Breakfast sandwich: holy crap, it's good. \n2. Coffee: fine. \n3. Space: tight; almost always awkwardly hovering over someone while ordering/waiting for your food.\n4. Efficiency: I am always shocked at how long anything takes to get. Coffee, even when no one else is in there? 5 minutes. Breakfast sandwich? 10 minutes (though I'd wait 20 for it; see #1). \n5. Service: rude and indifferent. Every time I walk in, I feel like I get the stink eye. Everyone just seems so annoyed to have to be there, and even more annoyed that you want to buy something.", "author": "T.R. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "I liked the place. I sort of felt like a local, eating here on my own, several others came in who were clearly regulars. As other Yelpers have commented, the staff are not very friendly, and one annoying thing I noticed is that they gave disposable cups to customers who were staying, when there were mugs stacked above the coffee maker. That just seemed lazy and uncool to me, I would ask for a mug if I go back. The warm chia pudding was good, the coffee was good.  Of course it's expensive, it's a trendy cafe in Brooklyn.", "author": "Christine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Perfect place for a lovely warm summer night dinner. Stopped in with my wife when we wanted something satisfying but not too heavy, and it hit the spot. The avocado toast was generous and the Baba Bowl was absolutely delicious. \n\nAlmost left without dessert, very nearly almost, but I am weak and caved for a cookie. Don't leave without a chocolate chip cookie! For reals, insane cookie. \n\nGlad we finally stopped in after walking by a million times, did not disappoint. Great neighborhood spot!", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "This place is okay and a little expensive for what is worth. The toasts were a little overpriced but the hot apple cider was memorable. I would love to come back here for a hot beverage. They also had a very unique chocolate chip cookie that I would come back for.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "Amazing little cozy spot, food definitely 5 stars, had the Brussels sprouts and cauliflower bowl, it was amazing, the guy in the back was super friendly, Even gave me a sample of the soup of the day, but customer service can definitely improve, the girl at the front not friendly at all, not good in the hospitality biz, but definitely coming back for the food", "author": "Carolina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I love this place, great coffee, ALWAYS GOOD MUSIC!, and the staff is always friendly and fun to talk to. I highly recommend the squash toast and the carny egg on greens, as these two meals are the ones I get on rotation :) it's a cute place too, I really like the rocking chairs out front and the chocolate cake is a must!", "author": "Ida K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Great energy, great food, wonderful ambiance. I have a few favorites on the menu! To Gabby \u0026 Staff: Tremendous job!", "author": "Les R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I was looking for good coffee and gluten free breakfast munchies. The friendly staff were helpful with my gluten free questions and made our yummy toasts fresh to order. Cute and welcoming atmosphere. Definitely recommend!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Came here for an afternoon refresher. Ordered a large, plain lemonade and wasn't disappointed as I enjoyed it from the rocking chairs out front. \n\nThe neat thing about the lemonade was I could order it more sweet or more tart. A regular issue with me is to have it too sweet so it turned out perfectly refreshing!\n\nLost a star because as I was asking about my order, having already paid and putting away my change, the cashier turned point blank to the next customer and briskly asked \"next customer, yes what would you like?\" I wouldn't have mentioned this but she did it to that customer once they'd finished as well. There were only 3 people in the shop. \n\nPROS: great lemonade; comfy venue\nCONS: briskness", "author": "Olivia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Pros: delicious breads. That's about it. \n\nCons: took 30 mins for two sandwiches and it was not busy. Breakfast sandwich was boring (and after I asked to add tomatoes, I got one cherry tomato...) chicken prosciutto sandwich was monotone and rubbery. Maybe we just ordered the wrong things but overall, it was very bland and nothing special. Which when I spend $25 for two sandwiches, I tend to expect something special. \n\nBiggest recommendation: FLAVOR. Make sure there's real flavor on everything you make...", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Absolutely recommend. Amazing little place.fresh ingredients and really interesting combinations. Not much seating but if you do manage to get a seat, it's a cute little place to eat in or sit outside on their rocking chairs. Would highly recommend the butternut squash toast", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "This review is from a dining experience last August. Luckily, I took the following notes:\n\nStopped in after an acupuncture appointment. I was intrigued by the cool bowl, a vegetable-forward dish with no rice. I was expecting a larger portion for $13.75, but instead got a bowl with barely-roasted cauliflower (I didn't taste the char/caramelization that's possible if executed correctly and seasoned well); raw carrots (think this was supposed to be roasted as well \u0026 not the greatest showcase of knife skills); cabbage (also not cut consistently); and now that I remember, I asked for kale, instead of edamame (which they kindly accommodated for, since I'm allergic to soy), yet it didn't make on the plate. There were mesclun leaves on the plate, some of which were yellow. The saving grace was the avocado \u0026 gluten-free bread, which I think was from Everybody Eats, one of my favorites! But those items cost extra, and brought my poorly-executed dish to a whopping $19.25. Why so expensive? Are the vegetables local? Organic? I'd like to see some local, sustainable farm receipts, please. Otherwise, absolutely not worth the price.\n\nAt least the counter person was nice. A sweet space (although some AC water dripped on me while i was eating). I would also suggest having all components of the dish ready for customer pick-up. Waited a few extra minutes for my gluten-free bread, which the cook kindly brought, yet by that point, I was already dismayed with my food.\n\nShould have went with my intuition/craving \u0026 used that $20 towards a meal at another restaurant instead. Doesn't beat the close vicinity to my acupuncture place, but definitely worth the trip!\n\nHope they've improved since then.", "author": "Van Sun F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-12", "description": "I went on a monday night for dinner and had a very disappointing experience. We were the only guests  in the restaurant and we never got the soups we ordered. One of our main course was cold and greasy, the other one, the coconut curry fish didn t have any sauce and when I asked for a side of it, they brought me something cold, fermented and totally awful. I went previously for lunch/coffee and had a relatively ok experience.", "author": "Laurence M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Super cool and friendly employees, great music, small and intimate (which I love), and most importantly the food is great. What more could I ask for?", "author": "Sonali B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "What is so impressive about this adorable cafe is that they make everything fresh to order. That means there is a little bit of a wait but it's well worth it. Baba Cool provides gluten free, vegan, vegetarian and dairy free products. They also make their own hot sauce and it's bottled up at every table for you to dab on your sandwich or specialty bowl to give it a little kick. I ordered a fresh lemonade, the avocado toast and the arugula salad because I was on a hot summer day I wanted a meal that was light and refreshing. Well I was completely satisfied. Their fresh lemonade was so, well refreshing! This was my first time trying avocado toast which is surprising because of my guacamole obsession you'd think I would have tried all things avocado but I haven't. I thoroughly enjoyed the combination of avocado and slightly spicy seasoning they added on top. My salad included corn, tomatoes and yes more avocado. I guess I was on a true health kick, and didn't even realize it.\n\nRead more on my blog, http://simplypamarie.com/babacoolcafe/", "author": "Pamela G."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}