{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "Seamless + Baba Cool Carney Sandwich = good way to start a Saturday", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "So so so so so Good! Great Avocado Toast was great, Coffee brewed to perfection. And Gabby is possible the hardest working small business owner in Fort Greene.", "author": "Chris Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-28", "description": "This place is ridiculously overpriced and the staff are defensively unfriendly. $15 for a tiny turkey sandwich and a small Arnold Palmer. The sandwich was smaller than the size of my hand. For an $11 sandwich you expect a bit more. My friend's salad was $10 and much larger. I actually laughed out loud when I saw the size of my sandwich and asked if something was missing from my order. Also $4 for iced tea and lemonade? Come on.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Like most new culinary endeavors in this city (and in Brooklyn in particular) this establishment is overrated and overpriced.  The offerings are somewhat simple and appear to be pretty healthy, however, the value here is insanely lacking.  The pastries, sandwich and salad portions are just too meager to justify any future patronage by me. Additionally, I don't enjoy smelling like a frying pan each and every time I exit this little shop (it's a very small and cramped space).  On the bright side, the dishes are all so simple I'm usually motivated to make them myself AT HOME (though that doesn't actually happen).  Additionally, the coffee is pretty passable and not as ambitiously priced. \nThis shop is well located and thus very well primed to take full advantage of the hipster frenzy/madness that has sadly swallowed much of north Brooklyn.  Kudos to their exceptional business acumen!", "author": "Peace L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "We live right across the street from Baba Cool so I frequent this cute little coffee shop at least twice a week.  It would be hard for me to pick a favorite but all of the toasts are amazing! The croissants are some of the best I've ever had too. \n\nIt is very small and maybe not the fastest due to it's size but that's because they make everything FRESH and right when you order which I will wait for ANY DAY!  \n\nPlease bring back the black bean and corn soup it made my life!\n\nMy neighborhood Go-To Spot! \n\nLove you guys!", "author": "Evin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Just recently discovered  this place and it's pretty much a hidden gem.  Avocado toast and good coffee - what more could you ask for?\n\nBut no seriously, this place is pretty cool .  They have a nice selection of healthy foods - salads,  etc. and interesting breakfast choices - eggs/avocado toast with chili flakes, etc.\n\nThe only reason I wouldn't give this place 5 stars is that it's a little over priced (I get that it's a hipster coffee shop, but it's still an up and coming area of BK).", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "It's a cute little spot for a casual breakfast. Don't expect anything super fancy. Just solid ingredients and humble service.", "author": "Natalise K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "Atmosphere is nice. Warm, bright interiors with nice seats for people watching.\n\nFood is good, especially the delicious brioche they use for breakfast sandwiches....but overall, nothing particularly extraordinary, and definitely not very filling. \n\nThat said, the service is slow, and the servers were not remotely friendly. They had that typical hipster air of bored superiority in taking our order or delivering our food. Tread lightly, girls: you just opened across the street from La Bagel Delight, where a similar breakfast sandwich costs a third of the price, takes a fraction of the time to make, and is delivered with a non-elitist smile.", "author": "Kellie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Love this cozy little spot! Come here a couple time a week and the owner, Gabby, is always there making sure that everyone is well taken care of.  The staff is super friendly and welcoming and the food ,coffee \u0026 pastries are quality plus delicious!\n\nEven though I'm not there every morning they still remember my order as though I am a daily customer .  I know this place is going to stay around for many years to come.  \n\nSo grab a coffee or tea, an awesome dish at Baba and sit in one of the rocking chairs out front. Then try and tell me you don't feel like you're at home!", "author": "Jazmine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "Just loved my first meal in Brooklyn. Great service   Super friendly.  Yummy and fresh nice menu.", "author": "Adria E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "I live across the street from these guys and went in today for first time.\nOwner was working the espresso machine and was very nice.\n\nAs I am an experienced barista myself, I asked a lot of questions regarding the beans and what not. \n\nAll my questions were answered with a smile, and I didn't feel like our conversation was rushed (a MAJOR plus for me) as it happens more often than it should.\nshot pulled great and taste was better. \n\nI was particularly fond of the cool planter pot looking cups. which were a welcomed change to the standard brown or white styles of the norm.\n\nGood place with ft greene styled service. Welcome to the neighborhood baba :)", "author": "Raymond B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "I've stopped by La Baba Cool a couple times since its opening, and I've been charmed by my experience on both occasions. The interior manages to be modern, uncluttered, and well-lit while still offering an incredibly welcoming and comfortable atmosphere. The staff engaged me in friendly conversation each time, which I appreciated a lot.\n\nI ordered food during my second visit, and was simply blown away by the turkey sandwich with apples and fig jam. I had been expecting sliced deli turkey (and would have been more than happy with it). Instead, the sandwich contained pieces of perfectly cooked, slow-roasted turkey (the owner told me it had been prepared just that morning). The bread was fresh, the fig jam was delicious, and I found myself solidly full after finishing - a rare feat for a cafe sandwich to pull off for me.\n\nThe coffee was excellent as well (I'm not familiar with the roaster they use). If I lived closer by, I would stop by every morning. Next time I look forward to trying an espresso drink.\n\nIn all, it was the perfect place to spend a Saturday morning in Fort Greene. Highly recommend for ambiance, coffee, food, friendliness, and location.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Solid. The real deal. \n\nReally great egg sandwich, \"The Carney.\"\n\nGood people, good vibes. \n\nI highly recommend this spot for a small group (counter service only) or solo brunch or lunch.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "I feel bad giving 2 stars..... But it was Ungodly slow....slow.... service. Wasn't even crowded and it took 10 minutes for my latte. Cute interior, good latte, but painfully slow (at 1030AM on a weekday). Maybe after they figure out better time management this place will be stellar.", "author": "D C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Remarkable difference. It took me months to return after an awful first experience. This time, everything was better. The food was hot, flavorful and fresh. The service was 100x better. The atmosphere was great as always. I do recommend. Bravo to the owners for working out the kinks. I may become a regular.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "I hopped in here marathon morning for a quick bite to eat before cheering on the runners. Scored a table to watch the race as I ate my vegetarian sandwich. The service was very slow, and not just because of the crowd. The chef had only two burners going for all these people!  The coffee was good and the food was fresh.", "author": "Mary Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "I know a place where where the decor is entirely white and minimalist, the staff is so sweet, chatty, and helpful, the soundtrack of choice ranges from the Cranberries to Credence Clearwater Revival to Modest Mouse, circa 1999, there are over half a dozen varieties of topping-laden toasts to choose from, the gluten-free spiced pumpkin almond flour cake is the rich, decadent, flavorful, seasonal treat I've never known about, but have been searching for my whole life, and where the soy in a soy cortado is free-a.k.a. my happy place, Baba Cool. \n\nIt's not cheap enough to buy coffee/treats here every day, but for this kind of ambience, it's worth the special trip and the few extra bucks.", "author": "Brinda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "My new favorite coffee place in Fort Greene! This place is lovely, the staff were great and my meal was AMAZING.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "The food is incredible particularly the gluten free toast and open sandwiches but it ultimately isn't worth the time, headaches or the cost. On two different occasions I ordered their toast and specifically requested them to be gluten free. Once I started eating it and commented on how amazing the GF toast was and was told it actually wasn't that bread. The second time I asked upon receiving my order whether it was gluten free and it wasn't. They didn't apologize on other occasion for mixing up my order which is really frustrating when you have an allergy. They remade it on GF toast but the service is so slow that it was at least 20 minutes before I had food in hand. Fortunately most restaurants in NYC and Brooklyn are very conscientious about allergies. If you need a good (nicer) option Green Grape is just a few yards away and has awesome GF muffins and much better coffee.", "author": "Maureen F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Never disappointed here!  A reliable, flavor-able spot for breakfast, lunch or coffee in the neighborhood. They taught us how to prepare the perfect avocado toast!", "author": "Mary N."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}