{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-09", "description": "Unorganized. They made me wait 25' for gluten free avocado toasts, only to tell me that the bread was frozen and that I had to wait 8 more minutes. They gave me my money back but they didn't even offer to buy my lunch... Also pretty dirty.", "author": "Ines C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "A favorite fort Greene coffee and breakfast spot. The toasts are amazing. Favorites are the white bean and kale, squash and goat cheese. Also enjoyed the strawberry ricotta, avocado, and egg sandwiches.", "author": "Maura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Baba Cool is a great addition to the neighborhood. The decor is modern and clean, the food is fantastic, and the service was friendly. I ordered the vegetarian breakfast sandwich and the avocado toast. The bread on both dishes was delicious, and the ingredients were very fresh. Also, the large windows provided great lighting for me to get some work done on my computer. I highly recommend this spot for a casual lunch or coffee!", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Love this place. I pretty much always get the same things: almond milk cappuccino (short, which balances the coffee and milk much better), veggie sandwich (so, so good and surprisingly filling). I've tried the chocolate croissant, was solid. The owner is  very chill and familiar with customers, which is great, and the vibes of the place are relaxed and welcoming. Exactly what you want in a local coffee shop. The only reason to deduct a star is that, if I sit and eat, i invariably leave smelling like bacon, including my hair (apparently they have a very popular pork breakfast sandwich). I am not a pork eater, so it's a bit offensive to my senses. That is, for sure, a personal problem, but some ventilation would be dope! Otherwise, baba cool is my fave local spot.", "author": "Tareah I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Great vibe. Enjoying a delicious iced latte and some light reading in my neighborhood. Well lit classy interior with old school hip hop on in the background. I didn't check out the rocking chairs outside, maybe next time.", "author": "Priyanka H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Love the vegetarian breakfast sandwich. The chili flakes and arugula give a nice spicy bite to the scrambled eggs", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "I came here for lunch and some lemonade. They were frying mounds of onions when I went in, so this review is written through still-watering eyes.\n\nFood: I ordered the Chicken and Prosciutto sandwich, comes with arugula on the side. The sandwich itself was bland, if there was any prosciutto in there I couldn't see or taste it. The focaccia was quite good quality, definitely the best bit of the sandwich.\n\nService: Non existent really. Took unusually long to ring me through, and when my lemonade and food were done they weren't announced, just placed on a counter that was invisible from 6 of the 8 chairs in there. I was also one of two people in there, so it wouldnt have been hard to catch my attention.\n\nDecor was the nicest part of it, and the generic indie-pop music was quite pleasant.", "author": "Adeel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "This place is great! Fantastic iced mocha with almond milk. Wonderfully fresh sandwiches and flavors!", "author": "Oliver A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Stopped in for tea and a croissant on a lazy Sunday. Cool ambiance. Great music (including a mix of Sam Cooke, Etta James, and Marvin Gaye). Service was just OK. Wasn't blown away. Would stop back in if I happen to be in the area. The rocking chairs in the front add a nice touch.", "author": "Amber L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Just stumbled upon this adorable place and its incredible avocado toast. Rarely inspired to write a review mid-chew, but the creamy/flavorful/flakey goodness is just too good to not shout out. And the friendly, helpful staff is a wonderful added bonus. Two thumbs way up... only when I'm done eating this awesomeness, though.", "author": "Lyssa D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-30", "description": "Love the avocado toast . Hate the customer service. Don't think I'll visit anymore . I always feel super unwelcome every time I go. And I've been on several occasions. Received cool service once by a tall lanky fella that I haven't seen since. Customer service and prep time needs an overhaul.", "author": "Shaneice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Had heard great things about Baba Cool and made it a point to try it out when I was in town. The avocado and white bean toasts were great and the homemade hot sauces were delicious (and HOT). The staff was also incredibly warm and friendly. It's not a surprise this place has a stream of regulars after only being open less than a year. I'll definitely be back next time I'm in Brooklyn.", "author": "Ari R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Thank god. One of the only places with great food in the neighborhood if you ask me. Delicious!", "author": "Allison P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "Love this place! stumbled upon baba on a stroll trough the area- and what a great find. I personally LOVE the brisket sandwich but you really can't go wrong everything is so fresh and delicious. \n\nI recommend going now before  the word get's out.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "A good place for a quick lil breakfast with that snobby Manhattanite who stayed the night last night. Pricey and chic but tasty \u0026 satisfying! Employees are super sweet too.", "author": "Penelope P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "Should have known by the pretentious name of this place to stay away. My first and last experience. Yes, my fault for not asking how much the teas cost as for some reason they do not post tea prices along with other drinks. Drank a cup, it was good, not out of this world. Got up to pay and was told it was $4.25! Why? Because It is a 'special tea'. (Even more than the $4 latte). I frequent coffee shops all over and never encountered such an unwarranted price. Guess people who eagerly drop $7.00 for a doctored up piece of toast don't mind. Also not a particularly clean place. While I was there the top to the ketchup bottle popped off narrowly missing me, landing on my table. No one bothered to clean up the splatters of ketchup on the counter. Enjoy!", "author": "Julie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-22", "description": "I really wanted to like this place -  I live in the neighborhood, I'm vegetarian, and everything on their menu looks delicious. I went in today for the advertised \"Baba Bowl\" on the board outside. I got it to go, and it came in a small container that would normally hold a cup of soup (pint sized). It cost a whopping $11.75 - but I figured it was jam-packed with veggies and what I was told was \"wild\" rice.  When I got home I was shocked by the 75% full container, filled with a few flecks of wild rice, but about 90% regular white rice - not even Basmati or Jasmine - but what looked (and tasted) like regular parboiled white rice.  This probably should have cost $4.00, but I wouldn't be surprised by paying 6 or even 7 dollars (though it would have been a rip-off).  $11.75 is absolutely outrageous for about ten bites of rice mixed with some veggies.  The sad thing is, it tasted pretty good - This place could have had a loyal customer, if not for the overpriced small portions (at least in the case of the \"Baba Bowl\").", "author": "Matt Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "Gross.  Just gross.  Bread is hard as a brick, too much fig, tasted like a cookie.  Had bones in the turkey.  Bacon and Brussels sprouts were over salted and terrible.  How do you ruin this dish I don't know. It's bacon and Brussels sprouts.  Only giving them an extra star because their sandwiches were at least creative.  Maybe it's time they start buying good ingredients and learning how to assemble them correctly.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Fantastic, charming little spot. Coffee is rich and perfect and the food is delicious. The service there is very cool as well. Perfect,,,,", "author": "MIchael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Absolutely lovely cafe concept with always fresh ingredients sourced locally and a loosely french inspiration. Great clean design inside. Fantastic avocado and beetroot toasts.  Also be sure to chat with the always gracious and multilingual owner Gabriella !", "author": "Rahul R."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}