{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I love this place. Super friendly staff, \u0026 friendly to all food needs. Great gluten free bread. I've been hooked on the breakfast sammies, so I haven't tried much else.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "I was looking for a place to have breakfast in Ft. Greene and picked this place more or less at random. I ordered the bacon-egg breakfast sandwich and a cup of coffee. The sandwich was seasoned with red pepper flakes, but was a bit dry. I was underwhelmed with the food and the cramped seating, especially for the price. Walked out wishing I had gone to the Greek diner down the street.", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "Scandalous occurrence this morning. Assuming a paying customer that's been coming there almost every morning to work on his computer before visiting and enjoying a vacation in NYC will leave without paying just because he packed his stuff before getting to the register is UNACCEPTABLE. \nMaybe the SKIN COLOR made the assumption???\nVery likely for a hipster spot", "author": "Ludovic A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "Went here for the first time on Friday with a friend for breakfast. Nice place but we both ordered the Carny Breakfast Special....not a good idea at all. An hour or so later, I felt so ill and threw up. the same happened to my friend. \nNot recommended at ALL.", "author": "Amy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "Baba cool? More like baba drool!\n\nSeriously though. Feel the need to add a counter review to all the 5 star Fort Greene whooping endorsements. Just ate here and the layout is not conducive to multiple groups, which is sort of a prerequisite for a breakfast spot. The breakfast sandwiches were simple and boring--everyone's plate lacked something basic. Sauce, vegetables, flavor.\n\nDoes this sound picky? I get it. But if a place is cramped and the food doesn't impress, what is one to do? Besides just going elsewhere, of course?", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-09", "description": "After a few brunches at Baba Cool, my conclusions are:\n\n- stick to the toasts, especially the avocado, the strawberry/ricotta, and the butternut squash if it's available.  Really high quality ingredients (especially the bread), very fresh. The kale salad is also a winner, but it is not immune to the overall problem with the menu (toasts excepted):  the prices are way too high compared to what you're getting.  Sandwiches are especially egregiously overpriced.  \n\n- if a seat is open, grab it quick.  People are savages in there when a table opens up.  Worse is that the tables are extremely close together in the small space, so if you've got a douche sitting behind you, chances are you're going to get an elbow in the back a few times.  \n\n- service isn't the fastest or the friendliest.  Iced coffee is very good, hot coffee is average.\n\nNormally I'd call Baba Cool a pass given the many other options in the area, but man are those toasts good.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "After nearly losing my hearing at a spin class at the nearby Crunch, I swung by to grab a bite before my next meeting. Glad I found this place! It's true that this place is probably not for you if you want something fast. But if you've got a few minutes to spare, enjoy the friendly service, the laughter from regulars, and the scrumptious food. \n\nI had Baba's Dream, which was their sandwich special: roasted butternut squash, beets, and kale on white bean puree and smashed avocado. Nom nom nom. Came with a side spinach salad and I caved and got the lemon ricotta biscuit. More of a muffin/cupcake than a southern-style biscuit, it was simultaneously fluffy and rich. Supremely satisfying, though a little on the sweet side.\n\nI'm gonna go back for sure, if only because I am so tempted to try their brisket sandwich. Yum!", "author": "Seisei T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "Strange place with very ordinary food especially for that price.\nNothing interesting in the breakfast menu..\nA nice yogurt granola dish was suggested but way too expensive for the little portion! \nIt was more of a side dish. \n\nThe pressed watermelon juice was really nice though, but I can't say the same for the orange juice :/ they said it was fresh from the morning but it didn't taste like it at all..how hard is it to press oranges?! \n\nAnother downer was the size of the place. It's so small you have to fight for a place :/\n\nWould definitely not go back there next time I'm in Brooklyn. Sorry Baba cool,\nThe name sounded nice but the place is not that cool.", "author": "Fred B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Baba Cool lives up to the name. This cool little cafe is painted a elegant white on the inside and intimately seats two 4-person tables along with a few bar stools, as well as a couple of tables on the outside. If you'd like to eat here, it's best to come on the early side.\nThe majority of options are vegetarian, but their offerings of brisket with eggs or the bacon/egg sandwich on brioche are available for the meat-inclined.\nThis is a solid morning rendezvous location, and very comforting way to start your day.", "author": "Yanik J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "It may say that they're open at 7:30am on Saturdays, but do not dare walk through the door at the time if you're not into the barista ripping your head off. I frequent this little spot and not sure if I'll be back after how badly I was treated this morning. \n\nFriendliness is key in any establishment, and unfortunately it is not something that can be taught.", "author": "Ashley Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Love doing work here and the happy hour. The food is delicious and healthy and it's super cozy.", "author": "Carolina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "I went here with my fiancé and the food was absolutely AMAZING!!! My favorite was the steak frites and sweet plantains!! It has a great atmosphere and a perfect place to hang out.", "author": "Angie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "Really cute place. I just stopped for a quick coffee, which was really good, but unfortunately not hot enough. \nThe menu looked like it had amazing choices. \nThe service was a little confused. It took a long time to get what we ordered and we were asked multiple times what we wanted, to reiterate the order again. \nThe table we sat at, was so sticky.  It was pretty busy in there, so maybe it was an off day.  I might give it another try.", "author": "Jennyjoon S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "I have been to Baba Cool a few times over the past couple of years and while the food is pretty good I can't get past the bad attitude of the cook. The layout of the cafe has an open kitchen and every time I have been there one of the cooks has been complaining and generally rude. I was waiting for my food and a few more people came on (it was already pretty crowded) and she loudly proclaimed \"I just can't handle this today\". I'm not asking that she be all smiles but it really does set a negative tone. It is also very expensive for the size of what you get.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "Nice casual environment\nLaptop friendly\nGreat sandwiches\nThe kind that are as good as my grandma's", "author": "Evan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Absolutely the nicest people work there. The pastries look fabulous and a Toby Estates flat white that can compete with anybody's. Will absolutely be back.", "author": "Alley L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "delicious food and coffee, small little cafe with only about 8 seats (4 tall tables with 8 bar-stools). \n\nThe food was simple and easy. Most are not large portions so be aware that this could be perfect for someone wanting a light meal but not someone training for a muscle competition.\n\nThe service was more of a 1) order and pay, 2) seat yourself, 3) wait,... we waited about 10 minutes for our food,.. 4) devour food (probably did so in less than 5 minutes), and 5) clean up after yourself and place dishes in dish bin and trash in the trash bin\n\nIf I was a resident in the neighborhood, I'd def come back. Since I'm an out-of-town visitor, I'd probably skip this place and go somewhere else more unique (unless I really was sick of all the good food in NYC/Brooklyn and just wanted something light.. hey.. it could happen ;))", "author": "Janet H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "brisket for breakfast- outstanding!\n\nfood was awesome, bit crowded but wifi worked and best gluten-free bun in bklyn!", "author": "Kristin-Marie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "So...have you had the food? It's spectacular. \n\nThere are plenty of cafes that throw together a passable sandwich with fancy ingredients. There are, however, few cafes like Baba Cool that craft food so good it helps you understand how often you have settled for less. One of the things that immediately stands out are the novel, seemingly improbable, combinations. When I first visited, I saw that in addition to the not- uncommon bell peppers, the brisket sandwich also listed Italian sausage as an ingredient. I asked whether it was a brisket sandwich or a sausage sandwich. The chef replied \"both.\" It was amazing (see also the chicken and prosciutto sandwich). \n\nThe service is as good as the food. The folks who work here a great people who like great food. Once, after getting my sandwich, I dropped it on the ground. Totally my fault. I walked back in to buy a new sandwich and they just made me a new one for free. They said, \"That's a great sandwich and you shouldn't leave hungry.\" \n\nThese are folks who feed people in the finest sense of that tradition. You should stop by and see for yourselves.", "author": "Landon R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "Lovely people, really good, fresh salads and a great vegetarian breakfast (egg) sandwich.  The people are also very friendly and helpful.\n\nHaving said that, I have gotten 3 almond lattes there that were sour (and I only go there on occasion after acupuncture around the corner, so I havent had all that many to begin with).  One of the sour lattes was to replace a sour latte!  My local coffee barista explained what Baba Cool is doing wrong (wish I could remember - calibration, maybe?).\n\nIf they fix the espresso/latte issue, I will upgrade to 5 stars.  (Though, I'm not sure I want to chance getting another sour latte!)", "author": "Danielle C."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}