{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "LOVE LOVE LOVE. This is the kind of food I would make at home. That says a lot. House made chai (in two sizes BTW). White bean toast. \nGrabbed me a corner high top and proceeded to enjoy the ambiance and awesome vibe of the place. \nI've been here before but I think they had a different chef. This guy they have now is point. \nThe young lady at the counter was super nice. I have nothing bad to say about them. \nIf there are any air BNBers reading this... just go. No worries. You'll love it. \nMeat eaters and veg heads will all find something to order. \nVeg heads may have an issue with the smell of bacon that occasionally wafts your way, but I for one, enjoyed it. If only the fake bacon makers could get that smell right. Sigh.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-03", "description": "I really, really wanted to love this place. It has everything I usually love - very cute/cozy interior, a hippie vibe, and tons of vegan/GF items on the menu.\n\nSadly tho it did not live up to its 4 stars. :( And listen, I am just as disappointed as you are. I'm the one who spent $20 here and had a meh experience. \n\nSo where to start? Menu selection is pretty great and has an awesome variety of GF, vegan, vegetarian, and \"healthy\" items. I got the Fall bowl, which had quinoa, brussels, lentils, cauliflower, and cabbage, and told them to go easy on the quinoa and replace it with some kale. \n\nServer said cool and I paid almost $16 for my bowl. When I looked at the receipt, I realized I had been charged an extra $2 for the change. Again, I get it when restaurants charge you to make a change, but she should have at least let me know!? Maybe I would have kept the change, maybe not? \n\nWhen I got my bowl tho, I was pretty floored how teensy tiny it was. I probs finished it in like 6 bites. And it was missing cabbage! Honestly, I was still hungry when I got home and ordered poke delivery to make up for all this. \n\nThe bowl itself was fine! But then the worst thing happened, which is that I found a very tiny hair at the bottom of my bowl when I was scooping up last bites of quinoa. Wow, what a world that $16 can get you a tiny bowl of some veggies and a hair. Wah. \n\nI told the server and she told the manager who came to chat. She was super nice and offered me a beverage on the house, but honestly, I was kinda done at that point and just said thanks and left. \n\nI don't think I'll be back, which is really too bad bc I think maybe it has potential? I just don't know. Maybe they were just having a bad day?", "author": "Alex F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "I like this spot. It's right around the corner from BAM, so it's great for a quick bite before a show. It's unassuming from the outside, but nice inside. Plus the staff could not be nicer.\n\nI chatted with the staff behind the counter, who recommended I order the oven-roated turkey sandwich. It was quite delicious. I love a little sweet with my salty and the real pieces of turkey were really complemented by everything it was served with.\n\nI also ordered a chocolate chip cookie on my way out the store and it was excellent. I still think about that cookie. (It could be, because it was my last cookie for a while #dietlife, or just because it was an excellent cookie. I'll take the latter.)", "author": "Katie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-18", "description": "Went in today, and just a few things were off. Service was slow the lady making drinks forgot to make my iced coffee and then somehow my food order didn't go through? and ended up not being made so when I asked them to make it to go she gave me one that was made for a different table(I feel like these things only happen to me.) other than that the sandwich was good, maybe it was just an off day, I'll try again in the future.\nAlso I noticed the lady making the food wasn't wearing gloves and was handling my sandwich, big turn off for me", "author": "Baillie Alysse P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-29", "description": "Came here to grab lunch. Got the brisket sandwich. It was fine, but didn't suit my preferences -- was a bit too dry, wasn't very flavorful, and there was too much meat vs other stuff. Also thought it was overpriced ($12 for a not-very-big sandwich). I would have gotten a salad but those seemed even more overpriced because they were $12-$13 and an extra $4+ for chicken or turkey. Wanted to try the kombucha but it was $7 and I did not want to spend $20 on a quick lunch. Probably a better lunch choice if you're not too price conscious though!", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-03", "description": "Pretty disappointed by the Carny Egg Sandwich. The eggs were nice and runny, but the brioche is just a bad vessel for it. Too much bread. The bacon was also paltry. Something like a sausage roll would've been better, especially at around $9. Also gotta bus your own table. Service was okay. Wasn't too long for me, but the guy next to me complained about how long his sandwich took. They also started offering CBD oil for drinks, so I guess that's now a thing everywhere.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "This place has such delicious and fresh food. I ate here for breakfast twice in a row and the food never disappointed.", "author": "Courtney W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-18", "description": "Cute little breakfast spot tucked in downtown Brooklyn. Great healthy options for vegans and omnivores with artisanal drinks. \n\nThe service here was not the best - they're between a grab and go breakfast spot and a grab and go so I'm not sure if the staff was really ready for it. Our party of 3 ordered together and we received 2/3 dishes immediately, our drinks 20 minutes after that and the third dish 30 minutes after. We all felt uncomfortable because we didn't want to start eating without the third person but we also didn't want our food to be cold. \n\nThe food was just okay- not great. The person taking orders at the register got my order completely wrong but they took so long just to take the order it wasn't really worth saying anything.  The curry dressing could have used more seasoning as it was a bit bland and their egg bowls had more spring mix than egg. \n\nThe best thing on the menu is the spiked hot chocolate so I would suggest going there for that or a small pastry but nothing beyond that.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "Super cozy brunch/lunch spot to pop into and grab food to escape the cold outside! I came with two friends on a Sunday afternoon and ordered the activated hot chocolate and a bowl. Both were very unique in taste! Their whole menu seems to be experimental and healthy which I absolutely love. \n\nThe only downside is the lack of space. We were lucky to find seating but we still felt cramped. There's one table inside and pretty much everyone who chooses to dine in sits elbow to elbow trying to block out the conversation of their neighbors. \n\nUltimately a great spot that really gives the neighborhood some flavor. I'd definitely come back to try the rest of their menu! But I'd take it to go.", "author": "Christine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "Brought my friends to Baba Cool. They were gushing over the menu -- wanted everything even before tasting anything.\n\nThen when the food came, no one could get over how delicious it all was! Everyone just kept exclaiming \"this is amazing!\" One friend said \"I've been waiting 14 years for this!\" She came back the next day.", "author": "Liz V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "My friend and I were looking for a new lunch spot to try out during our lunch break at work and found Baba Cool. We ordered two salads, the Cool Bowl and the Kale Salad, for take out/pick up. This was definitely a filling and healthy lunch option and I am looking forward to trying out more items from their menu.", "author": "Daria D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "My friend and I were looking for a nearby coffee shop next to 67 Burger. It's freezing out and we weren't about to walk very far. So I Yelped nearby coffee places and Baba Cool popped up.\nFrom the outside it looked so cozy and even cozier when you enter. The table seating is set up like a bar with cute metal seats that look uncomfortable but are very comfy indeed. There is art work on the wall that is for sale.\nBaba Cool has many delicious coffees to try that features estate coffee: there's lattes, mocha, cortaditos, cappuccino and hot chocolate.\nThey also have salads, sandwiches and breakfast.\nThe cappuccino was delightful, but I think they might have confused my choice of milk, nonfat with soy. My friend ordered the hot chocolate with soy which was served in a nice size enamel mug.\nThe servers are very courteous and accommodating.\nBaba Cool is a great place on a very cold night to warm up in.\nThey also have a cute logo as you can see in the last pic.", "author": "Fawn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Never a bad experience when I come in for my morning latte! Kinda want to try their dishes now they always look so good!", "author": "Gabrielle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Lovely little spot with limited seating but a bright, airy setting. Staff were super nice. The healthy menu was creative and clearly showed some food love. Service started off good but fell apart. We started with Kombucha on tap (AMAZING) but the tap broke so I sadly switched to watermelon juice. Food came in waves and at one point, our eggs were taken away when the server realized they added cheese when we ordered \"no cheese\". There were a few other snafus but we went with the flow. Go with a chill vibe and go for the lovely food.", "author": "Ann P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Food is okay, service okay, just very okay. Really annoying that they don't bring out all the food (or drinks for that matter) for one table at once but walk 4 times or so. Also, we had to wait for 2 chocolate cookies, that are literally in a bowl at the counter for about 10 minutes. They even brought kale toast in stead of the cookie at first. \n\nCoffee is great, but that's about the only thing I'd come back here for.", "author": "Anne V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "You have to come here for the Carny Sandwich. Wow, arguably one of the best bacon, egg, and cheese sandwiches I ever had. The eggs are really creamy, the bacon perfectly cooked and all of this goes on a fresh brioche bun from Grand Daisy Bakery. \n\nThis place can get cramped but once the city is done remodeling the park that's right next door to Baba Cool I suggest taking your food to go and hanging out there lol.", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Wow. Was incredibly surprised. The place is a little worn down but was so hungry that I stopped in. The asada bowl came out and I couldn't believe it. Best breakfast I've had in a long time. Coffee was really good as well.", "author": "Creighton E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Awesome 90s hip hop party last night! The DJ was on point with a solid playlist that flowed seamlessly from one track to the next that got an eclectic crowd grooving and having fun. If you're looking to go out and dance with friends in a relaxed, casual environment then check out their events and go get your swerve on!", "author": "Dan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "The variety of food is good. \n\nThere are options for people who eat meat and those who don't. \n\nI ordered the avocado toast with eggs.\n\nThe only downfall was there was hair in my food. \n\nI was compensated with a gift card.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "Happy to find this place when I needed food after a VERY stressful morning. They are TINY, but the space manages to be light and airy at the same time. They have WiFi. They have options for vegetarians and even for folks like me that avoid dairy -- I got oat milk in my tea, and I was impressed they had that option. I got a frittata and whole grain toast, and I agree with another reviewer who said the food lacks a bit of seasoning... that would be my only dissatisfaction. I would still return.", "author": "Meridith G."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}