{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-10", "description": "I came here the other night on a whim as I was in the area. The menu is very simple. They have everything from breakfast to salads and heartier dishes to choose from alongside a variety of drink options. It's a pretty small place with several tables and a few seats at the bar. It's a very laid back atmosphere with whitewashed tables and cute light accents. I ordered the sweet potato gnocchi which was a dinner special and it was just okay. I was expecting something better, but I'll come back again if in the area and try something else.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I had the roasted cauliflower as a snack today for lunch and looking forward to going back to try more things on the menu. Super cute ambiance. Cauliflower was delicious and filling. The green sauce complemented it well. \n\nIf you're unsure ask the friendly staff for recommendations. They helped me decide!", "author": "Frances M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I've been here twice now in the past few weeks as I look at apartments in the area. It called me back! It's a great combination of coffee shop, restaurant, and bar. Combination of stool seating, high top counter, and tables. The food tastes really fresh, with a menu that seems to center around high quality ingredients. I got the squash toast last time and this time around ordered the turkey sandwich. Both were great!", "author": "Marissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Baba Cool has become my Ft Green go to coffee shop. They have very tasty pastries like the lemon ricotta bar and if you have time to sit down the goat cheese sweet potato toast is the bomb. It is a very tiny spot with limited seating, but it's warm and cozy.... white washed tables and chairs with local art displayed, sort of a French country cafe vibe. Their golden late is also really amazing. During the summer they also offer wine and other refreshments as well, which is delightful to enjoy using their outdoor seating !", "author": "Carina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "Small place with lots of diet-conscious options. I enjoyed everything we ordered. Service was a little slower than staff had hoped (we were fine with the pacing) so they threw in a treat for our wait. We just kind of stumbled on this place on a rainy long weekend and we were glad we checked it out.", "author": "Ashley A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Wouldn't come here for dinner. We came on a whim. It was quiet. We got 2 of the 3 dinner specials-sweet potato gnocchi and cod. The prices are inexpensive for dinner.....if you actually got dinner. These were appetizer portions literally served on a salad plate. The gnocchi was not gnocchi but rather balls of sweet potato-strange. Felt ripped off and had to go home and eat. Would try again for brunch maybe.", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I came here for a late night treat and had to try the homemade Golden Milk Latte and it was the best one I've had. Can't wait to go back!", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Great spot in Fort Greene with a warm, neighborhood vibe.  The Golden Milk Latte is one of the best drinks around on a cold day and the Baba Bowl is perfect for a healthy feast!", "author": "Sean M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "BabaCool\nNY BK Fort Greene\n2pm Saturday 31st January 2016\nFour Stars\n\nAdded to the places that accept the Cups App. More free and delicious coffee. Download the app for $5 and use promocode 25pn5 for another $5. I had a bacon and egg sandwich $7.5. It came on a soft and crispy brioche. The eggs were soft scrambled. The bacon was slightly crispy. Their hot sauce was spicy and delicious. I also had a cold Brew coffee which came in a clear plastic cup with cube ice and a cool sticker of their logo. The coffee was smooth and caffeinated. I sat in a rocking chair out front.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "More like 3.5 stars (When can we get some half-star action here?)\n\nThis spot is definitely one for the crunchy folks and camera-ready foodies. Ingredients like kale, avocado, pickled beets, and sunflower seeds paint the menu of this bright, cozy (and cramped) cafe. \n\nI opted for the Baba bowl, which wasn't bad, but a touch of salt or another bite of flavor wouldn't have hurt. While the \"green goddess\" dressing helped, it didn't add much. I also had a taste of my friend's avocado toast, which was good but a tad too lemony. The best part about it was the flakey bread.\n\nA cute cafe for a small bite in the neighborhood. I purposefully refrain from saying \"quick\" as our dishes took a while to hit the table.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "The Baba Bowl is so ridiculously delicious and also a healthy option. It is just perfect. I could eat it everyday. Try this dish! Baba Cool has high quality food and friendly staff! Love this place", "author": "Taylor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Love this place. It's absolutely a gem in the neighborhood. There is delicious and high quality food, great atmosphere and people watching, and always amazing music being played. It's by far the best neighborhood spot in Fort Greene / Downtown Bk!", "author": "Yael O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Definitely worth a stop at this tiny place. Friendly recovering hipsters who seem to have reverted back to just being cool man the counter. \n\nPerfect for all eaters- meat, veg, and gluten-free. The jerk chicken sandwich was very spicy, and I welcome heat! The frittata was light, fluffy, and perfectly filling. The smoothie bowl is very light, so share it as a snack but don't expect a filling meal. Awesome loose teas and matcha!\n\nNo bathroom, so use the bathroom at Smokey's and say Baba sent you.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Came here for a late breakfast before roaming around Brooklyn. The space is small and a little tight, but it is very bright. There's bar seating at the counter and then four tables for two inside.Luckily we didn't need to wait\n\nMy friend and I both got the carny breakfast sandwich - it was delicious, highly recommended.\n\n*coffee on CUPS app", "author": "Connie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "Went here for Dinner on a Friday night. \n\nStaff is not very friendly, as other reviewers have pointed out. \n\nOrdered the Sliders, portion was quite small - which for $12 I was expecting a bit more. And the use of disposable cups for a sit down dinner while mugs and glasses were stacked on the counter was a bit weird. The food tasted good, but everything was 20% too expensive for the portions you receive.", "author": "Benjamin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "A nice little hole in the wall coffee shop that makes sense for locals to pop in to. The coffee itself seems a little watered down but still decent.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I wish they had more seats but other than that, I love this place. The coffee is awesome and the avocado toast is to die for. Everything just tastes really fresh and clean. I've been meaning to go for dinner there but haven't got around to it yet. I will though. I wish they had dog treats though for when I bring the dog with me to grab coffee in the morning", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Their butternut squash toast is to die for. So good! They also have fresh squeezed orange juice, which was delicious.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Amazing, different type of breakfast - change up from the everyday bagel. Great place to take visitors from out of town or perfect for nearby air bnbers. Small location so if lots of people plan to take to go and eat at Fort Greene park. \n\nI've had the carny egg sandwich, avocado toast, cookies, and Baba Asada - delicious! Baba Asada is my favorite - brisket and avocado \nWould like to go back for brisket sandwich. \n\nAlso have had it delivered - was impressed when they didn't have the particular cookie I ordered, they called to ask what I wanted from what they had available and gave it to me for free!", "author": "Carsen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Thoroughly impressed by how delicious their cappuccino was. Atmosphere is relaxing and the staff members are pleasant and sweet!", "author": "Jen R."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}