{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Great service, fresh high quality ingredients prepared by people that clearly know and love food. The perfect neighborhood cafe!", "author": "Christie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "Great pear and roasted parsnip soup, awesome salads and sandwiches...just a great addition to the neighborhood EXCEPT the people that man the register are always a disaster: spaced out, getting orders wrong, letting food sit and get cold while they chat and check phones. The cook is often calling out ready orders because these folks are too busy socializing or watching shadows move.", "author": "D R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Baba Cool is amazing. I go here every morning for an amazing espresso from Cafe Integral (soo good!) \u0026 often the frittata for breakfast. Their toasts are outta this world, particularly the avocado, squash \u0026 white bean. They also have really yummy teas, great fresh salads, and delicious sandwiches. They roast a whole turkey, giving you Real turkey, none of that sliced deli meat stuff. They cook everything right in front of you, and it always smells amazing (I sadly don't eat bacon but it still smells amazing!) Not to mention delectable pastries for when you're feeling slightly less healthy. Great options for meat-lovers \u0026 vegetarians alike. It's tiny, with a gorgeous, clean \u0026 bright aesthetic, \u0026 the service is very friendly, the space feels inviting \u0026 intimate. The owner, Gabby, \u0026 the people who work there (shoutout to Jonella!) are soo nice. Make this place your neighborhood go-to, you won't be disappointed!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "Very slow, unfriendly service. The sandwiches are laughably small, especially at $11 each. Arugula salad was over-dressed and not worth its $10 price tag either. Left feeling irritated and hungry.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Rarely do I actually take the time to review a new place but I couldn't help myself this time.  Baba Cool offers great coffee, delicious food, excellent service, and a fun and refreshing atmosphere. If you are looking for a good place to grab a espresso or a quick and healthy lunch/breakfast, you will not be disappointed.", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "delicious salads and sammies made with fresh ingredients-- just wish there was more dining space! will be back.", "author": "Marl B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "I was pleasantly surprised to stumble across this awesome cafe. Had a couple of their toasts and a coffee. They were much more than a coffee place so I grabbed a little lunch. Delicious. Loved the vibe and home made hot sauce!", "author": "Ben L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-02", "description": "My review is only for their coffee as I didn't have time to apply for a loan before ordering a sandwich. Iced coffee has little to no flavor and the bottom of my cup was full of coffee grinds. $3.50 for a \"Large\" iced coffee is insane. Especially since Dunkin Donuts small iced coffee is bigger than their large. Overall not impressed. Try the bagel joint across the street for some good iced coffee.", "author": "Yosi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "baba cool is baba great! This is a clean, fun, and friendly cafe, and every neighborhood should have a place like this. I love the iced tea and sandwiches here. I am not a big coffee drinker, but I heard the coffee is excellent too!", "author": "Person I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "I am exaggerating only a little by stating that eating the oven roasted turkey sandwich with sliced apple,fig jam,caramelized onions and manchego cheese on a toasted stirato bread was a life changing experience. It was in fact that the most delicious sandwich I have every eaten. Ambience and service was great too. Don't miss it!", "author": "Harris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "This adorable cafe resides in a super convenient location in Fort Greene. The owner, Gabby, is always friendly and inviting and really knows and loves her menu. I've been able to try most of the food, from the toasts and sandwiches to the salads and have loved it all. As a coffee snob, I think the coffee is pretty damn good too! I've become a regular visitor and look forward to any day made better by a stop in at baba cool.", "author": "Katy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Places like Baba Cool are part of the reason why I'm moving to Brooklyn from Manhattan. The food is great, the service is quick and easy, my girlfriend loves the coffee and the owner couldn't be nicer. She walked us through everything in a quick, fluid way that made the experience even more enjoyable. I hope everyone who lives in the area comes in to support what I hope will be a quintessential Brooklyn staple.", "author": "Luke M."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}