{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "Though I don't live in Fort Greene (or anywhere near it, in fact), I found this place on Yelp as I searched for a place that was open for breakfast at 7:00 AM because I had accidentally set my alarm an hour early and had no idea what to do with myself, so I figured, why not have a nice, relaxing breakfast (something that never happens on a work day)? It was either MacDonald's and their breakfast menu, or someplace new. An adventurer by nature, I opted for the latter.\n\nThe cafe is clean and modern-chic, which is always appreciated. I took one star off for some of the awkward placement of things on the counter (e.g. I had to move the water jug slightly so I could actually get a full cup of water, I was signing the receipt between/under two cake stands), but the food itself was delicious. I'm always down for eggs, but I wanted to try something that I probably wouldn't make for myself. I went for the avocado toast and the beet and ricotta toast, both of which were incredible (as previous reviews have mentioned). The toast itself is crispy enough, but not overly crispy. The avocado had some chili flakes, which are not usually my jam, but paired nicely with the avocado and lemon. The beet and ricotta toast...well, how can you go wrong with beet and ricotta?! \n\n4 stars for this conveniently located Brooklyn cafe!", "author": "Angela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Love this spot!  I live in Ft.  Greene and this is one of my favorite places to eat.  The toasts and baba bowl are amazing, along with the cookies and treats.  It also has a really sweet vibe and feels like a neighborhood spot.  Not to be missed:)", "author": "Ali P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Come here pretty often. It is great. They just opened up late night and have good beers and wine on tap. Also had some food off the small plates menu and it's a nice combo. Definitely a spot to put in the regular rotation.", "author": "Jon O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "It's a cute place.  Queer friendly.  Healthy options and reasonably priced for the hood but overpriced for simple sandwiches.  It's laid paid, quite place to work.  However the service could be better. Every time I have gone there I have had a different service person but every time the service is terrible.  Took 10mins for someone to come to the register. Then she disappeared to the back. She says that she was doing the dishes. The next time I went in there, a different service person totally had a breakdown while taking multiple orders.  \n\nIf you are ok with slow quirky service. It's not a bad spot.", "author": "A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Great salads and sandwiches, the toasts are a little basic and I feel like I am overpaying for something I can easily make at home, but its reasonably priced and fairly healthy. They need to work on their service a little bit, but overall really solid lunch place. The guy who took a picture of his hand is exaggerating a bit, my sandwich was large and more than filling, maybe he just has giant hands.", "author": "Drew H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Awful staff in charge here. Extremely inept and unbelievable customer service... two completely spaced out people working. Forgot to put in my order, then got half of it wrong....", "author": "bryan d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Really cute place.  A little small but cozy.  I stopped in to charge before I started off on my next adventure and I watched one of the employees (owner) take care of an adorable little girl and her mom.  Mom had her hands full and the young lady was about 3.  She was so polite and behaving very well for her age.  She slipped and my first instinct was to jump up and help but he beat me to it.  Very sweet and talked to both her and her mom.  (Obviously has experience with kids )  she ended up out in the rocking chairs with a huge grin and a cold drink.  Best advertising there is!!", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-31", "description": "Food: quality is good, portion is worth the cost. Neat presentation\n\nVenue: Great location. It felt like there was no AC in the place tho. They can seat 2 groups of four around a table. Bar seating for 4. Outdoor bench. Place is clean and nicely decorated, no bathroom FYI. \n\nCustomer Service: kind cashier, rude and argumentative cook, the cook (she) should stay out of customer interactions. We wished her a good day as we left convinced we would not come back again.", "author": "Luis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Found this place via CUPS app (use my code and get 5$ coupon: 2sghm). Such a nice and warm place! Tge staff is very friendly and mindful. They offer a great variety of coffee specialties and also a lot of dishes (7-13$), both reasonable priced. They offer 10-14 seats, but it can get packed on weekends.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "the turkey apple sandwich with caramelized onions fig jam and manchego is the jammmmmm \n\nit's ten bucks (all the sandwiches are) but it's rich and so worth it.", "author": "Samantha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "I've been here a few times. Nothing to write home about. The coffee's good. The food and the service, meh. Will probably only be back if I have no other option in the area.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "bacon \u0026 egg sandwich - 5 stars\nbutternut squash toast - 5 stars\nbrisket sandwich - 5 stars\n\nI wouldn't change a thing about this place.  So glad to have them in the neighborhood!", "author": "Holly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Simple delicious food in an adorable cafe, this place is fantastic. Drinks are usually pretty inventive and the egg sandwiches are amazing. They have killer homemade dressing and hot sauce.", "author": "Shadi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "Great Food and Great energy . Place to relax or take care of business !!!! Sandwiches are Excellent . Service with a Smile.!!'", "author": "Ajax J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "I like this place, I really do. And live around the corner so it's nice to have in the neighborhood. But when the counterperson doesn't give you eye contact, and is silent after you are polite and say your please and thank you's... well, that kind of sucks. Maybe it's monotony? Oh wait, it just happened with the cook too. I think these guys need a nap.", "author": "Bryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Baba Cool is my favorite spot. The food is awesome, creative and fresh. The atmosphere is hip and warm. The owner and her staff have a great vibe and make you feel like family.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "I was disappointed to find out they don't serve regular coffee after 4pm... Only espresso. Additionally they only have one regular vegetarian sandwich on the menu (the squash with pickled veggies) which was okay but kind of small for 10 dollars. I was hoping this would be one of my go to lunch spots but I don't think they have enough to offer me.", "author": "Lauren E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "$11 bagel sandwich. Bagel, regular cream cheese, shreds of salmon, small chunks of onion. Cherry tomatoes. $11. Not kidding. \n\nAsk for a quote before you order.", "author": "Just M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I ordered a veggie breakfast sandwich to-go for dinner today. Spent an additional $1.25 to add avocados on top, bringing the total to $8.98. This sandwich had scrambled eggs, arugula, and avocados. Except when I opened the sandwich to eat it a couple hours later, no avocados to be found! I paid $9 to eat bread, scrambled eggs, and arugula. HUGE disappointment. Wish I could give a better review because the place is very cute and the person at the register was very nice. Guess this is a lesson in ordering food to go...", "author": "Reanna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Best breakfast sandwich in New York. Its a shame they don't sell their gluten free bread by the loaf.", "author": "Adam N."}], "servesCuisine": "Vegetarian", "priceRange": "$11-30", "name": "Baba Cool", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Lafayette Ave\nSte B", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/yQpeMW-hGKyucTrnJ3jX9g/ls.jpg", "@type": "Restaurant", "telephone": "+13476892344"}