{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "Happened to be walking by on NYE day, and saw the sign...\n\nLooked like typical chinese takeaway so i had to try this twist.\n\nGo a General Tso's Chicken burrito. Brought home and ate.\n\nYum!\n\nLike another said it's not the best wrapped burrito but as fusion fast food it is awesome.\n\nExtra bonus points cos for one the General Tso's Chicken was actually spicy!\n\nWill return...", "author": "Kreig Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-04", "description": "Ordered chicken teriyaki pizza here for delivery a few times. 1st time was great. \nLast few times it was so greasy and unappetizing.\n\nPoke bowls were ok and pretty to look at.\n\nThere's 2 different delivery dude I've encountered. \n\nOne calls you 5-7mins in advance and tells you he's in the lobby already. (Unfortunately I've gotten him the majority of times when ordering for delivery)\nI would rush down to the lobby, just bc I am a considerate individual, but only to stand in the lobby like an idiot waiting for my food. \n\nThe 2nd delivery dude is rude AF. \nCalls and tells me he's in the lobby. I tell him to give me a min. While I'm waiting for the elevator. (I work im a building w tons of employees with only 5 elevators) -  3 min passes by delivery dude calls me angry and asks if I'm gonna meet him for my food. I apologize to him for the wait.\nFinally make it to greet him. Only to see his ugly angry face. Who then just grunts and points at my order w my name.  I respond, yes that's mine. Thank you. - but no response from him. \n\nFor the rest of the evening I had his ugly face stuck in my mind. Forgot about it until now too.\n\nWhatevers, last time ordering from here. Food ain't that great anyways. \n\nPlenty of poke spots in the area w delivery guys with much better attitude and gratitude!", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "This is a beautiful place. Please eat here. This makes me want to eat my veggies. My mom told me to hurry up so I just wanted to say this is a great place :)", "author": "Junior S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "This is a quick fix option for the neighborhood that's worth checking out. I came late in a snowstorm, as they were one of the few places still open. The Asian staff probably didn't speak much English but were very accommodating.\n\nMy order of a spicy teriyaki chicken burrito really hit the spot. It's basically got rice, bean paste, lettuce and tomato and the teriyaki chicken smothered in some kind of Buffalo sauce. Really hit the spot! It cost around $7-8 and although the burrito was definitely not wrapped or cut correctly, I really enjoyed it", "author": "Hal D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-10", "description": "serve fast for the routine teriyaki. although last time it takes me 20min for the tempera ship sushi.\nthe place is kind of small, people can only eat at a narrow shelter on the wall.\nthe price is a little too high for what you get. but its a reasonable for the high rent(probably)", "author": "Jiahao C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Delivery driver is extremely disrespectful and impolite. He called my phone rushing me to pick up my food and told me he was busy, then I go downstairs (mind you I only live on the second floor) and he's not even in front go my building he's on the street. So in my pajamas I had to rush to the street to get my food. I called the store the woman handling phones calls BARELY speaks English I don't know what she was trying to say to me. Moral of the story these people don't care and are impolite. I will NEVER be ordering from here again or I'll have to flip out on somebody.", "author": "Miguel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "The one word I can think of to describe their homemade iced tea is 'delightful,' it's just the right amount of sweet that it tickles but doesn't over power your palate. I strongly recommend the teriyaki chicken burrito it's delicious as well as quite fat. Since I'm a hospital employee I get the drink for free so I highly recommend this place if you are too.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "I agree with everyone else's opinion. This is pretty much mall Teriyaki\n\nI like how they don't OD on the sauce\n\nThey give great portions, and you get a lot for a small price.\n\nFood is incredibly fast, literally minutes, even seconds from order to plate", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Food was good.  Ordered bbq spicy shrimp with white rice.  Had a nice kick with a subtle sweet bbq flavor.  Place was dingy and not very inviting but they took care of my order fast so perfect for to go food. Only slight complaint food-wise was that it was a little salty.  Price and portion were very good. Would get food here again.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Chinese food and mexican- has to be gross right? NOPE- It's really good! You're probably thinking- how can I trust someone who ordered mexican and chinese from the same place, but I thought the same and was fully prepared to chuck it and order something else- but I didn't have to and I was really impressed by how well they did both. \n\nOrdered a 2 filling burrito and dumplings-my bf got a chinese dish and we both really enjoyed everything.", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Do yourself a favor and walk away. My girlfriend and I ordered through seamless thinking this would be an interesting place to try. Needless to say, we were severely disappointed. Our order was AN HOUR LATE and the food was very unappetizing on top of that. Save your money and go somewhere else.", "author": "Ricky M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-10", "description": "I was intrigued by the Teriyaki burrito, but in the end, I didn't want to try it.\n\nI just got the Teriyaki combo. It's as several people mentioned; it is mall teriyaki chicken. \nIt's not the best culinary experience that you will have, but it tastes delicious when you are really hungry.\n\nSo it's ok for the price, I believe it was $6.50. I'm sure it's possible to find a comparable meal for cheaper elsewhere.\n\nMy husband got California roll of 8 pieces for $5.75. Tasted pretty decent, you can get it and won't be disappointed if you are really craving sushi.", "author": "Tanya F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "The burrito's \u0026 fried octopus rings are extra good. A new favorite of mine. Now when go I have to order extra food. My relative who works nights got hooked on the teriyaki rice specials \u0026 the octopus rings. All flavorful treats.", "author": "Veronna T. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "4.5 stars because for what it is, it is dam good. Just got back from my first time there and I take it as a place that mostly locals go to/ people to who to school or work around there. And just by looking at the diversity of the food around there (mainly sandwiches and american food) it is definitely a refreshing change from the norm. The food is not like praise the lord Jesus savior good, but it is dam good for what it is.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "My friends and I often come here for Chicken Teriyaki with White Rice or Lo Mein. It's decent for its convenience in the area, yet I have had better. The students are allowed to get a drink for free for an entree. This place is more for takeout than dine-in due to the limited space.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "The place is very small and could be easily passed by but there food is good. They werent cheap on the portion, meat tasted fresh, and everything was pretty solid. For a cheap meal this place deff hits the spot", "author": "Eddie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "There is no way I can give a good review to a place that doesn't offer free water. It is the LAW to serve people a cup of water when requested; however, they refused to give me any water so I had to purchase a gingerale for $1.\nTheir price is pretty expensive too considering how easy a bowl of terriyaki sauce covered rice and meat is. Their store is extremely hot and I've been waiting quite a while now for my terriyaki orange chicken to be made, giving me time to write this review on how they aren't giving FREE WATER. Maybe this is common practice in Brooklyn (as I'm not a local I'm not sure), but this needs to change.\nAs far as orange chicken goes they are good. Meat tastes fresh", "author": "Charles C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "It's been awhile since I've had such a bad meal. Teriyaki Shack is a tiny place with one counter to sit at and a kitchen that takes up more than half the restaurant. It's not a good looking restaurant, but it doesn't try to be and by my taste, doesn't have to be. Service was fine. It's counter service and the staff were friendly enough. \n\nMy problem with the place is that the food was straight up bad and wasn't even that cheap. I got the sesame chicken entree which comes with a side; I chose lo mein noodles. The food came out in about 8 minutes or so. The chicken looked nothing like the image on the menu or like any chicken dish I've had before. Each piece was practically a ball. And in each ball was some dark meat chicken and some unidentifiable mush that I think must be filler made from who knows what. It was all flavorless except for the sauce on it, that tasted almost flavorless, but a little sweet. There were also vegetables in the container, but there were so few, they might as well not have even added them: literally one tiny piece of broccoli and a little lettuce. The lo mein was the best part and even that was subpar. I paid over $8 for this and I could only eat about half because I didn't want to have simply thrown away my money.\n\nIn conclusion, can't be the worst place a person could eat at, but buyer beware.", "author": "Todd P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "It's basically mall teriyaki but they are fast and delicious. I usually get just veggies and chicken, I like a lot of vegetables but sometimes they are greasy which I don't like. The chicken and shrimp was not as good, the shrimp is over cooked.", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "If you've been to just about any shopping mall ever, and have tried Sarku Japan in the food court then you can imagine what Teriyaki Shack tastes. The only difference in my opinion is that Teriyaki Shack has better veggies.\n\nTeriyaki Shack is small and you can easily walk right by it without even knowing.. There isn't much seating inside. Maybe enough for five people on stools along the wall. I got the chicken and shrimp combo with brown rice. Had I known I was going to be charged 75cents for brown rice instead of white I would have just stuck with white. The combo came out to about $8.50 and it made for a solid meal.The fact that I was able to get two different meats over rice with veggies for $8 and change was awesome. \n\nTeriyaki Shack isn't anything special as far as the food goes but if you want a meal that will fill you up while eating on the cheap it's hard to beat this place. I'd definitely be back if i was in the area and was just looking to grab some grub just to fill up on.", "author": "Rojé G."}], "servesCuisine": "Japanese", "priceRange": "Under $10", "name": "Teriyaki Burrito House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "96 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/vQiv-eP8RwIYQtAfVX5UKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187224771"}