{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "I'd agree with previous reviewers, this place gets the job done.  Cheap, quick, filling, fresh.  I had the chicken/shrimp combo with fried rice and veggies.  All passed the test, even by my pretty-easy-to-get-grossed-out standards.  \n\nAs others said, ask for extra teriyaki sauce if you prefer more flavorful and saucy food.", "author": "Holly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "I think the other reviewers below who dont even have a profile pic, or very few reviews are actually other business owners who feel competition in the neighborhood. That being said, this place is always a solid place for dinner. The chicken is all white meat and not nasty at all, everything is fresh made, I watch them take fresh raw chicken, cook it, put teriyaki sauce on it and complete my meal. The place has little seating, so take your food on the go. I've had the beef, and the chicken, but prefer the chicken. They give you a lot for the $7 and you can get extra meat. I always get the lo main instead of the rice, and ask for no veggies because I dont like the ones they give you (carrots, celery and something else), Check it out for a late night or quick take out bite and you will not be disappointed!", "author": "AJ K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-26", "description": "Overpriced for quality and quantity but good to go if you're nearby and it's the only option for sushi.", "author": "Thuy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-20", "description": "I stopped in here one night after climbing at Brooklyn Boulders to grab a quick bite to eat.  I've read some of the reviews on here, which made me very skeptical on coming here at all.  First, this place is NOT a fancy 5-star restaurant or even close to it for that matter.  It's a place to grab a quick bite for a very very reasonable price.  So I decided to go against the other reviews and give this place a shot!\n\nSecond, with that said, I found the establishment very clean and tidy.  It appears that they only opened about a month ago.  The employees there were friendly and very accommodating with answers to my questions.  I ordered the beef and shrimp teriyaki while my g/f ordered the chicken teriyaki (which seems to be their featured dish).  Both dishes came with the choice of white, brown, or fried rice.  The steamed vegetables included cabbage, carrots, mushrooms, and broccoli.  They didn't drown the meat in sauce like how some other reviewer stated.  They cook the meat with some sauce, then ask you politely if you would like extra.  I thought the overall taste of the food was great.  \n\nFor a late night meal (they're open til 10pm!!) or a quick bite to eat, I would highly recommend Teriyaki Shack to fulfill those needs.  The food there is delicious and I would definitely go back!", "author": "Sam C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-07", "description": "Pretty darn good teryaki chicken! Not thick and over salted like other fast food joints I've been to. If you're hungry or craving something savory this is the place to go!", "author": "Lianne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "This place is great. You're paying like $7-8 for meat over rice with some veggies. \n\nIf you want Benihana, then go there and pay Benihana prices. For the money, this is exactly what I was looking for.\n\nChicken was better than the beef. Will dine here often.", "author": "Stranger D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "I Love this place. I go to the high school near by and I try to get the chicken teriyaki here as much as possible. The first time I tried it I fell in love, I have not tasted anything better than that ever since. I only tried the chicken teriyaki so i'm not sure about the other dishes but i'm pretty sure it's good. I love eating the teriyaki with hot sauce, I guess it just adds more flavor to it but it has enough flavor itself. The portions are great, I get very full after eating. Overall this place has the best teriyaki around. \nP.S The place is small so it will be hard for big groups but I suggest everyone to try the teriyaki there, I don't think you'll regret it.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Very Good and extremely fast service. They don't only offer teriyaki chicken and shrimp, they have curry chicken and a good combination of vegetables as well. I lifeguard only a block away and I'm here frequently. The best part about it is literally it takes 5 minutes to get your food and be gone. Can't beat that :-)", "author": "Lorenzo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "After eating Deli sandwiches and Chinese take out for 2 months at my new job, I am so glad to find this Teriyaki place. I had  the chicken teriyai with veggie. The meat was fresh and juicy.  The portion was generous for the price they charged. I was suprised to find this hidden gem in the neigborhood.  I am satisfied and will definitely post up  their menu right next to my computer.", "author": "Siutan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-27", "description": "Teriyaki Shack took over the soul food place. Had the chicken and beef / mushrooms on separate occasions. Sub-par is the correct word to describe them for the prices they charge. Metro King teriyaki still better. They need to work on improving everything like not using the same cooking area for shrimp for those with food allergies to shellfish.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Perfect place for lunch. It's close to my office. I have tried almost everything on the menu. Great portion and really friendly staffs. They have amazing burritos and dumplings.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "As good  as it gets when it comes down to savory -not the sugary sweet kind- teriyaki!       Love their chicken teriyaki over rice with fresh steamed veggies. Quality cuts, generous portion, price, fresh ingredients, savory taste and at the same note, I can say this fast food is healthy also. Dishes are not over-salted nor drowned in sauce and all. Heck, I even had to ask them to sprinkle/add a little more sauce, esp to those steamed veggies. Their recent addition, grilled teriyaki fish fillet over lo mein and veggies was pretty good as well. Never a big fan for teriyaki, but this nooky establishment does set the bar. Will definitely revisit.", "author": "Mona K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "I had a chicken and shrimp teriyaki combo and I was very impressed with the quality of the food. The shrimp was very fresh and deveined! The teriyaki sauce had very good flavor and it wasn't thick like most teriyaki restaurants. The service was very fast, I was in and out in less than 10 minutes. All in all I was very satisfied.", "author": "Kenny Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Visiting a friend for the week and came across this place while visiting her campus at LIU. I had fried rice with their famous beef!!! Soooooo good!!! Price is more than reasonable for the amount of food that I got!! My friend order the lo mien with chicken and she really liked it too! 5 stars all the way!!", "author": "Dreamer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-18", "description": "Perfectly good takeout place serving up, you guessed it, teriyaki flavored dishes and burritos.  \n\nI got the teriyaki chicken.  It was served over white rice and steamed vegetables (mostly cabbage).  It tasted good, was filling, and had a good price.  It was a little light on chicken and heavy on rice, though, and the teriyaki flavor certainly didn't blow my taste buds away.  But a perfectly good lunch.  \n\nI was with a group when I went; the others' teriyaki dishes seemed to be of similar quality/quantity to mine.  Those who ordered burritos loved them.", "author": "Blodg R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I like the super speedy service. I ordered the chicken teriyaki with brown rice.  And it took less than 5 mins.  Hmmmm chicken is reheated and veggie is raw but it's ok.  I will come again.", "author": "Al C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": "Passed this place as I was walking home from church. Seemed very low key, but the service was quick, food was OK and my tummy was satisfied. Let's not pretend that this place is a 5-star terriyaki place, cause it's not, but will it get the job done and leave you feeling good... YES. It reminds me of those $3.99 spots in the mall that I used to go to when I was in high school. Rice, grilled vegetables and meat. Period. That being said, it's not $3.99 but you get the point.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Wow!!  The food was fresh. Value is excellent. Good sized portions. Friendly service. What else can I ask for?  Exactly what I was looking for,  a excellent valued dinner with excellent taste!  I will return!!!", "author": "Anthony W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Was really hungry one day and just happened to walk by this spot by luck. It was the day after their soft opening and I didn't know what to expect. Luckily I had walked in to the right place. For a while I have been eating subpar teriyaki from metro king and God just happened to place this place in front of me. The food was VEEERY GOOD! I was lucky enough to try the beef, chicken, and shrimp and boy did it hit the spot. Ever since then I have become a regular and am enjoying it.  If you are in the area and love teriyaki and a friendly environment, I recommend you give Teriyaki Shack a shot!", "author": "Leandro Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "I used to love teriyaki shack (well, now it's called Teriyaki Burrito House). I would buy the teriyaki chicken and shrimp combo at least twice a week until I started getting bad pieces of chicken. Chicken that had large pieces of inedible gristle attached to it. I tried to look past that but it kept happening so frequently. The final straw for me was this evening when after a two month hiatus of not coming here, my boyfriend and I decided to come and both get teriyaki chicken and shrimp combo platters. I got all the way home and sat down to eat my food when I noticed that a majority of the shrimp still had the shit vein in them. I immediately called the restaurant and informed them of what I found. After repeatedly blaming the issue on their shrimp vendor, I just told the gentleman that I would come in for a refund. He then offered to take my name so he could offer me a free food credit (which I did not want). After I got dressed and walked all the way back to the restaurant, I had to wait for ten minutes for the manager to come to refund my money. The manager came in with a sourpuss attitude and didn't even acknowledge me. He clearly didn't want to refund my purchase even after I showed him several pieces of unclean shrimp. Never eating from here again!!!!!", "author": "La'Donnia P."}], "servesCuisine": "Japanese", "priceRange": "Under $10", "name": "Teriyaki Burrito House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "96 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/vQiv-eP8RwIYQtAfVX5UKQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187224771"}