{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "My boyfriend lives around the block from here in BK Heights, so we come here pretty often for the oyster happy hour. first of all, this place is very small and can get really crowded around 5:30, so my recommendation is to come a little after 6pm when the crowd eases a bit. They have quality dollar oysters, and the other types of oysters not on the happy hour menu are good also (my favorite is the Naked Cowboy). They include descriptions about the taste and texture of each of their oysters, which is a nice touch if you know what you like. \n\nHowever, the only reason why I gave this place 3 stars instead of 4, is because of the menu. It is a little bit tired. I am mindful of the fact that I have been here a few times (I enjoy the mac and cheese off their menu), but I just wish that they would change out a few menu items from time to time.", "author": "Mia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "After hearing about it's opening a few weeks ago, I was pretty excited to try out Jack the Horse Tavern's new oyster bar for happy hour.  I came by around 5:30/6pm and was greeted by a friendly waitress and given menus very quickly.  I ordered a Trinidad Spritz ($6) and my boyfriend ordered their Avery IPA (not on the happy hour menu).  Since this is an oyster bar, I ordered all the oysters on their menu because the happy hour menu stated that happy hour oysters are East Coast only, and all the oysters on the menu were East coast.  Yay!   Anyway, I ordered about 9 of them in total, each were very fresh. We also ordered their mac \u0026 cheese and brussel sprouts \u0026 radishes appetizers.  Both were as expected, since I've ordered them from JTH before.  When we asked for the bill, I realized I was charged full price for the oysters and when I asked why, our waitress told me that the happy hour oysters are the chef's choice of various East coast oysters.... ah ha.  Gotcha.\n\nSo let it be known that if you stop by for oyster happy hour, tell the waitress you'll have X number of East coast oysters, and you're set.\n\nSince I typically walk to Cobble Hill / Carroll Gardens or go into Manhattan for a good oyster happy hour, The Oyster Room is a great addition to the neighborhood, and I look forward to coming back.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Came here for the oyster happy hour.  We happened to get there just after 5:30 when happy hour had started and there was only one other group in the place so we had an easy time getting a table. \n\nWe ordered several of the $1 oysters and they tasted great! After looking at the happy hour some more we decided to grab some other appetizers. My friend got the Mac \u0026 Cheese and I got the Baccalau Croquettes. Both were tasty.  \n\nBy the end of our meal the place was absolutely jam-packed. I recommend getting there early to get a table and take advantage of the great happy hour!", "author": "Davinder C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Fun!!! The happy hour here is just abuzz. The oysters are $1! The drinks were ok. But it's just a happy and cute place to be at 5:30 after work.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "There can't possibly be a cuter little pub to enjoy happy hour. The atmosphere here is fantastic! Enjoyed the oysters....some of the best we've had. Would love to go back and try their dinner menu.", "author": "Kari G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Cute place intimate, cool, fresh. Oysters were fresh, drinks were well made, staff was friendly.", "author": "Jessica O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Perfect as an attitude re-set after a hectic day at the office!  Well made classic cocktails (you can even order a Brooklyn Heights!) and $1 oysters. Intimate space fills up fast, so make sure to arrive at 5:30 for a table by the window and a relaxing time!", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Another great gem of a place. Have been going to JtH since they opened years ago and it's remained a favorite.  This joint has $1 oysters -- always a good deal, right? -- although last time  we also ordered some $2.50 oysters that were 3X the size, so it's all kind of relative, right? Good app selection, too.  Eager to make this tiny bar a regular haunt like JtH.", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Favorite business in Brooklyn Heights. Excellent happy hour. Oysters are an aphrodisiac, so at $1 a piece you'll probably fall in love before you leave.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "The place is nice, but if you like seafood with flavor, this is not the place,  needs seafood seasoning.  Seafood is served with lemon , we had to ask for lemon twice.  The waiting period 25 min. Between starters.", "author": "Marggy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Amazing food. Oysters for $1, smoked trout deviled eggs, and great cheese selection. The server Liz wasn't rude, but wasn't pleasant either. That's the only thing that kept me from giving five stars. I'm sorry for bothering you, Liz.", "author": "Chelsea G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Love this neighbourhood spot! The service is always friendly. The happy hour prices are a charm and the mac and cheese is extraordinary! It can get very and busy and noisy during happy hour. Get there early for a spot.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "Good oysters, ok price definitely in the positive! Small and cute, had good service. Not much I could say that's bad!", "author": "Al E."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "The Oyster Room", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "66 Hicks St\nJack The Horse Tavern", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ijnO0HLgPvNLXzD1BYjv2A/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}