{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Mussels, oysters, and french fries can be vouched for! \n\nCant wait to come back for the happy hour! \n\nAmbiance is very relaxing and easy", "author": "Donna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-27", "description": "Fun and friendly oysters that a walrus can't resist.\n\nHeaded back to our friends Brooklyn Heights apartment from NYC proper, we decided to stop here for some oysters and beer. Bar stool tables and extremely small, still, it was a fun and friendly environment.\n\nWe talked to a real estate agent and his friend about the area. He saw we were foodies and gave us recommendations for restaurants in the area.\n\nThe oysters were wonderful, the appetizers were great, and we left feeling we had had a great time.", "author": "Dan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "Very small, cute, quaint place.  The oysters were a very good value.  $1.00 each at Happy Hour.  The drinks were eclectic as well.  It was in a  neighborhood setting, which was nice too.", "author": "Darin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Dollar oysters and $6 drinks! Located on a quiet neighborhood street in Brooklyn Heights, this place has an excellent happy hour and a comfortable, warm ambience. It's super small and cozy, so I don't recommend for large groups, but it's the perfect spot to catch up with a friend or enjoy your oysters and wine solo.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Dollar oysters. Dollar oysters! DOLLAR OYSTERS!  Great place to chill out with drink specials and several appetizers (mac and cheese is to die for as is the brussel sprouts).  Very limited seating in a quiet neighborhood venue.  Next time we are in NYC, will most def hit this place up again.  Opens at 5:15 nightly.", "author": "Debbie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "I love coming to the oyster room after work for happy hour! $1 oysters $6 wine and beers. I definitely recommend the shrimp cocktail and baked Mac and cheese it's amazing!! Service is great as well. The room itself is pretty small so if you're looking for something bigger it's attached to a larger restaurant with a larger menu option. Definitely recommend !", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Happy hour, happy hour, happy hour! This cute Brooklyn spot is nestled in a corner of Brooklyn Heights, right around the block from Jack the Horse tavern and really specializes in two things, fresh oysters and happy hour drinks. It's hard to beat a $6 old fashioned, glass of wine or local IPA, and the oysters are amazing! \n\nThey do get busy, however, so if you are going, be there at 5:30PM. This is great for the local working crowd, not so much if you are journeying out of your way to get there. The Oyster Room is in the middle of a mostly residential neighborhood so use your maps app well.\n\nIs it worth the trip? For Happy Hour, absolutely!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Drowning my sorrows in wine and oysters.  I missed the happy hour special by 5 minutes so I was unable to take advantage of the $1 deal, but for the unusual variety they offered, the full price wasn't so bad.  \n\nIt's a homey place, tiny and perfect for when you feel like enjoying your vices solo.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "The oysters were great, the place is cute, my fries were delicious and crispy, awesome cocktails. \nThe reason why I'm giving 3 starts is the service: the waitress was very rude, she never responded when we said thank you, pretended she didn't see us when we were trying to order (I had to ask for her attention by yelling \"Excuse me\" about three times) and seemed like she hated her job and she was doing me a favor by taking my order. \nI will go back soon for sure, just would love not to feel like I'm disturbing the waitress by trying to place an order.", "author": "Beattrice W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "I was redirected here from Jack the Horse Tavern next door (I guess they're connected?) with a group of friends and ended up not having very much room because we were waiting for a few more to join. Their happy hour is nice though! $1 oysters! And the location is quite convenient yet quiet so you kind of feel more \"in the neighborhood.\"\n\nThis is definitely the kind of place you don't want to go to with more than 4 people though, even 4 people seems crowded, honestly. Their other appetizers for happy hour were good. Their drinks were decent, $6 for their special.\n\nThe service is what knocks it down for me, not only are they not really that accommodating for groups but they're also very difficult to get a hold of. It seems like a lot of waitstaff work here but most of them just seem to walk back and forth with only 1 person taking any orders and everyone else just there.\n\nI would definitely go back, but maybe just with a group of 3 max.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Cute little neighborhood spot connected to Jack the horse taven next door. The boyfriend and I love coming here after work (I work nearby in Dumbo) for happy hour. We usually get the oysters, shishito peppers and mac and cheese. Server is nice and came around every once in a while to check on us. Will be back!", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This is my favorite place for happy hour oysters! Arrive early because the place is small and always fills up. They have a great selection of drinks and food on the happy hour menu. Definitely get the mac and cheese! It's the best mac and cheese I've ever had.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Great happy hour and more happy hour seating than their sister restaurant Jack the Horse", "author": "Dan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "This was one of the places we really wanted to eat at and it didn't disappoint us. We got here a little before 5 so we hung outside on the bench, played with some dogs and the humans they were walking. Very nice neighborhood. \n\nAh the doors are open. We were the only ones there. Yes Mondays are a very good day to come as we heard this place gets crowded. We got their oysters $1 each. It was the stingrays from Virginia which was a treat as they normally have the Barcat oysters. It comes with minette sauce which is a champagne vinergarette sauce. If you're like me, you can request their secret cocktail sauce. We only wish we had more room in our already stuffed tummies to eat more. \n\nWe also had their Mac n cheese which was bomb as well. The roasted shishito peppers with nori salt was also a winner. \n\nNext time we will try some wine pairing. \n\nNeitaly was our waitress was so funny and helpful. 5 stars all the way.", "author": "Ward K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Excellent alternative (or sip while you wait) for the proper dining room next door, the Oyster Room truly feels like a pearl in this wonderfully neighborhoody but light-on-eateries part of Brooklyn Heights.\n\nIt was really chill when we walked in after picking up our Brooklyn Half bibs (I was surprised there weren't more runners here). Our waitress was good and the nibbles were tasty. I tried several oyster varieties, all interesting in their own ways. Ask for recos.  The brussel sprouts and sliders did not disappoint.\n\nThe best thing might have been the Old Fashioned I had (fast becoming my bourbon cocktail of choice). It was expertly mixed with the right amount of bitters and brown sugar. Three cheers, my good man.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I would say it's closer to 3.5 stars. Came here for a small meal with the bf before a concert. It's a cozy little space, right around the corner from Jack the Horse Tavern, and they have the same tapas menu plus happy hour menu and oysters. \n\nThe plates were small and varied in quality. Mac and cheese was creamy and crusty which I liked, the oysters were all really awesome and fresh/briny, and the $6 Old Fashioned was strong. The fried goat cheese with honey was not quite what I was hoping for, and the braised brussels sprouts were a little undercooked and hard. \n\nI would give this place another shot though, and I especially want to go back to JtH Tavern, since I stopped in there first to wait for the bf at the bar. It's a much bigger space, with chairs and tables instead of stools. They also seem to have a pretty great drink menu. I guess the Oyster Room is still sort of new, so I'd like to see how they do as they get more into the groove of running things.\n\nOverall it's a nice place for drinks and oysters in a low-key (but still romantic) atmosphere in a quiet little neighborhood.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Perfect little happy hour. Tiny place, so get there early! $1 oysters cant go wrong. Brussel sprouts seem to be another hit. I didnt get them but i was surrounded! Will def be goingback", "author": "Lyss G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Stop in while visiting Brooklyn so glad I made the stop!  Cute little oyster bar with great music and food.  I recommend the salmon salad and the Fisher Island oysters .", "author": "Heather M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "A true Brooklyn Heights local hang-out spot with $1 oyster happy hour deals; the other food options and cocktails are vastly overpriced. The space is very small and seating is limited, but I've never had to wait more than 5 minutes for a table. If you are an oyster monster, check this place out!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "OH man! Their oysters are not to be missed! Great for an after work spot if you want to pony up to the bar and have a nosh. Be careful, their drinks are yummy but powerful.  I have to say, I am in love.", "author": "Lisa H."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "The Oyster Room", "address": {"addressLocality": "Brooklyn Heights", "addressRegion": "NY", "streetAddress": "66 Hicks St\nJack The Horse Tavern", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ijnO0HLgPvNLXzD1BYjv2A/ls.jpg", "@type": "Restaurant", "telephone": "+17188525084"}