{"aggregateRating": {"reviewCount": 16, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Came here for an anniversary with my boyfriend.\n\nThe manager personally came to us and started a conversation. He was very nice and made sure we were satisfy with everything the whole time we were there.\n\nThe food was really good as well, their spinach with steak was delicious.\n\nI would come here again.", "author": "Tsui Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "For a hotel restaurant this place is pretty nice. Good amounts of seating and the bartenders were super friendly. I was there for a private event and they only had two people working the bar so the waits were long but I appreciated the friendliness. For the event they served up appetizers only and almost all of them were fried so I didn't partake but everyone seemed to enjoy them.  Otherwise I cannot comment on the food.\n\nThe bar is also nice and dark which I dig....\n\nOne downside, no cell service! It's like a black hole, I remember because I had to check-in from the lobby. Free Wifi would definitely be appreciated, you could only partake if you were a guest.", "author": "Nikki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "simply put, i love this place. \ngreat food, reasonable prices, bangin' drinks, and friendly people. \nhell yeah!", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-12", "description": "Ridiculous. Write down everything you would want in a good restaurant, and play a drinking game where you have a $6 bottle of Amstel light (one of their 4-5 choices) every time you check one of them off. You will be completely sober by the end of your meal, if it shows up at all, unlike the manager who just won't leave the side of your table. In the worst way. How are they still a thing? Sheraton, what?!", "author": "Alex V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "I dined in this hotel restaurant once and had drinks at the bar a few times during my stay at the hotel.\n\nGreat happy hour, decent wine list, local beers on tap...i was happy! The restaurant \"Grubstake\" is gorgeous, but was empty on the nights that I stayed. They have a new chef, Ken Larsen, who was in the process of reworking the entire menu. I ordered the daily special for dinner, a incredible pumpkin ravioli with a butter cream sage sauce. I would definitely go back, and I'm sure it will be a popular spot for all of the attorneys that work in the area.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Grubstake is a-ok as the Yelp 3-star description indicates.  We wanted to have a large group dinner (14 people) and this turned out to be the best option in the MetroTech center area.  The hotel restaurant was pretty empty, so it was no problem to accommodate us, and we didn't feel bad about being a large group in other people's way.  The food was satisfactory and everyone seemed to find something they liked alright.  I ordered the tortellini with mushrooms and truffle oil and thought it was pretty decent.  Several people ordered the salmon and said it was fine too.", "author": "Sheila S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-11", "description": "We went here because we were staying at the hotel and want something convenient for dinner....poor choice, if we wanted convenience and average food we should just walk around the corner to Subway or McDonald for a lot less in price.\n\nWhat really disappointed us was the average-priced restaurant priced food for very below average (but not poor) quality.  We can do better it ourselves for less but we understand that we were away from home so could settle for less but this was not worth it.  \n\nThe bar area seemed cool enough but that was not what we came for.  The restaurant side was distinctly weaker.", "author": "Francis L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-21", "description": "Food was decent, but the service was HORRIBLE, which made the food taste not so good. Had to grab our own menus, asked numerous times for our first round of water, a table of 16 got their water before we got ours.  The server didnt know what kind of soup they had, she said it was tomato soup so a friend ordered it and it was cold- gazpacho! Theres a difference between tomato soup and gazpacho! Fail. Three of us ordered med-well burgers, one came out rare so she sent it back.  She didnt get her burger till after we already paid for the bill! We told them to cancel it....ugh. Pretty positive they took one piece of romaine lettuce and cut it into three pieces....friend got the top, I got the middle and the other friend got the bottom. Never got any of the dipping sauces I asked for, nor did the server ever come back to the table to check on us after we got our food. For such a decent hotel and nice looking restaurant, you would think they would have top notch service....definitely lacking in that area.\nIf we didn't have 50% off coupons for this restaurant I would've complained about.....everything,  but sometimes it just isnt worth it. If you can, just order takeout from somewhere else.", "author": "Celia Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-29", "description": "Absolutely the worst dining experience I have ever had.  Over an hour to get drinks for half our party.  Took three requests and 45 minutes of waiting just to get a glass of water on one of the hottest days of the year 7/22/11.  Complained to manager but it only got worse.  All our family was in town for brother's wedding.  This evening things went terribly wrong- food did not even match description on menu - chef, manager and witer only offered lame excuses.  NEVER EVER EAT HERE!!!", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-27", "description": "Do yourself a favor \u0026 don't go here; the food was very, very slow in coming \u0026 when It did I didn't get what I ordered, and my friend's steak and baked potato were cold. By they time they gave me the right one, my friend was nearly done with his entree. And it wasn't anything special. As a compensation I was given a glass of wine on the house, but he wasn't given one, which we both thought was very rude.  The salad dressing came when we were half way through with our salad. We both had to ask several times for the ice cream we ordered which also took a very long time to come. In fact we had to ask several times for everything---even the check!\n\nJust skip this place", "author": "Linda L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-01", "description": "Went to Grubstake three times and all three times something was \"off\".  First time I went they did not have any wine that they had in the wine list, second time they messed up the sides with my Salmon- neither thing was that big of a deal.  The third time I ordered a Pizza at the bar , well the bill had me charged an extra 4 dollars, again no biggie, but the hoops I had to go through to get the $4 off the bill was ridiculous.  They run with \"the customers always wrong\" mentality.  There were two pizzas one on the bar menu and one on the dinner menu- I just ordered pizza and the bartender didn't ask which one.  Well they tried to tell me the one I got was from the dinner menu and the bar menu one would be far smaller - ok fine, but the dinner menu had a lovely description of tomato, mozzarella, and basil- so I'm thinking then that would be more gourmet- nope my pizza was awful and soggy and had not been in the same room as basil never mind have any on it.  after I ate about half and finally addressed the cost the waitress was literally playing tug of war with me and the pizza ( like she was going to take it away from me,  very odd).  When the manager came over he asked me \"did you eat it all.\" I didn't but why is that relevant?   I'm pretty sure if I had he would have told me that clearly I wanted that one, so part of me wishes I said yes, just to see what he would have said.\nThe kicker though that evening was a gentleman dining solo at the bar that had ordered an appetizer that was labeled tapas.... The man did not like what he was served, and it clearly wasn't what he expected.  I thought it looked like a tapas dish but who am I to say what his expecatation should be.  I think the management did offer him something else after a back and forth discussion but it didn't end there- the manager decided to google \"tapas\" and read the definition to the customer just to prove the customer was wrong.   Awful awful service and the service is soooo slow.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-28", "description": "Food leaves much to be desired. Had a Filet with broccoli and spinach. Came out lukewarm at best. There was a chopped steak quality to the meat that was a bit off putting. For desert the server recommended the brownie a la mode and then came back to say they were out of brownies. She could only offer ice cream, creme brûlée and cheesecake. She mentioned that they ran out the brownies the day before which means they are not fresh everyday. Crazy.", "author": "Jeffrey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "good selection. i recommend the tortellini and warm spinach salad with bacon.", "author": "Kristin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "I loved the food at the restaurant. OMGosh it was so good. The food was great. The steak was phenomenal. The Chef Kenneth Larsen is great!", "author": "Bisi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "Service was poor, the waiter took forever to return to our table after seating us. One of the people seated next to us got up and left after waiting over 40 minutes for his food with little empathy from the wait staff. The food was decent, nothing special.", "author": "Asita G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Good food and service. Waiter had trouble understanding my drink order so Manager came to clarify. My Bourbon Manhattan \"up and sweet\" was perfection. Manager was very chatty almost hovering.  My only issue was when he recommended the most expensive ($14) glass of wine for \"that particular dish\", which was a roast beef  sandwich.", "author": "Steve R."}], "servesCuisine": "Food", "priceRange": "$11-30", "name": "Grubstake", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "228 Duffield St\nSheraton", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zcQcR9IFlhE_lF--pGwWoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188551900"}