{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Delicious!! You must get the crisps, so addicting, I could have had another order! My husband and I shared the pastrami spiced petite pork loin and it was delicious. However it's served medium so make sure you state if you need it more well done. Luckily the chef had no problem cooking my portion a little longer, which still came out tasty. My husband loves the zero hour drink which is refreshing and spicy at the same time. This place is worth a visit!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "I loved this spot; we had spicy Bloody Mary's- that were made perfectly, the bacon tasting, baked eggs with chorizo and manchego and the avocado, tomato and mozzarella omelette.  I'd order it all again but the baked eggs were AMAZING.  Order that and a Bloody Mary and you won't be sorry!", "author": "Allie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "My girlfriend and came here for our anniversary. The staff was extremely accommodating and knowledgeable. The atmosphere is mellow and really romantic. I can't wait to come back in the winter months to sit by the fire. They have plenty of vegetarian selections and even options for vegan meals.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Brrr freezing cold outside and came here to meet some cool kids over some tasty cocktails: the Clover Club never disappoints! The cocktail menu is almost on the overwhelming side, but there is something there for everyone and if your friends are nice, then you get to try even more concoctions that you had imagined!\n\nThe decor is lovely, the people watching is great and you cannot beat the location. Great for a pre-dinner drink or a late evening drink to push you over the edge between distinguished dinner guest to hilarious dinner partner! Clover Club, you are my fave drinking hole on Smith St!", "author": "Janine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Cocktails are always on point and the food is as well prepared as their drinks! I've had the duck fat chips, steak toast, Mac and cheese etc etc and think is on my list of top venues to eat in the area. You NEED to have the Mac and cheese with the bacon. Great vibes too!", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "I've loved every cocktail I've tried at this place, and I've tried many over the years. Very pleasant space, airy and open in the summer, cosy and comfortably dark in the winter; good and attentive service, but servers don't get too in-your-face and will leave you alone to chat with your friends for as long as you feel like it. The drinks menu is a great selection, and if you request something off the menu the bartenders will do their very best to produce exactly what you've asked for. (They make their own house bitters for some cocktails, which is probably why I haven't quite been able to recreate Tokyo Drift at home.)  \n\nThe food is quickly prepared and delicious. I'd recommend you order the crisps even if you're not hungry, because they're made with duck fat and served with truffle cream. Excellent cheese plates and salads, and their lamb burger is perfectly cooked every time. At brunch, try their fantastic soft scramble, baked eggs, or potato hash, and get bread pudding for the table - it's exquisite. \n\nAmazing place, one of my favorites in Brooklyn, and a good choice whether I'm meeting just one friend for drinks or going out with a group for a meal (but reservations are always recommended - it's a popular spot for a reason).", "author": "L M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "I've been in here a couple of times, the most recent was for my brother in laws birthday in early October. While we had made reservations the seating was a bit cramped for a group our size. Service was pretty good throughout the night and I think everyone really enjoyed all the food and drinks. I don't specifically remember the cocktail I had as I told my girlfriend to order one for me since the menu was so overwhelming but it was delicious. Food wise the crisps are a must have snack, they're delicious by themselves and the truffle cream kick the flavor up another notch. The oysters were solid, mac and cheese was a huge hit, steak tartare was just ok, and the rock shrimp seemed to have been enjoyed. I don't think I would order the tartare again but everything else is definitely worth having.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "I've been coming here for both brunch and evening cocktails for a little while now, and it's always fantastic. \n\nFor brunch, get the hash with ham and poached eggs. It's unbelievable. They also have an amazing cocktail menu, there's a whiskey drink with kumquats that I could probably drink 10 of. Favorite bartender is Jelani. Very attentive and informative. \n\nHighly recommend this place!", "author": "Leah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Probably the nicest, classiest bar in my neighborhood. This isn't just your typical bar, this is a mixology bar with really awesome, extremely well-crafted cocktails. Sister to Flatiron Lounge and Pegu, this place has a great classic vintage feel to it.  \n\nI honestly never get the same cocktail twice, because I know I can try something new each time and it's going to be good. The people that work at the place are always really nice, even when they are busy. Some afternoons they have a live band playing, which is pretty neat.  Also has a gorgeous back room with a couches and a fireplace.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "I came to dinner with my bestie on a Monday night following a Yelp event that was held fairly close by. The ambiance at Clover Club is lovely, all of the furniture and decor is a dark, wood finish, almost like a 1920s-30s library meets pub feel, quite speak-easy-ish interior. There are little tables set up in the front, and a nice sized bar if you continue walking toward the back. Clover club offers a very classic, Gatsby era feel. I love the open doors overlooking the street as you dine at the small tables. Shout out to the pet owner who let his dog take a stinky and prolonged  s**t right in front of the door in view of everyone dining, then left it there in front of the door where three people stepped in it with heels, you da real MVP. \n\nThe hostess was phenomenal, very charismatic and efficient. Our waitress? I think they wrangled her out of her usual day job twenty minutes after we were seated and were like, \"You're a waitress for these people now, OK?\" This was a Monday night, 4-6 people in total were dining and we had to wait a half hour before she checked in on us to order. She came over to our table and said not a word. No how are you, no can I take your order, nothing! So awkward! So, we just began ordering. She looked at us blankly, mumbled a few items back to us to confirm, and scurried away. When we got our food, she never checked on us once OR ANYONE ELSE. She just completely vanished, we had to wait forever to get a check too! WEIRDO. Every time we saw her she never talked! Just stood there!\n\nFood: Food was BANGIN! Does anyone say bangin' anymore? Maybe I'm the weirdo now. We got the mac and cheese which, although a bit hard, was excellent, SO CHEESY, and filling. Definitely an upscale mac and cheese. The crispy rock shrimp was excellent and was a large sized portion, easy to split! The crostini with burrata was pretty good. I'm used to burrata just being served plain, so to have it smeared on bread with some peas, mint, etc. was different and yummy. The fried oysters were great, almost like a calamari with pesto, delishhh. My favorite? The crisps! Oh lord, one of the finest snacks to touch my palate...and I am a HUGE snack fan! Homemade potato chips tossed in duck fat with a side of truffle creme sauce...heaven on earth. You can taste all of the flavors and they work in the most amazing way together. I've had duck fat fries before, tasted no different than regular fries. These chips with the sauce? Simply the best. We tried the Gold Coast drink, which of course took 20 minutes to get, our poor hostess had to get them because our waitress was probably off being awkward somewhere. Gold Coast drinks were beautiful. The taste? OK, a bit strong and tough to drink...nothing I'd order again. Drink menu was interesting, again seemed very Gatsby/1920s speakeasy themed. Unsure if I'd come back again, maybe if I was in the area.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "The Drinks are great the bartenders do things which i have never seen the before. I would skip the dessert and just drink tasty cocktails. This is def one of the best drink spots in Brooklyn.", "author": "Igor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Wow!!! The cocktails were a beautiful compliment to a beautiful location, supper friendly staff and a cool day.", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Clover is my wife's and my regular haunt for a decompressing drink after work or a late-brunch-boozily-drifting-into-an-early-dinner.  Even from a distance in a heavy fog - you couldn't mistake us for a pair of hipsters. Which is to say - I can't speak about what it's like to hit Clover on a Saturday night at 9pm for a few drinks. With that caveat in mind, read on.\n\nFirst, I have to applaud their choice of bar-stools. It seems like every other bar I can think of has stools designed to fit the rears of 12 year old gymnasts. Clover has wide, plush stools that you can sit on comfortably for hours. Kudos. \n\nBetween my wife and myself, we've tried just about every item on the brunch and seasonally-changing drink menus. The food and mixed drinks are uniformly top-notch. Yes, they're expensive but they are generally worth it. If you are looking for a good value on something savory try the duck-fat crisps, the deviled eggs (comes in 3 or 4 styles), and/or the bacon tasting. As with the deviled eggs, you get a selection of bacon (pepper, maple, and duck) each on its own wedge of nice, crunchy bread. Yes, you read that right - duck bacon. If you are thinking 'duck' and 'bacon' don't go together... you are so very, very wrong. Hint for new disciples of duck bacon: the Egg Sandwich on the brunch menu gives you the option of adding bacon - including duck bacon - on your sammich. Do it. Make it quack.\n\nThe drinks, as stated before, are top-shelf... from the eponymous 'Clover Club' to the slap-your-mama 'Pineapple Julep'. But the thing that sets Clover apart for me is the staff. Most are quite friendly and it's pretty easy to get on a first name basis with a lot of them. The bartenders are skilled and several have been favorably mentioned in local periodicals. In short, Julie (the owner) sets a high standard for her drink-slinging crew. The bartenders are knowledgeable and creative. I walked in, told my tender I don't like scotch and I wanted him to change my mind. Three drinks later (two of which weren't on the menu) he convinced me that there is a place for scotch in my world. Another time, we were eating dessert and I told 'our guy' that I wanted something that complimented their tasty bread pudding. I don't know how he managed to build a drink that tasted almost exactly like my dessert with a complementary boozy kick, but it was phenomenal. You don't see that level of skill every day.\n\nI've only got one minor complaint and it's not the price of my bar bill. It's a personal preference but... I like bartenders to be approachable, engaging, and willing to chat a little bit when they aren't busy. Most of the bartenders at Clover Club are great but there is one gal that won't crack a smile or say much more than \"what will you have?\" That's a bit of a let-down in the otherwise stellar service. And my wife and I have cut more than one visit short because of it.\n\nSo, if it hasn't become apparent, I think the Clover Club is a solid drinking and eating experience. If you go, leave the two seats in the elbow of the main bar empty... my wife and I have dibs on them. :)\n\nRecommendations:\n1. Sit at the bar and chat up your bartender. He's probably just as interesting as your date. And, if you pick the right day, you might find yourself rubbing elbows with Dave Wondrich.\n2. Ask about the soup of the day. The chef does some amazing ones.\n3. Duck Bacon - 'nuff said.\n4. The weekend brunch crowd comes in waves. If you want a seat at the bar - and you should - show up around 2:30 to 3pm. That is usually a lull period and gives you an hour to order off the brunch menu (which ends at 4pm). The snacks menu is available all day but the dinner menu kicks in at 5pm. Plan accordingly.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "Happy hour is a must. It is a pleasure to be at the bar with a great mixologist. There is no need for a Bar rescue here!! The setting here extends far beyond the bar. Seating is spacious and accommodating to all parties and there is a private room for any party. \nThis place says Manhattan but its Brooklyn at its best.  Readers beware the items on the menu will suffice any hunger. If you dare try the pulled pork minis and the Mac n cheese with bacon\nYou will keep coming back \nPeriod", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Brunch and drinks review\n\nWe accidentally stumbled upon this place after our usual brunch place next door was too crowded, and haven't looked back since. This lounge has a pretty cool vibe with the exposed bricks, dark wood panelling, tufted leather seating, and the classic light fixtures.  The first time we came here we sat at the bar, and got to see the bartenders work their magic. The bartenders here are amazing - knowledgeable about the drinks and skillful at making them. My favorite drink here is *LOG CABIN*, and taste just as delicious every time I've been there. The *HUEVOS RANCHEROS* here is definitely an all time favorite with a hard taco base that adds a little bit of crunch and well seasoned beans. The service is great every time from bartenders and servers, with an exception of cold hostesses. Definitely recommend!", "author": "Dee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "This review is based off of my third visit. COCKTAILS HERE ARE ON FIRE. Choose wisely and read the descriptions. We shared the steak toast, lobster risotto, fried chicken, and lamb burger. All food and cocktails were an A+", "author": "R J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "This is a great place for cocktails, with a classy vibe. It had been my favorite bar in the neighborhood ( when I feel like spending $12 on a drink) but lately the snootiness factor has increased. I recently went for a friends wedding after party in the back room ( which has a really nice atmosphere..dim lighting, sleek decor) and felt like we got some attitude from the bartender when we were asking questions about the drinks. We were the first ones there so he wasn't busy or occupied yet. I had the lamb burger for the second time and it was too salty to eat.\n\nThis past week I was excited to take advantage of the NYC cocktail week special ($20 bux for 2 cocktails and an appetizer) and was excited to introduce my good friend to this place. I checked the NYC cocktail website, the Clover Club website, and read about it in Time Out New York and the only restriction was that it wasn't valid on the weekend. Upon arriving I asked about the special before being seated and got a lot of attitude. He said , well that depends on what time it is, if it is after 7 and before 10, then, no. He doesn't know what time it is? We should have left but had already walked out of our way. \n\nWe stayed and ordered some food and beers and the pulled pork was tasty but of course super tiny. I feel like I am not returning here. After you have been here a few times it loses its charm, easy to get over when there are so many other bars in the area. drinks are great but overpriced and they shouldn't serve food.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Cute, hip bar with a fireplace and handcrafted cocktails. Apparently there's food as well, which I'm dying to try. But for the drinks alone it's worth a visit.\n\nPrices are a little steep, but everything is made with care so I understand. Cocktails are around $13-15, with beers at $7.\n\nIt's a good date spot, very classy and low-key. Will have to return!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Terrible service. Not even sure if we had a waiter. After being seated and waiting for 10min to even be greeted The host ended up serving us for the most part. And we continued to be neglected for most of our dining experience. Food was subpar. Ended up going here because the wait at Cafe Luluc was too long. Got the French toast and it was a bit too soggy and the bacon was extremely fatty.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "My friend and I came to Clover Club for dinner and a drink the other night after a Yelp event that was held up the block. When we first got to Clover Club, we were highly impressed by the store set-up, the decor, and the host. The place was lined with dark chestnut leather couches and small tables. As you kept walking deeper into the Clover Club, you found a bar set off to the side and back curtain that separated the lounge area. Definitely gave a high class vibe.\n\nWe were immediately seated right by the large open window frame in the front of the store, which was awesome to feel the new summer breeze and people-watch. Then, the wait began; we waited about 20 minutes before any waitress or waiter approached us. This was a little excessive being that the restaurant was not crowded (FYI, it was a Monday night). \n\nWhen the waitress finally approached us, we immediately ordered some small dishes for the table and a drink each. We ordered fried oysters, crisps, mac \u0026 cheese, rock shrimp and Gruyere cheese. All dishes were cooked to perfection and were quickly made and delivered by what i assume was a table runner. The crisps were our favorite, the sauce that they pair with the crisps is unforgettable. The fried oysters sit in their shell on top of a pesto-like sauce. All food is highly recommended! The gold rush drink we ordered, ehhh. Not so sure I would order that again. It was definitely a quality drink, but didn't fit my preference. The waitress did not check on us once throughout the meal, we had to track down another waitress in order to get another drink. The delay between the meal and the check was another 20 to 30 minutes.\n\nOverall, I would say to check this place out if you are in the neighborhood. Neighborhood is lovely and the Colver Club is definitely a great spot for a drink and some picky foods.", "author": "Amanda K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}