{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-29", "description": "Sunday brunch. Very disappointed. The cocktails were yummy and bartender was pleasant, but $11.00 for a brunch cocktail (not very strong) is ludicrous. The eggs were undercooked and portions were small. Waitress, and other staff, sweet but not attentive. 4 cocktails and 2 disappointing eggs dishes for $80.00. Dislike", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Clover is a beautiful space, with fine cocktails to suit the classic speakeasy feel. The drinks menu offers a nicely balanced variety, which is backed up with the staff's extensive back-catalog. The drinks themselves are beautifully executed and absolutely hold their own against their Manhattan cousins. The food menu packs enough punch to get you through an evening, if perhaps leaving to get dinner seems like too much of a shame (not that I've ever done that...) In a pleasant surprise, the atmosphere and fare stand up to daylight inspection - weekend brunch is a must.\n\nThe atmosphere is swish, yet relaxed. It is very well suited to solo or small-group cocktail appreciation - no, this is probably not the place to bring the office crew for Friday drinks. The music selection is fitting, if somewhat, er... consistent (possibly my own fault for going there so often, but it's getting a little groundhog day...) Service across the board is impeccable.\n\nOverall, a venue perfectly suited to whiling away an evening with excellent cocktails and conversation. Highly recommended.", "author": "Janine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I had two very pleasant experiences at Clover Club last week. At high-dollar cocktail bars, a lot of people overlook the fact that you can order beyond the menu, and that there is an entire body of knowledge that skilled bartenders like the ones at CC have that generally allows them to produce just about any reasonably canonical cocktail. The first day I was there, I ordered a tiki drink called the Nui Nui, which generally invites blank stares from even the most hardened bartenders. The bartender had said earlier he was a tiki aficionado, and not only did he know the drink, he made a beautiful, letter-perfect version, including a huge barber-pole strip of orange peel arranged ever so perfectly between the crushed ice and the glass. They are also perfectly willing to go with you if you ask for a drink they do not recognize (not everyone can know every drink), so they produced perfect versions of a Straits Sling and a Seelbach with a little research. Finally, I love to sit at a bar and watch bartenders work. I was amazed at their ability to construct three different cocktails at the same time without missing a beat. Their staff is incredibly talented, and friendly to boot. They are also happy to make drinks to spec, so when I ordered a stirred cocktail with a smoky scotch, I was presented with a delightful original with two kinds of scotch and applejack among other ingredients. Note that the drinks are pricey, but they are made with quality ingredients and are more like doubles you would get in other bars, so it kind of works out. If a drink served up works out to more than will fit in the appropriate glass, they will pour the rest of it into a flask nestled in a glass full of crushed ice to keep it cold. That is truly classy.", "author": "F Grant W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "I've been here twice for brunch, both times with the same friend. Both times she's ordered the Englander (steak \u0026 eggs), so obviously she likes it, and we've shared a side of cheese grits.\n\nThe first time we went, I ordered a special that was billed as house-made sausage, eggs, toast, and salad. Then the waitress came back with the sad news that they had run out of sausage, and she offered a choice of their three types of bacon instead. I asked which she'd recommend, and she suggested the duck bacon, as it's uncommon. That's an understatement. It was *awesome*. As my friend said, \"Who knew ducks wanted to grow up to be bacon?\" Holy wow, it was good. And a minute or so after my dish came, a man *also* brought a very small sausage patty--the last smidgen. \"The chef wanted you to try it,\" he said. It was nice, but nothing compared to the duck bacon.\n\nWe both ordered delicious, delicious cocktails on that occasion (mine was a French 75), and my friend got a second coffee--it's an individual French press pot, not a refill from a carafe, so she was, understandably, charged more. The bill therefore came out quite high for brunch; watch the drinks if you're trying to economize, duh.\n\nWhen we went more recently, I ordered the omelette, which was ricotta that day, and we eschewed the cocktails. We were just as happy with our food (well, almost--I missed my duck bacon) and much happier with the bill.\n\nBoth times the restaurant was uncrowded, with music at a volume that didn't interfere with conversation. Service was attentive without being obsequious. It's a pretty space, with lots of natural light toward the front.\n\nI've recommended Clover Club's brunch to friends and will definitely go again.", "author": "Jane A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "bangin.  if you only do one thing, come here hungover for brunch and get the pork and grits with a nice runny egg plus the bacon sampler (mmm so much protein to soak up the sugar).  if that and a bourbon bloody mary won't soothe your ails then we have nothing in common.  to top it off, order a green giant (might be off menu sometimes but they should have it) and hangover is officially cured.  i've had almost all of the cocktails on the menu (there are plenty) and can say they are all legit.", "author": "Paul W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-10", "description": "For the first time, I ate food at the Clover Club, a place that is really known for their cocktails. I love the atmosphere of this establishment, and their drinks are superb. Last weekend I had brunch and ordered the onion and asparagus tarte. It was pretty delicious, but too small for 9 dollars, however the server warned me that it was a petite meal. The French press coffee was very good with an original flavor that's hard to come across in most restaurants. What I didn't like was the service. They served the coffee without a spoon, sugar or milk. I was neglected for ten minutes and my coffee got cold. Finally I had to get up and find someone. The tables were way too small for food. Our plates were practically falling off the table, and I had to place my water in awkward places. I tired a bite of the lamb burger and I thought it was mediocre. I probably won't come back to CLover Club for food again - just for fancy drinks and a swanky atmosphere.", "author": "jennifer d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-12", "description": "my second visit here (during the tizzy tail-end of happy hour, mind you), while pleasantly reassuring, could not displace the bad taste left by my initial experience. after a long, hard day, several friends \u0026 i stepped into what we've all heard to be one of the best cocktail joints in new york with some of the most superlative concoctions around (shit, i've heard rave reviews from fellow bar-workers in toronto); instead of the classy, hospitable candor you'd expect from a watering hole that markets itself as upscale, our bartender seemed to do everything in her power to make us feel like we were inconveniencing her during the bar's dwindling open hours. i'm sure you had a long day, miss, but i just broke myself in half during back-to-back 12 hour shifts, including one at the park slope fair, at the bar i work for, \u0026 never once did i make a customer feel unwelcomed. tasty, inviting, absorbing drinks? sure. but there are cocktail bars just as formidable in new york that will actually accept your patronage with a smile.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "I've been to Clover Club about 5 times since it's opened.  The first time was wonderful.  We booked a seat in the back room and received excellent cocktails and attentive service.  Since then, things have gone a bit down hill.  While the drinks are still good, the service has suffered.  For example, the other night we had friends in from out of town.  After enjoying an excellent round of cocktails at Brooklyn Social, we decided to call Clover Club and see if they were still seating.  They said yes and we headed over despite the freezing cold weather.  However, once we got to the Bar, the host and bartender informed us that they were closing down for the night and were not receiving new parties.  This was poor form on their part since we had just called fifteen minutes earlier and confirmed they were still seating.  I'll give this place one more chance before I strike it off the list.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "The back room of the Clover Club makes me feel like I've been transported to about 1918, with its carved wood ceiling, fireplace, and antique divans (I try not to sit in the front, since the layout isn't very intimate, the tables are tiny, and the acoustics are loud). I've tried so many of the cocktails, but I always come back to the perfect martinis, which are served in tiny, curved cups, with the extra on the side, in a little glass flacon inside a bowl of ice. They go to your head very quickly, but in that sparkly, happy way a good martini does.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "and so begins a series of entries pertaining to that which is uniquely brooklyn.  on the eve of a federal holiday honouring trade unions and grilled meat, i boarded a plane to one of the nation's first capitals to reunite with a long-lost friend and close the chapter to a summer of rebuilding.  i'd been to new york a couple of times before, but never with a local, much less a beautiful and talented food/lifestyle journalist whom i last saw over ten years ago...oh the possibilities!  first things first, a stop at the clover club, gq's #4 stronghold, for a relaxing, air-conditioned beverage (did i mention it was sweltering after a long trek around the borough?)  my misogynistic viewpoints of female bartenders were tested here, and once again, i'd have to say that  i wasn't really convinced otherwise, but maybe because we were parked in a booth rather than the bar (let's just blame it on the proximity quality quotient).  when i asked for bartender's choice with gin, i got a negroni....somewhat uninspiring for such a wide leeway, and a namesake ingredient much less.  at least the crisps lifted my spirits, potato chips tossed in duck fat with a truffled crème fraîche.  ahhh, brooklyn, brooklyn, take me in.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-26", "description": "I've lived in the neighborhood for a while and, I must admit, I was really down on Clover Club when it first opened.  I saw the bouncer standing outside and thought it was some cheesy place that belonged in the village.  But we gave it a shot for birthday drinks a few months ago and I was really impressed.  For food, the small plates were at-least-decent, if not a bit over-priced, and the service was really good.   The drinks were great (although I confess pretty humble tastes) and the decor is the best part.  I met the owner and she was really nice too.  I'm still not sure why they have a bouncer, but don't let it dissuade you.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "Great place for a lite dinner/snacks and cocktails. Great date atmosphere - no insanely loud music like most bars. Lamb burger is a must, and the pulled pork sliders were also delicious. The only bad thing I can say is that our drinks took forever to arrive every time - scotch on the rocks, no fancy cocktails, but I guess they get backed up making them for others?", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "The baked eggs with truffle and leeks are incredible.  The cocktails are fantastic and so are the bar snacks.  Love this place.  Its a bit expensive to spend the whole night there but it is a great way to start one.", "author": "R S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Awesome bar.  Loved the Pimms Punch bowl.  Menu recommends to share between 4-6 people.  Take that advice.  I shared with just one other person and well...it was interesting.  It's so delicious you won't realize there's actually alcohol in it until it's too late.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-08", "description": "Seems like this place has seriously gone downhill. The drinks can be really good, but I had horrible, inattentive service recently. They got the food order wrong and half of what they served was inedible. Skip this place and head to Brooklyn Social, Prime Meats, or Frankie's instead.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "This place is so classy and I had great time... Phenomenal cocktails, delicious bread pudding, and fabulous decor. So glad I went.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-18", "description": "I went back here for the second time and i got the dessert (bread pudding) and  it tasted much different from how good it was a few months ago. it was UNBELIEVABLY SWEET i felt  like  i was dying out of thirst with every bite. Maybe it was a bad day with it being busy or there was a different chef making it i dunno.... but all i know it was horrible!!!!!", "author": "Angelica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-06", "description": "walked in... then out. can't tell you about the drinks although i wouldn't want to have one there now matter how good they were, and didn't. the place seems corporate. without a soul. What's with the giant CLOVER sign that you can see for a mile down the street - it has nothing to do with the interior -- or perhaps everything. The sign is so loud and obnoxious without consideration to any aesthetic principal supposedly created by the interior design that it just feels like you've been had. I don't want to feel like that in a bar. I want to feel like we're all in it together. This place obviously appeals to a lot of people, but then so did the movie, Titanic.  It's a place for the masses with a \"hook\". I don't like to feel hooked. I am not a fish.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "get a couch by the fireplace in back, or a table by the window, but only if it's snowing. eat some deviled eggs, and have a beautiful cocktail for me, and call it a life.", "author": "Anne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "I love this place.  The service is always great and it's totally unpretentious, plus I just tried the brunch and it was delicious -- the baked eggs with truffles and leeks were amazing, and the ricotta pancakes were super flavorful.  Perfect portion sizes too, and it's very cool that they bring a french press right to your table.  The prices are sometimes a little high, especially for brunch cocktails, but overall this place is lovely!", "author": "lucy l."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}