{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "I'm obsessed with this place...I've gone once a week for the past 6 months...the Mac and cheese, steak on toast, deviled eggs, fried oysters are all perfect...I've had just about everything on the menu and have no complaints...they have fun pink drinks which I can never remember the name of but lucky for me the waitress there knows...great staff and atmosphere...I have to try brunch!", "author": "Samantha Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "The best bar on Smith and quite possibly NY.", "author": "Sulekha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "We spent a Christmas Eve here, lounging on the loveseat by the fireplace in the back room. Beautiful interior with a 1930s/1940s feel.\n\nWe went through a number of cocktails, but our first choices, the Clover Club and the Major Moses, were most memorable because the blackberries in one and the raspberries in the other really made them seem like they were intended to be enjoyed and shared together.\n\n...not sure why everyone is obsessed with the chips, but they were fine. Worthwhile place.", "author": "Aaron W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "such good, good drinks. and a great place to grab one before you head out and about for the night - or just cozy up in this dark space and hang here with your lovah or friends. inventive cocktails with tequila and whisky, muddled, shaken, etc. or you can always get your standards done really well. \n\ngreat for groups if you can get there early enough or don't mind a little wait. \n\nbar snacks include deviled eggs, mixed nuts, cheese plate and other standard pubby style fare - although this is not a pub. you can also get entrees like fried chicken and a lamb burger. i didnt go for the food, only the drinks. perhaps another time...", "author": "Maia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "We came in for a late night bottle of wine and dessert. (Bread pudding anyone?? YUMMMM) I loved the decor and ambiance, and the service was friendly, with a smile. It was fairly crowded, but somehow we scored a booth on a saturday night. \n\nCocktail menu looked great!", "author": "Chantelle E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "Lots of brunch places along Smith St. and come Sunday morning the good ones all have lines down the sidewalk. Except this place, which even at Brunch Zero Hour -- 11am on Mothers Day -- is more than half empty. Don't know why, maybe because people think of it as more of a bar? Anyway, the brunch here is every bit as good as at Cafe Luluc or Apartment 138 or any of the other packed places up and down Smith St. Yet we got the swanky back room all to ourselves. \n\nAlmost all on the savory side and portion sides are moderate, which is all good as far as I am concerned, but yeah, if you want a trough of pancakes this is probably not your best bet. They're interesting too, which is not often the case with brunch. I especially recommend the smoked salmon. And a bloody mary, of course. Or several.", "author": "JW M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "Have been to the Clover on numerous occasions and have to say have been pleased with some nice cocktails however after waiting 2 hours at the bar, $66 in drinks and having the bartender dump a drink on one of my party they seated our party of 3 close to the door on a 20 degree night. As I saw another 4 top table opening up I ask if we could please have that one and was told no as they were going to seat 6 at it who had been waiting half as long as us. I asked to speak with the manager whose only solution was to buy us another round of drinks as if that's what we wanted or needed at that point. We ended up leaving without accepting. The feeling I got from the establishment was that they are so popular and were so busy they really could care less.  There are too many other places in NYC that are so friendly, accommodating and go out of their way to want your business to bother with Clover Club.", "author": "Steven B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Great drinks. Old Fashioned was delicious as were the small plates. My only complaint is that they were playing Latin Jazz vs. something like Frank Sinatra or Dean Martin. It kind of killed the vibe for me. Other than that it was great. Would definitely go back.", "author": "Micah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Smash of the Titans and African Queen were our favorite drinks. Pulled pork sliders and fried chicken was great. The ambience is really good in the evenings, it's dimly lit with dark furniture, makes everyone look a little better . Great place to hang out with a group as well as on a date. Get the back room if you are a big group, it's pretty awesome.", "author": "Ashish D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "This place has been my go to for years. Amazing drinks although cocktail list has got considerably smaller \u0026 less diverse than when it first opened. Food is great.  Devilled eggs delicious!  Only fall back is the service.  Really lacks there, so go with low expectations \u0026 sit at the bar instead of a table.", "author": "Nic G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "I went here last year for a birthday party one evening. I ordered the duck fat crisps (yum), olives, and a couple of beers. I tasted a couple of cocktails as well -- they were all delicious! Romantic (read: dimly lit) atmosphere -- accommodating staff. Had a great time. Go for the happy hour -- otherwise, it gets a little pricey.", "author": "Dina E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "Any drink with an ice cube the size of my fist is awesome in my book (considering the fact the drink I had was super super strong).  I loved the atmosphere of Clover Club!  The exposed brick and fireplace were very romantic and cozy but at the same time it was jumpin' on a weeknight.  Very crowded bar and a bit noisy but still enjoyable.  \n\nFor food, the mac n' cheese was great - bacon and garlic with baked Gruyere, um yes please!  The scallops were delicious as well - oily and salty, just the way I like them.  \n\nI regret not trying a more fruity cocktail.  I somehow thought there was grapefruit juice in the drink I ordered but no, no it was like 4 different types of alcohol on ice.  It was good but way too much for me to handle.  Considering I really like Lani Kai, Clover Club impressed me just as much. Keep up the good work Julie!", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Blech, what happened to Clover Club?  I went for a late brunch/escape from Atlantic Antic and figured it was a safe choice, as I'd had solid brunches, and great bloody mary's there before.  My bloody tasted only of tomato juice and the egg sandwich was a sad fried egg flung on to barely toasted white bread.  White bread?  Really guys?  And the aoli was mayo.  Nothing to make it aoli in sight.  Super disappointing.  Brunch is not hard andI was in desperate need of a brunch do-over after that!", "author": "Meredith K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "My husband and our good friends went out for drinks at Clover Club recently and had a great time. The cocktail menu is quite extensive and we had a great time picking out different ones to try. There were some clear favorites including the Barrymore Room, La Sonambula, and The Slope. \n\nWe also tried their olives and crisps. The crisps were so delicious we got another order. You can really taste the duck fat on the crisps and the truffle creme fraiche is really punchy and fun. \n\nThe atmosphere was a lot of fun here - it was comfortable but not too lounge-y and overall the service was decent. I would definitely recommend hitting up Clover Club if you're into fun cocktails.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "I'm seeing a lot of \"this place is crowded,\" and \"I had to wait 15 minutes for my drink,\" and \"$12 for a cocktail, are you serious?!\"  So I'm going to address these issues in my review.\n\nIT'S CROWDED\nYes, of course it's crowded. It is an immensely popular bar, staffed and run by big-name mixologists. Did you think you were the only person who wanted to drink here?\n\nI HAD TO WAIT 15 MINUTES FOR MY DRINK\nBartending and Mixology are not the same thing.\nWhen a bartender makes a whiskey ginger it takes about 15 seconds from start to finish, and the taste and proportion of whiskey-to-ginger-to-ice can vary greatly from drink to drink -- and that's OK, because it'll still be a perfectly fine whiskey ginger (FYI, I am not disparaging bartending. I am a bartender, and I am very proud of my particular skill set). \nWhen a mixologist makes a drink, they can easily spend five minutes per cocktail.  They use precise measurements, particular mixing methods, and specific glasses. They have to keep track of chemical reactions (really), how long the ice has been melting in the shaker, even what kind of ice they're using. They do this so that each drink they make is perfectly uniform.\nNow imagine you and your friend ordered two cocktails, that's probably about seven minutes of work before you see your drinks.  And remember, there are other people ordering drinks too. So, waiting 15 minutes for the cocktail server to return with your rum old fashioned isn't really so long.\n\n$12 FOR A COCKTAIL ARE YOU SERIOUS?!\nMixologists spend weeks and months crafting new recipes, and when they finally make it to the menu those drinks are made meticulously so that they arrive at your table exactly the way they're supposed to taste.\nThat $12 pays for the time spent creating the recipe (along with all the liquor and other ingredients used while doing so), the cup it came in, the ice machine, the rent on the bar, the electric bill, the chair you re sitting on... And let's not forget the various expensive ingredients in your drink, and the time it took for the bartender to make it.\nIf you think $12 is too much to ask for all that, then this is not the place for you.", "author": "Victoria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "This speak-easy-esque lounge was the perfect setting for a lovely, romantic, mysterious night in Brooklyn. As soon as I walked through the door, I was overcome with the dark woods, the little tables, and the general bubbling excitement of the patrons. Though it was crowded, we put our name on the list for a table and made our way to the bar. After puzzling over the cocktail menu and discussing the drinks, a lovely woman overheard us and suggested that I try a pear/champagne concoction that wasn't too sweet and wasn't too dry, but just right. It was love at first sip. \n\nEventually we got our table and ordered the house-made chips. There we sat, talking and tasting for a couple of hours until it was far past Cinderella's bedtime. When we finally decided to leave, I knew that I had found a true Brooklyn gem. I floated home on pear-infused champagne bubbles.", "author": "Jacky J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "Really awesome crafted drinks. More and more places like this are opening up all over Brooklyn but this one is a must do. I like their happy hour deals when they have them. They tend to have the during the Summer months. Obviously people love outdoor places when the weather is nice and this place has none of that, so they entice you with really good deals on their expensive (For Brooklyn) drinks. If your looking to snack, try the deviled eggs!", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "This is a cute bar with cute bartenders. I came here for the first time on a Saturday, hoping to get a nice drink in a chill place...and all my goals were met. Other than it being a bit crowded, I really enjoyed my experience.", "author": "Azizah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "This is one of the best cocktail lounges in the city, and possibly THE best in Brooklyn. It authentically reproduces the feel of a lounge from the 1920s-1940s with a stamped tin ceiling, bare lightbulbs, and cozy leather furniture. \n\nThe cocktails are excellent, too. They have a longer list of drinks than most lounges, spanning several pages and grouped by drink style. They tend to be more classic than cutting edge or trendy, but hey- there's a reason those drinks have stood the test of time and these bartenders do a great job of making them. They are also one of the few bars that makes Tiki cocktails now that PKNY is closed. \n\nAnd the best part: live jazz on Wednesday nights.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "Great Bar, lots of space inside, and wonderful cocktails.  It's as good as many of the best places in Manhattan, and the staff knows what they're doing.\n\nOne minor complaint is that when I asked for a bartender's choice I ended up with a standard Gimlet.  Note to staff: Maybe you should ask if people want a classic or something more contemporary?  I dunno, but I don't go to the high-end bars to seek out classic cocktails.  However when I made my desires more explicit, they delivered at the highest level!\n\nI would definitely come back here if I find myself in the neighborhood.", "author": "Chad T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}