{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "This place is so classy it made me wish I was wearing a fedora or a fur cape. The cocktail list is extensive and divided up by informational paragraphs about the origin of various cocktails, so you can learn while you get drunk! Learning is classy.\n\nI had a Gin Blossom, which was tart and sweet and floral and strong and delicious. It was served in a tiny little glass with an extra minature ice-bucket containing a miniature beaker of excess cocktail. Tiny ice buckets are classy.\n\nWe shared the 'steak on toast', which was just what it sounds like, but hella delicious. Toast is also classy.", "author": "Maddie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "I celebrated my 40th birthday at Clover Club, It was such a great choice! \nThe staff and managers, Christine and Susan,  were extremely accomodating and planned my event in an unusual stress free manner. The day of the event everything was set up perfectly, from the lighting in the back room to the pre ordered Punches. Our bar tender for the night, Ivy, was very patient and efficient. Drinks are delicious, innovative and some of them like \"the clover club\" classics.The food was also amazing. \nI have been here several times for some drinks and a bite, and I will continue to comeback because of the overal excellence of service, quality and ambience!\nThank you for an unforgetable birthday!!!", "author": "Dr. Cicero Sosa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-25", "description": "Bland food, inattentive service, incredibly long wait for meal to be served.\n\nCame here for a late Sunday brunch.  Given the lighter crowd, you would assume that service will be fast. WRONG.  We waited 25 minutes for our food, waitress was extremely inattentive - caught her chatting with friends at the bar more often than necessary.  \n\nWe were extremely annoyed by how long it took to receive our food and even more disappointed by the dishes. I had the Baked eggs with chorizo and manchego - the eggs were WAY too runny.  My husband had the pork and grits which he thought was completely bland.\n\nWith so many great options on Smith Street, we will NEVER come here again.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "I love me a cocktail. Especially when it's a beautifully hand-crafted cocktail that satiates and surprises all at once. Clover Club aims to do this, and they're also classy and charming, with a dash of slickness. \n\nWe were looking for a great drink before dinner, and Clover Club was very near our final destination. We were welcomed and handed menus right away, and I was impressed by not only the amount of different cocktails, but the specialty drinks available for a generous happy hour - and they weren't anything to pass up, either. They were fabulous, schmancy little drinks an none of them were more than $5. You can't beat that, especially in NYC. \n\nThe Hus ended up with a Plymouth gin Martini, which was served with half of it in a small glass and the other half in a caraffe over ice to keep it cool - such a nice touch. I asked for a Bee's Knees (gin, lemon juice and honey syrup), even though it wasn't on the menu. The bar man happily mixed it, and although I didn't specify which gin I wanted and probably should have, it was quite good. He offered to remake it with my preference (Hendricks), but I happily took it down and quite enjoyed it. Each drink cost around $13. \n\nThis is a lovely spot to go on a date, for a casual drink of even dinner. The space is warm and inviting, with an old-world feel to it that I love. The barmen are all impeccably dressed, trained, and mannered, and that makes me want to return. Well, that and those dreamy drinks.", "author": "Hilary H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "This review is for brunch. Sounds like cocktails and dinner are far better experiences, so I'd definitely be back to try what nighttime does for the place. But lunch/brunch wouldn't be an option again. \n\nWe stopped in because after walking past a few places on Smith that were suspiciously empty, we figured the crowd had to be right. While encountering a twinge of flustered 'tude from the front of house, we were seated within ten minutes. But that's where the waiting game began. \n\nGranted, the bar area was humming but it took somewhere between 10-15 minutes to get a glass of bubbly and while our food items hit the table within 30 minutes of ordering, the table next to us was losing the will to live as they waited and waited, eventually canceling an order and leaving. \n\nThe deviled eggs (four different 'styles') made a good accompaniment with drinks and the bacon tasting plate was luxurious without being overwhelming (maple bacon, regular -- although not particularly crispy bacon, and duck bacon served with a few slices of barely-toasted bread). People around us seemed to be tucking into far more extravagant egg dishes, which all looked fantastic. So all in all, food is not an issue here. Just a problem expediting.", "author": "Georgina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Took my parents and a few of my friends here for a good time tonight. We all enjoyed the macaroni and cheese (with bacon), lamb burger (best ever!) and the steak tartare. The bar was killing it with their seasonal offerings! They had this cocktail that was pumpkin inspired, and it was amazing! I tried the \"table talk\" which consisted of pecan infused rum and hazelnut liqueur, to name a few ingredients. Still not as good as the pumpkin cocktail, though.\n\nMichael Aranella and his band were playing live, and although I enjoyed his music, I didn't enjoy him shushing me.... Not my problem that the bar was already loud, there were tons of people inside, I was 2 drinks in, and I had to raise my voice so that my table of 6 could hear me. A bit asshole-ish, but whatevs.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "More than a tree grows in Brooklyn - this is a great place to strap on your booze bag!  Excellent craft cocktails and the food on Sunday was outstanding.  Worth a trip on the F.", "author": "Mr. And Mrs. J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "This is one of my favorite places in my neighborhood.  The decor is great, the drinks are good, and the food is on-point.  I usually just come here for drinks (I love any place that has mezcal, which is not that easy to find), but I decided to pop in for brunch one day with my family.  Aside from the service being a bit slow (which was understandable because there was a huge private party going on in the back room), everything was great.  I got this pork chop special which was delicious.  The pork chop was huge and cooked perfectly, and it was served over a yummy root mash and topped with a green pesto-type sauce.  This gargantuan chop was only $12!!  All of the other dishes my family ordered were also very good. I will have to return for dinner one night.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "I went to Clover Club on a blind-ish date on a Tuesday. Our neighbors apparently fell in love with my date and couldn't believe it was the first time we'd met. (read: apparently I come off as if I know everyone within 10 minutes?)\n\nWe didn't eat, but I had some awesome drinks. I had the Olympic Collins and made my date choose the second, the Port au Port.\n\nNext time I'll forgo the table and sit at the bar, to see if the bartender is willing to make me something from his/her own imagination.\n\nA must for anyone in Brooklyn. I'm ashamed it took me so long to go there.", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "Delicious cocktails! I went with a party of 5 for my birthday, everyone loved what they got. \n\nOnly downside, slow service. Not the fault of the waitress/waiter, they are just busy and a bit understaffed. Everyone was lovely though!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "The brunch cocktails here are crafted by a true artist. Please bring your visiting parents/cousins/school chums here instead of Junior's or wherever you were planning to take them.\n\nThe food is really scrumptious, but very much on the pricey side for the portions you get. I recommend the baked eggs with leeks and truffle for vegetarians.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "If i am to pick my favorite neighborhood bar, this would be it. Well, at least I can say I've probably been here most often.  It's served me well, through various first dates, girls' nights out, and casual afterwork get togethers.  The cocktails are perfectly balanced, beautifully presented, and always consistent. The bites are generally pretty tasty (the duck fat crisps with the truffle aioli, especially so)  Yeah, it's all sorts of fancy, but in a good way.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "Cool concept and set up but full of hipsters with snobby attitudes.  If you are with a large group find somewhere else. Not easy to just chill and with a large group (6+ people), it is too small and you can't stand at the tables.", "author": "Arianna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Cocktails are a lot like love. That first drink is magic. The second is intimate. The third is routine. A writer said that. \n\nClover Club is a bastion of sophistication in a neighborhood of tolerable but uninspired watering holes. To start, there is a calvary of comely hostesses, eager to keep your snifter brimful. The adornment is lavish, but not immodestly so. The bar is sufficiently stocked. The barkeep is likely to fulfill even the most imaginative of desires. \n\nI saw more than a few decanters of hootch only rumored to exist -- mere legends in the land from whence I traveled. An ancient bottle of rum believed to be bottled by a family of witches in the caves of the Cayman Islands. A Scottish malt whiskey that is said to have simultaneously incited and resolved a three year war between two Highland clans. \n\nI have hardly been known as a drinker of cocktails, but for Clover Club I have made an exception. I merrily await my next evening here, accompanied by the spirits so adored by men and beast alike.", "author": "Sean P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "A few years ago I visited Clover Club for a private party held in the back room and loved it, but I figured it was a bad idea to review a place on a specialty event held outside of the main establishment. I was well aware of their prowess as cocktail masters, but this weekend while searching for a place to have brunch I stumbled into Clover Club and was absolutely floored by not only the fact they had brunch but how amazingly delicious it was.  \n\nEverything from the coffee and tea, served in glassware, to the bacon tasting and especially the entree items were absolutely amazing. I had the Englander (a take on Eggs Benedict with hanger steak), and a potato cake that were both seasoned to perfection. I could not recommend this place more highly.", "author": "Frankie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "If I ever used the word \"swanky\" to describe a place (and I don't), it would be for Clover Club. You can say I usually am what they call a \"Manhattan snob\" - I rarely venture out to Brooklyn. I've lived in Manhattan almost a year and have been to Brooklyn twice besides going to Clover Club- both times involved meeting my friend who lives there. The only reason I went this time, (that too on a Wednesday!) was to try out some famous pizza place called Lucali. When we got there, however, it was closed for renovation. Having made the \"long trip\" to Brooklyn, I wasn't too happy. But after grabbing dinner at another Italian restaurant, the course of the evening changed.\n\nWe went stepped into Clover Club - rated as a place that serves the tastiest cocktails. I honestly expected it to be all right. However, the moment we entered, I was enchanted by the energetic vibe of this place. The main restaurant section was dark and had smooth classical music coming from a live band. As we walked further in, we entered a backroom that was a little brighter, softer, and had a warm crackling fireplace on the side. We cozied ourselves around it and enjoyed the hip old music (probably from 1920s? I don't really know). I definitely felt that men in feathered hats and women in black gloves (all in a non-hipster way) would fit right in. Overall you could not ask for a classier atmosphere.\n\nNormally skeptical of experimenting with cocktails (I usually stick to wine or a margarita) I ordered the Crystal Fall - and I am glad I did! Clover Club definitely does not have it's reputation of serving the tastiest cocktails in New York for nothing. Apparently they have mixologists who work hard at creating the best cocktails with enriching flavors. The bartenders spend a while making the cocktails to make sure everything about it is perfect, fresh ingredients, perfect proportions, exact preparation times and lovely presentation.\n\nMy Crystal Fall had its ice crushed beautifully, such that it really resembled \"Crystal Fall.\" It is made of cognac, rum and Palo Cortado sherry. While the concoction of 3 types of liquor made me skeptical, the flavors of ginger syrup, lemon juice, apple cider and Angostura bitters were such that I almost couldn't taste the alcohol!  My friend's cocktail, the Blackberry Fool, was even better with lemon, vanilla syrup, cream, blackberries and rose flower water - definitely recommend checking it out!\n\nOur extremely casual pizza evening turned out to be a super random and fun night out. Clover Club is great to hangout on the weekdays, on weekends I'm sure it would be more crowded, but just as fun. Clover Club has also converted me - definitely plan to check out more places in Brooklyn, as well as repeat this place and perhaps try all the different cocktails!", "author": "Prerna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "My boyfriend and I grabbed a drink at Clover Club after dining at Peter Luger Steak House.  The atmosphere is relaxing and hip.  As I looked around the bar, I noticed that every table had at at least one member wearing thick black rimmed glasses.\n\nThe drink menu is divided into nine categories, from sour-style swizzles to group-friendly punches.  Clover Club also offers small plates that range from fried oysters to steak over toast.  From looking around the room, the deviled eggs were quite popular.\n\nMy boyfriend first tried the Clover Club cocktail which was made with fresh egg whites, gin, and raspberry syrup.  We didn't love this drink.  It was almost too light, and because of this, the drink didn't have much flavor.  Although I don't remember what other drinks we ordered, they were tasty and smooth.\n\nIf you are in Brooklyn, this is a very fun bar to go to.  However, if you are in Manhattan, it is quite the trip to go here and there are probably bars just as good closer by.", "author": "Karyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "one of my favorite places in brooklyn with delicious cocktails and great food. the duck-fat fried crisps are to die for. the only downside is that it gets very crowded, but if you can snag the fireside seats, you will have a great experience!", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "I'm not quite sure how I ended up out here at midnight on a random Saturday night, but I was and it was nice to find a cocktail bar in NY that wasn't packed without a wait to get a table!  I wouldn't say the drinks are cheap, but there's a pretty extensive menu and you won't have trouble finding a drink down your alley.  \n\nNot really a destination spot, but if you're in the area and want a cocktail, this place should be at the top of your list.", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "Not vegan or vegetarian friendly.  Had to eat bread and nuts- those were good but I still was unimpressed with ambiance and drinks.", "author": "Lis F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}