{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I love this place. I really do. Absolutely everything on the menu from food to drinks to dessert is perfect. The small plates they offer are all wonderful in their own right and elevated to some degree. The crisps are one of the best sellers. Its basically French fries but its fried in duck fat. The deviled eggs are a personal favorite. I just had the bread pudding. I can honestly say it was the best bread pudding I've ever had in my life. Made with brioche, raisins, this wonderful warm maple syrup and a dollup of whipped butter on top to cut the richness of the syrup. Absolutely perfect. The drinks: well they are all good. This is a true speak easy with real mixology happening behind that beautiful bar. All the bartenders are dressed in vests and ties the lighting is dim. Truly a perfect place for a great drink.", "author": "Zaky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "Clover club is the perfect fancy-cocktail bar. (Although be sure to try Hotel Delmano in Williamsburg too. They are tied for first place in my heart).\n\nThey have a massive, expensive cocktail menu and I've never tried one I didn't like. \n\nA great place to bring friends visiting from out of town if you want to impress them with the delight that is fancy-foodie-Brooklyn drinks. An especially good night in my book starts at Clover Club and ends at Zombie hut. Nothing like going from $13 basil-infused flavor explosion in your mouth to $5 blue alcoholic slushie! Seriously, it's the best.", "author": "Emma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "What a great find, I can't believe I just stumbled on this place.  Space is charming.\nService was great, food was incredibly tasty. and who can say no to a bacon sampler platter? Prices were very reasonable.\nWas there for lunch/brunch and can't wait to go back!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-14", "description": "If you know me at all, you know that one of my favorite things is a drinking establishment that is evocative of the speakeasy; tin ceilings, low lights, jazz music, well-written cocktail lore on the menus... but most of all: a finely crafted cocktail. A thing of beauty. A work of art.  Sometimes classic is just what I'm looking for (sazerac, anyone?), but I adore the unique... the alchemy of a talented bartender. \n\nClover Club sure looks like it has the potential to excel in all of the above, but I've had better. It doesn't hold a candle to my favorite bars of this kind- Cure in New Orleans; Violet Hour in Chicago; and Manifesto in Kansas City. Read my review of Manifesto and you'll understand why it's possibly the best bar of 'em all. There's not an ounce of pretension. The cocktails are creative, top notch and the service is superb. \n\nAnd so, when you've had perfection, I can't help but draw comparisons and find when a similar type of venue falls short. Service was all but non existent. Our waitress, while very kind and apologetic, just couldn't handle the packed room on her own. I don't blame her, I blame management. In the span of an hour, I ordered one drink. If there was more attention to service, I would have been able to have ordered three.  I'll also mention that it was so loud in there, it killed the hush-hush vibe that is so awesome in places like Milk \u0026 Honey. My drink, the Auto Bahn Bahn looked promising with its cute name and stunning description. Side note: the person who created these menus deserves a ton of credit: I quote, \"Two hundred years ago, cocktails were a mixture of liquor, bitters, sugar and water-and that's all. More than two hundred years later, the meaning of the word \"cocktail\" has swollen to envelop any concoction we can think of that has booze in it. Conveniently, and history be damned, this gives us a category where we can park drinks that might fit into several of the other families of drinks, or maybe none at all.\" \n\nNice, right? There are several such beautifully described sections of the menu.\n\nBut let's get down to the nitty gritty: ingredients are rye, maraschino, absinthe and bitters. Drinkable, but ultimately a disappointment. I couldn't taste every ingredient; all I tasted was a sweet and fruity cocktail. Where was the absinthe? There wasn't a hint of it. \n\nAnd so, while I love the concept, beautiful menu and decor (that tile floor in the front is swoon-worthy), overall I was disappointed. In New York, three stars isn't AOK, it's \"average.\" I might give it another try, but I doubt I'd be compelled to return to Clover Club when there are so many other bars to choose from in the area, including Brooklyn Social which has a similar concept with a better vibe overall, in addition to superior cocktails.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "It's likely a tie, but these are at least the second best cocktails in NYC next to Lantern's Keep in mid-town. And it's BY FAR the coziest bar. Big winner. The deviled eggs were awesome too.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Great place to go if you want a utterly amazing cocktail you could only replicate if you knew how to smoke ice appropriately without having your freezer smell like hickory. I love this place for the simple fact that they make classy, cool drinks, without the stiff lip. Don't go if you want three cheap drinks, go if you want one delicious and satisfying one.\n\nI totally agree with one yelper who mentioned its a great place to bring out of towners.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "I want to give 5 stars on account of how much I enjoyed the space, the service and especially my drink, but giving 5 stars for a 1-time visit is a bit rash, so I give my enthusiastic 4 star review. \n\nIt was an overcast early evening, and I met my boyfriend and his dad here for a pre-dinner drink around 7pm on a Monday. They had nabbed a booth but there were plenty of tables, a few bar seats and the lounge in back seemed pleasantly subdued.\n\nMy order was taken in respectable time and I do think that my drink took a little while, but it was delicious. TRULY delicious. I had given my favorite speak-easy title to PDT until now, but this trumps it. I've had drinks on and off-menu at various speakeasies about town (Death\u0026Co, PDT, Employees Only, Mayahuel, etc.), and GASP - my favorite is in BROOKLYN? Well why not?\n\nMy drink - the Heights Cup - which comprises of rum and a house mix of various liquors - looked boring but was amazingly tasty with a pleasant layering of flavors. Sweet, slightly tart, all poured over a glass full of cute little ice cubes (I didn't upload a pic because it wasn't very exciting). My bf and his father both enjoyed their drinks, but I liked mine so much I wasn't too keen on letting them have some - I wanted it all to myself.\n\nOk so enough about that. So I get the dark, enclosed speakeasy thing, but really... does anything beat big walls of windows with the light filtering in? If you like cozying up to the bar, there's plenty of barstools - if you want a bit more privacy, go on to the back lounge with its plush sofas - and if you like to be able to hear yourself think, go to the much more open front room. Something for everyone :)\n\nAnd - although we didn't have the right crowd for it that night - they have a Pimm's punch. It's on my summer to-do list!", "author": "Chie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "A friend had been telling me about this place for a year before we actually made it there. And he was absolutely right - it is almost unspeakably incredible. \n\nWe went late one night. It was crowded, there was live music, and it had a rich, fun, classy atmosphere. Old-fashioned and classic, low lighting, lots of wood, and very much a feeling of the real thing. I might have seen some bow ties, and not of the hipster variety. \n\nThe \"improved whisky cocktail\" was basically everything I could hope for in a mixed drink: strong, not too sweet, substantial, highly drinkable. Did I mention strong? :) Really enjoyed reading through the rest of the cocktail menu, too. These people know what's up.\n\nWe went all out on the food, pairing the lamb burger with a side of Mac and Cheese. Heavenly. The kind of burger you could easily inhale without putting it down. Really, the only problem you'll have is trying to pace yourself.\n\nThe truth is I don't remember if we had dessert or experimented with other cocktails. We left that happy. Friendly and prompt service. Excellent atmosphere for late evening, but it would probably be a great time during the day too, especially on days when you're hoping \"late evening\" would just start already around 1 o'clock.", "author": "M G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "This place is a cool, hip watering hole with leather banquets and lots of tables and chairs for you and your friends to sit. I was there on a lovely Saturday night, and I appreciate that the bar was full, but it was civilized -- not jam-packed and impossible to navigate through the space.\n\nIn addition to the beautiful drinks, they serve food. Refined versions of pulled pork sliders w/ chips and mac 'n' cheese are recommended.\n\nLots of young, stylish folks sitting and sipping their fancy cocktails. For folks in their mid-20s and up who are tired of having drunk college kids or ridiculous uber-hipsters decked out in American Apparel spilling drinks on their shoes. Two thumbs up!", "author": "Laura Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "I've been here before for drinks, but being a vegetarian I hadn't eaten here since the menu is really meat-heavy. Went for brunch on 10/27 and was really impressed. Got there at about 11:30, and was seated right away at a small table near the hostess station. We overheard others trying to get a table and it was over an hour wait. \nThe food was really good. I had the scrambled eggs with mushrooms and this really amazing beet, Brussels sprouts, and carrot hash. It was a little pricey, but the food is good.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "This is how I first became familiar with Julie Reiner. I came here when my brother was visiting town one time and wanting to give him more experiences he can categorize as 'love' in his 'love-hate relationship with NY', we trekked down to Brooklyn, had dinner in one of the Smith St. hang-outs and then came here for drinks and live jazz.\n\nAtmosphere \u0026 Appearance: 5 stars. Old school furnishings. I like. In the summer they open up the front and the atmosphere is fairly casual. But come sundown, lights are dimmed and if you're here on live jazz night, then it's perfect for a romantic evening. I also love the lamps!\n\nDrinks \u0026 Food: 5 stars! Since I've read a lot about their cocktails I was intent on trying out several different cocktails but I tried the Pedro's Martinez and knew I found my match. It's a twist on the classic using Pedro Ximenez, a sweet wine I've been in love with ever since my trip to Barcelona. Suffice it to say that if I lived in the neighborhood, I'd be a regular at this bar just for this cocktail. My brother was very happy with his drinks also. And even though we had already had dinner I had to try their Brioche bread pudding with Bourbon caramel sauce and currants. So good!\n\nAccessibility: 4 stars. Brooklyn's a bit far for me. But getting in wasn't a problem at all even on jazz night.", "author": "Ryna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-01", "description": "The drinks were delicious, but the host spilled water down the back of one member of our party.  What did the staff do to make up for it?  Nothing.  Not even covering the cost of the single drink  of the person who got wet (in a group that ordered 6).  Hospitality 101 would dictate better.", "author": "Susanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "You can't go wrong with Clover Club. This is my favorite brunch spot in Carroll Gardens. Try their Bacon Sampler - 3 types of bacon which are Pepper Bacon, Duck Bacon and my favorite Maple Bacon. They are cooked just right. I hope you try the Englander. YUM! The mixiologist make great cocktails too. \n\nI love the decor too. It's very classy and old school elegant. This spot is great for romantic dates and a get together with friends. Whenever I'm there, the clients keep their talking volume to an \"indoor voice\" mode. On the contrary to the poster below, my experience here is never too noisy. So I guess it depends when you go there.", "author": "Minty N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "One of my go to brunch locations on Smith Street for two main reasons: the Bloody Mary's are incredible and you can get a bacon sampler that comes with three types of bacon on prices of bread. Yes, that is pretty much all I need to be happy for brunch, and if you eat meat and drink alcohol that is all you should need as well.  The bread pudding is also wonderful. I love the egg sandwich and the baked eggs. \n\nMy only issue is that the portions are a bit small.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "Had a great time.. came in without a reservation... had a few drinks @ the bar (everything on the champagne cocktails section- all good).. then our table was ready.\n\nThere was live music on a weeknight and even the record after the band was very pleasant with the ambiance.\n\nHere is what we had:\nMAC \u0026 CHEESE - really good\nHOUSE CURED SCOTTISH SALMON - delicious - I'd have it for brunch\nSTEAK TARTARE - worth a try but not my #1 pick\nLAMB BURGER w/ GOAT CHEESE - great and it comes with CRISPS which are yummy-\nSTEAK OVER TOAST - the best thing on the menu - get it medium- we had 2 \nCHEESE PLATE- can't go wrong with cheese\nSTEAK AND ONION RINGS - same as the one on toast but the onion rings are out of this world.. and i normally hate onion rings.. these were soooo good!\n\nDrinks- I think all their beverages are solid choices... and the bartender will create one for you if you don't care for whats on the menu. But if you do try anything I highly recommend  AMBROSIA PUNCH and yes it is available in single serving.\n\nI will definitely be back again.", "author": "Maya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "The food was great. They make the best scrambled eggs and omelettes! I would recommend this place to everybody. Can't wait to come back. Really cool staff too :) Thanks guys!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Their reputation is well-deserved.  The cocktails are fantastic.  I like the food too, but it's really the drinks that are the star.  The layout is comfortable, particularly the bar area.  I prefer sitting there so I can chat with the bartender about cocktails - they are very knowledgeable, so along with getting good recommendations I can also learn about different cocktails just for my own edification (and future reference).", "author": "Tom H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "One of the best cocktail bars I have been to. It is surprisingly inexpensive too.  Every drink we got was on point!", "author": "Guillermo V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "3.5 stars.\n\nI like an educational menu. Clover Club, if I'd only discovered you when I was newer to cocktails, I wouldn't have had to frantically run to wikipedia to find the difference between a sour, fizz and a royale.\n\nPlease note people, learning is fun.\n\nThey do change their menu seasonally, but I think in general have a pretty well balanced menu though there are some misses. and I've also been recommended drinks off the menu when I was in the mood for a bourbon drink the summer and they didn't have one at that time.\n\nMy favourite is possibly the namesake cocktail, the clover club. To add berries to a drink and not have it taste like cough syrup is a big deal in itself, but this gin cocktail goes above and beyond to actually being quite delicious. slurp.\n\nThe food menu at the Clover Club does tend to get a meat heavy, so I usually make sure to get my fill before I get here, so as to not deal with premature intoxication. I mean, how many sweet potato fries can one eat, really. \n\nIn terms of its mixology success, I'd put Clover Club ahead of Flatiron Lounge, and surely behind Pegu Club, though the other two get far too crowded, especially on weekends. One thing sets is apart though. Walking into Clover Club however, is like walking into another era. Classic Cocktails, live jazz. They even have a vintage microphone!\n\nSurely worth a drop in. Go on a night when a jazz band is playing!", "author": "Madhuri I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "I feel like this place is hugely underrated. Most know of it as a trendy cocktail bar, but I love going here for dinner. The fried chicken dish is one of my favorites across the city, and great shareable noshes for a group.", "author": "Andy C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}