{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "Clover Club is widely regarded as one of the best cocktail bars in the entire city, and it's easy to see why. Their Smash of the Titans drink--only made when kumquats are in season--is incredible.\n\nLast night, I went out with a bunch of coworkers and tried their happy hour, which runs from 4-7. $4 beers, discounted snacks from $4-6, and $7 cocktails.\n\nLet's get one thing straight: one does not go to Clover Club and order beer or wine. They have an outstanding whiskey selection, but those cocktails...my god, the cocktails.\n\nEveryone ordered something different, but given my obsession with ginger, the Moscow Mule was an easy decision. You can't help but feel bad drinking one of their drinks--each sip feels like you're slowly destroying a piece of art. The house-infused ginger syrup and vodka, perfectly-balanced and topped with fresh lime and candied ginger? Sublime.\n\nCocktails regularly run $11-13, and they are COMPLETELY worth it.\n\nBtw, those 'crisps' fried in duck fat and tossed with truffle oil? Fantastic.\n\nThis place is pure perfection, and totally worth returning to all day, every day.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Absolute favorite cocktail bar in Brooklyn. The drinks are perfectly done - never too sweet, like cocktails are at so many craft cocktail bars. I had a special fall seasonal cocktail with gin and port wine and cinnamon and cranberry preserves and it's probably one of my favorite cocktails of all time.\n\nThe food is also amazing. The brussel sprouts will blow your mind, and the steak tartar is delicious. Service was friendly and attentive, but not overbearing.\n\nDefinitely recommend this place!", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "Just left this place. Girlfriend and I came in for brunch. We sat down placed our drink and food order.  Drinks came out and went down hill from there. Waited for the food literally over 40 mins.  When asked how much longer. The hostess told us a few more mins. Waitress who originally took our order came over to table and had completely just not place our order in. How does that happen ? The place was not busy at all.  Few tables at best.  Finally told her to forget the food and just give us the bill for the two drinks.  No apology was given or explanation.   Will not be coming back.", "author": "Julio G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "\"Who enters here leaves care behind, leaves sorrow behind, leaves petty envies and jealousies behind.\" That's the original Clover Club motto from 1882. A place with history is always great, but what's even greater is when the new edition serves fancy cocktails and food. I went to Clover Club in Cobble Hill, Brooklyn.\n\nUpon entering, you almost feel like you've entered a time warp to the 1920's. The lights are very dim, and the wall is lined with old school, plush, leather booth seating. The main focus is on the cocktails, but they have delicious food as well for snacks, or a meal. I started with a drink, the Bellevue Stratford (Mezcal, pear brandy, lemon, egg white, Peychaud's bitters). This was really great. The drink starts off light and a bit sweet, but has that nice, smokey finish from the Mezcal, taking away a bit of that sweetness to even tones out. \n\nTo eat, I ordered their House Cured Scottish Salmon (Scottish Salmon cured with beet and dill, served with potato cakes, poppy seed creme fraiche and herb salad). This was a delicious little dish. I would have preferred for the herb salad to be served more on the side, because the bold pink color of the salmon is so pretty, and you have to make your way through the salad first to see it. I guess it's one way of getting you to eat your veggies. However, the salad is very nice and I really liked the poppy seed creme fraiche dressing. It's a bit rich, and creamy, giving a nice contrast to the pepperiness of the herbs. The salmon was delicious, and it's generously topped on the crispy, savory potato cakes.", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "I had the baked eggs with truffle and leeks, and a side of the potato cakes. The truffle crème fraiche served with the potato cakes was very nice, and so was the salad alongside the baked eggs, but the potato cakes were just OK, and the eggs were WILDLY overcooked. The yolks were hard all the way through, and the whites were rubbery. It's really, really not hard to get baked eggs right, so this is pretty disappointing. I also see a couple other reviews from people who've said the doneness of their eggs was inconsistent. How on earth is anybody regularly screwing up *baked eggs*, for heaven's sake?", "author": "Cara F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Came for a private birthday party hosted in the back room which is a fantastic way to experience the wide array of cocktails and food offerings. The Clover Club gin concoction was by far my favorite, and the deviled eggs platter was an easy crowd pleaser. Service was exceptional with the manager coming into the space a few times to assure everyone was having a good time, and servers presenting trays with big smiles and grace despite the increasing sway of merrymakers. Decor was also on point, and the working fireplace was an excellent touch on a chilly night. Will be back!", "author": "Angel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Now this was a freakin' brunch.  The wild mushroom scramble is excellent - cooked to a T, as described - pillowy-soft scrambled eggs with incredibly flavorful mushrooms.  My friend got an omelette special with fresh, flavorful, seasonal root vegetables.  We also got the potato cakes as a side, and they were especially delightful - the truffled creme fraiche on the side simply amazing (unlike many things which advertise \"truffled,\" you could legitimately taste the truffle here)..\n\nTheir Mary mix is an excellent blend of spices - not overpowering, but not too mild.  I had previously tried variations of the Mary with Tequila and Bourbon, but never Gin.  I love my gin, but it seemed like an odd mix.  Get over any apprehensions you have and order yourself a Red Snapper with your brunch - I may well become a Gin Mary convert.  \n\nI had previously only been here for drinks, which was a great experience as well - quality cocktails - expensive, but definitely in the \"you get what you pay for\" category rather than the unfortunate, more common \"I have no choice but to pay $10+ for a \"cocktail\" because I live in the most vibrant city in the world\" category.  \n\nAll in all, a fine place - and essential for brunch.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Overall, it was very good. There is a large cocktail menu, and they are really well-made. There's something for everybody. The food menu is limited to small plates. We chose the crostinis, quinoa, and cheese plate. I thought the crostinis were good although lacked truffle flavor. The quinoa was pretty bland, but I liked avocado in it, and the cheese plate was really small. However, it was a really cool polenta type thing on the plate. Overall, I would come again for cocktails but probably not eat a meal.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "I'm going to give Clover Club 4 stars only because we came here for drinks and I don't want to give them 5 without trying the food (which looked good).\n\nWe got the Philadelphia punch bowl (so much better than a fishbowl) which is totally worth the cost. We each got 8 tea cups worth of drinks from the bowl. The bowl itself was presented well and it made the drinking experience better. FYI- the bowl packs a kick. Service was great and I hope I encounter a similar punch bowl in the city.", "author": "Laksen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "Clover Club is one of the classiest bars in Brooklyn.  Opened by Julie Reiner, one of the pioneers of craft cocktail culture in NYC, it follows in the capable footsteps of her Flatiron Lounge and Pegu Club, yet is distinct with its own style.\n\nThe space is handsome, elegant, and very tasteful.  They work that lovely old-fashioned vibe well, down to the refined attire of the staff.  Walk in and imagine yourself stepping back a century or so.\n\nThe hostess will greet you.  Have a seat at the long bar and interact with the capable bartending staff.  Or at the cushy banquettes facing the bar.  There are tables near the front, where the doors are thrown open in pleasant weather and you could sit al fresco.  There is also a lovely Parlor room with its own bar, plush couches, and a fireplace; not always open and sometimes closed for private parties.\n\nClover Club has notable hours for a cocktail lounge.  On most days of the week, it opens at noon and stays open until late.  On weekends, it opens even earlier to serve brunch, staying open again until late.  Weekdays through late evening are wonderful times to visit Clover Club; it is quiet and uncrowded; even better because they offer happy hour, where select cocktails, beers, wines, and foods are just a fraction of their usual price.  A reason to visit during prime hours are the live bands that play here on many late evenings without cover.\n\nIf you wonder why you'd visit a cocktail lounge in the middle of the day, their fine food menu can be convincing.  The food is New American and inventive, and the selection sufficiently diverse to offer something for everyone; the diversity had me doubtful they could execute it all well but I've seldom had anything I'd call a disappointment.  My favorite is the seasonal sweet pea crostini, which exemplifies their fresh ingredients and deft preparation.  High quality and seasonal, the food is well worth making a very good meal out of, obviating the need to eat elsewhere before arriving here for drinks.  Or order just a few as a fitting accompaniment to their remarkable cocktails.\n\nAnd those cocktails are truly the reason to be here.  The periodically changing cocktail menu is a pleasure to read.  Separated loosely into styles, each section provides a brief preamble.  Certain old styles like swizzles and cobblers are offered.  Their vegetable section gives some attention to a class of ingredient not often represented.  Like any respectable cocktail lounge, specific requests can be made, whether for classics or more obscure drinks of yore.\n\nClover Club's cocktails are among the best that NYC offers.  Balanced, delicious, and beautifully presented, these are just fantastic drinks.  They are worthy of the wait to create, and well worth the price.  I've tried the majority of their cocktail menu over multiple visits and they are reliably superb.  Combined with a gorgeous setting, excellent food, and extended hours, its unsurprising that Clover Club is a star cocktail destination in NYC, and one of my favorites to go to.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "I had a mule and also the brussel sprouts. A couple of my friends also ordered the chips (cooked in duck fat). \n\nBrussel sprouts were great. I was actually really hoping it would be like deep fried and really crunchy smothered in garlic butter sauce or something but instead had some onion thing. Which was pretty good I must say. The mule was definitely different. The ginger taste in it was super strong. I was not expecting that. It was almost on the spicy side. It was definitely interesting as mules go. \n\n\n\nI went there for happy hour and I saw a bunch of very fancy looking drinks being made. Unfortunately, I don't think they were on the happy hour deal.", "author": "Justine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "I really liked this place. Came after work around 6pm with a friend and we enjoyed they're bar menu and happy hour special prices. We tried the steak bruschetta, deviled eggs, and homemade chips. \nThe steak was okay! Kinda chewy. But everything else was super yummy. We recommend the chips, whatever that dip they gave us was to die for. Waitress was nice, a little intense but nice! They've got a really cool Brooklyn vibe going on.", "author": "Bree R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Zero Hour. After a long week of long hours it was finally Zero Hour. I asked for something to pick me up... and I got a sweet, sour, and spicy glass of goodness called Zero Hour. I have not yet eaten my buger and I already want to give this place five stars (full disclaimer: I do love this drink but I also really badly needed a drink so....) I also has some bread pudding. It was fantastic, topped with a generous helping of fresh whipped cream and caramel sauce.", "author": "Jacob U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "A friend and I were looking for a place to have a late brunch  on Sunday. So we decided to try this spot out...served brunch till 4pm. Food and drinks were really good.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "5 stars for excellent food, delicious drinks, and good service.  Place gets pretty packed during peak times but I got lucky getting seated right away.  I would suggest heading there by 8pm latest before the crowd hits as no reservations on Fri \u0026 Sat nights.\nI'd suggest the following dishes:\nRisotto\nSalmon\nSteak tartare\n\nGirly drinks I tried included the Barrymore Room and The Smashing Titans.  Hits on both!\n\nOverall feel is hipster.  Perfect for casual dates :)", "author": "Ivy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "The sun-kissed sour here is a must! After a Saturday afternoon in the sun at Brooklyn Bridge Park, my boyfriend and I were looking for a casual spot to get an early dinner and drinks around 5 o clock. Clover Club delivered. The sun-kissed sour is a refreshing mix of chili spiced tequila balanced out by juicy watermelon. We got the Brussels, Mac and Cheese, and Fried Chicken and it was all flavorful, rich, and delicious. Since it was my birthday, we also splurged for the chocolate cake which did not disappoint- nutty, chocolatey, moist cake with a peanut buttery sauce, topped off with macadamia ice cream. It was a summer meal we won't forget!", "author": "Abigail W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "I really enjoy this place. I've only been once, on a busy Saturday night, but the food and drink were fantastic. The atmosphere is very warm, because the place is absolutely beautiful: dark wood, black leather on the chairs -- just gorgeous. It's a little pricey for my taste, but worth it for what you're getting, the area, and how beautiful the entire place is.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Great place!! Looks gorgeous, chandeliers, a fire place in the back and strong drinks! The cheese plate was great beside the shortage of bread.\nChips and fries were on point along with my steak. I would definitely come back again. PS the drink \"The Slope\" comes with a little refill on the side :)", "author": "Tom R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Have only been here for drinks -- but what great drinks they are! We showed up around 10pm on a Saturday night and three stools stood empty at the well appointed bar - as if they were waiting for us.\n\nThe bar menu is a novel of deliciousness -- broken down by categories of drinks with descriptions of all ingredients. In front of me was a virtual labryinth of extracts, potions and infusions.\n\nBartender Ryan recommended The Island Time for my tart palette and it did not disappoint. bonus -- he artfully found a way to incorporate a miniature, preserved blowfish carcass into the drink. Long story but it was genius AND said blowfish now resides at the bar.\n\nWe stayed a while, drank a bit, and enjoyed the libations and atmosphere for a good part of the evening.", "author": "Robin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I've been here for a drink on my birthday last year.  My friend loves it, so while we were \"wasting time before the party\" we decided to shop, ergo, drink.  Oops. It was my birthday, I'm allowed to show up to the party drunk. \n\nWe had a nice time, it was busy for the afternoon.  I loved their tiny ice, I know it's weird, but it was a nice touch.  Cocktails were delish, service was nice, atmosphere was friendly. Win-win.", "author": "Stephanie M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}