{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "This swanky bar on Smith Street in Carrol Gardens tends to get crowded, so the key is to walk through the main room and grab a spot in the back space. \n\nThis area feels like a chic hunting lodge with dark wood decor. Was that an elk head on mounted on the wall? Not sure, maybe it was just a fireplace.  I can't remember as the pisco sours were taking their effect.  \nIn any case, the drink list is impressive and cocktail-lovers will be in heaven. \n\nBy the way, pisco sours - a drink claimed by both Peru and Chile - are not an easy concoction to master, but Mr. Bartender did a fantastic job, even topping the drink off with little hearts of bitters.\n\nFor what it's worth, I'm siding with the Peruvians in this controversy (after all, there is a town called Pisco there!) - and I'm definitely marking down Clover Club as a place to return.", "author": "andy t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "come here to feel like a fancy pants with their super snazzy cocktail list. usually i'm a straight bourbon guy, but the drinks here make me stray from my beliefs. every thing i've had here has been utterly fantastic.\n\noh yeah, they have food too. i suppose that's worth a mention because it's also worth the trip for any teetotalers out there. \n\nbasically, go to clover club to eat, drink, and be fancy. you won't regret it.", "author": "Austin A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "I went to a birthday here and it was a great time. $12 cocktails, min $9 glass of wine, but I think I chose all the wrong cocktails. The French Mar-Tiki cocktail tasted like basically juice with some rum, so that wasn't my favorite, nor was the Blush Baby, which tasted like cough syrup. I really dug the atmosphere though, so I'd go for another birthday, but I wouldn't take the time to venture there on my own from Manhattan.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "There's no loud music, and no televisions. The only food dishes are appetizers. And, there's a male bartender. If this isn't your style, then you wouldn't be able to appreciate the Clover Club for what it is, a refreshingly old-fashioned saloon.\n\nThe backroom has booth seating, coffee tables, padded chairs, a fireplace, and..., yes, yes, a second bar. The drink menu is extensive, and intriguing. You couldn't find recipies like this in your run-of-the-mill pub. One thing's for sure, they aren't shy about experimenting with spirits. This is a place where you go for good libations, good conversations, good conversations about good libations, etc...", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "Haha I love how Randolph T. is an asshole. He obviously knows nothing about the background of the people behind this establishment and has a misguided and sorry attempt at New York humor, trying to take shots at particular neighborhoods he knows nothing about. \n\nI'm glad that the people behind places like Pegu and Flatiron Lounge have come to Brooklyn because I think any area could always use a shot of upscale, old school verve. I think it's nicely situated on the busiest street the area so nobody misses a beat. \n\nI know that Nate works here, great bartender, really nice guy, the bartenders, excuse me mixologists (oh come on bartender is a great and better word than mixologist) know their stuff and it's just one of those places that gin is prevalent in, and should be. \n\nThe crowd is actually in a way a snobby good addition, if that's even possible. Sometimes you need a few fat wallets and possibly bloated egos to perk the place up and give the area a little more superficial snazz. \n\nAnd at the end of the day, I can still sit with a perfect cold Newcastle and notice the interesting conversation surrounding me. \n\nIt's a two part old school; first you walk in, and there are several tables on your right and the candlelit bar to your left with everything elegant and perfect pours all around. Move beyond the drape and there's another section of the bar plus some more room for canoodling. I think I just enjoy the fact that there are certain places where you feel like everyone should be dressed like they were in Howards End or something, more three piece suits, pocketwatches, an occasional monacle, bonnets, and people saying the word \"undergarment\" and \"indeed.\" Maybe that's stretching a bit too far back, but they really expanded on a Smith and Mills scenery with a little nicer brick and a more sultry atmosphere.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-08", "description": "We had just had a meat and cheese board and some drinks at The Jakewalk and weren't quite ready to head home yet, so we decided to check out Clover Club. I wasn't expecting much, because the name is exactly like something Holden Caulfield would have mocked, and there seems to be this huge glut of cocktail lounges lately and most of them are painfully lame. But whatever--we gave it a shot.\n\nThere was a stroller parked outside when we walked in. I didn't take it for a stroller kind of place and was rather surprised by this. There was a young family seated at a front table. A well-behaved little kid was sitting and coloring peacefully while a newborn slept in its mother's arms. I was wearing my baby discreetly in a sling and the hostess actually rolled her eyes at me when I took off my coat and revealed his sweet little face.\n\nAbout five minutes later, another couple with a baby came in. They brought their stroller inside and this time the hostess sighed loudly. As she handed us menus, she rudely commented, \"What is this, family night? Look at all those strollers!\"\n\nLook, when you design a space with aisles wide enough for strollers, you're gonna get strollers. You can counter this a bit by making the space cramped and zig-zagging, with lots of little steps and a dearth of ramps or stroller-friendly tables. If you're trying to design a faux old-timey cocktail lounge that is reminiscent of Prohibition-era Chicago, it's probably a good idea to keep it smallish and intimate, like a real speakeasy. Clover Club is far from intimate. In fact it's positively spacious, with high ceilings and huge tables and an extremely wide center aisle that is quite inviting to the stroller set.\n\nDon't want strollers? Don't make room for strollers.\n\nAnd please, if I'm sitting in your bar with a sleeping baby strapped to my chest, I probably hate strollers as much as you do--that's why he's in a cute, discreet little sling. But that doesn't mean I appreciate snark with my cocktail. Spare me your boring, misanthropic disgust and just get me my damn drink already.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-03", "description": "My boyfriend and I went to clover club for the firdt time several months ago and LOVED it. Our waitress was well-versed and friendly and we enjoyed several rounds of drinks and a few appetizers. \n\nFast forward to today. Boyfriend and I decided to stop in on out way to the cobble hill cinema. We walked to the bar, said hello, and ordered two cocktails. \n\nI thought it was curious when the bartender finished emptying the dishwasher before filling our order. Then I thought it was even weirder when he started an in-depth discussion of the kitchen's specials with other patrons, still no sign of our drinks. The last straw was when he started training a waitress on martini- making with his back turned to us. MAJOR DISS. \n\nWe left. I am now sitting in a bar down the street -- angry wade's -- on our second round of delish drinks. The bartender is friendly and, more importantly, understands that her job is to SERVE DRINKS. \n\nClover club FAIL.", "author": "Becca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "This place is a little fancy, but in a good way. It's also got a fabulous happy hour from 4-7 (hmm maybe it's 5-7) and I highly recommend it. It has THE BEST Moscow Mule you will ever have, hands down.", "author": "Rosie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "I feel like I'm just echoing the others here in saying how wonderful the cocktails were (extremely strong, so you get 3 drinks in 1). \n\nI had a great experience with the service, from the moment I walked in they were attentive and gave recommendations based on our tastes. Next time, I'll try the bar and the deviled eggs. The oysters on a half-shell were yummy, but only 6 for $14 way too pricey.", "author": "Justine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "This is definitely new school Brooklyn... and that might not be a bad thing. Great fru fru cocktails. I had some absinthe concoction and my buddy had some mixed tequila thing.\n\nDecor was understated chic - wood and brick. The back room, which I understand becomes a VIP area, has a separate bar and fireplace.\n\nAll well and good... but I won't go back for the ambiance or the drinks,,, I will go back for the food. I had baked eggs. Did I say baked eggs? I had a big bowl of cholesterol filled heaven! Man I need Lipitor.\n\nIf you like the trendy side of Carroll Gardens/Cobble Hill you will like the C Club.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "Having been sorely disappointed by Weather Up...and forced to drag my lazy cocktail loving ass all the way to Manhattan for fancy drinks...I was thrilled to discover that Clover Club totally lives up to my expectations of what a \"proper bar\" should be.  \n\nGreat cocktail list, knowledgeable and friendly bartenders (who don't take an eternity to make your drinks), totally reasonable prices, gorgeous space.  All this enthusiasm and I didn't even try the deviled eggs with bacon yet!!  I was afraid I would end up short circuiting from the bliss and my companion would have been left with the unpleasant task of dragging my cocktail \u0026 deviled egg laden body all the way up Smith street on a Wednesday night.  Not pretty.  Not pretty.\n\nAnyway, now everyone knows where to find me on weeknights.  :)", "author": "Joan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "As a bacon lover, I couldn't resist the bacon tasting. The duck bacon was by far my favorite, but the black pepper bacon and maple bacon were good too.\n\nThe baked eggs with truffle and leeks were fantastic. My husband got the baked eggs with chorizo and manchego, which he liked. But my eggs were almost hard-boiled, and his were pretty runny. The preparation should be more consistent or made-to-order.\n\nThe only thing I didn't enjoy was the orange juice, which was more like orange water and had three large ice cubes in it to make it even more watery.\n\nOverall, the service was friendly but slow. Definitely worth another shot.", "author": "Astrid V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "Clover Club is a charming ride back in time. Tim and I were there around 8 on a Sunday night and it was quiet--which was perfect because Billi Holiday was playing. We sat at the bar on the oversized barstools and read through the detailed menu. We peeked in the back room, which is generally reserved for private parties is beeeyyuutiful! \n\nClover Club is an old school cocktail club with perfectly poured drinks by adorable, friendly mixologists who are happy to school you on their concoctions. How did I not know that margarita (my favorite cocktail) means \"daisy\" (my favorite flower) in Spanish? Estupido!\n\nOwner Julie Reiner (of the Flatiron Lounge) chatted with us for quite some time about the Clover Club's drinks, decor and her overall vision. She's a woman with a plan and delivers it all (and then some) with the Clover Club.    \n\nThe drinks are very reasonable. If this bar was in Manhattan they'd each be five bucks more.  Every detail is a thoughtful one. All I'd ask is that they'd expand the food menu to include a vegetarian option (or three!). \n\nWe'll definitely be back when the weather chills. Clover Club's cozy feel (and working fireplace) will feel like heaven then.", "author": "Karin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-31", "description": "If you're in the mood for prohibition-era cocktails and killer appetizers, this is pretty much the only place to be in Brooklyn.\n\nThe drink menu is a tiny mixed-drink history lesson, and the atmosphere is chill and relaxing. The staff is incredibly attentive and friendly, and the service really couldn't be better.\n\nEveryone should ABSOLUTELY try the steak tartar... it goes down easy, especially with the \"improved whisky cocktail\".\n\nI would advise going during the week, though... the weekend crowds can get a little manhattan-y.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Ah Brooklyn, when I hang out with you, you never let me down! I spend 40+ hours a week (working) in this bourough, but never get to throw down proper on a fun time in its many 'hoods. (One night I'll be found passed out on the inbound F-train, just wait) \n\nClover Club embodies what strikes me as cool about Bklyn... good beer, cool people, unpretentious yet stylin, with just the right amount of gutteral class. But seriously... awesome beer. I must have asked the bartender five times who brews it. I can't remember anymore.\n\nClover Club, I'll be back to drink your beer, bask in your fireplace, and chat up your patrons!", "author": "Jon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "Sunday evening was probably the best time to go to Clover Club; it wasn't particularly crowded, and we managed to get one of the elevated booth tables in front of the bar after a short wait. It's a good place to watch the bartenders work their magic from afar. \n\nMy companions and I shared a punch ($42), which was good. However, the menu said it served 4-6... and I think it just satisfied us 3. I loved the punch bowl, cups, and ladle. \n\nThe food was really good as well, except the portion sizes were definitely small, considering the prices. \n\nThe decor was stunning, if not a little bare. The pendant lamps and sconces had beautiful etched glass, and the wood panelling definitely gave the inside a nice warmth. The wooden bar (supposedly moved from an old Philly bar) is by far the focal point - it's just gorgeous, with its detailing. \n\nOverall, it was a good experience. I'd definitely revisit this place for a cocktail or two, but I think I'd probably eat elsewhere.", "author": "Ingrid C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Classic 1950 - 1960's cocktail bar, Clover Club places as much detail in the drink as they do the place. From the \"wood panelling, vintage tiles, antique wall sconces and leather banquettes create the illusion of pre-war elegance.\" as Briana H. described, to perfectly crafted whiskey or gin cocktails. Definitely check this place out.", "author": "Isaiah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "Great drinks and a cozy atmosphere. (Dim lights, candles, wood paneled walls and faux tin ceilings)The drinks are really well mixed and presented beautifully but if they are going to serve drinks like that there needs to be enough bartenders on staff to make them quickly. I waited 30 minutes for 1 drink which is crazy to me. (Blackberry Bramble...very yummy, also tried a drink with prosecco, punt a mes and something else, it was pretty good too) \n\nOnly things I didn't like about this place was it seems a little snooty and pretentious and it is pretty expensive. I was with 5 people, we all had 2 drinks and our bill was over $150. Probably won't be back but it was nice to come in and try out the drinks.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "I appreciate a well made cocktail more than most people, and give their bartenders huge props - any bartender in this small town who can talk about when it's appropriate to put egg whites in a fizz drink deserves a thumbs up - Clover Club is really just an excuse to spend too much money on drinks. I've been there enough to see behind the curtain. \n\ntwo quotes come to mind: Clover Club \"is a tale told by an idiot, full of sound and fury, signifying nothing.\" and \"A fool and his money are soon parted.\"", "author": "mark s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "Clover Club is one of my all-time favorite bars.  It transports you in time to a magical place, removing you from reality, and that is my top criteria in all-time favorite bars.  The drinks are prepared to precision but with a twist that makes you feel like they truly care about the potion they are creating just for you.  The ambiance is old-time jazz vibe, with a fireplace, with smooth faux leather sofas, with waiters in faded maroon vests, with snacks that will always satisfy a salt craving, with customers wearing fedoras as they sip whiskey by the flames...  I always look for an excuse to come here.", "author": "Julie S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}