{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-31", "description": "Drinks are decent here with an OK HH price. There's always space at the bar. Cool date place as well. Place there's a bunch of restaurants nearby to eat at afterwards.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Full points for the creative drinks and great service! We were there for a friend's birthday and the waitress was kind enough to bring us a bread pudding with a candle on top, doing the best they could to keep us happy! The back room was sparse and could use some updates. Other than that, this turned out to be a great place to hang out.", "author": "Sunil U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "AWESOME bar with delicious cocktails and food. Love the old school vibe.\n\nTheir potato chips with truffle creme fraiche is like a fried party. Get it and get some drinkles!", "author": "Cherpumple F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "The only reason this place isn't regarded as the best cocktail bar in NYC is because it's in Brooklyn.  Otherwise, this place blows the pants off Pegu Club, Death \u0026 Co, etc,\n\nBack room is the place to be.", "author": "Grand B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Clover Club is a neighborhood gem. It has a lot of tables for regular diners and also a bar in the back and comfy sofas for cocktail drinkers. \n\nI was here for the Google Places party and we got the back room to ourselves. There was a fireplace and we got to enjoy their famous cocktails. \n\nI got the Nice Pear and it is super nice! It is sweet, pearish and very refreshing. \n\nI also tried the zombie and it is really good too. Everyone loves the cocktail here. \n\nWe got to try their shrimp rolls, which is a mini slider and it is very light and buttery. Chicken skewers here are juicy and tender. Cocktail is about $12 but for the quality it is superb. \n\nWould love to come back one day to try their regular dining food.", "author": "Athena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "WHAT. OH MY GOD. I think this is my favorite brunch place I've ever been to, EVER. Anyone who's ever met me will know what a huge deal that is.\n\n1) Atmosphere/setting - ridiculously cute, warm, sophisticated. We got a tufted leather booth, which just sweeps me off my feet. I'm a sucker for a good booth. YES! \n\n2) Drinks - I've heard their cocktails are amazing. Coffee was good, loved the artisanal sugar cube ramekin, a little sad they didn't have almond milk (no lattes for me). \n\n3) Foooooood - I got potato cakes with truffled creme fraiche, deviled eggs, and I shared the bacon sampler. Bacon was divine, but you know, duh. Potato cakes were so so lovely. I can never get enough truffle, and I thought the flavor pairings and texture combinations (and portion!) were fantastic.\n\nLet's talk about those deviled eggs. Someone had to sell their soul to the deviled egg devil to reach such sublime egg perfection. The four flavors were all unfair-delicious, and the eggs themselves were ridiculously flawless. The yolk mixture was piped so perfectly. I've seen porcelain dolls with more imperfections than these four eggs. Color me impressed!\n\nOne of the waiters was also incredibly friendly, and we had a lovely, hilarious discussion about something. I love that warm fuzzy feeling you get from random interactions like that.\n\nAt the end, I reached the perfect level of full but not too full and didn't get a food coma. Not too pricey, either! I live about 40 minutes away but will hopefully come back here many times to enjoy the all the culinary perfection this gem of a restaurant has to offer.", "author": "Robin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "My fave place to get a nice drink and fresh bar bougie  food. They have awesome fried chicken. Home made crisps and great Brussels sprouts! I'm defo a regular here.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Very cool bar offering crafted cocktails as well as a great selection of beers and wine.  Also has a limited food menu.  We had the pulled pork sliders which were terrific. But we really came for the drinks and the music; and neither disappointed!  The crafted cocktails are amazing.  Typical prices around $12.  The jazz was very good, top notch.  Service was good though drinks took a few minutes to arrive, however, given they are crafted, this is to be expected and worth the wait.  Wonderful ambiance in a small, shotgun style space.   They have a private room in the back which can be reserved for private parties.   Fun night out!", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "World class cocktails without a hint of pretense. The drinks are delicious, the presentation is gorgeous, the menu is long, diverse and ever-changing and the staff is friendly. Clover Club has been consistently excellent for years but somehow manages to still fly under the radar. Until this Yelp review, which, I think, is really going to get the word out.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "The food is amazing and the cocktails are sooo good. I've reviewed this place before and given it 5 stars but I'm rereviewing it because of the rude waitress. Short (dyed) red hair. Very unhelpful and never smiled once. I also saw her drop a drink in the lap of some poor girl and wasn't too apologetic. It's a shame because everything else about the place was amazing and the experience was just tarnished by this crappy waitress who couldn't be bothered to serve us. The host however was so so lovely from the moment he greeted us at the door.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Came here for cocktails and wasn't disappointed. \n\nThe bartenders know there stuff. They have good cocktail menu and the bartenders are good enough to make you a drink off the menu", "author": "Derek W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "I would give this place 5 stars, but I don't want its yelp rating to go up more than it already is...i'm selfish and don't want more people coming here.  this is my JOINT!!\nthe house cured salmon is amazing and the bar tenders know how to make some unique and exciting cocktails.  \n\nthe back room is as quaint as it gets with the fireplace and couches.  \nonly fall back is that this place gets expensive and the bill can rack up quickly.  let someone else pick up the tab!!", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Clover Club has been on the to-try list for awhile. Even bringing it up among my group of friends causes a litany of \"best. cocktails. ever.\" and \"you have to go!\". With such ringing endorsements, we finally went for a mid-week treat.\n\nThey have a nice selection of happy hour cocktails, but no, it was my first time: I wanted something special. The beau got the \"Perfect BQE\" (whiskey based), and I oped for the Slow Clap (gin and oh, hello there dash of India Pale Ale); both were fantastic. Watching other people at the bar take their first sips of everything from martinis to the signature Clover Club, I could tell that every other drink on the menu is probably just as great.\n\nSweet and spiced nuts were gobbled down faster than I care to admit. The atmosphere was nice and inviting, dark but not too dark, and those extra large, padded barstools? Why can't we have those at every bar?", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Had the lamb burger with some crisps. As sides we had some steak sandwiches. The lamb burger was so good. The meat was fresh and pink as i ordered it. Very delicious! The cocktails were awesome! Everything was very good! Next time again!", "author": "Patrick H. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Ok so my sister and I had our monthly brunch date here and I have to say this is our new favorite spot!! It's all dark woods and dark leather seats giving it a very masculine feel kinda like you stepped back in time. I arrived a few minutes early and sat at bar to wait. The bartender Anthony was amazing. I didn't know what to order so he asked about a few of my favorite things and proceeded to make me something that was perfect. He did this for both me and my sister for all our drinks each one better than the last. He was funny, attentive, friendly and single ladies absolutely adorable! As for the food it was great! We started with of course the bacon tasting and I mean come on it's bacon. I had the steak and eggs while my sister had the fried chicken and potato cakes. Both were excellent. I will defiantly be coming back for both the food and Anthony's great mixes!!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "This place is incredible. Came here with my fiancé for after-dinner drinks one night and we ended up staying for hours. The ambience is beautiful, the bartenders are incredibly friendly and skilled, and the drinks? Strong and delicious. We each tried about three different drinks (wanted to check out the various flavors and mixes), and we walked away VERY happy. Can't wait to go back!", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "Seriously great cocktail list, delicious deviled eggs, amazing duck-fat potato chips with creme fraiche.\nSaturday or Sunday afternoon and I'm very cocktail-y: this is where I go.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Really great cocktails, nice service, great outside seats, cool interior and all of my friends were very impressed with their meals. \n\nThe veggie options aren't great, and my mac and cheese was tasty but a bit bland. That said I was happy and with friends and Clover is a place I'd try out again for sure.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "I reserved a table with my mum for Wednesday night, knowing that there would be live jazz playing. We were greeted on arrival by a very friendly hostess/waitress, who continued to look after us very well throughout our evening. We love elderflower/St Germain and couldn't see any elderflower-based cocktails on the menu upon arrival (though there was one listed on their menu online...), so we asked about this. She was very helpful: we told her what we'd like, and the bar staff did a fantastic job of creating something \"off-menu\" for us. Food-wise, I ordered the beef burger, and my mom had the lamb burger. Both were extremely delicious! The jazz topped off a great evening. I look forward to returning soon!", "author": "Sophie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "One of my favorite places in NY for a cocktail. Spectacular drinks, very good food, and an elegant atmosphere.", "author": "Eve B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}