{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "I have been a loyal and regular costumer here at clover club for the past five or more years . Ive brought family members here who are now regulars here , co workers , dates , friends. I've always had a great experience here all around with food , drinks, hostess, waiters and bartenders. This Saturday I came in for drinks and a bite, I was very disappointed with the costumer service and drinks. We did not get waited on for the first twenty minutes of us being seated. We then placed our drink and food orders and it took about 53 minutes to finally get our order. We then asked for napkins which took another twenty minutes to get. The waitress came back and threw the napkins at our table and ran off. We tried to call our waitress over about five times and she didn't look our way or acknowledge us. After an hour of waiting for a drink it was extremely overly sweet not how they usually make an espresso martini and I was very disappointed. I asked if she could make the drink over and they did, it also took very long for that drink to come out. Tonight was a huge disappointment considering I come here about 4 times a month. It took another 20 minutes to get the check. This will be my last time drinking or dining at the clover club...", "author": "E E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Hostess was very welcoming when we came in. They also did not seem to rush us out. We spent a great deal of time eating and chatting without feeling like we needed to get out. Drinks were good... the bloody Mary is spicy.\n\nThe food was just okay.The egg sandwich looks impressive but it's more bread than anything else. The fried chicken was juicy and slaw was good but the coating kept falling off. The potato cakes had no flavor whatsoever even with the sauce. \n\nI tried this place once. Happy to say that I did. But  I Won't be back.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "So much intimacy and atmosphere wrapped up in one restaurant. We came to Clover Club on a whim, and it was a great decision!\n\nRight on Smith St, it's the perfect place for a date, quiet drinks or dinner. The ambiance is evident even from the street. We came for a small bite and drinks on a random night before heading to Chez Moi, and it was fabulous. We got a booth with a view of the bar. The cocktails were amazing, I had the Honeycrisp and would recommend it!\n\nPrice wise, things were a bit expensive but it's worth it when you consider everything. Service was top notch too!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Randomly found Clover Club after going to UglyDuckling and Camp. If I'd known, I would have just came there in the first place.\n\nReally liked the overall vibe at CC - the atmosphere is intimate and the menu looked intriguing enough for me to want to come back.\n\nPretty much had drinks here, but Nicole (my waitress on a Friday night) was really cool and attentive. Mauricio, one of the bartenders, was really cool as well.\n\nWill definitely be back to check it out more. I really liked this place.", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Came for Happy Hour. Had a nice glass of wine and a lamb burger. The atmosphere was relaxed and casual. The food was delicious, but not the best burger I have had. Overall, a great happy hour choice.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "If you want to seriously impress someone, take them to the Clover Club. It's romantic, it's dimly lit, the cocktails albeit expensive are delicious, exquisite and worth it. I came here for a friend's birthday recently and will admit, this is not an ideal birthday spot if you have a lot of friends. If it's like 3-4 people gathering, that may be okay. Anymore, you will be paying a service fee for using up their tables. I paid for two drinks (one for myself and the birthday boy) and what I felt like was literally another person after the \"suggested tip\", \"service fee\", and tax. Yikes. As I said before, really just come with one person here. \n\nFor cocktails I ordered the Shuck n' Jive. I have no regrets. It's the only drink I tried here aside from my friend's just regular martini and it was unique, refreshing, and strong. Oyster-shell infused vodka, Manzanilla sherry, bianco vermouth, and seaweed shrub. You can pay $3 extra for an oyster garnish. I went without. They pour your drink for this one into a fancy little coupe glass and then throw an additional bottle of the martini on a personal bucket of ice. I love when it seems like you have two in one drinks. They definitely have a drink for everyone and most of them are priced at $13. Menu is divided by bubbly drinks, daisies (sours), tiki drinks, frozen drinks, communal punches (which obviously cost more), more garden and crisp/clean cocktails, traditional cocktails, beer and wine (but why? you're in a damn cocktail bar, son). Also, they serve food and brunch and brunch cocktails. Which I haven't explored at all yet. Happy Hour is from 4-7pm Monday-Friday and select drinks are marked down to $8 for cocktails, $6 wine, $4 beer, and reduced prices for small plates which are pretty reasonably priced.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "This place was a recommendation from a friend and it was FANTASTIC!  I will also give many props to the service - both our waitress and the hostess.  The cocktails were delicious and I would totally go back just to try everything on the menu.  The duck hashbrown was a religious experience.  The bacon tasting was lovely.  The baked eggs with truffle and leeks also delicious.  Huevos Racheros - really good.  I would definitely recommend and go back to this place.", "author": "Susan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "So on Saturday I told my friend I really wanted to do Brunch with real Brunch food \u0026 drinks lol she recommended this place having been there a few times herself. The Location was super cute \u0026 cozy. The waitress / hostess was Super sweet I think her name was Nicole. She was very attentive \u0026 informative with the menu options. We had the bacon Sampler to start \u0026 I had the Englander with cheesy Grits. All of it was mouth watering delicious! I have absolutely nothing but great things to say about my experience here. I'm definitely going back.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Amazing food, ordered the Brussels sprouts, artichoke flatbread, Rockefeller oysters, and the duck confit waffle - OMG, no I wasn't alone but even if I were I woulda eaten it all! Service was ok - like just ok, that's the only reason a star was docked. But please believe I will be back for the scrumptious food!", "author": "Keturah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Came here when happy hour started, around 4pm on a Saturday, and only a couple of other tables at the time. Servers are friendly, drinks are thoughtful and well executed - not just your average Moscow mule my friend!", "author": "Patricia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "Let me start off with saying we have only heard rave reviews of this place and have wanted to go for a while. It's not my preference to leave poor reviews but feel the need to share. \n\nWe went last night for dinner. The bar and restaurant were packed which always makes you feel good about your choice. To start off, the waitress was not happy we didn't order drinks which seemed like it ruined the service all together.\n\nI ordered the oysters rock your face off which was crunchy and light still allowing you to taste the oyster. Then I ordered the burger and my friend ordered the skirt steak. The table next to us ordered their food about 2 min before us and literally finished their food before we were served.  In the mean time, the lighting was extremely low, so low that you cannot see the long hair tangled around your French fries. They did the right thing and comped the meal but you would think the service would be better and more swift after this but no we sat with dirty dishes for 15 min before we received the bill. \n\nA first and last experience for us-", "author": "Aliza R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "My favorite neighborhood spot. The food and drinks are always great, and so is the service. Never a miss on anything I've ordered. Always left happy with my meal/ drinks", "author": "Julia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Update: The staff reached out to me on Yelp and sent me a sincere apology for the experience.  That meant a lot to me.  It's reassuring to know they're self-aware and focused on improvement... so I'll give it another go at Clover.", "author": "L A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Great happy hour, M-F before 7. High-end, artisanal cocktails and a great, quiet, dark ambiance. It gets pricey after HH. Didn't try the food.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "False advertising. Large plates are actually small plates, small plates are actually smaller plates. Drinks are good but definitely don't come here to enjoy the food, unless you have the appetite of a 3 year old baby. Beware the swordfish is spicy (I love spicy food) but was trying to avoid it that particular night..was advertised as lemon, olive, and tomato.", "author": "Jordan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "A friend and I went to Clover Club while we are walking in the neighborhood, and the happy hour options here are hard to beat.\n\nThe full menu was very interesting, but the happy hour menu was more than enough - it came with classic drinks like an Old Fashioned or a Moscow Mule. The Old Fashioneds were particularly tasty, and hard to beat for $8 in this part of town.\n\nThe foods on happy hour menu were also very reasonably priced. The olives and the hanger steak were the best options.\n\nService was very thorough, and I felt looked after.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I really love this place.... it is not overbearing but relaxed and easy atmosphere. The hostess, waiters, and waitresses are wonderful, attentive, and friendly.\n\nThe drinks/cocktails are AMAZING!.... And also very interesting.... You can easily spend a great amount of time deciding which drink to have for the night....\n\nFor Dinner I had the Fried Chicken with Slaw.... people of the yelp world that FRIED CHICKEN was soooooo good.... it was covered in a light delicious sauce... I ate and asked no questions... lol lol lol.... \n\nThe brussel sprouts are a MUST HAVE...... Looking at you under my lenses.... Try the brussel sprouts.\n\nMy friend tried the Lamb Burger and loved it!\n\nDeviled eggs were on the salty side....\n\nThe best part.... the bread pudding.... Halleluuuuuu!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Great drinks and food,wanted to try all of the drinks on the menu and the Mac and cheese is must!", "author": "Yael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "I love this place!  Thanks to my friend's recommendation!  We came here, and immediately fell in love with this place!  Great for date, hangout, or just dine by yourself!  It's the atmosphere that you can enjoy the night without any worries!  LOVE IT!", "author": "Brandy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "I came here for brunch. I loved the deviled eggs and the bacon toast appetizers. My baked eggs brunch was flavorful, hearty, and beautifully presented on a black slate. I can tell the chef really cares about the aesthetic and the flavor of the food. \n\nThe restaurant is beautiful and spacious. \nI look forward to coming back for dinner.", "author": "Rebecca L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}