{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Fabulous cocktails + dimly lit atmosphere = perfect pre-dinner setting.  Drinks are a bit pricey but strong, well balanced and worth the price.  Waitstaff is excellent.  The only con was the airflow problem.  It was stifling hot on a cold fall evening.  Very unusual.  Oh well, will be back again!", "author": "Bianca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "My husband and I attended a private birthday party at Clover Club and it was obvious within about a minute we'd be back.  The \"bartender\" Travis, is not only obviously excellent at what he does - and really he's an artist.  I'm not one of these over-the-top cocktail snobs but damn, his drinks were creative and delicious and interesting, and he was patient in taking into account what each patron liked and didn't like.  YUM.  I had, among other tasty drinks, The Clover Club signature cocktail (gin, dry vermouth, lemon, raspberry syrup and egg white) and a Marquis Especial (pisco, lemon juice, strawberry, champagne).  The passed hors d' oeuvres were also fantastic!  My husband loved the lobster roll (I don't eat seafood).  We both basically attacked the servers for as many chicken skewers and \"steak over toast\" (tender herb-marinated hanger steak, sliced and served over toasted baguette with a spicy horseradish cream sauce).  Descriptions are from the website!  The private party was in a back room and we had 30ish people comfortably mingling, sitting on barstools, and in various chairs and couches.  Really just a lovely evening (celebrating my awesome friend's 30th!) and we can't wait to return!", "author": "Audrey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Loved the vibe, the space and the service.  These are mixologist.  These are cocktails as an art form. These are man drinks. Loved it all.  Stopped here for a pre-dinner cocktail but will be back to indulge further.", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "i'm in love.\n\nclover club serves up some of the best-made cocktails in brooklyn, with amazing ambiance, and a menu that is to die for.  the bartenders are REAL bartenders, who know how to do oh-so-much more than just pour a pint.\n\nyes, it's pricey to spend a whole night there, but it's quality over quantity, people.", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Amazing brunch.  Bacon tasting, baked eggs, pork n grits, and bloody mary (2 types) were favorites.  They were out of ricotta pancakes which we really wanted, so need to go back!", "author": "Kristen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Classy and yummy without being pretentious and having to wait 12454 hours for a table on a sat night. Best mac and cheese ever and their cocktails make me want to ... ya know.", "author": "Caroline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Walked here late-night for drinks with girlfriends Winter 2011. Came back the next morning for brunch. I was totally satisfied with the experience both times. I will say that it works better as a nighttime place, a sort-of swanky but not too swanky classic old school brooklyn spot - it is a little too dark to sit in a sunny afternoon - not much natural lighting.", "author": "Lindsey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "Amazing place ! The dishes were excellent, well cooked, tastefull ! I highly recommend this place if you are looking to get a refined brunch and no that expensive at all !", "author": "Samir B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-11", "description": "I went to Clover Club for Brunch this weekend and it was the worst brunch in the neighborhood. Very disappointing. The food took so long to get first of all (over an hour wait, hardly anyone there)and we paid $6 for a piece of bread toasted with jam. My food was cold and very average and my husband's had no taste. This was so bad....I have been there for drinks and they were good but also expensive. I will never go here again. Also...the service was so bad and it wasn't even busy!!", "author": "alexandra k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-06", "description": "Wonderfully cozy and charming cocktail bar in Brooklyn. I want to take my dad here when he comes to town, as he will really love this place. \n\nI can really dig on the fireplace in the back and the comfortable setting too. Good guacamole, and other nibblers at a reservation event I attended there as well.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Impressive drinks and knowledgable mixologists! Great place to have a few drinks with friends. The food is great as well :)", "author": "Toniann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "Screw eggs over easy: I want my eggs mixed with gin. And Clover Club's Ramos Gin Fizzes rank as a near perfect breakfast beverage.  In the life I wish I had, Jeeves would wake me every morning to this perfect, eggy-gin goodness.  Lucky for my wallet and my liver, I now live far enough away (and a special shout-out goes to the MTA and its weekend service changes!) that I'm not regularly tempted to spend my entire weekend in a gin/egg induced stupor.  But, oh, I do love starting my Saturdays and Sundays with this drink.  And, unlike other places (Death \u0026 Co., Pegu, etc.) they are open on Saturday and Sunday afternoons. \n\nClover Club has a decent happy hour as well (with extremely cheap beer, although getting beer here always seems like a waste, and deals on a couple of cocktails and snacks).  It's usually been pretty quiet, and I've been happy sitting alone, at the bar.  I've had good luck with the bartenders' recommendations, including a drink, the Bitter Giuseppe, that might rank as one of the finest aperitifs I've had the pleasure of drinking, despite the somewhat silly name (I like my apertifs, in that they are my way of denying it is winter, and celebrating better weather when it is nice out).", "author": "H H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "Wow brunch.  Trout pate, bacon tasting, i need say no more.", "author": "Austin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "I met my best friend for brunch at Clover Club, a total 1920s throw back club that serves up an amazing brunch. I was there for my bf's bday party a few years ago. A fun Brooklyn getaway with serious drinks, so I decided to try the bloody mary after having a fun night out. Was not disappointed, so peppery and spicy. I also had the baked eggs with leeks and parmesan. The presentation was unreal. They served the meal on a slate rectangular board. On top was a small oval ramekin filled with baked eggs neighbored by two pieces of grilled sourdough and a small heavily seasoned green salad. It was delicious. My bf got the huevos rancheros, which was beautifully presented as well with a tortilla on the bottom with layers of flavor including black bean, a thin omelette, and spicy green salsa on top. Serious attention to details! Great place to drink and now to brunch!", "author": "Liv R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "The drink menu is so extensive that I often can't choose what I'd like for a good ten minutes. Staff is always attentive and knowledgeable. Ryan has to be one of the most well-mannered bartenders I've ever seen and he makes a helluva tiki drink too. Although if it's busy don't order one of those. It's just unnecessarily cruel.", "author": "Etan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "I love Clover Club. I'm curious about so many of these reviews calling it 'pretentious', and wondering if perhaps my definition is different.  Pretentious it ain't... swanky, sure. Expensive, you bet. But pretentious?  \n\nI've been here three times, once on a Friday night (yikes!).  Every single time I have enjoyed the hell out of the experience.  Listen: part of the reason for sitting at the bar is to watch the barkeeps mix the drinks.  If you want to throw ice in a glass and splash bourbon on top, then buy a bottle and go home. It's definitely cheaper, but not nearly as fun.  And I don't know about you, but I do not have nearly the exotic array in my own personal bar arsenal that Clover Club does. \n\nEvery drink I've had here has been utterly delicious. The French Cowboy! (Just saying it is a blast! Oui, oui!).  Sour Cherry Fizz. How decidedly old fashioned. And oh, my god in heaven... (drumroll....) the Gin Blossom. GIN BLOSSOM!!!!  Perfect. Strong. Delivered with  a teeny little carafe of extra nestled in crushed ice.  Mmmm.\n\nAs for the waitstaff... it's a busy bar, folks. What y'all take to be rude and unaccommodating is actually efficiency, which I appreciate. Each time I've been, I've had a question about an ingredient in some drink or other. And every time, my waiter person has quickly and efficiently answered the question.  I'm pretty hard on waitstaff as a general rule, having been in the business for so long. My expectations are high and exacting.  Clover Club has delivered every single time.  \n\nI haven't tried any of the bar bites, but am looking forward to the bacon tasting for brunch. Duck bacon???? OMG, maybe this is heaven.  \n\nCheers, Clover Club. You do it just right.", "author": "anna devane l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "I love Clover Club :) It's my happy place. \n\nI first went to Clover Club on it's opening night a few years ago, and have  dropped in occasionally for drinks and brunch since then. It's drinks are well-presented and prepared, it's staff are friendly and open, and the space is warm and cozy-- particularly if you snag the two seats by the fire in the back room. Personal favorites include the Harvey Dent, Golden Girl, and pretty much every type of punch they mix up. It's a great place to go with a date or a small group, though nowadays, it tends to get quite crowded and loud on Friday and Saturday nights. There's a live jazz band on Wednesday nights. \n\nFood favorites include the mac and cheese (with bacon! definitely better with bacon) and their bread pudding (like a cinnabon on steroids, smoking a clove cigarette). Brunch recommendations are the baked eggs with truffles and leeks, and their french press coffee. And the Barman's Bloody, for those of us who like basil. \n\nUltimately, Clover Club is a great food and drink spot, and well worth a little time in transit from Manhattan :)", "author": "Jane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "This is the best bar I've been to in New York. The bartenders have mastered the art of mixing up fantastic flavors with scotch and other liquors that are so much more complex than typical sugary or vodka concoctions. The space has an old-school vibe. Think wood panels and bartenders with vests and black ties. Try the macaroni and cheese or the freshly cooked duck fat potato chips on the side.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-27", "description": "This is not the place I could call my local - the cocktails are too pricey for me - but making a reservation on jazz night and ordering the right drink (not necessarily from the lovely menu)... so romantic and delicious. The jazz is sublime and the drinks are fabulous. Worth a visit.", "author": "cait l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Mac/cheese, sweet potato fries, Toyko Drift cocktails. Good brunchies, too.", "author": "Ali F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}