{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "Absolutely excellent cocktails, albeit it overpriced, along with the food, if you go any time other than happy hour, which is currently Mon-Fri 4-7pm. Hard to find a better deal on quality cocktails than $7 during their happy hour. The food is excellent, but pricey. Wonderful ambiance, a real quality cocktail establishment in Brooklyn. Try it for sure.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "I'm angry. Fuming and at my wit's end. How dare there be a restaurant that seduces me into a long distance relationship. I told Serena that I was pissed to have nothing to complain about and truly only one mere suggestion (more on that later).\n\nAs those before me have said before, the front doors of the Club are a veritable time warp. The centuries turn back and prohibition is dead. Two points to Anna B. for hitting the divan on the head, as the buttoned leather is precisely the booth to be in to sit back and watch it happen. A vested 'tender shaking cocktails with vigor, elaborate wallpaper and mahogany finishes. Elegant and dark and would-be smoky, if such a thing were still legal.\n\nWe started with coffee, which is typically nothing fancy, unless you're here and it's served in your own French press to share. Yum. Rich and creamy I was content until I read all about Liquid Brunch and found myself counteracting caffeine with a Lima Sour, eloquently described by the purveyor as \"pisco, yellow chartreuse, lemon and demarara\". If you're like me, you might have to Google a couple of those ingredients but I promise that query will point to delicious. Garnished with a strawberry, the dainty glass was sour more than sweet and very, very good to me.\n\nWe shared the bacon tasting. Some haven't been impressed, but we were, albeit trying to hide our \"oohs\" and \"aahs\". Maple, black pepper and duck bacon on toast. And here's my one critique: it needed an adhesive. We tossed around everything from a chutney to a jelly to a aioli, but any ol' way, it might have been nice to dip. I realize it's bacon, the holiest of holy. . . but that's all I've got.\n\nMy baked eggs with chorizo and manchego were ripe with flavor so intense and perfect you'd have thought the cast iron dish they were served it started as a seed and was just picked that morning. The chorizo wasn't as crumbly or spicy as I'm used to, but it made up for it with rich and savory flavor and that zesty marigold, orange oil it emits. Yum.\n\nEven the greens on my plate were dressed to perfection, making me angry that I had nothing to pick apart, size up or analyze. Was it a little spendy? Sure. But if you're a foodie like me, you'll pay. Relationships require an investment, and I'm willing to give this one plenty of time and attention.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Yeah this place is pretty amazing. Incredible drinks. Great atmosphere...don't really know about the food. \n\nFeels like it's right out of the 1930's and is gorgeous. Staff is very friendly and polite. Crowd is friendly and conversational. I'm pretty sure the giant wood bar with the bottle cabinets, sitting behind the bar tenders was shipped in from Philadelphia and is over 100yrs old. Looks awesome. \n\nDrinks are super prepared, fancy and pretty strong. A little pricey but the whole experience is worth it.", "author": "Alex O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "I think that the dozens of 4 \u0026 5 star reviews speak for themselves but I'll submit mine anyway.  \n\nwe attended a private event in the back area that had it's own bar so no waiting for drinks.  it also had a fireplace that was lovely and cozy.  the drinks, well, hell, if you haven't figured out by now, they are dope. \n\nbut seriously the all american finger foods were outstanding.  schucked oysters, deviled eggs, house made potato chips and blue cheese dip.  you get the picture.  great place, great service.", "author": "Darcey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Great place to grab a drink and some light bites. The cocktails are fantastic. I love the swanky ambiance. Great place to bring a date.", "author": "Olga T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Just had brunch here and it was fantastic.  It's located on this really quaint, cool street in Brooklyn. I loved the ambiance inside. Cool, but not too cool for the room.  The pork grits were fantastic and the bartender mixed a cocktail to compliment it.  Looking fwd to stopping back another time and would definitely recommend.", "author": "Jesse F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "The Clover Club is the type of place that Michael Imperioli from the 1800 Tequila commercials would have a drink in.  \n\nNo velvet ropes, no posturing...just old school authentic cocktails made by skilled mixology PHDs wearing button down shirts/ties/vests. \n\nPeaking behind the curtain into the back room, you'd almost expect to see Nucky Thompson, Jimmy Darmody and Arnold Rothstein doing a deal in the corner.  \n\nWith names like Bitter Tom, Rhubarb Spritz, Rope \u0026 Rose and the Moscow Mule (which is a half-priced $6 during happy hour), you get the feeling there's an R\u0026D lab in the basement where mad scientists are cooking up the next crazy compound for the Fall '11 drink menu. \n\nThese cocktails take some TLC to make, so at times the service gets backed up (even if you're sitting at the bar)...so order your next drink before you finish the one in front of you or expect to wait with an empty glass.  \n\nBeing a Manhattanite, the Clover Club was the type of spot that helped me understand the charm/appeal of the BK.  Definitely my favorite drink spot on the Smith Street strip.  \n\nStop by with a buddy, some friends, or a date.", "author": "Dominick Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "My girlfriends and I have been to the Clover Club several times for drinks but stopped going after receiving lackluster service.\n\nBut today, we checked out the brunch menu on a whim. The description of the baked eggs with leeks and truffles drew us in.\n\nThe dish was spectacular, filled with rich, creamy deliciousness, paired with a nice arugula salad and good, crusty bread. The cheddar grits had a lovely consistency and just the right amount of cheese and butter. My girlfriend's pancakes were tasty and light.\n\nThe service continues to be problematic. The waitress took far too long to take our order and the food was slow to make it to the table. The pancakes were delivered without butter or syrup and we had to ask twice to receive them. A request for bread also had to be made twice.\n\nLuckily, the food was delicious. \n\nIf the service were better, I would consider becoming a regular.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "I'm a nit picky, particular, jerk of a bartender and this is where I go for cocktails before anywhere else. There's a thousand 'speak easy' themed bars in Brooklyn and Manhattan, but Clover Club is hands down the top of the heap (Angel's Share is a close second). Where most bars dole out the same old classic cocktails, this place does the research and puts in the effort to offer some truly extraordinary selections (my personal favorite was the Green Swizzle featured on last summer's menu). Pair this with the great food and tasteful interior and you get the genuine article, a great cocktail spot that doesn't need to role play like it's 1920 to bring customers in.", "author": "Ace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Went here last night for a friend's birthday and it is a wonderful spot! Excellent drinks (that harvest punch sneaks up on you!), attentive and friendly staff. The atmosphere is  gorgeous - we had the fireplace to ourselves but were told we could open windows as needed.\n\nOverall - will definitely be back!", "author": "Shar M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Great gastro pub food. Loved the chips fried in duck fat!! Yummy. Drinks are seasonal and tasty. This is a friendly version of a speakeasy. Not snooty very relaxed. Good drinks, great service without the wait and drama of some other speakeasy bars.", "author": "Kari D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "We had a small wedding party here in October and everything was amazing. The service, the drinks the food. Staff were amazingly friendly to all our guests and flexible to what we wanted to do witht the space. Best !", "author": "FZ R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "If I go back to Clover Club, I'll dress more appropriately. Because except for the fact that I was wearing fleecey snow boots (it was, after all, the middle of a snow/hail storm), I felt like one classy b*tch in there. \n\nContributing to the chic environs: A crooner crooning, a trumpeteer trumpeting, and many uber-cool people lounging around lazily but pointedly looking beautiful. \n\nSome of the cocktails I tasted were hits and some were misses, but I certainly enjoyed playing. The carrot-ginger-Aquavit cobbler called Night Vision was a star, and the eponymous gin-based cocktail went down easily. (Fyi, the current cocktail menu is quite different than the one on their web site -- and better, I would venture to say.)\n\nI didn't have much in the way of food, but the sweet potato fries were tasty. I stayed away from the crisps. Far, far away. Do they really have to toss them in duck fat? :(", "author": "Cara A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "Made a reservation weeks ago for a table for six in the back room. Get there will my party and there is a party in the back room and they give us one of the tables in front the bar. There is no way six woman were going to sit there for dinner and drinks and be comfortable. The hostess offered no apology and no solution. So we took our business across the street to Hunters and spent our $600 there. Not our loss, there are lots of fine establishments with great cocktails and good food. We had a great time at Hunters. The Clover Club should honor their reservations, or find patrons a reasonable solution. Not squeeze six adult woman into a table meant for 4/5 tops. Going to the Clover Club was my suggestion, I won't be making that mistake again.", "author": "alaina p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-14", "description": "I don't know what is wrong with the staff here. The awful jazz band they had playing here tonight was the absolute worst. The band kept making one of the other people eating here tonight move out of the way while they moved their junk around. After the zillionth time making this girl move, who was obviously and rightfully getting extremely annoyed, the jackass band lead has the mind to make some quip at her and sets her off. \n\nNow, while this has been going on, the staff is practically no where to be found, and did absolutely nothing to remedy the situation or make any attempt to solve this problem. The fact that they'd hire these morons to play in their business speaks volumes about staff and management's incompetence and ineptitude. And then after their own band manages to completely fuck up a number of patrons' experiences, their reaction is to ignore the problem entirely, or maybe this is just a fairly typical experience at this dump. \n\nThe drink selection appeared impressive, but were underwhelming. The food here is pretty mediocre as well. With as many amazing places this city has to offer, anyone can easily do far better than patronizing this particular service hellhole.", "author": "scott r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "This is my kind of bar.\nSophisticated without being pretentious.   Great drinks.  Skillful mixologists.  Fun crowd of people looking for something different.\nThe back room was closed when I came on a Sat. night, making the front a bit cramped.  Somehow, we still managed to score seats at the bar and watch the bartenders do their thing.  They could be friendlier. . but it was packed and it takes like 10 minutes to make each drink.\nAnyway, I will totally make the trek back into Brooklyn for another visit.  Didn't get to try the food. . .", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Clover Club has AMAZING drinks. I threw a surprise party in the back room and the aesthetic was perfect. The bartender even made a custom drink that we had come up with for the event. Everyone was really pleasant and helpful. Thank you Clover Club!!", "author": "Emma S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "Generally I love the Clover Club. Spoiler: This complaint is about our dealings with a very specific individual and shouldn't necessarily be used to judge the bar in its entirety. \n\nBut...around a half an hour after we left the bar, I realized that I had left my phone at the table (idiotic move). We immediately called the CC and the woman on the phone was pretty rude. We asked her if she'd be willing to check by the table we had sat at and she responded with, \"All tables are cleaned in between service and your table has already been cleaned so it's not there.\" After an abrupt conversation ending where it was made very clear that the woman on the phone had zero interest in helping us out,  we got in cab and went back to the CC. And there was my phone on the seat...untouched (lucky me!) \n\nI know people are busy and customers who leave things behind are a nuisance but it would have been great if she had been a wee bit nicer on the phone...and if she hadn't made up an excuse about my phone not being at the table because she was just too busy or too lazy to check. It would have been way less nerve wracking for me (yes losing a phone is terrible) if she had said, \"I can't check the table now. But, I promise I will as soon as the customers at it leave or when I have a second etc.\"\n\nAnyhow, we then proceeded to call back to let them know that we had indeed found the phone but the CC phone just rang and rang. True, they may have just not been near it but I'm suspicious that they have call waiting and were avoiding our calls (3 attempts in 25 minutes).", "author": "Kate P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Bartenders are good , accommodating at making you whatever you want. All of the drinks were well made and tasted good . Expensive as expected for craft cocktails . One thing that really perplexed me was that I was only able to find TWO drinks without lemon juice , lime juice or some combination of the two. What's up with that ? Sometimes you just don't feel like drinking a freaking lemon !", "author": "Frances H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Delicious but expensive drinks. Nice atmosphere. It's a good place to have a relaxed pre-dinner cocktail. Unlike most bars in the area. Can somebody tell my bf to take me here?", "author": "Bridget O."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}