{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "We came on a Saturday for brunch looking for egg dishes and were not disappointed. We ordered the Baked Eggs with Truffles and Leak and the Egg Sandwich per our server's recommendations and both dishes were very well done, with hefty portion and beautiful presentation. The server was very attentive and the service was quick and professional. The Egg Sandwich now set a high standard for my breakfast fare and it was a comfort dish done in a very special, delicate way. The house-made crisp was also very yummy, speaking from someone who usually doesn't eat fries or chips. We went around 12pm on a Saturday and it's definitely perfect if you're looking for brunch with quieter, more peaceful vibe.", "author": "Chanoot S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "So I'm giving this place three stars due to the fact hat they have no FRIES.  There potato excuses are just that, cold, burned, not exciting.  I've been coming to this place for years, the \"Rock your Face Off\" oyster dish is EVERYTHING and the bacon sample for brunch is the tops.  The space is nice and all...they've been around for a while so I hope they get fries and stay longer...\n\nYeah what was the point? \n\nI was fries with my Oysters", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "One word to describe Clover Club. Swanky (Thanks Zee) I have to say Clover Club so far has been one of the coolest places I have ever been to! The happy hour is priced just right and the food has been pretty good. I love how set up of the bar restaurant and the private party room in the back. I gave it 4 stars because although the food was quite tasty, the portions are not very big which may leave your stomach asking for more. If your stomach isn't bottomless like mine then its perfect for you. Also, if you want an Amazing Moscow Mike, this is the spot.", "author": "Samuel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Fancy speakeasy-style cocktails with bistro-style food.  I've been here once and loved it--I'd come back to try more of everything, the food and the drinks.  \n\nDRINKS:\n\nThe drinks were uniformly terrific.  I tried three:\n\n1) The Clover Club: gin, vermouth, lemon, raspberry, egg white\n\n2) A bartender's choice: I asked for the most gingery thing he or she could make, and advised them to make it as gingery as they thought was safe and then make it more gingery.  I got a dark and stormy, which was lovely but hardly gingery.  (For ginger lovers, head to Attaboy or Milk and Honey and ask for the Ginger #2, or go to Angel's Share and ask for the most gingery thing they have--it'll burn your throat.)\n\n3) The Northeast Kingdom: Barr Hill Gin, bianco vermouth, Cointreau, lemon juice, raspberry syrup, soda.  It was a little like an adult soda, but refined and tangy and sharp and overall excellent.  \n\nFOOD:\n\n* The mac \u0026 cheese: creamy and cheesy but not morbidly decadent.  Sometimes you want decadence in a mac \u0026 cheese, but sometimes you want something just a little simpler.  This was perfect.\n* The quinoa \u0026 vegetable salad: light, fresh, a nice option for you if you don't want bar food or if you want your calorie consumption to come primarily from liquids.\n\nTHE SPACE:\n\nThey have something like 10-15 seats at the bar, a sofa for maybe four people, and then a bunch of two- and four-seater tables.  It's a good place for hanging out with a friend, a group, a date, anything.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "This is the best cocktail bar i ever been to. If i could give it ten stars i would. From the decor, the service, the drinks, the live jazz on wednesday, and how dark it is in there. I just love it. If i lived close by i would be there everyday.", "author": "Cesar G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I've visited many cocktails bars and this one is the best in NYC! Lucky for me it's a short walk from my home. I've brought family, clients, colleagues and my closest friends to this establishment. It's one of my favorite places in Brooklyn. Try the Green Giant and the Letter of Mark. You won't be disappointed. The drinks are strong and well crafted.", "author": "Shiloh B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "First things first, this place is BEAUTIFUL, which pushed my review from a 4 to a 5.  The theme is all dark wood and leather, with an air of sophistication that is also friendly and welcoming.  The food at Clover Club was also excellent and hubby and I will definitely be back! \n\nWe arrived shortly before the end of brunch, and our server was gracious enough to take our orders quickly so that we could still get in on it. To eat, I had \"The Englander,\" which is sliced hanger steak and poached egg. I asked for it medium rare, but it came medium well, but was still delicious! Hubby had the bacon tasting with 3 different slabs of bacon, which was crispy and wonderful.  He also had the cheddar grits and also the baked eggs with chorizo. Both came in their own cast iron skillets and were so savory and filled with cheesy goodness :-)\n\nWe are coming back next time we're in Brooklyn!", "author": "Donysa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "The place is gorgeous !\n\nThe food is delicious, the cocktails are amazing, and the service is really friendly! Will definitely come back!\nMake sure you try the tomato soup and steak\u0026frites!))", "author": "Vladimir B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-21", "description": "Let me first start by saying the food and the bartenders/drinks are amazing here.\nThat being said:\nThis is a review based on the service I received by the wait staff.\n\nThe hostess basically tossed menus on a table and then walked away. It was careless enough to make me actually notice it. The hospitality level here is certainly lacking.\n\nThe waitress never put in our appetizer order and we ended up just getting our entrees. When we asked her about it at the end of our meal she said she was sure she put in the order and would find out what happened. When she dropped the bill she didn't explain to us what may have happened or apologize. It was pretty disappointing service but again, the drinks and food are great.\n\nHere's to hoping that management will improve on front of house staff. This place is a gem otherwise.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Cool decor, we sat in the front where it was nicely lit. There was a small, intimate room in the rear of the restaurant. \n\nService was kind of cold. We were first seated on a table with an ottoman. This set up has to go. Nobody wants to sit on this.  We asked to change our table and the waitress kindly did. Food took about about 30-35 minutes to come.\n\nBaked Eggs with Truffle and Leeks $12 - Superb! It was very tasty but could use more toast to scoop up the eggs. It was served on a iron skillet with a side of salad and toast. Highly recommended.\n\nThe Englander $14 - Delicious, and different. I asked for medium rare and it came out great. The thinly sliced hanger steak showed off the pink-reddish interior. The poached eggs were cooked just right and yolky. I'd also recommend this dish. \n\nI would definitely come back again for brunch. There are many options in the vicinity for brunch but Clover Club is a great option if you're looking to get seated quickly for good food. Cafe Luluc was up the same block and had a big crowd of people outside the restaurant. Yikes.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Take all my money, Clover Club. My favorite Brooklyn spot for a great dinner bite. \n\nTry the steak on toast or the Brussels sprouts for small plates; the corn whiskey old fashioned is fantastic; and the wine selection is lovely! From 4-7pm on weeknights, there are discounted drinks and smaller bites.\n\nAmbiance is awesome- comfy booths, great low lighting but you can still read your menu, and a dope (albeit a bit loud) soundtrack. Great people watching near the window and more intimate (i.e., couches and armchairs) seating near a fireplace in the back. The bar is great, too, especially if you like to dine alone. Staff is friendly and attentive. Highly recommend!!!", "author": "Tara D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Travelled down from midtown for Saturday brunch on a recommendation from a friend and it just wasn't worth it. They kept us waiting a really long time before food - we were a party of eight but it took 3 hours from arriving to leaving and we only had one course.\n\nI had the lamb burger which was just totally disappointing. Small and poorly seasoned and in slightly stale bread. The chicken and waffles and baked eggs looked great though so maybe I picked badly. The cocktails were very good to be fair, but all in all I was pretty underwhelmed and didn't think it was worth the trip.", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "Came here this past Sunday with a girlfriend and it was a semi-sweet experience. \n\nWe each ordered an entree but it wasn't too good. The food was bland and dry.\nHowever, the bacon sampler was delicious!! It came with three cuts of bacon (maple, smoked, and duck bacon) over toast. The duck bacon was not too good (salty and chewy) but the other two were soooo good!!! \n\nIf we do go back to Clover Club, it'll definitely be for just the bacon.", "author": "Karol L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Easily my favorite bar on Smith Street. The drinks are AMAZING and service is perfect. It's my go-to spot for a first date or just a Friday night hang sess with friends. This bar is a great alternative to trekking through Wburg or Manhattan for a speciality cocktail. Definitely check it out!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Went there this past Saturday night after the hockey game.  We were a big group from Boston; over 20 guys.  We were made to feel right at home and sat in the rear bar.  My buddies sat by the fireplace and I sat at the bar.  Server there was definitely busy but drinks came at exactly the right rate.  I tried a number of cocktails and was very impressed with the quality and taste.\n\nServers were awesome and the locals were really nice to talk to...very welcoming to a bunch of out of towners.  Will definitely go back next time I am in town.", "author": "Nik H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "I'm surprised this place has so many good reviews. The food is excellent but it took many tries for the staff to bring out the correct orders and none of them were together. The server forgot to add on a few things to the bill, fine by me though because it probably would've taken an extra 20 minutes to add the items on, as it took for the side of syrup to come for the pancakes.", "author": "S D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Service is always good here. Coming on a Sunday night with the whole place mostly empty is a blessing. We end up getting the couch seat in the back as if we were at home spread out all our jackets and stuff. \n\nThe drink were made perfect but you really have to order the right drink. I had a shaolin monk but it sounded better than it tastes tbh. However after destroying that lamb burger, there is nothing to complain about. Lamb burger is juicy and green side is made perfect. I always thought their food is so so but I have to try something else next time. \n\nSuper cute date spot however it's pack normally on Fridays and Saturday. Book ahead.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "I was pleasantly surprised by this restaurant. A friend and I had a \"date\" night here, we were able to request a table in the front of the restaurant by the windows, it was quiet even though there were multiple families around. The drinks were good. They were open to substitutions and my drink was exactly as the waitress described.\n\nNow the food..... Was SO GOOD. I can't wait to come back. The brussel sprouts were amazing, roasted to perfection and yet tender, we also had the salt cod app which was exactly the way it should be-salty, creamy and served with crusty bread. For dinner we shared the duck and oxtail. The duck was SO FANTASTIC-i'm not a duck person but it was cooked exactly the way it should be and every single item on the plate elevated the dish and the duck itself. I don't see oxtail on a menu very often, when i do its usually in a stew, and i always get it because i love it. This preparation was very different. The tail served on a plate of amazingness and i wished i could have went back the next day and ordered the exact same thing. It was tender and spicy and crispy-the sauce it came with was so good! I had this dish later that night at home with my husband and then AGAIN next morning and it only got better. As you can tell the portions are incredibly generous-which for this area of Brooklyn isnt exactly the norm.  \n\nDessert was the only portion of the meal where we can say we weren't blown away by everything and yet still managed to be impressed. The panna cotta was just OK-the texture was off-but the ice cream it came with was good. The dessert we loved was a fall fruit cobbler type dish and i cant even explain how good this thing was. Each piece of fruit, including the figs were tender and sweet. The pastry/crumble was so incredibly delicious that i probably would have been happy with just a plate of that! \n\n\nThe ambiance is a great mix of family/group of friends friendly and date night/couple friendly. The tables are spaced nicely apart making it feel open and spacious. Great booths, large windows, nice lighting. We had a large family with 2 tired young children at the next table and weren't bothered at all because of the set-up. \n\nI just noticed that they changed the menu since our visit and i'm already planning our next dinner! If you are thinking about checking this place out, JUST GO. It's worth it.", "author": "Tami M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "I came here with a Kool yelp friend name Albert and we meet up for some drinks and bar snacks. I ordered a Vodka Gimlet with Ice, the waiter did an amazing job, it was so delicious. the atmosphere is very chill and relaxing, after 7pm they has a live jazz band play music which was pretty kool. Everyone was supper nice and attentive but if your looking to eat and fill that belly i would recommending going somewhere else and then here. This place is best for drinks and catching up.", "author": "Amor V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "I really love the drinks here. They are very unique and each one is refreshing. They remind me of tiki drinks and I love it!\n\nI've had the cheese plate and that was delicious, but the portions are small. I enjoyed the deviled eggs the most. I would come back for those!\n\nThey are a little bit snobby and prefer that you have a reservation. Other than that, this place is fantastic!", "author": "Kelly G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}