{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "I came here last night with 4 friends for post-dinner cocktails.  Our server was great and very knowledgeable.  I think at one point I just told her I liked rum, and she brought me a delicious something-or-other.\n\nThe ambiance is great.  The playlist kind of seemed like one of my Pandora stations, which of course I didn't mind.\n\nI think I may have come on an off night--there were heinous rain storms.  It was a little quiet (and seemed to be mostly people on dates), but in any case, it suited my purposes.  And I can't say enough good things about the service, especially since I'm sure my indecisive friends and I were pretty annoying.", "author": "Steph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "cocktails - real properly made cocktails.  do you need more?  fine, you are a wee bit demanding.\n\nso the mac \u0026 cheese was good (even though my poor friend had to eat it without meat because of me) but it wasnt as good as the one served at apartment 138 (is this cobble hill's mascot dish?) but it was good nonetheless.  the beetroot thingy was awesome but you can put beetroot on anything and i'll like it.  and the jazz band was very good and a nice little surprise.\n\nalas, i must go back to the cocktails though that drive my star rating as my life doesnt need much more than a good cocktail.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-17", "description": "Mehhhhh Mehhhh Mehhhh\n\nThis place is over rated, went there for a late lunch with a friend. The place looks huge. Keyword Looks, sat down at a table for two i thought i was in a pre-k sitting area small chairs that are un-comfortable.\n\nOrdered the bacon sampler plate as an app. The bacon was overly greasy with barley no bread on it. Me and my friend where un-impressed by it.\n\nI ordered the lamb burger with there home made fries. I got the lamb burger with a salad. AKA they messed up my ordered did not feel like arguing and waiting for ever to get it re-done. The salad had some sea salt on it. I felt like i was eating the dead sea - so dam salty. The lamb burger was nice though.\n\nMy friend got the salmon with a a potato something underneath. The potato thing was to dry, dry like a toast. The salmon was nice though the few bites that i had to try where mostly drenched in the sauce that comes with it. The greens are also in the sauce.\n\nThe water was re-filled all the time. My cup was dirty on the outside which was not pleasant but what ever i did not have the energy to say anything.\n\nThe atmosphere to some degree felt a bit moody and dark. The music was big band era type which is nice for a bit but than it gets annoying and its like OK the place how it looks plus the sound - not doing much for me.\n\nOver all for the price i was kinda like MEH eh what? not the best impression but not the worst. Not on top of my list of places to go back too.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "I love this cool old style bar and lounge...drinks here are awesome!!  Ask the bartenders for specials!", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Easily some of the best drinks in the New York area. Definitely recommend drinking here exclusively.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "I came here for brunch and stayed there over 2 hours because of the delicious cocktails!\n\nWe arrived around 1 pm on a Saturday afternoon and it was busy but we were quickly seated. My friend warned me that the portions are small but I actually found my meal to be the right size. I decided to be adventurous and ordered the grits with pork. I never had grits before. I haven't been converted to a grits fan, but the dish was delicious. \n\nI can't wait to come back!", "author": "Connie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-14", "description": "They can muddle the mint ... but are terrible at customer relations. I have spent about $1000 there in the last week and not only have I not had one SINGLE drink bought back for me, Mutton-Chops (the slowest bartender on planet Earth) came over to tell me last night in an EMPTY bar that he wouldn't allow me to buy a THIRD bottle of sparkling wine unless I was quieter. I will never, ever, go there again. There are lots of bars on Smith Street, no one has to go to this one. Whatever with the decor - they don't know how to be. Slow and surly.", "author": "Erin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "It's very dangerous living around the corner from this place.  For my liver.  And for my pocketbook.  Definitely one of the best bars around.  Worth coming to if you're in Manhattan.  If you live in London.  If you live in Germany.  And well, if you live around the corner especially.  I typically don't stray from either an old fashioned or sazerac.  Bartenders are all super attentive and generally awesome.  Will return as always.  Maybe tonight?", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Came here from the city last week after my friend had seen this place on that show \"The Best Thing I Ever Drank\" they did a spotlight on the Gin Blossom .... this place is in on Smith Street in Cobble Hill - looked up an coming with a lot of little restaurants and more shops further down Smith Street. \nWalk into the club - looked like something from the early 20's bartenders in black vests, shirt and tie ... asked the trendy question ... \"so do you like to be called a mixologist?\" Tom replied ... no, I'm a bartender, but for people who don't really understand - I may use the term mixologist loosely!!! And tend bar is what Noah and Tom did - knew their stuff inside and out numerous syrups and bitters to craft the drinks to perfection. There were even a couple of patrons who were dressed kinda 1920's ish (Indiana Jones/Trader Joe fashion) We just felt like we were transformed into another era. \nAs for the drinks, oooooooh those drinks - PERFECT- I was in awe watching them make the drinks - like a labor of love! \nFirst we had the Gin Blossom and a Mint Julep (oh FYI the bar menu only gives a sample of the knowlege that the bartenders have) I actually didn't know what I wanted at first and Noah asked me what I liked and made me a Mint Julep. We did eat a lil something Oysters Rock something - very yummy delish as well BUT our plan was to venture out into Smith Street grab a bite and then come back for another drinky drink!!! \nRound 2 after eating across the street (next review peeps) \nwe wanted something light and champagne-y to end of a great afternoon! We told all of this to the other bartender Tom - he knodded his head and started concocting - he even dipped a straw in the drink and tasted it himself for accuracy!!! In glee with delight what's this - \"a French 75\" took a sip and - it was on and poppin' - THIS IS PROBABLY THE BEST DRINK I HAVE EVER HAD!!! I asked him how did the drink get the name, without missing a beat - he begins .. this drink is named after a peice of French Artillery during WW1 and basically packs a punch. (yes I googled it afterwards) we had one - trust me this drink is so smooth you could drink it like water, drinker beware we stood up and yes we felt that punch - looked at each other and smiled!!!", "author": "Karen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "Another quality NY cocktail bar.  An oldschool lounge feel.  A nice cocktail list of classic drinks remade with care.  Bartenders are friendly and knowledgable.  Creativity combined with fresh fruits and juices, a wide collection of liquors and bitters.   A recipe for success that continues to work for many places, ar Clover Club it is no different.  The weather was nice, the front doors were open, had some delicious fresh oysters and a rum based cocktail.  Some great happy hour deals as well. What more can you ask for?", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "Unassailably good cocktails and small plates, made with care. Moved out of the neighborhood,  but will keep coming back. Especially love the eponymous cocktail. Yum.", "author": "Kristen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "Delicious drinks, even worth the 1 hour wait for a table for six. (We waited at a pub one block away.) We went for my friend's birthday around 10pm on a Saturday night. For drinks, I had the Clover Club and Port of Call and loved both for their distinct flavors. The menu is great for a group of people to figure out the bill, as every mixed drink/cocktail is $12.", "author": "Susanna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "One of my new years resolutions was to find places in NYC where you could get a proper \"Adult\" drink.  Well, I was out in Brooklyn with a couple of friends the other night, and happen to stumble upon the Clover Club.  The bartenders were extremely friendly and knowledgeable and definitely put their heart into each drink they made.  This is a lounge type of place, with plenty of room.  The attire is weekend casual (button down shirt and jeans for the guys).  If you like Brandy, I recommend ordering the Washington Crossing.  Gentleman, this is a great place to take a lady friend after dinner.", "author": "Douglas G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-08", "description": "The Clover Club used to be a favorite of mine for fancy cocktails. However, I had a horrible experience there last night.\n\nFirst, the hostess insisted on seating us in the front of the restaurant. I understand that they may want to save larger tables for larger groups--but it was freezing near the door, and there were several tables in the back that remained empty for the entire time we were there. \n\nWe ordered our drinks and dinner and waited about half an hour without either. (During which time another couple sat down next to us and then left because no one ever came to take their order.)\n\nFinally, the food and the drinks arrived at the same time. (Which is a huge pet peeve of mine--especially when my cocktail costs more than my food.) I ordered the mac and cheese without bacon (not a special request, this is on the menu), and it came with bacon. My boyfriend's salmon tasted like it was rotten. He ate a few bites of it and spent the rest of the evening worried that we would get food poisoning (he didn't). They did comp us for his meal, but considering everything I think that a supposedly upscale place should try a bit harder to make things right. \n\nAt that point we still might have considered getting another round of drinks, but the waitress disappeared for another 20 minutes or so--and by then we were ready to go.\n\nI'm so disappointed! The only the reason I'm giving them 2 stars is because of the positive experiences I've had there in the past. I hope that they were just having a really bad night--but I don't think that I'll be going back to find out.", "author": "jennifer b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "perfect.  Great place for a date and/or nice relaxing drink.  Cocktail menu is legit and each drink is crafted to perfection, doesn't get much better", "author": "Chris K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "Best food ever!  From the juicy blue cheese burger, to the chips (crisps) served with a side of creamy white sauce, and the decadent macaroni and cheese, you just can't go wrong.  I am not a fan of the fries, however; they are a not crispy enough for my taste.  Incredible cocktails!!!  The secret must be the intense 40+ seconds of shaking before serving.   Great live 30s-40s jazz band on Wednesday's.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "Very nice place.  Food is good.  Service is good.  The bathrooms and downstairs is out dated/needs repair and a good cleaning.  Peeling wall paper and writing on the bathroom walls.  If those are repaired, I would give more stars, since look would look cleaner.", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Went here for anniversary cocktails after dinner and was not disappointed. It was not the cozy place I had hoped for, but the great band playing saved the mood. The drinks were DELICIOUS although a little expensive, but for a nice occasion completely ok. We also ate some appetizers and they were good as well.", "author": "Grazina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "This place is absolutely charming:  warm, comforting, and old school.  The drinks are absolutely delicious, and the food is amazing.  If you go, you must try their potato chips fried in duck fat.  It is heavenly.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Cozy atmosphere, Wednesday night jazz, perfectly crafted cocktails and delicious snacks? I'm in. Their old fashioned is to die for and you can't go wrong with the deviled eggs four ways, mac and cheese or steak toast.", "author": "Jane H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}