{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "Clover Club is another reason to love Smith Street. It's clear why this place gets so much great press. The powerful combination or ambiance, great drinks, and helpful staff combine to create a very enjoyable experience. My friends and I barely had any gripes.\n\nA sizable cocktail menu provides ample selection and the helpful servers know their stuff when it comes to the drinks here. Our waitress was happy to provide recommendations and she wasn't hesitant to let us know which drinks she liked and disliked. Well-trained bartenders are quite adept at preparing great libations, and at around $12 apiece it's not too over-the-top for a cocktail lounge of this caliber. It was also refreshing to see a few good beers on tap as well, as an alternative for anyone staying away from liquor.\n\nClover Club is a great space for a bar like this: there's a back \"parlor\" room here that would be great for a private event, but the real action is definitely up in the main room, which boasts a beautifully-tiled floor that probably hasn't been altered in many decades. Although sitting at the 10-seat bar is pleasant enough, the prime seats are definitely up at the front, especially during warmer months when the front windows open up right onto the sidewalk. Cushy leather booths toward the back of the main room work well for medium-sized groups and they are actually available by reservation. There is plenty of seating here, so I can't imagine it is too difficult to get a table, even during peak hours. The decor -- with a general theme of black \u0026 brown, including plenty of exposed brick -- makes you feel like you're in a modern version of an old-fashioned lounge. During colder months, I envision Clover Club as a very warm and inviting place to sit back and watch the snow fall with a drink in-hand.\n\nOur one complaint was that the service could have been a bit quicker. Part of the Clover Club experience is a very relaxed vibe. Patrons here are encouraged to come in, sit back, enjoy a great drink, and take in the experience. There's no rush. And my friends \u0026 I were into all of that... except we had a dinner reservation and we found ourselves looking around a little bit for our waitress throughout our visit. Thus: 4 stars, and not 5.\n\nDespite that one hiccup, we had a very pleasant experience and I'm really looking forward to returning to Clover Club to sample some more cocktails and even try brunch sometime. Considering how much more accessible and unpretentious this place is in comparison to places like Milk \u0026 Honey or Death \u0026 Co, I'd say Clover Club has those spots (and others) beat by a mile.\n\nOverall impression: aside from our dissatisfaction with the speed of service, Clover Club has so much to rave about and I would highly recommend it as a date spot, for small groups, or anyone looking to relax with a great cocktail.", "author": "Marshall H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "If you like imagining yourself in the 1920s, Clover Club is the place for you.  It's a fairly new place, but the wood panelling, vintage tiles, antique wall sconces and leather banquettes create the illusion of pre-war elegance.  I first slipped in on a winter evening and warmed myself by the fireplace in the back room, and the drinks warmed me right up as well.  Though rather expensive for Brooklyn, the cocktails here are expertly crafted and inventive.  Yes, they aren't large, but they are generous with the booze, so you don't want to get drunk too quickly. Having personally experienced the difficulties of achieving frothiness from an egg white, I give the bartenders here full props.  I fell in love with the place, so my sister and I chose to throw our 20's-themed birthday party here.  Renting out the back room Sunday-Thursday is actually quite reasonable- they only require a minimum gratuity on those days, whereas Friday and Saturday have a rather high drink/food minimum.  We found Sunday night more appropriate for a smaller gathering of close friends and family.   A great time was had by all, and I think I sampled four or five of the many cocktails on the menu.  Though not exactly period, the guacamole was a big hit.  I think my favorite drink here is the Clover Club- fruity, yet not overly sweet, and it's served in a dainty saucer.  Reading about the origins of the Clover Club on the menu, you feel there is a dash of history in your drink.  If you feel like rolling your stockings down, head to Clover Club for a roaring-20s good time.", "author": "Briana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "Mixologist Julie Reiner offers Cobble Hill residents a sheik and sophisticated lounge. Patrons step up to the large mahogany bar and order the Clover Club cocktail, which is a blend of gin, dry vermouth, lemon and freshly made raspberry syrup. Expensive but a fun place to let loose and enjoy a great night out.", "author": "Andy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Really educated and service oriented bartenders, an expansive drink menu that is navigable even for amateurs like me, beautiful decor and an interesting layout, and I don't think there's a single complaint I could have about such a place! bars like this are the reason I love to drink.", "author": "Annabelle B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-16", "description": "A tale of two clubs:\nReviews are stellar for this place so I directed the nearest and dearest here for birthday drinks yesterday. T'was to be a simple evening of hanging out, catching up and general merriment. I chose not to reserve the back room because I wasn't certain we could cover the $250 gratuity minimum on a Monday night, however per Julie's (the nice woman I spoke with on the phone) request, I did call and let her know the approximate size of our party so she could staff appropriately. Venom alert. 8PM: The lone server said we could hang out at the two elevated banquettes since I expected between 20-30 people to stop in. Bueno. 8:15PM: We placed a food and drink order with our server after trying to get her attention for 15 minutes. 9PM: The food still hasn't arrived though more people have and the bartender has come over to ask me to keep everything on one tab and that if we couldn't do that, to please move to the bar because we can't take over TWO banquettes with 25 people who are all drinking. Of course, there's no room at the bar. We try to keep ourselves contained at one banquette though of course we spilleth over. Keep in mind that EVERYONE has a cocktail in hand at this point. It's not like we're standing there taking up space at the bar without filling their tills. \"If you stay in the banquette area please maintain 1 tab and order from the server.\" How can we, when the server is m.i.a.?? 9:15PM: Our incomplete food order is finally presented by the busser. 9:20PM: Said busser rudely tells us that the people who can't fit in the provided seating can't stand in the banquette area because that's where they run orders back and forth. 9:21PM: We're getting increasingly irate after being chastised like a kindergarten class repeatedly. Last I checked, patrons don't normally get chastised. M speaks with said busser and asks why she is speaking to us so rudely, after all, we're out for a celebration. Nasty bus lady retorts nastily in a nasty ass tone. We ask for our check, pay and leave. Luckily, it was nice out so we walked up Smith St. to Pane e Vino where we were graciously accommodated without a hiccup. Moral of the story is that the staff at The Clover Club needs some effing training in customer service before unleashing their passive aggressive (bartender) nasty ass attitudes (busser) on a very nice group of seasoned bar and restaurant patrons who have NEVER had to leave an establishment in such a huff. The lone server, while m.i.a. for the most part (probably because she was the only one on the floor), was the least belligerent character in this craptastic play called The Clover Club. THE END.", "author": "Barbara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "When it came time to make evening plans, a friend suggested starting the night at Clover Club, and I'm so glad that we did.  Never again will I feel like I have to venture outside of Brooklyn for an expertly made cocktail in a chill environment.  I loved the annotated menu, which is divided into descriptions of families of mixed drinks.  The explanations were useful for someone like myself who has but a rudimentary understanding of cocktails and the annotations gave me a greater appreciation for what I was drinking.   And appreciate my drinks I did, in an atmosphere which was far more relaxed and friendly than other places I've been to that are swept up in the current cocktail craze.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-10", "description": "The atmosphere was nice and the drinks were definitely cool and different....But the service was horrible. Our server was definitely in a rush to leave. She didn't pay attention to us, she didn't offer us more drinks or appetizers. And once we tried to order food, she said we couldn't get appetizers until five. Absolutely ridiculous. We will never come back.", "author": "S L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-04", "description": "My book discussion group just met at the Clover Club for the last time. \n\nWe chose it for the atmosphere, the class, the tasty cocktails, and the selection of comforting appetizers and desserts. We met there three months in a row, and both the cocktails and atmosphere seemed special and worth the price. But last month our small group was coming up short on the the bill and we couldn't figure out why, so two of us threw in an extra $5 to cover the difference. \n\nOn the way home on the subway I took out the bill to study it one more time, and realized we'd been charged for a drink that had been ordered, but not served, because they were out of one of the ingredients.  That explained why we were still $10 short when everyone put in their fair share!\n\nSo I called the manager and explained what happened. It was clear because we were charged for a drink that they weren't serving that night. And the manager was totally nice and flexible about refunding the money. I chose the easiest option for me, getting a refund when I came back in a month with my book group.  She said she would remember me.\n\nTonight I reminded the manager who I was and she said no problem, any drink you want on the house. The menu had completely changed for spring. I ordered something that sounded sweet. It tasted like rancid Tang. I wasn't sure if it was me, so I had my friends taste it. My two female friends thought it tasted sour and my two guy friends thought it tasted \"OK.\" One of the guys offered to switch drinks with me, but I wasn't crazy about his drink either. It was embarrassing to ask for something else, but I couldn't drink it, one sip soured my stomach. The waitress said no problem, we'll get you something else, and quizzed me about what I liked and tried to help me order something I would like. A long time later she brought me another drink. It also tasted like rancid Tang. I couldn't believe it.  Was it me???  Again, I had my friends taste it, and again, the girls thought it tasted sour and actually rancid, and the guys thought it was \"OK.\" Nobody wanted to drink it. I was willing to just not drink it and leave it at that--I was a little nauseated at this point--and did not want to be difficult.  But the waitress wanted to please, and made a point of asking if I liked it, and quizzed me some more about what I liked. None of the drinks I'd formerly enjoyed were on the menu anymore. I had lost my thirst by this point but I said \"I just want something sweet.\" A really, really long time later she brought me yet a third drink. It looked divine. It tasted...like rancid Tang with some raspberry syrup in it. Again my two female friends agreed; one of the guys said \"It's strong, but it's OK.\" He drank it. Then the waitress started to take away one of the girl's drinks before she was done. At this point we felt like they just hated us. \n\nDid they get a new bartender?  I see that everyone has written nice stuff about the cocktails. All of their drinks were yummy the other few times we have met there. I think we will be moving on now to a new venue. I don't know if they will miss us. \n\nIt's a shame because the space is beautiful, it transports you to the jazz age.  It's a nice date spot if you can find a cocktail you like.  Tonight my three different choices all tasted bad and the same.  I guess you are pretty safe with wine.  \n\nSorry to be the one \"sour\" review, but that's what happened.", "author": "Robin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "Well crafted cocktails. I go here for the happy hour (til 7pm) which makes the prices beyond reasonable for the quality of the drink. Regular prices are about $12 and happy hour specials are $6, keep in mind this doesn't include all the drinks from their extensive, ever changing menu but is a handful of yummy options. Atmosphere is nice too, grab a booth if you can!", "author": "S F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "cocktails with care....and their the best around.  Great 20's speakeasy vibe with killer jazz....nice brunch menu too.  Haven't eaten much here with the exception of the bacon tasting...yes, I said BACON TASTING!", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "This is no doubt about it, my FAVORITE bar in all of Brooklyn. I don't come here as much as I'd like because I'm such a foodie and always exploring new places, but this has the BEST and STRONGEST cocktails of all the mixology bars I have been to. Whenever I go here, I get the same drink, the 11th Hour, which isnt even on the menu anymore. It has Mezcal, Tequila, and Absinthe, and FUCKS you UP! Its also delicious, and after about 3-4 of these I stumble out of here feeling great. There is a lot of room for people to sit, there are huge tables for big groups, the A/C is always blasting, so its a nice place to beat the heat./ They also have some pretty freaking good bar food, my favporites are the crisps, which are homemade chips fried in duck fat (YUM) and served with creme fresche. The other thing I like is the sliced steak served on toast with horseradish sauce. Come here because the drink menu is huge and you are bound to find something you like...I will be back", "author": "AJ K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-01", "description": "Went here last week and was impressed by the work they did to the inside but unimpressed with the service. The menu consists of primarily mixed drinks, which require more time to make but there's only one bartender behind the bar making them. To cut back on the mixing, glasses are loaded up with ice making it the most expensive glass of ice on this side of the Brooklyn bridge. The temperature inside went from extreme cold to extreme hot, making my stay there confusing and uncomfortable.", "author": "Erin F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-09", "description": "Dear Mr. Clover,\n\nFirst, as a resident, thank you for attempting to colonize my neighborhood! With your 1928 \"ambiance\" and 2028 \"prices\", you are sure to be a hit with all the people who come over the bridges and through the tunnels to Smith Street every weekend.\n\nThe gratuitous doorman and hostess are an extra-special touch--often, when I go to a bar--sorry, \"speakeasy\"--I have a difficult time identifying which seats are \"occupied\" and which ones might be \"spoken for\". Not to mention opening the door on my own!\n\nMost of all, should you have proven to misunderestimate the buying power or faux-style goodwill of downtown Brooklyn, I wish you good luck and god speed reopening on the LES in six months!\n\nSincerely,\nAn innocent bystander", "author": "Randolph T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "The cocktails were fantastic, but it was our waitress, Nicole, that made the experience. She was incredibly attentive without being overbearing. Thank you, Nicole, for the stellar service, the club soda and making our evening great!", "author": "J Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-28", "description": "Finally got over to Clover Club.\nI'm pretty stingy. I love going out, but more often than not I'm that girl who gets a sandwich because it's 3 bucks less than the entrees. \n\nHowever -- like everyone has said, these cocktails are totally amazing and worth it. Get the French Cowboy! Mmmm! And the homemade chips! They're fried in duck fat! All of these things are delivered to you by a saucy cocktail waitress!\n\nUnfortunately, if you get stuck sitting in the front of the Club, you're tortured by their \"olde tyme\" heating system, which oscillates between blazing hot and \"holy crap where'd I put my earmuffs\" cold.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "After starting my bachelorette party at Jakewalk, we came here next.  A Saturday night around 11pm, they called my friend's cell phone to let her know that our prime table was ready (one of the semi-circular ones facing the bar in the middle of the club).  I enjoyed the Pimms punch, served from a beautiful milk glass punch bowl placed on the table.  Others enjoyed their hand-crafted, fancy-looking mixed drinks.  The drinks were strong, but tasty.  My only complaint is just the level of pretentiousness was a little high for my taste.  Still, the club has a beautiful interior, tin ceilings, iron railings, beautiful lighting fixtures.  Also, the wait staff was pretty efficient.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "I measure time and space in this universe in relation to being at clover club.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "Top notch bartending. My drinks were definitely worth the price, as they tasted great every time. Not the kind of place i expected to find there but it was a pleasant surprise. Love the lighting and the environment as well.", "author": "Marquis V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "if my grandfather Fred still were alive \u0026 kickin', he \u0026 his new orleans mafioso crowd would be looming in a back table, slipping bribes under the table, and drinking drinks only a grandfather like fred could enjoy.  \nthe clover club is the perfect high five to the yesteryears - a glorious toast to all that was great and fanciful and polite and discreet during those seedy days.  from its gold-painted tin ceiling to an endless score of beautiful bartenders, this place has made smith street all the more refreshing.  \nyes, a little pricey.  but less pricey than manhattan - and far more charming.  food is delish.  drinks are superb.  one complaint: new guests not accustomed to mingling.  let's make this place a bit more social, no?\ni'll see you around. and yes, i'll be the girl in the flapper dress.", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "I was a little afraid this place would be pretentious but I really enjoyed my night out here. I usually try to avoid crowded places but ended up here on a busy Saturday night when friends were in town. We were able to get a cozy corner chaise in the back room with a friendly cocktail waitress. Drinks are expensive but worth it, with a menu full of classic cocktails and fresh ingredients. There is some serious attention to detail here, with different sized ice cubes for different types of drinks. I'll definitely be coming back here.", "author": "Sarah H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}