{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "Drinks are great. Very pretty. I just wish the bartenders didnt wear those gay (no homophobe) lead singer of the killers vests...distracting.. The sign is equally lame", "author": "wil o."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "Another pre-prohibition era inspired saloon on Smith Street. Remember when Brooklyn Social was the lone wolf? Well, what can I say, drinks are good, atmosphere great, back room a nice treat. Only drawback is the food--portions are TEENY!! i've been there for dinner and for brunch, and the food is tasty, but really not enough for a full sized human (and to let you know, im no giant, standard 5'5\" 120 lb female). we do not want brooklyn to be like manhattan, folks. if we did, we'd live there instead. serve up all the anorexics you want on the lower east side. on smith street, we want to eat.", "author": "Spike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "Delicious appetizers and drinks.\n\nWe had the cheese plate,\nBeet and goat cheese crustini\nMini burger\nShrimp rolls\n\nWarm, beautiful, classic atmosphere.\nSophisticated and cozy.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "The cocktails here are a bit pricey by Brooklyn standards, but worth every last penny. My favorite specialist lounge in NYC, with top-notch charm and precision matching a generally unpretentious atmosphere (at least compared to hot spots in Manhattan). Incredibly knowledgeable and thoughtful bartenders and other staff deliver absolutely wonderful cocktails: the Clover Club is classically fantastic and the Gin Blossom is perfect if you're a fan of juniper juice. They also have a top-notch selection of scotch and other such sundries.", "author": "Jules S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "This place has it all - ambiance, expertly mixed cocktails, and (best of all) a convenient Brooklyn location on Smith Street. I love coming here after work. One day I'll score a booth and try the \"bacon tasting\" that another reviewer mentioned. Bacon and awesome cocktails in an early 20th century atmosphere? Yum!", "author": "Jacqui M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "one thing is certain: i'm ruined for a normal g\u0026t.\n\nyes, i've become a big fan of the multiple ingredient, unusual, well-crafted cocktail.  and so, it makes me pretty happy to have Clover Club in walking distance of my apartment.  i wouldn't say they have the *best* cocktails (Little Branch still reigns for me), but they are quite good, and they change up the menu fairly often, i believe, so there's usually something new to try.\n\nalso, the mac \u0026 cheese (with bacon) is delicious, as are the pulled pork sliders.  steak on toast and deviled eggs are also good food items.\n\nthe couple of not-quite-cons-but-definitely-not-pros that i need to comment on:\n\n1) until 7pm, they have a happy hour menu, with limited food and drink options.  the drinks are more straightforward, less inventive options, and the food is actually just smaller portions.  on my first visit, my friends and i were a little annoyed that the waitress didn't come to take our food order in time for us to get it in before 7, and thus had to pay more. but on my second visit, we did order in time, and discovered that they simply gave you less: the steak on toast was half price ($7 instead of $14) for two toasts instead of four, and the deviled eggs were three for $5 instead of the usual four for $8.  not much of a bargain, so don't kill yourself to get there early.\n2) on both occasions i found the waitresses to be nice enough but a little... inattentive.  or without personality? both?  i don't know.  my friends and i, on visit #1, found our waitress to be a little lacking, and my second visit - with a different waitress - left me with the same impression.  not bad, per se, but not what i would call good.\n\nnevertheless, i'm sure visit #3 will be coming up soon.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "Why hello, fancy vested bartender gentlefellow... I must say, as much as I love my video clerk CG townies... You're a (totes overpriced) breath of fresh air.", "author": "christine h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "Great place and great lounge feel \u0026 atmosphere, but way way way to $$$$. Order 2 Woodford Manhattans (that had way to much sweet vermouth) \u0026 2 Macallan 18. $108. I have no problem paying this, just seemed kinda pricey for a bar in Brooklyn. I've paid $75 for the exact same thing at Gotham B\u0026G in Manhattan. Nice place \u0026 nice staff, just be careful what you're ordering.", "author": "scotty t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-09", "description": "Gotta say I was pleasantly suprised. Went for brunch and  the food was really quite good.  Especially the Salmon that my friend had.  I had the cheese grit and pork thing, which was good too, but the salmon, oh the salmon, was incredible!  What's nice is that there also is proportioning too.  Not too much, some may say too little in fact, but it dosen't over stuff.  I really enjoyed the experience, will definately go back.  Note to the wise though,  when it is butt cold outside, don't  sit close to the window, there is a cold breeze leaking from somewhere.", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-22", "description": "Went there during the big snow storm.  Perfect place to be.  Big leather sofas and tasty unique drinks.  Its a really nice place to have a drink and its not pretencious.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "Wow! I can't believe I had not been to this wonderful bar, restaurant, lounge, club and all-around awesome place to meet, greet and be merry until a few days ago.  I was fortunate enough to be invited to a friend's birthday bash in the back room with our own private bartender..ahem..mixologist..and had the best time!  The drinks were out of this world.  My fave was the Gin Gin Mule (oh soooo good!) and the punch served at the end of the night was so tasty. (I'm not sure which it was, but am guessing it may have been the Algonquin Bar Punch.)  I was lucky enough that some small bites were provided for, and what was offered was great.  One of the best things were the homemade chips and amazing dip (is there a hint of truffle in that?) but I didn't know until later that the chips are friend in duck fat (beware fellow vegetarians!)  Still, there were other delicious goodies to be had such as an amazing crudite display, and a VERY good homemade guacamole served with what must have been freshly- made (and therefore extra delicious) pita chips.  I didn't try the other fare, but there were raves from the other guests about such bites as the chicken skewers and the cuban sandwiches. The music, the classy decor and vibe, and the overall sense of a good time were abound in this lovely, lovely space.  I can't wait to go back!", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "Not a frequent visitor of Brooklyn so when my friend invited me to a gathering at The Clover Club, I admit I was pretty sure I wasn't going.  But I convinced some friends to join me so we made a night of it grabbing dinner at the Jakewalk and then heading to Clover Club afterwards.  We weren't sure what to expect -- we have our perception of Brooklyn and felt we would feel very untrendy but in fact we felt very much at home at this bar.  \n\nThe atmosphere was straight out of the 20s -- I could imagine people dressed in zoot suits and flapper dresses -- but it was not too pretentious or intimidating.\n\nMy friend's group was all squeezed into one of the booths in the back so when 3 of us arrived we weren't sure where to sit/stand.  We sat at the nearby booth that had a \"Reserved\" sign and the waitress brusquely told us the group was on their way and we had to get up when they arrived (which was obviously what we planned to do, so what's the big deal about sitting there until then?).  The drink menu was extensive and we all ordered drinks that contained one or two ingredients that were foreign to us but I looked forward to seeing what I ended up with.  Not much later, the waitress moved our entire group to a long table at the front, which perfectly fit all of us (I think the organizer of the gathering had the waitress keep an eye on big tables for us).  Our drinks arrived not long after.  I enjoyed my drink, the Royal Tannenbaum - it was whiskey based drink with fruity flavors.  My friend was not a fan of her Fizz drink, thinking it tasted too herbal, but she finished it all.  My other friend got a bourbon based drink served in a martini glass.\n\nWe stuck around for an hour and just as we were leaving our group ordered the punch.  It was served in a large bowl with small teacups (no straws as we imagined, but this place was classier than that).  I'd come back again to try the food and other drinks.", "author": "Reshma B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "awesome place, classy..very good mint julep and fizzes..classic cocktails from a to b..highly recommended..", "author": "Look A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "The cocktails are great!  The AMBIANCE can't be beat!  It brings me back in time to a world that I can only imagine.", "author": "L. P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "This has been my favorite neighborhood place for a great cocktail and good food for several years.  However this last week the bartender was incredibly rude, would not make me a drink that was not listed on the menu and was condescending when I asked questions about several of the menu options. What happened to the old Clover Club where the bartenders gave me stellar drink suggestions and were excited to create special drinks based on whatever I was feeling like when I walked in.  It's a shame that one person can ruin a bar, but I will not return and spend my money here so that I can be treated like an ignorant and demanding patron.", "author": "Tera T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Just went here for brunch because the place we wanted to go had too long of a wait and Clover Club had empty tables.  This ended up being a lucky move.  The waitstaff was friendly and attentive.  The food was delicious.  And we sat up front by the windows so it was nice and bright.  A gem of a brunch spot on Smith St.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "I wanted to go to the Clover Club when I first read about it in Food \u0026 Wine - it sounded like a great change of pace from the usual bar scene.  I finally had the chance to go on a recent cold December night.  The Clover Club is the perfect choice for warming up on a cold night.\n\nOnce inside, I felt like I should have given a password at the door.  The details of the bar combined with the drinks and great choice in music (jazz and singers from the 20s and 30s) give the place a speakeasy feel.  This is an excellent choice for a date.  The bartenders were great, especially given the amount of detail that goes into each drink.\n\nThe Clover Club is ideal for a night out with close friends or a date.  It is pricey, though, so make sure to bring enough cash or a credit card.", "author": "Tressa D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-16", "description": "went for drinks on a balmy sunday.  good cold drinks...but you know that means a lot of ice for a lot of money, but the mixology was nice...its what i went for.  i hear the bread puddin' is quite good as the owner is from the south and you know its done well down there!", "author": "Tim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "I recently had a lovely evening here. The food was outstanding, the cocktails were great. There was a nice jazzy live band. All things that make for a wonderful dining experience. To top it off I left my wallet in the restaurant, and the following day, I phoned them in a panic. I was informed that they were holding it and I could pick it up whenever. Great food, great drinks, and honesty and decency thrown in the mix. Thanks again Christine. Highly recommended!!", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "Excellent brunch spot and great place for an evening soiree with friends.  The decor is gorgeous, especially the back room with the fireplace.  It's not always comfortable to eat at some of the tables if you're sitting in an armchair, but if you're sitting in an armchair that's the price you pay for being able to sit back and relax in style.\n\nService on the whole is good, although we did experience an order not being put in properly and no make-up side or drink offered to apologise for the excessive wait.  Still, they managed to accommodate a party of 12 one evening, including a 6 year old and a baby (who both left before 9) and everyone had a great time.  \n\nThe maple bacon is to-die-for and the baked eggs with truffles and leeks are exquisite.  The potato pancakes are crispy and delicious, and my egg-dairy-nut-allergic niece was able to eat them with ketchup (instead of the regular sauce).  The egg sandwich is a great hangover cure, and the lamb burgers are juicy and incredibly more-ish.  \n\nI do hope this place is able to retain its Brooklyn feel for being beautiful, fun, serving good food, great cocktails and being unpretentious - but some of the patrons here look like Manhattan-wannabes and that can be a bit off-putting.", "author": "Christina L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}