{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "Really liked this place. When there the other night, they had a live jazz band doing old school 40's kinda big band stuff. They were really good. The drinks are very expensive (nothing under 12 bucks) but its worth it. Very high quality cocktails and a great venue. Will be returning.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "I walked in with two friends when they opened; at 5:00 on a Monday evening. It was cold and wet snowy out. We snagged the chairs by the fire, curled up in them, and drank fantastic cocktails for hours.", "author": "Maia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-27", "description": "FOOL ME TWICE, SHAME ON ME!\n\nI really wanted to like this place, really. These folks serve weak, overpriced drinks with a heaping side of condescension. They really seem to think they have something special going on, something much more important than their actual customers.\n\nI gave Clover Club a second chance today, hoping I just had a bad bartender the first time. I came for \"happy hour\". After having a couple drinks and appetizers, the bartender dropped a $70 check on me. He VERY rudely informed me that they had cancelled happy hour \"because it's the week between Christmas and new years and a lot of people are not working anyway\".\n\nI explained to him that I had come specifically for happy hour, and ordered what I ordered because the items were featured for happy hour. I asked what would make them think it was reasonable to secretly cancel their happy hour specials just because there might be some additional foot traffic on Smith St in late December. He shrugged his shoulders and walked away.\n\nThere are way too many awesome places with great drinks and great service on Smith St to waste your time in this overrated wannabe hipster speakeasy. Steer clear.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "I think of Clover Club and I think of an after-hrs bar scene from Mad Men. That back room consistently appeases my inner regal appetite. Love this place. That is all!", "author": "Ana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "Fantastic cocktails, made with care and by hand.  You will wait for yours to arrive, and it will be worth the wait.  Try the Rum Swizzle.  \n\nI also had some small plates to soak up the booze.  The mushroom crostini was quite good, the other things we ordered were less memorable, perhaps on account of the fine cocktails.\n\nSwizzle me!", "author": "Adam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-11", "description": "this has become one of my staples and i've been back at LEAST 5 times since my first review... everytime without fail, the cocktails are tasty, the service is welcoming and prompt, and the crowd is a cool eclectic mix from the neighborhood and beyond. \n\ni prefer sundays when there's room to spread out and you can imbibe a variety of bloodies and nibble on benedicts, oysters, and cheese at your leisure.  \n\ni was thinking of hosting a private party, but the prices make it special-occasion-only for me: $1000 food/drink minimum for a 5-hour time block (sunday afternoon), and the back area has a 45-person limit... maybe next birthday!", "author": "Jacquelyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "great brunch spot! just went to a wonderful private room for a bridal shower.  a sweet and attentive staff.  everything was deliciously made.  \nstart with your drinks :mimosas, bloody mary,\ndevil eggs\nbacon tasting-3 unique thick crisp bacon\nsalmon-light cured and great on potato pancakes\npork and grits-very rich and creamy\nbaked eggs-very unique-love it", "author": "Lily S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-26", "description": "Clover Club got old \u0026 tired \u0026 a little dirty.... Dirty glasses... One smelled like wet dog, Literally... Waitress was SO sure of herself , she felt she didn't need our trusty pen n paper friends... \u0026 that's right, 1/2 the order was delivered in with errors..... If I am willingly paying 15$ for 3 sips of a drink... I expect a clean glass, a courteous \u0026 competent server \u0026 smiles all around.... This is NY.... Everybody here has 15 mins ... yours seems to up!!", "author": "Lia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "As far as alcohol consumption, I am always pulled towards the wonderful world of beer as well as dabbling in the land of whiskey.  I never have been a true mixed drink enthusiast.\n\nI must say, the thoughtful, artful, and historical presentation of these said drinks at the Clover Club is quite exceptional.  The drinks are categorized by type (cobblers, fizzles, punches, royales, cocktails etc.), garnished with their history and finally topped with the ingredients.  I succumbed to ordering many drinks including the Mr. Tangerine Man and the Carrera (umm, jalapeno syrup).  Although I have no street credibility when it comes to cocktails, I do have to say they were all delicious and worth the try.  Of course, I did end the night with a couple of good old fashioned beers (they do have a decent selection).\n\nThe crowd and atmosphere is nothing short of fun.  The decor is rustic , wooded, and authentic to the referenced era.  The prices are a bit high, but when you see the effort placed into making a drink, as well as the quality of the product itself, it's almost worth bearing.\n\nAnd finally, I must add lamb burger with goat cheese was well cooked, moist and flavorful.  The sweet potato fries were crispy and not too greasy.  Oh, and my girlfriend had something similar to a lobster roll (my mind can't recall what it exactly was) and it was delicious as well.\n\nI will definitely return to sample some more of this mysterious world.  Good job.", "author": "Joey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "I adore Clover Club and wish I lived closer.  They have a huge cocktail list, a really helpful and genuine staff, and reasonable prices.  \n\nIt was also really empty when I came here on a weekday night last year and it felt like my own personal psuedo-speakeasy.  But this year, we showed up on a Friday night and it was definitely much more crowded than my former visit, but I was still amazed that we were sat right away.  I realize it's because the big difference between this and all the similar romantic old school-style school bars in Manhattan is this place is fairly large.  No long lines outside in the freezing cold.  No claustrophobic tables.  No over-priced cocktails.  No bumping up against people to make your way to the bar or the bathroom.  We were a long way from Manhattan (if not for the F train).\n\nThe massive drink list is incredibly eclectic and they even have off-menu specialties.  Ask for the Nth Degree.  It's a combination of applejack, aged rum, and Green chartreuse.  The drink was slightly sweet, a little vegetal, and even a bit spicy.  It was a prefect combination and it was just a little too easy for me to drink. \n\nThey even have pretty decent small plates, but the stand-out are the amazing cocktails.\n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Brunch at Clover Club can be a gamble with time: some days you might find you need to wait about fifteen minutes for a table, especially if you're with friends; other days you will be able to pick what could eventually become your favorite spot in the place. \n\nEither way, the selection is consistently good: your good arrives hot, tastes freshly made, and put onto your table with a smile. All the foods offered on the entire menu are worth trying, but I myself find that their bread pudding is the dish I always order whenever I come and visit. The bacon dish is nice to share with a friend, or not, depending on what you're up for - they're all flavorful, but my favorites are the duck and maple bacon types. (The third is the black pepper.)\n\nThe cocktails are great- they have several types and each are briefly described in the menu so you know what you're going to get, not only in terms of ingredients. They are real potent, whether they are flavored with juices or a swizzle stick or are a combination of liquors, so take care not to drink too many!", "author": "Eunice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "I really enjoy being there !! Amazingly nice spot to chill out ! Good drinks and cheerful staff!", "author": "Kamil M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "I'm not sure if anyone has been anticipating the opening of Clover Club more than me.  While the 11201 zip code has a few go-to spots for the hard core cocktail enthusiast, Brooklyn Social is too small and crowded, and Jack the Horse Tavern closes too early.  More fancy drinks in Brooklyn, please!\n\nEnter Julie Reiner, mastermind behind Manhattan's cocktail haven Flatiron Lounge.  Now, if you're expecting the low-key speakeasy scene you'll be disappointed with Clover Club--no secret numbers, no unmarked doors.  But what she has done is create a larger-scale bustling neighborhood brasserie/pub scene that happens to serve top-notch cocktails and perfect bar snacks.\n\nTonight was opening night, and  CC was busy, but not annoyingly so.  I got a seat at the bar while I waited for J, and had the signature Clover Club cocktail--gin, lemon and raspberry syrup.  A little sweet, but tasty and super-frothy, just how I like it.  The main space is lovely--hanging lanterns, tile mosaic and hardwood floors, textured wall paper and high pressed-tin ceilings.  Unfortunately, when J arrived, we were squeezed in at what was most likely the worst table in the bar, a tiny two-top between two other tiny two-tops near the front of the room.  It was loud and cramped, and definitely dampened our experience.\n\nHowever, the drinks and food were fantastic.  J had the Black Mamba,  a rye-based drink with a distinct herbal taste to it, and I had the Slope--also rye, but much more in the traditional Manhattan vein, and garnished with a brandied cherry, my favorite!  I was also famished (and more than a little tipsy after my first drink), so I ordered the deviled eggs from the small but quality food menu.  \n\nExcuse me, I need a minute.\n\nI can't even talk about how fucking good the deviled eggs were, I think my heart might break.  Four beauties on the half-shell, each topped with an exquisite garnish--bacon, truffles, yowsers.  I hit.  The jackpot.  \n\nAlthough we couldn't be seated there, I took a peek into the back room, and honestly, it's stunning.  Another, smaller bar, plus antique furniture, rugs and a fireplace.  One trillion times nicer than the main space in front, which is really saying something, as the main space is quite nice.  When we go back, we'll settle for nothing less than the back room.  And neither should you.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Great atmosphere and fantastic cocktails! This is one of my favorite places to go for drinks. The drink menu changes seasonally and never disappoints. Don't be afraid to choose something that sounds adventurous - the mixologists really know what they're doing and how to make a tasty drink.\n\nThe food is also worth ordering if you're hungry. The mac \u0026 cheese with bacon is really satisfying. For a light snack try the \"crisps\" (potato chips) that are fried in duck fat. Yum. \n\nIn winter, try for the back room. Really cozy and quiet, especially if you are lucky enough to nab the two seats in front of the fireplace.\n\nOne last thing: the bloody marys for weekend brunch are outstanding! Really peppery and delicious, if you like that sort of thing.", "author": "Joanna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "I don't tend to be a \"pricey-mixed-drink\" kind of guy.  I'm more of the \"one ingredient, probably bourbon or beer\" kind of guy.  You know, the one that admires the old alcoholics you can find in a super dive.  So I was hesitant when my friend took me here.\n\nI've never had a 10 dollar mixed drink that was worth the money, until I came here.  Fresh ingredients, professional bartending in a nice old-school way, and tasty nosh as well.  Yeah, the crowds can be a bit much.  Just come there with a small group of friends ready to get tipsy on deliciousness.  YOU'LL BE GLAD YOU DID!!!!!!\n\nThat was enthusiasm there, not a stroke.", "author": "joe r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-17", "description": "Came here late on a Saturday night for dinner and it was pretty busy.  Despite that, the two of us were seated right away.\n\nI ordered a pint of Sly Fox, a Lamb Burger, and Bread Pudding.  The Lamb Burger was juicy and and flavorful and the goat cheese they used was a nice touch.  The fries, that I choose as a side, were okay.  The Bread Pudding  was crunchy on the edges (which I like) and I thought they used just the right amount of the Bourbon caramel sauce so that it wasn't so sweet and soggy.  The currants were a very nice touch.\n\nNow, I have to admit, I am not a cocktail kind of guy and more of a beer drinker.  It would not be on the top of my list if I wanted to grab a drink but it's a nice spot overall and I would definitely take guests here for drinks and maybe a bite to eat.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-01", "description": "Oh, my. The ambiance here, though most likely meant to emulate the popular speakeasy-Cuban social club trend, falls somewhere closer to a sanitized, Applebee's version of Socialista or Little Branch. I really couldn't tell you about the drinks, because the service actually prevented us from getting that far.\n\nA group of us entered and proceeded to the back room, where some of our friends were already seated at the bar. The front room was fairly crowded, and the back seemed a logical place to congregate, as there was plenty of open space, and just a few tables with seated couples. Not five minutes later, a staff member asked the whole group to move back to the front as they \"didn't really want people just sanding around here\". When my friend asked if it was a bar or not, and thus something people would naturally expect to be able to do, the staff person replied \"Yes, this is a bar. But we want to keep it civilized back here.\"\n\nHm. Did I mention that none of us were panhandling, particularly fragrant, and that most of us are architects? Well, maybe she's right. Them crazy architects always goin' all crazy and shizz. \n\nNeedless to say, not coming back here.", "author": "Holladay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Stopped in here for a drink and a quick bite. Sat at the bar and the bartender seemed a little flustered being only him mixing drinks and the barback was just slowly cleaning the bar. My husband ordered the mint julep and I had the rose garden royale, both were great and just what we craved that noon. I scanned the menu and decided on the steak tartar, I'm glad I ordered it. Bread was crusty and grilled, the tartar was seasoned perfectly and a bright cherry red...very well made. I have to come back and try other concoctions and menu items.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "Clover is one of my favorite places to get drinks and food in the area. It's a borderline upscale but casual bar that serves limited food but carries an extensive cocktail list. The food menu is limited but really tasty, and the cocktail menu is extensive. This is a fairly new bar so it's impeccably clean and the interior is spacious and comfortable, probably the largest in the area. They also accept credit cards. \nIf this bar were a man, I would date it.", "author": "vicki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "Giuseppe...my charming, handsome and classic mixologist inspired me to love the cocktail even more.  You have to come and sit at the bar for the full effect of what this Prohibition style classic cocktail mixing will bring for your visual and sensory pleasure.\n\nNow imagine two hot to trot...if I may say ladies looking to wash away our relationship blues with a sassy yet crafty bartender and a wonderful cocktail that not only tastes so good but was amazing to watch the making of it.  Crushed ice of perfection, muddled raspberries and of course a good amount of gin and some other goodies and Walla..I have myself a very good drink.\n\nI could only have one since I had to drive myself home and we started earlier in the slope, but I will be back.  The drinks are a bit pricey ranging from 14 and up give or take, but you not going here for just a Rum and Coke...you want a cocktail, an inventive cocktail.  One that brings all your senses to their fullest.\n\nSo sit at the bar, talk with sexy Giuseppe and be amazed by what you will get.  I had to give it four not five stars only bc I like Death and Company's ambiance better but its so worth the trip into Brooklyn or if your a Brooklynite...you don't have to trek into the city.  Either way, its a Win-Win!!!\n\nUPDATE:\n\nThis is my local hangout...Nate/Ryan/Brad/Julie-the owner and of course Giuseppe are #1 in my book.  The cocktails are beyond fantastic.  What a great place to go anytime, date, business, hanging out with friends, family..whatever.  I go each and every week (which don't know if its a good thing since we are talking alcohol here but I Heart Clover Club sooo much I can't resist.)  Sit at the bar--it adds to the experience.", "author": "steph d."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}