{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-30", "description": "More casual vibe than expected.  More tall drinks than expected.  \n\nStill plenty of enticing ideas in the large selection of original recipes.  \n\nVisions of being one of the famed cocktail pioneers in the country only surfaces here and there.", "author": "Kozmo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "I've been to Clover Club twice now. \n\nThe first time I was there, I went because the AC trains were really bad on the afternoon weekday commute. I was just locked out from three trains that were too loaded with people and I went here for safe haven. \n\nWhen I went, I had the most bizarre memory of an old girlfriend, whom I had loved very much. I think I was wondering about luck--that's the symbolism of the four-leafed Clover. Luck is when you love someone very much and you're willing to cook dinner for them when they're studying, for example. \n\nI went this afternoon and the bar was still loaded with couples, men and women, women and women, men and men, and everyone was having brunch. This is a date spot. The bar is awkward for singles. \n\nThe bar is meant for the lucky.", "author": "Gordon E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Ummm the croissant French toast in here blew my god damn mind and I haven't been right since...", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "OMg the cocktails are amazing!! I love this place. My matcha cocktail was soooo good!! Can't wait to go back again. Highly recommend!!!", "author": "Veronika L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Been here multiple times already, with multiple people and thus far this place has been nothing less than a hit, every time! They have an extensive cocktail menu that is enough to induce decision paralysis, and thus far I haven't had a bad drink here yet! This last time I tried the hot, buttered rum, which was the perfect winter drink. It was pretty strong, and buttery. Their whole menu was devoted to their bartenders since they opened, with each one mentioning their favorite drink! As far as food is concerned, I  had the burger with the cheddar sauce, which was made just as I ordered it, medium rare, juicy, with a pink center, and the best pickles ever. As a side I chose the potato crisps - like massive, homemade potato chips which I ate with ketchup. They are friend in duck fat - scrumptious. The deviled eggs are great as well. They have a real fireplace, which is absolutely wonderful, rare, and oh so romantic. It's also why  I love coming here in winter time.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-27", "description": "A really chill cozy spot for a date night or just to grab drinks with friends. I had the port of call -- wasn't going to get it cause it had gin in it (not really a fan of gin) but you can't even taste it at all. Ended up being my favorite drink of the night. Bread pudding was really good. And also had a scoop of ice cream don't think it was worth $3 tho. Seemed more like a kiddie scoop that's worth $1 tbh.", "author": "Cassandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Great place !\nGreat cocktails and the food was no joke !\nWe had octopus,sweet bread and fried chicken \nMy GF is a pain/cursed with good taste and she animatedly agreed!\nMelissa was lovely \nBravo !", "author": "Fabrice D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-21", "description": "To start with, I was the designated driver therefore I cannot comment on the drinks.  My best friend commented that while her drink tasted fine, she left completely sober, and that was not her expectation based on her past drinking experience and the amount of alcohol she had.  So there is that.\n\nThe decor - likely the reason I gave it the two stars instead of one.  It's not original by any means, but its sweet.  I loved the mosaic floors.  I wonder if that's original to the structure.\n\nThe food - we ordered a lot of appetizers for 3 people.  The oysters....  I dont get it - they were salty.  And i mean i eat my oysters without any of the fancy sauces, with just lemon juice.  And no, there was really something wrong there.  Three cheese flatbread was good. Octopus was not ok.  Not ok at all.  And served with beans?  Can life get any more weird and pretentious?  Artichoke dip was the only dish I would rave about.  Mac and Cheese - dry dry dry.  Pulled pork minis - just ok.  My friends found them too spicy but I never find anything too spicy so that wasn't an issue for me.\n\nThe service - OMFGAWD.  \n\nI guess its an experience.  Not one I want to have again, but, like I said, the floor was real pretty to look at.  Described in one word, this place is pretentious.", "author": "Alena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "They weren't serving food when we walked in so we just ordered drinks, which were great! They have a number of amazing cocktails and they're all presented so adorably! Great find!", "author": "Paalika B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-22", "description": "Lousy service. The bartender on duty at the bar completely ignored us. She then had to Nerve to finally address us by said what do you want in a nasty manner. We asked for a drink menu and she gave it to us and just walked off . She never returned. for our order. We had to flag down three other bartenders and request", "author": "Malinda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "I seriously have not had a bad drink here - such a well curated drink menu, and each cocktail is expertly made. Service is always spot on and super friendly. One time I was there, the drinks took a little bit longer to come out than normal - we didn't even notice it or mention it, and they just took it off the bill on their own as a courtesy! How nice was that?! The food is surprisingly good here too - both their burger and fried chicken are to die for. If you're just here to enjoy a few cocktails and want something to munch on, their duck fat chips are amazing - best potato chips in the world.\n\nLove the vibe here too. Usually dimly lit, exposed brick, and super cozy. Even at the tables where you are close to other people, the place never gets too noisy and you can easily have a private conversation. Last time I was here they had a live jazz band with some older couples dressed up to the nines dancing lindy and balboa -it was super cute!!\n\nOne of my favorite cocktail bars in Brookyln! Highly recommend!", "author": "Gene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "*HH drinks review only* Stopped in here on a Friday afternoon around 6:30 looking for some HH specials with friend and fellow Yelper Mel T. We were seated immediately and gave the menu a glance over. The selection wasn't anything crazy, but we opted to each go with a glass of the Rosé. At $6 a pop, these weren't a bad deal for he neighborhood, and the wine wasn't overly sweet. The service was friendly and pretty quick. I only wish we had stayed for apps (I had my eyes on the oysters - $16, but I wasn't sure if these were for a 1/2 dozen) and dinner.", "author": "Cristina G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "Ordered here for the first time for delivery, and it was the worst order I have ever received in my 37 years on this planet. \n\nI paid $17 each for the miso cod, getting three total orders of the dish for my family. What arrived was laughable. Each piece of cod was literally the size of my thumb, and there were two little pieces of carrot in each dish. I'm guessing the total calories in each order was under 100. This wouldn't pass for an appetizer portion even in a fancy restaurant, and for $63 for the total order from Caviar, including fees, this is INSANE. You should be ashamed of your approach to food and delivery.", "author": "Nicholas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-05", "description": "The waitstaff makes you feel like you're wasting their time. Was there for my partner's birthday and it took nearly 30 minutes to get her first cocktail and were consistently long throughout the night. We weren't trying to get home at a certain hour or anything, the service was genuinely slow. The waitress partially spilled her second cocktail but still served it and didn't offer to clean it or bring a napkin. We waited so long for the check and when we finally got it we walked our card to the hostess and she rudely told us to sit at our table and wait for our server. I understand being busy / stressed out / potentially under staffed but I hope management reads this.\n\nOrdered the deviled eggs and salmon which were very good. The lamb burger and spaetzle were disappointing.", "author": "Graham H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "One of my biggest pet peeves about bars and restaurants is that many don't cross over well. You may have a fantastic cocktail at a bar, but they serve no food, or passable bar food or have an amazing meal, but all that's on tap is basic mixed drinks. Much like getting a partner who can \"do both\" (whatever that means), the Clover Club bridges the gap between delicious bites and amazing drinks.\n\nAfter seeing a movie nearby and wanting a to drink and eat, we came upon the Clover Club. Sitting in a quieter back room, we ordered a round of the Improved Whiskey Cocktails and some burgers. Although the cocktails took a few minutes to be brought to the table, once we got them it was well worth the wait. The key to improving a Whiskey Cocktail? Adding more whisky! I also got a Prime Beef Burger, a juicy delicious piece of meat, which paired very nicely with the whiskey.\n\nAfter we all finished and paid the bill, the waitress dropped by again and gave us all whiskey sours on the house - maybe because they were free, but they tasted even better than the Improved Whiskey Cocktail. \n\nOverall a great, if not a bit expensive, lounge and bar and a great part of the neighborhood", "author": "Edward M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "We were going to the brunch next door but it was too crowded so we ended up here. It turned out to be one of the best brunch experience!! We ordered something that's not normally seen in other brunch place. The baked egg is absolutely tasty. We have the leek one and it worked very well with the bread. Also the duck hash also was good but the meat taste was slightly lost.", "author": "Johnny Yueh Han L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Great cocktail bar. The bourbon based cocktails here are solid. Old fashions and cocktails that had coffee in it, all of them were superb. The bartender here really knows his craft. Even the sweeter cocktails were refreshing. We sat by the entrance, the sliding windows were open and the weather was great that Sunday evening. We ordered a few snacks. The one I remember the most were these chips that were fried in duck fat I think. Greasy crispy in a good way with good dip.\n\nI don't come into Brooklyn very often but if I ever do, Clover Club is one to remember. I like the atmosphere in here and the menu and bar here is just one of the best I've seen. I also love this neighborhood and I highly recommend Clover Club for those who are visiting or reside in this section of Brooklyn.", "author": "Gary L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "For some reason, I thought I'd get lucky here.  At the very least, I figured I'd score a vodka cocktail (or two).\n\nWould you believe that none of the above happened?  No luck and no vodka cocktail.  The latter made me realize how completely clueless I am as to what's on trend in the wonderful world of cocktails. You see, I didn't see even a single drink made with vodka on the menu.  It was all about bourbon, followed by rum, and then some scotch, gin and tequila thrown in for good measure, if I'm remembering correctly.  Am sure the friendly bartender could have made me something with my beloved vodka, but I was curious to try what the place clearly specialized in:\n\nSo yeah, after wanting to check out this spot for years, I finally made it here with hubby. Sat at the bar and tried an apple and fall spice cocktail, made with, I believe, scotch.  And you know what?  I didn't hate it!  In fact, it went down better and better with every sip.  Go figure.  Hubby went nuts for the bourbon cocktails he tried and I got one with tequila that was nice too.   So they can mix some drinks here.  \n\nCan't vouch for the food, though the gentleman sitting near me raved about some sort of 'bacon tasting,' he'd tried.  But c'mon, bacon...  What could be bad?  \n\nITA with Melissa M. in that the space manages to 'maintain a cozy feel feel with a bit of swank.'  It was perfect for a lazy, late Sunday afternoon pit stop after seeing a movie nearby; not too crowded, but with just enough people not to feel depressing either.\n\nBottom line:  Wasn't crazy about the $14 per price tag, especially since I tend to be a two cocktail sort of girl.  At least if I can help it.  But would love to come back and check out Happy Hour.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "I came here for a friend's birthday dinner and was able to make it for happy hour on Wednesday, and was overall impressed with the whole experience. We arrived at around 6 pm and stayed until 8ish and was able to make it for the happy hour (from 4 pm to 7pm Monday through Fridays). The cocktails were great (highly recommend the Moscow Mule if you like ginger) and all of the food tasted decent with moderately sized portions. I really enjoyed the brussel sprouts and fries. We tried 3 of their desserts--the panna cotta and bread pudding were delicious! The server was also able to complete our request of having a candle in each of the desserts so we could sing our friends happy birthday. At around 8ish we saw them setting up for the live band with a cello. By the time we were leaving, there was a line for people waiting for a table, which wasn't the case when we first came in. Highly recommend if you're just in the mood for just drinks or if you are in the mood for a celebration.\n\nP.S.--if you want the option for a non-alcoholic yet yummy drink, ask for the Mocktail menu! I tried 2 of the drinks from there and was very impressed by both of them.", "author": "Jenni W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Must go to spot in the neighborhood. Lamb goat cheese burger with a Gin Fizz cocktail, cmon my mouth is still watering ... also BEST BREAD PUDDING IVE EVER HAD- i would go back just for that alone. Nothing negative to say. Perfect all around date spot or just a place to hang and grab drinks with friends. No reservations.", "author": "Mary L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}