{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Came here a while ago for beverages, recommended by the owners of Anvil Bar \u0026 Refuge in Houston.\n\nThe environment is really cool, the bar tenders are very welcoming and helpful with drink suggestions even when they are super busy. The bar tenders are so good, that all you have to say is that you like, gin and sweet and they will concoct something that tastes good.\n\nThe drinks i ordered off the menu weren't too memorable, but tasty. I would like to go back and give a more thorough review on the food \u0026 liquid brunch.", "author": "Stephen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "Like many cocktail-centric establishments to have opened in the past few years, Clover Club is a high brow homage to the prohibition-era speakeasy. Bartenders (or \"mixologists\" if you want to sound like a d-bag), wear ties, collared shirts, and full length aprons and ply their craft behind an antique looking solid wood bar stocked with all manner of drink making odds and ends. What makes Clover Club different from other places (aside from the fact that it's located in Brooklyn and not Manhattan) is that they actually serve a number of legit pre-prohibition cocktails and, given the quality of cocktails, the prices aren't bad -- at a minimum, the prices aren't Manhattan-level bad.\n\nAs far as service goes, a couple of friends have said that their service experience at Clover Club was substandard. However, my experience has certainly differed from theirs. The past two times I dropped in for a drink, I arrived before the bar was slammed -- once in the early afternoon and once in the early evening. Each time, I sat at the bar and was served by the bartender with the full beard (sorry, nice gentleman with full beard, I've never actually caught your name) who was friendly, helpful, and attentive. Given how popular this place is, I could see service levels falling off as the crowd grows, but I'm not interested in fighting through mobs of well-to-do New Yorkers debating the relative quality of writing in the New Yorker over the past decade, so I make a point to hit Clover Club at off-peak hours. The other upside to an early arrival is that Clover Club offers solid deals (specifically, a $7 cocktail list) if you can catch happy hour.\n\nClover Club is never going to be the Brooklyn equivalent of Cheers. The vibe of this place is altogether different and, if Cheers is what you're expecting, you'll probably be disappointed. This place is an homage to cocktails made in the way that Jay Gatsby would have consumed them. Quality ingredients, creativity, and a respect for the hertige of drink are all in abundance at Clover. It's not my most frequented bar by a long-shot, but when I'm in the mood for something exceptional, this is where I look first.", "author": "John H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "People may say the nouveau, speakeasy cocktail thing is getting overplayed in the city, but personally, I see nothing wrong in a great drink and a candlelit ambiance. Clover Club does both well, and serves up one of the better cocktails I've had in NYC. \n\nAs to be expected, drinks are pricey, and if you come with a group there is usually a bit of wait (though seems to be much faster seating for 2). I prefer the backroom, where you can enjoy some fireside warmth with your date (or friends!). Tasty little snack menu too (I would order the cheese plate again just to taste the absurdly delicious syrupy cherries that come with it) \n\nSadly I no longer live a 5 minute walk away, but I will surely be back here regularly.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Occasionally the service can be really backed up.  If it wasn't I would give it 5 stars. The drinks are amazing. True Chemists!\nI have even been with a girlfriend while she was pregnant and they made her a lovely fresh strawberry beverage (no liquor) to celebrate. \n\nThe food is not as great as the drinks and can take a very long time.\nIf you don't eat meat they cannot offer you anything on the menu.\nEven the chips are fried in duck fat...oops...\n\nBut for beverages this is the place to be!", "author": "Beth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-11", "description": "Wow! Some of the best cocktails I've ever tasted in NYC, let alone Brooklyn. My friends and I sampled various different cocktails and they were all expertly made and delicious, but potent. \n\nAlso the decor is amazing, swanky 1930's style speakeasy. We ordered the lamb burger, mac and cheese and bread pudding dessert and all was delicious. Will definitely come back here and I hope to sample their brunch!", "author": "Dave R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "Roasted broccoli and cheese dusted with breadcrumbs topped with bright orange fish roe was magical... but the steak tartar resembled a raw cow organ overpowered by chopped gherkins/ capers (to the point where the only thing we got from the meat was its texture) and came with checker chips that tasted like Ruffles. Was so enticed by the description of the crisps that I ordered them, but I couldn't taste the duck fat (just tasted like potato flavored grease solidified into dry brown crispiness) and the truffle aioli was great but made me really want frites to dip in it. The fried oysters were tasteless but perfectly fried and sat in a beautiful green herbaceous puddle on top of the half shell - probably should have ordered the raw ones. Although I know I should have ordered a cocktail, I had to order a beer in anticipation of the fried oysters. They have a nice beer selection.", "author": "Suzi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "It's hard to miss the large sign designating the Clover Club in Brooklyn, but it's cocktails are not to be missed either.\n\nClover Club isn't doing the Speakeasy thing, but is definitely putting on the classic pre-Prohibition vibe. It is a reincarnation of an old Philadelphia gentlemans club. The tables are small and wooden, the bar the same. The bartenders are friendly, and skilled.\n\n I ordered the Clover Club cocktail, it's namesake being the very bar I was at. It is a frothy mix of gin, egg white, citrus and raspberry syrup with a speared raspberry on top. It was a well-balanced cocktail. It was sweet, tart and refreshing and I'd order it again if given the chance.\n\nI wouldn't recommend that you go well out of your way to go to Clover Club, but if you're int he area, the experience is more than solid.", "author": "Nik B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "Just had an amazing brunch at Clover Club.  Drinks were amazing (try the apple turnover) and my lamb burger with crisps was delicious.  Hubby had the chilaquiles at the recommendation of the waitress after we found out there were no baked eggs cause the oven was out (wtf, how can your oven be out when you serve food??). Luckily it, too, was quite scrumptious.  Only complaint is that our waitress went missing after our food came out but when she was around she was very friendly.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Amazing cocktails, and the menu provides a breakdown of everything. All their drinks are well thought-out and the service is incredibly. As is there bread pudding. Will definitely be going back.", "author": "Margaret D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "Seriously good drink.\n\nOne of my favorite neighborhood spots, Clover Club has become even more amazing with the sliver of sidewalk seating. Toast the subshine, while you sip on the most delicious cocktails. Pick your poison and if you're feeling adventurous, this is the spot to be. Super knowledgeable staff can help you pick the perfect cocktail for your day or night.\n\nThe rest is up to you!", "author": "Daniela F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Been here a couple times. Worth the trip to BK. Cocktails are unique, even their mocktails! A friend had a private party here and rented out the back room which was a lovely spot for a private event. Tried some of their passed hors d'oeuvres which were excellent.", "author": "Monica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Great cocktail den, with solid pours, craft and presentation in their drinks. Arrived with a large group and was easily accommodated. Will come back!", "author": "K. C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-23", "description": "I dislike the people here.  I find the staff oddly inquisitive, I don't really want to have to interact with my waitress much beyond some basic pleasantries and giving my order.  The other customers are here to posture.  The food is pretty good, the drinks are fantastic, and the ambience would be nice if everyone here were replaced with ... different people.  I don't know why people would come to Clover Club as if it were a 'scene,' because really, nobody gives a shit that you're here.", "author": "E S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Drinks are amazing! Try the Toucan!!! Food is also really good but they are very small portions for the price. Then again I am from LA so my judgement might be off.", "author": "Jessy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "I can't wait to go back for cocktails and apps after such a wonderful brunch experience! I had the baked eggs with chorizo and manchego which was so delicious and comforting along with a side of cheese grits. The coffee was strong and very good. \nTwo of my friends had the baked eggs with truffles and leeks and ate every morsel of it and my other friend enjoyed her omelette. The bloody Mary was spiced just right and the rhubarb spritzer was fresh and tasty. \nThe service was great and it felt like we were back in the 20's!!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "There is no other place in Brooklyn I'd rather have a cocktail. None. Period. There are exceptions. Such as the standing up at the front bar on the weekends. And that I wish I could but I can't afford to eat and drink there everyday. Man, what a bummer. But alas, after work on Sunday or maybe Saturday.. late.. I find myself in really good company. A well rounded mix of folks who have had it with the Smith Street crowd. \n\nLuckily this place has hired the best and is in a great spot. Did a great job on the decor, the ambiance and the snacks. Of note, lamb burger, mac and best cheese of your life. I've seen women go nuts over the oysters and I've seen people of all walks (even thrown out of other bars) come in and behave. \n\nIf that doesn't say something about this place, well then what does?", "author": "Lex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "I came here with my date on a weekend . She suggested this place because in her words the \"cocktails are artisanal and potent! \" We had the lamb burgers with goat cheese. We also ordered the crisps. Let me tell you the lamb burger was off the hook! They remind me of Greek beftekia. The crisps were so good we were competing to see who would get to finish them all. The sauce that comes with the crisps was like ranch but a billion times better. To wash that down I had The Slope cocktail which consists of Rye, sweet vermouth, apricot brandy and bitters. Probably one of the best cocktails I ever had!! They even  bring you backup inside  a tiny glass buried in ice so that when you're done with your first drink the backup is all nice and cold ready to drink. This place rocked!", "author": "J N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "We first went to the Clover Club after watching The Food Networks \"The Best Thing I Ever Ate\".  In a particular episode Ted Allen picked the Clover Club for their Gin Blossom cocktail.  Being a fan of gin, and the fact that every restaraunt we've been to that he has picked on that show has been fantastic, we decided we had to go there the next time we were in NYC.\n\nSo we went.  The place is not in a touristy area, big bonus!  Nice atmosphere, lots of wood, tin ceilings, leather booths, low lighting, it's just a great setting.\n\nSo the drinks, which is why we went here,  second to none!!!  I have never had cocktails this tasty.  We were just blown away on how good they were.\n\nSo the next night(which was our last night in NYC for that trip) we wanted to go back.  We get there and wow was this place crowded, much more than the night before.  The we see a live band.  I shudder as at many of the bars near us a live band means horrible Def Leppard covers.\n\nIt turns out this was a jazz band that plays jazz from the 20's.  Yes 1920's!  They were FANTASTIC!!! (just google Michael Arenella).  The music just brought the evening to the next level.\n\nNow everytime we go to NYC(which is somewhat frequent, but not enough for us, we love that city) we always go to the Clover Club for great drinks, food(I love the steak tartare, my wife loves the crostini, the crisps are great too), and Michael's band on Wednesdays.", "author": "Steve P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "Clover Club is a real neighborhood gem! My fiancé and I have come many times for apps and cocktails. The nights we catch live music are some of our favorite in the neighborhood. \n\nBut more than the delicious nibbles and yummy cocktails, I wanted to rave about how the hostess Emily helped me in a pinch tonight. I was working late but needed to buy a gift at a neighboring store that was closing before I'd be able to leave work. I randomly called Clover Club and Emily allowed the store to drop off my purchase so I could pick it up on the way home. I was so touched she'd bend over backwards to help, and I definitely will return to Clover Club because of it!", "author": "Christina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "I was at Clover Club recently for an engagement party and I just fell in love with it. They have a wonderful private room in the back which is where the party was held.\n\nIt was pouring the night of the party so when we arrived in the private room and there was a fire going and lots of cushy vintage furniture to sit on we were happy people. Add in the amazing cocktails and we had it made. The menu had several speakeasy-type drink options. I had a parchment fizz and it was perfect.\n\nThe staff were incredibly friendly. We had some \"bar snacks\" during the party including the homemade chips w/ creme fraiche (incredible and addictive), the pita bread w/ hummus (just OK), the steak on toast (very good) and shrimp rolls (skipped those).\n\nI was eyeing the lamb burger but I didn't end up ordering it. Next time though it's on my list!\n\nThis is a really great spot, it'd be perfect for a date.", "author": "Bethany P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}