{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "Came here for drinks a while ago and just had brunch there. The brunch is REALLY good and I will now make it a regular brunch spot. Our party got the BLT, the baked eggs with leeks, truffles and parmesan which came with argula and proscuitto, and the special which was the french toast with fennel. We also shared the bacon sampler. Everything was absolutely delicious and the drinks are always amazing as well. Definitely recommend this place!", "author": "Urban B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-19", "description": "went there on a weekday night.  probably ten or so other customers.  bartender was very friendly and helpful.  not at all snobby or pretentious.  drinks were varied and very tasty; deceptively strong.  the food/bar bites were different and very good.  I hate the crisps which were like potato chips cept they had truffle oil and cooked in duck fat.  we also got the deviled eggs which were very good.  the mac and cheese with bacon had tasty chunks of bacon but was a tad too salty for my taste.  i would definitely make another trip to brooklyn to visit this place!", "author": "Peter H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-10", "description": "had heard about this place through Urban Daddy and was intrigued by the concept of a drinking club. unfortunately, i tested it only for its brunch and didn't even have the drinks (new years' detox happening among the group). the drinks menu, though not sampled, seemed to offer some interesting options and was laid out in a smart way. as for the brunch menu, the selection was small, but adequate. i had the braised pork and cheese grits which didn't disappoint but didn't delight either. a friend's baked eggs with truffle butter and parmesan, however, had the perfect flavor and consistency for soaking up with sourdough toast. and even though i am more of a savory girl, the ricotta pancakes surprised with their airy and not spongy texture. i think this place would be more enjoyable as a drinks spot, particularly the backroom with its couches and fireplace.", "author": "Rebekah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "its great -  a little expensive. its nice for a drink and an appetizer. service is always very very good.", "author": "David B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-16", "description": "pretentious, overpriced, and rude!", "author": "Ange L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "great cocktails and very friendly and patient bartenders.  these drinks take a while to make, some people get a bit impatient but the bartender was very gracious. oh, and a great menu of very substantial - and delicious - snacks. you can even make a dinner of it. lovely summer drinks, including one with tomato and basil. highly recommended.", "author": "adzia m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "i took my fine time visiting this spot because i am honestly really starting to be so over the whole mixology, fancy julep trend. yeah yeah yeah, we know. muddle some shit in there, charge me a vulgar amount of money, and call it a day. however, i was very pleasantly surprised by clover club. spacious and cozy all at the same time, it has a pleasant old-world feel without being too precious about it. dark wood, soothing music and an incredibly extensive and well-thought out menu of drinks. their pimm's punch is highly recommended as are their hemingway daquiris and pretty much everything else i tried but don't remember since i have zero restraint when cocktails are this good. prices were not astronomical (like the tend to be at say, hotel delmano which is in a similar vein)-things ranged from 10-14 bucks, most drinks safely hovered around to 10-11 buck range. the presentation of these puppies is really exquisite and great care is taken with all aspects here-fancy little clover club cocktail napkins, tall glasses of water, special ice cubes, the works. but there is nary a drop of pretension in this lovely watering hole-the staff is gracious, wonderful, quick, funny and a pleasure to spend an evening with.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I don't like bars so this is the sort of bar for me. Husband and I went around 1 AM on a Saturday night and the place was full but a wait for a table was still pretty short. I was starting to come down with a wicked cold and the ginger-heavy drink I had (a Nola Mule, I think?) was just the thing to soothe my aching throat. DH's cocktail was also quite good. I don't recall the name but seem to recall it involved blackberry and champagne. The people-watching was good. The decor was very nice. The music was too loud for my taste but not ridiculous. The service....well, we ordered truffled potato chips and our waitress just forgot to put our order in. Even after she remembered, it took a long while for them to arrive. The creme fraiche dip was nice but they were nothing at all special and not worth the cost. On the other hand, my husband sampled a beer for just $2 and was really pleased. A really good time was had by us both and we'll be back. Final bill for two cocktails, one app and a baby beer: $31. Fairer value would be: $25-$27.", "author": "Alexis L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}