{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-07", "description": "I really wanted to give them 4 stars, but our food took about an hour to get to the table and when it finally did, my delicious chicken was floating in a sea of cole slaw juice (vom). I absolutely loved the bacon sampler and our waitress was a doll! Unfortunately, when the food arrived, we were so famished we didn't even bother telling them it was luke warm. I wanted it to be amazing and I know it had the possibility of being just that, but it didn't live up to the reviews. Sadly, I don't think we'll return.", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This place is amazing. You absolutely have to go. Great selection of cocktails, wine, food, etc. You have to have the Champagne Cobbler and the crisps.", "author": "Lorelei D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "This is my millionth review of the day and I still have the energy to share with you all how wonderful this place is. First of all it's in beautiful Cobble Hill...home to, well...Me. I've been here several times and I've always walked out with a smile on my face and a satisfied palate. \n\nI recommend you start with their deviled eggs (four flavors) and/or their oysters served with red wine mignonette....continue to order a delicious lamb burger, followed by a mac and cheese (DON'T SHARE). Have a side of the delicious (and greasy) duck fat tossed crisps- no regrets. \n\nI've had other plates on their menu, all of them delightful, these however, are the ones I remember for their simplicity and taste. Enjoy their wednesday live jazz nights and feel free to get up and dance (no one does, but you can change that). I also hear they have amazing cocktails...!", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "High priced but delicious. The drinks are top notch. If none of the cocktails tickle your fancy, just tell the bartender what you like and then close your eyes and do a trust fall.\n\nBe sure to try the bread pudding... gawd it's good.", "author": "Stacey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Port of Call was exceptional. The vibe is exactly what you want from a Brooklyn lounge. One of my favorite drinking spots in all of NYC.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "I give this place 4 stars only for the quality of drinks and food. Bar stuff is completely unfriendly. I got from them zero smiles, interaction or suggestions. When my drink was finished I felt As thou I was asking him for a favor to get me another one. Over all 4 stars to clover club for decor,4 stars for drinks and all of the above but will never sit at the bar ever again!", "author": "Lana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "I rented out the back room for my birthday party and couldn't have been happier with the choice of a venue. Clover Club is gorgeous \u0026 classy, and every cocktail I had was absolutely delicious. Christine the manager was a pleasure to work with, and the process of booking out the back room was seamless and easy. We had our own bartender in the back, Ryan, who made fantastic drinks. The fireplace was definitely a huge added bonus on a cold January night! \n\nHighly recommended for drinks or a private party!", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "Love the atmosphere here. Came here for a friends birthday. This place is great for groups and they have a cute back room. The music here is not super loud so you can actually hear and have a conversation with your friends without having to scream into their ears. The drinks and food here are amazing.. I had the Green Giant, Park Slope Swizzle, Southside Fizz, Moscow Mule, .Deviled Eggs, Crisps, Summer Risotto, Their happy hour is M-F 4pm-7pm.", "author": "Ching I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "I would have to say, bottom line, that this is the place to beat for cocktails in a neighborhood full of bars.\n\nIt features top quality drinks at slightly lower than Manhattan prices, a nice atmosphere, good service, delicious snacks.\n\nWhat makes it a real winner, I think, is that it's very versatile. You can go for before dinner drinks. You can go for after dinner drinks. First date? Yep. Hundredth date? Even better. Girls night out. Mixed group. Family in town. Craving a drink and bored with vodka tonics. Killing time. Celebrating a birthday. Etc etc.\n\nThey have a huge drink list, which changes ever so often, and features a wide range of beverages to please any palate. They have an outstanding brunch featuring a full menu, but at night they just serve bar snacks. Classy bar snacks like duck fat potato chips with truffled creme fraiche, but snacks nonetheless. In fact, if there is a downside to the Clover Club, I sometimes wish they served a full menu in the evenings too. It may not be logical for them, or maybe they just want to focus on drinks, but their brunch options are so damned delicious I think they'd make great dinner.\n\nA great place to have in the neighborhood, and definitely worth the short trip from Manhattan.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Stopped by for a lovely breakfast one Saturday morning. Their griddle was out so no pancakes :( but the baked eggs and egg sandwich were wonderful. And the potato pancakes were so on point ( truffle créme fresh had me on cloud nine!). They also serve stump town coffee, huge win!", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "AMAZING. The atmosphere is perfect, not stuffy. And the drinks are incredible. Can't wait to go back!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "Top shelf liquors, custom cocktails, and smartly dressed bartenders complete with ties and vests with an impressive complement of cocktail ingredients at their fingertips.  The bar was dark and noisy, lit by either perfectly dimmed lights or lots of candles.  We had to elbow our way to the bar and found a cocktail menu of drinks I was completely unfamiliar with.  A Brooklynette do-gooder saw me struggling, but heard my girlfriend mention her desire for Champagne and she jumped in with a perfect recommendation for their pear-Champagne concoction (not to be found on the menu).  I went with my bourbon manhattan standby which was easily one of the best of I've ever had.  \n\nEither I was remarkably comfortable in the space or it actually didn't take long, but we were able to get seated in a cozy candle-lit table in what felt like a short period of time.  There  we were able to order drinks and food without the chaos of being at the bar.  \n\nDespite having a wonderful time, I can't give it 5 stars for a few reasons.  I was overwhelmed by the pressure of ordering at the bar.  Between the foreign menu items and the intensity of the bartender, and the number of people wanting to order, I was definitely not feeling sure of myself.  When the drinks ended up costing $13 apiece, I felt pretty lucky that we liked what we got.  My advice would be to try ordering your favorite drink and seeing how they do it.  I ordered mine out of panic, but it totally blew my mind.  If that's not your scene, grab a table and order through a server.  Was much less pressure.  The turn around from the server was also extremely quick given how long it took the bartender just to make the drinks while I was watching.  \n\nNot perfect for me, but definitely a unique is experience with top of the line cocktails.  Give it a try next time you're in Brooklyn!", "author": "Paul J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "If you're looking for a great cocktail, this is the place to come.\n\nI had the lamb burger and it was cooked to perfection!\n\nService was good, but slow. We were told we had to wait 20 minutes to put in a food order because the kitchen was backed up. \n\nOverall definitely recommend (try the cheese grits!)", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "Crowded and noisy when I went on a Saturday evening, but I suppose that's to be expected. The waitress or bartender mixed up liquors on both drinks; the replacement drinks were pretty good, but some sort of comp would have been nice given the 15-20 minute turnaround from the time we ordered to the time we received the correct drinks.\n\nWould I go back? Maybe when it's not as busy.", "author": "Dale W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-17", "description": "Thought this was a cool place until Tonight when I turned up with family from out of town espousing the Clover Club cocktails. Unfortunately this time there as a complete dickhead on the door who insisted on carding my 54 year old brother in law and not letting him in when he couldn't produce ID\nI've got news for you dickhead. The young beautiful people don't spend the money we do. This isn't Manhattan. Putting a wannabe hipster on the door is going to cost you in the long run.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "I stopped by Clover Club for a drink before heading into Manhattan for dinner. As luck would have it, I arrived during their happy hour - score! I knew exactly would I'd be sipping when I saw the Ward Eight on the menu.\n\nMy cocktail was tasty and a bargain at $6. Also, the bartender was super sweet and chatty. I like chatty. And to top things off, there were a couple of girls a few stools away who were friendly and a hoot to talk to. Plus I think they were drunk. Gotta love drunk girls at 6:30pm on a Wednesday night!", "author": "phil h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "First of all, the atmosphere here is amazing. I kind of stumbled in here on a chilly night last fall with a good friend, and we found our way to the room in the back. The fireplace was ablaze and the leather couch was so cozy. It was a quiet night at Clover Club, and it felt like we had snuck in to the clubhouse of one of those secret societies of Harvard.\n\nThe cocktail list here is impressive. I ordered the Perfect bqe and fell in love. I've ordered it every time since. They also have a great cheese plate. \n\nIf you're lucky enough to come in on a quiet night (usually 9ish on weeknights from my experience) the back room makes for a sexy, intimate date spot.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "I can't believe it took us so long to come to Clover Club.  Anyway, it's good.  I got my two favorite drinks (The Last Word and The Final Ward) made perfectly, and my wife's Singapore Sling was delicious.\n\nFood is probably a weak point here, like all the other mixology type bars, but what we got (duck fat potato chips, a lamb burger and some pulled pork) did what it needed to do for us (i.e., provided ballast for drinks).", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Great atmosphere, good music, good seating, and killer drinks. We went In Skeptical, and left inspired.  my friend had beat dust and loved it(then spilled a drink on himself, \"(it was just water guys\")", "author": "JR K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "i'm not a punisher, i stopped believing in redemption long time ago, but sometimes the temptation is just too strong and we all know that old habits die hard. so if you serve me an egg and you call it baked because you drowned it in cheese and you put the word truffle on it but i can't feel your truffle and instead i do feel your brooklyn then i would have to redeem. 2* starts.", "author": "Augusto N."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}