{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Delicious brunch, great service, and pleasant atmosphere. I ordered the pork and grits, which was creamy, hearty, and satisfying. The \"Miss You Montauk\" was like a tangerine mimosa, and I had to have 2, they were so addictive. We also got the bacon sampler for the table, which was yummy. The service was good, and I would definitely return.", "author": "Meredith F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Drinking sugar snap peas sounds like it would be terrible, but the Green Giant is maybe the best cocktail I've ever had. The General and Clover Club were also great, as was the lamb burger with goat cheese. Service was awesome and the place never got too crowded. Their happy hour deals are also amazing for such a high quality cocktail place--come before 7 if you're looking to try some great cocktails on the cheap", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "My favorite place for cocktails in NYC. It's an intimate room with a lot of charm. I love how it has a lot of the original century old decor but it's not falling apart like a lot of the buildings in the city. We had no issues getting 4 people seated within 5 minutes on a Friday night. But on to the good stuff, I'm not joking when I say that almost every single cocktail sounded amazing. Also not joking, I think I tried most of them over two visits. Do yourself a favor and check out the what's on the menu under cocktails, fizzes and collins, royales, and punches. Everything is mouth watering. Last but not least the drinks are decently strong. Do yourself a favor and check this place out.", "author": "Aaron P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I threw a birthday party in the back room (the \"Parlor Room\") of the Clover Club yesterday. It was a delightful experience all around:\n\n- The ambiance was perfect for lively chatter - lights slightly dimmed, music not too loud. The Parlor Room was perfect for 25-30 people.\n- The drinks were phenomenal! I really enjoyed the Tree House, Dream Team, and Letter of Marque (served in a tiki-mask themed tumbler), and maybe had too much from the rum and peach brandy punch bowl. \n- To top it off, we had a private bartender named Travis, who was an awesome mixologist and chill dude.\n\nOverall, the Clover Club well exceeded my expectations and made for a wonderful time.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-27", "description": "Came in for brunch and some things were good and some were just blah.\n\nI got one of the omelets and it was pretty damn tasty.  The small side salad was ok but the side of grits that I ordered came out oily and runny.  Not good.  I ordered a glass of OJ and it was great.  Then I ordered a mimosa and it looked funky.  Like they poured champagne in a glass and dropped an Airborne tablet inside.  I know they didn't do that but I'm just trying to describe what the drink looked like.  \n\nService was ok.  It was really busy but our server was nice and did a good job.  \n\nI would eat here again.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "This place is amazing! We ordered drinks and appetizers. The pickled vegetables were amazing.  We had a group if four and each tried two cocktails. I got the sugar snap pea cocktail which was very refreshing. I loved the way they served the Manhattan's. They bring it in a smaller glass, and half is in your glass and the other half is brought in a small decanter sitting on ice so it stays cold. Very cool!", "author": "Dacia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "Edit: has changed. Not that great anymore.\n\nOne of the best restaurants I've been to in brooklyn (or Manhattan!) Flavors are interesting and delicious, cocktails are the same\n This is the type of place where they care about each dish individually, and you won't be able to pick favorites. Definitely try the Ahi Tuna Poké Bowl!", "author": "Jim J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Just YES. Their drinks were AMAZING. Went last night for a date and was hesitant to order the  Sbagliato Rosa (Cappelletti Apertivo, Cocchi rosa, cava rosé) because I couldn't pronounce it, but bit the bullet of shame and the waitress even told me how to pronounce it. SO glad I got it, because this drink was refreshing, late, tasty, and definitely had a good amount of alcohol in there. 2 of those and I was more than ready to try their food. We got the mac n cheese with added bacon (because bacon, cmon folks) and the brussel sprout salad. SO SO GOOD!\n\nAnd the atmosphere was perfect for a low key date. Intimate setting, you could actually hear your partner without having to shout, and super attentive wait service. \n\nThanks for a great Sunday, Clover Club!", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "I have not had a drink at the Clover Club that I didn't thoroughly enjoy. While all drinks are delicious, my favorite is their manhattan. It's phenomenal!\n\nThe food is excellent as well. I especially like the steak tartare and oysters rock your face off. Yes, that is what they're called and, if paired with one of their carefully crafted cocktails, they may indeed rock your face right off. \n\nThe only downside about the Clover Club is that it can be difficult to find a place to sit or, when it really crowded, even a place to stand by the bar. \n\nThe Clover Club is a staple of Smith street and I would say it's a necessary stop for for anyone in the area.", "author": "Collin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "I've been going here since they opened. I can honestly say they have some of the best cocktails in the city. The drinks are expertly crafted, and they change the menu often. One of my favorite drinks they have is the gin blossom. It was actually mentioned on a food network show. Really good, especially of you like gin. The food is excellent to. Get the crisps or the mac and cheese with bacon. They are both amazing.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "AMAZING COCKTAILS! Loved all 6 that the three of us got (clover club x2, clever girl, apple turnover, and I can't remember the rest but boy were they all so good). The bartenders definitely put on a show when making the cocktails that is fun to watch. \n\nOnly thing is our bill was over $100 for those six cocktails! So watch out! They are so good you won't be paying attention to the $$$$ you are racking up on your tab. \n\nGood place for a date, though, if you have the cash! Fireplace in the back/downstairs bar. Kumquats berries and other delights as part of the muddling scene.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Went for drinks before dinner with my girlfriend.  It has an old 1900s style, that was primarily candlelit, making for an intimate, classy, romantic setting.\n\nThe drinks were reasonably priced for New York, and they were fair with how much alcohol they actually put in them.  The cocktails were pretty darn delicious and it seemed like they had something for everyone, from the sweeter side to the snooty-old-man side.\n\nIt was really odd though, that we noticed almost EVERYONE else in the bar looked like they were on a date too.  I think there was only one table we could see that wasn't composed of single couples.", "author": "Zach B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-25", "description": "I made the mistake of coming here starving and underdressed. This place is beautiful and gives off a sophisticated and romantic vibe which makes it perfect for a first date. It's dimly lit, and the music was great. There's comfortable leather seating and small tables, so you may be sitting very close to the next patron. I came in with another hungry friend (who I have no romantic feelings for) so hopefully the couple next to us didn't hear our conversation. \n\nMy friend had steak over toast and I had crispy rock shrimp. Remember when I said I made the mistake of coming here starving? Our food was nothing more than a small appetizer. We really enjoyed it, though. Can't complain about the drinks either. They're reasonably priced and get the job done. While our server was nice and personable, I just wish the service was better. \n\nWe waited fifteen minutes for our server to take our drink orders, and over ten minutes for our food order. I can honestly say we barely saw her. For the size of the place, I think I saw only two or three servers. It was a busy Saturday night, and I understand that shit happens, but it was obvious that they were understaffed. Had we received more prompt service, we would've ordered more drinks, but we gave up as soon as we glanced over at the bar and noticed the overwhelming amount of people that were standing up against each other with little to no standing room drinking and socializing.\n\nDespite all of that, I'd definitely be open to coming back on a night during the week, or even for brunch.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "Went for brunch with friends and it was the best. We ordered the chorizo, duck, omelette with truffle and lamb burger. All great choices. The red snapper, a gin bloody mary, is also extremely delicious. The bacon testing was also quite good.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Had a private party in the back room on Saturday and the staff and food were incredible. Every detail was attended to and Justin and Pedro were friendly and helpful to all our last minute needs. The devils eggs, mac and cheese and sliders (along with all our food) was scrumptious. I would highly recommend this venue for any private party.", "author": "Susan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "this is for the brunch experience. \n\nCafe Luluc, my go-to brunch place was looking pretty busy so I dropped in here instead.. and OH MY GOSH. its good. Cafe luluc is more the typical american diner style breakfast and clover club is a little more unique and bougie. \nI recommend getting the baked eggs with the chorizo.. it tastes like two eggs with runny yolks baked to perfection with spicy tomato sauce.. the delicious juices that ooze out of chorizo pieces into the whole concoction is absolutely phenomenal. \nI also recommend the bacon tasting.. probably some of the best bacon i've ever had.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Great place for cocktails and food. Try the lamb burger, it's amazing! I love the coconut mint julep :) sometimes they have live music which is nice. It can be busy on the weekends so try to make reservations if you are looking to eat there. The bar is always busy.", "author": "Elisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Clover Club has a solid brunch. I went for a late brunch here around four weeks ago on a beautiful summer day. \n\nNow I wanted to order a salmon burger, but alas they were out, so I ordered a BLT. This was not your average BLT, it was gigantic and amazing. The bacon was cooked to a crispy perfectness that only a wizard would usually be able to create. My friend ordered the same and loved it. Can I just have another and another and another? I also ordered a few mimosas which were also great. When is a mimosa not great though? My friend had a bloody marry, I feel like the older you get the more you like those, I tried it, it wasn't bad, but it was no mimosa. Maybe I'll love me a bloody marry in ten years or so. \n\nThe decor was super cute and our waitress was great! If you haven't experienced a brunch here you really should.", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "I came here for after dinner drinks last weekend. I was very impressed with the decor and staff. Even though this place is in Brooklyn, their prices are comparable to Manhattan. I did not try their cocktails. A simple proseco was what I ordered. \n\nThe hostess sat us immediately. She accommodated our big party even when the entire group had not yet arrived. The waitress took our order and came back at the right time to take more drink orders. My friends said the cocktails were delish.", "author": "Toan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "Awesome place for a date night! I followed fellow yelper's recommendations and got the duck fat crisps and the slope to drink. The drinks are very strong and fancy. Some of them have special ice cubes to fit the glasses. Don't be put off by how loud it seems when you first walk in, we were able to hear each other just fine! The olives were also delicious.", "author": "Maddy G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}