{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Great little place.  Nice staff, great cocktails and menu full of small plates.  A perfect place for sharing a casual drink and bites to eat.  Highly recommend.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Okay, so in less than a week's time, I've visited this place and Death \u0026 Co.  That's kind of a big deal for me, a typical beer drinker and I think it gives me the perspective to make some observations.\n\nGetting straight to the point, I liked my drink at Clover Club better.  I'm not the most confident cocktail orderer, and I'm reluctant to venture outside of my comfort zone.  At each bar, I ordered a whiskey/rye-based Aperol cocktail.  (Why isn't Campari used at these places?  No matter.)  My drink at D\u0026C seemed slightly bland but at CC, I was loving it.  Not only was the flavor superior at CC, but, assuming my ability to judge quantities is intact, the value at CC was a bit higher.  (Probably due to its Bk location, but still.)\n\nThat aside, I also felt more comfortable in CC.  There's more space, it's decorated in a more truly vintage style, and the bartenders seemed more welcoming.  Again, this could all be attributed to location.  Vests and facial hair on the employees abound at both locations.\n\nOk, so it's clear that I like CC more.  Though these advantages don't outweigh the burden of getting to Bk for me, if you live nearby or find yourself in the area a lot, feel confident that CC is just as good as most similar places in Manhattan.", "author": "Jason J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Sharing a review that I wrote to friends a year ago. I have to return.\n\nToday's brunch menu: Pork N' Grits, which was braised pork, cheese grits, sunny side up egg and shallots served well-seasoned in a bowl of goodness. The idea of just braised pork freaked me out but I wanted to try something different. I have to say, I'm glad I did. It was seasoned perfectly and scrumptious. I couldn't eat it all but not because I didn't try --this dish was just huge. The granola yogurt that I shared was also amazing but I'm also a yogurt girl. The greek yogurt resembled whip cream but had the consistency of yogurt. It was so tasty. As for the ricotta pancakes, I wasn't a big fan but my friend enjoyed them. Overall: I'm happy I discovered Clover Club's brunch. The price tag for brunch: $40. I believe brunch should be at maximum for 2 people $50 and that's when including tip. (Preferably $40.) So I walked away satisfied with the price, too.", "author": "L L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-22", "description": "Although this place is always full of douchebags, the food and drinks are more than excellent. The cocktail wizards always make a great potion even when you ask them for something with vague guidelines.", "author": "Drew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "I can finally declare after 10 long years that I have found my...\n\nFavorite Bar in NYC!!!\n\nWhat's most important?  Drinks.  These are oh so fantastic and mixed superbly.\n\nWhat's second most important?  Ambience.  This place has it all and then some.  Plenty of comfy seating and eye candy.  I would in fact, call it perfect.\n\nWhat's third most important?  Price.  At around $12/drink for most, this was (in my sad, NYC-prices trained brain) completely reasonable!  A full $3-6 cheaper than drinks at Apotheke and others.\n\nWhat's fourth most important?  The staff and their demeanor.  They couldn't be better!  Everyone was incredibly helpful and friendly.\n\nI was lamenting that this wasn't in my 'hood, but now realize what a good thing this is.  I would be in serious trouble if it were any closer to me.\n\nps- I realize this review totally looks like a shill, but it's not!  I know no one there and found it based purely on Yelp reviews.  It just really is that awesome.", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-31", "description": "The drinks are fantastic.  My girlfriend and I came here for a Tuesday evening cocktail, because it was a Tuesday, and had a great time.  We sat at the bar and Giuseppe the bartender was obliging and talkative, answering questions about the drinks and making recommendations.\n\nThe cocktail menu was sizable and educational, dividing drinks up into categories and giving a little bit of history about each.  The food is limited to appetizers, but those are good as well -- we had the fried oyster po' boy and chips.\n\nI tried the Remember the Maine (a cross between a Sazerac and a Manhattan, and a really great drink) and a Sazerac, while my girlfriend had a Gin Blossom and a Widow's Kiss (at the bartender's suggestion).\n\nIf I'm going to spend $10 on a drink anywhere, I'm going to make it the Clover Club.  I'm afraid it will be too packed to be fun on Friday and Saturday nights, but that's the way of good bars in these parts.", "author": "Ian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-19", "description": "I'd heard good things about the Clover Club. Good location, right off the F at Bergen (and conveniently on my way home)!\n\nDrinks were about $10 each, but they were artfully mixed and intricate.\nI couldn't decide what I wanted so I told the waitress the vibe I was going for and she came back with quite the masterpiece. Some type of cobbler? it involved cinnamon and muddled strawberries and was fantastic. \n\nA 1920's band, Michael Aranella and the Dreamland Orchestra, have been playing regular sets here on Wednesday nights that I would really recommend. Great date place.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Likes:\n- Baked eggs with truffles and leeks\n- Bacon tastings\n- Pork n' grits\n- Potato pancake\n- Virgin Mary\n- Cozy decor\n- Fire place\n\nWould like to try:\n- Deviled eggs\n- Lamb burger with goat cheese", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-08", "description": "This place has a meatpacking vibe.  I stopped by there last night for a friend's birthday and the front of the place was mobbed.  There was an empty lounge in back and tons of seats at the back bar.  I was told by the manager that the back lounge has a no standing policy so I should sit at a 3 top table in the front with my 10 friends who can all stand around me.  Lame and ridiculous.   My friend ordered a beautiful $11 cocktail packed with ice and took 3 sips and then it was done.  I just think this place it contrived and uncool.  \n\nBasically - I hate it.  Can't say enough...", "author": "Srock I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "clover club's the real deal... great drinks and steak frites here on a quiet monday night. i'd return any time!", "author": "Dave N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "ooh, mamacita! this is where you get fancy drinks! \n\neverything they make here is amazing. Some of the fancy old timey drinks are pretty strong. but they are delish.\n\nit's sometimes hard to find a place to sit here, so you end up pressed against some couple on a first date talking about their jobs. (true story)", "author": "alene l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Great brunch spot!  We got there a bit late on Sunday, and were originally told they couldn't seat us for 40 minutes or so.  Defeated, we retreated to the front stoop to consider our next move.  No more than a minute later, the hostess ran out and told us she was able to rearrange some seats and get us to our table in 2 minutes.  Glad she did, because it was great!  Great bloody marys and the food was top notch.  The bacon sampler was divine, as was my omelette.  Highly recommended!", "author": "Doug C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "I'm a fan of Death \u0026 Co. and Flatiron Lounge, so it's nice to see a place like those here in Brooklyn. The drinks are expensive but worth it, and two drinks does its job for me. I enjoyed the whiskey mixes.\n\nGreat for dates, lovely atmosphere and service.", "author": "Tommy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "Filed under Things to Do section because there was no eating involved. I finally went and checked this spot down on Smith Street out. There's been a lot of brew ha since word got out that  mixologist Julie Reiner of Flatiron Lounge, among others, was opening a 'pricey' spot on Smith and Baltic in the Cobble Hill area of Brooklyn. Read full review on my site....\nhttp://www.huqleberry.com/nycm/2008/7/20/clover-club.html", "author": "andrew h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "came here on a date the other night and an celebration occasion a couple of weeks back. atmosphere is great, service is great. will be back!", "author": "Jose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "OMG, if I lived where my friend lives in Brooklyn, this place would be my downfall!!  Quick disclaimer: my husband and I are vintage cocktail junkies.  \n\nThat said, this place is like our heaven, complete with ambrosia!  Yes, the cocktails take a fair bit of time to arrive, and no, this would not be a good place to go if it's crowded.  \n\nThe Clover Club bartenders know what they are doing, use quality ingredients, and make a drink the way it should.  Recipes may be historically contentious (our vintage cocktail books make an Aviation differently, for example), but drinks are made well no matter what.  And I was shocked at the $10 price tag! The only equivalent place I can think of in LA is more than that per drink (starts close to $13-15).\n\nThumbs way, way up!!", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "A girlfriend and I stopped by the Clover Club on a Friday night. If you are looking for a very chill atmosphere with great cocktails this is the place to go.  I would suggest this place for going on a date or gathering with friends to sit and chat.  Our server Lindsey was very attentive and gave us great drink suggestions.  If you stop in definately order the Clover Club or the RoyaTenenbaum. I enjoyed both.", "author": "Monica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-11", "description": "Haven't seen the velvet rope lately.  That's good.\n\nAnd I have to admit that their cocktails are amazing.  The best I've had in NYC.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-14", "description": "Comfy with delicious drinks. Lots of ice per drink. I actually like lots of ice in my drinks.... but the $14 gin fizz feels pricey when downed in two quick sips. I wouldn't say go easy on the ice... I'd say they need to cut the price.\n\nI'm all for paying up for ambiance. To bad half the (atmospheric, old-timey) bar was filled with a baby shower/party. There's something about pregnant woman sipping water that makes you want to hit a dive bar.", "author": "Alexa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-29", "description": "This place is sexy. I don't normally find bars sexy, but this place made me have 'feelings.'\n\nWas it the surprisingly unpretentious atmosphere? Maybe.\nWas it the dramatic increase in my quality of life after spending a slight (by NYC standards) $30 on Improved Whiskey Cocktails?  Maybe.\nWas it the way the dapper bartender ran the stirring straw between his lips to taste test the drink he made? Yeah.       What? I don't know what standards you have for your four stars...", "author": "H A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}