{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Great space. Love the exposed old brick walls, the bar back is 100 years old, and the back room has comfortable couches, lounge like. The drinks were great, we had a few small plates, the fried oysters were excellent. Highly recommend and we  will be back. BTW, we drove 45 minutes from Rockaway Beach to go there. Worth the trip.", "author": "Food Dude E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This is my type of place! The food was incredible and had unique brunch options (I got the baked eggs with truffle and leeks). Plus the service was good and the front doors open all the way so you feel like you're sitting outside.", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Cozy atmosphere in the heart of Brooklyn. Food is amazing. And I love their names of the drinks. P.S. eternal sunshine of the spotless mind is my favorite movie. Friendly waitresses, delicious drinks.", "author": "Jersey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-16", "description": "I'm going to give it 2 stars because the ambience and service was great. I will def come be back had the fried oysters for appetizer which were to die for and the Steak Frites was also very good although the buttermilk fried chicken was way to salty it tasted liked they dumped the chicken in a bag of salt... besides that everything else was good just don't order the chicken.", "author": "jennifer c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "One of the few places that does ambiance well. Apparently it takes a particular genius to have the music at conversational volume because this is also one of the few places that knows how to do that. The drinks are well mixed, be it bourbon or gin. They achieve that kind of harmonious union that only some bartenders know how to do. Furthermore, get something from the 'bites' menu, between the steak tartar, the chips, and the steak on toast their menu is loaded.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "I wouldn't come back but the place is decent. \n\nThe food is ok and the service fine but not great.\n\nI wouldn't recommend the fried chicken which sits in way too much sauce however the soft scrambled eggs are good.\n\nIt took a while to get our food but the atmosphere is nice.", "author": "Antoine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "This is one of my favorite go to places for happy hour/brunch/apps with friends. They are never overly busy all the times I have been there so it continues to be the go to spot. They have a very good Moscow mule that comes wit candied ginger which is always a plus.  The duck fat chips and dip are the perfect bar app. The dip is like crack and I think I could put it on anything!", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "One of my favorite places to grab brunch. \n\nI was slightly put off the first time I popped my head in as it doesn't get very crowded during the weekend, but man are people missing out.\n\nEverything is amazing. If you can't make up your mind I'd recommend the fried chicken and baked eggs.", "author": "Sam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Yum yum yum!\nGet the blueberry frozen drink. Soo good. Sooo good. Sooo good \n\nLive jazz on Wednesday, a fireplace and cozy seating. \n\nI love this place . The end.", "author": "Hindel m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "The Clover Club was one of the only places open last night at around 11:30 still serving food (this neighborhood really dies down early compared to the city). The restaurant is large with very expensive and quality design pieces (leather couch, marble slabs for tables, wood paneling, custom glasses, etc)\n\nMy bf got the steak on toast with a side of fries. He really liked the fries and said the dish was fine, he just thought it would be more interesting.\n\nI had a hard time finding something that wasn't deep fried on the menu (I was eyeing the chicken and the  rock shrimp with aioli). There was also one salad on the menu (avocado salad) but it just seemed like mashed and cut up avocado in lettuce with a citrus element that I wasn't feeling)\n\nI settled for the tart with butter crust and basil mascarpone and had them heat it up a bit. I wish it had been warmer because I like tarts fresh to taste like they are fresh out of the oven, but this was filling and delicious. It wasn't overly sweet either.\n\nI was initially worried it'd be this small dish since the waitress mentioned it being sjallow/thin (one of the reasons i dont do creme brulee) but it weighed in at 10.7 oz in total. I totally added a star, despite the rest if the lackluster options, just because of the tart. I'll be back when I'm in the mood for dessert for sure!", "author": "Camille H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "I came here for brunch a while back. It was on the later side, so there was no line. Still, everything about this place screamed pretension, from the lack of a sign outside to the oddly-placed hostess station manned by a blasé hostess with a pixie cut who seemed to want to be anywhere but at Clover Club. We were seated right away, and I looked around and noticed that very few tables had food on them--maybe because it was late, or maybe because the food isn't all it's cracked up to be.\n\nI can't say much about the service; it was perfectly fine. But about the food... We ordered the bacon sampler plate, which was actually a decent amount of bacon for a sampler, but I'm still not sure it's $9 worth. All the bacon was good, and we surprisingly liked the duck bacon the best (and I don't even like duck). I got the baked eggs with manchego ($12), and my brunch date got the fried chicken ($15). The eggs were pretty good, but it was a tiny portion, especially the salad that came on the side. Come on, salad costs nothing--pile it on! The fried chicken was just ok, but here's the thing about the fried chicken: the menu said it was \"drizzled with honey and hot sauce,\" when it was actually drowning in it (see picture). So it got soggy and wasn't all that terrific to begin with, so... yeah, no. No thanks on the fried chicken.\n\nThis place just seems like a brunch scene, which, when done right, is totally fine--I'm happy to deal with the hype/scene for Russ \u0026 Daughters or Clinton St. Baking Co. or the like, but this just isn't worth it.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "Decided to drop in here because Lulucs, next door, had a 45 minute wait. We should have just waited the 45. Service was awful. Took 10-15 minutes for my girlfriend and I to be greeted by our server and get water. Took another 15-20 to get our check and pay. Food looked amazing but wasn't very good. I order the Duck hash. Would have been ok if it wasn't smothered in hotsauce. And my pancakes weren't all that great. My girlfriend ordered croissant French toast. It tasted like a soggy croissant with strawberry's and syrup.  Won't be back again.", "author": "Dre H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This darling bar embraces a world gone by.  When time was decadent and well let's just say fun.  The inventive cocktails borrowing from this time gone by keeps one coming back.", "author": "Melisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Nothing bad to say about this place. Drinks are the best, and the drinks menu is so expansive you literally are sitting there for 20 mins trying to figure out which one to try. The food choice are great and the ambiance is tranquil with a unique speakeasy feel. Low lighting for that intimate feeling with the special someone...", "author": "Saasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Best cocktail bar in New York, hands down. I've had great cocktails in many places. I've ultimately found something disappointing almost all of those places. Not so with Clover Club. Every cocktail has been a joy. \nGreat. Now I wish I were there instead of sitting here writing about it.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "Why is everything burnt? From the bread to the meatballs ... everything as a little too chard.", "author": "Jordan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "I love this place. The cocktails are amazing. I like the environment, it's a little sexy and a little low key at the same time. \n\nI've been to Clover Club a number of times. Mostly for drinks, but I've eaten brunch here as well. The brunch I remember as being good, the potato chips are ridiculous. Get them. \n\nAs far as the cocktails, which is why you should be going here in the first place, the cocktail menu is broken down by style of cocktail, rather then by spirt. I love this menu. Each section has a brief explanation of the origin of the cocktail type (for example swizzle) which gives you a good idea of how boozy, sweet, tart, etc. drinks in that particular category will be. Try them all! I like a good tiki drink, personally, and they make one here that's pretty epic. \n\nThe bartenders are all really knowledgeable and nice. This place is what a cocktail bar should be. It is not pretentious yet is serious about the craft.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Clover Club signature cocktail is a must\nThis spot was recommended by a Cocktail specialist, and she was right. We have tried a few of the best cocktails bars between Brooklyn and Manhattan (in a week...hic) and we were happy with all of them but Clover Club stands for being very stylish and elegantely old style.\nWe didn't try any food, just cocktails. All delicious.\nI can't wait to try their new place which will open at the end of May 2015, which I think will have a latin touch.", "author": "Gessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "You know that Seinfeld episode where George's dad and Kramer are hanging out in their billiards room and call it \"the place to be\"? Well, the Clover Club is Smith Street's place to be.\n\nWith cocktail bars as popular as ever in NYC, I just had to see what all the fuss is about. First of all, amazing decor, especially in the back room (that can be reserved for private parties). Of course, you have chandeliers, area rugs and old timey looking couches.\n\nThe cocktail menu is also very extensive and well thought out. It's divided into several sections based on the type of drink and also based on the ingredients. But I will say that there was a disparity between what I expected and what I received for certain drinks. The Spy Plane sounded like a hardcore scotch-based drink, but what I got was a giant fruity tiki mug complete with straw. Some other drinks under the Tiki section of the menu were served in regular glasses and were way stronger. So I guess ask questions?\n\nHead here before 9:30 for a better shot at getting a seat. I wouldn't even try to bring a big group here on Fridays or Saturdays.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "I just moved to the neighborhood, and about a million people recommended this place to me in the first month of living here. Came here on a Friday night around 7:45, and was told it'd be a 30 minute wait for 4 people. We went across the street and ordered drinks, and Clover Club called us immediately after they arrived. Clover Club was really understanding and gave us a 20 minute window to get back for our table!\n\nEveryone ordered a cocktail, and I was the only one not to like mine (the Willow's Fizz), but they were all so beautiful. We ordered a good amount of food, all for the table: the mac and cheese, duck fat chips, brussels sprouts, steak over toast and the fried chicken. I'm not THAT easy to impress, but it was actually all really, really good. I could have eaten the entire bowl of mac and cheese by myself, easily, and I am very picky about mac \u0026 cheese.\n\nI've also been on a fried chicken kick lately (see other reviews!) and this was really cool and different. Sweet (the lemon, I believe), but really crunchy and awesome. \n\nThe waitstaff was really friendly and energetic - listened and talked with us for a while. \n\nThe bar area really started to fill up at we left, around 11:30, so if you want to eat, I'd go earlier rather than later.", "author": "Jersey B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}