{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "Just had Brunch at the Clover Club this past weekend.  I am a big fan of cocktail bars, and I look forward to going back and drinking much more, but for Brunch the Whiskey Bloody Mary was quite good.  Fresh basil, chunky Tomatoes and a nicely spiced mix.  It was a true Bloody Mary in that it felt like I was drinking a meal.  \n\nWhich was good since the servings of actual food seem a little small.  My friends ricotta pancakes looked quite anemic and dainty.  But they were delicious.  i think I chose better with the backed eggs with truffles and leeks.  I couldn't quite catch the truffle flavor, but the eggs were baked to perfection in their cocotte with crusty salty cheese.  The plate was ably aided by an arugula side salad, buttery toast and a bit of prosciutto.\n\nBut really the menu has me at \"Tasting of Bacon\".  Three types of bacon, Maple, Pepper and Duck come on bits of toast flavored with the grease of bacon.  It was good.  I don't know if I'll be able to have bacon form the local deli again.  This is truly the way bacon should be consummed.\n\nHow about a bacon Bloody Mary? Jen had a scotch sour cherry fizz that was quite tasty and although not on the brunch menu, it is a refreshing fizz to cure those Sunday morning blues. We only had that one drink, which didn't knock us around. Not bad considering we had Whiskey and Scotch before 1pm on a Sunday. That is the sign of a well made cocktail, no?\n\nAnd thank you, Clover Club for actually playing old jazz that suits your speakeasy persona. I am sick of these stylish cocktail bars that then ruin the mood by playing crap music (I heard EO accused of this recently..shame on you boys!).\n\nThe music, food and cocktails was so good, I almost forgot I was surrounded by strollers. Almost. Oh Brooklyn. You and your babies!", "author": "Rye G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-21", "description": "I left a less than stellar review for Clover Club a few months back and received this email from \"Andrew W.\", who made up an anonymous account just to send me this message. Obviously, this isn't from a patron.. \n\"Typical, jaded LA-girl review.  You're from LA and you're calling other people wannabe New Yorkers?  You're a moron.\"\nI'm more insulted that this person thinks I'm from LA. I am definitely a moron. \nHere is my original review and I stand by it 100%:\nI wanted to like this place soooo badly! The bartenders were awesome. The place is cozy and makes me feel like an extra in Boardwalk Empire. The menu seems to have cocktails only unicorns could've come up with, but I've been here twice and have been disappointed with every drink I've ordered. I could see they're using unique ingredients and definitely put a lot of effort in, but every drink I have ordered was \"eh.\" I know all you wannabe New Yorkers want to think Brooklyn is OH! so cool, but guess what? This place sucks and so do you.", "author": "Genevieve R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "this place makes the best cocktails in carroll gardens. \n\ntheir food is ok, too but their drinks are exceptional -- this place is about listening to live music, having their amazing drinks at the bar, sitting on their giant, comfortable cushy barstools.", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "This is my favorite bar in brooklyn to date!\nIm a born and raised brooklynite and this place just feels right to me.\nLove the decor and atmosphere, cute n cozy and just dark enough. Great for a date or hanging out with a few friends. Wish the drinks were a little cheaper but definately cannot complain prices are on par with or slightly (empahasise slightly) cheaper than the the other old timey \"speakeasy\"  type of bars where ur likely to find a \"mixologist\" dressed in turn of the century garb.\nThe bartenders take care to prepare the cocktails properly, which I think is important. This place makes my 2nd favorite \"old fashioned\" in the city and only because the bourbon they use is a bit rough for my personal taste.\nI keep coming back and never have a complaint, except for when I cant get a seat on the weekends!\n\nBTW if youre hungry order ANYTHING from the food menu, i highly recomend the fritters and beleive it or not the deviled eggs(I know, im slightly eccentric) are the best Ive had, hands down.", "author": "Bruce E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Thank heavens this place is in Brooklyn; anywhere else \u0026 I'm sure the clientele would drag it down.  Now, there may be rushes of people, of terrible people even, but I avoid them the same way I avoid all those bar-rush crowds-- I don't go out around those time slots.  I'm an old man, dammit!\n\nIt breaks my heart with joy relating to you the simple truth of the Clover Club martini.  It comes, dun dun dun, with a little sidecar.  A little kicker.  An alchemical looking apparatus to keep the rest of your drink cold.  Swoon.  Seriously, swoon.  Oh, sure, all the fancy cocktails are fun.  Tasty.  The bartenders have the quiet confidence of a hitman \u0026 display over the top skill.  The make or break it for me is the martini, \u0026 I can happily tell you I sure do like them here.\n\nAlso, a friend rented the backroom for a party, once.  THIS IS A GOOD IDEA.  We had plenty of room, plenty of bartender attention, \u0026 wave after wave of hors d'œuvre.  The shrimp sliders were crazy.", "author": "Mordicai C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Brooklyn gets in on the high end cocktail craze to dazzling effect in the form of Clover Club (press suggests it's brought to you by the folks behind Flat Iron Lounge). Stopped in on a Saturday evening and found the place abuzz, which was nice to see.\n\nThe debonair, 1920s highbrow style of the place wins, big time. It sort of reminds me of the basement of Tailor, but not exactly - it's a little more retro in feel. They worked with what God (er, the previous owner of the space) gave them well - the brick walls and ceiling look like they've been there for a bit, and they just dressed the space up with some handsome settees and understated light fixtures.\n\nThe servers were all cute and charming, and had reasonably detailed knowledge of the beverages for a place so new. The libations themselves were tasty, though not quite up to the standard of little branch; they were really similar to what's on offer at Flat Iron Lounge. I tried a grandma's buck and a julep made with Pisco (can't remember the name of that one). Both were tasty. They've got the death \u0026 company style punch bowls too, and also have Newcastle on tap.\n\nWe had a pretty great experience, and this is really pretty close to 5 stars - the drinks were just slightly not there for that fifth. I still thoroughly recommend the joint and will be back.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "I'm in love with Clover Club and its ginormous ice cubes.  Went on a Friday and a Saturday night and the place was pleasantly crowded.  Bartenders were courteous and masterful.  I highly recommend the Carrera - even though it comes sans the much loved ginormous ice cube.\n\nThese are the kind of drinks you savour, and wish you could make at home.  Except they have a dozen ingredients and you know you could just never duplicate it perfectly.  Better to get it from the source.", "author": "darla s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "When I visited Clover Club, I was treated to the spectacle of an objectionable woman molesting the face of an objectionable man with her tongue.  I guess the staff doesn't want to get involved in the romantic sallies of grotesque people, but I'd like to think that at a good version of the place CC aspires to be, these people would have been escorted to the curb by a miniature sad-faced St. Bernard wearing a bow tie.\n\nThe drinks were fine.  The bartender at the Yale Club (a place I wouldn't mention if I'd actually attended that school) looks like he's been making drinks since 1882, though, and he makes them twice as good and three times as fast.  He reeks of Vitalis, though, and the clientele reeks of tennis.  So it's a question, I suppose, of choosing one's poison.", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-11", "description": "Do not go here if you are hungry. \n\nMy friends and I waited an hour for a table for Sunday brunch. Not that surprising, except that we were told our wait would be 15 minutes. This leave-you-hanging restaurant heist doesn't create repeat customers.\n\nBefore we became a hungry band of discontents, we were attracted to the bacon tasting. And, for all my frustration with the place, all 3 bacons did not disappoint, even the duck bacon (go figure). But the rest of the food was overpriced, both because of the small portions and disappointing flavor. I had an egg sandwich with rubbery eggs, two pieces of lettuce and mayo. I could have made this at home without spending $30 or standing on Smith Street for an hour. My friends tried the bloody marys. Stealing a taste, they were tasty, but as everything else, tardy. \n\nThis place looked better from the outside.", "author": "Bridget F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I was definitely impressed by the atmosphere at Clover Club. Very chill and laid back, it was the speakeasy feel with the pub casualness. I didn't have to know a password, do a special knock, do a 20 second presentation on why I should be admitted, or tell the doorman who I knew. Everything on the menu looked really good, but I decided to go with the Gin Blossom. What an incredible Martini! The flavors were out of this world, and it was made very well; it even came served in a decanter on ice how a proper martini should be. After that, I became a fan. Then out of curiosity, I tried the Telenovela. It's Tequila, cinnamon, an egg yolk and something else. \n\nI wasn't too sure about this drink, but the bartender told me to try it. So I did and I should have followed my instincts. Not to say the drink wasn't good, because it truly was. It's just a drink made for someone that likes sweet drinks, i.e. not me. It was pretty much a nog, but you had the spice of the cinnamon and the smokiness of the Tequila. It made for quite an interesting cocktail.  I'd reccomend the drink for a few people I know because I know they'd love it. I'll definitely return the next time I'm in town.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "One of my favourite places to grab a cocktail or brunch. Though this block of Smith Street is less than charming, step inside Clover Club and you're transported into an incredibly sophisticated space with top notch ambiance. \n\nThe bacon tasting at brunch is divine; the cocktails are incredible; and the spritzers are pretty delicious as well (for those abstaining from alcohol). \n\nI love bringing people here, whether guests from out of town or convening with friends I haven't seen in ages. Just go. You won't regret it.", "author": "Half P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-01", "description": "Amazing breakfast!  Only wish we had more.  We were headed to the place next door but walked out to discover this gem.", "author": "Francesca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Cocktails were delicious and unique. Perfect steak--I cleaned my plate. Great service. Stunning decor.", "author": "Annie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "Everyone likes cheap drinks, because, well, they're cheap.  They may taste like gasoline (I recently had the pleasure of High-Ten Whisky at the Skinny Bar for happy hour - I think it could easily have powered a Datsun 720) but they get you drunk, which is generally the purpose of drinking.  \n\nAnyway - back to CC.  So, these drinks are 10 -11 bones a piece and they are worth every penny.  I had two: one, a blood orange concoction called the Sorello, which was equal parts tart and potent, and the other, (the name I can't remember, because my brain is paralyzed just thinking about sipping on that sweet, yet not overly sweet nectar) was maybe gin, pear juice, champagne? and a cinnamon stick to make it this a perfectly well balanced, well seasoned drink that i wish i could order at every bar.  Alas, I know they'd never get it quite right.", "author": "beth k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "Excellent cocktails. So excellent that I hardly care about all the other flaws of the bar, namely mediocre service, and somewhat loud atmosphere. I don't think there is a bar in Brooklyn that can match the flavors, and the variety of these crafty delicious concoctions.", "author": "Mona R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "A top 3 cocktail bar in Brooklyn. Clover Club is comfy, dark and smells of old leather.  The fireplace in the back room is a game changer too. They know scotch and know how to mix drinks - what else can you ask for?  Bottom's up!", "author": "Jonathan Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Pulled pork sliders are very good. Amazing drinks menu. The waitress was not very friendly. The portions are small, so I would go there for the drinks.", "author": "M O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Second time here and I was pleased just as much as the first.  Pineapple Julep was delicious.  My friend and I shared the fried chicken and avocado \u0026 grapefruit salad.  Both were amazing.", "author": "Marisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Went for Brunch. didn't have to wait at all for a table. My husband and I both got the baked eggs with truffle and leeks. It was very good. Presentation was unique- served on a stone slab. Venue is a kind of like a loungy prohibition bar with hard wood themes... In the back they have a very cool space that is mostly rented out for private parties that also looked cool for the right kind of party. Again, sort of prohibition type feel with period furniture. Service was friendly. Food could have come out a bit faster. Also breakfast items on the brunch menu were limited. Good experience overall. Wouldn't mind going back, but also not jumping to go back for brunch due to the limited menu. With the right music, the venue would be a cool place to go on a weekend night for drinks.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Came here on a girl date. Sat at the bar and two cocktails, and house-fried chips + truffled creme fraiche later, we left feeling happy and a little tipsy. These are great feelings to have, and not always easy to come by. Trust.\n\nCute space. Darkly lit (great for bad hair days). And close by to a damn good cannoli spot.", "author": "Diane C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}