{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "If you want to impress a date, friend, or visitor from out of town, this is definitely a great choice for drinks and light fare. Clover Club is one of the stalwarts in the inventive, out-of-this-world cocktails that Brooklyn is now saturated with, but unlike other spots which waver, Clover Club is consistently amazing, pioneering, and knowledgable. Don't know what sort of booze suits your mood or picky palate? The staff are always willing to work with your tastes and find you something great from their extensive, well-curated, and varied menu. Not cheap by any means, but definitely worth the visit for the sort of drink that you savor rather than chug.", "author": "Molly O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "This place has tasty drinks. And thank you Yelp! tasty food as well. Took a friend here for her birthday, and it was quite a treat for both of us. She had the lamb burger, and she kept raving about it. I had the steak tartare. Yum. Coupled with the drinks, this place is a sure fire bet for a really good evening out. Mine was the mojito [Lot's of Burn Notice lately.] She wanted, and I quote \"something with vodka and fruit\". The poor waitress finally brought a ginger martini that proved to be a hit. We eventually hit another place with less impressive drinks, but a better view. A 1920's style jazz band would take this place to the five star level, and fit right in with the relaxed decor.", "author": "George D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "That cocktail list sure is long and thorough, but why are there so many words on it? Believe me, when I need a drink, I don't want to read Katie Stipe's life story.\n\nOutdoor seating right on the sidewalk is a plus, especially because no one  gave me a hard time about lighting up. The cocktails were all good and well balanced. (I tried more than I'd care to admit.) \n\nI probably wouldn't go out of my way for this place, but next time I want a fancy post dinner drink in this neighborhood, I'll stop by.", "author": "Julie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "New to the City and came here because of the reviews and yummy cocktails. I haven't seem it super busy but tonight's the first time there is no seat at the bar for me. \n\nThe cocktails are awesome. They better be for the price. Most of the staff is cool but the waitress and hostess always seem to have a stone in their boot. Talk to the mixologists. Especially Ryan. I like the drink called In The Cards. It's not on the menu but I am always able to get it. \n\nNice date spot. Will come here again...and again.", "author": "Jonz G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "I dare you to come to Clover Club, pick the nastiest looking drink on the menu, and order it. It will still be really good. Started off with something I knew I'd like, ventured into the \"flip\" territory. I'd usually never get something with the word \"candy\" in its name, but I did. And it was great. \n\nOh. Also. Duck fat chips!", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "I love this spot. Went in for brunch a while ago and totally used their baked eggs idea at home... It's fantastic! Their nighttime drinks are great as well.. A keeper for sure!", "author": "Piotre W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "These days, being a creative person in the food industry doesn't just mean being a chef: in this drink renaissance, cocktail \"chefs\" are just as relevant as those of the food variety. \n\nJulie Reiner, master mixologist, is the force behind Clover Club-a spot where I've had many a retro tipple. Although the drinks are on the pricey-side for Brooklyn, they are unique, fun to taste-test, and considering the other neighborhood options, worth it! They exude a classic cocktail retro-kinda-feel and never leave me with a bad hangover the next day. The drinks use fresh fruits, juices and a wide variety of liquors and bitters; this is the place for a wonderland drinking experience, especially if you're sat in the back library room. \n\nWho can resist names such as Sloe \u0026 Low, Spicy Pete and Improved Whiskey Cocktail? I sure can't-plus, as a bonus, the bartenders are incredibly nice as well! With great happy hour deals added in, forget how much your wallet is going to hurt and just have a good time. Drink it Up!", "author": "Kimberly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Nice, yummy drinks. I had the mule something (vodka) and it was perfect.  We sat in the back which had couches and more of a laid back vibe. Service was great.  Overall, I will be back and try the food next time!", "author": "Rosie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Such a cool spot for a real good cocktail. Their list goes far beyond the classics listing things you can barely imagine how they taste (so you order it, of course). Some favorites were the bourbon smash, just because it's June and the summer negroni - which had black pepper! Funky but real good. The food was great too - highly recommend the corn salad. It was so refreshing and had a but if a Spanish vibe. Olives were great and the Mac and cheese was a safe crowd pleaser. Loved the music and the ambiance, definitely a good spot for an intimate date. A good thing to know is they serve their food real late - I think they close the kitchen an hour before the place closes. Highly recommended - worth the trip to Cobble hill if you're on the other side.", "author": "Colleen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Let's be clear. These are the best drinks I've had in New York. I took a star off because it's crowded and not close enough for me to justify coming regularly. \n\nThe vibe is very hipster-classy (if that's a thing). You're going to be elbow to elbow with people. \n\nThe drinks: I'd recommend very highly the Baby Blush or the Water Cooler. Both are refreshing, and get the job done. I didn't try any food, but they do have a pretty extensive menu. Probably not for the veggies, but if you like meat and cheese, come hungry.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-24", "description": "This is probably one of my favorite bars in Brooklyn. The quality, ambience, and attention to service could rival most bars of its categories in the city. The waitress was really helpful in suggesting drinks and food pairings. My friend and I shared the steak frites and pulled pork sandwich. It was sumptuous. \nThe cocktails could be made to tailor to you holiday spirit. I had a drink, the name escapes me at this very moment, but it was exactly what I thought Xmas should taste like----cinnamon, nutmeg and cranberry.", "author": "May G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "I dream of Clover Club's Brussels sprout slaw salad with apples. Their cocktails are pretty darn good too! But that salad. Mmm.", "author": "Ellie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "been here several times--tragically couldn't find the beautiful blackberry cocktail i had the first time when i came the second. their happy hour is pretty wonderful, i had delicious deviled eggs prepared 3 different ways (deffo recommend). very chic, cozy atmosphere, art deco-ey speakeasy vibe. great for date night or afternoon happy hour with a book.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-10", "description": "Ok, both times I've been here I felt like I was getting robbed.  This place is WAY over priced.  I went in there last Sunday for brunch and I bought a $8 egg sandwich.  FIrst off, there was nothing special about the eggs (2 eggs) served on white bread and really, really salty leaf salad that was served on the side.  It was so salty I had to send it back, who the hell puts salt on their salad?  It came back still salty but not as much.  I looked at the sandwich and it was just uninspiring to say the least.  I was so disappointed- I mean I'm spending $8 for what?  Some really cheap leafs and 2 eggs on white bread..?  Really?  \n\nMy friend had some crappy pan cakes that was supposed to be covered with all this fruit.  It had..count em, 2 strawberries on them.  And it also had this weird liquid jam type of goo underneath it, she couldn't finish it it was so bad.  \n\nI'm all for spending money on quality but isn't brunch supposed to be a good deal?  Aren't we supposed to feel good about it?  Wrong! Not here.  I say they change the NYC pretentious attitude and realize people who live in Carroll Gardens don't want to spend $9 for crappy pancakes and $8 for a egg sandwich. \n\nNext time I'll skip this place and go to the deli and buy a real egg sandwich. You do the same.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "I went there last night. My friends and I were greeted with  intense dread. It was a group after work for happy hour, and the steely, waitresses (staff) were rude from the get-go.  A few of us, myself included have lived in this neighborhood for almost 20 years, and it's so frustrating to have these snotty, poser type businesses come in, and act like they are something special. The concept of The Clover Club is a nice looking bar, but it holds none of the authenticity of the humanistic environment that the 1920s era it is inspired by.  The bitchy waitress apologized after she dropped the check, but it was not sincere. I waited tables before I went on to have a career and never treated the patrons like she did. Lastly,  bar is poorly designed, the aisle way in front of the booths is the circulation from the bar well station. How is that's the customer's fault????You treat your customers like children who are paying with dimes. I know The Clover Club won't suffer at all from this review, it seems there are enough people who will be fooled by its so-called charm. On a good note, we followed up with eating and drinking at Numero 28 around the corner. Great food, bar and a fantastic welcoming staff. Made a great impression on all.", "author": "Juliet A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Cocktails are their real focus, and those are great, but this review is for what I consider to be the Best Brunch in the neighborhood, and that is really saying something. \n\nThey open early, which is a treat, and we had incredibly pleasant service. Food was served hot and cooked perfectly, and just a delightful experience (bonus: also a little cheaper than some other spots in the hood).", "author": "Roger G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "There is some serious cocktail making here, and man do they do a great job at it.  I strolled in here at 4:30 for happy hour.  Now Ive been here a few times but not for the happy hour prices which are great.  6 bucks for a quality cocktail made by a mixologist (what a cool professional title right?).  The drinks normally would cost twice that much but from 4-7pm there are a ton of things that are a great price.  I had the Gold Rush which is a bourbon based drink.  Delicious!   \n\nAlso being happy hour, I sat at the bar and chatted it up with the locals and bar tender.  The really cool thing about going before the rush is that they were literally coming up with their next drink as we hung out.  One of the guys left to pick up some clementines as they added all sorts of different concoctions to their new drink to make it perfect.  \n\nI was here years ago when there wasn't a lunch menu but now that they have one, I am going to be checking this out soon.  Obviously you know Im feelin burgers right now and the Lamb Burger sounds delicious.  \n\nKeep up the cocktail innovations Clover Club and Ill see you at the next happy hour!", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-13", "description": "If there's a nip in the air, and all you want to do is cozy up in an antique chair in front of a fireplace, with Billie Holiday singing softly in the background, and a classic cocktail in your hand, Clover Club is your place.\n\nEnjoy egg whites in your drinks? Don't miss the Bohemian Fizz (I like it with grapefruit juice) or the eponymous cocktail, the Clover Club.\n\nService was impeccable. Frankie served our group for the evening and was super sweet and on top of her game.\n\nFans of the Flatiron Lounge will want to know that Clover Club is owner Julie Reiner's Cobble Hill answer to the much loved Manhattan favorite.\n\nThe splendid vibe and topnotch cocktails (and easy F train ride) will no doubt lure me back to Clover Club very soon.", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "We stopped by this gem on a rainy Saturday afternoon for some upscale daydrinking. The back room with the fireplace was perfecly cozy and warm. I had a few Colletti royales and my bestie stuck to NY sours. Both were delicious, even to sweet drink haters like us. \n\nWe ordered the lamb burger with crisps and a side of potato cakes. The burger was delicious, though kind of unoriginal (flavored with cumin, topped with goat cheese.) Sometimes it's better not to mess with what works, though. The potato cakes were absolutely blah. They were served cold and they were super dense and not too flavorful. The creme fraiche they came with was great, but it didn't quite go. It was much better with the crisps that came with the burger.\n\nFor the price of drinks at this place (and the amount we tend to consume) I think we will definitely go for the punch bowl next time. It claims to serve 4-6, but I think that's just their opinion...", "author": "Heather M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "When I have those nights where I want to pretend I am fancy, I go to Clover Club.  Went there for the first time with the BF before dinner at Char No. 4.  We got a seat at the bar and the bartender was attentive and sweet.  I had a Clover Club cocktail (when in Rome, right?) with gin, dry vermouth, lemon, raspberry syrup and egg white.  Egg white in my drink!  Look at me, I'm fancy AND crazy!\n\nI prefer to sit in the back bar; something about it just feels more authentic and old-school.  However, it seems like it's not always open.  The front space is fine too, but I don't find it to be as inviting.\n\nThe food hasn't really wowed me, but I'd definitely consider this a great place for a pre- or post-dinner drink.", "author": "katy f."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}