{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-11", "description": "Welcome to Brooklyn where the average bar manages to be smoky and vibrantly sensual all at once. The food and atmosphere will hold you hear long enough until you decide its time to head in for assured intercourse or head out to raise the stakes. Your night is just beginning at Clover Club either way. \n\nI didn't mind being interviewed by a first date at this place. The staff and people were good distractions.", "author": "Jaebi I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "One of my favourite place in NY! Cocktail, food (especially The Mac \u0026 Cheese which is crazy!) and the wednesdays evening jazzy prohibition style concert... \nI could go every Week!", "author": "Andrée-Line D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "I came here for drinks and appetizer with some college friends. Nice atmosphere. Great friendly service. The servers were trendy, but not snotty and very helpful in recommending drinks and food. Loved their cocktail selection and small plates/ apps. We had the bacon sampler, deviled eggs, and two other egg dishes. All the food was delicious and. We ended up ordering more bacon samplers because we could not get enough bacon--who can?!! Perfect venue for relaxing with friends after work. \n\nI came back for brunch with my husband and toddler. Very sweet staff, and again, helpful with their recommendations. The food was delicious-- We had the pulled pork and grits and fried chicken. Big portions , enough to share and the cocktail was again, out of this yummy. Hits the spot!", "author": "Gee P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-27", "description": "On the positive side, the drinks are solid and I've had a decent brunch here before.\n\nDownside? CC is unbelievably pretentious, with clientele that is out of place for this neighborhood. Seating is limited and generally involves a long wait, while the front bar is uncomfortably jammed as a result. The bar tenders are there to pose and peer disdainfully into the crowd as they patiently grow the ingredients to your drink, should you ever get one.\n\nRecently, I went there with a friend after a late Saturday dinner, only to be greeted by the usual wait and a pretentious hostess. With the front bar packed, we popped into the back bar to find two empty seats. Score! Only, the bartender was cleaning up and casually informed us the back bar was closing...at midnight...on a Saturday night. You know, because management keeps the back bar free for better times to enjoy a drink than midnight on a Saturday night.\n\nThe decor and drinks cannot possibly overcome the derisive and painfully slow service. And, for your wait, you'll get one tiny specialty drink, in a fragile little glass, and pay Manhattan prices for it. \n\nYou're much better off going to Henry Public or Brooklyn Social: better drinks and a far cooler vibe.\n\nPlease don't go here so they can use this space for a real bar.", "author": "Thomas s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Clover Club- you have a good thing going here. I came for brunch one day and appreciated the uniqueness of their menu. Baked eggs with chorizo you say??? it was actually quite tasty. The cocktail options were refreshingly interesting. Brunch was much pricier than other area options, and no unlimited options are available, but I definitely wasn't disappointed. The service was on point as well. \n\nDefinitely worth a visit and I can't wait to return for dinner.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Love, love, love The Clover Club. They have awesome cocktails. I hear the food can be good, but I haven't tried it. I am just too in love with their cocktail selection.\n\nTheir old fashions are awesome, as are their moscow mules.\n\nHowever, my favorite summer time drink here is the Bermuda Swizzle. It just hits the spot! Great atmosphere. Can get crowded but not in the I-can't-move kind of way.\n\nDefinitely check this place out if you're into cocktails.", "author": "Baramee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Classic NYC cocktail mixology spot in a beautiful Brooklyn hood. Great for date nights, parties or even just HH.\n\nPros: amazing, unique, delicious cocktails worth every penny. Friendly staff. Lots of seating.\n\nCons: food was really delicious and 100% home made but prices were pretty high compared to quantity. For $15 we got three small slivers of cheese.\n\nCheers.", "author": "Angelina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "When my BF and I were chatting with our Brooklyn dwelling friend about where to meet for drinks before dinner, he quickly declared Clover Club our destination. \n\nWe got there a little early so we ordered up some marinated olives and chips. Those chips? Whoa. Delicious! Who knew something so simple could be so tasty?! I sipped on the special drink of the night, the Moscow Mule that was only $7. Coming from Boston, where there isn't a drink special to be found, this was the most amazing price in the world. Bonus...it was delicious! The ginger beer was the right amount of bite and I had to stop myself from sucking it down like it was water.\n\nI would love to be back to actually eat there and have something sop up all the drinks I could chug back.", "author": "Erin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "This is a nice spot to go to if you like high quality complex cocktails and delicious appetizers.  The prices are high but worth it.  The mixologist here get busy and are the best I've ever seen.  It's cozy romantic and friendly atmosphere.  If your looking to get hammered for cheap, this is not the place for you.  Try high dive for that.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "What a sexy bar! Love this place. Clover Club has 3rd date written all over it. The reason I say 3rd date rather than 1st/2nd is this place can get very loud. So if you're looking to have a conversation with someone it may not be your best bet.\n\nThe drinks are SO GOOD. You can't go wrong with any cocktail. And the food is also delicious. The portions are small so don't come hungry/for a real dinner. \n\nWill definitely keep coming back!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I love dressing up like a pin up girl and coming here for some serious cocktail action - sure, at my last visit I was turned on to the Cobra Kai (aka \"panty remover\"), proceeded to drink 1.5 of them WAY too fast and ended up puking at the next bar (drunk girl!) but whatever, that was my fault for not eating dinner.\n\nI've had a birthday party here in the back room a couple of years ago as well and there wasn't a single complaint - solid spot, fun people, great music, awesome down to earth mixologists.\n\ntry the crisps fried in duck fat served with creme fraiche if you get the munchies.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-30", "description": "I love this bar. Its so old school with a hip flare. You must come early so you can catch a seat at the bar.  The mixologists are friendly, knowledgeable and looking to make you anything you want. I love the port of call the bf gets pisco sours.  The food is good too. We have tried the mac and cheese, lamb burgers and deviled eggs four ways. If your hungry get a couple plates to share because they are single servings. Only down fall is parking.", "author": "Kim G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "Don't eat brunch here. Service was bad, coffee was cold and tasted like water, and the food after 30 minutes arrived cold. Really bad. Only saving grace was the manager who ate the tab and apologized. Which professionally was the right thing to do. I read there yelp after the fact, my fault, which they have over 50 o e star ratings. Ugh.", "author": "R. Allan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Excellent cocktails and warm atmosphere. Live jazz on Wednesday gave the place a cozier vibe. Death Race cocktail was delicious and beautiful. Prosciutto flatbread was perfect for soaking up the one too many drinks I had. Good spot for catching up with a friend! Definitely recommend. Gets busy though.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "Dropped in here a few days ago. Prohibition, speak easy type of interior. We had a couple cocktails each. Like many places in cities these days their drinks were very well done, but in reality we are so spoiled everywhere, I have to say while they were quite tasty, it was nothing you can't get elsewhere. (Guilty of run on sentence)\n\nWe ate quite a bit. Their yoghurt topped flat bread was like a giant salad. Decent. The steak tartare was very good as was the lamb burger. Both deserve two thumbs up. Quinoa salad was nothing to write home about. Lesson here stick with the meat at this place.\n\nIt was Sat night, we had no reservation. We were put on the wait list. 30 mins we were told. Many tables sat empty for 2 hours without a hint of us getting called. I know it's NY, but it's Brooklyn and very far from full. Star lost here. Where do they breed all the aloof, low IQ hosts who work in this town.\n\nBartenders by contrast were true crowd pleasers. \n\nCome and see but just grab a drink. Eating is too complicated and a bit hit and miss.\n\nEnjoy!", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Strolled over here after dinner Saturday night (just kidding we hauled ass before we froze to death) and were seated in this amazing booth in the back room by a working fireplace. I guess you have to be right next to the fire to feel the effects, because it was pretty damn cold in there, but it looked nice. Our cocktail waitress had a voice like melted velvet and I honestly could have listened to her all night long. I kept asking her to \"just say things to me, anything, just speak at me, speak at someone else within earshot, I don't care just keep talking!!!!\" She was pretty nice... and tolerant. \nThe drink menu is EXTENSIVE. It's like a little book. I appreciated it. Drinks are expensive, but standard for that type of thing. Everyone was very happy with their cocktail selections, so that's what counts.", "author": "Molly D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "We decided to check this place out one Friday afternoon. We were in luck that happy hour was going on so we grabbed a seat at the bar and ordered some cocktails. The Southside Fizz was super refreshing and delicious and the Gold Rush was a good \"serious\" cocktail. We also ordered Moscow Mules but found them to be way too gingery. What took our experience over the top (other than the charming bar and very skilled bartender) were the crisps. Yes they are potato chips but they were a religious potato chip experience. Duck fat and truffle creme fraiche!!! I mean what more do you need? Although the place was full we felt taken care. This will definitely become a regular for us!!", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Great spot to catch up with friends visiting. High marks for their food offerings. Good deviled eggs. Back room is lovely. Live music by the front entrance. The layout and vibe reminds me of Moto back in the day.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "We hosted our pre-wedding cocktail party in the back room and can't speak highly enough of the Clover Club! Booking the space was super easy and the team answered all of our questions promptly and professionally via email. The service and the atmosphere were exquisite on the day of and everybody had a great time, with great cocktails and great food! We highly recommend this place for private parties!!!", "author": "Yvonne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Really great food, cocktails, and service! The brunch was delicious!  Best squash soup with truffles!  Bloody Mary, coffee, Fried chicken, cheese grits, baked eggs, dessert, yum! Great ambience (a little\ndark, but nice by the window).  \n\nIf you don't like hot sauce, ask for that on the side for the fried chicken. I still need to check this place out for dinner but I've only heard good things!", "author": "Esther Y."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}