{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Super great atmosphere and a lot of space to accommodate a big party! Not the greatest brunch place (though their fare is delicious) but I'm sure past nightfall, this place settles into the groove. \n\nGet some of their special cocktails; port of call blew me out of the water.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Strong pours, great ambience, good service. I came here on a weekday night around 9pm and the place was bustling. Packed at the bar but we were able to get a table with little wait. There happened to be live jazz playing while we were there which was really cool, though a bit loud since we were sitting right by it. Had to wait a while for our drinks but considering how busy it was, it wasn't a big deal. Just gave us some time to listen to an old man expertly playing a clarinet. A wide selection of cocktails, beers and wines. I ordered a porter which was pretty good. \n\nWhat I liked most about it was definitely the ambience. It was dimly lit with a classy decor, so good for dates as well as catching up with friends over drinks.", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "This is one of my favorite cocktail lounges to go to in the city. It's unassuming, not pretentious and the bartenders really know how to make an excellent cocktail. It can be easy to walk right past as there's not a ton of signage but once inside, there's a good amount of tables and a nice bar you can sit at. The cocktail menu is extensive, and if nothing speaks to you, you can always just tell the bartender what you like, and they will surprise you. The drinks are on the pricier side here, so be prepared to shell out a bit more for a quality cocktail. This is a great spot to come to on a date or to catch up with a friend. I highly recommend.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Came here for happy hour last friday with coworkers. Clover club is a really beautiful space and definitely was designed to invoke a speakeasy vibe. The three of us easily got a table and stayed through happy hour.\n\nHappy hour prices were great - all of the cocktails we had were $8 and still packed a punch. I had two moscow mules and highly recommend.\n\nOur waitress was kind and attentive. She also never pushed us to leave as the place filled up and we were still nursing our drinks. Highly recommend!!!", "author": "Alice A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "The food was quite delicious and had a great variety. The mac and cheese was tasty but shouldn't be considered a \"big plate\". Don't order it if you have a big appetite. The steak tartare, deviled eggs, garlic ricotta dip (my personal favorite) and fois gras were all surprisingly appetizing and each good for sharing with 1-2 people as they are true to their \"small plate\" name. \n\nService: The maitre'd was very responsive and accommodating as soon as we entered.  Once we were situated and our food came out, we decided to get a bottle of wine. However, we were stuck between 2 choices. Thankfully our waitress offered a tasting and we picked our wine. When she brought back the wine, she didn't have us taste it again to make sure it was the right bottle or to make sure it wasn't corked. It so happened that the wrong bottle was brought out. We decided to drink it anyways since most of the bottle had been poured out into glasses already. We still enjoyed the wine and food. For a restaurant with such great reviews and a cozy ambiance (although it was a little too dark.. had to read the menu by candlelight), the little attention to detail would be highly appreciated and noticed. \n\nDefinitely go!", "author": "Love P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Very good food. I had the smoked bacon mac n cheese and my hubby had lamb burger. I had Barrymore cocktail. It was pretty good. My dish was plenty for me \nMy hubby's lamb burger I think could have been a little bit bigger especially for the bun. (I would of taken a pic of dishes but place was extremely dark. Nice but could be a tad lighter to see food)\nBut if you order an app to share then it's not bad. Still very good.", "author": "Cristina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Stumbled upon this place, and wow am I pleased! Ordered a General Champagne drink that was tasty and different. And two of the only veg options: Tomato Ricotta with Toast, and Gazpacho. The gazpacho was holy-moly-tasty. Followed by bread pudding that made me want to hug someone. Fabulous meal, just what I didn't realize I was in the mood for! Ordering the exact same thing next time. Plus, the ambience is lively and service is excellent.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "FYI... I'm a Manhattan Snob. Which does not mean I'm a stuck up fool from the city. A Manhattan (the drink) is my alcoholic beverage of choice. \n\nThat said... Clover Club gets it right!!! Any drink with a Part Deux to it is OK with me. I've never tasted the food but I will return just for a proper Manhattan", "author": "Hardy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I love the Clover Club. Plain and simple. The food is outstanding, particularly their flatbread, oysters, fried chicken, and beef burger (these are just the things I've had!). They have an EXTENSIVE cocktail menu, ranging in traditional, Jazz-age to their own unique pairings of liquors, fizzles, and flair. I recommend any of their gin-based drinks, such as the Clover Club, or the Gin Blossom. All cocktails are the same price, so you're aware of what you're spending from the get-go. \n\nThe service is delightful. Every staff member is friendly and helpful. I ordered the Gin Blossom with my dinner today. Well, they had made a bit too much of my drink, and instead of dumping the excess, brought the extra left in a chilled glass to keep it cold (they had the drink in a tiny, glass carafe inside this cup). I was pleasantly surprised and excited. The food came out promptly, and they gave us fresh napkins with each course. \n\nI highly recommend this shining jewel in Brooklyn. They even have live jazz on Wednesday's!", "author": "Summer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Tara, our waitress, was so attentive and knowledgeable. We came here for brunch and had huevos rancheros and baked eggs with leaks. The latter's eggs were too cooked for my taste but they offered to make it again and were quick to turn around and get another order started for me. Overall the food was delicious and the service was excellent - thanks again to Tara!\n\nPS. The Bloody Mary packs a punch", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "I haven't yet tried the food, but I intend to. Situated on a lovely few blocks in Gowanus with lots of shops, Clove Club manages to be maintain a cozy feel with a bit of swank.\n\nIt's a beautiful space, if a bit loud, with delicious cocktails. Great choice for a date.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Great bar!!!! It was our last stop before going home but now that I've been I regret not coming here first.  The drinks are great but the service was incredible.... got here around 2 and we were seated at the bar where Ryan was our bartender.  Great experience, great drinks, great atmosphere.  Highly recommend", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Delicious cocktails \nFriendly staff \nGreat decor and ambiance \nOutdoor sitting \nPrices are a tad on the high side for smith street.\nThe food is okay not the greatest. We had the steak tartare and French fries. The steak had a weird mix of ingredients which were hard to distinguish. The flavors were muddled. The dishes are definitely not shareable if you are really hungry. I would definitely return for the cocktails for sure.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Cool ambiance, friendly staff and bartenders. Good lounges. Descent food but their burger is exceptional!", "author": "Bachar S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Go there...classy yet friendly with excellent cocktails!  If you're there for HH (and even if you're not), get the steak on toast - delicious!", "author": "MT L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Good food and atmosphere. The inside was pretty dim, but I like the lightbulbs they went with, and the decor was quite nice as well. The deviled eggs were good, but the lamb hamberger and home style chips were the best!\n\nNext time I go I really want to try the mac and cheese. Would definitely recommend and go again.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "This place is actually three and a half stars because their drinks are solid and there is a wide variety of it but I decided to round down because it was really cold last night so we came in to get a good drink and to get away from the cold  and unfortunately we got seated next to the door so I was literally freezing when the intermittent heat wasn't on and when it was on I was super warm cause I had my jacket.. their snack menu was good we ordered devils egg $9 and duck fat chips with truffle $6. Service was Friendly and the decor was nice as well I liked this spot more than the spot we came from (le boudoir ) because the music wasn't blasting and I might have stayed and ordered another drink if I was seating in a better area where I wasn't alternating between hot and cold every five minutes. I saw that they had a fireplace in the back and would have loved to sit by that but there was a private event going on so we couldn't :( \n\nFor drinks I ordered the clover club and I liked the drink more than the foam on top I could have probably done without the foam .. my friend ordered death wish or sth along those lines it was strong and better than he expected which he really enjoyed I would recommend this place for their drinks", "author": "Annie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Crazy good cocktails...mezcal, tequila, vodka, campari, cynar, st germaine-basically anything you want tailored to your liking. Their specialty drinks are outstanding-made with aromatics/bitters/fruit/essences of goodness and a whole bunch of classy drinking goodness. We shared small plates at happy hour which were soooo unique and delicious and I just wanna get happy again at Clover! Bar tenders are cool and the crowd around you is cool too. You must go!", "author": "Via G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "The food and drinks are great, but it's obnoxious they don't take reservations for weekends. You can't actually bring friends because you might have to wait for an hour or two. Not to mention Mother's Day is out since my mom literally can't stand around waiting.", "author": "N C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "As bars go, this is as good as it gets. Friendly service, nice vibe and artisan cocktails.  If you are looking for a place to hang out with friends and get a couple of drinks, this is the place.", "author": "John S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}