{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "I've been here one time, and I was looking forward to it--- but was unimpressed.\nIf you're looking to pick up somebody in their 30s while trying a bit to look classy doing it, then go here. If you're looking for a super quality cocktail and a place to chill with your friends or significant other, don't go.  There are plenty of other places with interesting cocktails and better atmosphere, in my opinion.\n\nIn short, I just felt that the place was trying too hard.", "author": "Merav I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "The drinks are great, but the food is pretty terrible. I just ate half of a chewy steak that was served tepid. The fries were also room temperature and oily. Maybe it was an off night but my dinner companion's meal wasn't any better. One star for the coat room, and two for the drinks.", "author": "Sabine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Great cocktails. The chips were amazing. A little bit on the pricy side but good value for your money", "author": "Heshan W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-23", "description": "In the past 6 months my boyfriend and I were almost regulars here- making a stop here 2-3 times a week. The service was never stellar but the drinks and food kept us coming back. \n\nWe noticed in the past 2 months the staff becoming increasingly cold and down right rude. On a Wed night we stopped in for drinks and after being seated and waiting for 20 Minutes (!) no one ever came over to take our drink order or food order. We left and had drinks at Prime Meats instead and had fantastic service.\n\nGave this place another try for brunch with friends that weekend for my boyfriend's birthday. We had even worse service. Got baked eggs and my eggs actually came out completely raw- I'm all for running yokes- but the whites were completely translucent. At first I thought it was just juices from the chorizo, but then discovered it to be raw egg. I kindly told my waitress and she snapped that \"They are just going to bake it more\" which I said was fine. When the eggs came out there was bread on the plate- which I had to send back because i had a lengthy conversation while ordering about how I have Celiac Disease and can not have ANY wheat or gluten. Had her ask the chef what items would be safe for me to eat there. I had faith in the server at that point.\n\nThe waitress blew her top and told me that I would be fine eating the eggs despite the bread. I informed her that I would not be fine and even the smallest crumb would give me a terrible reaction and leave me sick for days. She stormed off and the manager came over at this point. I told her the issue at hand and she said that they would bring me a new one and my food would be on the house. \n\nIt took 40 minutes for my \"new\" one to come out and they were so overdone that they were rubbery and I would have had better eggs at a bodega. All of us had finished our drinks 25 minutes before this and the waitress or anyone else never came and asked us if we wanted another round of drinks. \n\nOn top of everything I fell extremely ill that day just a few hours after dining at Clover Club. I wouldn't be surprised if this waitress sabotaged my food (she was that nasty to us). The experience and me getting sick from this place completely ruined my boyfriend's birthday.\n\nI used to love this place, but unfortunately the lack of good service and terrible attitudes have stopped us from ever returning. \n\n.", "author": "Anna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "I can't offer something new, pretty much the reviews are on par.  Detail oriented cocktails made by folks who care.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "It's easy to miss Clover Club walking down Brooklyn's Smith Street, the signage way above anyone's neck range of motion. It was only the outdoor seating that clued us in. The chairs and tables spilling out onto the sidewalk were minimal, but we were adamant about snagging the only two-top, occupied upon on our arrival by ladies that were too deep in conversation. I caught myself pulling \"The Secret,\" my eyes like focused daggers, the power of my thoughts compelling enough to escort them out. Because what is Sunday brunch on a fine day without the sun? Besides, the speakeasy-like dimly lit interior whispered dinner and late-night cocktails - the latter of which their impressive list speaks to what they are known for (though it's no Death \u0026 Co.).\n\nThey must also be known for their brunch because every item on the menu sounded better than the next. Ordering the perfect spread for a well-rounded sampling can be most stressful (cue the violins). After a labored game of dish Tetris and two glasses of sparkling Rose (each), we finally set it in stone, already qualifying our decisions with having to return for the ones that didn't make the cut. So which ones did?\n\nA beautiful start with something I never order for brunch: soup. As soon as our server spewed out this special, I knew it was mine. It was even more gratifying to my sense of taste than sound. A rich yet brothy beef base played swimming pool to lusciously stewed lamb shreds, that fell apart among walnut-sized hominy, pumpkin seeds, and julienned scallions and watermelon radishes. The light textures and deep flavors sang a harmony on my lips.\n\nSwitch gears from sumptuous meat to smoked fish brunch staple: salmon. But not just any smoked salmon - one that is cured with beet and dill, served atop fried potato cakes (that's latkes for my fellow Jewbies),  garnished with buoyant poppy seed creme fraiche and lots o' leafy greens. I have to say the novelty of purple salmon alone made it worth the order. But that was probably the most interesting aspect of this dish, as it didn't contribute much by way of flavor. Upon reflection, I would replace this plate with another contender. It tasted like the mainstay it is, nothing more, nothing less. And for $14, I'd prefer to pick up a pound of the smoked goods at my local deli. I will say my mom's latkes have some competition - these were seasoned and crisped to golden greatness.\n\nNow for what makes it brunch and not lunch: the eggs. You know I like a properly poached egg, all the oozy yolk waiting to escape that paper-thin white casing with the first puncture. And I got it - well, partially. We ordered two egg dishes. \"The Englander\" was glory with expertly cooked hanger steak (medium rare is the only option), thinly sliced and slabbed onto a toasty English muffin - keeping it English, after all. The layers were an excellent cradle for a JELLO-y egg round begging for the stab of my fork. The Bernaise sauce, though tasty, was ignored, as the yellow yolk coated my steak and soaked into the porous muffin just fine.\n\nChorizo and Manchego Baked Eggs\n\nOur baked eggs with chorizo and manchego cheese did not fare so well on the yolky front. It seems England beat Spain in this battle. Our eggs were over baked, but the flavors were still marvelous. The gooey cheese supplied the runniness expected from the eggs and the hinted kick of the diced chorizo and tomato sauce provided adequate distraction. Add to that rustic bread to mop up this divine liquid emulsion and, to be honest, I didn't even miss the eggs. (And looking at the photo, you'd be hard-pressed to find them.) Not the catastrophic buzz-kill it could have been. Lucky clover.\n\nSpeaking of buzz, before we even sat down for this meal I had my eye on a cocktail that had my name written all over it. \"Maria Sin Sangre,\" one of the four variations they had on the traditional Bloody Mary. This Mary had no tomato juice (sin sangre, without blood), but instead cherry tomatoes muddled with silver tequila, medium dry sherry, basil and fresh lemon juice. The Mexican twist was not as alternative as expected but still a great, refreshing stand alone drink. Ole!\n\nSo we got our savory in, but it ain't over until the fatty sweets sing. There was no question in our minds on the finale to our meal: the thickest Brioche bread pudding I have ever cut into, doused with Bourbon caramel sauce, dotted with softened currants and whipped sweet cream. I died, thankful that it was the last thing to touch my tongue. The sauce was perfectly balanced in flavor (not too sweet) and viscosity (not too thick). The Bourbon rounded it out and the tiny currants contributed the necessary chew. The eggy Brioche was the optimal sponge for that delicious sauce, lightened even further by the whipped fluff of cream. As to my compulsion to spoon every last morsel into my mouth (and left wanting more) I can only say, \"The Devil made me do it.\" This is the true Devil's food cake.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "My favorite happy hour place. Every single drink I ever had there was amazing, I have never been disappointed. The drinks are quite strong but you don't taste it. All the ingredients are perfectly balanced and they make every drink an experience.", "author": "Levi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-24", "description": "Yes, it's a beautiful, classy place. Yes, they serve great cocktails. BUT Clover Club isn't for me. Here's why:\n\n- When all the seats are taken, there's really no place to stand in the front bar area. I don't know how many times the waitresses had to tell us to move away from their path. \n- Not a great place for a birthday party. We all wanted to dance, but it wasn't the appropriate place for dancing and being obnoxious.\n- There was a George Clooney-look alike creep who wouldn't stop staring at us. He was drinking all by himself just staring at every girl in the bar.", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Most distinguished cocktails award - the real deal.  Turns out the name of what I love is a Kir Royale ie champagne cocktail.  Ambience is sexy, feels very legit vintage.  Staff could do a better job to make the place feel neighborhood-y though.  They come off a little cold and superior like they are doing you a massive favor finding a table.  This is Cobble Hill, Brooklyn not Downtown Manhattan.  Would be nice if they could be more relaxed, like everyone else around here.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "This is a great brunch spot or just a place for a small quiet party. I came here for my cousin's bridal shower a while back and failed to review it during the time. I remember it vividly because of the unique ambiance it had. It was warm, snug, and cozy. They had great brunch varieties. For the bridal shower we got devil eggs, entrees, and cocktails. They made really good mimosas and I tried a couple more but I forgot the name. Either way, it was a good experience and I can't wait to go back when I'm around that area!", "author": "Ophelia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "This place is decadent and delicious. They have the BEST bloody mary's EVER. The food is just scrumptious and the ambiance is super chill and laid back. \n\nI've only been for brunch and lunch, but let me say, its an indulgence worth having! The beet and cream cheese toast is my favorite thing on the menu. I could eat it all day every day. \n\nI also love the egg sandwich and their specials are always fantastic. A little pricey but most definitely worth it.", "author": "Nadeen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "I almost never write reviews, but my experience at Clover Club during their New Year's Eve party warranted a review. The atmosphere was so lovely, the drinks and appetizers were fantastic, and the service was outstanding. What really impressed me was their willingness to accommodate my party. Initially, it was just the four of us, but three more friends added themselves to my reservation at the last minute. My friend somehow got very drunk and threw up downstairs, but the staff made sure to take care of her and help us bring her home (even offering to pay for the cab). We were happy to spend our NYE here and definitely plan to return (without my drunk friend) again.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "On the whole, everyone just took themselves way too seriously here. The drink list looked impressive, the crowd got prettier as the night went on, but the service was downright bad. The waitress returned to ask us to repeat our drink orders twice, and forgot a dish of food. \n\nThe cocktails were tasty, but many of them are bulked up by huge servings of ice. For $12 a piece, I would hope to receive more than a few sips. Food was mediocre, nothing to write home about.\n\nThere has to be better bars in this area of town. Meh; I've truly experienced better.", "author": "B Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Love that place! Beautiful space with a speakeasy atmosphere. The cocktails menu is original, and they offer many options.\nThe one I had was amazing, but can't remember the name. The staff was perfect even though we were a little slow to decide on our orders and changed our minds.\nNow the food: we had a cheese platter, good but only came with 3 small samples of cheese. The desserts on the other hand were probably the best I had in a long time. They were so good that one of my friend ordered the bread pudding after he had  the roasted peach!", "author": "Ergodyne T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "How have I not written a review for a place that comes up this often on my credit card statement?  I go here all the time and I love it.  I don't eat here.  There are so many good restaurants nearby that I've never felt compelled to, but I hear the food is excellent.  I drink here at least weekly though.  I usually order The Slope, but I've made the rounds.  Their wine list isn't great, so don't order wine--it's a cocktail bar.  I've had wine there before several times, it didn't kill me, if you have a wine-only member of your crew, I'm sure it's okay, but it's not great.\n\nThe vibe is excellent.  Actually, one thing I absolutely love about the Clover Club is the variety of vibes the place can accommodate.  I have really loved being at private parties in the back at many times of year.  Anytime of year, the main dining room is great.  In the summer, often (but not always), they'll have sidewalk dining out front, which is lovely on that street.  In the winter, their fireplaces in the back are a dream.  Friend-friendly, date-friendly.  I've been here with probably 30 different people over the years and everyone I've ever taken there has loved it.  \n\nI really enjoy it when they have live music, especially the Wednesday guys.  The servers are, truth be told, not the most knowledgeable . . . but they'll ask the bartenders who are and will always be completely cool and friendly about it.  \n\nOne more thing: sometimes it looks like it's going to be hard to get a table and, usually, it really isn't.  Go in and check.  Walk around the block twice and check again and I'd be shocked if (even on a weekend!) you didn't get in.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "Pure class.\n\nSerious attention to detail in cocktail craft.  The technique and creations of these bartenders are incredible to behold.  If bartender is really the right term.  It's impressive enough that the term bartender seems too... lowly for what they create.\n\nBe forewarned that quality like this comes at a price.  The drinks are all north of $10 apiece.  But dear LORD are the drinks finely crafted and gorgeous to drink.\n\nThe night I stopped in there was even a live crooner band.  I honestly wish I'd worn a suit.  This place classed it up so nicely that I wanted to live up to it's standard.  This level of swank demands the world of tuxedos... evening gowns.  It made me want to own a classic 1920's automobile... to bump into Barbara Stanwyck (Brooklyn born!).  She would have felt right at home here.\n\nSo dress it up and spend an evening living like a classic movie star.", "author": "Alan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Great cocktails, amazing the blonde redhead, good steak tartar. Disappointing cheese plate, got three small skinny pieces with 8 pieces of bread, cheese had a huge piece of wax, so could not get that much. Go for drinks!", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "great date spot and the cocktails are delicious.  Came to celebrate a birthday during the week with 5 girls and sat immediately in a corner booth.  there was live music that really help lend to the speakeasy vibe.  the food is decent, nothing outstanding.  there is also a back bar and more seating behind the curtains.", "author": "Cindy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Love this place. Cocktails are great, food is good, and place itself is cozy yet trendy that doesn't get too crowded or rowdy. Fried oysters were amazing and I wanted to get more. My friend became obsessed with the bread pudding, which is served warm with fresh creme and caramel sauce.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Cute, classy, great cocktails, excellent service AND there's a fireplace.  I'm a fan.", "author": "Lisa W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}