{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "I had been meaning to try Clover Club for the longest time, and got to try it after dinner nearby. It was a nice night, the front door was open, and the jazz band had just finished playing, so we headed to the back bar area to sit. The bar in the back wasn't being serviced, so we had to go back into the front main space to get drinks, which took a while. Yet, it didn't ruin our time at all, as the back bar area was fairly empty, for a more intimate vibe.\n\nI got the Slope, which was rye whiskey, apricot brandy, sweet vermouth, and bitters. Very spirit-forward, but the brandy also added a little bit of sweetness at the same time. I also got to try the Victory Garden: London dry gin, tomato water, strawberry, basil, fino sherry, and lemon. Refreshing, and a little sweeter, if that's your thing. Overall, we sat and even though we had finished our drinks, the vibe was just very comfortable and the conversation was going, so we stayed a little longer without getting more cocktails, simply because it was late, and it would have taken a while just to order and pick them up. \n\nService was pretty attentive, but you do have to be pretty patient with your drinks, because they do take a little while to be prepared, which is expected because of all of the ingredients available. Pricing is a bit more expensive for drinks, but both drinks we got were fairly unique and very tasty, so you know that you're getting a quality product. Can't speak to the food, but the pictures we saw on Yelp looked good, so I'll have to come back for brunch or a late dinner.\n\nOverall, we had a great time, and the vibe was perfect for late night cocktails. The whole not serving the separate spaces was a little annoying, but it was still probably one of the best nights I've had in Brooklyn. Can't argue with that.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-21", "description": "Met up here for some beverages. The host was kind, inviting and very professional. The server was the opposite. Our drinks: liked the first.. a \"no country for old men\". But all was downhill after. When we asked for a bourbon sour that was met with some weird oregano/kumquat concoction. Gross. When we asked again.. again got nothing like a bourbon sour and just decided to leave. When we asked the server what led her to order these drinks for us.. she gave no answer and decided to charge us for the drinks anyway. The server needs to understand that customer service is more than just delivering drinks, it's also about getting what was requested.. not the opposite and then charging for it. Wouldn't return.", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Excellent staff! I love the bartenders, friendly and very helpful on drink suggestions. \n\nI met the homie for some after work drinks, we had the kale salad, steak over toast \u0026 char-grilled octopus! All of it was delicious! I'm very amazed on how they're able to make every request such a tasty treat and drink. \n\nDrinks: Coconut Cabin \u0026 the Clover Manhattan \u0026 IPA\n\nDate: Sage the Waiter \u0026 a Pilsner", "author": "Sergio G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "This place is nice to sit with some drinks and chat. I came here with a group and we sat for a while. Prices are reasonable and the wines are good. They dim the lights as the evening progresses so the ambience gets cozier and date- like. Sadly they don't have a happy hour on weekends. \n\nI tried the chips fried in duck fat which were really good and the cornflake covered shrimp. Would recommend both. We also got the olives which were good, relatively fresh. \n\nThey do have a fireplace section in the back which they let out for events. But that's probably the best place to be especially in the winter.", "author": "Rits M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Came here for brunch on Saturday with some friends. They do not take reservations and the wait was close to an hour but worth it. The place has an oldtimey vibe with large booth style couches and oak wood tables. There is a back room private parties that looks to be a great size. \n\nWe ordered bloody Mary's which were amazing and the harvest punch, a large cocktail to be shared which tasted like fall in a bowl. \n\nThe food took some time to come and so they provided us complimentary deviled eggs which were amazing. The bacon tasting was also delicious and the cuts of bacon were thick and full of flavor. \n\nI ordered the backed eggs with chorizo which came with toasted bread perfect for soaking up all the goodness.", "author": "Garima V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "Went for brunch on Sunday, wasnt bad, wasn't great - though nice enough place that we want to go back for dinner/try a few other items.\n(btw bacon in the tasting menu needed to be warmer when served).\n\nOnly real reason for writing this review is to say to management, please please please kill the use of slate \"plates\" for serving food on.\n\nIts a dumb, dumb, dumb idea that deserves to be killed :)\n\nIts hard A/F for staff to pick them up when collecting plates after a meal and food slips off them onto your teeny/tiny tables (we were seated in the front near the window/tables may be bigger in the back section).\n\nApart from that/nice décor and like I said has potential enough for us to want to come back.", "author": "Dean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Love the drinks here--top notch for sure. The food is pretty good too. I've eaten brunch and dinner here and the food is consistently good. The crispy brussel sprouts are a must here!", "author": "Helery R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Hanger steak FTW! This is a great brunch spot, though I noticed there were various interesting cocktail ingredients were laid out on the bar, so I want to come back \u0026 try something later in the evening.\n\nThe brunch game is very strong here with multiple egg and non-egg options. My friend and I chose  egg dishes because that's how we roll. We were not disappointed.\n\nThe hanger steak and poached eggs blew me away. The bernaise sauce on the eggs and the dressing on the mixed green salad were perfectly paired and light.\n\nWe got seated right away - there was a bunch of space to sit at around 1:30, and the waitress came to greet us immediately. No complaints on the staff.", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "My favorite bar of all time. Great bartenders, great vibe, great seats, great music, great appetizers too! Duck fat fries!", "author": "S H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "We had our wedding reception in the back room of the Clover Club and had an absolutely fantastic time.  The space is great (even better in winter with the fireplace) and perfect for our group of 45ish.  The staff were ALL amazing and so sweet, considerate, helpful pros.  The bartender's mixology was top notch and all the more impressive given how many we drank.  The hors d'oeuvres were really delicious and they helped suggest just the right amount.  They gave us space and tools in the kitchen to help decorate our cake; and the waiter set up a convenient table on the fly   The pricing was fair and we stayed late.  Thank you so much Clover Club!", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I don't get it. Clover Club is right next door to Cafe Luluc, Luluc is a busy mess for Sunday brunch with the line out the door and crowding the sidewalk. Its loud, the food is not great and the service is so/so. I would give it 2 stars most likely if I went again and reviewed it. Clover Club is mostly ignored by that crowd, which is a shame because our brunch was amazing.\n\nWe popped into Clover Club for a few morning cocktails and brunch. We shared the Country Breakfast, Oysters \"Rock Your Face Off\", Baked Eggs with Chorizo and Manchego and a Brown Derby cocktail. Wow, everything was great, from flavor to presentation, it all blew us away. The Oysters were super tasty, not overly fried or greasy served on a bed of rock salt for extra flavor if you want. The sausage gravy in the Country Breakfast was amazing and the Baked Eggs worked fantastically well. Nothing was overly salty, fried, cooked, etc, just nicely done or perfect all around with fantastic flavors. My major compliant was that I didn't have another stomach to order more.\n\nAdd all this to chill decor, a great music selection, super friendly and attentive staff and reasonable prices (for Smith Street) and you have a dynamite establishment great for any meal. Ignore Luluc and come here instead, you'll be much happier.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "After a long day, we wanted to enjoy a good happy hour in the area. So glad we decided on Clover Club!\n\nWhen we arrived, the bar was still empty with only a few other patrons already there. There was a romantic atmosphere with mood lighting, not to mention the great mix of 70s-80s music selection. The long bar had large bar stools and there were also spacious booths/tables along the wall. We opted to sit towards the back of the bar for a more intimate happy hour vibe. \n\nOur bartender was very friendly and skilled at creating every concoction. I went for the Corn Whiskey Old Fashioned which was classic, well made and very enjoyable. The Moscow Mule was also amazing, especially since I don't usually go for Mules. It was served with lime and candied ginger, which added a great touch. The cocktails were only $8 for happy hour. They also have $6 wines, $4 beers, and $4-7 bar bites. You definitely can't go wrong there!\n\nHappy hour Monday-Friday 4-7pm. I would highly recommend it.", "author": "Becca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "This place has a fireplace in the back, which is really cozy in the winter and makes for a great date spot. Also, if you ask, they'll print out a receipt with the ingredients for any of their cocktails. I really liked the vibe here, and came by several times. In the winter they have hot cocktails too, and they're all delicious, not just hot toddies and standard fare but ones I'd never heard of.\n\nI'd be at a 5 but the third time I came, I got a really touchy waitress who wouldn't give us the recipes like they normally do, and actually got pretty rude. I guess she thought we were secretly working for a competing cocktail bar? Bizarre.", "author": "William J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Stumbled onto this place looking for food.  Pleasantly surprised with the food here.   Everything was delicious but looks like a good spot for dinner and drinks as well.    Prices decent and the cocktails was very good.   Get the sides of you go for brunch.", "author": "Judy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Came in for Sunday brunch today. The food was delicious and very unique. I appreciated the décor and the music was perfect.\n\nThe bloody Mary was spicy and delicious. I wish it was a bit larger haha! \n\nI had the croissant French toast with berries which was yummy but not very filling. \n\nThe potato pancakes were crispy and good, but the sauce they came with took them to a whole new level! \n\nBread pudding was a little sweeter than what I'm used to but solid.", "author": "Mansi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Very swanky place. Loved the mac + cheese  and also the brussel sprout dish. I actually have enjoyed all the dishes Ive ordered here  They have an extensive cocktail menu, the bartenders really know they're doing here.", "author": "Arline B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Very extensive menu, good cocktails. We were able to find a place at the bar on a crowded Saturday night.", "author": "Greg H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "I want to start with all the pros:\nDecor is beautiful\nFood is interesting and delicious\nLocation Location Location is great\nBACON tasting was bomb- especially black pepper and maple\nCountry breakfast bomb x 2 = I was super jealous. My husband ordered this and it took everything in me not to steal his plate. The gravy was sooooo goooood. \n\n\nCONS:\nDuck bacon was blah: As soon as I tasted the \"duck bacon\" I instantly regretted my duck hashbrown decision.\nThat duck hashbrown has to come with a warning label. Like I couldn't eat it, like I love spicy food but that chipotle aioli was everywhere and was like fire. From a scale of 1-10 it was a 15. So BUYER BEWARE. Maybe ask for the aioli on the side. I was so sad watching everyone else eat up their delicious meals. I am a firm believer in not wasting food otherwise I would have sent it back :(. I tried to flip the hashbrown and eat the side that didn't have the aioli, NA that wasn't helping LOL.\n\nYou'd think they know how hot that chipotle aioli is and that maybe someone would come by with water more often. We sat around with empty cups for a while. A busy brunch Saturday, I so get it. Maybe leave me a pitcher if you know we aren't ordering anything but water.\n\nLastly we were seated next to a tipsy table of 4 and they were a little obnoxious and on their way out not big deal. But maybe it's something to consider, maybe we could have been seated somewhere else. \n\nSo you can see my pros out weigh the cons. But for me personally I would pass on that duck hashbrown, the end.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-30", "description": "I really wanted to like this place but unfortunately it was pretty lackluster. \n\nI ordered the lamb burger with a side salad. \n\nThe bun was stale (they probably could have saved it if they toasted it). The meat was overcooked, yet not charred at all so it was just flavorless, dry, grey meat. The side salad was just bitter greens with no dressing. They didn't have any mayo in the kitchen to put on my dry burger. \n\nThe atmosphere inside was great. Excellent decor, fun music, friendly waitstaff. I didn't order a drink but the drink menu looked interesting. \n\nMaybe I just ordered the wrong thing, but a restaurant should never serve stale buns and poorly cooked meat. \n\nThe manager did comp the meal, which was nice of him. I'll probably come back and update this review if I have a better experience.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Very classy place for a girl's night out.  That's just how we roll ;)\n\nService was spot on!  We had a reservation but 2 of us came early and they didn't require all 4 members of our party to be present in order to be seated at our reserved tables.  I love how they have a separate mocktails menu upon request ($6).  Cocktails are strong.  Sliders came with a side of chips.  The exposed brick wall made it feel very Brooklyn-y.  It's definitely The place to wind down with your gals and enjoy what's left of the weeknight.", "author": "Jing X."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}