{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Great place. Loved the dark ambiance and the noise level wasn't too loud. \n\nThe food was great, but we had an issue. Kassandra our waitress must have been having a bad day. First she seemed so zoned out when she seated us. Then, after bringing us our drinks and taking our food order, she forgot about us. After about thirty minutes of waiting, we asked her how much longer it would be for the food, and then it was then that she said, ohhh my bad I forgot to put your food order it. *palm in face* we were pissed. Once she put the food order in, our food came within ten minutes and was great. \n\nAlso, the beers I had were good. But, they put a huge block of ice in one of the drinks my friend ordered, basically, there was not much alcohol in the cup at all - but kassandra was very nice and understanding and switched drinks for her to a drink with no ice and actual liquor (jack and coke)\n\nAnd the first round of drinks they gave us on the house because of the food issue. \n\nI'd definitely go back here because I liked it that much. But didn't give it 5 starts because of the bad service, which I'm assuming was just an off day for her.", "author": "Jocelyne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Place is great and the value is there.  Drinks are well made and the staff is attentive.  The music choice is fantastic and at the perfect volume.  I was there with my girlfriend and we could talk with ease.  The Brooklyn based hip-hop was absolutely perfect.  I will be going back again!", "author": "Frank M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Great drinks.  Great food.  Great scene.  In an area that has a lot of good eating and drinking options, this place stands out.  Been here a few times, but most recently on a Wednesday night to check out Michael Arenella's music.  Good stuff.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "Minutes away from the Atlantic Center Mall and Terminal is this beautiful establishment which was the perfect setting for a private birthday party. You can dine in the front and host a bash in the back. My only issue is that I had to walk down the aisle to reach the back room, might as well make it a runway. Besides that, I had no other complaints on the space. I love the wooden decor and the fireplace. We had our own bar and bartender. it was a very classy place for young professionals to mix and mingle. I thought it was so cool that they allowed the birthday girl to sit on the bar as we serenaded her. It was a great time had by all.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Came here with A, because this is A's spot and so why not venture out to Brooklyn and try this place that A is raving so much about?\n\nI started off with LA SONAMBULA #2 - this was good. \nJalapeño-infused tequila, lemon juice, chamomile tea syrup, Peychaud's bitters, mole bitters \n\nA got some sort of scotch drink, can't remember what exactly it was.\n\nMAC \u0026 CHEESE  - A wanted this, but I am not a big on mac \u0026 cheese, but if I was, I prefer mine to be less dry.\nBaked with Gruyere, white cheddar, smoked Heritage Pork Bacon and garlic breadcrumbs. (We can serve this without meat if you prefer... but, Bacon makes everything better.)\n\nA knows how much I love Steak Tartare, so we ended up trying their version.\n\nSTEAK TARTARE - really yummy. Not as good as Employee's Only, but still better than The Saint Austere \nTraditional tartar made from grass-fed sirloin, and lightly dressed with capers, dijon, cornichons and fresh herbs and served with red watercress salad and grilled country bread.\n\nASPARAGUS RISOTTO - This was evenly cooked unlike Thelma's on Clinton. But still not as good as Jean George. \nCreamy Carnaroli rice with asparagus, snap peas, watercress puree, torn basil and Parmesan \n\nCute place - I am into it!", "author": "Ro R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "My friend had an awesome time sitting outside and people watching on Smith Street. We both agreed that the ambiance inside was really classic and smooth, but relishing the last days of summer, we had to be outside. \n\nOur waitress was cute and somewhat attentive. The cocktails are obviously rad, but I was actually blown away by my glass of white I got.\n\nI was super bummed, though, that their food menu contained no salads, and their one salad, a tomato salad, was unavailable. One of the other dishes came with an \"herb salad,\" but apparently that salad could not come without the rest of the dish.\n\nNonetheless, the sliders were good, and the corn fritters were excellent. Next time, I'll just plan on getting drinks, I guess.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Great time here having brunch at the bar. Loved the punch bowl. Service was just ok - so I docked a star. Seems like you have to know the bar tender personally.", "author": "Alessandra Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Super nice place.  Bartenders are a bit up their own ass, but it's part of the pitch I guess.  The place is really nice, the music is excellent and the small plates were very solid.  They also have a private room with a fireplace that is excellent.", "author": "chuck s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Like this place needs another glowing review...\n\n...but it's entirely deserving of one. Have been a few times now, and never have I been disappointed by any damn thing they've served me. And I should say that I'm not traditionally a hard liquor guy, but these cocktails are out of this world. \n\nFood's pretty good too, service is actually rather rapid even when the place is packed, which is pretty often on the weekends.\n\nTotally worth a trip.", "author": "P M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "Great gin Bloody Mary. Steer away from the grits tho, the \"southern\" waitress swears by them, but they were so runny and greasy it was closer to soup!! Burger and duck hash were fine. Also, it was a cold winter day with plenty of space at the back of the restaurant, but they still sat us at the front next to the freezing windows and door. Cold customer = unhappy customer.", "author": "Kathryn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "The drinks are amazing, the service is the worst.  \n\nWe came last night with a large group and the hostess gave us SUCH a hard time with taking 2 available booths that are clearly devoted to large groups.   It look 15 minutes to convince her we should sit there.   When we tried to order food, she angrily snatched the menus off our table and walked away without asking what we'd like.  Later on, her partner in crime took our drink orders in the most strident and aggressive way possible.  We practically had to beg them to come and talk to us.  You'd think they'd be thrilled to have a party of 12, but they seemed annoyed and flustered with our presence.  The entire night they seemed pissed we were there.  Sorry, Clover Club! We won't pester you again with our patronage.  \n\nI want to love this place, but I don't feel like dealing with the temperamental and rude wait staff.  Don't come unless you want to be abused and treated like you've done something wrong.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "So I went to this place only  because my friends recommended it to me many times. \n\nTonight was serving our table ( 6 people from around 11 to 2 ) Kassandra and she was amazing. My friends and I were celebrating my two friends engagement and \"save the date \" day, which means a lot for us. She was serving fast, super friendly and even after closing on a Monday night was non stop respectful and even let me in back to use the bathroom quickly ( since my cab took over 10 minutes ) a minute after closing. Which is never the case in bars unfortunately. \n\nBefore I got there I was told that this bar is one of the best bars in NYC.... And after all I'll be honest..\n\nI'm super picky and very carp... But it's true. It was super nice, warm, an amazing time and just the place you have to go to. \n\nThe bartender was Cacy( I asked for her name ), who did NOT make the drinks in less than a minute just to serve and sell , she really took her time for the every drink and I enjoyed every 4 of them, delicious and tasty. \n\nI would recommend every one I know this place. Love Brooklyn. Love Monday nights. Love clover club and its workers Kassandra and Cacy tonight.", "author": "Laila K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "Clover Club is not a club. It feels more like a speakeasy and you are in a prohibition times where everyone comes here for a drink. The atmosphere is relaxing and slightly romantic. There is a front area and there is a back area as well to lounge around with a drink.\n\nThe drinks are very creative and they taste what they sound like- so be careful what you ask for. The drinks are a bit expensive but you pay for not only the drink but the cool atmosphere here.", "author": "Hong L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "I came here in early October on a Saturday evening. It was around 8 and we were a party of 5 people, but we were still seated right away. Their booths across from the bar have a lot of room, but they can also contort you into kind of awkward shapes, so there's an upside and a downside.\n\nAs far as drinks go, everything I had was fantastic. I didn't take a look at any of their own concoctions, but this is the sort of place where you can pretty much order anything you want and expect it to be made well. I had a Ramos Gin Fizz, a Blood and Sand, and a Sazerac, and all were wonderful. Also ordered some food; the mac and cheese was good, though I had to weigh the benefits of devouring it before it cooled down with the cons of burning my mouth.\n\nThe ambiance is pretty classy while remaining laid back. There's nothing too fancy going on here, but some well placed wood, imitation leather and funky lighting fixtures still make the place feel intimate and subdued. \n\nMy only gripe is with the table service, which I'd say was pretty inattentive. And when I say inattentive I don't mean having to wait longer than I'd like because it's busy; I mean having to make multiple attempts at getting the waitress's attention as she passed every time anyone wanted to order another drink or food item. I mean if you won't even give me a quick glance to let me know you see me, then aren't you just ignoring me? \n\nI haven't gotten table service at any later point, so I wouldn't know if this is a routine thing. I have been back by myself and ordered at the bar, and things looked ship shape, so I'm sure I'll be back; if I try table service again I'll report back. Overall, though, the drinks and ambiance still make this a place I'll be happy to return to.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "very good service!ill difenally come back with friends!\nthey are gonna love it for sure!", "author": "Katz R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Excellent live music, mood, service atmosphere, everything. The food was above excellent. We ordered the lamb burger with goat cheese. Amazing. Can't believe it was only $14! What a great value! We also ordered the steak over toast. The stake was exquisite, cooked to perfection. They got everything right. Our server was a very kind woman too. We're definitely coming back, especially on a Wednesday to hear Michael Aranella's Dreamland Orchestra live again. What a night to remember.", "author": "Azalia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "I was a little hesitant walking in and seeing a B health rating posted on the window. The food was great; we tried the nuts, steak on toast and vegetables and quinoa. Others at the table ordered the chips to share. Delish!!! I think we ended up going through three orders between six of us.\nIt was very loud, more of a bar scene than a date night place.", "author": "Sunny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Very nice cocktail bar/gastropub with no attitude. Staff are very attentive and quick, especially impressive given how crowded it was. The cocktail/drinks menu is long, but not in an intimidating way, more in a I-want-to-come-back-to-try-everything way. I had a champagne cocktail called Meet Me in Montauk which was super refreshing. Also got the house-made \"crisps\" (British for chips) for the table, which were addictive. They were fried in duck fat and served with a truffle creme fraiche. Also there's a fireplace!\n\nWill definitely be coming back.", "author": "Alexander M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "I walked in this afternoon for a happy hour drinks on my way home from work.  I was so pleased!  Clover club was so welcoming, outdoor seating, a nice breeze going, friendly conversation happening at the bar, I felt perfectly at home.  I had never been in before, and was so glad I stopped, they have an amazing happy hour special!  They've got beer, wine, cocktails and snacks all discounted Monday-Friday.  I chose a \"seasonal special\" wine, the vinho verde, and it was fantastic.  \n\nI can't wait to come back and try some fancy cocktails, and the french dip, mmmm french dip.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "At 10PM on a Thursday, Smith Street was alive and Clover Club was, too.\n\nThe lounge's atmosphere draws from Clover Club's (originally a club of journalists) motto \"who enters here leaves care behind, leaves sorrow behind, leaves petty envies and jealousies behind.\" Have one strong and delicious drink, here, and you'll have no problem leaving anything behind - luggage included, if you're me.\n\nThe drink menu is uniquely expansive and impressive, but the bartenders are even more so. Stalled by indecision, I simply asked the bartender to make me her favorite vodka cocktail. It was superb.\n\nThe atmosphere is both comfortable and charming, with an old school vibe. We hung out in the back room, roped off with a curtain from the rest of the bar. It's just a tad bit too small (i only wish it were bigger since it's so wonderful!)", "author": "Kirsten C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}