{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "Returned for brunch this weekend and I have to take away a star.  \n\nI'm still a huge fan of the grits n' pork brunch - it's really awesome.  But it turns out that the first time we were here for brunch, we must have hit on the best dishes on the menu pretty much out of luck.  This weekend, we had a couple of dishes that were not so great:  the egg sandwich (way over toasted bread, over-sweet bacon, not much flavor otherwise, generally a dud) and the ricotta pancakes (hard to detect any ricotta, plus the rhubarb curd was not very zippy) were pretty mediocre.  \n\nThe good: As noted, I had the grits n' pork thing again, and it was still amazing.  The eggs and house-made sausage breakfast (a daily special) was solid fare.  Just be careful what you order and you can have a great brunch.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "What an amazing place ! Without a doubt the best happy hour in brooklyn possibly the best drinks in brooklyn as well! I also had the steak on toast \u0026 chips w dip which I didn't expect much from but damn that dip was off the charts ! Service was perfect also attentive but not suction cupped to your table ! Can't wait to go back!", "author": "Colin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Love this place! Great brunch, everything I've tried on numerous occasions have been superb. MUST get the bacon tasting, this dish turned me from a bacon-liker to a bacon-LOVER. Great cocktails and very nice decor too.", "author": "ANASTASSIA B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Clover Club is one sexy, delicious bar!  Came here on a Thursday night for a friend's birthday party.  I think she reserved a table, since there were so many of us.  We unfortunately were seated at the front and froze our little butts off when people came in through the front door.  \n\nClover Club did have the double doors installed to avoid a draft - but it was just so cold out, there was no avoiding it.  Next time I'd love to be seated in the back room that looks so warm and cozy.\n\nI'm not used to cocktails and was really hesitant about their drink menu.  I initially asked for a french martini since it seemed fancy and I know I like it (this is not on the menu).  The waitress was really cute and said \"Come on, you can do better than that\" so I told her that I like sweeter, lighter drinks and was willing to give one of the gin cocktails a try.\n\nShe recommended the Slow and Low (might be spelled Sloe and Loe), which was out of this world!  It was a glass of crushed ice with this delicious sweet refreshing cocktail and a tasty drink snack (yes, I'm a huge fan of the drink snack) of a perfect raspberry and blackberry.  \n\nI savored every sip of this delightful drink and was ready to take on something a little different and more exciting for my next round.  The waitress said I was ready for the Clover Club, which made me nervous since it has egg whites.  I never had a drink with raw egg whites before, but I trusted the waitress she the first drink was to die for.\n\nAnd guess what - it was FANTASTIC!!  It was sweet with a little twist of something different.  It really was a fantastic drink that I highly recommend to everyone regardless of their taste.  Even my boyfriend thought it was a terrific, inventive drink and he only drinks beer!\n\nPretty much everyone at our table loved their drinks.  The only exception was the Street \u0026 Smith, which someone in our party thought was a good idea.  He specifically asked for something that was really strong and had tequila, which is exactly what this drink is.  We passed it around since it was ridiculously strong and had a strange smokey flavor.  So I would be careful w/ this drink.\n\nWe also tried some snacks.  LOVED the almonds as well as the olives.  Both were amazingly tasty.  A friend of mine also go the mac and cheese which was apparently really good (I can't eat cheese).  \n\nOverall, this place is great for good drinks.  The decor is also amazing.  It's really sexy with wood and little details to make it feel very old-timey.  Coming back here asap!", "author": "Jaci H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "This is clutch place for drinks, solid apps, and a nice classy ambience with dark wood, vaulted metal ceilings.  The bar keeps are really good at what they do, they serve up the best cocktails this side of the park and the atmosphere is upbeat and friendly.  They have live music too!", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "An impressive, ever-changing menu of cocktails, impressively served. And that's not all: My husband argues that the bacon mac n' cheese served here is The Unqualified Best in NYC.\n\nFortunately, I've always managed to get one of the raised booths here, which makes drinking at the Clover Club a special treat. But look upon the closed-off back room, the seat of my Brooklyn sorrow: this place is always off-limits, and yet I have heard that it's the loveliest spot in the house. How many times have I, drunk off two or three cocktails, proclaimed, \"IT IS MY DREAM TO GO BACK THERE! MY DREAM!\" And yet it's never happened. \n\nYou better watch yourself, Clover Club. Keep me waiting much longer, and I'm going to leave you for Weather Up. Her drinks may lack your finesse, but at least I've always been welcomed into her sumptuous backyard.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-03", "description": "Love this place.   The atmosphere is very warm and old-school without being stuffy.  Very subdued lighting.  But, the thing that sets it apart from a lot of the mixology places that have sprung up lately is attention to detail, and that goes for both food and drink.  Everything is carefully chosen from the shape and size of the ice in each cocktail to the coarseness of the salt on the sweet potato fries (which, btw, come with the most heavenly rosemary aioli... mmm... oh, sorry, back to the review).  The bartenders are friendly and will give you lots of cocktail mixing tips if you ask, or just provide amiable chatter as they appear to get hazier and hazier with each passing sip.\n\nAlso, they have great happy hour specials.  Cheers!", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "My new standard for cocktail bars. Went last night (Valentine's eve) and as expected, there were numerous twosomes enjoying the romantic vibe, but there were also a substantial number of groups, so it's not all sappy couples!\n\nAnd yes, there are the cocktails. I felt like I could've closed my eyes and pointed a finger to anything on the list, and ended up happy with whatever I got. (Well, maybe the $45 punch would've been too much for one person, but hey).  I ordered the Brooklyn Folly first, and was pleasantly surprised when I received the half-portion of the drink in a small carafe in ice -- thereby reducing the chances of me spilling the drink on myself on an overfull martini glass. It's so simple, yet so thoughtful and classy.\n\nThat basically sums up my experience at Clover Club. You get good drink, good food, in a way that makes it pleasant for you, the visitor.", "author": "Anna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "I've been going here for over 2 years now and it is always a solid solid place. Going there on wednesday nights for the free live Jazz band is one of my favorite things to do of ALL time. Cocktails are delicious and perfectly executed. \nOn winter nights in that little back room next to the fireplace, soooo cozy. On summer days they now have the tables up front! Plus they do happy hour yummy cocktails for a great price till 7!\nThere small bites are awesome, the litte pulled pork sliders, ooof, sooo good. There brunch is great too, must. go.back.", "author": "Amala M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "What a great place - the cocktails are perfectly made. Lots of little tasty bites here too. I also had brunch here several times and there were no complaints. The bar and back room are woody and cozy and there's even a fireplace as well! Will come back again.", "author": "KT L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "Went here on a humble yesterday in search of a really good Bloody Mary.  While Bloody Mary's aren't their specialty the Mixologist made us delicious cocktails.  I asked Travis to surprise me with a drink made with vodka and it was the most delicious and refreshing cocktail I've had to date.  I've already shared this place with my work colleagues encouraging them to go and I'll definitely be going back, often...", "author": "Kenyatta A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "My first Brooklyn review! Time to up my BK street cred...\n\nRarely will I make the trek over the bridge to Brooklyn because I am impossibly lazy and the F train does not run downtown on the weekends. However, a birthday celebration at Clover Club prompted me to bite the bullet and make my way to Cobble Hill.\n\nTotes worth it. I am a sucker for the whole mixology, fancy cocktail schtick and Clover Club certainly delivered. I sipped on Sloe and Low - a tart combination of gin, sloe gin, maraschino, and fresh raspberries; Spicy Pete - single malt scotch and ginger beer; and an Improved Whiskey Cocktail - extremely strong, extra helping of bitters.\n\nMy boyfriend and I nibbled on various small plates so we wouldn't be under the table by 8PM. We sampled the lamb burger with goat cheese, deviled eggs, and pulled pork sliders. Very tasty savory bites.\n\nWith its cozy and charming interior, delicious cocktails, and the right crowd - Clover Club will have me coming back to Brooklyn in no time.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-18", "description": "Clover Club is a fantastic experience. \n\nCozy and old school, the decor shoots you right back to the 1920's, and the drinks! The bartenders are top notch, and though expensive (cocktails range from 11-16, beers around $6), the drinks are delicious and pack a punch. I highly recommend the Jersey Highball. If you're hungry, the steak tartar is a good size and really delicious.\n\nIf you ever get the chance, look into booking the back room- it's even more gorgeous than the front, and has a fireplace to boot!", "author": "Amber S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "- Spacious bar with a close, speakeasy-type feel.  \n- Came around 6 on a Friday night and the place was fairly empty.  Service was great during this time so can't speak to what it's like later on at night.\n- Loved the drinks - especially the Hocus Smoke Us, \nI came around 6 on a Friday night and the place was fairly empty so I can't speak to how it gets later at night.  I thought the service was superb and the cocktails are fantastic.  Really loved the Hocus Smoke Us and the mezcal drink (can't remember the name)\n- Food was hit or miss.  Loved the \"crisps\" (on happy hour menu).  Steak tartare seemed bland and too ground up.  Oysters rock your face off were fried well but didn't get the spinach aioli.  Mac and cheese was definitely top notch though!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-04", "description": "Ahhh... Clover Club.  You are named after one of my favorite drinks, and it is only your relative distance from the comforts of Manhattan that delayed my visit to your dark quarters.\n\n\nDrinks were very solid, according to my companions.  To note:\n\n- The eponymous Clover Club is excellently balanced.  Their recipe uses dry vermouth, perhaps 1/2-oz., which I was not expecting and by comparison shamed the versions I make at home, which now seem overly tart and sugary.\n\n- If you order certain types of up drinks, they arrive with a small serving decanter-shaped object that holds the remainder for you, chilled in a glass globe packed with ice.\n\nGreat job with the menu and the drink category explanations, especially when it comes to the disclaimer re there being \"set\" ingredients and proportions for each cocktail. \n\nDocking one star because the apparently seasonal menu was not slanted in my favor (very few fruity or gin drinks).\n\nIf you were in the neighborhood I would return to you for your Clover Clubs, but seeing that you have a companion in Flatiron, I will try your Clover Club there instead and compare while saving the trip to Brooklyn.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "The winner of World's Best New Cocktail bar at the 2009 Tales of the Cocktail awards in New Orleans, and readers choice 2009 for best new Cocktail Bar at the Eat Out Awards.\n\nFantastic Brunch, even better cocktails and ample seating make this place worth the trek if you are a non-Brooklynite. One of the only big cocktail lounges in New York that could actually host a large party of 12 or more at one table. \n\n4.25 stars.\n\nhttp://www.yelp.com/list/best-cocktail-bars-in-new-york-new-york", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "Incredible drinks. Awesome snacks. Perfect for happy hour before catching a movie or for an after dinner drink. Super cool vibe but with no attitude whatsoever. \n\nGo.", "author": "rocky r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "The food is excellent and the service is superb. The mac and cheese with bacon is the best I've ever had and the drinks are refreshing. I recall one drink had fresh snap peas on it, how could you hate on that!", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "I like this place... I don't like it enough to head out to Brooklyn, but I like it enough, to where, if I'm in the area, I'll head here... Decent cocktails, friendly bartenders, cool seasonal menu.  They have Fishbowls of cocktails for groups - I seem to remember watching it take 2 bartenders to use the comically sized shaker for it (maybe it was just my imagination and this was something my friends and I had said).\n\nbiggest negative I remember is that its small and gets choked up rather easily.  It was REALLY warm inside too... We were sweating by the time we left headed into the brisk winter air - pretty unpleasant.", "author": "Josh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "I've been to Clover Club a few times, some of just a few pre-dinner drinks (before Char No. 4!) and once for a birthday party in the back room.  \nNegatives: Drinks are very expensive for Brooklyn, tin roof blocks cell service\nPositives: Drinks are great, unique old-NYC feel, large selection, good liquor = no hangover the next day, great bartenders!\n\nThis will continue to be a stop for me whenever I'm in the area.", "author": "Maggie L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}