{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "I ate here over  month ago and it's still memorable. The restaurant was featured on The Best Thing I Ever Ate for their cocktails, but I still remember their latkes.  Great for brunch!", "author": "Lindsay T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I've only been here for brunch, so this is a brunch only review.  The three bacon starter alone is worth it, and the drinks are superb.  Some of the dishes are not as big as I'd like them to be, but they are all very good.  I suppose there is no need to overeat all the time.", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "I highly recommend this place! Excellent selection of cocktails and the food was also amazing. I had the steak frites to eat and the clover club and the slope for drinks. A must go place whenever I'm in NY.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-25", "description": "Bartending is all in the details.\n\nClover Club seems to get them all right since I've frequented them in Cobble Hill starting when they opened in 2008. \n\nEverything about this place is spot on for the consummate drinker: the wood-panelling and brick accents, the sturdy mahogany bar and nattily dressed bartenders behind it, the roaring fireplace and Victorian couches in the back room. \n\nThe cocktail menu is about the size of a small wine menu at a 2 Michelin-star restaurant, yet the servers are able to describe each drink in detail, and the bartenders can all competently make them.\n\nI've had numerous drinks from across the menu: pisco sours, Americanos, Ramos Gin Fizzes, Queen's Park Swizzles, Bourbon Smashes, and even some Last Words. These drinks vary by difficulty, but I've always had a well-executed drink, even for something as hideously effort-intensive as a Ramos Gin Fizz. Although the drink prices are higher than most bars ($11 to 14), the combination of precision, service, and ambience justify the premium. Top-notch bartending talent doesn't come cheap, and drink will only set you back for the price of a decent appetizer at a NYC restaurant.\n\nLess known to most clientele is that the back room can be reserved for private parties. Although it will cost about $250 on a non-peak evening (Sunday - Thursday), the opportunity to have a special occasion boite with a personal bartender to catch up with friends is worth it in my mind. Tips are deducted from the deposit, so the more your friends drinks, the less you pay.\n\nThanks to Julie Reiner for raising the standards for nightlife in Brooklyn: after all, the more serious the cocktail, the more fun the night out.", "author": "Jonas M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-01", "description": "Would have loved to love it more because it seemed awesome, but the service was so bad we could only get one drink in an hour. Hello! We're literally trying to give you money and you can't swing by the table to pick it up? So we left and went to Jake Walk.", "author": "Will B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "Let me say right off the bat, I did not have any food.  I was all about the Sunday afternoon cocktails, and they were fab.  In the last \nmonth I wound up at PDT and Dutch Kills, and they were all wonderful.  But Clover had more space, more charm and more Brooklyn :-)\n\nThe bar was big, the tables not cramped.  Had there been room at the bar I certainly would have sat there and ogled the handsome mixologist.  The table service was great though.\n\nLove the Clover Club!", "author": "Giselle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "went back there for cocktails (friends' birthday), and had an excellent time. I tried several cocktails and they were all delicious.", "author": "Philippe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "I went there for brunch on saturday, it was not that crowded when we walk in around 12.\n\nThe baked eggs are superb!!! My friends ordered different dishes with baked eggs, all are very tasty. The eggs are very tender, I love the texture. I ordered salmon, good too. It was smoked with beets, so the taste is very refreshing.\n\nThere is also a fire place, but only fit for groups with less than 4 people. The sofa looks so comfortable. I'll definitely try to sit there next time with a smaller group. I can imagine people who live in the neighbourhood can walk down here with a book in hand and enjoy a perfect warm weekend morning.", "author": "Claire L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "Super delicious!\n\nI came in here this morning (11:30) and beat the rush.  (It gets really busy around 12ish.)\n\nI had the daily omelette special: asparagus and red bell pepper with goat cheese.  There wasn't tons of filling but the eggs were cooked PERFECTLY.  The accompanied salad of watercress was dressed just right.  My only complaint - I didn't know the toast came with butter already =(\n\nHe had the huevos rancheros.  Since he finished before I could get in a bite, I think that means he likes it.  He likes it Mikey, he really likes it.  (http://www.youtube.com/watch?v=vYEXzx-TINc)  I did get a taste of his bloody mary, and it was quite flavorful.\n\nExcellent value - would love to come back and try other dishes.", "author": "Scuba K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "Stopped in on our way to a New Year's Eve dinner for a drink.  Probably the best whiskey sour I've ever had.  My companion said the same about her Clover Club Cocktail...a top-ranking drink if ever there was one.  Excellent music and great vibe.  Welcoming friendly staff \u0026 bartender, thankfully not too over the top with fussy mixology...just made a very good drink.", "author": "Frederick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-23", "description": "I wish it didnt take me so long to yelp. It seems so disingenuous when I say I love a place but it took me a year to write something... but I do LOVE THIS PLACE.\nI am not a fan of flashy drinks or pricey cocktails...so when I yelp a 5 star about a place with $13 drinks - you know its good!!\n\n the bartenders here are like rocket scientist! Their mixology skills (yes I used that word casually) are fantastic- with a nice alcoholic kick.\nRye drinks oh the Rye drinks-\norder the \"Golden Girl\"- no relation to the TV show, except that they are both fantastic.\n\nthe ambiance is idealistically stunning and very Prohibition classy.\ntry liquid brunch...you will not be disappointed. \nand you dont have to go into the big bad city.", "author": "rose d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "Clover Club treads a fine line between being overly pretentious and genuinely welcoming.  By that I mean that they try hard to be a hep-speakeasy kinda place, but it can easily feel like you are underdressed. And the velvet rope don't help none, either.\n\nPersonally, I like a good mixed drink, and this place does that very well.  The service was attentive, and the drinks came quickly to the banquette where we sat.  The food was good (deviled eggs and pigs in a blanket).  I jealously watched the next table order and receive a punch bowl, which looked like fun.  The back room is also available for private parties, and has a vibe like a library lounge from a men's country or racket club.\n\nI think that this place will be much better once it has been lived in for a few years. If I want a fancy old-school meets new-school cocktail joint, I'd go to Brooklyn Social Club or Milk and Honey. It IS right around the corner, though....", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "Love this place, only been for lunch a couple times, and once for drink. But civilized, great drinks and great food. Wonderful ambiance.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Next time I go to the Clover Club I'm going to break out the LBD (little black dress), the fancy coat, and the never-worn sexy slingbacks because this throw-back spot actually makes me want to look old-school hot.\n\nOr maybe it was the strong and scrumptious cocktails that had me leaning into my boyfriend and ignoring my friends.\n\nEither way, next time, no Uggs.\n\n____\nAn update- I never would have guessed but brunch here is delicious- throw truffle oil in anything though and I am sold.  For you meat-lovers, they have a bacon tasting menu that went over well at my table.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-31", "description": "RUDE SERVER \u0026 Weird Vibe!!  There's something going on...  the staff can be so 'snooty\" ( is the most used word to describe the service here.   Definitely something up with management.  Went for brunch and server was so lame.  She's chubby indie rock girl with short hair style (cira 1994 Seattle)   Food took 1:10 minutes... so i joked about how long it was taking and an apology goes a long way right about then... she was completely snarky and dismissive about it.  She's the server that can't fake nice but halfheartedly tries but not really.   She was lame at every turn... clearly over the job and should not be a server ever.  I NEVER EVER leave a bad TIP but she was so rude that we left a exactly 10% and AGAIN, I've never done that and understand servers work very hard but she was just not cool and vibed us out even.  We left a note telling her why and THEN she charged our credit card TWICE! $330 for brunch for 4, oh, it's overpriced but most of the food was decent.  That's why I gave it 2 stars.   \n\nThis place was the first to have doorman in suit on Smith Street which is so not the vibe around here.\n\nMaybe, we just got a lame one but there are lots of complains about the rude hipster service.  I'm sure there is a chubby played out indie rock looking girl that has something to do with it.  This place gets great reviews for cocktail and food but all the other complains are about the weird vibe and service.   I grew up in the this neighborhood and we don't need this pseudo-hipster lemons.", "author": "jay b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "Nice, formal place. Just not a fan of the drinks. If you're on Smith St, I would recommend Zombie Hut unless its a formal night", "author": "Victoria O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "Cocktails and service are amazing I just expected a better crowd but hey maybe I was just there at the wrong time. Me and my friend ordered delicious punch that serves 4-6 people and FINISHED it in 2 hrs :-))).", "author": "T T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "The food is not to be missed. I can't say I have had one dish that I didn't like. Potato chips tossed in duck fat and served with truffle creme fraiche. Need I say more? Don't get me started on their brunch. Seasonal drinks made with quality ingredients and liquor by true mixologists. My favorite is the summertime Blackberry Bramble. The space is cozy and nostalgic of an bygone era. And LOVE the standards on Wednesday night. It's a great date spot. And it's another reason why Brooklyn has it all.", "author": "Jenica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Rating is for the drinks.  I have never eaten here, but the seasonal cocktails were inspired and delicious. (And expensive, but this is NYC.)", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "I always enjoy my time here.  The staff is friendly, and the servers are very helpful when attempting to choose a drink.  If you don't see something on the menu, or aren't sure what you want, they do a great job of making you something delish.  Thanks to the pretty blond girl (don't know her name...)  I am now a regular drinker of the black mamba and cloister, neither of which I've ever seen on a menu, but are so delicious.  Plus, ordering a black mamba makes me feel a little badass.", "author": "Colin L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}