{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Updates (2/5/2017): \n\nBf and I came back again for brunch. Again, nicest waitress and great ambience. \n\nIt was pretty crowded when we arrived to the restaurant as it was already around noon time. We were seated at the first tiny table by the door. However, it was a tighter spot than we expected as my bf is not the skinniest person on earth. And the waitress did not hesitate when we asked to switch to a table which just freed up. And again, water and menu came right away. And we already knew what we wanted to try this time!! \n \nWe shared the devil eggs (topped with crispy bacon croutons, smoked paprika and garlic bread crumbs, house smoked trout and mushrooms duxelles. One of each). We also shared a side of potato cakes (crispy potato cakes served with a truffle creme fraiche.) \n\n\nBf had the baked eggs with chorizo and manchego (two eggs baked in spicy tomato sauce with chorizo and manchego cheese. Served with arugula and sour dough toast). I had the Duck and fingerling potato hash (duck confit with roasted fingerling potatoes, poached eggs, pickled shallot and lemon-garlic aioli).  Both of our dishes were to dieeeeee for. We didn't even bother trading our foods which we usually do!  \n\nHere's a tip, if you like spicy chorizo, arugula and sour dough, then what the bf order is your dish! \n\nAnd if you like poached eggs as much as I do, definitely try what I had! But make sure to mix it up, the messier, the tastier it gets!!! \n\nWill return again!!!!! We can't wait!", "author": "Lilian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "I can't really comment on what the cocktails are like here, because I was too busy eating fried chicken. What else would I be doing at a fancy cocktail bar??\n\nBut really. The fried chicken, guys. Super crispy on the outside, tender on the inside, simultaneously sweet and spicy. This may have had something to do with the bottle of rose I downed earlier in the evening, but I devoured every piece and still wanted more.\n\nOther good eats? The brussels sprouts with bacon (!!) and the fried oysters. The former barely tasted like a vegetable, which is how I like all of my veggies served.\n\nOne day I'll make it back for some cocktails, because the space is really beautiful and good for impressing that special someone, but until then, I'm recommending Clover Club for the fried chicken.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "First time here I'll let y'all know how it is ok now they steak over toast is delicious  they don't have to much to choice from but it's really good I can't complain. You have to definitely try this place If u around here .", "author": "Courtenay C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "I have seen some prior reviews about problematic service - that was most certainly not my experience - our server was great. The ambiance was great, comfortable seating, AC pumping on a hot/humid day. Great cocktail bar in an unexpected area.  We didn't eat here, but I can tell you that the food smelled really good.  I had two Michter's Rye Manhattans that were crafted perfectly.  I can be a bit of a snob when it comes to this, but I can comfortably say that the cocktails were 100% and I will be back here - and I'll get something to eat then too.  Their happy hour specials seem like a fantastic deal.  Salute!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Discovered this spot after another spot we wanted to try had a long wait time. Best decision ever. \n\nThe interior is super cute - very old fashioned times. Their seating is nice, too. We had the couch area and it was really comfortable. I really enjoyed the vibes and atmosphere that they made. \n\nMy friends and I ordered a few things to try together. We ordered their fluffy pancakes (so good), their potato cakes (amazing with the sauce), and our own main meals. I got the Englander and it was SO good. The steak was cooked perfectly, the sauce was good, the muffin wasn't too hard to cut through - just perfect. \n\nI really enjoyed this place and I am definitely coming here again. So delicious!", "author": "Fionna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-24", "description": "Went on a Tuesday night and it wasn't so busy. Ordered cocktails and some small plates from a menu that's not vegetarian friendly at all. The waitstaff asked us if they can clear the table no less than 5 times, starting since we were halfway through the food, and gave us the check the minute they took the plates without even asking if we wanted more drinks. Very rude and unpleasant especially at a cocktail bar where you'd expect a more relaxed vibe.", "author": "M A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Only got to experience their bread pudding because that's all I went there for. I must say I never expected a place like that to make some of the most delicious bread pudding I've ever tasted. I'll go back for drinks I'm sure, but for now, go for dessert!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "We chose the Clover Club for dinner on Tuesday, September 13th.  It was a party of five, and we did not have a reservation.  We arrived at 8pm and were seated promptly.\n\nThis restaurant kind of resembles a speak easy type of vibe -- classy, but yet casual.  Intimate, but yet a great place for a dinner with good friends.  It fits a lot of different needs; however, the most important comment is that we enjoyed ourselves.\n\nWe were here for drinks and dinner for our group.  I had a Blueberry Fields frozen drink and thought it was absolutely delicious!  For dinner, I shared some food with one other person at the table.  We shared the Mac \u0026 Cheese with the Brussel Sprouts and the Lobster Bisque.  \n\nWe thought all the food was excellent and delicious; however, honestly -- in a world where nearly every restaurant serves up a version of the classic mac and cheese dish, this mac and cheese topped our lists as one of (if not the) single best representations of this dish that we have ever had.  OH MY!!  It was oh so good!\n\nOur server was relatively friendly and we found the atmosphere to be relaxing.  \n\nWe enjoyed ourselves and would most definitely return again.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Yaaaas for amazing cocktails!\nOur friend brought us here as a representation of what Brooklyn Heights has to offer, and I am completely sold!\n\nI am currently hooked on cynar (artichoke liqueur) so I ordered the Bardstown Brew, which is cynar and bourbon infused with coffee and mole bitters. This cocktail was AMAZING - it tasted like a dark roasted coffee ice cream but not at all sweet and with all of the depth from the bourbon.\n\nThe silent fuse is also excellent if you crave for something spicy. It is a jalapeno infused drink that will awaken your palette but then refreshen it with cucumber and mint. It will keep inviting you for more as the flavors get more complex the more you drink.\n\nThe ambiance is reminiscent of a speakeasy with dim lighting and wooden decor.", "author": "Jenny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I hosted a surprise 40th birthday party here for my boyfriend last Friday and it was absolutely wonderful. I had looked at other venues in Manhattan but their event rooms were all in basements, with a hefty rental fee. Clover Club's parlor room is just perfect with soaring ceilings, cozy fireplace, and private bar. They also just have a minimum spend and no crazy rental fee on top. The staff was lovely to work with and helped cut and serve the birthday cake at no additional cost, which was much appreciated. I had 40 guests and the room was very full but still comfortable to move around. Everyone was so impressed with the atmosphere and food. And best of all the curtain that separates the room from the main restaurant was perfect for the surprise reveal. \n\nMostly I wanted to comment on the food for others who might be planning a party here. When I was choosing I couldn't find any reviews specifically of their passed food menu and there aren't many crossovers with the normal menu for you to try in advance. So, I picked a little blindly. For 40 people I ordered:\n100 pc hanger steak crostini \n100 pc Salmon \n100 pc pulled pork minis \n100 pc Caprese Crostini \n100 pc duck tostada \nand 100 pc of oysters and 2 orders of crisps from their stationary menu\n\nThe steak and pork minis were a huge hit. These were a good size (couple of bites each) and so delicious. I think most people filled up on these. The Caprese crostini was also very good. The \"house cured salmon on savory french toast\" was a little strange - the salmon was so red it looked like a pepper and I'm not sure people knew what it was. It was tasty, just a not quite what I expected. Instead of a crostini it is on a spongy dense bread. The duck tostada I also imagined on a round crunchy base with shredded duck - but it came out really tiny as a little mound on a cracker about the size of your thumbnail. It was delicious, just so small. \n\nIn terms of the amount of food I think this was just right. There was even a little bit left over which they placed on the stationary table and people could continue to pick at. If I could do it again I would probably give up both the duck tostada and salmon and replace it with the lobster rolls. \n\nFor drinks I ordered a bunch of Champagne bottles to have out of the tables and guests could order their own wine or cocktails at the bar, which were also a big hit. \n\nHope this is helpful to someone! Overall it was a wonderful setting, great food, and just a perfect cozy December evening at Clover Club.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Clover club is definitely a place to visit. The cozy yet classy ambiance, friendly hostess and waitress and the amazing drinks and food makes this place a winner. Starting with drinks, I got the Sunkissed sour which was so good! May be one of the best drinks I have had in a while. The next one, Black-eyed Susan which is infused with black pepper, sounds intriguing but I was not too impressed with this one. \nFor snacks for 3 people, we ordered the mac and cheese which was delicious! The breadcrumbs on the top and the small pieces of thick cut bacon were just added additions to very well made macaroni and cheese. The oysters could have been better as it was not as fresh as others I have had in the city. I am picky with my cheese so I was not a fan of the cheese plate, but my sister and husband whom are big cheese fans loved the platter. \n\nThen we got the fried chicken which was the best fried chicken I have ever had. WOW. I think the breaded chicken has honey and some other amazing spices. I wish I took the rest home but I was trying to be \"healthy.\" It is a big platter, if you are eating on your own, take it home! Amazingly crispy on the outside with tender meat on the inside with tasteful flavoring. \n\nI would definitely come back here, even though there are so many other bars/lounges to try. I want my Sunkissed sour drink again and the fried chicken.", "author": "Ratika G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "I was so disappointed by brunch at Clover Club, especially after having read such good reviews. We arrived at 11:30 am and there were many open tables. \n\nWe ordered three entrees - the chorizo omelette, the Huevos rancheros, and the baked eggs with truffle and leeks. On the side, we had potato latkes with truffle aioli. \n\nThe food took an unbelievably long time, especially when the restaurant was not even remotely full. It eventually arrived after 40 minutes. I broke into my baked eggs and they were rock hard! I was so disappointed-all I wanted was runny soft eggs and I had waited so long for nothing. \n\nOur waitress was really very nice and took them back to the kitchen, got me a new order and took the dish off our bill. I really appreciate that so much. Sadly, it took about 30 minutes for my re-made eggs to arrive. By this time of course everyone else was long done with their own plates and itching to go. Just an unfortunate experience. And incredibly expensive! I would not come for brunch again but I appreciate how nice they were about the mishap.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "The undercooked fried chicken had my boyfriend and I sick all morning.  Such a pitty because the cocktails were good. Smh", "author": "Siobhan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "This was a very impressive place.  I've been to the bulk of the \"famous\" cocktail lounges and speakeasies in manhattan and this place was somewhat of a breath of fresh air.  Expertly crafted cocktails, quick service and welcoming atmosphere.  The mixologists here aren't very social, but it may just be a Brooklyn thing.\n\nThe food here went above and beyond my expectations. Literally was one of the better steak frites dishes that I've ever had(for the money).  The fries here are outstanding. You MUST order them.  This is a great place for dinner and drinks.", "author": "Biru S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Really amazing cocktail bar. \n\nTry anything on the menu or just ask the bartender to whip up anything unique. I usually ask bartender to mix up something with a spirit that's outside of my comfort zone. Probably rum or something that I find hard to make a proper cocktail out of at home. \n\nPersonal favorite if not trying something new is the bourbon, kumquat, oregano concoction (smash of the titans). Drink availability is usually limited by the stock of kumquats.\n\nJuices are freshly squeezed and sit on the bar along with the prepared syrups and variety of chopped, sliced fruits.\n\nWould give five stars but the food is average to subpar. The stand out item imo are the chips. \n\nSitting at the bar if you're alone or with another person is preferable since the chairs at the tables are kind of uncomfortable. Vibe in general is very chill, not a pretentious bar. Looks like there is a backroom available for parties? Never asked, but have seen people heading in and out.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "I came here for brunch yesterday and was very satisfied. The staff was warm and accommodating and the food was yummy. For our entree, my boyfriend and I split the prime beef burger, the country breakfast, and a side of pancakes. Everything was so good, but the country breakfast was definitely the highlight for me. The sausage gravy was out of this world!\n\nI'd been looking forward to visiting this place because I've heard about their delicious cocktails, which did not disappoint. I ordered the strawberry rhubarb spritz and my boyfriend got the flight 57. Both were on point!", "author": "Camille W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "CLOVER CLUB!!! By far my  favorite cocktail bar in Brooklyn (that explains the exclamation points and capital letters). I've been here a few times now and love it every single time. The bartenders are awesome,  the drinks are AMAZING and the food is just as amazing. CC is open late and the kitchen Closes an hour before last call. \nPRO TIP: the Log Cabin cocktail with oysters, and a lamb burger for dessert. \nLocation: Downtown Brooklyn", "author": "Cesar I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "We went back a week later for brunch, and we both decided to try something new: me: huevos rancheros. him: pork and grits. We got the side of 3 silver-dollar-size buttermilk pancakes to split as well -- or so we thought. Our server tried to memorize our order and failed, bringing us potato pancakes instead. One server said he would correct the order and leave the dish complimentary. Our original server came by and snatched it off our table a couple of minutes later. There are few experiences in restaurants more jarring than having someone take food off your table you were about to eat. Stop doing that! The correct pancakes took about ten minutes to bring, but they were once again worth the wait. The food and decor here is so amazing, they only lost one star on this review because of the server blunder. Nice surprise on the huevos rancheros: the mole sauce was perfect, not too sweet as is too often encountered.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-06", "description": "THICK. CUT. BACON. BACON BACON BACON!!! Their bacon sampler is a musttttttttttt have. My girlfriend and I were contemplating on getting that dish because we're both on a diet before our upcoming vacation but we just couldn't resist... We're SO glad we got it!!! We will come back here just to get the bacon sampler, 2 orders each because we won't be sharing next time!!! It comes with duck, smoked and maple bacon.. the duck was just okay but the other two was literally to die for. I ate the maple bacon and I felt like I just went to heaven.\n\nWe also got the potato pancakes, which I thought were gonna be more like hash browns but it wasn't. It was soft and soggy, not crispy at all. Duck confit was super super dry, like almost jerky style. My gf got the englander and it was bland. The only thing that had flavor on that dish was the buttery bread. It was just an okay experience but we'll come back for the bacon =)", "author": "Madison L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Came with a group of friends.  Decor was relaxing and service was good.  Food was delicious.  Would recommend the read pudding the most.  Came early when it opened and it was quiet around 11-12 it started to get busier.", "author": "Christopher D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}