{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "*Drink review only*\nSome of the best cocktails you might possibly ever drink can be experienced at Clover Club.\nI've visited Clover Club several times in the nearly 11 years since it has made Smith Street its home.\nThe décor is very inviting and sexy with a speakeasy feeling allowing it to stand out among other businesses along Smith street. Perfect for a date or hanging with friends.\n\nI'm sure I tried some bites when I visited in the past but my memory doesn't serve me well since it has been a while. As such, this review will focus on my recent visit whereupon I enjoyed their incredible cocktails.\n\nAlthough we sat at the bar, there were plenty of tables (albeit occupied) and I think a back space through velvet curtains. Considering it was a Saturday evening, it was super crowded and the place where everyone wanted to be.\n\nBecause I arrived first, i was able to get acquainted with our bartender of the evening, Ryan, who carefully crafted and curated some of the most visually appealing cocktails (and mocktails) at record speed.\n\nIt was actually enjoyable sitting at the bar since it was adorned with all the necessary cocktail essentials--variety of bitters, beakers containing an assortment of mixers and a gorgeous herb and fruit/garnish display. Note, Clover Club is fully stocked to include an assortment of whiskeys, gin and vodka according to brand but for those who are beer/wine lovers, they've got you covered.\n\nTheir cocktail menu was thoughtfully mapped out per category such as Sour drinks, Tiki style drinks, Gin and more.\nMy head spun. That's when I closed the menu and allowed Ryan to decide for me. He was spot on after I told him my preferences--- I started out with the Green Giant drink.  \n\nToo pretty to drink, the Green Giant was a combination of Old tom gin, sugar snap peas, tarragon, lemon, dry vermouth. This had the wow factor, served over crushed ice and very refreshing. I typically do not drink Gin but this was a mellow variety and I felt it was necessary to keep the integrity of the drink intact rather than substitute vodka for gin.\n\nMy next drink was the Sun kissed Sour. Since I was seeking something different sans crushed ice, Ryan suggested this drink especially after I emphasized my fondness for spicy drinks. This was Chili-pepper infused blanco tequila, watermelon, lime, blanc vermouth, pink peppercorn. Between the two cocktails, this might have been my favorite. It was extremely delicious and definitely had that spicy kick to it. My final drink, Gypsy Rose,  was actually a mocktail. As the menu mentioned, at zero proof, it was a combination of Elderflower, strawberry, grapefruit, lime, soda. I'm a huge fan of Elderflower, both the liquor and non alcohol variety. Very smooth and delicious.\n\nSome of the other drinks served to us were the Tokyo Drift which was a whiskey cocktail, an Old Fashioned made with Bourbon and a straight single malt whiskey. No complaints with these.\n\nAs we enjoyed our drinks, the incredible aroma of food, which was brought to tables and those at the bar, looked quite good.\nFour hours and $120 later, we left satisfied, satiated and imbibed delicious cocktails at Clover Club.\n\nElegant, super chill, wonderful drinks/food make Clover Club a must visit establishment.\nAbsolute winner.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Stumbled upon the Clover Club around brunch after visiting the amazing bookstore, Books Are Magic.\n\nClover Club's baked eggs were amazing and reasonably priced at $13. The toast was very fresh and great for dipping in the baked eggs.\n\nThe portion looks small via the photo, but it was a lot more filling than expected. Service was great and very efficient. If I'm in the area I would stop by for brunch again.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "Been here before, and it still has the charm. For starters, who can say no to an awesome happy hour? $8 cocktails? Sign me up. And these are proper cocktails. Though, I did notice the full price drinks were a bit swankier.\n\nThe décor is a bit rustic meets vaudevillian, haunted mansion? That description made no sense. Think Sleep No More, or what-have-you. Old ornate couches and chairs and such. Anyway, regardless, I dig it.\n\nMy HH drink was seasonal and gin based, but had the feel of an old fashioned given the vermouth. I dug that. And my second drink was on the fruitier side, but not too sweet. Well done, bartender. My two friends felt the same about their drinks.\n\nIt's not the hyper-focused, super-attentive, wildy-creative type of cocktail bar that asks what you like and creates crazy concoctions, but it's certainly a destination worth traveling to and it delivers in every way that truly matters.", "author": "Fred A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Super cool and high-class cocktail lounge in Carroll Gardens with a massive and incredibly inventive menu, great happy hour specials ($8 cocktails) and phenomenal space. Right across from and owned by the same people as my love Leyenda - both differing heavily in atmosphere but rivals in quality.\n\nThere's a huge selection of whiskey-based cocktails which I love as well as a ton of hot cocktails. I started with one of their happy hour cocktails which was good, can't remember for the life of me what it was though. Next I tried the \"Sage Ya Later\" (manzanilla and East India sherriesm mezcal, plum syrup, honey, Cynar, burnt sage) at $14, which was great and STRONG. The menu is in this hardcover bound booklet which is cool and Dead Rabbit-esque. \n\nPhysical space is awesome. Super ornate bar with a beautiful and romantic back room and some side tables. Service was okay but oddly slow, especially considering we were there on a Tuesday when there were maybe 10 patrons total in the bar. The cocktails take a while to make but something still felt odd about the service. \n\nAll in all, will definitely return.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-13", "description": "4.5 stars. Clover Club is a powerhouse of an establishment, one that I've been hearing about for years now. I live on the UWS in Manhattan so when I first learned of this place, I think part of me assumed/feared that I'd never make it here. A far off place in a faraway land. As it turns out, Clover Club is actually far closer to my apartment than most other places in Brooklyn and I am very pleased with myself for figuring out my error. A college friend of mine used to bartend in the East Village and once raved to me about how this was one of the premiere cocktail bars in Brooklyn. I don't forget statements like this and thank goodness. Everything about Clover Club is fantastic. The ambiance is as good as it gets, the cocktail menu is comprehensive and diverse, and the food is far more sophisticated than your typical bar fare. An easy bet for a date, Clover club is a warm, lively, intimate bar that feels like an elegant study/social club without any of the pretense. \n\nWe came to Clover Club at 8:45pm on a Saturday night. Originally, we had planned to get dinner at a more polished restaurant, but I got cold feet last-minute and decided I wanted to find a cocktail bar that just happened to also have a full dinner menu. Enter Clover Club. Just steps from the F train (perfect for a freezing night), has been thriving for a number of years. Classy and inviting, CC features two rooms, each of which has its own appeal. The front has more of a typical \"bar\" feel plus lots of tables for food service, while the back features a fire place and a smaller bar. \n\nThough this is a popular spot, we only had to wait about 10-15 minutes to get a table. It's worth the wait, and you can stand at either bar while you wait. And if you do have to wait, you'll have ample time to look at the drink menu, which requires some real studying.\n\nAll drinks here are as good as it gets. Expert crafts(wo)/manship here. Everything is pristinely executed and the range is outstanding. The drink menu is split up to help your decision-making process: Sours/Cobblers, Royales, Gin Fizzes, Hot Drinks, Flips/Nogs, Punches, Stirred/Spirit-Forward and \"The Reserve\". Of the Sours/Cobblers, we tried the Clover Club (Gin, dry vermouth, lemon, raspberry and egg white), What's Up Doc (Dried currant-infused rum, carrot, lemon, orange, ginger, maple, allspice bitters) and the Kentucky Punkin' (Bourbon, spiced pumpkin butter, Palo Cortado sherry, lemon, Angostura bitters). All three are fantastic. The Clover Club is light, fruity, frothy and perfectly balanced. The What's Up Doc is served over crushed ice in a tall class, powerful, flavorful and exciting, fruity and aromatic. The Kentucky Punkin is more decadent but not as heavy as you'd think, yummy and wonderfully seasonal. Of the other categories, we tried the a Gin Fizz, Holland Tunnel (Genever, pineapple, ginger, lemon, Angostura bitters, soda) which I was fawning over. The prevailing flavor was so tasty. Was it the pineapple? I don't know. Yum.\n\nOur nightcaps were more spirit-forward. I love dark drinks at the end of the night, and both were outstanding. We went with the Log Cabin (Hazelnut-infused boubon, apple brandy, maple syrup, Angostura and aromatic bitters) and the Bonfire Old Fashion (Bulleit bourbon 10 year, Michter's Toasted Barrel Finish bourbon, vanilla demerara, Braulio, cherry wood smoke, bruleed marshmellows). Similar style, both rich and warming. The first is nuttier and a little bit sweeter, the second is smoky as you'd expect but not peaty. \n\nAs I mentioned, the food menu is nothing to scoff at. Not as exciting as the drinks, but still impressive. Approachable dishes with a decent amount of variety. Eats, below:\n\nDeviled Eggs w/ crispy bacon croutons, paprika and garlic bread crumbs, pickled pepper relish and mushroom duxelles: A-\nThe least exciting of the bunch but still tasty. Served four ways, I'd say the mushroom variety was my favorite.\n\nBrussels Sprouts w/ romesco sauce, bacon and maple vinaigrette: A\nI can't resist a bowl of perfectly crispy Brussels. The table next to us hard ordered these prior to us sitting down, and the decision was already made. Straightforward and wholly satisfying.\n\nGrilled Octopus w/ heirloom beans, curry parsley oil, red cabbage braising jus: A-\nThe octopus itself was a bit overcooked but not that bad. A nice preparation, though. Seasoned well, good flavors, very warming.\n\nBeet \u0026 Dill Cured Salmon w/ chili whipped avocado, cured egg yolk, chives, lemon creme fraiche, \"everything bagel\" spice, brioche toast: A\nBeautiful presentation and seriously delicious. I know it looks like there's too much going on here and some might argue that indeed there is, but I still enjoyed this a lot. A creative concept with a great balance of textures and flavors.\n\nGrilled Baby Lamb Chops w/ lemon chimichurri, dried cranberries and hazelnuts: A\nTender and rich with nice seasonal ingredients. This was the bf's favorite. Great presentation and *loved* the nutty accompaniment.", "author": "Molly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Cocktails Bar + Brunch Place? Yes please.\n\nMe and the brunch crew are always checking out places in park slope. For a change we went to caroll gardens. Cafe Luluc next door was incredibly packed. When we came in, our hostess brought us to our our cushy, leather booth.\n\nThe decor of the place makes you feel like you drifted into a 1950s classy saloon. We all ordered cocktails. I highly recommend the coffee blends.\n\nThe food here was exceptional. I had the potato pancakes, and baked eggs with leeks. The potato pancakes are a nice twist to having hash browns for the morning! Also, we shared the baked clams and assorted bacon. I highly recommend the bacon.\n\nWill have to come back for their night food! Cheers!", "author": "Stanley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "This a great spot on Smith Street - nice ambiance, low lighting, and even when busy, it's never felt uncomfortably tight when having drinks at the bar. And I'm not sure if it's a recent addition, but just had dinner there for the first time, and the food was excellent (I could be conflating this with another place, but I thought they only served small plates - now they offer a selection of entrees). The staff there was also very nice and helpful - we had put our names down for a table, hung out by the bar for about a hour before correctly assuming they had forgotten about us. We let them know, and they promptly sat us and a round of drinks on the house. Not ideal that they dropped the ball - but when a place is quick to apologize and make it right, no harm, no foul in my book.\n\nPS: I ordered the Prime Beef Burger... A+", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "Cute little spot! \n\nCame here on a Saturday night around 10:30pm and was seated at a table promptly (which kinda surprised me to be honest) \n\nThe atmosphere is pretty romantic as its dark with dim lights and candles. The place was very busy and I would say that very loud, but thats whats I'm looking for in a bar! The back room is amazing and it has a (working) fire place which made this place super cozy!\n\nI love cocktail bars and this did not disappoint! The cocktail menu was literally a booklet! Huge selection of house crafted cocktails and you can also ask for whatever you want and they'll make it! \nI got two cocktails prices at $14 each (which is standard price, but you can get them for way cheaper during happy hour) \nI got the blackberry fool which I highly recommend. Its gin, blackberry, vanilla, mint, cream, lemon and rosewater. I fancied a sweet drink and this was delicious! (Its not too sweet) \nThen I got the parchment fizz which has gin, lemon, pear, soda and other things I can't remember. It was also a great refreshing cocktail. (I liked the first one better if you can only choose one) \nI also tried the hot browned butter rum which was a hot cocktail. Really good. And I tried another gin soda cocktail which I don't remember the name of. Point being- the cocktails are fancy and delicious! \n\nWe also tried the beef burger and the chips. The burger came with some creamed cheese, caramelized onions and pickles.  Decent burger but I probably won't get it again. The patty lacked flavor and it was a bit too fatty with the beef, cheese and fried onions. The chips are house-made and fried in duck fat. $16\nThey have a lot of food and a lot of starters so I definitely want to try other things next time I'm here!\n\nI would also suggest coming here for brunch! \n\nAlso super friendly staff and was very helpful.", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "I've read about this place numerous times and its legendary founder Julie Reiner so I knew I had to go. I did so and I will certainly keep going back.\n\nI went for Sunday brunch by myself this spring and sat at the bar. It wasn't too busy and the place was very comfortable. I like how even if it looks very loungey, it was still a good brunch atmosphere. The staff was friendly and had great recommendations for me. \n\nI had the baked eggs with truffle and leeks and 2 cocktails. The baked eggs are so good. They're super creamy. The first cocktail I had was the clover club, the namesake of the place and it didn't disappoint. It's gonna be the measure for all other clover clubs I will have in the future. Next is the Port of call, which was recommended by the bartender to me. It was also really good and was such a good aperitif. \n\nI'd like to try all of the drinks in the menu so I gotta go back soon!", "author": "Queer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "Clover Club is a cozy, intimate, romantic spot with a substantial drink menu and small plates and entrees to eat.\n\nI have been here twice for dinner and have thoroughly enjoyed my experience both times. Service is fantastic! Attentive, personable and knowledgeable to recommend drinks based on flavor and taste. We couldn't get enough of the drink menu---We tried a few of the sours with mezcal and gin, as well as the buttered rum drink for dessert. All were delicious and left you wanting more. To eat, we ordered a few small plates to share---the octopus and the coconut kale. My favorite was the coconut kale which had a flavor I've never had before. Yum!\n\nWould highly recommend Clover Club, either for a nice date night or a cozy night catching up with a friend.", "author": "Whitney L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "We only got a few drinks but they were amazing. Have to come back soon to try some of the food that looked great. Staff was friendly and helpful with picking a cocktail", "author": "Dev D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "After getting turned away from a nearby brunch spot with a long wait, stumbled upon this relaxing restaurant on a Saturday afternoon. Trendy lounge decor with a chill vibe due to the large windows upfront. Got a table for two immediately.\n\nTo start off we ordered the Toast Plate ($6) to pair with our coffee ($4 each). Plate includes homemade jams and butter along with toasted bread. Bread is a little burnt, but the jams and butter are good enough to mask it. Coffee is your standard fare but comes with free refills. For the main course, shared the Croissant French Toast ($11) and Huevos Rancheros ($12). The french toast is certainly interesting - a flattened croissant filled with fruit and served with maple syrup. The dish is super soft and needed no help from the syrup. Huevos rancheros is a mash of beans, eggs, avocado, and tortilla all swimming in mole sauce. One of the eggs didn't have a runny yolk; otherwise a filling and easy to eat dish.\n\nService is superb, as water/coffee was refilled constantly, and plates were taken away appropriately. Not seen as a brunch spot but certainly should be.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-12", "description": "Great neighborhood spot for brunch and cocktails. \n\nThey have the best bread pudding! \n\nI love the atmosphere and the service. Everyone is attentive and friendly. \n\nThis place has become one of my fav weekend brunch spots!", "author": "Loriela G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "Tried to go on Mother's Day (today) and they were sooooooo rude. The hostess in particular, such a shame because I love the brunch and food is good. We went last Mother's Day and had a great experience, but this time was totally different. \n\nWas told they have never had highchairs and never will. Not kid friendly in the neighborhood with the most kids. Okay, maybe your not kid friendly and you're extremely pretentious but you can attempt to be nice to a mother on Mother's Day. Dead to me.", "author": "Toni T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "Great date spot. Spacious with front room, back room, and bar seating. Nice menu and cocktails. Had a really enjoyable experience in the back room near the fire during winter.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-13", "description": "A very stylish, elegant bar with a speakeasy-ish, 1920's feeling we were lucky enough to walk in just after 4PM at the start of daily happy hour to enjoy our $6 glass of wine. There's a nice selection, with very decent fare to go along with it. With an intimate back room, it seems the perfect spot for a larger gatherings. Directly across the street from Stinkys Cheese shop.", "author": "Joseph P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Are you a complete and total pain in the derriere  when it comes your tastes in adult beverages? Well, I am. And if you're like me, you'll feel right at home at this craft cocktail mecca on Smith Street. \n\nDark and candlelit and filled, of course, with old-school shades of wood, this is the kind of space you can take a classy date, should you muster one. \n\nI skipped right over the nice sensible single malts  and started out with a sweet and flirty but nonetheless divine bourbon, champagne and peche concoction called The General. Next I sampled my friend's (huge, towering green) Missionary's Downfall. (Think frozen mint julep, only better.) I rounded it out with a Mr. Brown, a gorgeously warm and cozy bourbon and coffee-laced affair that was perfectly wrong for a hot summer night. But will order again come winter. My friends all enjoyed their various other taste tests as well. \n\nPro tip: mixing rum and bourbon...don't be that girl.  #baddecisions\n\nExtra credit: super friendly staff. And not just by quasi-hostile nyc standards. \n\nVerdict: Yep. Give it a whirl.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Attended a Gatsby themed party at the Clover Club. Let me tell you, this theme fit right in with the ambiance of this cocktail bar. The party was in the backroom and if I could imagine what it was like during the prohibition, it would be close. It was a bit small for the quantity of people but we made it work. Anyway, I was not fortunate enough to try the food but I had a wide variety of the cocktails. I was able to try the Rhubarb Spritz,  Champagne Cobbler, Barrymore Room and Prizefighter Smash. Each drink had their own unique ingredients and it's own identity. They did run out of some ingredients for some of the other drinks I wanted to try but.. I probably had enough anyway.", "author": "Courtney D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "I think everyone can agree that this is the go-to spot in the neighborhood. From the over the top swag, to the delicious food, to the unique cocktails, everything is done to perfection. Definitely a place to go if you're trying to impress someone. \n\nThe bread pudding and tres leches are to die for. Wash it down with a dry white wine. \n\nExpect a long wait for a table during prime time....but it's worth the wait.", "author": "Naveen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "came here for brunch with my bro on a sunday, and i couldn't help but think, this place is so gorgeous!  it has an old school vibe, but the dining area is well lit and open, not stuffy at all like you'd expect an old school cocktail bar to be.\n\nwe had the following to try:\n\n-country breakfast:  it has a sunny-side up egg, sausage gravy, potato cake, toasts, and a choice of bacon (maple, black pepper, or duck).  my bro went with the maple bacon.  i tried the sausage gravy and it had a nice flavor.  my brother really enjoyed everything, only flaw was that the portion was a tad small.\n\n-baked eggs with manchego and chorizo:  i'm a huge fan of baked eggs in tomato sauce (hello, shashuka!) and this was no exception.  nice tomato flavor, cheesy eggs, and crispy toast to sop it all up.  \n\n-buttermilk pancakes:  slightly smaller than expected, but tender and simple with the syrup.\n\n-bread pudding:  with bourbon caramel sauce, currants, and a quenelle of freshly made whipped cream.  it's warm, sweet, comforting, and brought a huge smile to my face.  my grip was, it took roughly 40 minutes to arrive.  i ordered it after my meal and they prolly forgot about it (due to a large crowd that came in around the same time).  when i asked, they brought it out shortly and also offered us complimentary bacon ice cream (whoa!  salty bacon, broken-up brittle, and ice cream go together so well!).  \n\nthe staff was excellent and when things go wrong, they were quick to fix things.  portions were on the small side but luckily, everything tasted good!  nothing worse than a huge plate of food but lacking in taste.  overall, a good brunch spot and will definitely come back again if i have the chance.", "author": "Wen Jin G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}