{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Great happy hour and snacks!  We tried everything on the appetizer menu and loved every bite!", "author": "Rick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "I just the vibe at Clover Club.\n\nDark, Dangerous and Romantic at the same time...\n\nLive Jazz band along with singer all dressed up to the Ace!\n\nDrinks menu are extensive and all the drinks are well make at a reasonable prices $12 or so.\n\nClover Club is a great lounge to bring your love one for a romantic date or hang out with a group of friends and have night cap!!", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "I recently had a house guest who still thought Brooklyn was a \"scary\" place. To break down these silly stereotypes, I decided to take her on a tour through the borough and decided to try out the brunch at the Clover Club.\n\nThe atmosphere is 1920's vintage, like a Boardwalk empire set. I could easily see a bunch of men in fine suits sipping some bubbly but the patrons here are, of course, the more modern variety of Cobble Hill.  The booths are cozy and the space isn't obnoxiously loud like other restaurants.\n\nThe service here was a little cold but punctual and our food arrived quickly.  We ordered the huevos rancheros, pancakes, and deviled eggs.  The huevos rancheros was some of the best I've had.  I'd skip the pancakes. They were good but there are so many other delicious items to choose from. The deviled eggs were a great app. Each one has a different seasoning so be sure to get your favorite one before someone else snags it.\n\nThe cocktails here are not to be missed.  We ordered a couple and each one was fantastic. The menu is a bit pricey, but the quality of the product makes it worth it.\n\nI'm curious to see what the atmosphere is like at night - maybe I will sometime!", "author": "Elyssa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Lived in the neighborhood for over 10 years and don't go out much but this is prob one of my favorite local places.  I have a list of places that are my faves and this is on the list.  The bartenders-whoops mixologists- are very passionate and take their jobs seriously.   They have a sincerity that I have noticed that has made this place what it is.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Fried chicken here is delicious but it could've come without the weird tasting cole slaw. Potato cakes were ok. Bread pudding was very good but was just drenched in caramel and too sweet. Service was a bit weird. We often had to ask for utensils (you know, to eat our food with) or sharing plates.", "author": "Bo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Pricey but good. Good drinks. Good food and beautiful interior. Nice for date night :)", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Great happy hour deals for half off certain cocktails and food. I've been here a couple of times for drinks and they're pretty decent. I forgot what the food was like, honestly. haha.\n\nSometimes they have a small jazz band, which is really fun. The bartenders great and dress the part. The decor is dark and moody: ideal for dates. ;)\n\nThe one thing I'd complain about is that they only let you order one drink at a time for happy hour. So we sat down with 5 minutes left of happy hour, and they wouldn't let us order more than one drink each. Grimey. :( \n\nI definitely need to go check out their brunch, who wants to go?", "author": "Jade J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Came here for drinks on a Friday with my wife, and they were amazing! These bartenders really know what they're doing (and I know we can be cocktail snobs sometimes ;)  Tell them what kind of alcohol you like, and the flavor profile you're looking for, and they won't lead you astray. \n\nOrdered the steak over toast and the deviled eggs to munch on as we enjoyed the drinks, and they did not disappoint. \n\nClover club made for such a fun night out on Brooklyn that my wife and I can't wait to go again!", "author": "Arjun S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Amazing craft drinks. Place a great little intimate vibe of its own. Grab a seat and stay a while", "author": "Darren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Sunday afternoon review:\nI brought a friend here to celebrate her birthday. I've often passed this place on a Saturday night and it's alway packed. Not surprisingly the Sunday crowd was dead. We were greeted and seated well, the cocktail list was extensive. They had a punch on the menu that made me wish we had more in our party. I wanted to try it so badly.\n\nThe food was delicious, she had oysters and the deviled eggs. I had the brussels sprout and mac n cheese, minus the bacon in both dishes. The mac n cheese was very creamy, If it wasn't for my never ending diet I would have eaten more. \n\nI previously asked the waitress to bring out the bread pudding with a candle, as a treat for the birthday girl. Which they did, and it was also good, extremely sweet. We both put down our forks and pushed the plate away at the same time. We both had diets to preserve!! Lol\n\nI must check this place out one Saturday night. When the crowd is there!!", "author": "Nica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Clover Club never disappoints! Most notably, they have a GREAT happy hour during the week until 7PM (one of the best in Brooklyn, in my opinion.) The drinks are always delicious and carefully crafted, and the food is just sooo yummy. The atmosphere is a bit dark, but cozy and cute. Would recommend this spot for a date, or with a smaller group. Or by yourself. Just go!", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "I don't know if Clover Club has changed since my previous review, but I have. In the past three years (and four days), I've learned to not only appreciate a well-crafted cocktail, but I now actively seek them out. And having been to some of the best bars in the city, I'm happy to report that Clover Club stacks up fairly well amongst the best of them.\n\nThe signature drinks are good, and they'll make a mean Manhattan if you so desire. Truly, almost anything you're interested in will be well-executed. And if your companion doesn't drink gin, there's only a minimum of the vodka shaming when she orders her martini.\n\nWhat's more, is that the food is excellent. Not exactly an amazing bargain, but they set themselves apart on Smith simply for not serving Italian or Asian cuisine, and serving it very well. Most of the small plates are quite good, and I have a particular fondness for the Steak on Toast. Perfectly cooked and seasoned, this tender meat is laid atop some crostini with just a touch of horseradish cream. It is a snack for which I am always in the mood. \n\nWith both good food and drink, I would be here even more than I already am, if not for the two drawbacks to Clover Club, as I see them.\n\n1. The service. Especially on weekends. There is nothing feigned about the indifference of the hostess, and although our drink orders were taken quite quickly, I don't appreciate sitting without a water glass for up to 15 minutes, despite repeated requests. Unlike some other excellent cocktail bars, the wait staff seems more concerned with turning tables than with satisfied customers.\n\n2. The other customers. Of course, for the most part they are perfectly pleasant people, merely trying to enjoy an evening out. However, I find that here there is a substantially greater chance that you'll be seated next to someone (or someones) who has absolutely no regard for other people's feelings. Here are some recent examples:\n\n-A man whose shameless, utterly pitiful attempts at convincing the uninterested woman across the table to go home with him were so laughably feeble that I was completely riveted, and unable to pay attention to my own companions. Honestly sir; have some consideration for my friends. Step your game up so that I can be a better conversationalist.\n\n-A couple who insisted on hand-feeding each other the excellent charcuterie and cheese plates (from Stinky across the street). I'm not generally affected by PDA, but their use of the food offended me. For the food. \n\n-A beautiful, famous young actress who would NOT STOP staring at me. Sure, she made a fairly convincing show of looking disgusted, turning completely away from me, and even going as far as asking the manager to seat her somewhere else. But her blatant desire for me was making my date uncomfortable. \n\nSome people have no shame.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "I went there tonight with my boyfriend and my parents. The service was very nice and caring, we asked for a peaceful booth and they offered us the only table in the back room, beautiful! The place is cozy and has good vibes, the food was good, not everything amazing but some dishes were delicious. At the end of the dinner we even received a surprise: a stunning desert that we didn't order! A surprise gift, so they told us. The real surprise was to find that same desert on the bill... too bad! I mean... no big deal, we payed, of course!, but I don't think they behaved properly. Next time I'll make sure that no \"gifts\" are delivered to my table.", "author": "Giulia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "I absolutely loved this place. Only lost a star because the wait time was significantly longer than we were told. 25 mins became 50 mins and we had a birthday party to get to, so we had to rush a little. \n\nOther than that, the service was friendly and inviting. The cocktails were delicious. The ambiance is simple, yet cohesive and beautiful. Love the gorgeous booths in the back. And that fried chicken was SO GOOD. That honey sauce is still in my dreams. The risotto was really good too. All the flavors were excellent. The texture was so close to being right, but I didn't really mind. The chips were good, homemade, but not worth the extra calories that come from frying something in duck fat. The duck flavor never comes through for me in a way that is worth it. Its just greasy. We will definitely be back soon for brunch and dinner again!", "author": "Bea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Best cocktail bar I've been to in brooklyn\n\nDuring warm days, its sunny and bright... at night they dim the lights and it transforms into a dark and smokey vibe (sans actual smoke).\n\nEvery cocktail on the menu is perfection and more importantly when you ask for something off the menu, they will offer suggestions and the off the cuff drinks are still equally amazing.\n\nOn top of the above, the food is great too.  Go for day time summery drinks, night time vibes, or dinner.", "author": "Ian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Excellant cocktail bar decorated in a speakeasy manner. The bar is lined with dozens of ingredients that include fresh fruit, herbs, various house made syrups, bitters and so forth. I enjoy coming here in the hotter months because Clover Club always has amazing tiki, punches and juleps. The ice they use varies from crushed snow cone ice, to 1 inch wide cubes and cylindrical pieces the size of a baseball. It's like they froze long tubes of ice and break off pieces as they need them. This place offers finely crafted cocktails at better prices than what you will find in Manhattan. \n\nHere are some refreshing and cooling drinks to order.\n\nThe Voodoo Child - Cachaca (distilled from sugar cane) based drink with lime, grape fruit, honey and Lilikoi syrup. Made with crushed ice and garnished with blood orange zest. Lilikoi is actually yellow passionfruit and the flavor really comes through with this drink. Easily one of the best drinks summer time drinks you can have. \n\nThe Green Giant - gin based drink with tarragon and snap peas made with crushed ice. This drink is the one to have a gin skeptic try because it will change their minds. I recall this being available last summer as well. \n\nBourbon Smash - Bourbon, mint and muddled lemon made with ice cubes and not ice chips. A solid choice for any bourbon drinker.\n\nAlso, if you enjoy some spicy heat in your cocktails, then order the La Sonambula #2. It has jalapeño infused tequila, chamomile tea syrup, bitters, lime and mole bitters.Tasty with a kick. You may even want to consider asking the bartenders to pour these as shots.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "Atmosphere, drink and the waitress were really nice. The food on the other hand could have been better. It seemed like our meal was rushed, because the fried chicken was not fully cooked and the Bake mac \u0026 cheese wasn't boiled all the way, it was a bit chewy. Their deviled eggs were a bit over priced($9) for just 2 boiled eggs, but the French fries were on point. I would definitely go back for their drinks!", "author": "Christina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "I absolutely love this spot!!  I was around when it first opened and lived in Cobble Hill (sigh, how I miss that awesome life), and while it has gotten increasingly more crowded due to it's growing popularity, it's still a staple for me whenever I'm in the old hood.\n\nFrom the pressed tin-ceilings, to the prohibition style drink making, to the amazingly comfy and wide-butt bar stools that rotate a full 360 degrees, this Parisian-style speakeasy is everything I long for in a bar.\n\nIf you're a whiskey drinker, I highly recommend the Old Fashioned here, which comes with one giant cylindrical piece of ice.  My wife loves the old revolution, which isn't usually on their seasonal drink menu, but they'll make it if you order it.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "+++\n- Mac and cheese; I didn't have it but the whole party raved about it\n\n++\n- Live bluegrass band playing; worth an extra star\n- Warm brussel sprout salad as filling and delectable\n- Lamb burger was second most popular dish at the party I was at\n- Bartenders; they know how to mix, they must've had to pass a final exam t work at this place\n - If you are a fan of whiskey, bourbon, rye kind of drinks, you'll love the drinks; I was informed the slope is a good choice, by a few experts\n\n+\n- Ambiance; very 18th century feel\n- The space; private parties in the back are very spacious , you have a dedicated bar, a fireplace\n\n- \n(nothing)", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Fabulous everything. The food, WOW, the cocktails delicious and the service !! Appears like a Bar but 5 star restaurant cuisine. It's chill and sexy, perfect for date night or dinner with friends. I'll be back and highly recommend it!", "author": "Chrystelle R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}