{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Wouldn't go back. OVERPRICED and RUDE. Went to a private party here. The bartender was smug, unpersonable, and filled my glass up less than 1/4 of the way! I couldn't believe it, especially for the expensive price of the drinks. Couldn't believe also how inconsiderately they treated many private party guests besides myself. \n\nAlso, I asked for a drink at 3:01am and they would not serve me, saying they were done with hard alcohol for the night. (This bar supposedly closes at 4am...?!) Side note: They had no flavored, standard alcohol anytime. \n\nGood luck going here if you want snooty, stingy service and overpriced drinks.", "author": "Lea S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "The one and only Brooklyn cocktail bar exceptionel. It's awesome that you can have a great brunch here, along with amazing cocktails. We had the bacon sampler (maplewood, duck, peppercorn) and were blown away. Then the lamb burger with goat cheese just completed the winning streak. The eggs with leek and truffle were ok (slightly under-seasoned, and I dunno about the truffle part) and so were the roasted fall veggies, but the bacon and lamb burger claimed the day single-handedly. Tasted maybe 6-8 cocktails throughout our experience there, and they were all top notch - though not as memorable as, say, Attaboy. The decor however, does pull Clover Club back in the big league - gotta love the wood paneling, velvety cushions, fireplace coziness of this place.", "author": "Vanni P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "Came here for friends' birthdays on a Thursday during happy hour, and I really enjoyed it.\n\nTables/booths by the front, and seats at the bar in the back.\n\nHappy hour prices are very reasonable. I ordered a New York Sour ($6), the Einbecker pilsner ($4), and shared the crisps ($4). Everything was good, though the crisps tasted just like potato chips to me, even with the duck fat and truffle creme fraiche. But eh, I do love me some potato chips, so I wasn't disappointed at all. They also seem to put a lot of care into making the cocktails, so it's always interesting watching the bartenders create them.\n\nIf it were not for the larger group that I was with, I feel this place would not be too crowded during happy hours. Would be a great place to come after work and have a chill conversation, though it was sometimes difficult to flag down the bartender. I would also love to come back to try the food, as well.\n\nNo card minimum.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I had some time to kill, so I dropped into this charming Prohibition era Speak Easy in Cobble Hill for a homemade cocktail concoction. They have a nice happy hour with $7 specials on some of their popular cocktails. I had the rye, orange juice, lime juice and grenadine cocktail -- one of my favorite combinations -- and loved it. Though we were the only guests at the early hour, I can see why this place is doing so well. I want to go back for the enticing menu and interesting drinks.", "author": "Todd B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "I am very glad a friend of a friend discovered it and recommended it. The menu is broken down to gin-based, whiskey-based, etc. cocktails, so it satisfies any palate. If there are still not enough options for picky drinkers, the bartenders will be happy to make adjustments. Always fun hanging at the bar, since the bar stools are so comfy!", "author": "Victoria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "We only had drinks here, but I was very impressed by the place.  Its nicely decorated and classy, but not too pretentious (I guess thats why Brooklyn is getting so popular).  Would love to come back and try the food.  The Perfect BQE was very good (its like a Manhattan).  I also had the improved whiskey cocktail and Barrymore room, they were also good.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "I like this place.\n\nThe have a nice seating area in the back with a fire place which is very cosy and nice with this weather.\n\nThe drinks are good and the food was also good. I had the steak which was a good portion.\n\nWill come back again...", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "Outstanding cocktails. I feel as if I should sport a fedora and overcoat in this classic bar. Can get pricey if you like to drink but definitely worth going if you haven't tried it. Anything with Truffle on the menu is worth that.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "Clover Club is an incredible old-timey cocktail bar and restaurant inside a beautiful space. Sit in the back on the couches next to the fireplace for a great \"only in broklyn\" experience. \n\nI often come here for brunch, and the brunch is unbearable. Start with bacon sampler where you get three different kinds of bacon in toast.  Each one, of course, is better than the next. Don't forget to wash Em down with  one of the best bloody Marys in Brooklyn. The French press coffee they bring to your tale is also wonderful. For the brunch entrees, Imlove the hue is rancheros style dish, and any type of French toast they have on the menu. \n\nAt the end of the meal be sure to order another bloody Mary and definitely do not forget to get the bread pudding. I'm no bread pudding expert, but wow this stuff is good, and I Emma really good. \n\nThen, stay for more drinks because they make a mean cocktail!", "author": "Monica F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "I cannot properly express how much I love this place.\n\nI used to live a block away and moved to a different neighborhood (because I am a fool) and I still come back way more often than I should. The happy hour is great - $4 beer, $7 cocktails, and oh, my God, the cocktails - so amazing. I'm a gin-lover, and I've never had a drink here I didn't love. Order the London Southside Fizz! It's been taken off the menu, but it's fantastic. Also, I really like the food. Try the chips fried in duck fat with creme fraiche, or the mac \u0026 cheese with bacon. \n\nThe space is nice: old wood and good light in the front room, tarnished mirrored ceiling and working fireplace in the back room. The staff are nice and know what they're doing. I like to pick a corner of the bar and just watch the bartenders work (yes, I'm a sketchball). There's live music (old jazz/swing) on Wednesday nights starting 8pm-ish. \n\nGreat place for a date or to meet friends, or just to get a martini (or 100 other things) after work. Try it!!", "author": "Charlotte S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-24", "description": "The Clover Club is all about timing.  \n\nStriking at the right time will render a dimly-lit booth in the corner with a little jazz playing in the background.  Your drink will be sublime and the food will be what it needs to be - a sponge to soak up a little of that 3rd cocktail you just ordered.  Everyone will seem a little sexier, and your night will end with the lingering aftertaste of gin and lipstick.\n\nStriking at the wrong time will leave you wading through a drink splashing, knee-high sea of douchery dressed like they just left a Jersey Shore reunion party.  All the tables will be taken by Asian NYU Poly students who are sharing one drink between 5 people, and the bar will be studded with the not-so-bright glowing stars of Bayridge who found their way up on the F train, trying to drink up the nerve to go hit on those cute Korean girls...once all 7 of them share a few more drinks maybe.  The music will be terrible, and you will walk out hoping that the next time you visit will be a peak instead of a valley.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "We only had mint juleps here on a hot Saturday afternoon, but they were damn fine juleps. The atmosphere is gorgeous, and the staff seemed a little slow, but it ended up being a good thing as we sat and enjoyed the bar. I'd like to come back and try the food, as the croque madame a waitress was scarfing down looked delicious, but that will have to wait for another time.", "author": "Sydney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "Great for drinks, dinner and brunch.  I must say I've come here a few times and think its one of the best places to eat and drink in the neighborhood.   The bartenders are not considered regular bartenders but rather mixologists which are extremely knowledgeable and can whip up any drink you ask to perfection.   There lamb burger and bread pudding is my favorite things to get there but you honestly can't go wrong with anything you order.  The food, drinks , ambiance and service is a five, what more could you ask for?   Don't forget to try this place out for brunch.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-29", "description": "this is my favorite brunch place in Brooklyn. I love the atmosphere, but I would go just for the food. it is nice not have to deal with the regular brunch food. their food is refined and comfy. don't forget to try the breadpudding, this is a killer.\nnice cocktails too.\nthey also have a small back room with a bar and a fire place.", "author": "Dominique N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Visited The Clover Club with a work friend after hours and loved the ambience, food, drinks, and service. The place got packed quickly, so I would arrive immediately after work. Happy hour is reasonably priced. The drinks were delicious - recommend any cocktail from the $7-8 happy hour menu. While the steak on toast wasn't anything special, the macaroni and cheese was out of this world! Tasty a definitely treat! Take your time enjoy a Wednesday with some live jazz in a pretty elegant, classy, gorgeous establishment.", "author": "Manaf M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "The \"Improved Whiskey Cocktail\" genuinely delivers upon it's promise", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "There is some amazing drinking to be done here. Rhubarb-champagne cocktail, carrot juice and rum, whiskey and whiskeylike derivatives combined effortlessly with pungent brown liquid of some kind, and a whole host of other things I didn't get a chance to try. Bartenders are charming and attentive. Decor is flawless. \n\nPlace gets a little loud for its billing - the paradox of the wood floor and the tin ceiling. What can you do? Drink more, is my suggestion.", "author": "Bret H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "The food and drinks were awesome but the staff was pretentious and shitty. Totally can ruin a meal and experience", "author": "Roula D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "Love this classic cocktail vibe here...some of the bartenders can stand to be a little less pretentious, but all in all a great place for an old-world feel...Especially good for happy hour, and the small bites are delicious, especially the steak. Any other time, expect to overpay...\nStylish and beautiful, classic 40's bar decor, with a turn of the century bar imported from the mid-west!", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "This place was really great, nice ambience, amazing coctails, delish food, we had fried oysters for appetizer and 3 small plates to try few things, ordered risotto, pulled pork minis, and crostini with artichoke hearts. All dishes were very delicious perfect pairing of coctails and we had bread pudding for dessert, amazing dinner on sunday evening!", "author": "Olga B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}