{"aggregateRating": {"reviewCount": 730, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Clover Club is our go-to spot in the neighborhood. The bartenders are the best in the business so in the unlikely event that you don't find something on the menu that you like, let them know what you're feeling and enjoy the show. \n\nThe food selection is great - especially if you're just looking for a few small plate nibbles.", "author": "Seth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Clover Club is a great place with a classic, lingering atmosphere and quiet enough to chat with friends over cocktails. I came here recently to meet up with an old friend visiting from out of town, and was completely blown away by the calm, sedate atmosphere. Hipsterland this is not.\n\nWhile I decided to nurse my usual Lillet over ice for the night, they have an extensive and inventive menu which my friend sampled in length -- the Clover Club was far more girly than we both expected but extremely delicious, and the Treehouse was exceptionally tasty.\n\nA must are the crisps, which are fried in duck fat and served with a side dip of truffle creme fraiche - romg. I thought that couldn't be beat, but I also opted for some mac and cheese for dinner. Anyone that doesn't like a cheesy, crumbly, garlicky mac and cheese shouldn't come here.\n\nI'll definitely be back for more cocktails and mac and cheese soon!", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "Do you like your Saturday brunch with a side of dubstep? Then Clover Club is for you.\n\nClover Club is little different from Cobble Hill's many brunch spots: welcoming, dark wooden interior, tables a plenty etc. So the dubstep (was it Skrillex?) that was playing when we came in took things to a whole new level of surreal. It seemed a whole 12 hours, and very likely a whole different neighbourhood out of place. It certainly put a smile on my face as we were ushered to our table.\n\nThe service however wasn't great. Slightly forgetful, clumsy (a glass of water was sent flying over our table) and worst of all, slow - our dishes took ages to arrive. The food (including a leek and truffle mix, cheese grits, pancakes) was better but in quite miserly portions, particularly the pancakes which were perhaps two inches in diameter. I was quite surprised that they only served drip coffee, which we all ordered. It was okay - little different to the ubiquitous  filter/'regular' coffee found across Brooklyn but at drip coffee prices. So not great.\n\nIt's a bit of a shame really. Clover Club could easily be 4 star if they sorted their service and food portion sizes. Unfortunately overall my experience was more 'okay' than good.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "My first experience at Clover Club was somewhat awkward, however my second experience was significantly better and made me realize that my first experience was more a product of the company I was with than of Clover Club itself. Ok, I'll fess up, on both occasions I was on a date. The first date was a disaster. It was so bad that it made Clover Club's chic throwback vibe and attention to detail feel pretentious and over done. However, their strong cocktails did help blur the face of that awful date and make the night feel like a dream instead of a nightmare so I thank them for that! Plus, there was a guy with a handlebar mustache working a special event in the back and I swear he didn't walk across the room; he floated. He of the suspenders and handlebar mustache cool just sort of glided across the floor. I really don't think his loafers ever touched a single wooden panel. That too helped make me remember Clover Club. Still, the date was so bad that I left with the association of Clover Club = worst first date ever!  \n\nSo when another guy suggested Clover Club for a first date I said, \"Oh. *wince* Suuuuure. *try to sound excited* Great! That place is...umm...neat!\" This time, all was well and Clover Club got to live up to all of it's glory. I was skeptical about their \"improved\" old fashioned but my date seemed to really like the Log Cabin, which was, in fact, what I was going to order at first as well. Instead I went with a Union Pacific cobbler and it was fantastic! I probably shouldn't have gotten a second one as I sometimes forget I really am a lightweight. I just couldn't resist. It was incredibly balanced and smooth with an aromatic hint that made it irresistible. As far as food, the flatbread and deviled eggs were reliable snacks for sharing and techniques on splitting the flatbread without making a mess made for hilarious conversation. We succeeded and were very pleased with ourselves. The mac and cheese only seemed to get better the second time around and I'm glad we didn't fight over the last bite. Man it was so good! \n\nAs for service, both times I've been everyone was quick with a smile and suggestion and explanation of the menu. They really know their menus back and forth. Personally, I can't say enough about bar staff who know their menu. \n\nClover Club knows what it's about and sticks to what it's good at. I could wax poetical on it more, but it would only be overly romanticized thoughts of an era that I never really knew but wish I did. In the meantime, perhaps I will treat myself to Clover Club more often and not just wait for someone to suggest it as a date night!", "author": "Kristen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "Ok, I'll bite. \n\n\u0026 up CC a star. The last two times I've been here, drinks have been more consistent and I've just liked them better. Service also improved.\n\nFavorite cocktails from my last jaunt include the Apple Turnover ($12) which was Scotch, apple brandy, apple liqueur, lemon, ginger, cinnamon \u0026 was so good I had two. Perfect fall flavors. And one of the few drinks that doesn't have benedictine or chartreuse -- honestly, cocktail bars, these spirits are so overwhelming, why are they in so many drinks?? there is so much room for error!\n\n\u0026 the Widow's Kiss ($12) which was Calvados, apple brandy, Benedictine, yellow Chartreuse; not bad but the apple-y goodness was overwhelmed by the Benedictine \u0026 Chartreuse.", "author": "Claire F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "One of my favorite cocktail bars for old favorites and new twists.  If I had to choose only one bar in New York City to have a date at or bring friends visiting, Clover Club would be it.  The decor and atmosphere is what some may easiest understand as \"speakeasy chic\".  Yeah, I went there.  It's dark and tastefully decorated in classic speakeasy style but you may even feel a little sexy when you're enjoying your whisky or champagne if you do it right.\n\nTry the \"Eleventh Hour\": a smoky blend of mescal, tequila, and absinthe.  Too intimidating?  They serve up great inventions waiting to be sampled by you.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Clover offers the positive aspects of cocktail culture (comfortable spaces, well made drinks and evocative music) and discards the negative aspects (pretentious service, high prices and useless formality) to offer an experience I go back to over and over again.", "author": "Gamal H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "I've been to Clover Club a few times before and had no complaints--good drinks, fine service. \n\nTonight was mostly the same, except for the fact that we saw--and after squealing and jumping up from our table--two GIANT roaches on separate occasions. Me and my three friends killed both of them. While I understand that it's the summer and that this is NYC and that roaches are somewhat unavoidable, what made me furious was the fact that the wait staff didn't do a thing. I killed the first roach right next to the waitress and all she said was \"oh...well... Yikes.\"  There was no coming over to apologize, no offering of a free drink. It was like no one cared. After we killed the second one, the bartender said \"yo man you're a hero.\"  \n\nNot acknowledging two giant roaches during a dining experience means I'll never be coming back.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "I've been meaning to come to clover club basically since it opened, and finally made it there last nigh! Maybe my expectations were too high, but I was disappointed in the rigid cocktail service. I ordered a happy house Moscow mule at the bar ($8 -amazing happy hour deal!) and really enjoyed it, but it was sweet. That's OK. Moscow mules can be sweet. We moved to a table where I looked at the post-happy hour menu only to discover there was not a single vodka-based-cocktail on it. When I explained to the waitress that I wanted a not-as-sweet vodka-y cocktail she was about as condescending as can be. She said they are a \"gin-forward\" cocktail bar and they don't have any vodka cocktails. (Never-mind the fact that I has just ordered a vodka cocktail from their bar). After saying I can get woozy if I mix booze-y she begrudgingly relented and said if I haaaaad to I could substitute vodka for gin in a drink from the menu, but it would \"totally change the flavor composition\" or something like that. I'm really used to high-end cocktail bars with super-talented bar tenders who ask you what kind of flavors you're in the mood for, and can make you a delightful drink to accommodate your wishes in that very moment! I would have appreciated it if our waitress could have at least suggested SOMETHING vodka based. Tell me to order a vodka martini or suck it up and get another Moscow mule. I don't care. Just don't tell me there's nothing here for me to drink. I ended up not getting a second drink I was so put-off by the experience. It's a lovely atmosphere but I might not be back.", "author": "liasla a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Had a late lunch on Sunday- the drink menu is long but the waitstaff is helpful picking something out- we tried a tequila drink with jalapeños and  cucumber very interesting with a definite kick in the end- the wait staff were super friendly and the vegetarian options were great! Definitely will be back! We sat by the open from by Windows and it was very comfortable-", "author": "Dana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-13", "description": "This place is great! Just not late night after a depressing movie like IT COMES AT NIGHT. Yeah, don't come or go to the CC after that because the music and crowd(?) will not uplift you. Also, the food...idk.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Went here last night with the roommies for drinks only. Beautiful decor, very intimate lounge/bar.  It would be a cute place to catch up with the girls or to have a date night.  What earned this place 4 stars is the Blackberry Fool.  Try it - it's da best.", "author": "Kimberly Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-29", "description": "I'm writing this review as a guest of a bridal shower that was hosted here. They have a private back room that is super cute with its own bar. I kicked off the meal with a DELICIOUS bloody mary and then sampled the following:\n\nBACON TASTING - $9 (Maple bacon, black pepper bacon and duck bacon). This was novel, but more so in theory. Wouldn't recommend it\n\nDEVILED EGGS w/ FOUR FLAVORS - $8 (topped with crispy bacon croutons, smoked paprika \u0026 garlic bread crumbs, house smoked trout and mushrooms duxelles. One of each.) YUM!! These were amazing.\n\nPORK n' GRITS -$13 (Braised pork over cheddar Anson Mill grits, topped with a sunnyside-up egg and crispy shallots. Served with sourdough toast.) SO SO GOOD. DEFINITELY GET THIS!!!\n\nBAKED EGGS w/ TRUFFLE \u0026 LEEKS -$12 (Two eggs baked with melted leeks, truffle butter and parmesean. Served with a small arugula salad and sourdough toast.) Almost like an asian \"don tot.\" Yummy with such a smooth texture\n\nHOUSE CURED SCOTTISH SALMON - $14 (Scottish salmon cured with beet and dill, served with potato cakes, poppy seed creme fraiche and herb salad.) Very yummy, and also surprisingly fishy.\n\nThe staff here were phenomenal and it was an incredible bridal shower! :)", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Great cocktails and wonderful food. Everything was great. \n\nBe careful, the drinks are dangerously good!  Overall, we had a great night here.", "author": "Moose M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "I just think if you're going to charge me an arm and a leg for brunch I should at least get something that wows me. The staff is a bit pretentious, the food is really not all that, the decor is nice and the drinks are stiff, both in price and in alcohol content- which is good but with all the bars in the area, I think I'd go elsewhere. \n\nThe cocktails are well made but again, pricey and served with a slight attitude and if you're sitting down, be prepared to wait for your order to be taken. \n\nOverall I feel there a ton of other unpretentious options in the area but if you're looking to spend a lot of money on food that is okay, then I guess come here.  Or eat in Brooklyn Heights with all the snooty others.", "author": "Kim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Wow... Wow... Wow! This place is great and served me one of the best cocktails I have ever had! I really enjoyed it!", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Finally made it in for brunch and I'm adding another star on that virtue (and I wish I could make it 4.5).  Our party of 5 was sat right away and our waitress was great.  We all got bloody mary's expect for the rebel who ordered a bloody maria.  All were quite tasty.  I got a mushroom scramble with creme fraiche which was great but i was envious of my friend's truffle and leek baked eggs.  Definitely a worthy brunch spot, even if I wouldn't normally pick a cocktail speak-easy joint for brunch.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Five stars! Great bar, even better happy hour.\n\n- Great cocktails: Extensive menu, with quite a few different and interesting choices. All the cocktails are expertly made, can be rather boozy, and the presentation is usually well done.\n\n- Great prices: Cocktails are several dollars cheaper than their Manhattan counterparts, and on happy hour select cocktails are $6.\n\n- Decent Food: Better than should be expected for a cocktail bar. There is the usual charcuterie, olives, and cheese plates, plus moderately priced entrees. I've never tried anything beyond the bar nibbles, which are good if not great, but food is not an after thought here. However, I wouldn't go for dinner.\n\n- Good Service: Maybe it's because I've only ever been on off hours, but the service has always been prompt. They rarely forget orders and are willing to make intelligent drink suggestions.", "author": "Steven J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "My boyfriend asked me to tell you all that a (small) cup of coffee (with refills) is $4 at brunch at Clover Club.\n\nI'm still giving them 4 stars because I'm not sure if there's another bar in the neighborhood that cares as much as about it's food as it does it's cocktails.  The cocktails and food are top notch, and the service has always been good.  But, yeah, make your coffee at home before heading over to the Clover Club for brunch.  And order their mushroom scramble.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Only been once and was in the back room for a private party, but I will say that this is a bar I could hang out at it if I lived in Brooklyn (Hobokenite).  The bartender was friendly and was quick to suggest a cocktail when I told her what liquor I preferred.  Friends got a white Russian (awesome) and a vodka gimlet (incredible).  Food was fantastic, had pork sliders and lobster rolls - highly recommend both.\n\nSeemed like the front bar got pretty crowded so probably need to get there at the right time and stake your claim at a bar stool if you want to get comfortable.", "author": "Mike M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Clover Club", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "210 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/RB-6lyEH1WoXYby0jDFPdA/ls.jpg", "@type": "Restaurant", "telephone": "+17188557939"}