{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Best egg and cheese ever!!! Love the food from here. The egg and cheese was just perfect.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-19", "description": "The seafood bisque \u0026 salmon bisque soup here is really good, however I do the feel it's a bit pricey. A breakfast sandwich is $5, an omelet is $8, a dollar water is $1.25, the containers with the precooked pasta in a small container is $4.50..it's a bit pricey. The staff is professional for the most part, but it's really just the prices.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "I absolutely love Court Order! I work in the area and this place is very popular with a lot of people I know. I started coming in for the coffee. It's self serve so you can make sure it tastes the way you want it without all the guess work of having someone else prepare it. I also like to get a bagel in the morning sometimes. The people who work at the food station are super friendly and in my opinion provide great services. I've also tried a chicken panini here which was AWESOME! They also have a wide selection of prepare sandwiches, wraps, salads, and slices of cake. I really love the selection here! Some of the items are a bit pricey in comparison to nearby delis but I've never been disappointed with anything I've had from Court Order. \n\nIt can get busy during the morning and lunch rush but it's definitely worth it.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-12", "description": "My boyfriend told me about Court Order before, but never had the chance or urge to come here until I was in the area recently. It's not that spacious inside, definitely not ideal for a sit down meal, but they do have a few seats. This is more of a grab and go place. They have an array of foods and drinks (wraps, soups, salad bar, sandwiches, chili, smoothies, and etc.) \n\nI've tried their Waldorf wrap and it's very much similar to Lassen \u0026 Hennigs. The taste and quality is the same. I've also tried their salads too which are quite expensive around $10 and over. Their smoothies are quite good as well. \n\nThe staff here are pretty friendly and proactive. If you order an item from online and they happen to be missing an item, they will call you immediately and ask if you want a substitute.\n\nOverall, food can be a little pricey here, but if you're a student I think the price you pay for the food and drinks is worth it. This is definitely a good place to come to grab a quick meal or coffee.\n\n*Note: Court Order \u0026 Lassen Hennigs is owned by the same owner. They also have student discount, but you must present your ID.*", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I LOVE THIS PLACE. I would recommend this place to any that wants something quick and delicious. I always go in and get a large iced cappuccino with a muffin for breakfast. For lunch I will either do a salad (you make your own and it's kind of pricey) or I will get one of the paninis they have to offer. They also make fresh smoothies which are really good too. Overall this place is a 10/10 from me, even thought they're on the pricey side for things I still go in often.", "author": "Kayla S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "horrible customer service. ordered breakfast and lunch on grub hub today so I didn't have to go out looking for lunch on my lunch hour in the rain. Instead of letting me know they never received the order (grubhub or the place idk which one was supposed to let me know) I let an hour go by because i figured in the rain it would take the delivery a little longer, i decided to check and see where my order was and I called the store and she informed me she never received my order because their fax machine was not working due to the rain (does that make sense?) so they never received mine or countless other grubhub orders you would think if they knew they had an issue they would let grubhub know so I don't sit here thinking my order is being prepared as per the grubhub tracker. It is already noon and i did not have breakfast because it never came and neither did my lunch so thank you court order for your crappy services.", "author": "Celina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "I really wanted to like Court Order after starting a new job in the neighborhood and having to leave my old deli which made awesome egg sandwiches.  Imagine my disappointment when that first bite was less than mediocre.\nI usually get an egg and cheese on a roll, with salt and pepper.  Pretty simple, right?  I've gone to Court Order twice and both times were regrettable.  Both time the roll was stale and tasteless, gross.  Eggs were under cooked as well, and the cheese wasn't melted at all.  So, basically what I got was a stale roll, runny eggs, and cold cheese.  Salt and pepper were never added.  Both times I threw the sandwich out because it was so bad.\n\nOn top of that the prices aren't cheap.  I got a juice and an egg sandwich and my total was like $7.  Staff were find, but not friendly or talkative.  On the upside they do have lots of options for things to add onto your sandwich.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Hands down, the best deli in the Downtown Brooklyn/Brooklyn Heights area. Clean, delicious, and their delivery is always amazing. We order from here for my office frequently, and sometimes do catering with them as well-- we are never disappointed.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Yes, there are lawyers lawyers everywhere... \u0026 I am sure that they do such a good job...so they are not sued by their customers ...ha ha...\n\nAnywho, the place, which is staff by apparent hardworking immigrants, whom Trump would not like...BUT who give a damn?....actually do a great job of keeping this place clean \u0026 appealing....at least during off hours....and likely at minimum wage.\n\nI really like the fresh custom stuffed Panini that I had \u0026 I downed a pretty good cup of coffee.  My bro had a fresh salad that he liked.  As you can see by my pics there are a multitude of fresh looking salad choices on hand.\nThe pleasant fellow helping me had no problem fixing a fresh custom Panini for me, which\nreally hit the spot.\nI am a Coffee nut, own a Italian Made Deluxe Grinder, use a French Press, \u0026 buy the highest rated Coffee's for up to $60 for 6 oz., and really despise that Star Chain...\nAnyway, their Brooklyn Coffee was not too bad \u0026 I really liked that they really had their fresh cream for their slightly bitter coffee in a open frig .... looked \u0026 tasted fresh.\nI drink black coffee only at home where my deluxe coffee is floral \u0026 not bitter at all.  Super-premium coffees are like fine wines \u0026 I go for those that are rated 90 points \u0026 above with both. Yes, I am a spoiled snobby slob, but somebody has to be one...it helps the economy \u0026 my taste buds....and I am sure that I will someday give lots of my $$$ to Cardiologists \u0026 CV Surgeons to keep me going in the future.\n\nFor this area, it was a bargain compared to seeing a lawyer or parking your darned car.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nYou are hereby, Court Ordered to try this place...and like it.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nEven though, I grew up in NYC, then lived in both Honolulu \u0026 CA....I have to \nsay that they had close to the freshness of the stuff we have in CA...near the farms, so they must get the stuff right off the trucks..\n\nGreat pitstop when you happen to be in the area.  I wish I had a place as nice as this near my job in CA.\n\nI think some of the resident NYers are on crack if they think this place is pricey....they obviously have never visited nor lived in Hawaii, SF, or the SLO area of CA...where you can paydouble in many places...especially in Whole Rip-off market.\n\nOh, I forgot, many of the people I grew up with in Crooklyn were on Crack, PCP, MJ, etc...or were just run of the mill jackasses...even your so-called \"best friends\" would stab\nyou in the back for a quick buck....\n\nI am sooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo...\n\nglad I left the hell-hole of NYC for points West\n\n....I am reminded of the shear horror of NYC, whenever I visit...\nplease bring back Subway Tokens \u0026 get rid of the ridiculous defense system for NYC Bus Drivers....what is wrong with you people?\n\nIf you are that terrified, move out \u0026 get another job...\n\nbut first get a Pannini with some Brooklyn Coffee here...\n      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nYes, I will admit that there is some good eats still in NYC...like Polish food in Greenpoint \u0026 tiny Koreatown in NYC.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "This deli is a good go to place for when in a rush.  You can pick up a quick prepared meal or when the weather is not great if you don't want to walk far.  They have a variety of dishes available and you can create your own salad, select from different soups everyday, and small sides to grab on the go.  When I first started going for coffee, they had at least 7 flavors, \"german chocolate\" was my favorite! Ever since they switched their coffee brand the coffee lacks.  Sometimes change is not good...but overall they're a good place for quick meals.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "It didn't make me sick.\n\nI have been working in the neighborhood for a few weeks and checking out the restaurants at lunch.\n\nI ordered a panini.  Yes, I know:  I shouldn't order a panini in a place like this.\n\nIt wasn't a panini, anyhow.  It was a sandwich made with a round piece of bread that had brown lines on it, cut in half, the ingredients inserted and heated in an oven.\n\nIt didn't taste good or bad, it was painfully average.", "author": "Dick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "Their cashiers are extrememly RUDE!!!!!! they are not customer service friendly at all and they hardly understand english when you speak to them. The older woman who mans the oatmeal station is super sweet and acts very pleasant. The Gentleman who does the omlettes is super nice and makes a great omelette. All the guys cooking or making sandwiches are super sweet and attentive and super generous; except for one younger little guy always makes my sandwich wrongs acts like he forced to be there. The lady thats on the line acts like bacon is coming out  of her paycheck. i have a love hate for this place their breakfast platters and sandwiches are great; but if i was a manager i would rehire different cashiers i like a friendly face after spending a great deal of money there. i give it 3 stars for food 0 stars for cashier services!!!!!", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-21", "description": "They're half-price after 4PM on Fridays and that's still a ripoff. \n\nFood is as salty as the beach. The salad dressings taste weird. \n\nThe only decent thing is some of the soups, and even then it's hit-or-miss and still the better of them are overpriced. But good luck getting them because they're not interested in serving customers behind that counter. \n\nIf you must go here anyway, they have separate discount cards for soups, salads, and hot plates.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-17", "description": "If I could give them 1/2 star, I would. I bought a salad and absolutely everything in the salad taste nasty. Cranberries weren't sweet. The chicken tasted nasty if it was cooked on a dirty grill. Even the spinach tasted weird. I got the French dressing and that too tasted weird. It was a waste of my $10. Oh yea I forgot to mention how overly priced everything is. If you don't want to enjoy your food and value wasting your hard earned money, this is the place to go.", "author": "Adeena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Great Breakfast sandwiches, pasta... and Iced coffee\n\nthis place is more for take-out", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "This was the most popular breakfast/brunch/lunch location when I worked at the Department of Education because of its convenience (right across the street from the office) and because of its variety of food.\n\nThe price is cheap to average. In fact, I pay more at Popeye's and McDonalds for a meal than I do at Court Order for a meal.\n\nThe quality of the food is average at most. There had been times where their oatmeal was water down so much the consistency was not much thicker than water.\n\nThe variety of food available is superb, compared to other locations within the area. I can get everything from fruits and snacks to full sandwich platter with a side of home fries. \n\nThe only reason I am not giving this five stars is because of the quality as previously mentioned, and me eating 3/4 of the strawberries I purchased which claimed to be fresh only to find out half of them have mold on them. Needless to say I was disgusted that I had eaten molded strawberries, but thankfully this was a one time event and not a recurring one.", "author": "Tai C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "meh... it serves its purpose if you're looking for a quick breakfast and you work in the area. Food is average, prices are average. About $4.50 for two eggs, turkey bacon and home fries. Very busy in the morning, but you'll be in and out in no time. Food isn't the greatest, but it will do if you don't want Dunkin or anything else in the area.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-28", "description": "Rip-Off Alert!  Today I went there for my usual salad which is $6.50 plus $2.50 for sliced chicken.  When I got to the register I saw there was a charge of $9.50 (sans tax), so I asked the cashier to rectify it and she refused.  I told her again that I would not pay for this if I was going to get ripped off (even if only by .50).  she told me to go back to the counter - which I was not about to do (especially since I wouldn't be to identify the person who served me) ... so I walked out.  It is understandable that mistakes will be made once in a while, but the cashier should rectify it  - this is not a good business practice.  I wonder how many others are overcharged and don't know it?", "author": "Carl E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-26", "description": "Decent omelets, salads and sandwiches.  Not stocked with many sides or snacks.  Service is inconsistent.  On the expensive side for what you get even though that is typical for the area.  If you are looking for a fuller deli experience, Garden of Eden on Montague is the way to go.", "author": "Jen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Get the chicken parm panini with extra sauce - perfect lunch!", "author": "Jaime G."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Court Order", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "52 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/w0NxRwY_W3wNEPUnmtypHw/ls.jpg", "@type": "Restaurant", "telephone": "+17189359300"}