{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-29", "description": "I've lived in this neighborhood for nearly two years, and have given Court Order many chances because it is convenient and tends to be quick during the breakfast and lunch rush.  However, convenience and efficiency are not enough to keep me coming back.\n\nThe reason: outrageous and more-often-than-not arbitrary prices.\n\nIn the neighborhood, go to La Bagel Delight for breakfast or Garden of Eden for lunch for a better quality sandwich and a free drink with it.", "author": "Ari C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Pros:  Really good quality food (I'm a big fan of their Grilled Chicken wraps), nice variety of food, and little wait time.  \n\nCon:  Expensive and not open on weekends\n\nOverall, I highly recommend.", "author": "TJ C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-20", "description": "The best thing going for this place is its speed. I can order, pay, and be on my way (because there's no seating) in under 5 minutes. I think their breakfast sandwiches are the best thing on the menu, followed closely by the pasta salad. Their sandwiches are pretty meh and there are enough competitors nearby to not even make them worth trying.", "author": "christopher b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "Sandwiches, plain and simple, pre-made or made to order... along with salads, pasta, sides, baked goods, etc.  My grilled chicken with greens and honey mustard on a spinach wrap was excellent, along with my fresh fruit.  The place is clean and cute, a little pricey (wrap $5.75, fruit $2.95), but my supervisor treated us, so I'm not complaining!  Would love to try all their yummy looking baked goods to see if they live up to the \"Bakery\" claim on the awning...", "author": "L C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "A pretty basic takeout place, with decent prepped items.  Their salad with cranberries and cashews was a good lunch option, as was the grilled chicken wrap.  In truth, my favorite reason to go, though, is the iced coffee and fountain service iced tea and lemonade ... you can get a huge iced coffee without the lines at the nearby Starbucks/Dunkin, and mix your own Arnold Palmer!", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-04", "description": "Lassen \u0026 Hennings' little sister.  You'll get the same quality food at the same prices with the same service as Lassen \u0026 Hennings, but it will be a more chaotic experience since this place is ALWAYS crowded during lunch.  The other aspect leaving this place in L\u0026H's shadow is the fact it has fewer options... except I think Court Order has the pasta station (where you pick a pasta, sauce, ingredients) and L\u0026H doesn't.\n\nOverall, you can't go wrong here, but if you have the time, it might be a more pleasant experience to just walk the few extra blocks to L\u0026H.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-11", "description": "I've only ever been here for lunch, despite Court Order's being directly on my breakfast route. And for lunch, I've only had the salads, but I've had enough of them to feel like I'm more or less an expert. And my expert opinion is that I always feel overcharged. I look at the bowl of greens and the add-ins that I order, and the drink and whatever else, and I think \"this won't be more than $8 or so\" and it's always closer to $11. I just don't like that feeling, and that feeling is probably why I prefer Hale and Hearty right around the corner.", "author": "David L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "overpriced, you have to make sure they uunderstand english when you place delivery order", "author": "Paul R."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Court Order", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "52 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/w0NxRwY_W3wNEPUnmtypHw/ls.jpg", "@type": "Restaurant", "telephone": "+17189359300"}