{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-13", "description": "This place is near Supreme Court and Federal Court buildings, and close to Barnes and Nobles bookstore. They have cold-cut sandwiches and wraps inside. The tuna salad wrap tasted alright. Worth to visit if you're in between sessions of break time during Jury Duty or wanted to grab a bite before heading to B.N. Store to read/relax.", "author": "Hikari N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "The first time I went to this place, I was attempting to order a simple ham/egg and cheese sandwich.  However, all the people that was behind the counter was playing around and ignoring the several customers standing waiting to place orders.  When I asked the cook that works in the omelette station where to place the order, he grabbed another worker (who was playing around) and proceeded to yell at him in front of me about why is he ignoring customer and then pushed him to take my order which came out horrible!  The eggs were extremely dry (almost burnt), 1 slice of ham only and got the wrong bread!  Another time I went to order an omelette, I asked for extra soft ham and cheese omelette, wheat bread toasted with butter and home fries.  The omelette was dry and over done (another customer who was ahead of me rejected her order and walked out of the store! - bad sign!!!!) the home fries tasted bitter and has a slightly burnt taste.  It took 10 minutes to get the toasted wheat bread (that was supposed to come with the order) and they made a mistake by putting jelly on it (never even entered in my mind much less asked for it...) The omelette cook started to yell at me saying I asked you few times... (he didn't) and when I walked to the counter, he continued to yell at me to other customers.  I could hear him all the way at the cashier (at least 50 ft away)... I'm not expecting 4 star Michelin restaurant customer service but this is beyond ridiculous.  It's over priced... the food is not even decent and the customer service (the cook all the way to the cashier) is horrible.  They act like they are doing you a favor and you better like it.  Considering the location and the enormous amount of competition in the area... it is horrible how they treat customers.", "author": "N C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "Great for coffee, muffins, and sanwiches/paninis.  They also have a delicious variety of chili and soups every day.  I wish they had a better selection of drinks and snacks - they have one refrigerated case with a small selection of Coke products and they only sell one \"indy\" brand of potato chips.  It's located in a high traffic area of downtown Brooklyn, so the people making food can be a little aggressive when yelling, \"Next,\"and the girls who ring you up at the register sure take their time ringing you up while they chat with each other.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Court Order is one of my stops on the way to the subway when I need something quick to eat or drink.  In the morning, the coffee cake muffins are pretty good and the coffee is self-serve, which saves time.  For lunch, I really like the mozzarella and roasted pepper sandwich, the veggie chili (if it's early enough in the day), and the seafood bisque (again, while it's fresh).  In general, the service is friendly and they're definitely working on customer satisfaction, because they've recently dedicated part of one wall to counter seating.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Although Court Order is always busy during the week because of the business/work crowd I love it here. I get sandwiches and paninis on the regular since I work nearby and I've never been disappointed. Everything tastes fresh and delicious. The staff at checkouts are fast and efficient so it makes up for the crowd. They're prices are also very competitive for what you get. Soups aren't great though I don't recommend them. Coffee is decent and cheap.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Ordered a large iced tea/lemonade mix today. Was halfway through it and found a BABY ROACH floating in it. I called and they said to come back and they would give me a refund. When I went back they only wanted to give me half my money back because I had already drank half of it. I told them no way since there was a ROACH inside of it. Then they offered me another one or a coffee instead!! I was finally able to get a full refund but I will never be going back!! Still feeling nauseas about it", "author": "Maureen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "The only thing I actually like from this place is their dessert, so that is what I will be reviewing. I enjoy their pies such as Apple, Blueberry or Cherry.  Coconut pie, not so much. Also their cakes are good, such as the chocolate decedent cake with the chocolate chips and some kind of jelly. It is actually yummy. Their strawberry short cake is awesome and their mouse cups care amazing. Not a big fan of the cupcakes. The frosting on their cup cakes are to gritty ::shrug:: \n\nI mean, overall, the place is okay. Really not into the \"food\" food because either they use too much Mayo on some of their sandwiches or their pasta salads are...blah...gross. But the desserts are on point. Also, their brownies are yummy. I will say that. Might be time to make another trip this week.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "Nice spot in Downtown Bklyn. The  thing is, where the  hell is the seating? I'm not sure I've ever come across a deli with ZERO seating. If I knew there was no seating,  I would've walked on by. Very weird...\n\nAnyway, my sandwich was good. I had really no issues because I was starving so it wouldn't matter anyway.", "author": "Edgar S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Generally I like the place but some of the sandwiches are a bit expensive. Breakfast has the best value here. The $4.95 breakfast platter with a free coffee is great. The eggs made to order has also saved my life. Personal favorite: Egg and cheese sandwich using egg whites and pepper jack cheese. If your looking for lunch the Italian panini is also a personal favorite of mine. Not too much stuff in the sandwich, but enough of a variety for you to enjoy.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-25", "description": "I go here for the make your own spinning salads at lunch, and it is perfect for that. Yes, a bit pricey for a salad, but I challenge you to find a place in the area to get a salad of comparable quality for any cheaper. It is also wicked fast during the lunchtime rush, which is very important to me. \n\nI got a sandwich here once. It was good, but nothing spectacular. I agree with Ari, La Bagel Delight is a much better place for a sandwich.", "author": "Gretel U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "Sandwiches and wraps are pretty much an ideal lunch for me. This deli has a wide range from your basic everyday sandwiches that are premade and ready to go like turkey and roast beef, so forth. It's decent but like all premade sandwiches, it's cold and dry. You have a selection of wraps and sandwiches they prepare behind the counter as well. Those take a bit longer but it does taste noticeably better.\n\nAnd then there are their hot sandwiches such as chicken cordon bleu, parmigiana, monte cristos, tuna melts, and etc. It all sounds delicious but they were all premade sandwiches sitting in the display glass at the counter which they just take to reheat on a panini press. It's not too bad but it's not exactly wonderful and tasty. It's a decent lunch which is the most this deli can offer you. The only times I'd come is if I want something quick to go. It gets real busy around lunchtime so I wouldn't even bother but hey, think of where you are. Every shop is full.", "author": "De C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-20", "description": "You can get a smoothie, salad, sandwich, standard deli fare.  What I like the most about this place is you can get half a wrap for 3 bucks.  This is awesome!  Come on people!  Who needs to eat a whole wrap for lunch?  Where can you spend 3 bucks for lunch?  Seriously! This is awesome.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-22", "description": "Forget the stars, if you go to BLS you WILL eat here often.  It is the closest place besides the school cafeteria* with options and it's fast so it's perfect for those days** you need to eat and get back to the library stat.\n\nThe sandwiches are meh- the pasta salads are better than expected.  But really, quality is not as important as their speed and location.  And on that note...back to studying.\n\n*No the law school cafeteria is not any better than your high school one.\n**As in everyday.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "This place has good sandwiches and salads. It is a little over priced. The smoothies are very good. \nThe mixed greens chicken sandwhich.", "author": "Luz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "I love to stop in here for a quick panini or sandwich to take on the go during lunch. Prices are decent and the main attraction for me is that its speedy. Staff are friendly as well.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "I work down the street from Court Order and am finding them a nice change of pace on occasion. Its a little pricey for a fast lunch, but everything I've had has been great.\n\nGood selection of soups that I'm looking forward to trying during the winter. Awesome spring rolls and tasty sandwiches.\n\nI wish they had an area where you could sit and enjoy the food, instead of forcing me to buy a diet coke at mcdonalds and eat there instead.", "author": "Layla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "The sister deli to Lassen and Hennigs (one of my favs) it's smaller than L and H but has fresh ingredients (I really love their soups) and it allows my to indulge in the best red velvet cake I've ever had. P.S. this place is takeout only, they get most of their business from delivery to the nearby court and municipal buildings, so don't expect to get a table, and if you see only one slice of cake.... leave it... it's mine!", "author": "Brooklyn I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "I often have meetings with people who come from out of town and I am constantly recommending this place...they have a great variety. The prices are all over the place, some things are cheap and some things are over-priced, but all in all, its on the cheaper side for the area (as opposed to soup, salad or sandwich from hale and hearty)\nI get my coffee there every day, I really like being able to make it myself - just the way I like it!\nAnd no matter what I get - I am always able to get in and out quickly which is great!", "author": "Debra L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-09", "description": "This place is your standard fairly-gross commissary deli food, with the added bonus that it is overpriced. When you're offering extra cheese on the vegetarian chili for $1, and it turns out to be a few pinches of the pre-frozen, tiny-squiggle, as-an-anti-caking-agent variety, you're insulting everyone. An unlabeled cookie turned out to be $3. I guess when you're near the court you don't need repeat business.", "author": "Bret H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-25", "description": "It's close to work and if the weather is bad, I may come here for the soups or salads, but I would recommend Lassen and Hennings which is a bit further but better quality and price.", "author": "Cynthia M."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Court Order", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "52 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/w0NxRwY_W3wNEPUnmtypHw/ls.jpg", "@type": "Restaurant", "telephone": "+17189359300"}