{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "We made a reservation here on a Saturday for our after wedding brunch and brought in 30 people with us. They couldn't have been more accommodating! We took up at least half the restaurant, and everyone hustled to take care of the group. The food is delicious, and the prices are reasonable. We are so appreciative!", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "My hubby \u0026 I came here the other night to bring in my birthday with a few drinks. The bartender was super friendly \u0026 the drinks were great! My type of place great service \u0026 good drinks.", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-19", "description": "This place would have gotten 4 stars for the food at least, but the servers/bartenders were clueless and unprofessional (despite being friendly).", "author": "S I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Been a couple times. The fireplace is key in the winter months and it's real wood burning! Food is consistently great. Burgers, wings, and the truffle fries..its hard to not finish them everytime. Drinks are beautiful and floral. The staff treats you like a friend in their house--very refreshing. Super welcoming and enjoyable.", "author": "Mike Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Lovely little place on Brooklyn. So quaint. We were seated right in front of the fireplace, cozy on a wet December night. Food was great. Everyone love the truffle fries. There were five of us, each had a different item. I especially like my Persian burger. My daughterinlaw appreciated recommendations from our waitress on foods that fit into her restricted diet. Great group of people, warm and friendly. Felt like we were regulars.", "author": "Dawn F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I found out about this place from my friend and hair stylist Gary from ARCO Salon around the corner and was actually getting my hair done there when i decided to order from this place. Result: I'm honestly so impressed with their burger quality for their price lol.\n\nI dont usually leave reviews but this place is pretty darn good haha. The customer service couldve been better, but food service can understandably be annoying so I feel that. We all have bad days, right?\n\nRegardless, get their burgers. Unreal. Full of flavor, not even remotely dry, very well prepared, fantastic choice of bun LOL. This is probably going to be my new burger spot every time I come to ARCO after a cut!", "author": "Allison A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-27", "description": "Service:  This was fine.  The kitchen was being held up by a ten top, but it was unclear if that impacted the food or the food was just not good.\n\nFood:  I ordered the spinach omelette which came with French fries and a green salad.  The omelette was so over cooked that it was crunchy.  The salad was average; however I was too hungry to send it back.  Husband ordered a cheeseburger medium which arrived medium well to well.  He declined to send it back for the same reasons.\n\nOverall I would not recommend this place.  The patrons enjoying themselves the most were drinking mimosas at brunch.  Perhaps this place works better as a bar.", "author": "Lea O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "Incredible service and the food was amazing! We came with a group of 6 and everything we had was excellent. The atmosphere was wonderfully cozy and we were lucky enough to sit by the fire in December. I recommend having a reservation on Saturday night and come to spend an evening with friends and not rush.", "author": "Brad F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "Beautiful ambiance and great food! Glad we ended up here for dinner! Friendly staff. Would recommend!", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "The $20 brunch literally cannot be beaten. I wish they had a few more options on their menu that were included in the deal without an additional markup, but I had a nice time and loved the Persian omelette.", "author": "Carine A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "This place needs to be on every \"best of Brooklyn\" list if only for the gracious service. The bartenders and waitress were all great! We just popped in for a round but there were regulars there who obviously returned for the warm rapport and conversation.\n\nPete had a negroni and I had a glass of wine. We shared truffle fries and I asked the girl to bring mayo with the fries (only God can judge me).  The fries were really truffle-y! The wine was great but I should have gotten beer; they have many great beers.\n\nThe spot is small and they only have one toilet. It's a good first date spot or a spot to have a drink at the bar alone. This is a really solid awesome place and I will definitely be back soon.", "author": "Gigi A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "This was quite possibly the worst customer service experience of my life of going to restaurants. There were 5 of us and seemingly 6 people in the place that worked there (mostly owners or managers?). Their point of sale was having trouble and our server very grudgingly took our drink order. No one that appeared to work there was helping the bartender or server and there were not many guests there. The bartender arrives with half our drinks after waiting 20 minutes saying \"the system is all fucked up that's why there is a delay.\" My friend then asked for glass and he almost had a meltdown saying I'M JUST TRYING TO HELP YOU. \n\nWe then decided with the mood of the staff and the chaos in the FOH for such a small place that we would not chance it with the food. I don't know what those managers or owners were doing but the bartender and sever seemed ready to walk out. We were there for an HOUR between trying to order one drink and trying to pay which we had decided 10 minutes in. Just crazy.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Great neighborhood spot!  We produce a monthly show at a nearby venue and we always come here afterwards with the cast and crew. Shoutout to Jahan, Henry, and Bianca!", "author": "Todd K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "My second time here I brought friends from Staten Island. After a round of drinks and an app either a cockroach or waterbug dropped from the ceiling (?) And was on my friend's back. We quietly exited and the staff let us go without having to pay the bill. When we told the bar next door about our experience he said he's not surprised...", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "I love this place! The music, the black and white movies, the greenery is perfect! The drinks are amazing. My favorite drink is the lolita. The burger and the flatbreads were delicious!!", "author": "Sarbani D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Decided to patron after church for brunch. Expected a greater sense of warmth from the sever because there were not many customers. Unfortunately, service was lack luster, however, I had higher expectations for the food. Once my meal arrived, I was immediately disappointed in the bacon which was over-cooked to a point it crumbled like powder once I broke it in half. To make matters worse, there was hair in the food but I kept that to myself. The highlight was the ants cooked into the pancakes...gross!! I expected at least the server would comp the entire meal but she only offered to remove the pancakes from the bill. Horrible!! Never dining here again! I'm forced to give at least one star, I want to give none.", "author": "Janice W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Food is flavorful and well seasoned. Better than food I've had at high end restaurants. The truffled mashed potatoes are amazing. Space is cozy (smallish) but well decorated, Brooklyn trendy. \n\nThere was only one waitress working on a Saturday evening. She was great - very efficient and brought us food quickly - but I felt guilty asking for anything, she seemed overburdened. But maybe I'm projecting.\n\nRestaurant is kid friendly, despite the Yelp business info. I brought my kid and saw other families with babies and school-age children.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Great vibe, great atmosphere, and fantastic bartenders (especially Henry!!)! Get the wings ;)", "author": "Caitlin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-21", "description": "Terrible service. The place wasn't that busy but we still waited about 45 minutes for our appetizer to arrive and then another hour for our entrees. The only time we ever got service or had our food brought to our table was when I waved my arms to get the waiter's attention. He never checked in with us or refilled our water, plus my entree was cold and the noodles in the soup were soggy because it had been waiting around to get brought to our table for so long. This is only two stars because the mezze was delicious and pita plentiful but I would not recommend this restaurant otherwise.", "author": "Gabi O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "The crack soup is so insanely good. Get it with the spicy broth, noodles, and beef. Great ambience with fun music and a relaxing vibe.", "author": "Zach A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}