{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "Everything was delightful. Perfect atmosphere, friendly staff, combined with delicious melds of flavors! Bravo Bijan!\n\nI had the bijan cocktail, the shiraz salad, and the pear arugula flatbread.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "This place is AMAZEBALLS!  The decor is simple yet trendy!  And the cherry on top is Henry!  Hes very attentive and AMAZEBALLS!  The food is great and the drinks are strong! It's a must visit if you're in Brooklyn", "author": "Nerisa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-08", "description": "Came here Saturday afternoon for brunch. I asked the waitress for a recommendation between two choices and she was a bit snarky about my question. The coffee and food took forever to arrive and the burger I ordered, and the Bloody Mary, were only ok. Good coffee though. I have no idea about their dinners but the food just felt lacklustre. On top of that, when we asked for the bill the waitress just sat and talked to a friend while holding the check in her hand. \n\nAnd while I won't hold it against them because it's rampant in brooklyn, I'm a bit confused as to how we weren't informed at all by signage or staff that it was cash only until we paid. Not cool.", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "I came here for brunch on Sunday and was extremely disappointed by the service. They ran out of cups, so we had to wait over a half hour for our coffee and cocktails. The waitress finally brought coffee, but still did not have enough cups for everyone. The restaurant was not super packed so I can't understand why there were no glasses! The waitstaff was pretty clueless about the food--the one guy couldn't remember which burger was medium rare and which was medium, and didn't offer to check with the chefs to figure it out. They forgot toast for one meal and we had to ask repeatedly to get it. We also asked for ketchup three times and never got it. The place looked nice, and not too crowded, so I have no idea why the service was so bad! \n\nI ordered the chicken salad sandwich and I liked it. Ny friends got burgers and enoyed them, though they were surprisingly small. We all got the bloody Mary cocktails and they were good. The brunch special is $15 for a entree, coffee and a cocktail, which is a good deal! Unfortunately the service was so terrible that I wouldn't recommend the place.", "author": "Marisa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "I came in here on a Friday night with a date. Wonderful ambiance, with small candles to give a rustic, artsy vibe that would be great for a trendy first date. The waitress/bartender wasn't the warmest person at all. I feel that service takes a major hit but the place itself is not bad. Be careful and buyer beware, the kitchen can close well before 1 even though they're open until 4, the last night I came tgey closed at 2.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "I love Bijan's! I mean who can resist a happy hour special that includes two-for-one medicinal cocktails!? Yes, please!", "author": "Ana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Awesome spot for a quick bite and great drinks... Come by and ask for HENRY! He has the most beautiful blue eyes, you can't miss him!", "author": "Aimee A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Everything about this jewel of a restaurant is AMAZING! The decor is beautiful with artwork. Our waitress was very attentive to us. The wings are to die for! They were literally finger licking good with some fresh sliced cucumbers. We had the salmon with green beans and scrumptious mashed potatoes. I was already impressed with plans to return when the owners wife suggested the tiramisu. I'm not a huge dessert person so I took a nibble because I didn't want to be rude. Heavenly! It melted...like really MELTED in my mouth! I plan to return for brunch (only $15!!!!!) and Tuesday evening for open mic. This is definitely on my favorite list!", "author": "Shelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Tucked into an unassuming store front right of Atlantic Avenue is one of the cooler bar restaurants of Boerum Hill.  I have mostly come here for happy hour and lunch.  All the sandwiches I have had are delicious and fresh.\n\nThe cocktails I have had a are expertly mixed, showing off the mixology skills of the bartenders.  The service is prompt and friendly, the prices are reasonable.\n\nThis place is a must try for lunch, dinner or happy hour.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-07", "description": "Pretty solid spot tucked away in BK. Service is really friendly. Decent beer selection. The flatbreads were really good, as were the fries. Steak was not cooked right and the cocktails were meh. I'd recommend Bijan's if you're in the mood for a low key night.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "The liquor they have on shelf is a bit scattered, but their cocktails are delicious. A but medicinal, but I do enjoy that.\n\nThe food was amazing! I wanted to order the fish, but they were out so had the chicken. Lime sumac amazingness. Ordering chicken at great places can surprise you", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "My friends and I went here to celebrate my friend for passing her NCLEX exam. It was our first time there and we had an amazing experience! The decor and atmosphere is so beautiful and warm. The food was fresh and delicious. The service was superb! If you looking for a place to have a great dinner and amazing drinks, Bijan is the place to go! My friends and I will definitely be going back!", "author": "Tashshana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "One of my favorite neighborhood spots. Great atmosphere and a friendly staff. Henry is my favorite bartender he's always quick with a joke and very attentive. Good food, A charming atmosphere and a friendly staff with a lot of personality make this spot a gem in the neighborhood.", "author": "Darlene W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "This is a charming local bar restaurant with good food. Their chicken wings are a must get and decent wines.flatbreads were also good.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Tonight was chilly and very windy with driving rain. I had planned to meet up with a date at a spot up the street from Bijan's, but when I got there it was really loud and not at all the atmosphere I had heard it was. When she arrived we decided to bail on the first spot and went down Hoyt St. and saw Bijan's and it looked pretty cozy so we stopped in. There were seats at the bar, a really nice fireplace, old Charlie Chaplin movie on a big screen, music at just the right volume, a lively but relaxed crowd, and good drinks. It was perfect and we had a really nice time. Our bartender was very attentive and nice. I didn't get her name but we appreciated her service. Didn't try the food this time but will definitely be back to check that out.", "author": "adrian c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Buyer Beware!!!!\nI have never written a negative Yelp review but there is a first for everything and Bijan worked hard to earn this one star rating!!  There were 4 in our party we ordered 2 apps, 3 med burgers, and a kabob.  After a 20 minute wait 2 of the burgers arrived - we asked about the apps - the waitress offered to take the burgers back and go get the apps.  We opted to keep our meal only to find the cheese was wrong on one burger and both were \"very well\" done.   The 3rd burger showed up and was good - cooked to order. Meanwhile the apps showed up. We sent the burgers back only to find that they were out of patties.  We declined ordering anything else. The fourth order (kabob) never showed!   Out of four orders  one customer received their meal correctly. After sharing our disgust with the management we landed up just paying for the drinks. Not a great compensation when you consider only one meal was eaten!!!", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Cute neighborhood spot with great food and amazing drinks!! Love this place. The spices margs and mezcal Bijan are the best cocktails, and the truffle fries are a must have.", "author": "May Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Oh Bijan's how I love thee....\n\nFirst off, dear Iranians, please don't be sad, this is not Persian food. The food is ridiculously good, but don't show up expecting fesenjoon and kabab. It's more Persian fusion- which isn't a thing, but keep an open mind.\n\nBijan's is a great mix of locals and newbies. The food is amazing, the staff is prone to giving hugs and remembering details about your life. My favorite thing is that if you walk in by yourself the bartender will almost always make sure to introduce you to the person next to you.\n\nOr maybe my favorite thing is the \"Persian\" Chicken wings....or the hanger steak frites...or is it truffle fries?\n\nOr maybe my favorite thing is the Persian kiss...or maybe Henry's Special Cucumber Concotion....or maybe...\n\nOr maybe its Kadri or Henry or Alex or Ross or the Ericas ....\n\nI guess its all my favorite. The kind of place you can have a low key birthday party, a glass of wine or a nice date at.", "author": "Asal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Grand Army wasn't opening until 5, so my friends and I decided to take our casual meeting here. A very very cute spot with a great happy hour special. (That may be my mission this summer, finding the best happy hour spots). I would recommend the Jalapeno Margarita- it had the perfect kick. Also, the roasted eggplant complemented the drinks nicely.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Their sumac lime and rosemary chicken is amazing!  Make sure to ask for the dinner specials as well--their Persian stews are authentic and delicious.  I've been here for brunch too and for $17 you can get an entree, coffee or tea, and a cocktail, great deal!", "author": "Julia D."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}