{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "Made a reservation here on a Saturday.  Bijan's food is amazing I had the salad with salmon and my friend had the lamb burger - soo good!  Service was excellent.  Was there about a year ago and the place didn't have too much traffic, but now it is as you'd expect a good restaurant to be, but still with the same charm, great service, and attention to food quality.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-11", "description": "Came here for my friend's birthday. It was a cute intimate restaurant with a black and white movie playing in the background which I thought was pretty good. I ordered the hanger steak with truffle fries. I absolutely loves the fries but it could've used a little more truffle. The hanger steak was good but it wasn't extraordinary. The price was pretty worth it for what I had. It was $24 for my dish. My friends also ordered the steak and agreed it was 3 stars. The chicken wings were pretty good. They had an Asian zing to it. The fried calamari looked okay, I didn't get to have any. The Prosecco drink that I had was really good! I forgot what it had in it but that was really good. Our waitress was extremely pleasant and accommodating to us needing more chairs and accommodating the bill situation with a large group of people.", "author": "Lily F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "The food here is seriously good. I come here for brunch every now and then, and have never been disappointed. It's cash only, which the waitstaff repeatedly remind you about. They don't have an ATM, though so take out cash from the bank or maybe the burrito place across the street before you come here. The only negative thing about Bijan's would be the servers. Every time I'm here, they give off such a holier-than-thou attitude. Relax people, it's just brunch. You're not saving the world.", "author": "Amiee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I came in for a weekday dinner because I just wanted to eat something yummy. The interior is super cozy and intimate, but I sat at the bar. Service was friendly and quick. I ordered the Persian kiss cocktail and smoked eggplant to start. The smoked eggplant dip was just ok, nothing extraordinary.\n\nYou must try the Rosemary Lime Sumac Chicken. It was so tasty from start to finish. The chicken was cooked perfectly with all the spice. I also ordered the Rose Bomb cocktail and it was ok.\n\nBottom line is come for the entrees. This is not a good spot for craft cocktails.\n\nAlso kudos for the bartender for refusing to serve a super drunk customer. He threw a tantrum and stormed off when he realized that no alcohol would be served to him.", "author": "Jingwen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "Bijan's is a solid Boerum Hill dinner spot - the food is really good; my only gripe are the drinks, which are priced as A+, but really are just a B / B+ at best. On a more positive note, the vibe and ambiance of the place is great. They usually have a classic movie projecting against the wall - it's generally on with no volume, so it's more of a decor piece... but when they're playing an oldie you know, it puts a smile on your face. They've been around for a while, so they obviously know what they're doing - if they can up their cocktail game, this place is deserving of five stars.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Wow. I have never had an experience quite like my time here at Bijan's. Husband and I passed by this beautiful place a few days ago and came back for brunch Sunday afternoon. For starters the interior is beautiful. Looks like you're in someone's home, not at a restaurant. The plants, all real, are dispersed throughout the space. The fireplace (also real!) was just what we needed to warm up. Our waitress was very courteous and service was friendly and quick- my husband and I both ended up doing the brunch special-$20 for a dish and a drink of choice. He got the steak and I got the breakfast pizza. Everything was amazing. Food was so delicious. We cannot wait to go back and try more things. \nWhat made this experience extraordinary, however, was how friendly and sweet the owner, Sepiday (not sure how to spell her name). Her aura is just amazing. Truly a graceful and elegant woman. Thank you for making this a one of a kind brunch date! We enjoyed everything and can't wait to go back.", "author": "Milka A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "Good food, mediocre service. Waiter was slow to take orders and took a long time to get beers and check. \n\nNice atmosphere though with fireplace.", "author": "Julian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Great staff! Very friendly! Menu is unique and delicious! This place has a rustic charm and warmth,  and is found just off the \"main drag\", Atlantic Avenue in the heart of Boerum Hill/Downtown Brooklyn, located on the north east side of Hoyt. Reasonably priced drinks n such, and nice happy hour! I will definitely be back!!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-08", "description": "We were looking forward to trying something new for my husband and myself that was close to home. Was immediately charmed by the Bohemian / hipster / funky vibe of the place. Charlie Chaplin videos on a large-screen, strings of Christmas lights, mismatched furniture, plus a cozy fireplace.\n\nOnce seated with menus we waited about 15 minutes to get waters and place an initial beverage order, which did arrive promptly after ordering. But we had to remind the waitress of the olives we ordered to go with the cocktails which took 20 minutes after the drinks came.\n\nThe food when it arrived was certainly palatable. My husband had a beef stew that came with a generous portion of rice, he ate the thing within minutes. I ordered the rosemary chicken with garlic mashed potatoes. Rather dry, but tasty nonetheless.\n\nAnd then?..... nothing.\n\nI eat rather slowly, and was hoping to order a second Frisky Whiskey. But the waitress never returned to ask how things were, refill the now long empty water glasses, or ask if we wanted seconds on drinks. She continued to talk to friends at the corner of the bar and occasionally tend to other tables.\n\nMy husband and I dine out often, and enjoy engaging the wait staff, being slightly apologetic about my husband's gluten-free needs. We always say \"thank you, please, would you mind, hopefully it's not too much of a problem\" and so on. So I find it odd that we were suddenly ignored.\n\nOn a side note, and I noticed other reviewers mentioning the front door and loud music issue. As a patron came in, the front door got stuck causing an immediate draft, this was the second time it happened (to other patrons). Over the loud music, I said \"Could you close the door please?\". Perhaps it sounded terse. But the patron apologized stood up and closed the door. When she returned to her table our waitress bent down and said something to her. They both now glared over at us, the patron shook her head, and the waitress continued to glare.\n\nI finally said to both of them \"Is there a problem?\" The patron responded \"It''s just your tone.\".  I guess I should apologize for being inconsiderate to someone who was inconsiderate in a loud, nearly empty restaurant where our table had been ignored for the last half an hour. No need for the waitress to intervene and perhaps mention that the door is an issue and diffuse the situation. She had a conversation to get back to at the bar with her friends. \n\nNeedless to say, by this point my dinner was getting cold, we were obviously not going to get any service, drinks or water, and I actually wanted to just get up and run. For what started out to be so potentially pleasant, ended up being a really awful experience.", "author": "Kurt W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Funky cool eclectic spot with delicious food - middle eastern inspired flavors and the cocktails are on point.", "author": "Arlene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "The brunch special is amazing! Roughly $20 for a drink, tea, and GOOD food! I got the Bijan Burger and subbed the fries for a salad. Both perfectly seasoned!", "author": "Alexandria B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-06", "description": "Used to be the coolest place in the neighborhood. Now it's obnoxious 20-something waiters who wouldn't know customer service if it bit them in the ass. The rudest muthafuckas I've had to deal with in a long time. Never going back.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "\"Hi I'm here to meet...\". That's what I say every time I walk into Bijan. \"She'll be in soon. Have a seat over at that table. That's where she sits.\" Is what they say. \nNot many of us have a place. Bijan is her's. So I can't honestly give a bad review Even if I wanted to. \nAnd I honestly don't want to. Nor will I. Not a ton of vegan options but they have them And I didn't come here to eat anyway. I came for the lovely ambiance. And those amazing truffle fries. The meat eaters love their burger and chicken salad and lemme tell y'all...you just can't eat chicken salad anywhere.\nI'm glad I have a friend who's a regular but I can definitely see myself here without her. But I of course wouldn't dare. \nOh and get the Bijan signature cocktail. I've been told it's out of this world.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Great place for after work happy hour.\n\nHappy hour special $2off wines, $7 for cocktails and $5 beer. \nFood, the menu seems to include a bit of everything. We had the margarita and the spicy shrimps flat breads. Tasted pretty good, with plenty of sauce and very thin, but it didn't feel fresh out of the oven, the cheese was not melted. Probably the waitress too long to bring it to the table, as the food took a long to come out. It did came out all together. Fries were good, thinly cut, i didn't care for the truffle ones. Cheese plate was ok. \nDrinks: banji and the prosecco with pomegranate juice were delicious. Service was ok. I'll definitely want to come back for the drinks and try their burgers.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-15", "description": "Bijan's was recommended to me by a friend who said that the dinner menu was delicious! I wasn't able to visit for dinner but I did try the brunch menu. For $20, you can get an entree, a drink, and coffee. I had the Persian Chicken Salad Sandwich w/ herb fries. It was very tasty! I also got to try a little bit of the steak (from the steak and eggs) and it was perfectly cooked! My lemonade was watered down to the point where it just tasted like water with lemon and my coffee was cold. I did not get my drinks until I was nearly done with my meal, so the service could be better. The atmosphere was very warm and cozy. I enjoyed the wood burning fireplace and the colorful earthy decor. I'm not in a rush to go back, but I would return to try out their dinner menu.", "author": "Kiara N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-31", "description": "Nothing bad, but nothing special. The interior is cute but the menu could be better laid out (and worded more clearly) and the food wasn't better than anything I could make at home. A nice location and base, just a lot to work on to make it worth paying for. Easily skippable.", "author": "Jostyn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "I liked this little place. It was tucked away, relatively quiet (I say that, aware that it not only has communal tables and TVs), and a pretty interesting menu. \n\nIf you follow me on Yelp, you know I travel a lot for work and so I eat out sola a lot. I judge restaurants on how they treat me as a solitary diner. This place was respectful and both paid attention to me, and left me alone -- kind of the perfect balance. I will say they didn't seem very keen on waiting on me at first (probably assuming I would order like one thing and then go). But once they realized I was there to eat, drink, and enjoy, I was treated better.", "author": "Cathy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "Really disappointed with the majority of the food that came out of here. Specifically, the cheese plate. It seemed like an afterthought to add to the menu and was covered in raisins? It was bizarre and so disappointing.\n\nCocktails were good, but I was under the I presiding there was happy hour until 7- certainly didn't get charged happy hour prices. \n\nWaitstaff was pleasant so there's that.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Hidden gem in downtown Brooklyn. Great design, calm, and with excellent food. Every dish we had was delicious. They also have a nice cocktail bar. \n\nRecommend the pear and goat cheese flat bread, and the mousse desert.", "author": "Benjamin J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "You already know when a server tells you it'll take 20 mins to create a certain dish, it's gon be DELICIOUS. And let me tell you how right he was! After a whole day of studying nonstop I needed to take a break and grab food. It was already 9:30pm and most restaurants close by 10pm, but not BIJANS! It was a Thursday and they were open until 4AM! Late night owls this is your spot. Complete with a big screen that played the old cinematic soundless films, dim lit candles and a \"foresty vibe\" I felt relaxed and right at home. The food was another highlight, I ordered the rosemary lime sumac chicken w/ truffle mash and haricot verdes (fancy string beans?), as well as the bijan burger w/ herb fries and blue cheese. Remember the 20 min dish? That was the sumac chicken and it was so tender and juicy I finished it in half the time it took to make it. The truffle mash tasted healthy, but still VERY TASTY. I was so satisfied. My boyfriend throughly enjoyed his burger (I suggest medium cooked) as well and the herb fries were a nice touch. Even though it was very late, the server was still attentive and poured us water constantly. I think I found myself a new late night spot!", "author": "Michelle S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}