{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "This place feels much more like a bar than a restaurant. BUT, over the years it has experienced many changes in management. Finally, it now offers some really great food. The Persian Spiced Chicken Wings are absolutely worth the trip. I know this sounds a bit crazy, but they are always prepared to perfection and are memorable (remember, they are wings!) and unusual. Sometimes the staff can be truly great, kind, and wonderfully friendly. It is a great place to stop off for a well made cocktail and some wings.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "I came here for brunch this past Sunday, the food was delicious. They have a great  $15 fixe price menu which included a cocktail coffee or tea I had the smoked salmon salad sandwich, it was amazing my friend had a stack of buttermilk blueberry pancakes simple delecious food , the bijan bee is my favourite cocktail, it was a belini with a zing .. Jut a great all around brunch service with a smile and great music", "author": "Isabelle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "Bad service, they told us no dinner till 5 but were serving dinner to other guests. We decided to go but an automatic 25 % gratuity for poor service makes it a one star experience", "author": "Freek V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "I went here for dinner. The drink I got was good, though maybe a couple dollars overpriced. I enjoyed my entree, a goat cheese arugula pizza. Unfortunately my dinner partner really wasn't impressed by her burger and I have to admit her fries (I stole one) were pretty bland.  It's hard to mess up fries.  The service was friendly but quite slow, and it took a long time to get our food. Overall, it was ok and I might come back, but wouldn't go out of my way to eat here again. I did like the decor and general atmosphere though - it's a cute place.", "author": "L W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Great neighbourhood bar where you immediately feel like a local. Definitely worth a visit if you are in the area although be careful - you may not want to leave!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "Came here in July for my birthday with four of my friends. We did Saturday brunch. The food was great. The wings, steak and burger, all good. The drinks were even better. Unique and strong. They even set us up with a round of pickle back shots:) The vibe was very chill, not crowded. Perfect way to start a weekend.", "author": "Tiffini M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "For my 800th review (wow, I really have too much time on my hands) let me review a spot near my work that has some of the best wings I have had in a while! I ordered their Persian Spiced Chicken Wings and it came with a creamy dipping sauce that went perfectly. The wings were crispy and a nice size and full of flavor that you almost didn't need the sauce. I am a sauce fiend tho and I like all things dipping so I gobbled that up as well. My friend had the chopped salad, which he did not enjoy, but for wings, this is the place to be! Cute ambiance too, definitely casual date night worthy and friendly service. Definitely recommend!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "The place used to be so dodgy (which had its own charm, I must confess), that it was the better version of Cokie's in W'burg, namely in terms of scoring that implied substance.\n\nBut what a transformation! For the better, for sure. Smart, creative drinks and even smarter and more creative bartenders. I like the organic, week-by-week evolution of the place as well. Although I will lament the day food is introduced, because I will no longer be able to bring in the doggie! He likes Bijan's too.", "author": "Niall B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "This spot is a rare GEM.  I went here for Happy Hour and Dinner with my friend on a Thursday night.  The drinks were well made by the awesome bartender, not watered down at all.  He smiled and even sparked up a conversation with me after only me being their a minute; I wish I would have gotten his name.  Our waitress was Jaimee and she was by far very personable, knowledgeable about the food and was able to handle the growing dinner crowd without a blink of an eye.  She really made the night more enjoyable because she was attentive.  Now onto the food; the basil shrimp and spaghetti squash was delectable, the wings had just the right amount of sauce both appetizers were portioned to share.  The lamb burger was well seasoned and overall delish!!", "author": "Jenadiah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "I have to question what's going on with Yelp and this place. One of the most disappointing experiences to date, particularly since I was looking forward to trying Bijan's after seeing the great reviews. Definitely not going back. I don't typically write reviews on Yelp since I figure a place will get what it deserves over time, but the fact that this place gets such good reviews irritated me enough to draft post. The food here is acceptable at best, but truly not worth the cost. That's really saying  something, as the menu is actually pretty reasonably priced. The drinks were close to tasteless. If you're going with experimental, Bijan, you should do some more experimenting before serving to the general public. However, the staff is really what made the dining experience unforgettable. The restaurant was mostly empty when we found our way in, and yet it seemed as though we didn't exist. The bartender and waitress seemed more interested in chatting with friends, hanging out at the bar, snacking on outside food and checking their cell phones than doing their jobs.  I can't imagine how awful the service would be if they had more than five customers at any one time.  With so many good options in the neighborhood - I definitely recommend eating elsewhere.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-05", "description": "The Staff is lovely. Great cocktails. nice ambiance. The Food was OK, not great. I don't know honeslty if I would ever come back again. Don't try the salmon. It was quite boring and unimpressive.", "author": "Rizwan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "My wife and I had heard of Bijan's before but never had the chance to eat there till last week. The interior is really warm and friendly where we sat for an hour or two ordering drinks before looking at the menu. One of the waitresses recommended several appetizers which we absolutely loved. My wife is vegetarian and I'm not but the menu served us both. For the main course I had the chicken and my wife ordered the thin pizza. I believe they make their own bread! We both enjoyed the service and highly recommend it to our friends. It's a relax environment to hang out with friends and enjoying each other's company with many tasty options on the menu. Since I live near by, I think I'd make this a regular place to visit.", "author": "Zee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "I LOVE this spot!  It's become my new favorite little go-to spot in my neighborhood -- kinda thanks to Yelp. I found it cuz I was looking for something away from the standard Smith St stretch ... and it's SO cute and SO charming.  The music's awesome, the food's awesome, the people who work there are awesome.... the ambiance is awesome.\n\nWell to be fair, I've only had the lamb burger -- but there's no reason to stray away from that!  And I've mostly stuck to one drink -- something like Pump It Up or something.  At first it was too sweet, but once I told them to keep the spicy and lose the sweet, it was perfect -- spicy goodness.\n\nThe fireplace made it perfect for the winter...  It's too bad there's no outdoor space, cuz then I could see my whole summer there as well!", "author": "S G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Definitely one of my favorite spots in Brooklyn for brunch and dinner. The decor is also refreshing and the staff very friendly. Their wings are the best I have had in a very long time. All around great place that keeps me coming back.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Good atmosphere, friendly staff and an eclectic mix of people.  Great place to have a few drinks with some interesting nibbles.", "author": "Oliver T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Wonderful vibe here. Unbelievably yummy wings. Try the Persian beef kebob - we loved it. All the starters are tasty. They have excellent home made tiramisu.", "author": "M O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "i've now been three times -- twice for dinner, once for brunch -- and every visit was pretty good.  the food is quite tasty -- i especially like the flatbread with goat cheese, that's a favorite -- and the cocktails are also good.  i like dinner more than brunch, though -- i had the smoked salmon salad sandwich (try saying that five times fast) and it was good, but didn't blow me away.  however, the prices at brunch are a pretty good bargain: $15 for an entree (a few of the entrees have an additional $5 fee but most are covered), coffee or tea, and a breakfast cocktail.  the prices at dinner are also very reasonable, cocktails are $10 and the food is not only affordable but also easily shareable, so you can split a few plates and keep the cost down even more.\n\noverall, it's not an amazing dining experience but it's enjoyable, won't break the bank, and around the corner from where i live, so i'm sure i will be back again.  oh, and service can be spotty -- it was good at brunch today but the second time i was there for dinner, our waitress was difficult to flag down -- so i recommend being prepared to be patient, just in case.  admittedly, the service wasn't so bad that it's keeping me away, but i might try sitting at the bar next time -- that's what i did on my first visit and had great service from the bartender, so that's probably where i'll take my chances next time.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Oh my god! Went here for a drink and apps. The calamary apps was so good. The cocktail is so good...for refreshing. The music not to loud. Food is excelent. Service was great. I have a great bartender henry! He made a faboulos drink ever! Defenitely will be back!", "author": "Yohan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "The brunch here is very good with many food choices as well as great drink options. The staff are very accommodating. We had Rena and she was great!", "author": "Ray A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Came here on a Sunday night around 9:30. Food was great. Vibe was great. Music was stellar. Waitress and staff were exceedingly friendly and service was great. Will become a regular!", "author": "Carter H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}