{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "Bijan's you came and you gave me cheap drinks of my vacation from workee!  \n\nMy wife and I recently stumbled upon Bijan's while waiting to get into our friend's apartment where we were staying on our recent trip to Brooklyn.  We were tired and grumpy, having been locked out with all our luggage.  \n\nThe cure were half-price medicinal drinks, tasty appies and warm, friendly service.  The drinks were fantastic.  My wife had the one with cayenne pepper and I had the Gin drink.  Both were excellent.  We had the olives and eggplant walnut dip, which was the perfect pre-dinner snack.  I loved the decor, music and vibe - chill, cool, and relaxed. \n\nDefinitely recommend!", "author": "Eric T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Came for happy hour on a Tuesday. It was pretty empty, but a few more people came in later. Sat at the bar, which had hooks for purses and bags! Also, the happy hour special was 2 drinks from a certain cocktail menu for $10, only with the same person. So we had 4 drinks for $20, which wasn't bad. They're unusual cocktails, so be prepared to try something new. The bartender was really cool, so I would go back.", "author": "Rayelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Great appetizers and drinks! My husband loves their lamb burger and goat cheese and pear flatbread. Also, the wings and fries are amazing. Definitely a must have if you're in Brooklyn (although sometimes we drive from Queens!)", "author": "Rachana O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "This place is terrible.  The service is painfully slow.  Our order came out wrong, and the waitress did not handle it well.  The ambiance, decor, and menu are all lackluster.  If you're in the neighborhood, do yourself a favor and walk one more block to Mile End or across the street to Fast \u0026 Fresh Burrito.   The food and service at both are excellent, and even though Mile End often has a wait you will still get served faster than at Bijan's.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "My friend and I ended up at this bar/lounge after dinner and after doing a quick Google Map search, we walked over even though we passed this place twice.\n\nEveryone was seated at the bar whereas my friend and I decided to take up space at the communal table.  Their selection of beer is mostly organic beer along with some Belgian ales.\n\nMy friend opted for the Belgian Ale but I had to refrain from drinking that night because I had a cold and was on antibiotics.\n\nOverall, I liked the vibe of the place.  The crowd was definitely more in their late 20s - 30s so it was civilized.  There weren't people spilling drinks on me and we didn't have to shout over to be heard.\n\nI truly loved the music and whomever picked the playlist that night was AWESOME! A lot of the music was downtempo and surprisingly I owned a couple of their compilations.  I definitely heard some Nordic Lounge and gave me some sweet, sweet dreams that night.\n\nIt's chill and laid back and the designer definitely had some good taste.  There's a fireplace to the side with red candles lit inside to give it this nice ambience and along the far left situated against the windows is a modern, sleek  two seater couch.\n\nThere's some contemporary artwork that adorn the walls as well.\n\nI'd definitely come back for a few more drinks for the music, the ambience and of course their selection of beers were appetizing!", "author": "Neline S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "This is my favorite go-to spot in the neighborhood for happy hour or late night cocktails as well as a casual dinner.  The happy hour is fabulous with great wines as well as fantastic cocktails (2 for 1!).   And I know I can never go wrong with the sumac chicken or the double-cut pork chop (if that's available on special).\n\nI do have to give a special shout-out to my favorite bartender, Henry.  He made sure to reach out to me one of the first times I sat in the restaurant.  The second time I arrived, he remembered not only my ams, but the type of drink I liked.  He has a way of making people feel special, therefor making the bar/restaurant feel special.", "author": "Stefanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "This is a great place - I found it almost by accident as I was browsing Yelp reviews in the area, but once I stopped in for the first time (Persian chicken wings - you must try them!) I knew I'd come back.  And come back I did (wings again!), and again (cucumber salad!), and again (what WAS that cocktail that Larry mixed?), and again (pappardelle - oh my!), and again. Great staff, great atmosphere.\n\nCome for the food, stay for the drinks.  Or come for the drinks, stay for the food.  Either way, you should invite your friends, too.", "author": "Dave B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "This review is only for their Happy Hour.  2 for 1 cocktails!  Now, I'm not a fan of cocktails usually because they tend to be too sweet for my taste.  But their \"medicinal\" cocktails have a wide variety of options, including several non-sweet ones.  My standout was the pepperonici martini.  It's basically a dirty martini but with pepperonici juice instead!  My friend got a couple of sweet ones which she thoroughly enjoyed.  \n\nFoodwise, the wings were recommended and pretty tasty.  I love buffalo wings and tend to be hesitant to order other types, but the Persian wings had really great flavor.  I would probably order them again.  The heirloom tomato salad was really fresh, and we also enjoyed the yogurt/herb mezze with their flatbread.  \n\nStarted to get busy later on in the evening, but not too crowded even on a Friday night.  Definitely will be going there again after work for another Happy Hour.", "author": "Agnes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "Bijan is a work in progress, like this review was for the last two weeks. The kitchen was not opened yet, but the regulars and drinks are taking formation. A fireplace and a great elevated couch decorate the entranceway. Dee, this remodeled venue is just craving for more fun times and stories to be had.", "author": "Will C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-12", "description": "I stopped in here with my hubby for a drink before dinner. I'd been with friends many months ago and remembered a fun cocktail menu. I ordered a martini and he ordered an old fashioned. They were both terrible. The old fashioned was way too sweet and totally watered down. My gin martini had ice in it and way too much citrus. The bartenders were distracted and the service was poor. We won't be back.", "author": "Kate H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "We found this place charming, but were a little frustrated by the quality of what we were served. The much-vaunted \"medicinal\" cocktails seemed to have been replaced by \"craft\" cocktails with the same names, but without all the relevant herbs and entertaining health claims. (My Frisky Whiskey, for example, mentioned neither maca nor its alleged libido-enhancing qualities--just as well, probably--but did have some too-sweet ginger liqueur thrown into the mix). If the cucumber salad had pomegranate vinaigrette on it, it was undetectable, and the promised pomegranate in the salad itself  had been replaced with dried cranberries. My boyfriend's chicken breast was actually a chicken thigh, which was just as well because it was very dry and overcooked. My salmon was a bit overcooked as well. None of the little changes in our dishes was mentioned by the waitress before we received the food.\n\nThis probably sounds like a worse review than I intend it to be, though. The flavors and sauces in everything were good, but the execution was off. Looking around, we noticed that the mostly young crowd were eating mostly small plates. We're guessing/hoping that if we stay away from the entrees and stick with smaller dishes next time we'll probably be better off.", "author": "Frank E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "I think Bijan is hit or miss. I see the potential, but I didn't get the same experience as others. \n\nThe server, who did admit that she was new, was unable to answer many questions.\n\nThe Persian-spiced chicken wings (fried, sweet, sticky and spicy) were finger-licking good. The mashed potatoes (rustic) and haricots verts (delicious, but not enough) that came with the pistachio-crusted salmon (dry, didn't taste that fresh, under-seasoned and there was no \"crust\") were divine. The classic burger (1/2 short ribs and 1/2 ground chuck) came extremely overcooked for medium; it was dry and we just didn't like the taste. The home-cooked potato chips were good.\n\nOn the plus side, nothing was overly salted.\n\nThe space is thisbig, but extremely cute with a fireplace, chaise lounge and branches that serve as ceiling fixtures.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "awesome awesome awesome.  Have been waiting for this place to open up and the wait was totally worth it. My two fave things about Bijan's:  It's just a short walk from my place (I am very lazy) and Larry the bartender is amazing. He makes great cocktails and is hilarious.\nLike everyone else....I'm hoping it doesn't get TOO busy in here bc I already called dibs on my seat at the bar.  So gimme some room.\nFood is coming and other events like open mic nights.  Definitely worth checking out.", "author": "Monks C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "Hubby and I headed here for brunch after reading all the great reviews.\n\nThe vibe was mellow and comfortable. The menu was limited, but with enough variety. Unfortunately the burger was thin (think BK patty) and overcooked. The chicken salad sammy was nothing special. Salad greens weren't dressed; I felt like a rabbit eating grass.\n\nI like the feel of the place enough that I might try this place again - maybe it was just a meh kind of day.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Nice and cosy atmoshere, a few nice vegetarian dishes. Main reason I come back is because  of the fun and friendly Bartender (henry).", "author": "karoline H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "They have a good happy hour 2 for 1 drink special. I had the lamb burger which was really good.", "author": "Beth C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "The atmosphere is great laid back, cozy not at all uptight or stuffy, their specialty drinks are delicious and at happy hour which is Mon-Fri from 12-7 they are buy one get on free and well worth it, the food was very good I recommend the roasted beet salad with or without meat its delicious and comes with a fried goat cheese fritter. My issue was the service which is kind of a hit or miss. I was there on 3 occasions and had two bad experiences one where the bartender told my dinner companion that he should've given a 25% tip and the other where we were almost forgotten and it took very long for our order to even be taken on a day where it wasn't very busy. The owner is very nice.", "author": "Roni H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "Food was great but incredibly slow! We wait an hour for a burger and a sandwich! and the place was not full.", "author": "Marco C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-21", "description": "Order was screwed up, in addition the lamb burger ordered medium showed up rare and bloody (the server promptly fixed both of these problems). The beet salad was made with what tasted like canned beets, and the shrimp with spaghetti squash was exceedingly mediocre.  And then we saw a mouse...", "author": "Tracy U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "We had a large table and there was literally as minimal service as possible (20% gratuity rule abuse I presume). The table had empty glasses all around for the majority of the evening. The food is alright, nothing special with little variety. Stick to the bar.", "author": "Sam H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}