{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "The staff are always really friendly and welcoming and recognise you as a regular.  A very easy place to go for drinks with friends or on your own. Food is great, bit surprised by some of the negative reviews.  Always had great experience here.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "My lunch experience yesterday wasn't necessarily the best I've ever had but our server, Henry, did everything he could to make sure we were okay. He was obviously very busy and the restaurant was dealing with some sort of technical difficulties. The music kept going on and off. I ordered the Persian Chicken Salad Sandwich and my husband ordered the lamb burger. It definitely took longer than it should have to come out but Henry was so nice and he kept talking to us assuring us that it would be out soon. When it finally did make it to our table everything was delicious:). When we asked for our check we were informed that the computers were down so we had to pay cash which was a little annoying because I like to earn my rewards points but what can you do. Overall it was a bit of a long lunch but our server showed us that good customer service can make up for a lot! Thanks, we will definitely be back!", "author": "Jane N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-26", "description": "Been here a couple times for brunch as a walk in. Both times have been seated right away and its worth noting that they are kid friendly. They also have TVs and play the football games, which keeps my husband happy during sunday brunch. This place is really small and has an interesting ambiance. It sort of reminds me of a place you could find in the South. Sort of like a welcoming  tavern, cute, intimate, but just an atmosphere that is hard to pinpoint. There are some shared tables and a bar, and some private tables. The service has always been attentive and friendly. The drinks are very good, im a fan of the brunch cocktails. The food, I would say, has been for me, not great. I got the pancakes once because they looked so good on someone else's plate, and they were \"whatever\". Another time I got the Persian omlette, which was also just ok. Niether were bad, but definitely wouldn't say they were good either.  People I was with got the breakfast pizza/flatbread thing, and they seemed to really enjoy that. Sweet potatoe fries also good. Also, the $15 brunch deal is pretty good. You get a cocktail, a meal, and a coffee/tea. Note that the brunch is cash only... Overall, for brunch it is easy (no line, kid friendly, inexpensive...), but not a place that you cant wait to go back to.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-08", "description": "Showed up about 5-10 minutes before Sunday brunch started at 1130. No problem. Waited on the bench outside. 1130 rolled around and the staff didn't open. Nor did they bother to acknowledge us or pop out to say, \"Hey we're running a few minutes behind. It'll be another (fill in the blank) minutes.\" (They definitely saw us.) Got tired of waiting and it was cold so we did a loop around the block to see if anything else was open, but but nothing was, so we returned by 1145, at which point they had a sign out. Walked in and they were still setting up. We waited patiently for a few moments before one of the two staff said we should sit wherever. Chose a spot at the end of a long table where my suitcase would be out of the way--I was heading to JFK after breakfast--and the other staff member said, \"Oh not there. We have a big party coming.\" At that point we just walked out. The place has a bad, too-hip-to-bother-with-basic-manners vibe.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "It wasn't too promising of a start with three menu items not available despite not being particularly busy. But the martinis were tasty and the appetizers and food excellent as well. We had the Persian wings and a yogurt and cucumber dip for the flatbread. Then seafood stew to finish off. The chef apologized for how long it took, but we had not even noticed. The ambience is not fancy, but the food and drink and service well worth a visit.", "author": "William E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "This place is amazing, I loved it so much that  i have been back many times and brought lots of friends with me .We all love this place .Food is amazing .Sunday brunch is so reasonably priced, Love their pizza , The drinks are so tasty ,Staff very friendly. I am glad this place is in brooklyn and near me.", "author": "sheila d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "This is my new favorite neighborhood bar.  I was wondering what was going to open there, because the last place was loud and a little obnoxious, but this place is awesome: understated, welcoming, friendly.  I've met two bartenders, Larry and Meghan, and they both made fantastic off-the-menu drinks with little helpful guidance from me about what I wanted.  The fireplace also makes it a great spot for drinks on cold winter nights, and it's quiet enough to have a conversation with friends.", "author": "John R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-25", "description": "I used to really enjoy the place for the relaxed vibe and good cocktails. However I've had a few recent terrible experiences with the service that have led to me give a bad review. Most recently during an attempt to get brunch, we waited 45 min o get water after repeated requests (we eventually walked to the bar to get it ourselves), 1 hour for coffee (the waitress said there was none brewed an yet we saw people who had come I after us being served) and after 1.5 hrs of waiting for an omelet and repeatedly asking where our food was, the waitress finally checked and told us that whoops, the order was never put in. No apology. When I asked if she could rush the order (my friend had a flight) she said that no, she had to have the orders made for all the tables that came in after us, rather than rushing ours to rectify her mistake. It was really disappointing and added to he recent poor and slow service i had experienced. It's too bad because the food is decent and the cocktails are great but the service just makes it a no go.", "author": "emma b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Bijan is the best bar I have been to in Brooklyn so far. No joke. There is something downright mesmerizing about the vibe there- spectacular ambience, cocktails, and the most personable bartenders (Larry and Megan) that I have yet to encounter.", "author": "Marissa A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}