{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Came in this past Friday around 5 got a great table near the fireplace which was perfect since it was freezing outside. I have to say food was awesome both my BF and I enjoyed our meals. Pistachio encrusted salmon for me \u0026 Hanger steak for him both were great. This is such a cute little place we will definately be back, Service was good as well, btw they make a good Old fashion too!", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "One of my favorite restaurants in NYC. I've ordered delivery and sat down to order, both were still delicious.\nDefinitely get the steak frites. When those squishy fries fall into the flavorful juices seeping from your medium rare steak and soak up the seasoning and meaty goodness into their potato-y bodies like a sponge, you'll be glad your ordered that dish.\n\nThey are super good at brunch as well. $15 for an entree, tea/coffee and a cocktail!", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Great little neighborhood joint. We arrived to Chef's Table at Brooklyn Fare a bit early so they sent us over here for a pre-dinner adult beverage. The murals in the walls and wood beams give it some great character, and the staff was friendly. If I lived around here, this would be my go to hang out spot.", "author": "Dave F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "We were there for my friends birthday last night and it was great!! The entire staff was very friendly and helpful and were very attentive! The drinks were really good and moderately priced (I particularly enjoyed the Bijan-teani) and the pear and goat cheese flatbread was amazing. The place itself was very cozy and had a nice ambience, definitely recommend it for a chill night out.", "author": "Juanjo L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-15", "description": "Happy hour is from 12 - 7 so that is a big plus if you like a cold beer on lunch break. The interior is not much but the 5 dollar beer for most of the afternoon and into evening beats any negatives.", "author": "Kirill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-22", "description": "Mouthgasm: 1. Juicy (not dry) herbed lamb burger on a perfectly plump bun, 2. Persian wings (\"whoever made these LOVES their wings,\" I proclaimed), 3. yogurt meze with sumac, and 4. a strong mojito, all set to a rolling playlist of soul and funk classics. \n\nBartender Alex is a cool guy, and the regulars are mellow. Good place for the ladies (and gents) to come for an undisturbed solo drink or meal.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "A few days ago, Jahan wrote me and told me that I must have mistaken Bijan's for the new Mexican restaurant next door since they don't have Mexican food on the menu, and asked me to remove the review.\n\nThis is confusing because I didn't reference what we ate (pistachio crusted salmon and the lamb burger, which were both delicious as were the drinks, especially the ginger martini if memory serves).\n\nI am now downgrading to 1 star because of the terrible service and irrelevant response.  No matter the quality of the food, it shouldn't take that long to be helped in a city with so many great alternatives.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "The rudest server and bartender I've ever encountered. My first trip to Brooklyn and someone suggested this restaurant. The ambiance was awful as they were blaring loud screamy American rock music (at a Persian restaurant?) while we were ignored for a long time before we could order drinks. \n\nThe people I was with wanted to leave but we thought we'd give the food a chance. The really unpleasant interactions from the server and bartender and the bland food made us want to grab cheap pizza from next door and just walk around to explore the Brooklyn we had heard so much about.\n\nPs- this is not Persian food!!!", "author": "Mel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-23", "description": "The food is good, depending on what you order. The servings are small. They cannot handle crowds - they literally have a small kitchen with one burner....so if you see a lot of people in there....you may want to go elsewhere. I waited over an hour for food. Price point is fine, but don't bring me free dessert after a meal I waited so long for...I just want to go home!", "author": "marisa p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Amazing food and drinks! Get the earl grey martini :)", "author": "Zach F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "We were here with my family for brunch not long ago. The food was very tasty, we were satisfied with everything. Especially thanks for the great attentive service, even as it was so busy.. we will be back soon! :)", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "So I usually love bijans and go here regularly, however, yesterday I had the most disrespectful service I have ever experienced. The waiter was rude, inattentive, slow, and charged us improperly.\n\nI went with four friends for my birthday lunch and cocktails. The server was Jam. He seemed to make new rules about the menu that I have never had before: he wouldn't bring ketchup for each person that asked for it and charged us for extra blue cheese. Also, we were doing the buy one get one cocktail happy hour and when we ordered the second round he informed us that you had to order the exact same drink as the first round (again, I have been here many times and never witnessed this rule; all the classic drinks were the same price, and they weren't rung up individually so it shouldn't have been a problem. Also, he should have informed us of this rule before we ordered our first round). Additionally, the drinks were unstrained and the ingredients were so thick that you could not drink it through a straw.\n\nAlso, he was so slow and inattentive. Instead of coming to the table, we would have to flag him down or go to the bar. When we asked for water he kept bringing new glasses and not clearing the empty ones, so we eventually had over 20 cups on the table and no room to move. I had to go to the bar to ask him for the check, he then spent 20 minutes talking to a customer, and then my friend had to go up and ask for the check again (we were also not the only table to have to do this).\n\nWhen we got the check, we asked to split the bill. However, he decided to charge one person over $10 extra for gratuity. The menu says that there will be an automatic 20% gratuity added for parties of six or more. We had five people. We pointed this out to him, and he said with an attitude \"oh the menu is wrong, we should fix that. But, just so you know, 20% is standard.\" My friend said that we weren't that happy with the service. So Jam said: \"Then you shouldn't come back.\" \n\nWe were all taken aback by how rude and condescending he was. I have worked as a waitress before and would never say that to a customer.This is especially disheartening because I love Bijans, I enjoy talking with the other bartenders, and it's usually my go-to place when I have someone visiting. However, now I don't want to bring people there because I don't know if the experience will be great or terrible because of a nasty server.", "author": "Rebekka D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "The kind of place that used to be more common in the neighborhood. Good casual and not expensive.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Ever since the new year chimed in, I made a commitment to cook more at home and eat out less. Reasons for that are as follows:\n\nA) cost effectiveness \nB) for the health aspect of it\nC) I got fed up with a lot of mediocrities of food a lot of these restaurants are serving\n\nI am so happy I stumbled into Bijan. Usually I find fault in a lot of food and think to myself, \"how could I possibly make this better?\" \"Could I replicate this at home?\" I don't think I could for any of the food at Bijan. Everything was flavored perfectly, cooked perfectly and most importantly - what I found most impressive had clean flavored. My cousin and I went on a Friday night and it was packed. We ordered the wings that had this sauce that was so complex and delicious. It was a combination of buffalo wing sauce and some sort of Asian sweet and sour taste that was just out of this world. Their eggplant and garlic mezze was delightful but alas myself being a garlic feen would've added more garlic. My cousin then ordered the lamb burger. It was reminiscent to me of Turkish kofte in terms of flavor. Delicious! It is served with sweet potato fries that are seasoned deliciously and with parsley. Sweet potato fries came mandatory with the burger. Restaurants take notes! Sweet potato fries over regular fries any day. \n\nAn interesting star of our evening was the pickle-tini. A martini with your choice of either gin and vodka with cornichon pickles and pickle juice. It was so clean and deeeeelish. I ordered two. \n\nThe prices at this joint are great as well. I can't wait to try this place for brunch. It's been awhile since I was impressed by restaurant food. Thanks Peter D for the recommendation!", "author": "Gabi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "2015/ The food is good, it makes you want to eat more but those prices keep you in check lol. The waitress however not so good maybe it was her first day.", "author": "Kerr H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "I came here with some friends after a fun show at BAM.  The atmosphere is super low-key.  The semi-rustic and open space made it feel like I was sitting in someone's backyard or garden.  Our drinks were delicious and reasonably priced.  I ordered the Gingerita and loved it.  Everything is made with fresh ingredients so it wasn't overly sweet and didn't taste artificial.  I also stole some herb fries from my friend.  They were heavenly.  I have to admit, at first I was disappointed when she didn't order the truffle fries; however, that disappointment quickly changed to joy when I tasted the herb fries.!  Great spot for drinks and chilling with good friends.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "After an evening out of few of us girls went out for some food and we saw Bijan's on the Yelp map. We decided to try and to our suppose the food was absolutely amazing! It's days after and I'm feenin get for the chicken, truffled mash potatoes, and haricot verts! Everything was amazing. I will definitely return to this place! Please open and restaurant in the Hamptons!!!!", "author": "Cymone J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Great food, really nice people! Happy hour drinks are bomb! Order the frisky whiskey. The wings, steak sandwich and lamb burger is good! Nice small space downtown Brooklyn, very neighborhood chic!", "author": "London C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "The best chicken wings in the entire NYC hands down!!!\n\nIf you are looking for an excellent restaurant/lounge with a great atmosphere and amazing food this is it.  Cocktails are all delicious and strong. Appetizers are tasty, specially the smoked eggplant is my favorite. The burger is a must. They have started a special on Fridays with a special Persian dish that I really recommend. The owners have out their heart and soul into this place. The decor or very nice and service is superb.", "author": "Hamid A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "DON'T GET THE VEGGIE BURGER. Seriously. It's trash. My boyfriend and I went last night and we were thoroughly disappointed. The veggie burger was very wet and smooshed out as soon as you picked up the burger. It was like mashed potatoes on a bun. Only gave them two stars cuz the cucumber salad was half decent. Service was terrible too. Our waitress was more busy gossiping than being attentive to us. Won't be back.", "author": "Heather K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}