{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Stopped in to grab food and drinks with a friend. I ordered the Persian Spice wings based on all the reviews and they were amazing! I also tried the Olive mix meze it came with warm, soft pita bread and it was yummy! My friend had the wings and sweet potato fries from what I can tell she also enjoyed her meal. I will be back for dinner I'm dying to try the Rosemary chicken. \n\nOh try the Frisky Whisky it was good.", "author": "Carly J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "We had dinner here with some friends who had previously visited this place. We were amazed by nice ambiance, awesome food and decent service. We had calamari and yogurt with cucumber as appetisers. I guess the only disappointing part of visit was small calamari portion which tasted ok but it was nothing special. We also ordered jalapeño margarita and Persian kiss as drinks. Both great. For mains we had the salmon with pistachios and it was wonderful. It came to a bill of around $50 per person. Our friend had Ghormeh Sabzi which is a popular Iranian dish and as an Iranian I tasted it and can vouch for it as being authentic and amazing. Will definitely visit again", "author": "Kamran N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I LOVE this place.  Small and cozy. There's a fire place which I love the smell of.  Service was excellent- I can't remember our server's name but she was great.  Food was awesome. I had the pistachio crusted salmon and my brother had the steak frites.  Tiramisu was a spectacular end to the meal.", "author": "K T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "My boyfriend \u0026 I had a wonderful experience here!! We stopped in on a Friday night, Pretty Woman was playing on the projector, we received gorgeous (and delicious!) cocktails, and had the most welcoming \u0026 awesome bartender Mckayla! Highly recommend especially if she is working :)", "author": "Erika B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "I came to write a review about Bijan's and how it's a great place to go grab some great food and/or drinks in downtown Brooklyn . I come here pretty often with coworkers after our shift.  But I was a little shocked when I saw the negative review and photo about the bartender. I've seen him there on several different occasions and he's always been professional, friendly and made us some great drinks! Lol As well as all the other bartenders here. I understand Yelp is a platform for people to share opinions on whatever it is they're reviewing. However I feel that review was really harsh and then on top of it you put his picture? Sorry but that's pretty a-hole-ish! When you wrote this review did you ever think hmmm, what if this hurts his job? Well, with all that being said I recommend coming to this gem in downtown Brooklyn!", "author": "D R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-07", "description": "++++\n- I like the price fixe brunch menu \n(Although, they are very stringent on substitutions)\n\n++\n- Persian bee and pomengrante kiss were refreshing \n- Wife got the lamb burger, as the reviews noted, it was very good\n- Seasoned fries were a plus\n- I always dig free coffee refills\n- It was pretty empty on a Sunday around noon, I there was one other table being occupied\n\n+\n- Steak salad was nice and juicy \n(Just a personal opinion, but I would have liked something extra, like a cheese, tomato, or nut)\n\nTIP:\n- CASH ONLY!!!\n- the fries are not sweet potato fries, they are some seasoned regular fries", "author": "renje g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Came in for lunch. First, the water glasses tasted of soap. The waiter took a very long time taking our order, and when he finally did, he seemed to have forgotten half of what we ordered (which, given the abhorrent quality of the food, was a blessing in disguise).", "author": "Michael K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "We had the Persian spicy wings, the special appetizer for that day which was eggplant with a very yummy sauce, and the dish of the day which was a beef stew with rice. They were all just perfect. The owners are very kind and generous, we got a complimentary hand made tiramisu. I will definitely come back.", "author": "Rasha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I live in Manhattan, and this is one of the places that i make the trip to Brooklyn to come eat at. The food is so good and the owners are soooo nice and generous . This is a family owned restaurant, where the wife prepare special dishes everyday( which are persian dishes)the owners and the staff were very warm and welcoming. Prisce was very reasonable. This is a truly highly recommended place.", "author": "Bassel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "I LOVE THIS PLACE! I am always here on Friday and Sunday nights to see one of the best bartenders in town, MAKEDA! Great drinks, excellent food, beautiful presentation. Will always come back!!", "author": "Cory N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Though I didn't try the food (yet), my friend and I ended an impromptu Hoyt Street bar crawl at Bijan's for one final drink. Upon the advice of the bartender (who was awesome), we tried two of the whiskey cocktails. The place was pretty quiet, with a few other customers at the bar late on Sunday night, and one table occupied. The bar space was cool, the lighting was romantic, and the music was perfectly chill. It was the perfect end to a fun night out. And I will be back to try some of the food next time! \n\nP.S. The bartender called a cab for us, and we really appreciated that level of service!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "First of all the owner is so fucking greedy the chairs are everywhere u can't even sit properly \nThe place is so dark u can barely see the menu \nThe appetizer is a JOKE (super small and overpriced) \nThe chicken is bad\nThe rice is bad \nThis is NOT authentic Persian food place and believe me my husband is Persian he knows this isn't close to it \nThe drinks are OKAY but like I said it's just ridiculously overpriced \n\nI swear this is the worst restaurant if I could give it 0 star I would", "author": "Diana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "As I am sitting here in 80% humidity in late summer back here in Australia,  it feels weird to say that one of my favourite things about Bijan's is the fireplace!  \nDuring our extended stay in Boerum Hill, we visited Bijans QUITE frequently! \nEach time we went (sometimes twice a week    -eek) the service and food were consistently spot on. They always managed to find a spot for us even when it was busy.\n\nOur experience of the staff was fantastic.  They were friendly and engaging (as best they can be when its busy) and made sure that we were kept topped up with water and attentive when our drinks were finished.\nThe burgers were flavoursome, cooked well and were thick and juicy. and the wings were pretty amazing too.\n\nBijan's is definitely one of the better places to go in Boerum Hill", "author": "Susi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "My experience here is met w/ some trepidation. I say that b/c the service for me always makes the experience better. So i'm giving them a 3 star average.  4 stars for the food and 2 for the service. \n\nSo to start with the 4 star experience of the food. 1st they had $5 brunch cocktails Steak and eggs were delish and my companion had the Persian omelette. We loved the meal even though we didn't want to and this is when I tell you about the 2 star experience.  \n\nWe waited over 40 mins for food when they were only 6 patrons in the restaurant. How does that happen you ask... by never putting in the order. 3 tables of two we sat down 1st,  ordered 1st,  and got our food last.... ummm not cool. When ask 20 mins in when it was coming out we were told shortly . So 5 mins after that with tail tucked in server informed us that they forgot to put our order in.... and there was no formal apology. The look I had on my face was surely pretty scary b/c the server continued to look at my companion. My companion decided we would stay b/c if i got up i may have started flipping tables. Sadly our drinks weren't comp'd for the crazy wait which would've raised their star level to 4 for handling the situation. \n\nYeah ... that's it...", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "The food was terrible but the service was worst. As soon as we walked in the waitress started telling us everything we couldn't  do at the restaurant and apparently one of those things was order. When she finally came by 20 minutes later we were blocks of ice because  there was no heat. We placed our order and waited for our drinks. And waited and waited. Finally the food came out. The waitress had gotten one of the orders wrong but rather than wait longer,y friend juat ate what ahe got. My eggs benedict were cold, and bland. The French fries were soggy and greasy. Eat ANYWHERE  else in boerum hill!", "author": "Josie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "When a daytime BBQ leads to late night hunger and no reservations Bijan's is the place.  Heading out to get something to eat on a Saturday with perfect weather brings out the entire borough aka lines and waits everywhere.  Somewhere in from a distance someone mentioned Bijan's and at this point of the night I was not one to argue.  \n\nThe Good: \nChill décor\nDecent cocktails aka borderline artisan \nFriendly staff\nDecent late night menu\nDecent burger\nIntimate, but not intimidating intimate \n\nThe Okay:\nPulled pork was basically slathered in sugar sauce.  I wouldn't recommend it.  The presentation was decent.\nI will check Bijan's again for brunch or after work drinks.", "author": "Windell C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "The decor was amazing! The $15 brunch was a great deal! Includes one of their specialty drinks. The lamb burger was the best I've had in long time. \nFriendly staff. Not too loud. Cash only for brunch.", "author": "Dana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Very attentive staff, enjoyed the ambience, they had old Charlie Chaplin movies playing in the back ground along with eclectic music all the while making sure the log filled fire place kept the environment warm. \n Their craft cocktails are amazing, very unique and tasty.\n\nWe had the Rosemary Lime Chicken and my wife had the Hanger Steak Frites, twas delicious!!! \n\nWe ended the dinner with a delightfully tasting Tiramisu.\n\nYum !!!\n\nI will be back! We enjoyed the staff very much so.", "author": "Rob U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "The food is amazing. The atmosphere is very friendly and cozy. Warm, calm lightening and the bartender did a great job with my cocktail which I forgot the name of :) . it's a great place for hanging out and the only way i can describe the food is that it tastes like home. Everything shows that the owners are passionate about their job .", "author": "Negin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I work around the corner so I come here pretty often. Either for their amazing happy hour or for dinner with friends. My favorite drink is the Gimme More with vodka, it's strong and refreshing. The bartenders make great drinks and are very funny. We always have a few laughs together :)\nAnd the food! The prices are hard to beat for the quality and awesomeness of the food. I love the Beet salad with goat cheese and the Basil shrimp with spaghetti squash and they have the best Hanger steak frites. Delicious! I don't even miss my ranch dressing when I eat there :) Check out their brunch as well. I had a big burger with fries, coffee and a ginger margarita for $15 there.\nIt's this cute neighborhood place with a lot of cool regulars, great service and awesome food. One of my favorites.", "author": "Isabel V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}