{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Hard to say if I'm more disappointed with the restaurant or my fellow Yelpers: how could anyone rate this 4, let alone FIVE stars?\n\nLook, I've worked in the restaurant business; I know how tough it is. But I can't in good conscience signal would-be diners with a 3-Star review that this place is worth going back to. Maybe brunch is good, but dinner is not. \n\nAnd yet, if poor execution can be forgiven, unapologetically poor execution cannot. Nor can \"Service with a frown;\" where's the cheery greeting, upbeat feeling, or even--gasp--gratitude for our patronage?\n\nAlmost all of the dishes were overcooked. Stew was watery. To their credit, they did ask \"how's everything?\" but did nothing about it when we expressed disappointment. Chicken wings were the lone standout: if only all the dishes were like this. \n\nFinally, let me correct my fellow reviewers: the drinks are quite AFFORDABLE (quite the deal during happy hour, and even post-HH, about 30% cheaper than neighboring spots), but not good.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Great little cozy drink spot! I was working in town for a night and got finished quite late- I headed here for a post work night cap because there were few places open at 2:30 and it was near my hotel. \nI was very pleasantly surprised by the warm ambiance and the open friendliness of the bartender Bianca and the other patrons.  I was too late for food, but the drinks were wonderful- they make a killer spicy margarita. Had a lovely time and many great conversations. Will definitely be back next time I'm in town!", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I am so excited to write a review about this great gem in Brooklyn!\n\nMy mother and I came here from NJ for brunch on Easter. It had been recommended to us - and it was well worth the trip!\n\nTheir food is outstanding. It's a Persian-fusion restaurant - so the majority of the menu is familiar Brooklyn-brunch fare, but has little twists that set it apart.\n\nFor example, their Persian Omelette includes dates as an ingredient to give it a hint of sweetness (but if it's not your thing, they have no problem leaving it out!)\n\nThe service here is great. A very friendly hipster staff that reminds you that you're still in Brooklyn :) very attentive.\n\nThey also have a full bar - in fact, they have an all-inclusive lunch for $17.\n\nI think this is my new favorite brunch spot in Brooklyn. I definitely plan on returning with my husband for dinner, as well as some friends for weekend brunches!", "author": "Azy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "The best happy hour in town!!!\nSuch a perfect location, stopped in after a day of shopping at Fulton mall. Ended up grabbing a bite, the spicy shrimp pizza is everyyyything! Will defo be back to try the brunch. Music was great and loved that they have a fireplace.", "author": "Chai-lee Fashiondesigner S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "Better quality than the typical Persian spot but overpriced. Lamb stew dish came out surprisingly dry", "author": "Amit P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Let me begin by saying almost all of the restaurants in this neighborhood are amazing. We've gone to Bijab's twice this summer and have enjoyed its offering's. The Kababs'  and soups are outstanding as are the mixed drinks. Service is good when not crowed and i recommend the window seating which is elevated.", "author": "David B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "The food was blah, the drinks were what I'd expect at a divey place (except one comes with flowers on top and that's nice), and the space could use cleaning up.\n\nI trusted the other reviews on here and am bummed about my experience.", "author": "A. S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "As I sit here waiting for my friend to arrive, the waitress is already acting as if I do not exist..... I've watched her take care of people that've arrived after me, bringing them water and taking their order. While I sit here having to flag her down for both... After she took water to both tables I purposely waited to see if she was coming to me next. She just went about her business cleaning up the tables around me as if I weren't sitting here....\n\nI'll elaborate further at the end of my experience here...\n\nSoooooooo I wound up leaving 10 minutes after I left the top portion of this review. I ordered calamari. Found plastic in it. I left. \n\nNever returning.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Walked here after a concert and arrived at 12:35am since Yelp posted they closed at 4am. We got one foot in the door and were told they were closed with at least 12 people still inside. This is why people hate New York.", "author": "Ursula H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-20", "description": "The food here is incredible. Even my sister's eggs Benedict which was stone cold when it came out was good. My steak and eggs were amazing even though my eggs were simultaneously over cooked and undercooked (uneven grill much??). The real reason for only 3 stars? The service. Beyond bad. Absolutely terrible. Maybe it was the waitress' first day. That can be the only explanation.  And they only take cash!!!", "author": "Leigh Ann T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "The menu looked delicious, I can't wait to come back with friends. The calamari was good. The tiramisu was homemade and amazing. The bartender was sweet and took good care of me. I'll be back for sure!", "author": "C S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I was in Brooklyn and I stumbled across this place on Yelp while searching for a place to have dinner. Such a cozy little spot. I ordered the steak frites and my friend ordered the rosemary lime sumac chicken. We were literally fighting over each other's food and when I was done, my plate looked as if I had licked it clean. Everything was flavored to perfection. And the waitress was very friendly. Will definitely be coming back.", "author": "Kendal F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "First of all I have to say that the food here gets five stars. It's obviously very fresh, really well seasoned, beautifully plated. The portions are a great size, in some cases bigger than average.  As a table we had the pistachio salmon, chicken kabob, lamb burger and I think the last one was a Bijan burger. The burgers looked amazing, and our friends described them as wonderful. My salmon and my partner's kabob were delicious and really filling. \n\nI love the atmosphere here, the decor and the silent movies playing on the wall. The wait staff was very pleasant and the food was brought out in good time even though the place was packed.\n\nHowever I have to give this place only four stars for the following reasons:  It had just rained and in the summer when it rains, shortly after it gets super humid. They left the doors open. It was hotter and more humid inside the restaurant than it was outside. They should have shut the doors, turned on the AC and allowed us to eat in comfort.  Another thing was that every time someone stood outside and smoked, it didn't matter that they were outside. Because the doors were open it felt like they were smoking right beside me while I was eating, so what's the point of them even going outside? \n\nHowever if those things won't bother you, definitely come here. The food is well worth!", "author": "Tal D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Bijans is a great place! The food is always consistent and delicious. It's a nice winter spot as well...the fireplace is such an added bonus. 4 stars because weekend brunch is cash only which is strange since after a certain time they start taking credit cards again. This process is just really inconvenient.", "author": "Craig K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "This cozy little gem is a must-try! Honestly one of the best burgers I've ever had and their signature cocktails are super yummy. Inviting environment with a welcomed fire during this cold winter season and the staff couldn't have been anymore charming!!! Will definitely stop back by the next time I'm out for a visit!!", "author": "Leslie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Happy Hour on the 4th is great. The poor attitude of the bartenders not so. We personally did not have an issue sitting at the bar, but we saw a group enter, wait to be addressed, told they could sit anywhere, and they did. This is when it got crazy... the other bartender shows up to work, and the bartender that was working proceed to say she banked 2k all by herself, and she was done. She then says I'm not serving the \"VIP table\".  Bartender looks over at the group that went to sit anywhere at a high top table in their alcove, goes WTF is wrong with them.  Whatever she said to the patrons they upped and left. Let's say they were not whispering at all.  Take this place with a grain of salty attitudes.", "author": "Dililah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Small, intimate, cozy place with a fireplace. \nWe had a group of 7 that fit perfectly at a long table. Flatbreads were amazing, onion soup to warm us up also delicious. Everyone loved their meal, and great selection of drinks. \nCharlie Chapman old black/white movies playing!!! Cute.....", "author": "Lucinda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I save this location anytime I want to catch up with my friends.\nI would recommend this restaurant. The service is always good not to mention food and drinks also. Nice small and cozy place great atmosphere with the perfect lighting, cute little fireplace inside for catching up with friends or date night!", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "This place was amazing and we will be back. We both had bijan burgers with herb fries. Burgers were cooked to perfection. Saw someone else order a pizza with eggs and that's what I'll be getting next. Everyone seemed super nice and the spot is very chill.", "author": "Teri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "We ate here on Christmas day. The food was absolutely delicious. The environment is so nice and cozy. I would highly recommend this restaurant. We will be back.", "author": "Truth B Told R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}