{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-20", "description": "Disclosure: I'm in the service industry. Went there other day after work with some co-workers for drinks and a quick bite. It was Friday afternoon, about 4 o'clock. The restaurant was not busy, in fact there were maybe 2-3 tables taken in their dinning room and a couple people sitting at the bar. We waited for about 10 minutes until the bartender (who was doubling as a server) walked over and greeted us with a snarky attitude. He's name was Henry. Whatever, it's Brooklyn, so I put it past it. He informed us that it was happy hour and that we got 2 for 1 drinks. I ordered a cocktail with bourbon, pumpkin spice, cayenne and lime juice and shared the fried calamari with a friend. Our drinks took about 10-15 minutes to come out, and when it did, it was gross. Definitely way too spicy to drink and it looked like someone spat in my drink. Waited another 20 minutes for Henry to come by to check on us. Took a few sips and politely informed him that I did not like my drink at all and asked if I could get something else instead. Before I could even finish my thought he was very quick to say \"No\" and yelled at me for not knowing what I ordered. He refused to make me another drink, at which point I gave him my drink back. At this point we were still waiting for our calamari. Now I'm drinkless and Henry didn't even have the sensibility of bringing over waters. Also don't order the calamari. The portion was small, but reflects the $9 price, but it looked funky and tasted even weirder. Probably won't be back.", "author": "Bibi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Had the Persian chicken salad sandwich with herbed fries and it was delicious! Also had the Ginger-rita, which was really refreshing. Really cool space with a great atmosphere!", "author": "Blair C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Brilliant selection of food. Cocktails are all fresh!  Bloody Mary's are amazing!!  Foodies, this is a great spot to chill and relax with great food!", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Alex rocks, he's the bar-tender who serves excellent drinks and really is all around a great service pro. The food was excellent (Lamb Burger, Wings) both very tasty. Overall I would highly recommend this place..", "author": "Kurt Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "Bad service, decent food. Came here for a late weekday lunch with my father. The lamb burger was more cooked than I ordered, a little dry, but good flavor. His salmon salad sandwich was also a little dry.\n\nWorse, two sandwiches took 30 minutes to come out. Nobody came to take our order, for that matter, we had to go up to the bar. Our water wasn't refilled a single time while we were there. \n\nPlenty of places nearby are better.", "author": "John K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "The two stars would be lower had it not been for a dinner I once had here which was decent.\n\nWe took out of town friends here for brunch.  Options were not many.  They had no syrup for my friend's pancakes and gave him a little compote instead (he had to ask for more and even then it was just a little).  My vegan friend (I'm first to admit they're annoying to eat with) had nothing to choose from because the chef is apparently inflexible and wouldn't even give him a plain salad for the flat-price of $10 brunch price (I mean, instead of giving him eggs and ham or sausages which would cost a lot more you can't give someone a plain salad with nothing on it??  Seriously?)  \n\nThe worst part was that they have no refills for coffee.  Seriously?  For a $15 brunch?  I've gone to middle of nowhere towns and had free refills of coffee.  Bijan's cups were tiny, and for $15 you can't give me a second cup of bland coffee?  I.  Just. Need. My. Coffee. In. The. A.m.  \n\nOf course my and my fiance's dishes were nothing special.  Probably one of the most unappetizing brunches I've had of all time.  \n\nWe were embarrassed to have taken our friends here, to be honest.\n\nYou want my advice?  Give free coffee, it costs nothing.  And give people some options besides what you have, for man's sake.  Or get rid of your chef!", "author": "Caroline C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "This place is unbelievable. Great drinks, great atmosphere, very friendly staff, INCREDIBLE chicken wings, and the bill?? So good we thought there was a mistake.\n\nI'm so happy there are still places like this in Brooklyn. Though maybe, after all the reviews, this too shall pass...", "author": "ezghan p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-08", "description": "The service was horrible. The staff was nice enough, but nothing was right. Each order was late, wrong, or forgotten.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "My friends and I stumbled upon this place one night. We sat for hours, sipping on drinks and having dinner. The staff didn't mind at all that we were there for such a long time, and the service was great. Cute atmosphere, and delicious food.", "author": "Elicia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "Bijan's is a beautiful surprise, if you're new in the neighborhood, as I was.  And Henry, the barkeep and uber server, makes you feel welcome and gives great advice on the menu.  This is an oasis in Brooklyn.  I kind of hate to advertise it, because I like it to myself.  But you must go.  I had a calamari dish that was delicious and a new rose that is both dry enough and tasty.  A pleasure.  And the decor is interesting, if you love art and atmosphere.  Good pour by Henry, behind the bar.  I'm going back.  The owner seems nice, too.", "author": "Meg B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "I really like this place!! I love the atmosphere and the decor.  The 2 for 1 happy special is great and the drinks are really good.  In terms of food I ordered the pistachio crusted salmon and it came with mashpotatos and string beans.  The salmon was cooked really well. I would like to comeback and try the lamb burger", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-01", "description": "Never in my life have I experienced such treatment from a restaurant employee.  Disgusting!  Here is my story...\n\nMe, my husband and my daughter came here on a Friday afternoon for lunch.  We placed our orders and the waitress (who did confess that she typically does the dinner shift) entered my order incorrectly.  She was really sweet and apologetic and left the incorrect dish on the table and said, \"you can pick at that in the meantime while I place the correct order.\"  As I reached over to take a piece of vegetable from that plate, the bartender (who was across the room) yells and says, \"Ma'm, excuse me, if you're going to eat that too, you will have to pay for that.\"  First off, the waitress just told me 5 seconds ago to eat it and second of all, who does that????  Let's say that it is their policy to take the food back and not have the customer eat it, shouldn't that be something that is quietly discussed with the waitress and not the customer? I was beyond furious at how obnoxious he was being to me and to make matters worse he then began to yell at the poor waitress, who just made an honest mistake.  I am not sure how this douche bag got a job in the service industry but he clearly has no idea how to talk to his customers or the staff.  When I confronted him he told me that he can do whatever he wants, which is funny since this isn't his restaurant.  I wonder how the owner would feel about that.  I guess I will have to email him and find out...", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "TO DIE FOR food. We ordered the salmon, steak frites and pork chop special: WOW They were stellar. The drinks were unique. I had the jalapeño margarita which was different, in a good way - not too sweet \u0026 just the right amount of heat from the jalapeño. It was a busy night but we weren't rushed at all. One waitress (who was fantastic) and one bartender, so it was a teeny bit slow but that was no problem! This is a great place to come, hang out, unwind with friends and enjoy some delicious food.", "author": "Tora T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "I like Bijans. They have a good happy hour, the menu is not big but everything is good, and the drinks are affordable. The space is small but it's not uncomfortable. Sometimes they have live music. But the service if you are sitting at a table is usually really slow. I like the Lamb Burger and the Grillbreads. Very reasonably priced.", "author": "Tamara F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Great local bar with a cozy atmosphere (fireplace going during winter), super friendly bartenders and staff, not too cramped or crowded, excellent food. Always my go-to spot for any night of the week. Best in the neighborhood!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Great food and atmosphere! Descent prices and super nice staff. I love coming here whenever I'm in Brooklyn!! Highly recommended!!", "author": "Azin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Love love LOVE Bijans especially HENRY!! He's the best!! We talk for hours!!!! Oh and the food is DELICIOUS too!!", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "This place was one of the most adorable little spots I have ever been to. Not only did it have a nice, cozy ambiance, the food was amazing! I ordered the lamb burger and it was cooked to perfection, and the tiramisu was one of the best I've ever had. Definitely coming back here again!", "author": "Parisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "The drinks and food are AMAZING! Whenever I visit my sister in Brooklyn we come here. We call it \"purple bar\" because of the decor, it's so cute! The happy hour deal is great and the bartenders are the best! Definitely recommend.", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "Never eaten here, but they always seem to have great brunch drink specials and funky specialty cocktails.  The atmosphere is very chill and the bartenders have always been nice.", "author": "Ryan T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}