{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Amazing spot in a friendly neighborhood in Brooklyn.  The food is exquisite and the staff is extremely professional and lovely to be tended by.  \n\nDefinitely a place to go for wonderful drinks and dinner for a great night or brunch!\n\nThankyou for the wonderful service!", "author": "Natasha K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-16", "description": "It was fine! Cute little place that's quaint and filled with friendly places. It was easy to get a reservation for a Saturday brunch time and it didn't get that more crowded even as we were leaving.\n\nHad some new staff wait on us so there was a bit more repeating but that's fine. The food was average. Good enough for eggs, etc. i has the breakfast pizza and the dough was tasty. Bloody Mary was standard too - nothing amazing but good enough. \n\n$20 all inclusive brunch, which is a steal for an entree, cocktail and coffee/tea so it's a good value.", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "Cute little spot \n\nMade a reservation here on a Saturday for brunch. \n\nLoved the food and vibe, but they don't accept cards on weekends. (there is an ATM across the street in a deli) but this was an inconvenience since their pages states they do accept credit cards.  \nWe got eggs Benedict and the Persian chicken sandwich. Both were pretty good. I would come back to try other dishes because the food is good!\n\nWe each got a couple of cocktails. The one with the cayenne pepper and the pineapple was really good. I would skip the one with the lavender, as it has actual dried lavender in it, which was annoying to drink around. \n\nIt wasn't too busy to my surprise, usually its very busy, but if you can - make reservations \n\nThey have an actual real fire place, making this place super cozy! (but don't sit next to it because it gets smoky)", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-04", "description": "I found Bijan's on Yelp long before I even moved to this neighborhood and desperately wanted to love it. Heck, I wanted this to be my new go-to - decor with plenty of character, unique Persian dishes, minutes away from where I knew I would be living.. \n\nBut truth be told, it wasn't until my third visit to Bijan's that the food appealed to me even in the slightest. The chicken with mashed potatoes and green beans is the dish that gave Bijan's a spark of hope in my mind, but even that entree could use some much needed improvements - the green beans were completely raw and crunchy, as was the garlic sprinkled on them. The chicken leg, although well-spiced and a generous enough portion for two meals, was very dry and made me wish I had a bit more gravy for it and for the potatoes. The sweet chili wings are actually quite good here and I would order them again. \n\nI have also ordered the onion soup, the smoked eggplant mezze, and the bbq pulled pork flatbread here, all of which were extremely underwhelming and left me regretting ordering them. My boyfriend actually had to send the steak and fries back, which is something I never see him do. The crack soup with the chicken broth, rice noodles, and shredded chicken, fresh red onion, bean sprouts would be something I would come back for regularly, but it was impossibly salty, I couldn't eat it and send it back. Such perfect soup ruined by one too many salty chicken bouillon cubes. Ugh, I already know I would be so temped to order it again in hope the chef would take it easy on the salt.. Most food absolutely needs work.\n\nThe service is spotty at best. The moody bartenders and servers often seem annoyed while taking orders and then eagerly rush off to chat with their friends at the bar, leaving customers forgotten. The fact that dinner on a Sunday night will easily turn into an over two hour affair (even if you order right as you sit down and don't order drinks) is definitely not ideal either.\n\nThe vibe and decor alone deserve 5 stars. I love the black and white Charlie Chaplin movies playing on the big screen, the cozy little fireplace, and the whole strategically unfinished look of this place. However, decor and vibe alone are just half of what I look for in a great restaurant.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "Bijan's has been on my friendly neighborhood bookmarks since I moved to the area, so I suggested we try it out when my cousin stopped by for dinner. I think my expectations were a little off the mark from the get-go because I was expecting something very Persian and a more traditional restaurant. I didn't realize that Bijan's started as a bar, hence the giant TV playing football above our heads. It seemed to conflict with the semi-bohemian vibe I had gotten when we walked in, but most of the guests seemed more interested in the food and conversation anyway.\n\nWe started off with the Flower Bomb and Lolita cocktails, and both went for the Lamb Burger with sweet potato fries. My Flower Bomb was floral and a bit heady. I actually enjoyed my cousin's Lolita a little more; the cucumber was strong and refreshing. \n\nI'm not sure what I was expecting from the lamb burger, but it was just... a burger. Nothing special about it, just a solid lamb burger on a bun with lettuce and onion. Maybe I was expecting some fun sauces or explosive flavor or something? It was cooked well, but no real wow factor. Next time I would definitely add some kind of cheese (it didn't come with any on!). The sweet fries, on the other hand, were perfectly thin and crispy -- my favorite. \n\nThe service was great and it's a sweet atmosphere for a meal, but the food was overall just OK on our visit. I'd definitely stop by again to try the flatbreads or other tasty-looking options and hopefully find something that will wow me!", "author": "Naomi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "I've been mezed!\n\nLove the room, genius to show silent films on a large screen. Started with sampler of four meze, $24. When I worked in restaurants, we had little bowls called monkey dishes for side dishes. Bijan's have found the smallest monkey dishes I've ever seen for their meze. Two tablespoons of a dip for $6? It's served with a warm, delicious flat bread but not enough to finish the sampler. We asked the waitress for more.\n\nShe said \"sure\" but forgot to mention the extra $2 charge.  The meze were very good except the eggplant and walnut which was bland and tasteless.\n\nI ordered a lamb burger, asked the waitress if it came with cheese. \"You can order cheese\", no mention of the $2 upcharge. The burger itself was good but too small for the bun.\n\nOn to the world's most confusing bill. Some items have discounts. The total discount is presented at the bottom, you'd think one would subtract the total discount from the total to get your final tally but you'd be wrong at bijan!", "author": "J D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Great food I have no complaints here. Everything my friends and I are were good. Unfortunately their fryer didn't work so we weren't able to taste the sides that originally came with our order. Luckily the substitutes available were a great replacement. Side salads were not dull and looked like something I could just slap together at home. They added vegetables and a unique dressing which I couldn't put my finger on what it was exactly. \n\nMy friends and I had a round of Bijan's Burgers just prepared different ways. The only gripe was the extra charge for cheese. I think it was a big steep just to add a slice. I ordered a medium well which was more well than made but was still good. It just not the medium well I asked for, but didn't ruin anything for me.\n\nDrinks were amazing I had a flower bomb and my friends both had different red wines. They both said they loved it. \n\nThe server was good and let us know about any changes ASAP. It wasn't his fault. Probably because we can later in the night that a lot of things were sold out, and the fryer needed to be fixed. Lol Outside factors he couldn't control. He was attentive and quick which was all we needed and mattered. \n\nThe ambiance was great and cozy. I couldn't stop looking around while conversing with my friends. Actually one of our topics of conversation was how the place looked and the paintings. It was lovely and nice. Plus they played a whole assortment of music which I loved. It fit the scene of the establishment well. Only thing one of my fiends didn't really like was the seating. It would of been great to have more comfortable chairs. I didn't have much of a problem. Glad the chairs had a back piece so I could rest my back on. \n\nWe also ended the night with some dessert. My friend and I both shared one tiramisu and one vanilla cheesecake. Even though I was more in a mood for tiramisu; I personally loved the cheesecake more. It has such a rich flavor worth telling y'all about.The desserts as the only thing I took pictures last night. The presentation was so pretty! I couldn't resist. You can also tell by the pictures to how warm and cozy the place was. Well at least I think so. \n\nStill we were all agree, we would and will come back to this place. More to try!", "author": "Diane D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-10", "description": "Very average brunch. My boyfriend and I stopped by here on a Saturday afternoon and the restaurant was empty. I think that should have been a sign because most brunch spots are poppin' from 11am-2pm. Well it was not at Bijan's. The music was also super loud for a 12:30pm brunch. They were playing club music and finally lowered it when a family came in because they had a baby.\nThe decor was very hippy/save the planet feel. They had communal tables and a lot of plants. I gave 2 stars mostly for the server. She was very kind and attentive. \n\nNow for the food:\n- I ordered the breakfast pizza and asked for the eggs to be over easy. I thought everyone knew you don't cook the yolk for over easy eggs! The chef there did not because my eggs were well done and it was not nice on the breakfast pizza. I was hoping there would be some egg porn action and it would be all creamy and delicious with my pizza but no, it was way overcooked and not what I envisioned at all. \n-My boyfriend being his basic self ordered the eggs with sausage and it came with potatoes and toast. When the food came the kitchen messed up and gave him really overcooked bacon. I mean we all like crispy bacon, but not like disintegrating bacon...The server was kind enough to just add the sausage on the side. His scramble eggs did not look appetizing either. \n\nSigh it was such a disappointing meal. I mean at least we didn't have to wait long for food. Maybe dinner is better? However, the brunch really made me not want to go back to try other things.", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Bloody marys had a punch, some good sour and spice tastes. Can taste the alcohol after taste as well.\n\nGot their omellete with spinach, onions, tomatoes, and mushrooms. Came with sprinkling of parmesan on top. Lived the consistency of the omelette. They even put shredded carrots, tomatoes, and various greens on the side. Top class omellete. \n\nGot their granola and yoghurt. Had fresh raspberries, blueberries and banana slices. Full sized bowl. Normal people/diets may be filled just on that. \n\nQuite a bit of space for a NYC spot!\n\nFireplace was perfect on cold foggy day.", "author": "Saikrishna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Came here for dinner and drinks after seeing some rave reviews on Yelp. The menu looks great and has a great variety on it. We tried the lamb burger which I had with truffle fries. The burger was dry and crumbling and the fries were very oily, was not able to finish either.  Had tiramisu after which was very good.\n\nService was great and so were the drinks.", "author": "Pooline N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "Good go-to place for brunch. Only reason why I've been here. Drinks are solid. Good choices for brunch are pretty tasty, and large enough to share/have the entire table pick from. Good location...quiet street, and great neighborhood/neighboring businesses.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "One of my favorite places in Brooklyn, such a hidden gem! The prices are reasonable and the food is amazing. I especially love sharing the appetizers amongst a group the Korean Wings and Truffle fries are everything", "author": "Angel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Oh Bijan's, you are spectacular! Just perfect. Went here for brunch on Sunday around 3 pm and had the best time. The inside is dim and feels like you are stepping into an oasis of some sort. A different world. The space is classy elegant and simple all at once. \n****It's seriously perfect for a first date as Peter D mentioned. You will walk in and all nervous tension will leave as you will be transported to Bijan's, which is apparently a down to earth ass place. \n\nAnd they have a cool $17 brunch deal (cocktail + entree) where you will leave very Satisfied! They have many dishes to try and def something for everyone. \n\nPros:\n*The music here is SO ON POINT!! It complements the experience. \n*The servers are ridiculously cool folks\n*Food was so good!!\n*Overall Aesthetic was DOPE (there are also candles and flowers on wooden tables) (whoever curated this place, the music \u0026 chose the workers is a genius)\n*Comfortable and chill vibes (we ate, paid and they let us stay there an hour after we finished eating just to talk \u0026 the servers even refilled our glasses with water!)\n*Romantic and special in its own magical way\n\nCons: \n*would've liked some more special Persian dishes. Like special Persian desserts and other things on the menu. \n*bring cash\n*parking around here is abysmal but I did manage to find a spot. \n\nI had a flatbread Margherita pizza which was very yummy. And their Persian kiss drink which was good as well and got me a little buzzed. \n\nIf you live in Brooklyn, and want something chill and special, come here on a first date (or a fortieth date) or with a group because they have these big farmhouse tables, or if you just want to enjoy a meal in peaceful vibes. Point is, just come!\n\nAlso if your date is Persian or likes culture, bring him here it'll show you care :) \nPs Bijan's is pronounced : Bee-jans", "author": "Tal O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "Three (and a half) words: $20 all-inclusive brunch. That's right, folks - coffee/tea, a cocktail, and an entree. Where else are you going to find a deal like this? Answer: somewhere else in Brooklyn, but probably not even then.\n\nI ordered the Curiosita (Prosecco with elderflower), the Persian chicken salad sandwich, and a coffee. All was delicious and excellent - only critique is that the \"herb fries\" could have used a pinch less herb, as in there was just wayyyyy too much black peppercorn bits that got stuck in my teeth and kind of made the fries taste like fried peppercorn. Otherwise, however, the meal was excellent and the staff is so friendly. I like the space a lot, too, though the seats weren't the most comfortable.\n\nI would really like to come back and try other things on the menu and AGAIN, I REITERATE: $20 ALL-INCLUSIVE BRUNCH. Can't be beat.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Very friendly and welcoming. The customer service is excellent! I ordered the salad with salmon. I received the salad with shrimp. It was DEEEEELICIOUS! \n\nOur waiter came to see how everything was and the truth, everything was great. I mentioned that my order was a bit incorrect but not a problem, it's still delicious.  The next thing I know, the chef is coming to my table with salmon. OMG, the salmon was even better than the shrimp!!!\n\nWill be back.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "No reservation needed for a party of 2. Attentive and speedy but not intrusive waitress with great recommendations. Fantastic drinks and mezze, both loved our entrees. Super cozy atmosphere, we were sat right next to the fire! Will definitely be back for drinks and brunch very soon.", "author": "Brennan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Ever since Bijan's opened up six years ago, happy days are here again. Literally: one time I walked in and Happy Days was playing on the TV. \n\nFonzie aside, I'm STILL so happy Bijan's is here. It's no longer the new bar on the block, but the seasoned vet that's got regulars, understands our quirks, and gives the neighborhood what it needs. The vibe is intimate, but casual. The music is always good, which makes it the perfect place to kick off your night with a quiet drink, especially since happy hour is very solid. \n\nBest of all, the kitchen is open (and has been, these past 5.5 years), and the food is solid across the board. Brunch is a solid deal (cocktail, food, coffee, juice, all for $17), and the dinner menu has enough variety that everyone can find something to eat. They've got burgers and flatbreads and mezze (they lean a little Middle Eastern), but in my opinion, you can't go wrong with chicken. \n\nThe Persian-spiced wings are done right, and the rosemary, lime, sumac chicken is a staple of my diet. Both sound more exotic than they are; the latter is just a perfectly roasted airline breast over haricot verts and truffle mashed potatoes, with a lovely pan sauce to tie it all together. It's a full, balanced, excellent meal for under $20. Enjoy it by the fireplace in winter, and with the doors open in the summer.\n\nIt can get a little packed during happy hours or weekend nights in the small space, but the service is always friendly and the drinks are always good. The menu no longer lists the therapeutic benefits of the cocktail ingredients pumpkin, mint, chili pepper, etc., but I still feel good about having five of them in a sitting. \n\nIf I was in danger of spending entirely too much time here before they started serving food 5.5 years ago, there's definitely no hope for me now.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "Bijan's was lackluster. There was nothing in particular that was terrible or particularly bad. Bijan is a quaint place with okay food, okay drinks and okay service. The decor and intimate feel may have built an expectation that wasn't met. \n\nWe ordered 3 appetizers, 2 drinks and 2 entrees to have a nice sample size of the menu.", "author": "Ke W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "I came here for a late brunch last weekend after shopping on Fulton.  The atmosphere is your ideal small Brooklyn restaurant, cozy in size but not cramped.  I love the one table in the corner by the window.  It's on a small platform separate from the rest of the tables but I assume wouldn't make you feel like you're on display either.  Although... I definitely noticed the table so... maybe it does?\n\nImportant stuff.  There was a brunch meal that comes with a cocktail for ... $20!  Considering I really needed a drink after running errands it was a no brainer, not to mention they weren't just mimosas, they had fun actual cocktails to chose from.  I had their Bijan and something else she recommended when I described what type of drinks I like (I know that is slightly unhelpful except that it's super helpful if you want to try something new but need a little help picking what to try).\n\nNext breakfast pizza.  OMG was it delish!  It really was.  I offered my friend some and warned her if she didn't take me up on it soon it'd be gone.  Although I was overly stuffed... I was secretly glad that I ate it all up.  They ask you how you want the egg, I had it sunny side up.  I think sunny side up is delicious with pizza considering egg yolk, pizza crust... need I say more?  But it's messy or not messy if you're one of the civilized individuals who use a fork and knife.\n\nI'd like to say that I'm interested in trying out other foods, but I'm a creature of habit and really just want that pizza again.  Maybe with a pancake if someone shares it.... well definitely want to add some pancakes next time.  See you there!", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-29", "description": "Currently sitting here finishing our food. I would say the food was 3.5/5. We ordered all the food to share and to our surprise it all came out at once including my soup, the appetizers \u0026 entree(which was about a 30 min wait). The flatbread pear goat cheese 4.5/5, Persian soup 2/5, truffle fries3/5, mezzes 2/5.  The staff is very nice but it noticeable that they need extra help. \nAlso the coat rack fell on me while eating. \nDon't think this would be a place we would return to.", "author": "Julia E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}