{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "I would highly recommend this restaurant.  The food selection was simple, yet all the items on the menu was flavorful.  It was the perfect setting for a date.  It was quiet and laid back.  For an appetizer we had the persian spiced chicken wings and the white goat cheese flat bread.  We should have order only one, since the portions were so large.  For the entree we had the lime, sumac, rosemary chicken breast and the hanger steak frites.  I must admit the steak was juicy, tender and seasoned to perfection and the chicken breast meal was absolutely delicious.  The reason I rated them a four instead of a five is because of the limited menu.  However, overall a great experience, I am glad I gave this small place a try.", "author": "Janel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "I stumbled upon this place on a cold afternoon with a friend looking for a bite to eat and an alcoholic drink to warm up with. I wasn't feeling too daring so I had a burger with cheese and a side of their special chips and my friend was recommended the lamb burger by the waitress/bartender. The food was delicious. We were the only customers there, so I can't really comment on the service other than the fact that our waitress whipped up great cocktails for happy hour. I am definitely looking forward to my next visit here.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-16", "description": "This place manages to mess up dishes that are delicious everywhere else and charge way too much. At least the service is terrible.", "author": "S P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "It was cool. If I'm in the neighborhood I might stop by again, but I wouldn't go out of my way to come back here. The food was delicious when we finally got it, but the portion sizes were small considering the price.", "author": "Keri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Nice warm fire place on a cold winter night.  Quaint rustic decor and good bartender.", "author": "opqr s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Great brunch spot. The $15 price fix which includes a drink is a great deal. The food was solid, I personally like the very crisp bacon, but I know some people like it a bit chewier. Blood Mary's were terrific, spicey with various pickles as garnish.", "author": "G O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "Hands down best place for happy hour and appetizers in Downtown Brooklyn! Great atmosphere, a breath of fresh air in comparison to Fulton street. 2 for 1 happy hour. Rena and Alex are amazing!!", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Great neighborhood place. Good food. Very relaxed. Nice place you can just hang out and read a book or something.", "author": "Jane G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "Fantastic spot!  Great drinks, great staff.  Cool, laid back atmosphere.  Highly recommend it if you're feeling like you just want to relax and have a good time.", "author": "David O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "Lamb burger is awesome.  The service was excellent.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "Update:  Bijan's came on the scene as a great local hangout, complete with revolving art displays (open until 4 am) and has since opened their kitchen, serving a range of plates that have a subtle Persian twist.  The Steak and truffle fries are really great, as is the cucumber salad with feta!  And the growing bar staff is great!  A true neighborhood hangout.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "Great cocktails friendly bar staff! The food was amazing! Hanger steak  cook perfect med. rare \u0026 truffle fries were crispy and flavorful, made from fresh potatoes. My wife had the pork belly special all she said was\" Holy Swine\".  We been there to the bar before for cocktails our bartender was Alex he was great. We only had the  wings OMG they are the best in the city. He made us wild cocktails with ginger and tequila and my wife had pump up the jam. He made us promise to come back for dinner.  It's our new local. Oh I almost forgot we went on Friday during the snow storm and they have a REAL FIREPLACE!!! Yes", "author": "Peter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "Deliciousness- chicken wings and pulled pork sandwiches. Craft cocktails made by Alex. Everyone here is so nice- ask for Rena for great service. Best spot in the area.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-21", "description": "Food was good enough but I got awful food poisoning after eating here. Had the baby greens salad, loaded with shallots and onions (onions weren't listed on the menu), papardelle pasta with tomato sauce and mushrooms. The water tasted and smelled funny. Cool ambiance, but I'm never going back!", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "Kitschy-charming interior, stiff drinks, impeccable food. I was particularly moved by my chicken entree. Chicken, well, is chicken - but here, it is much, much more.", "author": "Sam O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Henry the bartender makes a stop in at Bijans totally worth it.!He's pleasant and funny and makes everything all better after a long day at work. The food is fresh and amazing and the cocktails can't be beat.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "okay. i won't let the fact that i was hired to work here as a server then never got a shift deter me from writing an objective review. it's a really sweet restaurant. in a really tuh-RIFF neighborhood. that said...\n\nlet's start with their specialty, which are cocktails. and not just any kinda' cocktail, but herb infused, physiologically balanced concoctions. yes! that's right, folks, drinks,that are mixologically created to restore you to a better you. i mean, that's what alcohol intends to do, but their drinks are especially designed to make you feel fan-TAS-tic. with ingredients like \"immune building elderflower\", \"antioxidating pomegranate nectar\", \"healing mint\" and don't even start me on the \"libido enhancing maca\", there is no way you are leaving this bar in a bad mood. i don't know what the #@!* maca is, but anything libido enhancing is divine in my book. aaaaaaand all for the extremely reasonable price of $10 a drink ~ what?!?! then there's the issue of timing. you'd think a drink with those kinda' ingredients would take awhile to land in front of you seeing as how the bartender has to grab the ingredients from the garden out back, but, nooooooo. they arrive lickety-split. especially if you're at the bar. cheap and quick ~ sounds like my ex!\n\nnow onto the food. hmm...you know, i'm going to have to get back to you on this. when i was in training, for one day, it all sounded really delish ~ pistachio crusted salmon, lamb burger with sweet potato fries, persian spiced chicken wings ~ but i never got the chance to dine on their FAAAB-u-lous fare so i'm going to have to get back to you on this one.\n\nin the meantime, get down to bijans in the heart of boreum hill and find out just how fantastic they are for yourself!", "author": "Brian Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "I feel kinda bad about giving a low score given that I can tell that quite a few people really love this place. The atmosphere was okay. The place itself is a cozy space and has some interesting artwork. The problem was that we were there for dinner and were expecting good food given the high yelp rating. The menu didn't have many items to choose from. My friend got the salmon after asking if the portion was good sized and being assured that it was.  What came was a very small strip of salmon that was very bland. I ordered calamari and it tasted like it may have been breaded and frozen for awhile. The sauce it came with didn't have much taste. Our drinks were good but the food was only mediocre. The music was loud for a restaurant, okay for a bar. Personally, I don't need to hear Pearl Jam blasting while I eat. Maybe come here for drinks if you live in the neighborhood, but if you are hungry go someplace else.", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "My husband and I went to Bijan's Thursday evening. The food was delicious. The service was excellent. I had the lamb burger which was the best burger I ever ate and the hubby had the special pizza with sugar snap peas, fava beans, fresh tomatoes with goat cheese....delicious! Henry the bartender makes a tasty strong drink and Rena the hostess/waitress was awesome. It was a wonderful date night. Can't wait to go back.", "author": "Susan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-13", "description": "BEST TO AVOID AT ALL COST! I've been going to Bijan's for the past 2 years and it keeps getting worse and worse. The bartenders are super nice and the food is decent, but it takes 45 minutes to an hour to get a burger. The service is downright awful and it starts with the owner. He is inattentive and has no idea how to be hospitable. He does not rectify issues about wait time or poor service of the waitress'. I've never been in any other establishment where people are waiting for drinks/food for a significant amount of time and the owner or manager does not come over and apologize for the inconvenience. The waitress on Wednesdays is in her own world. She does not pay attention to detail and will take your order 30 minutes after you sit down, it's insane! The seating here sucks. The tables are very wobbly and extremely unsteady. I really wanted to Bijan's to be my neighborhood bar, but it has not met expectations. With all the new spots in the neighborhood popping up (Livingston Manor, Grand Army) their is no reason to continue to get awful service and support a place who does not care about customer experience. I will not waste my money here anymore and suggest everyone else in the neighborhood do the same.", "author": "Wilie D."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}