{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "I came to this place for a meeting,  I'm not from the area but I found it relatively easily. The decor is kinda trendy,  which I'm not typically a fan of but it kinda works. \n\nThe bar has quite a few seats for the size of the place and there is a large selection of signature cocktails. \n\nThe staff's personable and has no issues with giving suggestions. I came for a meeting and was stood up :/ no Bueno but I decided to stay for a beer and some food since it was dinner time and I was pretty far from home (Harlem). \n\nI got the lagunitas pilsner which I'm a huge fan of and the wings from the enthusiastic suggestion of the bartender. The wings were so good. I'm hugely picky about my wings I don't like a lot of them. They are like a whole other food group to me. These were delicious and a nice departure,  spice-wise, from the traditional wings I usually eat. \n\nI would definitely \"trek\"  here from work. I would maybe have to be going out in Brooklyn to make it here from home, but regardless I will be back and it's probably unfortunate that the first things I tried here were the wings because I will likely never get anything else. \n\nPlus, great tunes!", "author": "Shayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "This was the cutest atmosphere and the nicest staff! From the owner and his warm\nBeautiful wife, to the chimenea in the dining room, it's a far out place !! It's very brooklyn-esque! And a very cool neighborhood. The food is awesome ! I had the crack soup and the margherita flat bread! Amaze !", "author": "Dani M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Love this place! \n\nThe people here are super friendly, very chill neighborhood vibes here with great food.\n\nI would definitely recommend the truffle fries and Bijan craft cocktail. This is definitely a great place to impress a date.", "author": "Kat J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "Hell yeah! Great intimate rustic ambiance. Delicious food. I don't really have any complaints. My waitress could have been a tad more attentive, but it's all good. This is a great spot if you're not necessarily looking to be seen but want a neighborhood favorite. \n\nVery comfortable setting. I enjoyed the roasted chicken and sage shrimp. I'd definitely come back.", "author": "Deeana O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Delicious food, great ambiance and wonderful service! We especially loved the cucumber salad and the lamb burger. We will definitely return soon.", "author": "Talia G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "Meh. Walked in and sat down, waited to get menus and were chided for trying to get our own. Bar tender was the only person working the tables, bar and was bussing so he seemed over it. Cocktail was pretty good. Food was fair. Pretty sure the chicken salad sandwich was potato salad instead. The only really tasty bit was the couple of mezze apps we got. Won't be back.", "author": "CA S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Fantastic ambiance, great location, and even better food and great drinks! The owners are so amazing and friendly and accommodating. If you want an intimate dinner or something larger like a party, this is the fantastic place for lunch or dinner! Love this place!!! Definitely will be going back again and again!", "author": "Sandra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Boerum Hill is a beautiful neighborhood full of wonderful historical townhouses, cute family owned shops, and beautiful tree lined streets.  It is a magical place that is screaming for a small little neighborhood gem of a bar.  When I moved to the area, I searched high and low for an establishment where I could have a nice intimate dinner with friends, a place to celebrate the small achievements in life, and to be perfectly honest a place where I could drink alone after a tough... okay a regular day.   When I first walked into Bijan's, I knew that I had not only found that place but I had found a second home.\n\nThe atmosphere is very warm.  Literally.  There's an adorable fireplace that they turn on in the winters.  The bartenders and waiters are the best in the game.  Henry, you the real MVP.  They have a good selection of local beers on draft and some nice cocktails if that's your thing.  I'm a simple beer man myself.  The place is full of regulars, a cast of interesting and diverse characters that only add to the flavor that is Bijan's.\n\nThe food is excellent as well.  The generous bowl of truffle fries is finger licking good.  And there's absolutely no judgment here when you ask for a bowl of mayo to dip your fries into.  Trust me people, there are some establishments that totally look down upon this beautiful fat tradition.  And the burger is juicy and the meat is top grade.  The wings are to die for.\n\nCome to Bijan's.  I'm the really good looking Asian man with the undeniable swag sitting at the bar.  Say hello.  Let's have a drink and share some fries.  Okay.  I take that back.  You can get your own bowl of fries.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Bijan's is a solid spot in the area, especially after Peter D has kicked you out of his apt for spilling wine on the carpet. \n\nThe inside is comfortable with a few communal tables, small tables and we actually sat at a table on the elevated stage (great for people watching). The classic burger was excellent. A thick beef mix with plenty of spice, it was juicy enough that ketchup was an after thought. The lime, sumac, rosemary chicken was great as well. A perfect portion of juicy chicken, garlic mashed and some green beans.\n\nDef dragging Mr D here for some day drinking and to try more of the menu. I have a feeling I'll upping this rating a star soon.", "author": "Drew A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-06", "description": "Worst service I've ever received especially giving the area. Waited 40 mins for a salad. Got up and walked out. Horrible", "author": "Kiana Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Food was delicious and service was impeccable!!\nWe have the cucumber salad and some delicious dinners. Thanks for a great night!", "author": "Cait B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Best meal I've had in a long time .. I recommend the Steak  and Fries . You can tell the chef takes pride in his creations.", "author": "Irene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "I love bijans when I'm in the neighborhood after work! Great happy hour ($4 off craft cocktails) and super friendly staff. Great mezes to snack on if you're not super hungry. If you are in the mood for a meal GET THE LAMB BURGER! Hands down one of the best burgers I've ever had", "author": "Makeda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "Is this the best date restaurant in Brooklyn? I think it might be. It might be too awesome for a first date, though. \n\nIt's small, but the crowd ebbs and flows throughout the night. It's on a side street, and you'd definitely miss it if you weren't looking for it.\n\nThe burgers are awesome, the wings are awesome, and everything is priced fairly.  There's a real fireplace; none of this lit fake wood stuff with a little flamerdoodle popping up in the middle...and you can sit a foot away from it without being burned alive. \n\nGreat drink list, solid list of beers, and interesting layout for such a tiny place. Lots of tables, and even an elevated space for a group of 4-5. \n\nComing To America was on TV without sound when I walked in. That movie is so awesome, it doesn't even need sound and people will still want to watch. Bijan's kind of like that.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "I had dinner at Bijan's last night, we made a reservation for 7pm, which we definitely didn't need to since it was relatively empty, that being said, it was a cute place that had a fire burning in their fireplace, which added to the cozy atmosphere. \n\nFor dinner we split the Persian spiced chicken wings as an Ap which were delicious and very crispy! I had the lime, sumac, rosemary chicken for my main which was as expected, but good, and the chicken was moist! The Haricots Verts were undercooked but the truffle mashed potatoes were delicious. My dinner companion had the veggie burger which was underwhelming, it was a potato patties served with french fries, so Potato on Potato overload!!! \n\nThe service was low key and un-intrusive. Overall it was a pleasant experience, but I am not salivating to return.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "I come here all the time the service is wonderful kind great\nAtmosphere the food was amazing. Such a great find in Brooklyn and very friendly staff..", "author": "Haleh Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Nice spot! Great entertainment local spot hide away - open mic folk music - very creative environment! Upscale chef food", "author": "Orlando R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "One of my favorite local spots, and a fantastic venue for a relaxed party. \n\nI come here often on weekday evenings for dinner or drinks with friends in the neighborhood. The food is always excellent, and I love the cozy vibe - fireplace and all. (The Persian spiced chicken wings are unbeatable!)\n\nI hosted my birthday party here last weekend, and the owner and staff were wonderful - so helpful, and so welcoming. I brought around 25 people, and there was no problem getting everyone seated and comfortable. We took over several tables, and everyone commented how great the vibe was. \n\nThis place is truly a gem!", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "I've been here twice now for brunch, and haven't encountered any of the service issues other people seem to have. \n\nThe food is good - the saffron pancakes were fine, breakfast pizza was delicious and MASSIVE - and the drinks are a notch above your standard brunch cocktails. And at $5 each, you can have another on top of your meal ($15 set price for coffee/tea, entree and drink) without feeling like you're wasting all your money.\n\nIt's never terribly crowded when we've gone, and like I said, service has always been fine. We've never waited long for our food, and the servers are always friendly. IMO, for around $20pp including tax and tip, it's hard to beat this brunch in the area.", "author": "Kate Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Best brunch in Brooklyn. The eggs benedict was just so good and the drinks are top notch. Amazing staff too....I know where I'm having my brunch tomorrow!", "author": "Jad B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}