{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Delicious food, great and friendly service. Nice atmosphere, small but cozy. Nice artwork on walls.  Nice selection of drinks.", "author": "Isadora A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "I came back to this place for 2nd night in a row and the food taste amazed me again. Pistachio crusted salmon and hanger steak frites are what I tried. Wow, fantastic and unique.\nTony", "author": "Tony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "The very first day I moved to Ny I found myself walking down Hoyt st. in delightful awe of the cuteness of the block we were on. I saw that adorable purple spot and knew I had to check it out. \n\nIt was one of those days where it's 100 degrees and I was literally dripping sweat which is very new for me being from San Francisco. The waitress Rina (love at first sight) immediately brought us a giant jug of ice cold cucumber water told chatted us up a bit and before I knew it she had whipped me up the best (and first) ginger-rita of my life!! I guess the bartender was having some... issues but I think it was a blessing in disguise. oh that ginger-rita!! I think I need one now.", "author": "Mat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "I always like to stop by Bijan's when I'm in the neighborhood. Most of the time they have pretty good deals for food and cocktails. Their persian spiced wings are the best! The staff is really friendly and knowledgeable, they do their best to make you enjoy your time there. Also they have a pretty cool fire place inside which I love to sit next to especially in this weather.. I definitely recommend this place!", "author": "Pajic A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-10", "description": "COCKROACH!\n\nThere was a baby cockroach crawling out of my friend's water glass, that just made this place go from a 4 star to a 1 star.  Made us all sick to our stomachs and doubt everything we ate...didn't help that one of our friends held up the glass to check it out and it crawled on her hand and she threw it on the ground...guess where the little critter went?  Right into the kitchen!  Ick!", "author": "Sheila C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Wow! Amazing! Highly recommended! ~ I'm not one to write reviews, but I MUST say it's truly amazing!!! First, I am a pescatarian, which means I don't eat meat but I do eat seafood and I am always out and about trying different venues. I happen to try out Bijan's restaurant for the first time with a few friends of mine and had the privileged to try the crispy and tender calamari's at Bijan's, not to forget to mention the margherita pizza and onion soup.  Ahhh and a MUST Try is the Bijan's signature drink - vodka with pineapple, mint and cayenne - absolutely delicious!!! The staff are very welcoming, it's cozy and the ambiance is superb. I'll be coming back for more and can't wait to try the seafood stew!", "author": "Marie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "I live in neighborhood and have walked pass this place, but I came here for a friends birthday party. What an awesome place! Bartender, Alex, is amazing. Owners are cool. Food is delicious. Service is good and ambiance is great. No complaints. I will definitely make this a regular spot!", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "This was everything I wanted from my first trip to Brooklyn: hipsters, trendy decor, creative cocktails and incredible food for reasonable prices.\n\nDinner for three was about $80 including tip, and the food was amazing.\n\nOnly downside was the slow service, but the waitress made up for it with a round on the house :)", "author": "Rachel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "What a cool little neighborhood bistro. Its so small that you don't think anything could come out the kitchen that's worth anything. Totally wrong! Some of the best fries I've ever had! The steak was pretty dang good too. \n\nMy  wife had a lamb burger that was out of this world! The lamb was so juicy and the sauce they put on the burger was outstanding. \n\nNothing but good things to say!\n\nWell.... Except for the beer selection. Please get better beer. Henery Weinhard's IPA is AWFUL! At least get a new IPA on tap.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Bijans is a bar I frequent once every few weeks when I finish work and it is without doubt one of my favorites in the neighborhood. They always manage to create a super atmosphere between great music and just a chilled environment no matter who is working. Henry though is our favorite!!A really attentive bar tender with a wicked personality who mixes great drinks..great selection of liquor also... my favorite bar in boerum hill.", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Bijans is probably the most fun, laid back bar in the neighborhood! Henry is always around for the best conversation and will always remember your drink of choice! Read a recent sub par review and was so far from the truth, but I guess that comes from obnoxious patrons who have clearly nothing else to do...all in all a place to go to!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "My friend and I arrived for Sunday brunch at 11:30. We ordered, we had drinks and waited for the food. In fact, every table seemed to be waiting for food. I noticed a large group at the next table was also waiting a long time and finally served, but not all at the same time. An HOUR and FIFTEEN MINUTES  later our food arrived! I ordered the buckwheat pancakes. Not for nuth'n but I've made them at home and eaten them at other restaurants. Usually they are very dense, dark in color, with a nutty flavor. What I got were two bland, fluffy, pale yellow pancakes with no browning and one, in between, with some browning on top - very odd. Not very appetizing to look at; they didn't look like buckwheat, didn't taste like buckwheat and certainly weren't as hearty as buckwheat. We questioned the waitress and she mumbled something about them being mixed with another flour or something. (Wrong...the correct answer would be: they just weren't buckwheat.) My friend ordered scrambled eggs with sourdough toast. Her eggs dish was bland and there wasn't any butter for the one, thin slice of bread or my pancakes, either. This is very simple fare, folks, not exactly gourmet, so it was a real letdown.\nA lot can be forgiven if the food is something special but we would have been better served in a greek diner, for less money and a lot less time. I will give them that the coffee was good but one can go though several cups of coffee, a drink and many glasses of water, with plenty of time left over to wait for bland food. Please tell the owner we won't be back!", "author": "Ed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Came for dinner, and it was delish! Cocktails were interesting, everyone loved their food, good service, nice atmosphere. Brought out of town guests and everyone was blown away.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "Been here twice and the service has been very hit and miss. The spaghetti squash and shrimp was good and they have great cocktails...but when it takes 25 mins to get served and your order is wrong upon arrival? Meh, I won't be coming back.", "author": "Tanya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Came to New York on our annual Christmas trip and wanted to try something new . Found Bijan in Brooklyn and made a reservations. When we arrived the staff  was extremely helpful , specially the owner . He made us feel like home and make sure that we have a nice table . However our biggest surprise was when we got a taste of the food . I must say this was one if the  best meals we've had in a long time and the cocktail was amazing . I recommend anyone to try this place . I would definitely be back in bijan whenever I'm in New York", "author": "Sam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "Very cute and quaint bar that plays good muisc.   They serve food here and just from smell alone, it smelled delicious. \n\nI'm giving 4 stars based off of the ambiance, music, and bartenders. \n\n It was by accident that we visited this place.  We had arrived at Brooklyn Fare's- Chef's Table a little too early and it was freezing out!  One of the ladies that greeted us at Brooklyn Fare's- Chef's table suggested we go hang out at Bijan to stay out of the cold and stay warm.  I'm sooo glad she did!  \n\nThe artwork here is great  and reminds me of that of Jean-Michel Basquiat pieces and after talking to the bartender, he had mentioned that the artist was another bartender there.  \n\nThe bartenders were very nice and attentive.", "author": "Hanh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Magnificent food, good ambience. As an Iranian, I find the fusion, Persian-inspired cuisine very well balanced. Don't miss out on the cocktails too!", "author": "Mani N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Great neighborhood bar that's got a great mix of music, decor, and unique cocktails. The friendly staff and laid back atmosphere make you feel like you've been coming there for years, even if it's your first time. The bartenders/waiters really know the drinks inside and out and have always been helpful in finding something that suits my mood.\n\nPast reviews have pointed out the happy hour special (2 cocktails for $10), so I'll just second that.\n\nOne major perk - this is one of the only late-night dining options in the area, especially on the weekend (kitchen open until 2:00 AM!). I ordered the burger for takeout for a late-night dinner and it was pretty legit.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "Beautiful interior, good vibes, tasty food, lovely cocktails. Had the pleasure of meeting one of the owners tonight and she was so welcoming and gracious. I will definitely be back!!!", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Actually amazing. We had our birthday party here and they were fantastic; Jahan and the rest of the crew were extremely hospitable, the food was amazing, the drinks were SPECTACULAR (the bartender who works most Friday nights is extremely talented and super chill), and the vibe is perfect. Can't recommend it enough and can't wait to come back!", "author": "Johnny L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}