{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "On a few occasions I've ordered the Bijan's burger which was out of this world and i recomend getting the sweet potatoes fries along with it at such a great deal only being 14$ The persian chicken is also an extremely good dish, the chicken was juicy and not over cooked with a side of asparagus wihich was done to perfection. Bijan's also has great selection of beers and wine to go along with your meal but I recommend the persian kiss which is sparkling wine with a splash of pomegranate juice. I totally recommend Bijan's to anyone, the atmosphere is delightful and you can cozy up next to the fire at a great price!", "author": "Bryan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-24", "description": "the happy hour drink selection is NOT for me. both prosecco drinks are way to sweet.  The other drinks are very strong and looked bad too. \nThe eggplant appetizer didn't taste good. the bread that came with it to dip is very hard. \nCalamari was good. Nice flavor as well. \nBut overall I didn't like the place and left early.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "The burgers are awesome!! I like the food and the price is very reasonable. I had their burger and had a drink which they do pretty good as well. If you ever get hungry for lunch check this place out you won't regret it.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Loved the bar. It was small, dark, and eclectic- great unique drinks too. There was live music one of the nights which was my favorite. I've gone another time for dinner and the food was solid. It wasn't the greatest NYC food (high standard there) but I will definitely go again. Service was good. And once again GREAT drinks.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Food is good and very inexpensive; they try to look trendy although they look more like a hole in the wall.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "My son is taking a class in the neighborhood so I was hoping to find a great spot to hang out for my Friday afternoons through June.  From the moment we walked in the door, the bartender made us feel unwelcome.  I liked the decor and the warmth of this place so despite the bartenders curt greeting, my friends and I made ourselves comfortable at a big wooden table. Sadly, our experience here didn't get any better.  During happy hour, when the cocktails were priced 2 for 1, he charged me $10 for a shot of Jameson in hot water and continued to be cold toward our group.  I'll be looking for a new spot to spend my Friday afternoons this spring!", "author": "Sara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "From the ambience, to the service, to the drinks \u0026 food, this has become one if my favorite spots in Brooklyn. The food is AMAZING! Have not had one thing I didn't enjoy. My faves are the burger, the chicken breast, the steak frites, and the truffle mashed potatoes. Henry the bartender is wonderful and make great drinks!! A must go in Brooklyn!!!", "author": "Brandon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "It's cozy, warm and very delicious food. Also there is a fireplace, so for winter time it's definitely gonna be my favorite place", "author": "Kova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "What a great little bar tucked away oh Hoyt. We stopped in for a whiskey before heading to the Chef's Table at Brooklyn Fare and were pleasantly surprised at  their menu. The staff was so much fun and very communicative and they had everything we wanted behind the bar. I hear the lamb burger can't be missed!", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-18", "description": "This is for both delivery and eating in. \n\nWe've been there for brunch before and while the food was good, the service was terrible. We came pretty early and there were only two other tables but service was still extremely slow and inattentive. Waitress kept her back to the place at the bar, not doing anything but chatting to the bartender the entire time and forgot our drinks twice. \n\nWe thought we'd skip the bad service by ordering delivery, especially since the food was good. Every. Single. Time. Our order has taken over an hour and a half to get here (we live about 3 blocks away) and we've had to call to chase the order more than once. Enough. It's really sad because I absolutely love their lamb burger but I can't take the bad service anymore!", "author": "Foodie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Love the atmosphere! Bar stools wobble though. Overall good experience. Had the appetizer basil shrimp with spaghetti squash and the chicken wings and they were both excellent! Bartender was not the friendliest but she did her job. Love the 2 for 1 happy hour special.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "$15 prix fixe brunch with 1 dish, coffee/tea, and cocktail. Tried Persian Omelette and Breakfast Pizza: both were good--liked the pizza better. Omelette comes with unadvertised side of sausage, which was delicious. Coffee tastes like old-school diner coffee.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "I've been to this place a few times. \nLast time I was here I got the onion soup. I thought it was going to have cheese and when I said this they gave me some cheese.\nThey have cucumber flavored water, it was interesting. \nThe ambiance in this place was pretty cool and dark. But it definitely is nice quaint place for a drink.", "author": "Tiffany D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Lamb burger fantastic. Shrimp spaghetti squash delicious. Pulled pork too sweet (got flat bread). Gimme more best cocktail. Bijan good too. Jalapeño Margherita not recommended.", "author": "Ghazi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "I happened to go here last night for drinks with friends, and I must say their cocktails are delish! I had the ginger martini which was super refreshing, and only $5 on their happy hour deal! The bartender couldn't have been nicer or more welcoming.  I would highly recommend this neighborhood bar for post-work drinks and light bites!", "author": "Aarti O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-02", "description": "This restaurant is horrible and no wonder its empty most of the times. Had onion soup (not a French onion!) and flatbread that tasted like a shoe.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-16", "description": "Disclaimer:\nI have mixed feelings about how to write this review because the group I was with experienced a lot of issues this past Sunday during brunch but the owner was so sweet and attentive to us. \n\nBUT - I'm going to have to keep it real. I'm sorry Bijan's!\n\nReview:\nI arrived at Bijan's around 2:30pm and there was only 2 other people in the entire restaurant. I guess their Sunday brunch is not very popular but I can see why.\n\nI asked the waitress for what plates were popular or which plates she would suggest I try. She was very unenthusiastic about helping me which made me slightly annoyed and skeptical about how I would enjoy my meal. I decided to order the steak and eggs with a mimosa ($15 all inclusive brunch).\n\nAs I sat sipping and waiting for the food to come out I realized how uncomfortably warm I was. The AC needed to be on full blast but it wasn't. My legs were sweating and sticking to the chair and I kept trying to fan myself. My friend agreed that it was very warm in there as well. I was not a happy camper.\n\nFinally the food came out, very slowly - one plate a time slowly. As soon as the waitress placed the food on the table my reaction was \"Is this all?\" The portions were so meager! For that long of a wait, you'd think the staff in the back was cooking up a storm. If I thought the portions were small than I could only imagine what the other five men in our group thought. Again, I was not a happy camper.\n\nMy disappointment continued when I had to keep shooing a fly away while I was eating. I also was near half done with my meal when the home fries arrived. It was supposed to be served together with the dish. I wasn't really sure what the hold up was considering we were the only people in the entire restaurant ordering food.\n\nOn top of that, a couple of people's orders came out incorrectly. Eggs with no cheese, missing home fries, etc. The waitress looked slightly embarrassed and kept saying \"We can do the eggs over for you.\" SMH. I don't know if it was just a bad day in the kitchen, but the way the chef allowed the food to leave the kitchen was unacceptable- like he didn't give a shit about what he was doing or who he was serving. Even the owner had to go in the back and reprimand the kitchen staff about how to prepare the meal! [2]  How hard is it to make steak and eggs or pancakes?! \n\nI ate my meal and tried to enjoy it as best as I can. The home fries were dry but still relatively flavorful. I wondered if it was freshly made or warmed up in the microwave though. Also I ordered scrambled eggs but it came out in the shape of an omelet (again, failing to execute an order correctly). The steak was pretty good, although cut it small pieces, it seemed like the meal was prepared for a little kid (I can cut my own meat). Mimosa was decent although there was some pulp from the orange juice.\n\nOverall, I would say based on the meal and service alone I would not come back here. I really wanted to love this place, especially considering its reviews. HOWEVER, and this is a big HOWEVER, this restaurant is black owned and I love to see my fellow people doing their thing! I am going to give this place another try- Especially since the owner was so kind to us and talked us up while we were there. [3]\n\nThe decor is pretty fly as well and I definitely can see why this place would be great to come after work and sip and chat with a few buddies. This place has SO MUCH potential but would do better if it were staffed with employees who are more friendly/upbeat and with a kitchen staff who is concerned about the quality and presentation of the food they serve.\n______________________________\n[1] After we ate, a few of us went to the corner store to order a sandwich, which in my opinion, they seemed to enjoy more than brunch.\n\n[2] Unfortunately we were sitting near the kitchen and heard the whole thing. It was just very uncomfortable.\n\n[3] I'd come back only for the drinks as the food was a disappointment.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Went to Bijan's last week with my girlfriend. She was busy so it was up to me to decide on a place we had not been to for drinks and food. Found this place and the reviews got me excited. Our experience was great. This little but cozy (and nicely decorated) place provided some great service, very creative drinks and some really good food. The place was pretty empty when we got there but was packed when it became time to leave. The ambiance is nice, bar looks very organized and has a good warm character. The combination of small and long wood tables provided a good balance of comfort while maximizing space in a small venue.\n\nFor drinks we had the:\n* Persian Kiss: very good but the pomegranate was a bit too overpowering.\n* Pump up the jam: great drink. The cayenne has a kick that hit you after a few seconds.\n* A gin, cucumber and lime drink that I cant remember the name, but will crave it for the hot summer days. So refreshing and light but with that subtle gin taste. You can also order it with Vodka.\n\nFood was the highlight of the evening. We had the Pistachio Crusted Salmon and the Hanger Steak Frites. Both where fresh, perfectly cooked and tasty as hell. The salmon felt fesh and soft. The truffle mash and vegetables where appropriate and tender. The steak and frites where incredible. As an avid addict of pommel frites, I was amazed when my girlfriend said those where \"the best fries, I've ever had.\" I still think Pomme Frites on St. Marks are still king, but the herb fries from Bijan's are well seasoned, perfectly crispy and lots of them! The steak itself was cooked to a perfect medium term and the meat was tender and seasoned lightly. I could taste the quality of the meat instead of an excess of saltiness.\n\nWe will come again. This place has the charm and friendly staff that we like. There are still many menu items we wanted to try, so Bijan's will surely get a second visit from us.", "author": "Esteban P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "I can't say enough good stuff about this place...it's my favorite neighborhood hang, and I don't even live in the neighborhood! LOVE the Persian-inspired menu...from the wings to the steak to the mezes; I've yet to have a less than stellar meal. And the servers...warm, funny and make everyone feel like a regular. I can't stop coming back; it's well worth the trip!", "author": "Maiysha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "This is a great hang out spot with a real fireplace!  Very good music and chilled crowd.  However, I made a lethal mistake by having dinner with 6 other friends here, and their food was bad period.  My seafood soup was purely disgusting.  Again, it was my mistake.  Stick with the appetizers and drinks.", "author": "Juan J."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}