{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Superb. Came in for brunch and loved everything. Service was excellent, drinks were yummy (get the ginger ice tea!) and the food...heaven. I got the bijan burger which was great and my dad got the lamb burger which I though was even better. However, you can't miss the Persian chicken wings. They are the star of the show. Will definitely make my way here again when I'm in the area.", "author": "maddie s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "Whenever I have a friend in town, we visit Bijan's because the the 2-for-1 cocktail happy hour can't be beat.  The cocktails are original and unique, featuring ingredients like basil and cayenne pepper.  It's got a Brooklyn feel with all of the plants in the window, local art on the walls and the real fireplace.  I've never stayed for dinner but the mezes and flatbreads are really yummy.", "author": "Rachel V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I am so happy this place exists. One of the best happy hours in the area with $5 cocktails (strong), great tapas, tasty lamb burger, and delicious vegetable pizza. Good tunes. Real fireplace. Nice mix of people. My only complaint is the service. Really nice waitress but just simply overworked trying to cover the entire bar herself. We had go to the kitchen and ask the chef for ketchup, poured our own water from the pitcher at the waitress stand, and asked the manager at the front for our check. Throw an extra server into the mix, and Bijan looks more like a 5 star establishment.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "For a laid back cool cocktail place, this is the spot to come to in Boerum Hill. Decor is awesome and very unique. They also have a great happy hour. Cocktails are usually $10 so you get 2 for the price of 1. Keep in mind, it is two for one per person, so you and a friend can't get one cocktail each for $10 total. Still, a good deal. Beer list is pretty good too. They keep a fire going in the winter, which is nice to sit by on these cold winter days. Their food is good too. A huge plus - they are open late which is not the case for most places in the area for when you get the late night food urge.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "A group of my friends and I went to Bijan's for lunch.  We had 3 babies with us, and the waitress was sweet and accommodating.  She helped us find a seat with room for 2 strollers, but wasn't in the way.  The food was great!  I had the salmon and it was delicious!  The service was really great as well.  One of my friends left something at the table and the bus boy actually ran after us to give it to her.  I will definitely return to Bijan for another meal.", "author": "Nadia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "The absolute worst service and food I have ever had. Went there for Sunday brunch yesterday. Waited an hour and a half for a rare hamburger, got served the wrong item, was told it would take another hour and a half by a nasty staff person, our table never received the bread on the menu, my wife's supposed specialty of the house omelet was a burned, tasteless disc. The sweet potato fries were a soggy burned mess, coffee was served to half our table of seven, not the other half, with no milk, sweetner (no artificial sweetner available either!), no spoons (stirred my coffee with a knife when we \"borrowed\" milk from the service station on our own! Brooklyn has so many good restaurants that there is no need to frequent this mess of a place.", "author": "Leon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "Overall just OK, maybe it was an off night for the staff of Bijan. Cold reception by waitress and watered down  jalapeno tequila. Appetizer was basil shrimp and it was alright, but the maim dishes, we had steak and fries and the salmon, left MUCH to be desired. Salty fries and very salty mashed potatoes that had NO truffle as advertised. Bland and overcooked salmon. Steak was fair but not worth the $70 price tag!", "author": "Tene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Food was great and the owner was warm and gracious. I wanted a certain appetizer but it wasn't available so he offered me an alternative. It was different from anything I had ever had but I was enjoying the other dishes more and couldn't finish it. He offered to take it off the tab since I didn't enjoy it as much. I appreciated the gesture which shows he cares about people truly liking the food. Speaking of which, the vegetable grill bread and chicken wings were fantastic! \nAlso, the fireplace adds a cozy feel to the whole space that is perfect on a chilly night. My friend and I hung out there a little longer than we should have but never felt rushed or pressured to leave. Excellent meal and great hospitality!", "author": "Mn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Honestly this has been one of the best meals I have had in a LONG time. I came with several friends and we ordered a little of everything and everyone was very happy. We had the basil shrimp (twice), mixed olives, and calamari for apps. They were all very good for different reasons. The connecting thread is that everything was so well prepared. Our drinks were great (their Gimme More was especially good). I ordered the steak and it was perfectly cooked and the truffle fries that went with them were good. The salads were awesomely fresh and delicious. The staff was friendly, but honestly, even if they cursed me out, the food would have made up for it.", "author": "Carey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "kudos to Alex behind the bar, who was able to stir up a few decent margaritas for me while fending off advances from the creeper on my right. bummed that i wasn't able to try the food - hopefullly, next time.", "author": "Dave N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Great brunch/cocktail deal and some of the best wings in the area. And our waitress (Rena) was awesome!", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Have to admit I'm a fan of unusual cocktails,   The \"Pump Up the Jam\" (whiskey, pumpkin spice, stimulating cayenne with ginger ale) is unusual and interesting.  Now drinking the Gin-X (gin and tonic with elderflower liqueur) while completely enjoying the Lime, Sumac, Rosemary Chicken Breast.", "author": "Bob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Great place to go for a quick lunch or happy hour. I have been here three times and love the laid back atmosphere and the friendly wait staff (especially Henry). The grill breads and wings are great for sharing and paired with the fun cocktails makes for an awesome happy hour.  The burgers are also fabulous. Look forward to trying more menu items.", "author": "Lunny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Want to be on stage? Literally This place gives you those 15 minutes of fame...or maybe more, if you opt for a boozy brunch! I came here with some friends and sat at the table that's on a mini stage by the window...waived at passing admirers...perfect Hollywood fix! ;) For a $15 brunch you get a brunch item, coffee or tea and a drink. Drinks are $5 btw (fancy ones too)! The food was delicious! I had the breakfast pizza and ginger-rita! Definitely heading back there soon", "author": "Sasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Food was outstanding and friendly waitress. The Lamb Burger with Bleu Cheese was flavorable beyond belief, The juices dripping were euphoric.The Margherita Grilled Bread was outstanding. Nothing but aces on this place. I would definitely go back", "author": "Frank K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "I've been wanting to go here for months now, and finally went! The experience was just as I expected, but more! The drinks were delicious! The mojitos hit the spot, and there's an interesting Whiskey drink with ginger or cinammon that had a great kick to it. Great cocktail choices. The drinks were around 10 dollars each. The waitress, Erica, was a lot of help and very sweet. The ambiance is very relaxing and chill. Enjoyed the music as well. They serve food as well, but didn't get a chance to try any. Will be back again... probably this week!", "author": "Tiffani L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-15", "description": "Went here for brunch with my friend who raved about their burgers but as a vegetarian, i was quite disappointed in my veggie breakfast pizza. not enough cheese, not enough veggies, not enough sauce. it was basically like a cardboard crust with some eggs on it. if i went back i would definitely have to try something else. also, they don't have too many options for brunch and not that many veggie options either. We had cocktails (the persian kiss and the bloody mary) which were average. The price is definitely right for brunch at $15 for an entree, a drink and a coffee or tea. I would say check it out but just know that its pretty average for brunch.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "Bijan's may be the coziest tippling hole in the neighborhood with friendly bartenders, well-mixed refreshing cocktails, and a menu of shareable eats that will hold it all down.  There's something so easy and familiar about this place, it'll make you want to stay for hours chatting with your friends.  Groups will find the long picnic tables in the middle convenient, but don't be so loud that you disturb others in this small space.  As a final note, love that it's close to transportation, unlike our other fave happy hour spots on the western end of Atlantic.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "Go for the medicinal cocktails, stay for the laughs with Henry! \n\nI don't go to Brooklyn much, but when I do this is an absolute must!\nI stumbled in, one very hungover morning with a friend, and Henry entertained us for hours.....I don't know how he does it, because he managed to juggle everything from drinks to what must've been a dozen orders in the brunch rush and keep us rolling on the floor with his hilarious stories and quips!\nThe pancakes were also amazing! I don't know what they do with their butter, it's got a lemony herb undertone and is delish!", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "After living in Boerum Hill for nearly three years, I can honestly say I've never been so impressed with an opening of a new bar (and soon to be restaurant, yay!). Bijan's has everything I'm looking for in a bar, including original and chic decor, great music (ranging from down tempo to house and even some retro), normal priced drinks and an awesome staff who are so cool you want to be their friend. My favorite part of Bijan's is the white leather couch / bench / bed that stands on an elevated platform near the back. It's so comfortable and fun to lie on. You feel like you're about to get a psychotherapy session. I'm so glad Bijan's is only a few blocks away from me. I'm afraid it won't be long until this hidden gem becomes a popular place for locals and Brooklynites from all over.", "author": "jennifer d."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}