{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "Disappointed. I came here about two months ago for dinner and although my partner wasn't amused (drinks aren't great and the fried calamari is very tender and thin) I did like the chicken and I decided to order it for pick up. \n\nI was told it would be about 15 minutes on the phone and although I was patient, it actually took a little over half hour. The thing is the website lists the chicken breast as $14  and they charged me $18 plus tax. I wasn't going to say anything, but there were much more lows here than highs so I asked and the bartender asked if I got it off another site. I said no, the Bijans site, but she said they couldn't do anything about. I honestly just wanted to go, but you cannot charge a higher price than what you quote.", "author": "Mariel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Best food I've had in Brooklyn so far. Amazing drinks and food, absolutely loved it!! Definitely coming back.", "author": "Taylor M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Stopped in for happy hour and a bite to eat. They had amazing, reasonably priced cocktails! So fun and great service. The crowd was lively, but not too loud. It was a really cool spot that is a little off the beaten path.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "I would like to start by saying if you go there on a Friday afternoon and you run into the short bartender who has the number 3 chance hat on,  she is amazing hands down. I'm a big fan of Mojitos and I must say her mojito was on point. It's definitely a place I would recommend the food was amazing I had the pistachio salmon the first time having pistachio salmon and I would have it again. I love the service I love the food I love the environment it's a must go nothing wrong with this place but I must say do not try the calamari is sorry they need to either take that off the menu or find another way to finagle those calamari's.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "Awful awful awful! I came here with my 3\n friends food was awful service was awful I ordered the Persian chicken sandwich the chicken was bland and dry the Sweet potato fries were OK the fried calamari was bland the sauce it came with was really oily and greasy my friend Justin orederd the pulled pork flat bread the flat bread was undercooked then my other 2 friends both orederd the lamb burger both of their burger's were undercooked! Not only was the food awful it took them over an hour to bring it the server was rude would ignore us never refilled our drinks this was probably the worst service I went through I've been through terrible service before but this one takes cake I definitely won't be coming here again we only came here after hearing all of these reviews saying how the food is awesome food was terrible I'd rather eat at McDonald's to be honest", "author": "Angel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "I've passed by this place several times late at night and have always thought, \"That looks really cool and I need to go there at some point.\"\n\nFinally made it, and was totally glad I did! The ambiance is great. Wooden tables. Funky art. Fireplace. Tiny performance stage in the corner.\n\nI can't just pick one highlight of the meal, but the cocktails are a strong contender. Basically everything's $10 each. I had a whiskey drink with pumpkin spice in it; it was called - get this - PUMP UP THE JAM. Had to order it just for that name alone. I also had the Bijan-Tini, which was spiced up with cayenne. If you can't tell, I love spicy! Also tried my friend's Frisky Whiskey, which was tasty as all heck.\n\nOur waitress was awesome and helped me choose the chicken breast as my entree. I was worried it'd be dry. But nope, it was juicy and spiced really well. Fall off the bone tender too. Would definitely recommend it.\n\nIf you're in the area and looking for a nice cocktail bar or semi-romantic dinner spot, definitely throw Bijan's on the short list.\n\nThey also play great semi-indie music in the background too!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Awesome food and ambiance, highly recommended! If you try once you'll become a regular! The cocktails are amazing!", "author": "Nasim R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I travel quite a bit to Brooklyn and found this location on yelp and thought I should give it a try. It's a quaint, eclectic location that's equipped with random wooden tables and colorful chairs throughout.\n\nI was greeted immediately at the door and seated at one of the many colorful tables without delay. My drink order (the Peter Piper) was quickly taken and delivered to my table. Service was rather good throughout the entire meal. \n\nI ordered the lime sumac rosemary chicken with mashed and fresh green beans. To say the least, this was the best meal I've had in Brooklyn in a long time. Every part of the meal was absolutely delicious, including the berry cheesecake.\n\nI will definitely go back.", "author": "J W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "strong drinks, really good food, pretty decent prices. the bartender was the sweetest. definitely coming back here", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "Customer service and hospitality... kind of necessary elements for a restaurant. The hostess or owner was so horribly unwelcoming and rude, we didn't even bother.", "author": "Suzanne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Me and a fellow fashion law girlfriend came here to chat about...fashion and law (lol)... around happy hour. \n-The drinks are STRONG. I actually didn't really drink much of mine because I had somewhere to be after (#lightweight4lyfe), but they were good. \n-Mixed drinks are BOGO free. Some wines are 50% off during happy hour. (until 7pm)\n-The place was PACKED. Even though we were taking up a table of 2 and only ordered drinks, the waitress was still very friendly and kept her \"wtf man\" to a minimum without ever hurrying us out the door. For this, I tipped her $6 on a $10ish tab. Thank you, waitress in plaid shirt!\n-The atmosphere is a mix of pretentious-tribeca and hipster-williamsburg. It sort of reminded me of a co-working space for techies except with better-dressed people and better lighting decor. Plus... fireplace! \n\nThis review probably makes me sound like a snob or a yelp elite-wannabe. I'm not, I promise! I WILL be back to Bijan's though.", "author": "Diya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Came here with a friend a few days ago. \n\nI absolutely love the decor and ambiance of this place! The vibe is bohemian rustic garden; great for just hanging out with a friend or a date.\n\nService was good. It was a tad bit slow (there was only one person and they were the bartender AND waitress, so I get it), but we really didn't mind because we were there to chill and unwind, not gulp our food down and run.\n\nDrinks were delicious... and I love that they have a happy hour that starts at noon (don't judge me!) \n\nThe food was delicious as well. My friend had a salad that she really enjoyed and I had the wings which earn a million hundred point emojis. I expected them to be spicy, but they weren't (I like spice, but I'm not complaining about this) and they were also packed with flavor.\n\nTo sum it up, I will definitely be back to Bijan's... I want to try some of the other items on their menu.", "author": "Nichole S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-11", "description": "It started out well, we sat right next to the fireplace, we soon realized that the fireplace was the only source of heat in the building. We were the only ones there so we placed our order. 45 minutes later out came our entree's, our 3 appetizers were completely missed. The place started to pack up and it was so understaffed that people started to leave. Everyone was wearing there jackets The owner brought in his entire family and they were served before everyone else. The service was blamed on the chef. I mean, sure that's fine, but what about only having one waitress and no heat? This is the owners fault. Someone should have told us the heat wasn't working, and since they didn't tell us it wasn't working... I blame it on the owner  being a cheapskate. Oh and the food... ehhh I wouldn't go out of my way to go there on a good day... and I live down the block.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "A great surprising find! \n\nA friend was visiting in town and we needed a place to go. Here were our search criteria: \n- open table seating\n- happy hour specials \n- new American food \n- reasonably priced (he had a good per diem)\n- easy to get to by the 2/3; easy to leave for the B/Q\n\nThis place checked all that off and more. We got a reservation for 6, although there wasn't many sitting at that hour so reservations weren't really needed (although then you'd miss out on OT points). Happy hour were $7 cocktails (they're priced around $10-$12), they have wine and beer specials too and they run till 7 I believe. Both cocktails I got (both gin based) were great. My friend got a different cocktail off their menu and he loved it enough to order it again for round two. \n\nFood came out in a reasonable amount of time. I suspect they have a small kitchen so I'm not sure how fast it'll come out when they're packed. Their food was tasty though. I got he pear and arugula flatbread and my friend got their pulled pork flatbread. His looked better than mine (when I go back, I'm definitely getting that). \n\nTL;DR summary - happy hour is great, lots of seating, foods great too; this place is a find!", "author": "Ikaika R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "I think I found the coziest little restaurant on the cutest little street upon being lost in Brooklyn yesterday (I live in Manhattan). There's a working fireplace and these lovely potted plants and herbs, giving real warmth to the place. I'm pretty sure I had just escaped the city and ended up in a cottage up by the Catskills. \n\nI had the pistachio crusted salmon and honey chili wings. The salmon was fresh and cooked just like it should be. Pistachios are probably the best and most unexpected compliment to salmon. The wings were huge and sauced very well. The bartender was also very friendly and attentive. \n\nIf I could change one thing, it would to be that they opened a location in Manhattan so that I wouldn't have to travel so far.\n\nI came here on a Sunday night, which was a bit too late for their brunch, but saw that there were $5 brunch cocktails. Looks like I'll have to come back and hopefully not get lost the next time.", "author": "Athena H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Loved everything about this place!  It's one of those comfortable, wear anything, little late night places. It would be just as good for a romantic little date night as it would for a celebration dinner with 10 of your best friends.  The space almost feels like you are sitting outside in a really awesome backyard and the food was sublime.  Ordered the chicken with truffle mash and while I normally have leftovers to last 2 more meals, when I got my plate my fork went on autopilot and I couldn't put it down!  The waitress was sweet and the drinks were yummy - what more can you ask for when looking for a late dinner spot following a Passenger concert at the Roulette.", "author": "Syl S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "I hesitate to give one-star reviews, but I had the worst service ever this past Sunday brunch. Even though we waved and made eye contact with the waiter several times, he still took over half an hour to come take our order. I didn't have a water at my spot, so I asked him for one. When he eventually came over with our drinks, I asked for it again (it's just a water, doesn't take that long?). He glared at me and said, \"it's coming!\" Overall, it took over an hour to get our food and we had to ask several times to get a coffee refill. Very weird service.\n\nI would have given Bijan's two stars because it's not the cook's fault if the waiter is no good, but the Persian omelette was pretty mediocre, lacking flavor. It seems like they're better for dinner.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "This place is small but not uncomfortable. A reservation is not a bad idea.\n\nThe food is delicious and the plating is beautiful. I generally don't notice plating, but it was so good that I couldn't help but notice it. \n\nI got the lamb burger with feta. There was a little too much feta but I scraped some off and actually put it on my fries. The burger was perfectly cooked. My companions all enjoyed their meals. Two of us described the food as wonderful.\n\nThere was a silent film playing on the wall in front of our table so in addition to a great meal, we also had some unexpected entertainment.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "Bijan's in a Persian inspired restaurant in Brooklyn. The decor is eclectic and stays true to the Persian theme. They have a large cocktail menu and a beautiful bar. This restaurant is nice for dates or a group of 3-4 people. \nFood: \nI've been to Bijan's twice, once for brunch and again for dinner. The brunch menu was quite good, they offered a special that included a drink, coffee/tea and brunch entree for $17 price. I had a Gingerita and it was amazing! very refreshing and just the perfect amount of ginger. For my entree I had a Persian Omelette without bacon. The dates were an unusual but delightful addition and the portion sizes were filling. \nWhen I returned for dinner I had ordered a vegetable pizza, but the server placed an order for a Margherita pizza, she offered to have it remade but I was starving so I stayed with it. The flatbread crust was burned and the cheese was a bit dry. I was not a huge fan. My companions ordered the Rosemary Lime Sumac Chicken. They loved it and ate every last bite. \n\nService:\nThe reason I gave Bijan's only 3 stars was for the service. Our dinner waitress was nice but seemed a little distracted and forgot about us several times. She forgot to place our order in the kitchen so we waited about an hour before after ordering to eat, and she put in the wrong order for me. A group of regulars or maybe her friends were at the bar so she spent most of her time socializing with them. I love a restaurant that has a great local vibe and staff that are friendly, but forgetting to place our order so you can socialize is unprofessional. We waited another 30 minutes after eating before we could get the check. This bugged me less because I like to socialize with my friends after eating, but it took several attempts to get her to come by and deliver the check. \n\nThe poor dinner experience combined with the lovely brunch puts this place at 3 stars, just A-OK.", "author": "Christen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Great neighborhood spot.  Love the wings and calamari.  Pulled pork is good too.  Nice cocktails and good beer and wine selection too.", "author": "Alison J."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}