{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-07", "description": "Had a mediocre first visit. Met a friend there for drinks on a Sunday and it was cash only, which wasn't clear to us when we first arrived/ordered. I had checked the website and Yelp to ensure that they accepted credit cards so it was a big surprise when they didn't. \n\nIf you want to be a cash-only establishment, that is totally fine, but you should be really upfront/clear about it.\n\nIn the end, I had to run outside to an ATM and then only had the cash for one round, so we moved on to Grand Army down the street. Much better!", "author": "Naomi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "This is a super cute Persian fusion restaurant in downtown Brooklyn! What a treat for my fellow Persian bff and I! We really enjoyed the Bandari spice calamari and the sumac rosemary chicken. We also sipped on several refreshing rosewater cocktails. Deeeelicious! The owners are so warm and hospitable. Also, the decor alone is worthy of five stars. The owner, Sepideh, is an extremely talented artist and has several lovely pieces on display. We will be back for sure!", "author": "Sara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "1 star for poor service and tasteless food. The place claims to be Persian, but was very bland and plain. It didn't taste bad, but this review is primarily due to the service. \n\nAfter waiting an hour for our food during lunch, the waitress finally noticed we were sitting without our lunch still (only 2 other tables were filled) and went to the kitchen where the cooks hadn't even received our orders yet, and when we finally got our food, the sandwich was small for the price and the waitress was inattentive to our table when we asked for ketchup and the cooks were actually more helpful to us than she was and brought us extra sauces. \n\nOn our bill, there was an extra charge for protein that wasn't listed on the menu and the waitress claimed the price was listed (it wasn't) and made it seem like she was doing us a favor by removing the extra charge that wasn't even listed. To get the bill was another arduous task as she was on her personal phone and chatting.\n\n In the end we didn't tip, which we've never done, but thought this experience deserved it and the waitress ran out at us on the street and told us to never come back (of course we wouldn't...) Very ridiculous after the long wait and poor service, the most attentive she was for our table was to pick up the bill and check for her tip.", "author": "Zoe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "I came here for brunch this afternoon! Such a lovely low key place. The ladies there have such beautiful souls! I had simple steak and eggs, and it was cooked to perfection! \n\nLastly I had the.. Gingerita I think it was. Could have made that name up. Absolutely delicious. Actually the drink menu looked like all drinks were specially crafted.   \n\nApparently, they have an open mic on Tuesdays. So I look forward to that.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "I will preface this review by saying we had horrible service by a horrible waiter, Ali, who got mad at us for being mad. Never going again. \n\nWe arrived around 430 pm looking for food and walked into an almost empty restaurant and Ali told us it was brunch service only - the website says brunch til 4pm, and even though we wanted dinner food as an option we decided to stay. We stood around and weren't even seated so we took a seat ourselves. We saw people getting seated after us get dinner menus. \n\nWhen we placed our order the waitress couldn't even keep the order straight. We ordered a steak salad and steak and eggs, not steak salad and steak and egg salad. She claimed to not know the menu since she was filling in for someone- filling in my ass, if you work in a restaurant the menu is the most important thing you should know, the menu is your job!!!! My friend wanted fries instead of the home fries and Ali said it would absolutely be done, her order came out wrong. We asked for salt and pepper and hot sauce and she brought out ketchup and hot sauce. My friend and I kept looking at each other like is she for real?! We were hungry and didn't complain, however she should have noticed that the order came out wrong and addressed it herself. \n\nTo top it all off when we got the check ali saw me starting to pull out my card and she just shouted across at me that they only take cash during brunch. Ok...no one told us, it doesn't say it anywhere on the menu or the brunch sign outside, and neither of us have cash. We bring this up to her and she doesn't even apologize and starts by saying oh is this your first time here? Regardless of it was or not that fact should be stated before placing an order! She then blames it on us for seating ourselves so she didn't get the chance to tell us it's cash only. How about when you came to take our order?! \n\nBoth of us having worked in food service could also see she never rang up the order correctly and she blamed the fries on the kitchen. She literally couldn't take any responsibility or just say sorry. She got mad at us and yelled \"oh I see what you're giving me here and I'm not giving it back!\" Finger pointing and attitude all there. She also brought food out for another table to three different tables before giving it to the right person (only 3 tables were seated and one hadn't ordered yet and we just ordered 30 seconds ago) and two people tried to take our orders. She also spilled water all over a table and over some guys lap. No one at this restaurant takes responsibility for anything and it's completely unorganized. It's a cute place so it's a shame it's being operated by crappy employees. \n\nAlso brunch may be $17, but if you order anything besides the wings and a pile of lettuce there's a $5 additional charge so it's not even a deal at all. We were also told that brunch is cash only to keep costs low- makes no sense if there's an up charge for everything. Food was just ok, steaks weren't cooked medium, drinks had hardly any alcohol.", "author": "Cathy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Came for lunch with hubby and 1 year old in tow. We enjoyed the wings and the lamb burger. The pizza that our neighbors got looked good, as well! Service was adequate but not friendly. Wish that they had napkins other than cocktail napkins - they're a full service restaurant so I don't understand the tiny, flimsy napkins.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "After giving another chance to the lamb burger at Bijan's I must upgrade my review. The burger was perfectly cooked this time around, and was really delicious.  It has a beautiful smoky flavor to it, and the fries were as good as ever.  I love the pickle and the red onion, and they even grill the brioche bun.  The décor was actually great upon closer inspection.  I think it is post mod gallery they exhibit, though I am clueless when it comes to art.\n\nEven though I am a very private individual, I want to open up why perhaps my first review reflected disappointment.  I believe it is because of the coworker who I went to lunch with on the day of the review.  He is a total ass.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Wings were delicious, service was fast, and I got a fantastic vodka drink with cayenne pepper. Loved the atmosphere. Would go again", "author": "Casandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Came here one day after working out. They had a great selection of healthy food options. The spaghetti squash with shrimp was sooooooo good. Definitely a must get. Our server (ARIELLA) was so great and made the pizza we ordered half vegan and did I mention that she went next door to get me almond milk. AMAZING !!!! go for the food and stay for the service", "author": "Khoi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Literally one of the best places to go for brunch. I had the lamb burger with fries and calamari and it was so tasty and good. The service was great and I will definitely be making a stop back here the next time I come to Brooklyn", "author": "Miles H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Such a cute place with a great atmosphere. Me and a friend had brunch here and enjoyed it!  Awesome cocktails, especially the signature drink \"Bijan\".  My friend had the eggs Benedict and she gave it two thumbs up. I had the steak and eggs. Steak was pretty good, cooked medium and flavor was mouth watering. The eggs however weren't cooked over medium but they were rather cooked hard and dried out! For that reason it's only 4 stars. Service was pretty good too. Can't wait to go back.", "author": "Anissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Was there last night (Saturday), it was such a charming, warm, and intimate bar without feeling cramped. I loved the Moroccan lanterns and the reclaimed wood tables! Perfect for a date...music not overly loud, dimly lit, and relaxed. Bartender was friendly and attentive, drinks were delicious. I'd definitely go back and try the food.", "author": "Lisette R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-30", "description": "And it's time to downgrade my previous review.\n\nI've now come to this restaurant 3 times, once for dinner on a Friday evening, once for drinks and dessert late on a Saturday night and once for lunch on a Monday afternoon. The service has been consistently terrible every time (though the server has been different each time). \n\nThe Monday afternoon lunch was the final straw. The restaurant was fairly empty with maybe a handful of other patrons around. There was a hostess, a waitress and a bartender none of which paid much attention to my husband and I. The waitress disappeared at some point and didn't return so I guess her shift was over. After quite a bit of time the bartender took our order. I ordered the crack soup which gives you the option of chicken broth or spicy broth and choice of meat. I had ordered regular chicken broth with no meat. \n\nA ridiculous amount of time passed. My husband got his burger. No new people came into the restaurant. Some more time passed. I finally got my soup. It was with spicy broth and chicken. Two things wrong with this simple order!\n\nAnother 5-7 minutes passed before I could get the attention of the bartender. His back was always turned to the room. Maybe he was printing receipts on the computer or something but that's just poor placement of the computer then. Check up on your tables once in awhile!\n\nI finally got his attention and told him what was wrong with the order. He seemed just as annoyed with the kitchen as I was and took the soup back. Another ridiculous amount of time passed. My husband was long done with his lunch. I finally got my soup and ate it. This is the most disappointing part about this restaurant. I actually like their food!\n\nWe got the check and noticed that my $2 tea was comped. That's a nice gesture but unfortunately not enough to compensate for the 2 hour long lunch which should have taken maybe 40 minutes. I can't imagine how frustrated I would have been with the experience had I actually had to go somewhere after lunch, like back to work!\n\nThree strikes and you're out. Sorry Bijan, wish you were better.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I took my girlfriend here for a birthday dinner. We loved the wings, and shrimp appetizer. The waiter was very good, drinks from the bar were great. Very nice restaurant I will visit again.", "author": "Gerald A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "Decided to give this place another chance. Unfortunately I came during lunch time and I really wanted to try the Salmon. So I decided to go with the Spice Chicken Sandwich and Calamari as an appetizer. The calamari was nasty and the chicken was HARD. Why is it that the CHICKEN IS ALWAYS SO HARD? It felt like eating a rock! This is my second complaint about the chicken being hard. The wait for the food is annoying. I also requested a seat by the Windows but the Polish waitress said supposedly it was reserved. I was in the restaurant for an hour and 30 minutes and the restaurant was DEAD. \n\nI DO NOT RECOMMEND THIS PLACE AT ALL. This was my last time here. Goodbye \u0026 farewell.", "author": "Jasmine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Lovely environment, delicious and perfectly cooked Persian food and sweet and beautiful hostess. Definitely coming back.", "author": "Elham Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "This is my version of cheers, where everybody knows my name and they are always glad I came! Henry has been my go to man for over 2 yrs now and he is just the best. Don't get me wrong, all of the bartenders are amazing, but Henry will always have a soft spot in my heart.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Awesome place with lovely food, drinks and staff. I couldn't be happier with my brunch. They have a special brunch for $17 including a specialty cocktail which was so dreamy. The fireplace was also great mood booster. Go and have a perfect food in a warm cozy place on this cold gloomy winter!", "author": "Naz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Bijan's is a lovely, unassuming cocktail bar-cum-cafe in a pretty unassuming and unexpected part of Downtown Brooklyn. It was a birthday drinks and more stop for us after a group archery session at Hidden Gem a few blocks away.\n\nThe place was funky and hip, but in that totally acceptable New Brooklyn way. There's art all around, exposed brick walls, and a fireplace to cap it all off. It was the weekend of the big snowstorm, which probably kept a lot of folks home, but that SUnday night was nice and mellow. Only a couple of other tables were occupied in the early evening, and a large table was already set up for us.\n\nCocktails were spot on, and all flat priced at $10. I tried the Bijan's--vodka with pineapple, mint, elderflower, and cayenne, a delicious elixir full of nice contrasts. Alas, a cocktail is a short-lived beverage, so I switched to beer thereafter (there's a few nice ones to pick). The food was also way above average. We started with some very tasty dips (the place has Iranian roots, after all). Then I moved on to a lamb burger with sweet potato fries (good carbs and whatnot!), both delicious. Others seemed please with the regular burger and other treats.\n\nEveryone was thrilled with the place, and I have Yelp and a squadron of savvy Brooklyn Yelpers to thank for it. Hope to be back sometime, this place is really wonderful.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "The chicken wings are to die for!  The food is homemade and everything is fresh. Love love love!!! Must try the eggplant appetizer, kebab and don't miss out on the stew! Absolutely everything on the menu is on point!", "author": "Katherine S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}