{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Solid brunch spot. Bijan's offers a $17 all-inclusive brunch, which consists of coffee or tea, 1 cocktail, and an entree. Pretty good  deal.\n\nPortions are large. In my last visit, I had the Persian Wings \u0026 Salad, and I was pleasantly surprised that half of my plate was wings! The Bijan burger patty is thick, juicy and it comes with truffle fries. The fries were a little too soft for my liking, but that wasn't a problem. If you want to add cheese (blue, feta, cheddar) to your burger, it'll cost an additional $1.50.\n\nMy favorite part of eating here is sitting by the fireplace. It is so warm and cozy, especially when it's freezing outside. Try to get a seat next to the fireplace, if possible. It'll make your brunch experience that much better.\n\nLastly a note on their service: I think the service here was both professional and attentive! They did rush us a bit towards the end, even though the restaurant had lots of empty tables. Besides that, we were very happy with their service! Not sure what the one star reviews were complaining about.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "An awesome mix of authentic/traditional Persian dishes and more contemporary Persian-American. Owned and managed by a nice Iranian couple - the wife often makes the delicious stew specials.\n\nCasual spot with tables and picnic seating and a \"hip\" Brooklyn vibe. Great cocktails as well.", "author": "Seth W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "The customer service here is absolute garbage. The service has gotten progressively worse the last 3 times I've gone here with my partner. Being seated and then waiting 45 minutes for a glass of water is insane (especially when there are only 12 other customers in the restaurant). If you take an order incorrectly and serve someone the wrong dish, the least you could do is apologise. It's a shame that the attitude from the servers is so apathetic, because the food is actually really good. We won't be spending anymore money here.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-07", "description": "It was disappointing, The flat bread pizza was terrible, the finely minced vegetable toppings tasted as if they were thawed from being frozen, the bread did not taste fresh, it is what I would expect served in an airplane for a pizza. Some of the other dishes were just ok. When the bill arrived we felt that overpriced for the quality level of food and service. We won't be returning to this place.", "author": "Hello T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Super tasty Mediterranean inspired eats.  Great live music.  Cute spot on Hoyt St worth a look", "author": "Arama K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-14", "description": "If you want to hear about the drugs that the bartender has done, the entire bottle of Hennessy that he drank the night before, and how much he hates working at this bar then this is a great place to be. \n\nWe walked in after an event at Barclays and asked what kind of bourbon this supposed cocktail bar (and the best in downtown BK according to Yelp) and had and the bartender point to a badly organized shelf and then sigh his way through making our poorly made old fashioneds, which are featured on the menu. \n\nThe place has potential but we left before we even finished our drinks because our bartender's attitude was simply just that miserable. \n\nNote to the owners - your Saturday night bartender has a shit attitude about life in general and is probably chasing people away from your business. Send him off to dive bar purgatory, he is hurting your bottom line.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "They have great food and great cocktails. I mean Bijan! Bijan is must-try. I liked it so much. I liked the table by the window and behind the fireplace. Salmon was good and white flatbread as well. My friend tried the burger at lunch time and she really enjoyed the tender meat. And they even have a happy hour until 7pm.", "author": "Jinhee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Great Christmas eve last night with BFF !  @bijansbrooklyn  #greatfood #greatdrink #music #wine #beer #fireplace #ambiance #BFF ask for Jahan or Sepida the owners, great people.  American/Mediterranean food.  Highly Recommended! Had the Persian stew amazing flavors, with great tap beers. They have great mediterranean appetizers also. My friend had the shishkebob another deliciuos dish. I have also had the lamb burger, and the mixed beef burger more winners!  Good wine list, had a bordeaux last night after dinner and a Pilnser beer with dinner.  The fireplace was kept burnng, nice music in the backround. Sports over the bar tv's and old movies (Charlie Chaplin) in the dining room.  This is my favorite place to relax and enjoy my food ,drink and friends!  Highly recommended!", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Yelp recommendation strikes again on a great spot! I made a reservation here for brunch at 11am on a Sunday. We had somewhere to be early afternoon and didn't want to risk being late. We walked in right at 11 and the place was empty - only the workers were there. We were told the kitchen wasn't open yet and were a little confused. Were told to come back in 10-15 so took a lap around the block. Once we got back we were good to go and had our choice of seats so we took a cute little elevated table by the window. I opted for the spinach omelette which was absolutely delicious! Only thing it could've used was a tad more cheddar. It came with a side salad and AMAZING fries. I thought I was getting home fries, but nope, even better. I also got the Bijan cocktail which was really yummy. We were the only people in there until around noon when it started to fill up (just to get a feel of when to go). Would love to come back here for dinner! PS - the music here is ON POINT - MJ, Janet, etc.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "3rd time I've been to Bijan's and always have a good time. The staff is friendly and somewhat attentive (small staff = overwhelmed if restaurant is full) this particular occasion my friend had to ask twice for another drink before it was brought to the table.\nThe atmosphere is warm and inviting low lights make it an intimate dinner experience.\nI had the steak Frits and it was delicious my friend had the turkey burger and she was pleased with the over all taste. I had my drink of choice which is a jalapeño margarita which tasted more like a sweet mojito so that was why the 4 stars instead of 5 I like my jalapeño Margarita to be spicy.\nI'll be back, the meal alone has be coming back for more.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Was here again the other night. Food and drinks still amazing. I was so pleased to see Henry was still here. It was like running into an old friend. Can't wait to come back Saturday night!", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "The only thing this place has going for is the decor. Food is mediocre and there's nothing Persian about it. Service completely absent minded. I ended up there after every of a brunch place in the neighborhood was super packed and Bijan's was mostly empty.   Now I know why. The coffee is either burnt or cold....", "author": "Marc A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "A fabulous restaurant- the best in Brooklyn! The owners are amazing and attentive and the Persian cuisine melts in your mouth. Try the beef stew (ghemegh) and soup (ash) - the environment is also amazing - Charlie Chaplin films and a cozy fireplace.", "author": "Peter E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "This is a great place. anyone that comes here and all this food especially good chicken wings will be surprised. The drinks are red treats that you will only find in exclusive areas. The atmosphere is very unique and the service is no less than greatness", "author": "Razni A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Very cute interior. Cocktails were good, food was just ok. It was an interesting menu but fell short on execution.", "author": "Justine H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Horrible service. Flatbread pizza was undercooked and was by far the worst pizza I have had, anywhere in my life. If you want a good veggie burger, this place is not for you. This restaurant is for you, if you like bad service, over-priced bar food made by people that care less about it, and you enjoy your clothing and hair smelling like smoke afterwards.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Great good, great accommodating staff, and awesome ambiance- everything from the garden lanterns to the Charlie Chaplan playing on the projector screen. A great place to hang and have a few quiet drinks. The music is nice (top 40) without being overwhelming. Really enjoyed all the food and drinks! Delicious", "author": "Shroff R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Super good Yelp recco.  Lovely people, serving very fresh \u0026 flavorful food.   Kitchen open until 11pm.  Saved a west coast late Sunday traveler realizing, \"I'm famished.\"   Ended up w/ a perfectly cooked meal.  Thanks Bijan's.", "author": "kate l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "Major downfall from last visit. Rude bartender. Staff arguing in plain sight. Not a good look of professionalism at all.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "I work in the neighborhood and have been here twice the place is good for the neighborhood. The service has been awful both the times I have been here. Usually just have one server who is handling the bar as well the food. The service is very very slow. The food is alright nothing out of the ordinary. Probably I good place for a few drinks. The ambiance is nice so it's not bad for a few drinks with friends.", "author": "Megha G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}