{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Oh. My. Gosh.  The food... The drinks... topped off by the comfortable, casual, hip atmosphere.  I am still savoring the basil shrimp, the sumac chicken with truffle mashed potatoes, and the Gimme More Vodka cucumber deliciousness.  I could easily eat here every night and never tire of it...", "author": "amanda y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Really great place in the heart of downtown Brooklyn, Bijan's somehow is able to straddle the nearly invisible line between great food and can't-be-beat Brooklyn prices. The cocktails in particular are stupendous, with a seven hour HH that is somehow longer than the the \"regular priced\" drinks. I also really like that all of the bartenders are very chill, relatable people, who can be themselves and still make a great drink. Get the chicken wings and the Lamb burger!!!!", "author": "Robert G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Great little spot in Brooklyn if you are a local or visitor wanting that local connection. Very chill environment. They had great decor with local art work on the wall (the bartender was actually the artist). Menu had a nice variety. I had the baked chicken with a side salad instead of the mashed potatoes and it was excellent. Juicy and flavorful! I had their signature cocktail called the Bijan...great if you want a vodka drink with a kick! Will definitely be back!", "author": "Erika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Throughly enjoyed this restaurant. Initially greeted by a pleasant host and waitress this restaurants menu is very appealing. I had the Bijian burger. My wife has the flatbread. As we left the owner exchanged pleasantries with us and seemed to genuinely care about our experience with his restaurant. Good people, good food, reasonable prices. We will go back.", "author": "Lloyd T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "My favorite thing about this place was the great atmosphere! Definitely has a European feel. Great music on and it looked like a live band was setting up when we left. Happy hour is decent, and we got a couple mezes which were super overpriced. $6 for a few slices of pita and a miniscule dollop of dip? No thanks. I'd come back for happy hour only , not to eat.", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Bijan's is one of those places where everything just works. The bartenders are attentive and splendid conversationalists; the service staff are keen and friendly; the food is intriguing and tasty. It doubles as a great neighborhood bar and an exceptional restaurant. I would recommend this place to anyone in the neighborhood.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-16", "description": "I've only sampled some of the food, and I've only been to this place on weekdays before 8pm, so... limited experience.... but I can comfortably say this place overall is at least a 4 star establishment.\n\n\"Then why the extra star Jake?\" Good question you! The fifth star is for the happy hour... This place has above average to well-above average cocktails, and at $10 a piece, one might even say they're 'reasonably priced' in this mixed up world where $10 for a cocktail at the nexus of downtown brooklyn, cobble hill, and ft. greene (?) counts as 'reasonable'. BUT during happy hour (before 7pm) they're 2 for 1.... so quick math... carry the 2.... $5 cocktails!\n\nAdditionally, the ambiance is pleasant, the wings were pretty great, and the staff is exceedingly friendly... like friendly to the point where you can order 4 happy hour cocktails for 2 people between 6:55 and 7:05 and they won't bat an eyelash (yes. that IS an expression) or call you cheap (at least not to your face!!).", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "The Bijan burger was delicious as were the fries.  The steak frites was a great cut of meat, cooked very well, with great flavors.  The ambiance and music was very enjoyable, still allowing great conversation.  Highly recommend!", "author": "Anna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "The first time we came to Bijan's was to have a drink while we waited for a table for dinner at a place nearby.  As soon as we walked in we were greeted by a very nice bartender.  My buddy and I chose to have a beer from their decent list of seasonal draft beers.  Our dates wanted to try one of the unique cocktails that they offer.  Most had an ingredient they weren't sure about and the bartender kindly explained what the ingredient was and what its purpose was for the concoction.  He also said if they didn't see anything they wanted on the menu that they could tell him what they were in the mood for and what they typically like in a drink and he would make them something that wasn't on the menu.  Of course they opted for a custom cocktail.  Both loved what he whipped up for them.  \n\nSince then we have gone back several times.  It is much more crowded  than it was then.  And they have also started to serve food (not sure when that started, just know they didn't do it in the beginning).  However we have always still had the same great service we received on our first visit.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Amazing food and Henry makes even better drinks. So sweet funny and attentive to everyone's needs he really made me feel at home and like I've known him for quite sometime. I plan on having my birthday dinner here in January  so long as the rude long haired waitress won't be working that night", "author": "Abby L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "This place is really cute.  Went there on a Friday night with 3 people - really easy to get a table.  The ambience is eclectic, casual, comfortable.\n\nWhat We Ordered:\n- Wings - really dang good - lots of flavor and mildly spicy\n- Grill bread - definitely a skip next time - the bread itself was just sort of there (needed to rise more and be crispier)\n- Lemon Rosemary Chicken - this was amazing, great presentation and really tasty - just as good as a really nice restaurant.  Chicken was moderately sized which I appreciated having a few apps and not wanting to be overfull.\n- Drinks - I had 3 Red Hot Pumps and they were really tasty and quite strong (I was very tipsy after 3 of them!)\n- Complimentary Chips - these were surprisingly good, homemade, very peppery.\n\nDefinitely coming back here!", "author": "Megan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "I absolutely love this place ! It's a hidden jewel in downtown Brookyn.. Great food , Cozy atmosphere \"has a fireplace\",  love the service, music, and bartenders ! Worth checking out", "author": "Tamyko V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "300th review, ladies and gentlemen... here it is:\n\nI came with a small group for dinner, which we were immediately seated for. They brought out some crispy homemade potato chips.\n\nFor dinner, we had an assortment of entrees. I had the salmon with a pistachio crust and truffle mashed potatoes. Also at the table was a steak, pulled pork sandwich, and roasted chicken. All were delicious, but I can mostly speak for the salmon. Our server was really sweet and said that people came from out of town just to have the salmon. I'm not sure that I would, but it was definitely tasty.\n\nService was wonderful, and although we did not order small plates it seems like a place where you could go and have a few meze shared between a group.", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Ahhhh Bijans..... The first bar I visited on my move from Australia to New York. This place is filled with the most lovely and interesting people....... friends for life!!! The food - 9/10 and I am picky with my food. If you are after a chilled day or night with some great food and drinks, you will struggle to find a better place in my opinion.", "author": "Amardeep H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "I love the ambiance at Bijan, especially the wood burning fireplace.  I also like the tables, the bar, and the lighting. Unfortunately, I thought the food was only average, especially when entrees are mostly in the 15-20 range.  \n\nI had an enjoyable evening here, but I think next time I would come for cocktails (which are inventive and only 10 dollars) and snacks rather than a dinner.  I had the salmon, and while it was OK, it just wasn't great or worth the 18 dollars I paid for it.  \n\nSo I would say Bijan is 4 stars for booze but 3 for eating.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Love the good and the drinks! Happy hour great deal till 7pm (2 for 1 cocktails). Calamari with awesome curry sauce. Had Lamb burger and truffle fries! You can never flog wrong with truffle fries!!", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "Bijans was delcious. Came here before seeing the Nutcracker at BAM. We took advantage of happy hour (2 fancy cocktails for $10!). The drinks were great. We had the calamari which were crispy and fried beautifully. We also had the smoked eggplant dish which wasn't my fave, but for our entree we split the stake and frittes, it was amazing. Our waitress was lovely and I was very impressed - she was the only one working the small space, but she did a phenomenal job. Def worth a trip!", "author": "Loren A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "I came with a group of 8 on a random Wednesday. The food is pretty good but I think I was expecting something a little different from \"Persian Inspired Fare\". I mean...I had a pulled pork sandwich with truffle fries for an entree (it was delightful.) We had a few apps including the calamari which I found to be pretty bland but the sauce was great. \n\nIn all honesty - the food and the ambiance deserves a 4 but I was so annoyed with the service that I took away a star. I'm not one to complain about service because I know just how hard restaurant life can be but the restaurant was not busy AT ALL and our server was extremely inattentive probably because it was already a guaranteed tip... Someone asked for a suggestion on entrees and she basically stared at them with a blank face before shrugging her shoulders and saying \"it's OK...\". That was a ringing endorsement if I've ever heard one. We would ask for another round of drinks and she would come back 15-20 minutes later and ask if she could get us anything without bringing anything that we had already asked for to the table. It was a dinner with colleagues so it's not like anyone was wasted and she didn't want to serve us more alcohol - she just literally forgot that we asked for more wine or another cocktail.\n\nDefinitely on my list of places not to visit again unfortunately.", "author": "Whitley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "I have eaten at Bijan's many times and tried almost all the food on the menu and have never been disappointed.  It's hard for me to pick one favorite dish only but I would recommend you to try their PERSIAN SPICED CHICKEN WINGS and GOLDEN SEAFOOD STEW. And if you save room for dessert, try their homemade tiramisu, the best!\nAnd if you live in Manhattan, it is easy to get there, the restaurant is just a few blocks from the station. \nSo if you would like to enjoy a cozy restaurant, reasonable prices, and a staff that always makes you feel welcomed, try Bijan's", "author": "M M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-01", "description": "We stopped in for Saturday brunch while walking by and I'm glad I did!\n\nThey were out of the lamb burger so I opted for the short rib burger instead. AMAZING! They nailed medium-rare when 5-star restaurants don't get it right! The omelets are more like frittatas and can lean towards the over-cooked side. \n\nA $15 prix fix brunch comes with a \"medicinal\" cocktail , coffee and entree. The cocktails are HELLA GOOD and strong. The coffee is curiously delicious that reminded me of what I had in Paris. \n\nUPDATE-\nI've been here for lunch a few times and I have to remove a star for slow service. To their defense, there seems to be only one waitress for lunch service and she tends the bar too.", "author": "I E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}