{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Really liked this place! Really good for a dinner with friends or date since it has nice atmosphere, convenient location on hoyt street, (right in the hub of Brooklyn by dekalb market and court st) and great mediterranean food. I have a high standard for mediterranean as it is my favorite cuisine but this place really nailed it for me. I like that is has a new/American take on the classics. I got rosemary chicken which came with green beans and mashed potatoes. The chicken was so flavorful and perfectly cooked - crisp on the outside and moist inside. The mashed potatoes were so good I had to scrape the plate clean and the green beans were well seasoned. Besides that they've got some great cocktail options and when we came it was happy hr so they were only like $7! Really happy I stumbled upon this place.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "I came here for dinner and ordered the pappardelle pasta with shrimp. Food was delicious, and serving size was large. It was enough for two meals. There was plenty of shrimp and a surprising amount of veggies. The heirloom tomatoes and string beans really made the meal. They added so much flavor and texture to the meal. My one complaint would be that the meal was a bit oily and I felt heavy after eating it. \n\nTo drink, I had an Old Fashioned. It was strong and smooth, well made. \n\nService was slow. There seemed to be only one waitress, and although she was aided by the hostess and busboy, she was a bit slow in taking orders and checking on refills. In addition, it took a long time for our meals to come out, about 45 minutes after ordering. \n\nOn a side note, beware the front door! It was a struggle for me to open the front door. I pulled and pulled and there was no one on the other side to help me. I think the storm door creates a suction. After a few attempts, I was able to pull the front door open, but the metal strip at the bottom went straight into my big toe. I was wearing leather boots and the strip went straight through the leather, causing a hole. And it was so painful I thought I was bleeding. Luckily, no blood, but my toe was numb/ throbbing for hours. The hostess gave a quick, \"That was weird,\" but didn't say anything further. When my friend arrived a few minutes after me, she also had an extremely difficult time with the door. And again, no one was around to provide assistance. Bijan, please fix your front door, or have someone at the door to assist customers.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Went for a casual dinner at the bar and had a very pleasant experience. Friendly atmosphere, good wine, and the Sumac Chicken was excellent. Will certainly be back.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-25", "description": "Found an entire napkin mixed into my cucumber salad. They offered to comp only the salad- the cheapest dish our party of 4 had ordered. Great customer service guys  would have given them another chance and skipped the negative review if they had handled better. Plenty of better options in the hood tbh", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Bijan's is an excellent neighborhood spot with a terrific atmosphere and superb food. \n\nI came in for brunch and ordered the Persian chicken salad (an excellent take on traditional olivier). My friends ordered the lamb burger and spinach omelette all of which they said was great. Good fries as well :) \n\nI had the classic Bijan cocktail which was excellent, refreshing with a hint of spice.\n\nI'll definitely be coming back - especially for dinner. While I haven't been there for dinner, I can probably point you towards a great kabob order which would be barg and koobideh or you should ask for a recommendation for a stew. Persian stews are the best I've ever had. \n\nHope this helps your food journey!", "author": "Amir H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "One of the best happy hour spots around, Bijan's is something definitely worth taking advantage of. \n\nThey have some great specials lasting till 7 that make this one of the best after work spots around. They have several house cocktails that are a super low price. While beers are a dollar or two off. \n\nThe space is gorgeous. Eclectic art, wood finish, and a fire place. I dug it. There's a long bar but if there's nothing there you can snag some seats on the long tables near by. They also have spot reserved for dinner if you're looking to actually come in here just to eat. \n\nThe staff is friendly and quick. They check in on ya often. They do an excellent job of making sure everything is running smoothly. \n\nThe food is pretty good too. Their calamari is delicious. The chicken sandwich and lamb burger were juicy. I can't think of anything I didn't like. \n\nThis is worth your consideration for happy hour.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "This is a cute lil' cozy spot to grab a drink \u0026 a light bite to eat any night of the week. \nGreat spot to catch up with friends or for date night.\nFood is excellent. Staff is very friendly. \u0026 music is always on point. \nI tend to opt for the flatbreads and herb fries. The flatbreads are really delish", "author": "Hasti P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "This bar is so cute! It has a fireplace inside and awesome decorations. I came here for happy hour on a week day. The bartender was great with service to our table. The happy hour is $5 drafts, $7 craft cocktails (instead of $11) and $8 glasses of wine. I got the Bijan craft cocktail. It has vodka, pineapple juice, mint and elderflowers, and was garnished with a dusting of cayenne. I requested no elderflowers in my order. The cocktail was very refreshing! I would definitely get it again. I also ordered the roasted garlic eggplant and it comes with whole wheat pita. This was $6. The pita was served warm and was big enough serving to share. It was a perfect snack! Bijan's has a bottomless brunch for $17 on the weekend which I feel inclined to check out! This place was great and I will be back!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "Interesting place...$20 all inclusive brunch option which includes a coctail, an entree and coffee. Food was OK, atmosphere a little too loud. Taking off 2 stars for being a cash-only place even though Yelp said that CC's are accepted.", "author": "Tanya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Stumbled upon this place on the way to a different brunch place, actually. Food was incredible and staff was super friendly! So glad we came here and will definitely be back.", "author": "Jenna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Came here for the first time for dinner and drinks (party of 2) on a weekday. The ambiance is casual but has great vibes! Candles help keep the mood chill and the music is really good. Food was delicious!  We order several dishes to share. We had the wings, the basil shrimp, spicy shrimp flatbread and the roasted chicken. Food was absolutely yummy with good presentation. My fav was the spicy shrimp flatbread. \n\nI would definitely come back. I took 1 star off for service. Our waitress started off great but then seemed to forget about us as time went by. My 2nd round of drinks also took a long while, my meal was about done when they came. Maybe waitress was just having a bad day. Easy to get to restaurant by car or train. Glad I tried it out, I look forward to trying more off their menu.", "author": "Antoinette P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "Finally checked out this neighborhood spot. It is so cozy and inviting inside! Love the decor--perfect for a romantic date or just a nice meal with whoever (including just a treat yo self). Food was yummy and the service was great as well!", "author": "Arjona A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "Normally don't write reviews, but I had such a bad experience I really had to say something.\n\nWe ordered three cocktails, all of which were essentially undrinkable. Two literally tasted like liquid hand soap, and my simple old fashioned was the worse I've ever had. Seriously. (Also, for some strange reason, in a completely empty bar, they took longer to arrive than our food??)\n\nI took the two hand soapy drinks and politely asked if we could order something different. The bartender immediately got indignant, rude, and defensive.\n\nWe ordered two beers instead. Before bringing them to the table, I saw the bartneder purposefully dipping his finger into the beer intended for me, and sticking a straw in too. Not sure if he was putting something in it from behind the bar? Either way, it was one of the most juvenile, unprofessional, and disgusting things I've ever witnessed.\n\nMeanwhile, our waiter had no sense of personal space, was possibly coked out, and squeezed my shoulder inappropriately twice.\n\nI'm sure with different staff members that Bijan's is lovely. Decor and playlist were both five stars. Unfortunately our two staff members ruined it.", "author": "Jesse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "Came with my wife to Bijan's on a whim, and we are so glad we did! Not only was the food amazing (Hanger Steak Frites, Truffle Fries, and the Bijan Burger), but the service was refreshingly impeccable. Even if the food was mediocre (which it's not), we would still come back off the strength of our server, Jonas. He was friendly, attentive, energetic, and perfectly accommodating. My wife and I will be back for date nights and to bring friends. Oh, and the drinks are amazing as well--and reasonably priced! Easy 5 stars!", "author": "Mikael P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "I've been trying to break out of the ordering-food-to-the-hotel-room-and-inhaling-it-in-my-pyjamas cycle ever since I started traveling to NYC for work. I decided to get a solo dinner and Bijan's worked well because it's intimate and really cozy, and so I wouldn't feel out of place among large tables of groups. \n\nI reached there at about 8 pm on a Tuesday and seated immediately. The décor really works for this place and I'm happy that they didn't try to go overly kitschy with the Persian theme. There are candles, planters, book shelves and artwork, with two larger bench like tables and a bunch of smaller ones \n No booths! \n\nI ordered the lavender bijan (made with gin, $11) and two appetizers - the garlic eggplant ($6) and the basil shrimp with spaghetti squash ($13), and I ended up bringing most of the garlic eggplant, served with crisp pita triangles, back home. The basil shrimp were so buttery and rich! I'm not one for vegetable noodle substitutes but the spaghetti squash really worked! The garlic eggplant was a kickier version of baba ghanoush. The lavender bijan wasn't really my thing, but that's on me. I was trying out something new instead of my regular jalapeno mojito, and I imagine that if you like strong lavender flavors, you'll really like it. \n\nService was good, and I felt like I was attended to without being fussed over. The server was also really helpful in giving suggestions on portion sizes. \n\nPortions are pretty generous, so I'd love to stop by here with a friend for a repeat round of a great evening!", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "I haphazardly found this place while exploring anything open late at night. I tried the crack soup with beef and spicy broth. It was delicious! The meat was tender and the broth was very flavorful. My husband also had a crack soup but ordered it with chicken. He was also pleasantly pleased with his soup, but I think I would rate the beef soup slightly higher above the chicken crack soup. My sister tried the steak with frites. Also a fantastic choice. The steak was tender and very flavorful. We had the wings as an appetizer and would highly recommend this dish. The wings were nice and crispy and the sauce was amazing. I was licking my fingers until there was no more sauce on the plate. I would definitely recommend this place.", "author": "Claudia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-17", "description": "Very cute interior. They run a small staff, but they are very knowledge on the menu. I got the burger but it was very rare. I expect this at a French place, but was surprised. The truffle fries were delicious.", "author": "Laurisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Had a friend from college visiting for a night, who wanted to get dinner. I looked for an American restaurant in Southern Brooklyn that was trendy with a diverse menu, but not too ridiculous. Stumbled on Bijan's and it was a fantastic option for when you're not sure of your's party's food tastes.\n\nMade a reservation for 5pm on a Sunday evening and it wasn't very crowded, as expected, so we got sat immediately. Cozy probably describes the inside best. Lots of wood and exposed brick, there's even a fire place. \n\nI started my dining experience with the Persian Kiss, which is a prosecco drink with pomegranate ($11). I love prosecco drinks and loved this too. For food, I went with the veggie burger ($15,) which was actually pretty good. It had a bit of runny consistency but all in all, the ingredients were tasty and fresh. The herb fries were awesome too.\n\nService was really quick and super nice. Never felt rushed or forgotten. With a solid service and food, Bijan's is definitely a place to check out if you're in Southern Brooklyn!", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "This restaurant has the most perfect vibe. It literarily feels like you've been invited to a host's house, very welcoming and nice staff. The food is so delicious. I've tried the appetizers and the wings are so good. Highly recommend it.", "author": "Yalda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-10", "description": "Came here on a Sunday night with reservations but it wasn't necessary as the place was pretty empty haha. Supper yummy the whole thing. I had the hanger steak which was amazing and cooked well and the hemp fries which were very good. My friend tried my fries and ordered one for himself afterwards. For dessert I had the tiramisu and it was soooooo good and a GREAT portion. actually wasn't expecting it to be that good at all, usually tiramisu's are hit or miss for me. The waitstaff was fairly kind.", "author": "Gaelle M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}