{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "I love everything about this place. I've been going since opening night and try to swing by for a cocktail at least once per week. Food's good too.", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "Bijan's is a recent find for me, and I love this little spot.  Bartenders and all the staff are laid back and very friendly. The wood-burning fireplace is a real treat when it's cold outside and adds to the warm, cozy atmosphere. \n\nYou can't beat the 2 for 1 cocktails during happy hour. The $10 regular price is a deal by NYC standards, and the 2 for 1 special makes them an ultimate bargain.  For a festive feel, I go with the bubbly Persian Kiss.  When in more of a martini mood, I opt for the Bijantini with vodka and ginger (real ginger... nice, fresh and spicy.)\n\nOn the food side, my experience so far has been limited to the yogurt and herbs and the calamari. Both were excellent. \n\nThe crowd seems generally chill, and perfectly comfortable for those going solo, couples and small groups.  Enjoy!", "author": "Tony S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "Decent food HORRIBLE service. It took us over an hour to get our food. The Persian omelette had very little of all the ingredients I asked for in it except dates.", "author": "Jean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "I love this place. Drinks are great, atmosphere is unique, fun and inviting, and the staff is awesome. Certain nights they have live music like Jazz or DJs. Anyone living close by owes it to themselves to make this place a regular haunt. Hell, I'm going after I write this review. \nDrinks: Strong, extremely flavorful\nFood: Wings are the best I've ever had - and I eat a lot of wings. Pizzas are okay, Burger's are best when ordered medium rare.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "Great space, loved the modern/artsy feel of it--not just typical \"brooklyn\" which was really refreshing. Enjoyed my drink and the jazz on Sunday nights. Service was also great.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Drinks are amazing! Had the pickletini and the MILF and thoroughly enjoyed them. The staff was extremely friendly and helpful. Very easy to get a drink unlike some bars that you have to wait for the bartender to look at you. We may have found a regular spot. Nice and quiet atmosphere for a Saturday night.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "I recently dined here with my fiance and found the experience to be pretty unpleasant. The food was pretty good. We both had burgers and my fiance ordered a spicy jalapeño cocktail. The place wasn't packed but the service was pretty slow, the food was great so i forgave that. Halfway through dinner i noticed my fiance hadnt taken more than 2 sips from her drink and i asked her about it. She told me it was waaay to spicy, i tasted it and it was in fact undrinkably spicy. Were new to NYC and moved here from Miami about a year ago so we have had more than a few spicy drinks in our lifetime and this was NOT ENJOYABLE. I felt as a paying customer I should say something about the drink. The waitress came over and we explained the situation to her and she grabbed the drink and took it back to the bar. After dinner when she brought us our check she told us that the drink was taken off the bill. We were glad they took care of us and began to grab our stuff to get ready to pay and go when the waitress leaned in and said to us \"In the future dont order jalapeño cocktails, theyre spicy.\" and just walked off. I understand things happen at restaurants like slow service if its really busy, or even the wrong order coming out since it can be a fast paced enviroment, but there is absolutely no place for rude and sarcastic people in that enviroment, both customers or employees. We respectful paid the bill and walked out instead of wasting our time exchanging words with the server. I will never come back to this establishment and warn anyone else from doing so until they get their staff right. I also wondered that night if the owner knew how the restaurant was being run. I doubt it. Customer service is key in the food service industry and places like this give the whole industry a bad name. *Great food, terrible service* is my takeaway from Bijan's.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-23", "description": "Popped in for Happy Hour, on a hot and stormy Friday afternoon.  Love the 2 for 1 on cocktails (2 for $10).  With names like \"Pump up the Jams\" and \"Gin-X,\" you can't help but try a few with those prices. I had both previously mentioned. More spice than whiskey in the first, but still liked it. The \"Gin-X\" was a perfect mix of gin and basil. I'll be back for more of those.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-24", "description": "We decided to give Bijan a try last night after a festival in Brooklyn. We wound up leaving pretty late and figured it would be best to grab a bite before our ride back to the city, and were pretty eager to try the food after browsing their menu.  Upon arrival, my first thought was that the atmosphere was pretty decent. However, though the hostess came to assist us within seconds, I was a little turned off by the fact that she had food in her mouth, which she was chewing in my face as she spoke.  I understand the struggle of food service, but seriously, next time get someone to cover you while you take a five minute break to eat. \n\nSeating was a bit annoying as well. When we arrived there were a number of empty tables available, as there were only a handful of people there. It would've been easy to separate one of the four person arrangements to give us a single table, but apparently that was out of the question. Instead, we were seated in the corner, on a bench which wasn't exactly comfortable or sturdy, that moved whenever anyone else on it moved.\n\nTo their credit, our waitress was okay. She was at our table pretty frequently to take orders and check in.  As to food and drinks,  there were some things I truly enjoyed and others I could live without.  For my cocktail, I ordered the Pom Pom - voodka, triple sec, lime juice, and pomegranate nectar - which I found to be light/crisp, refreshing, and very well suited for summer.     My gf went with a gingerale.  While we both appreciated the fact that you could definitely taste the ginger, their ratio of syrup to seltzer were off and the soda was pretty sweet.\n\n\nFor food, I ordered the pulled pork sandwich, which came with sweet potato fries. The fries were delicious. They were thinly cut, crisp around the edges, but soft in the middle, and the perfect balance of salty and sweet.  The sandwich also had very good flavors, but was a little on the  chewy and, at times, dry side.  Unlike the traditional pulled pork sandwich which is often served with a little extra sauce, Bijan's sandwich came served on brioche (which is fairly thick), with no extra sauce, and with lettuce, tomatoes, onions and a spicy pickle.  Being the traditionalists that I am, I did without the added toppings, and ate the sandwich and pickle separately.  And, though the meat had a great BBQ flavor (sweet with a bit of a kick), I could only make it through about a third of the sandwich before I couldn't bear it anymore.  On the other hand, my gf ordered the goat cheese, arugula,  and pear flatbread.   Again, the flavors were there, but for me the goat cheese was chewy.  Perhaps it was the type or brand of goat cheese they used. \n\nAll in all, our experience wasn't terrible.  If ever in the area, I could see myself stopping in again for cocktails, but I don't see Bijan being the type of place that makes feel the need to travel to BK specifically for the purpose of eating here.", "author": "Ana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Best random night I ever had. Such sweet people, night music, nice vibe. The nicest bartender that's ever lived, Henry. Also just had the nicest time chatting. Come here.", "author": "Katie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "This has quickly become my favorite brunch spot! For only $15 I get DELICIOUS food, to die for drinks, and a fantastic crew. Rita is my favorite waitress, she rules. Did I menton how cute the building / interior are? Well deserved 5 stars.", "author": "Caylah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Fantastic staff and delicious cocktails. The bartender crafted a drink based on my physical and mental state. (New parent. Very Tired.) it was perfect. Love this place.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Great chicken wings: Persian spiced wings! Casual atmosphere in a great Brooklyn neighborhood.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "I saw this bar had opened a few weeks ago and couldn't wait to try it out.  Turns out, this place is a fabulous new spot.  I went there on a Saturday night.  The bar was not very crowded, which meant my friend and I had plenty of room to sit and it wasn't too noisy.  The bartender convinced me to try out one of the signature cocktails, which was so good I ended up having two of them.  He was great, very friendly and knowledgeable. \n\nI will definitely be coming back here again.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "We were there for their New Year's Eve party and had a great time. The crowd was fun and lively, the food was yummy and the drinks were delicious.  They brought in some live entertainment -- two DJs and some fire-eaters -- which ensured that we spent most of the night boogying. The fireplace and overall decor make Bijan feel very homey. Larry and Meagan, both of whom tended bar that night, were awesome! We had a blast and can't wait to return.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "2 Stars for atmosphere.  0 stars for food.   Pretty much everything was tasteless...and overpriced for what you get . $6 for Mezes seemed like a good deal and potentially yummy but honestly, you get about 10 MOSTLY SMALL olives for $6 and one tablespoon of the eggplant spread for another $6.   I ordered the special, which was kind of a beef stew- tasteless except for some giant acidic vegetable/fruit that ruined the whole dish.  Also, I counted 3 tiny pieces of beef.   I'll come back for a drink at the bar but never eating here again.", "author": "W L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "I wanna let you in on one of Brooklyn's best kept secrets. I am a resident of Chelsea one of New York best bar \u0026 restaurant scenes. But it can get loud and crazy due to it being a tourist attraction. I wanted to try something different low key and quaint. So a friend told me about Bijan's. My girlfriend and I went on a Friday night. And to my surprise the spot was Fabulous! The atmosphere was amazing, the decor was on point, very chic and cozy. We sat at the bar  and we were greeted by their bartender Henry.\nHenry was the perfect host! He was charming attentive and is a master mixologist !! He made me a drink ,with wine and other little special ingredients. The drink was Delish! He also suggested the margarita pizza. It was fresh and delicious!!  The bars owners came up to us, and introduced themselves. They were a very charming couple. \nTo add to this wonder experience it was ladies night. They had an awesome DJ!\nOverall, the prices, the atmosphere and the service get an A+ from us !!!\nBijan's is lucky to have a wonder staff member like Henry!! He went above and beyond. We will definitely become regulars at the quaint place.\nThank you Bijan's for the great experience!\nAnd thank you Henry for your great Service !", "author": "L T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Still Loving this place. It keeps getting better! And would not change my opinion on this restaurant. people are very nice and easy to talk to. Great food!", "author": "Jacob S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "I went here one night w/ my boyfriend. Loved it!! The staff is awesomely friendly, the food delicious and the drinks exoctic and yummy that sneak up on you. I loved the music selection and the mixed matched decor. The only thing I didn't like was the Happy Hour ended and they didn't warn us so the bill was more than we expected. Other than that of course I'll keep going back for more.", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "Really Cynthia D? The thing that stood out that was odd was the size of the menu? If you want unlimited options i would suggest a diner. There you will find numbers next to the entrees to make it easier. This place has everything you want in your local bar restaurant. Incredibly well thought out food with a persian twist, , great cocktails and a solid beer selection. A classic.  Larry is a world class mixologist just tell him what u like.", "author": "Michael M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}