{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Yummy food, and an excellent bartender.  Service can be a bit slow on weekdays.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "What can I say ? \nWell my experience at Bijan's was AMAZING !!!! \nEverything from the great tasting food to the cozy atmosphere to the best staff !! \nWorth every penny . The prices are awesome and very much affordable. \nThank you Bijan's for this GREAT experience (:", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-09", "description": "I've been here 3 times, each time hoping the service would be better. It wasn't. \n\nThe first time I came with my fiancé for dinner. HOLY SLOW. Took about 1.5 hours and we only ordered a cocktail and an entree each. They took our menus away before we even ordered, somebody came back about 15 minutes later to basically ask what we were doing there -obviously they forgot that had seated us and that we needed to order food, the wait for the food to come out was also ridiculously long, and we had to ask 3 times to get the cocktails we ordered. The worst part was that it is a small restaurant and you can see the waitstaff. The entire time our waitress was just at the bar texting and talking to someone else that worked there.\n\nThe second time I came back with a friend for brunch, hoping that the slow service the first time was just an anomaly. It was not. I was feeling okay about coming back because the brunch deal is actually super good for the price and includes a drink, entree, and coffee/tea (but is cash only, which they only tell you after you've been seated). The lamb burger was actually delicious, the flatbread was meh. I really do like the cocktails, but it took us about 15 minutes once our glasses were empty to try to flag her down to get a refill, and then another 10 minutes to get the glasses filled. I would've had a third but having to try to wave down the waitress for 15 minutes to get another one didn't seem worth it. They forgot to give us (or even ask if we wanted) the coffee/tea, and once again did not want to bother trying to get the waitress' attention. \n\nThe third (and last) time I came in, I came in with a friend to grab a quick cocktail. We asked for a drink menu at the bar and they handed us the menu, we looked and saw the cocktails were $5 each so we thought luck was in our favor. It was not. Again. We got a drink each and handed the bartender a $20, who then looked at us like we were aliens for waiting there, and dismissively said \"okay, you can go\". We asked about the prices on the menu and he said well that price is for brunch only. While it's totally understandable that they have brunch pricing on drinks, but that doesn't change the fact that they gave us a menu with different prices on it and didn't say anything until after we got our drinks. \n\nI really wanted to like this place because it's so close to where I live, but it's definitely not good enough to deal with the bad wait staff and the slow service.", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "My absolute favorite neighborhood bar! Have been a regular here since I moved to the area. Atmosphere is super chill and the wait staff is very friendly and accommodating. The food is to die for and the kitchen stays open until 11AM on weeknights and 1 AM during the week. The wings are incredible! As are the Persian specialties such as smoked eggplant and Persian beef kabob. Great place to start or end your night! Would recommend to anyone living in or passing through Boerum Hill.", "author": "Arian R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "The cat's out of the bag! Bijan's is no longer my lil' secret. The second time I went, it was packed! This was during after work hours, let's say around 7pm on a Thursday. My coworkers and I were lucky enough to pull together a few tables and own the back section of the place. \n\nThe cocktails on the menu will run you $10. Trust me when I say this is a good deal. The bartenders here are NOT shy with their pour. I had one milf for the night and I considered myself pretty tipsy and I did not order any food at the time. \n\nMy third visit, I cam here with my brother. We ordered a LOT of food. The wings, flat bread pizza and calamari. The wings were perfect. Juicy, crunchy, spicy. The blue cheese dip could be its own dish, seriously good. I was very impressed. \n\nLook... Get the food, have a drink, enjoy my spot. You're welcome!", "author": "Anikha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "It's the best persian resturant in NYC! the persian kabab was perfect! it made me feel i'm in home. the menu is awesome, perfect combination. all of the burgers are great and don't miss bandari calamri! i suggest here to every one", "author": "Bahareh S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "Went for brunch.  I'm giving 3 because the food was good albeit a little small portions.  The Bijan burger was better than average, and calamari was fantastic.\n\nHowever, the hostess who ended up being our waitress was awful.  When she came with the waters, she elbowed my 6 year old to get out of the way.  I think an \"excuse me\" should have worked but apparently she thought she could communicate with a child better through rude body language?  (I had wondered if this is her first foray in working with people).\n\nWhile that definitely set a mood for me, we were just thankful that the 3 year old was asleep and were enjoying our meal.  My 6 year old was mostly entertained on the phone - might have dropped a fork - but by no means high maintenance.\n\nSo to our surprise, after not refilling our coffees or waters, we got a 20% \"automatic gratuity\" for the 4 of us.  And so we were like fine, we'd leave that anyway.  we asked for our $10 change, and she seemed surprised and gave us ones (hinting that her subpar service was deserving of above average tip).\n\nSeriously, this woman has nerve.", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "If you are looking for a true Persian restaurant, look no further because Bijan's is a right place. Sepideh is a great host and you will instantly feel at home. Delicious food and very friendly staff.", "author": "Tiera L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-08", "description": "I'm eating my meal as I type this. This place, at least from my only (and last) experience here, really sucks. The \"Persian\" chicken salad sandwich tastes like it came from 7-11 and the chips are stale. Legitimately stale. Chewy.\n\nAdd to that the fact that it took OVER A HALF HOUR for this cold sandwich to be brought out to me...and you've got yourself one unhappy customer. The guy at the counter is wearing a baseball cap, grey t-shirt, and Addidas gym pants. He looks like he just woke up.\n\nI'm beyond not impressed. Never again.", "author": "Marc R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-23", "description": "the calamari is pretty much straight off the generic grocery store freezer rack. though their take on marinara was interesting, it was almost like an Indian curry. \n\nthe burgers we had, lamb \u0026 bijan, were fine. nothing to write home about. \n\nthe service was very peculiar. it was somewhat busy [12-15 people] for a friday afternoon, and one man was tasked with being bartender, waiter, busy boy and host. so i would be in a mood as well. but then that falls on the ownership to employ more people. wouldn't come back.", "author": "Kenneth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "I've walked past this place far too many times, and finally stopped by for after dinner cocktails.\n\nThe decor is really cozy, and I'm pretty sure my mouth watered when I smelled truffle oil french fries (and to think, I JUST finished dinner). \n\nWe sat by the bar and I had a jalapeno magarita on the rocks, and it was phenomenal. I followed that with a vodka soda, also lovely. \n\nMust come back for food!!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "Food was great. Service was amazing. Our server Henry was attentive, accommodating, and made eating at Bijans a great experience. I wish there were more waiters out there like him. \nWe will be returning soon. 5 stars for service and food.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Bijans, I love this place!, excellent food, nice atmosphere and attentive service and the cocktails wow!! . I orderd a Turkey Burger with Herbs Fries ( they were delicious fries.) and a shaved cucumber salad with feta and a pomegranate vinaigrette. Brooklyn at its finest in a in small, cozy package. Yes, I recommend this place to everyone.", "author": "Carlos N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-02", "description": "Me: \"OMG, they have a fireplace...with REAL wood!\"\nSean: \"Uh, yeah...I can see that.\"\n\nI don't normally frequent places that have fireplaces with real firewood. So whenever I see one, it's like someone from the west coast seeing snow for the first time. They also have a huge wooden bench in the middle of the bar. Come to think of it, the place was decked out with wood.\n\nWe came after dinner around 9ish...or was it 10? There were people gathered at the bar...but we decided to sit on a tall table with stools instead. I looked around and the white lounge chair on the elevated stage by the window caught my eyes. We moved our seats...and people watched until we finished our drinks.\n\nSpeaking of drinks, they have unique names for their cocktails. I got something called the Persian Kiss, and it looked like apple cider. It had Prosecco and pomegranate juice -- SO GOOD. He had something called the Bijan, and I just remember it being awesome and having some sort of spice and cucumbers, kinda looked like eggnog. \n\nThe place and atmosphere is very friendly. They even let a couple of bike riders park their bikes by the fireplace. \n\nI instantly fell in love with Bijan when they started playing 50's music. The Supremes, The Temptations...WHAT!\n\nWe didn't have a chance to check out the food menu but I'd love to come back for it.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "This is an amazing spot. Quiet, comfortable but always with very nice people inside. The cocktails are fantastic (flower bomb my favorite) and the food is delicious. Very interesting selection of typical Persian food on a side. I had both kebab and the special of the day. Both of them absolutely worth it! Strongly recommend it!", "author": "Gianluca T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "As stop number three for a lovely Brooklyn adventure, this was a lucky find. And thanks to yelpers for pointing me to it!\n\nWalking through Cobble hill and then crossing Atlantic, we stumble upon Bijan's after a nice twenty minute stroll through the hills.  This block of Hoyt Street is interesting.  Lots of commuters walking home from a long day of work, some bicyclists as there's a bike lane that runs this way too.\n\nWe step into the space, and the first thing we both notice is all the wood.  There's a wood wreath behind the bar, and a large circular wooden wreath mounted on the ceiling.  Not a xmas type of wreath, but a huge pagan one that seems to be made out of driftwood.  An interesting vibe.  The space is sooo calming and chill.  A bunch of people are relaxing at the bar, and we find ourselves a table to relax at. \n\nI order a Bijan and my Brooklyn loving hipster from bside goes for the Persian Kiss.  Prosecco being a hit with her, I'm not surprised she loves it.  The cocktail in my hands has a leaf of mint in it, to remind me that it's a healthy concoction of vodka - we all know it's medicinal qualities, pineapple, immune building elderflower and ball-busting cayenne.  Amen to the healing properties.  A doctor friend of mine would approve I'm sure!", "author": "Sean S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I haven't tried the food here, but dropped in for a drink on my birthday and Henry, the bartender was the best! Ended up staying for hours and got great recommendations to not have a hangover the next morning.", "author": "Anjali T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Five stars folks!!! You heard me!!! So let's be honest, New York. You can drink anywhere. What we are looking for is good people, great service, and a cocktail that is the real deal. So come to Bijans! Just come. Ask the bartender to make your fav drink. Yeah, the bartender with the warm brown eyes and the dimples... His name is Alex! He's friendly and fun, and he mixes a mean Frisky Whisky! The whole fam is great! Just come already. But leave your hoity-toity Manhattan attitude at home. This is Brooklyn...we're chill! Written by the girl who lives around the corner and freakin LIVES in this place!!!!", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Would have been a lot better if they didn't get super mad about splitting the checks. Clearly one of us wasn't going to pay $200 for one table. Pretty disappointed in the way we were treated.", "author": "Courtney P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Just went to Bijan's yesterday for the first time- and was honestly so impressed. I love the relaxed vibe, unique decor, and Charlie Chaplin movies that were projected onto the wall. The brunch deal is unbeatable, as my lamb burger was cooked perfectly. I'm a firm advocate of cheese on burgers but seeing as the original menu item didn't have it, I opted to go cheeseless, and the taste of the meat went above and beyond what I expect it would taste like obscured by cheese. The sweet potato fries had a very specific seasoning that was unlike any I have ever had and was addicting. I will definitely be returning for dinner and drinks soon, excited to go back!", "author": "Sarah R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}