{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "I love the space, decor and the happy hour specials. The jalapeno margarita was amazing. Cocktails are only $7 during happy hour which is great. I haven't tried food there yet, so can't comment on it, but it's a nice, solid place for happy hour/drinks.", "author": "Akhila K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "The service is incredibly, incredibly slow. I have been there twice in the past few months. Once it took 45 minutes for two dishes to be made (and it was take out) and the other was OVER an hour for a table of 4. Their kitchen is far too small and too slow for how popular they have become. This used to be one of my favorite restaurants in the area... the food is delicious. But it's no longer reliable so we aren't going to be back.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Love this place been coming here for years food is great bartender Henry is always so friendly and kind knows my drinks. I bring co workers here on Fridays since I work down the the street highly recommend this place!!", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Hoyt Street by Atlantic Avenue is one of my favorite little strips in Boerum Hill and a huge breath of fresh air from the overwhelming Fulton Mall. I use to work in the area and would stop by Bijan's for lunch. I love the array of Persian lanterns hanging over the bar and the multi colored bar stools are adorable. The place has a variety of seating from a little high up cozy window spot to family style sitting or a romantic table for two by the baby fire place. \n\nMy favorite spot to sit at would definitely be at the bar and away from the window. Now you know so if I come in you better move out of my seat. The super sweet tattooed mixologist William kills it in the cocktail department. All you have to do is name your poison, mine is always gin and he will mix you a cocktail for your specific taste buds. I love to come here for brunch, get a simple two eggs over medium with potatoes and toast. My brother and I brunch a lot and toast and jam are not just a side they are the cherry on top. The great thing about Bijan is that there is no jam...it's ..drum roll please..compote. I know nerdy Yelpy needs! The compote is perfectly sweetened fruit mixture and is the perfect ending to breakfast. I still have to come back and try the pancakes. They always look spectacular. \n\nI also judge a brunch spot by my water and coffee refills. William took care of both on top of my boozy brunch needs. And it doesn't hurt that he's absolutely hilarious and always in a good mood. I can't stand it when I pay for an experience and someone is grumpy. I definitely recommend coming here weekends with a group, date night or just by yourself.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "BEST GOOD AND SERVICE IVE EVER HAD! Love this place so much and shoutout to Bianca and Henry for being amazing!!!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "I love their happy hour specials. The food is pretty good.  So far i have had the calamari,  lamb burger, spinach omlette, some steak, peri peri wings and few other items. \n\nOf all the foods listed the peri peri wings stand out the most because they were my least favorite.  They could be prepared differently or crisped a little longer.  If they are not to be crisped then they definitely should be prepared more tender. \n\nI did notice on my recent visit that the cost for the cocktails went up a buck and i also belive the cost of food also increased.  I hope the happy hour is still 2 for 1 as that is what lured me to the place initially.", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "ALERT: Prepare for major embarrassment if you bring an out-of-town guest here for brunch. Total Fail.\n\nI truly question the palate of Yelp reviewers who gave Bijan's 3 or more stars for Brunch. \n\nIt was awful. \n\nWe went with the pre-fix brunch menu and asked the server for recommendations. We ordered the two dishes that we were told were \"amazing\": The Saffron-Semolina Pancakes and the Breakfast Pizza with Eggs Sunny Side Up. I also ordered the Bijan Mary. \n\n1) Bijan-Mary: It tasted like Campbell's tomato juice mixed with a little vodka. Completely uneventful. \n\n2) Saffron-Semolina Pancakes: They were not bad, they were disgusting. Imagine the smell of yeast and pancake batter with a hint of saffron. They *smelled* and tasted like that. Plus they were very dry, did I mention tasteless? I do not like wasting food, so I *tried* I really did. I got 3-4 bites in. In the end, we could not stomach them. \n\n3) Flatbread Breakfast Pizza: It was like one of those flatbread pizzas, wtih cheap ingredients that you find around Times Square. Palatable, nothing new or special. The bread was not fresh ...  it reminded me of one of those frozen flatbread pizzas from Totino's that you may have had (unfortunately) in Middle School. \n\nAlso, after asking for a glass of water 2 times, I finally received it within the last 5 minutes of the meal... But my brunch guest did not receive hers.\n\nNever again.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Love this place. Amazing vibe and diverse menu. Usually do not have to wait long for a table, even on weekends. Cocktails are so good, and the service really knew the menu. I was impressed with the drink options. Our server gave great recommendations! The food turned over very quickly and was so good. I had the salmon with amazing mashed potatoes and veggies. Paired with a whiskey cocktail and some small plates, I was very happy with my order and experience!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "I love Bijans, food is amazing, and staff is great. Thank you Henry (bartender), and Kadri (waitress), you made our experience even better, we will definitely be back. Definitely try the wings, best in Brooklyn.", "author": "Montrell B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "We came for cocktails and dinner after a movie.  Was great to find a place whose kitchen is open until 2 am!  They had some interesting cocktails on their drinks menu and also a good selection of whiskeys at the bar.  The food was delicious - my husband could not stop talking about the roasted chicken and I enjoyed the pappardelle.", "author": "Kristin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Worthy of 5 stars for their burger and fries. The bartender totally gives a shit and wants your drink to be good. Loved this place.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Food is so good!! The parpadelle with shrimp was so tasty and fresh! I loved every bite of it, and trust my tongue hunty. The green beans were crisp and fresh cooked perfectly. The sauce was made in house, tomatoes were nice and plump. The shrimp were fresh NOT FROZEN thank the LORDT. \n\n2 for 1 cocktail happy hour and the drinks are gooooood. Lol I feel like a commercial. The gingerrita was nice and strong. \n\nMakeda was my server and trust that she is attentive and very kind. \n\nMy only issue and I hate to have to add this is the fragrance in the restaurant. Maybe I'm just sensitive but there was a perfume smell all over the restaurant. Wayyyy too strong. Gave me a headache that only another ginger Rita could cure.......hmmmm.", "author": "Natasha J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "3 out of the last 5 days. Although I show the steak in the pic, the lime chicken is my fav. Do it!\nCasual environment pretty consistent st delivering tasty warm dishes.", "author": "Phil W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "We found Bijan last week for a drink before a friend's show and we returned for brunch today. The $17 special of entree, cocktail and coffee/tea is a great value for a mediocre meal; however, I doubt there are any mediocre meals served at Bijan.  My lamb burger was spectacular, as was my companion's salmon.\nUnreservedly 5 out of 5 stars!", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Great place to go for appetizers and drinks. We had cocktails, beer, olives, and other appetizers. I met Bijan! He's cool. Go here for chill vibes and chill food.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "This place is super cozy and the food is excellent. The cheese plate is tasty and it comes with some solid pita bread. My favorite dish, hands down, is the basil shrimp. Epic. \nThe pickled martinis are delicious and unique. Good selection of wines. Prices for everything are accurate. \nBeen here a few times, gets better and better. Great place for conversations.\nThanks Anita and Makeda and Henry! \nXx", "author": "Kath W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "Food was really good, if a little slow to appear. Staff seems to be friends with half the customers and environment is a smush between bar, cafe and house party. I'm pretty sure everyone working there was high as well - kinda floaty, very smiley, chatty and distracted. Had a great time.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "First time coming in, waiter wasn't very friendly. Half of the items on the menu were unavailable and the wait took AN HOUR AND A HALF even though the restaurant was half full. Certain parties had to leave without even getting their food. \n\nThe waiter (Ali) was not apologetic about this, and didn't refill our water once during the hour and a half wait.\n\nSo the kitchen staff was a mess for some reason and the waiter didn't even apologize for it. \n\nFood was average and ambience is nice, but definitely not coming back.", "author": "Dinesh R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "This place is wonderful! Today the special was sour cherry rice with meatballs, and it really hit the spot! The meatball was flavorful and the rice was fluffy/soft and the sour cherry was tangy and went well with  everything. We had been wanting to try persian food and was recommended by our Iranian friends. It is very authentic! (While also having modern twists)\n\nWe also had as appetizers the basil shrimp with spaghetti squash which was very tasty. The shrimp cut butterfly style and the squash gave a nice texture.\n\nThe decor was comfortable and has a natural feel. I like the greenery arranged in the front and the exposed brick and window in the back.\n\nWe also met the owner who was very nice and told us  that she painted some of the paintings decorating the wall. Very cool!", "author": "Evan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "A true gem in Brooklyn! If you're a fan of authentic Persian food, tasty cocktails, and cozy ambiance, this is your next spot to visit. My friend and I decided to stop by for dinner Thursday night and we started with two cocktails - the Jasmine Vesper and the Bijan Teanj. I'd definitely say the Bijan Teani was my favorite, especially since I'm kind of an earl grey fanatic in all forms . For appetizers, we got the chicken wings (always a good choice) and an eggplant trio which brought me back to my Persian roots and gave me great case of nostalgia for the good ol' days of smoked eggplant with the family. \n\nFor the main course, we shared the kabob koobideh AKA the Persian beef kabob. Sooo good and tasted super authentic. I heard they have Persian stews most other nights, so I think we will have to make another stop for dinner soon to try some out! \n\nOh and if you somehow have room for dessert with the large portions, try the tiramisu. Might seem like a random choice (esp with all the great tiramisu options in New York), but trust me--- your taste buds will thank you!!", "author": "Shaudi A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}