{"aggregateRating": {"reviewCount": 489, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "This place has the best feels whether it be summer, fall, winter or spring. Their happy hour is what first lured me in. Every drink on their menu is great in its own way. Their smoked eggplant dip, Persian chicken wings, beet salad and kebabs are a few of my favorites off the menu. The staff is wonderful always and it's just a wonderful cozy atmosphere with a working fireplace in the winter.", "author": "Steph S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "We were able to schedule a party of 10 on a Saturday night. The waitress and the manager (maybe owner?) offered good service even though it was a busy night. \n\nThe Persian spiced chicken wings were very good. The best way to describe them is tangy curry wings. My friend's salmon was pretty darn good. Very moist. My Bijan burger was good. Nothing fantastic but satisfying. The lamb burger was delicious. My only complaint about the burgers is the inconsistency. The medium lamb was cooked more than my medium well Bijan burger. \n\nOverall, I had a good experience .", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Such a good spot. Drinks were good. Food was good, tho it took a while to arrive. Had the flatbread and wings, recommend both. Staff are super sweet! Really enjoyed the Amy Winehouse/Adele radio they had going on. I'd recommend. I'll def be back", "author": "Creshana J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "Wow, what an unexpectedly horrible experience. It started off quite nicely; warm decor, cool atmosphere, initially attentive server. She took a drink and food order and served the drinks in a timely fashion--and then the evening imploded.\n\nTwo burgers were delivered to the table prior to the appetizers, and one of the burgers had the wrong type of cheese. When we alerted the server that the apps had not been served she made a non-sensical excuse and offered to take the burgers back! We elected to send one back for the correct cheese and kept the other. As it turned out, both of the burgers were cooked beyond well done when medium was requested. We sent them back to be prepared again but were told that they were out of burgers.\n\nMy lamb burger was served and was properly cooked to temperature--1 for 3 on burgers. \n\nThe fourth entree was not served and after a few minutes we inquired as to where it was. The look on her face gave it away--she completely forgot to order the kabobs even though she spent a great deal of time lobbying for them when my friend was debating about what to order.\n\nAt this point the bartender walked back toward the kitchen and loudly yelled offensive expletives to his kitchen staff. \n\nWe told the server that we no longer wanted the forgotten kabobs, nor did we want to reorder anything to replace the burgers. My friend suggested that we should not have to pay for the food.\n\nMinutes later the bartender marched up to the table and angrily confronted us as to why we thought we should not have to pay for our drinks. We, however, never made such a request.\n\nMy friend got into a rather heated debate and stormed out. It was a complete breakdown.\n\nAnd what perhaps makes the situation even worse is that despite all of the mistakes, no trace amount of remorse or regret was displayed.\n\nA simple, \"I am very sorry,\" goes a long way.", "author": "Brian N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "My friends had told me about Bijan's and it was well worth it! Just good vibes all around! The food was out of the world and amazing hospitality. Will definitely be back!", "author": "Tommy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Best delivery food I have had in the 1.5 years I have lived in this area, period. Amazing rosemary chicken that was perfectly seasoned and great sides. The only thing I can pick at is that the food arrived near ice cold. However, it did arrive 15 min early and it warmed up nicely in the microwave. It was 16 degrees outside, so I can understand. Otherwise, fantastic. Would recommend. Trying the steak tonight!", "author": "George L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "The decor and ambiance are top class. The food was fantastic. We came in for brunch and had eggs benedict and coffee all around. The waitress was very nice, I don't know her name but she was an absolute pleasure. Definitely recommend.", "author": "Alice T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I tried the beef stew and Persian noodle soup (aash reshteh) and both were delicious.", "author": "Setare S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Amazing place! Art and food! lovely enviroment, delicious Persian food and lovely kind peoples. will see them soon............", "author": "Arash Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Great music on Sunday's. Really cute interior, the host let me sit on the 4 table seat by the window which had the cutest view of the wall plants and cherry blossom tree. I ordered a ginger margarita and it was not very sweet and moderately strong. Ordered the margarita flat bread, it was tasty but they could have elevated the flavor a a little more w stronger basil and more acidic Tomato sauce. Really digging this place though, and need to come back for a group brunch!", "author": "Sara I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-19", "description": "I have mixed feeling about my brunch at Bijan's. We arrived at 11 am, but the staff complained that they couldn't open up yet because of a late waitress. We came back 20 minutes later to get a seat. Unprepared management, unhappy staff. Not the best way to start your morning. \n\nThe space is charming in a cozy Brooklyn meets Bedouin kinda way. Its rustic, but industrial, and filled with lots of kitsch, succulent plants, and modern art pieces. There are small tables, as well as one long communal table. If the place is full, it would feel very crowded. Our tables and chairs were very wobbly, which drove the OCD in me a little crazy. The lack of uniformity and polish actually makes the place look a bit gritty. \n\nI ordered the:\nLemonade\nSaffron semolina pancakes\nLamb burger\nCoffee (which the poor staff kept complaining was going to be a tiny bit of a wait because SOMEBODY didn't show up on time, and wasn't she so sorry that SOMEBODY was completely ruining her day)\n\nThe pancakes sucked. They tasted like baking soda, not like saffron. They were remedied only by the blueberry compote on top. But if you can't serve a pancake that tastes good on its own, you shouldn't be serving it. However, Perry absolutely loved his lamb burger with feta. He polished it off faster than your momma can say your full name. So his happiness with his meal counters mine.\n\nI can see how this place would be awesome for cocktails and lounging around. But that's not why I was here. The service was whiny. The unprepared opening. The pancakes. So this gets a giant MEH from me.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Stopped in for lunch. Attentive service. Decent drink selection. Hanger steak sandwich was excellent. Fucilli pasta had some wonderful flavors. Parpadelle a bit bogged down with mushrooms. Overall, I would recommend.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "I wanted to love this place as I've walked past it so many times but it really was just mediocre at best. First, the music is deafening...you don't need blast your tribute to the 90's on a weeknight. And the food was disappointing...the flatbread was soggy in the middle, the shaved cucumber salad which should be crisp and refreshing was room temp and soggy and the mashed potatoes had so much garlic you could barely eat it. Maybe it's better for brunch but I was very disappointed at dinner.", "author": "B B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Solid neighborhood spot with great food, great tunes, and no massive line. Get in, get some good atmosphere, go home and do your job. Definitely coming back.", "author": "Dave B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Good food. Great company. Wonderful ambiance. It is very reasonably priced. The people are friendly.", "author": "Amir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Found this place by accident. Stopped by for brunch on a Saturday morning, and could not be happier. Good it's tasty and the cocktails are delish. Also, the prices are really affordable for this part of town. Will see be coming back", "author": "Leonella M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Pleasantly surprised!\n\nCame here with my boyfriend for dinner. I had the pistachio crusted salmon and it was quite delicious. Tender and flavorful. The service was alright and the ambiance was cozy. We were seated near the fireplace and I was quite happy about that.\n\nI'm looking forward to trying other things on their menu.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Although pricey you pay for what you get. The decor of this place is romantic, cozy and warm. The food is amazing. I got the pistachio crusted salmon which left me satisfied and craving more. Overall I can't wait to return because everything is delicious and it makes for a wonderful evening. It's not a once a week place but it's the perfect place for casual yet classy night on the town.", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "This restaurant has exceptional ambiance. There's a fireplace, beautiful plants, and a beautiful bar. As observed by others, the staff are very nice and the food is quite good. I went later in the evening and there was no wait. If I lived in the neighborhood I would make a point to come regularly. Highly recommend.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "One of the best meals I've had in a while! Went for dinner the other day and was amazing. It was very cozy on the inside. I loved the plants and the fire place, which was perfect because it was freezing outside. To start we had the wings and they were delicious. A little sweet and spicy. For main course, I had the pistachio crusted salmon with truffle mashed potatoes and green beans, which was a interesting and delicious combo. My boyfriend had the bijan burger. Didn't have anything to drink, but cocktails looked fun. \n\nWill definitely be back for dinner for brunch.", "author": "Ashley M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Bijan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Hoyt St", "postalCode": "11211", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/T7kx9MI3K8lc9ola82vHow/ls.jpg", "@type": "Restaurant", "telephone": "+17188555574"}