{"aggregateRating": {"reviewCount": 93, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "I was expecting more from this place because I love island food. We ordered the oxtails. It came with rice and cabbage. They tasted fine but they were really huge and very tough to eat. I guess I am used to oxtails that falls off the bone and chopped into smaller pieces. The customer service was really good though.", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "omggg so I've had yelp for like 2 months, just to read reviews on new spots before I went, but holy f*ckn hell. This place was SO BAD, I actually had to come and write my first ever review to warn all my fellow Caribbean people about this so called Jerk spot.\nSo they have rice and peas , oxtail, blah blah basic Jamaican food right? But it's name kinda promises you some banging jerk so I got the jerk chicken and rice and peas (cole slaw added for free).\nBruh. First of all, it was just a leg and thigh cut up with... idk Grace jerk sauce mixed with water ??thrown on top the chicken. \nSECONDLY, it was $11 which is what blew mine. cause you take the train straight to Flatbush and go to fishermans and you'll get TWO legs and thighs cut up, properly seasoned; rice and peas, plantains, and cabbage for the same price but here's the twist: IT TASTES GOOD. I mean, given what Downtown Brooklyn is becoming, I guess they're catering to that crowd  but if you're from the islands, or just, iunno, like food that tastes good? DO NOT GO HERE. SAVE YUH BLOODCLAAAT MONEY.", "author": "Colleen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "I was working in the area and felt like some West Indian. I ordered the jerk chicken with rice and peas. I also ordered two chicken patties. The jerk chicken was nice. I been to a couple jerk chicken spots and I gotta say this is the real deal. The jerk chicken is moist, smoky, spicy( just enough spice not too much), flavorful and well seasoned. The patties were good too. I can tell that both the patties and the chicken were fresh. There Portions aren't huge like your typical jerk spot, but it's a decent amount.There prices are fair for the quality of food you get. All and all this is a great restaurant with fair prices.", "author": "Jeris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-24", "description": "Don't know who's reviewing this place , but its the blandest jerk chicken ive had. It is fresh and tender, but lacks a lot of flavor. I had high expectations from previous reviews,", "author": "Susie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Both the Jerk Chicken and the rice and peas were outstanding!!! Not to be missed. The service was great too.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "One star for customer service. Today was my second time at this location and I will not be returning. My mom placed an order thinking that there was ONE SIZE only and was not asked by the cashier if she wanted a small or large... When she got the order she was charged two large and we had to wait around for 15 minutes for a refund while the workers were talking shit about us in the back... After we got the refund there was a whack ass apology given and we were ripped off for the 10% discount that we had gotten off the meal...Sad to say this, but my people do not know how to do business at all. That's why Jamaican businesses don't stay open for very long because of poor customer service like this. Not only that but the cashier was given attitude to the people who was previously before me...food was alright nothing to lick your fingers and rave about.", "author": "Briana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "Tried to order in friendly manner because\nI was anxious, was mimicked sarcastically. Food was very tasty, I would recommend this place if you're not a introverted home-body.", "author": "Sydney Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Such a delicious place to visit in dekalb market! Everything is expensive AF in there, so when I went up to the stand and asked about the amount of food included in the $11 platter, the woman at the register told me that I would be very full and have leftovers. It was noon and I was still in my brunch mood, so I decided to get the jerk chicken with waffles. The waffles are made to order, sweet with a nice touch of powdered sugar and fresh cut strawberries on top, with syrup on the side. The jerk chicken was fresh, hot, and juicy! While you shouldn't go there expecting the smoky, grilled heaven you can get on flatbush or the islands, this was a great taste on the classic. They also add in a side of coleslaw which I wasn't expecting but really rounded out the meal. It was so good I ate the whole thing, and was full the whole day.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "I ordered a veggie Pattie and chicken Pattie  (But end up getting a beef Pattie because they screwed up my order for that) smh . Along with that I ordered two jerk chicken meals  with rice and peas and cabbage . The veggie Pattie was okay . I didn't like the beef Pattie and the jerk chicken meals was Horrible.  The jerk chicken was not cooked properly.  The cabbage was uncook , hard , and very dry . The rice was soft and soggy and the little bit of peas they give you is a shame. I will never spend money here  again .", "author": "Dana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I tried the curry goat with rice and peas and the jerk pork with rice and peas.  The curry goat was mediocre.  The flavor wasn't bad but I thought it was too fatty and had too much bone.  But the jerk pork is just plain bad.  The meat was tough as hell and lacked jerk flavor or any flavor.  I didn't even eat it.  I just ate the rice.", "author": "Chandre M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Too over priced for basic Caribbean food. For a veggie pattie with coco bread, roasted corn and a Ting; $15! The filling of the party was tasteful but it was all mush. I wasn't able to identify any of the vegetables inside. The coco bread needs to be kept in a warmer. The combo of a hot patty and cold hard coco bread is a definite no no. Corn was just ok. I never had roasted corn, yes, never had it before. So I tried it without high expectations. Yes this is the only Caribbean food vendor in the market but they need to work on some things.", "author": "Sean J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Excellent food and service.i had the curry chicken. I love that they used cubed/stewed chicken, and not chicken on the bone. You got more meat this way. Very tender and just the right seasoning, spice-wise. The chicken tasted freshly cooked, and not like it had been sitting out all day. Will definitely be my go-to spot when I'm in the area.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I had the curry chicken roti, it was nicely seasoned, and juicy. Portion is a good size to share. Definitely would come back again and try something else on there menu.", "author": "Kimberly P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "The service here is horrible. I understand people have bad days and I can respect that, but don't take that out on your customers. Last night I stopped at Likkle More Jerk to grab a patty. I've personally never tried their food, but the friend I was with ranted and raved about how delicious they were. I walked up to the booth and was barely acknowledged by the gentleman who was chewing his food behind the register. I kindly waited for him to finish munching. I get it, it's been a long day..go ahead and finish your food. Never actually saying \"can i help you\", I assumed his shrugging gesture meant that he was ready to take my order. Cool. That's how you get down. Fine. It didn't trigger me at the moment. I began to order 2 patties, one for me, and one for my friend. He looks at me dumbfounded, then pointed to the empty patty case. Still unmoved by his arrogance. I let it slide. With a smile, and polite as can be I said \"oh, you're sold out. thank you.\" and began to depart. After he finally stops chewing his food he says \"we have veggie.\" So I say \"great! I'll take 2 veggie patties.\" He begins to put my patties in and whispers \"I'm going to put them in the same bag.\" I let him know that they're going two different places, so it would be awesome if I could have them in separate bags. He doesn't acknowledge me...but proceeds to place said patties in two different bags. He finally gets to the point where he rings me up. By this time, I'm getting hella irritated at this dudes attitude. But yet, I continue to thank him for his service with a smile. He then says \"Here's 2 patties - one for you, and one for the other you.\" Dude, just like ring me up and let me go home. I finally completed the process and was disgusted by the entire ordeal. I actually never even ate the patty because I was so turned off by the experience. I'll continue to bypass this place on my frequent Dekalb Market visits.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "Very pricey.  Tasty enough, but had little bits of bone in my jerk chicken that I had to keep spitting out discreetly in my napkin.  Huge serving of rice, but I would have appreciated more chicken for the price I paid.  Friendly laid-back employees.", "author": "R B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "The jerk chicken burrito is so good. This is one of the best places in Dekalb market hall . If i want a burrito, I'll be stopping here over chipotle from now on. The seasoning of the jerk chicken is just right. I recommend trying the burrito with pepper sauce on the side (i.e. West Indian hot sauce).", "author": "One L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Hands down the best food I've eaten at Dekalb Market. The jerk chicken or fish burrito is well worth the $9.99 price tag (usually two meals for me unless I'm really starving), the food is fresh as can be and the owner really cares about his customers' experience and enjoyment. Will continue to treat myself to the burrito weekly!", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "get the jerk chicken \u0026 waffles. it's the best thing i've had from City Point yet!!", "author": "Raj S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "You MUST try the jerk fish burrito! It's amazing. I treat myself to this every once in a while. IT is very filling and so delicious. The staff here is always very friendly and accommodating. Veggie patties are also great!", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "This is one of the booths at Dekalb Market Hall that I continue to come back to. The jerk to burrito is DELICIOUS and definitely large enough to have leftovers for a second meal. I wouldn't really recommend the salads as they are a bit bland, just go for the patties or the burrito!", "author": "Vanessa R."}], "servesCuisine": "Caribbean", "priceRange": "$11-30", "name": "Likkle More Jerk", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PIivzXTpGIBvk4zcLepX4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293784471"}