{"aggregateRating": {"reviewCount": 93, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "I love the food service is always good. I dont have any complaints. I love the jerk mayo very good", "author": "Kerriann F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Very great customer service and the food is awesome. i had the boneless chicken roti which was so great and filled me up. .my cousin had the jerk pork which was also great... the seasonings was just right, they also give u extra sauce on the side.", "author": "Qualyza T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Cool Hand Lu says; \"Tasty jerk chicken will put a smile on your face every time. If it doesn't, check your pulse.\"\n\nThis was my second time eating at the new Dekalb Market and after walking around for a few mins I opted for caribbean.  I was greeted warmly and put in my order for some jerk chicken.  My food was ready in about 3 mins or so and I was able to get some extra gravy for my rice which was quite appreciated.  The first bite made me happy with my choice for the day. Its sweet/salty/spicy combination was just what I was looking for.  About 5 mins of being engrossed in my meal and I realized I hadn't taken a pic. (Maybe I should have taken a pic of the bones to accentuate how good it was.). Only downside was that like most places they give you more rice than veggies and I love veggies. I could have done with some plantains as well. What's jerk chicken without some sweet plantains?!!  \n\nAll in all.  It was a great meal and definitely worth me revisiting.  I look forward to more tastiness.", "author": "Lucien A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "While the food was passable (I ordered once before), the delivery service is garbage. Much better delivery available from other restaurants --- do not waste your time.\nUPDATE:  Today, just as I was about to faint from low blood sugar and cancel payment on the order, it was delivered --- 1.5 hours AFTER the order was placed and 1 hour later than ETA. My oxtail was good.  Hubby liked his meal too. The food was fine.  DELIVERY was the problem.  Grubhub, do better!!!", "author": "Donna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "I had the jerk fish burrito and it was delicious. They give you a side of jerk sauce to go with it. I would've loved a little more flavor with the , but it was still delicious. The staff was very nice!", "author": "Herline H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Best Jamaican food in the area. Worth the cost. The likkle things are great portions. Their patties are really good but they have egg. The jerk chicken is my fav here. My friends keep coming back for the burrito and eat it so fast they always want another one to go.", "author": "Andrea Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Came to dekalb market hall excited to get some curry goat. It didn't disappoint. Had it with rice and peas. So good.", "author": "J. Karim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Favorite vendor at Dekalb market! Likkle more has huge portions for great prices - you can definitely share the meal without going hungry. \n\nThe curry chicken roti is incredibly delicious and flavorful. The chicken is always most and cooked to perfection. A go to when I'm hungry! Make this your first stop at Dekalb!!!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "Went with the classic jerk chicken, and the waffles. You don't see too many jerk chicken places doing waffles, so I was hesitant, but intrigued. They're making the waffles fresh right there, I saw it. Yet somehow what comes out is a flacid waffle, that tastes very reminiscent of the always disappointing, Eggo waffle. Also, no special syrup or dipping sauce here, just some very generic, store bought maple syrup. Waffles are easily a weak 2 stars.\n\nBut onto the jerk chicken, it would be preposterous to judge a jerk place based on their waffles. Surely the chicken would shine through, and redeem for the poor waffle, right? Ah, not so much. Definitely nothing special about the chicken. It was cooked alright, though the leg was a little on the dry side. The seasoning was a little weak. As a white guy, my tastebuds are usually happily assaulted by the variety and excess of spices in jerk seasoning, a far cry from my baseline diet of white bread and mayonnaise, but this chicken didn't quite do it. The spices were there, but not nearly as strong and flavorful as most jerk places. I'd call it a 3 stars for the chicken, and giving them the benefit of the doubt with the waffles, and overall weak 3 star review.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Beef patties for starters then try the jerk chicken and after that you are in love. Thanks for being here Chef.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "This is probably one of the best places to go if you want homemade beef and chicken patties. Their jerk chicken Burrito is best I've ever had. You will never experience anything like it. I never had chicken burrito mixed with rice, peas and cabbage! The jerk sauce is on point. Not overly spicy. The combination of everything is perfect.", "author": "Ingrid B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "Worst jerk pork I've ever ordered and had to throw it out after spending $11 and when I went ahead and told someone at the establishment about it they simply replied \"yeah we know someone told us already that the jerk pork was bad\" showed him my receipt and no I'm sorry, no let me compensate you with a replacement, nothing! So I wont ever be going back!! Don't waste your money or time there. Poor customer service and bad food.", "author": "Sin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "The first time I stumbled upon Likkle More Jerk, I was pleasantly surprised to find this little gem amongst the sprawling selections in the Dekalb Market Hall. I was desperate to find something quick, inexpensive and edible at the time, and their flaky, flavorful and sufficiently portioned chicken patties fit that request perfectly. \n\nToday, I treated myself to the curry chicken roti, and I'm pretty sure I looked like something out of Animal Planet as I devoured the entire thing without hesitation (or shame). While waiting for my order, a woman was singing the praises of their \"jerkito\" (jerk burrito, natch), so that's next on my list.\n\nAdded bonus is their pleasant staff, who make everyone feel welcome, and encourage feedback about the meal. From the looks of it, quite a few folks are repeat, loyal and satisfied customers! \n\nCheck them out!", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "I ordered the jerk chicken with rice and peas. It was so flavorful. The chicken was juicy and a good seasoning of jerk. The rice with peas was the best i have ever had. This is by far my favorite jerk chicken and rice\u0026peas. I have tried many. #1 in my book!", "author": "Bella-Love B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Best Caribbean food and fresh. Customer service is awesome and i will definitely return if in the area", "author": "Courtney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Had the beef patty. Really refreshing choice in the city point food hall. Both the chicken and beef patties were great.", "author": "Jonathan I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "It's an awesome Jamaican restaurant with American influences. For example, they have a Jerkitoburrito which is a jerk chicken burrito with rice and peas. Also happens to be my favorite on their menu. My girlfriend from Jamaica also heartily approves.", "author": "Amir H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "I've been here plenty of times and I usually just get the beef patty and coco bread. But this time I decided to get the oxtail with white rice which does come with cabbage and carrot. Now the portion size is ok and everything tasted good especially the gravy. Now my only issue is the oxtail could've been cooked a little more because I was definitely fighting to get it off the bone. Other than that, it tastes better than most places I've been.", "author": "Tee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-13", "description": "I ordered the Jerkito fish burrito but was given the chicken burrito. Luckily I still eat meat lol. I was given two sauces, pepper sauce and bbq sauce. I enjoyed the flavors of the burrito but it was two big and sloppy to actually eat as a burrito. \n\nAlthough it was big I wouldn't say that portions are overwhelming. Certaining enough to fill u for lunch but will definitely need food later in the day. I wish chips are something that came with it.\n\n I like the use of the roti as the wrap but I would have preferred to order the roti on the side with the chicken and rice on the side. I am happy that every bite had more chicken than sides so it made sense to pay for the $10 burrito. I would probably stop by again to get the roti and a side of something else. I give them 3.5 overall.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "The management was great. Very good customer service. Food good and very clean establishment.", "author": "Nina D."}], "servesCuisine": "Caribbean", "priceRange": "$11-30", "name": "Likkle More Jerk", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PIivzXTpGIBvk4zcLepX4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293784471"}