{"aggregateRating": {"reviewCount": 93, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "It has become absolutely difficult to find staple simple food that we were raised on in Brooklyn. Sometimes you just want something as simple \u0026 pure as a beef patty and coco bread. However, the reality is, you can no longer find this in Williamsburg or Bushwick, you would have to travel to Flatbush in order to find these Jamaican/Caribbean treats that were once found on every Brooklyn corner. \n\nI found an awesome Chicken Patty with coco bread not too far out in Brooklyn at Likkle More shop, located in the Albee Square/ Dekalb Market. \n \nReally good stuff and it reminds you of Brooklyn, $5, plentiful, and totally filling. \n\nIf you are craving a beef patty or chicken Patty with coco bread give Likkle More a chance.", "author": "Millie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Stopped by here the other day, wasn't able to take any pictures but the beef patties are amazing!!!!! They are a must try, there menu is filled with authentic jamaican dishes and will update when I got back, staff was friendly and very helpful.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "I really like how the jerk chicken is flavored, it's not to spicy my for taste bud. The rice and peas was ok but I had better. On my next trip there, I want to try out the oxtail and curry goat.", "author": "Irish M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "I must admit I am always a bit hesitant to try new Caribbean spots, especially in the mall ... but the food was very good here! The portions could be a bit bigger but the food was very tasty! Do yourself a favor and try the Jerk Chicken Burrito, it does not disappoint!", "author": "Adeola S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "The positives are:\n1.  Hands down THE BEST patties I've ever had.  This, is the #1 reason above all else to go here.\n2.  It's the only decent Caribbean food I can have delivered in Park Slope.  If you know another option, message me IMMEDIATELY (and if any of you say \"Gloria's\", well you and I have a different definition of \"decent\")\n\nThe other menu items were okay, but not mind blowing.  The curry chicken roti was okay, but not great.  The curried goat with rice and peas was okay, but not great.  I haven't had the jerk chicken yet to be honest so I'll revisit when I do.\n\nBut honestly... dem patties is all you need.  Stick with the program.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Ordered delivery \u0026 was pleasantly surprised. I didn't expect to like this place. After living in Crown Heights for almost 20 years, I've been a little spoiled when it comes to Jamaican food. Most places in Brooklyn outside of Crown Heights and Flatbush have \"OK\" Jamaican food to me. That's just my opinion. \nI ordered beef patties with cocoa bread and a small oxtail rice and peas. I figured if they can at least get these two things right, I may order from them again. The oxtails were good and seasoned well which means the gravy on my rice was hitting all the right spots. The beef patty was good as well, the Coco Bread was okay. I guess I'm a little use to a sweeter version. My delivery was fast, within 15-20mins but then again I do live not far away. Overall I had a great experience and can see myself ordering again.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Got the jerk chicken and 2 patties for take away. It was very tasty and tasted very authentic. It wasn't overly spicy but still very flavorful. \n\nPlenty of seating around the location. \n\nClover to accept your cc.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "More like a Lotta More Jerk. Because I want more!!! This place is great, fast and efficient. I ordered the oxtail stew with rice and peas and cabbage salad and it was mmm..mmm good! The meat was ample, tender and falling off the bone in a delicious sauce. I loved the rice and beans, however, I wanted more beans in the rice. Would that make it Beans and rice then?  \n\nAnyway, I was delighted to sway to the lovely rockers reggae music that was booming from the speakers. Hey I miss my clubbing days. I felt like grabbing another customer to dance. Anyway, back to the food. Delicious and filling. \n\nIt is located in the Dekalb mall which is a new fresh, hip place to take a date, your kids or spend some time alone eating some yummy Caribbean food.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-14", "description": "Tried this place the first week the market opened. I was underwhelmed. Jerk chicken was pretty good but everything else fell flat (rice and slaw). Bland and dry. Had the sides been seasoned enough to round out the meal then it would have been more memorable.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "The jerk chicken with rice peas was plentiful in portion size.  Beef patty with coco bread was also great.  The jerk fish was okay as an additional extra.", "author": "Ken W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Not gonna lie I ate here mostly because Taina on the register was so nice. The food hit the spot too. Classic jerk chicken served bone in. The jerk had a bit of spice but not enough to scare anyone away. Rice and peas were classic and on the bottom had soaked up some of the jerk and tasted great. A great stop if your in the sellable and don't now what to have. Would say it was a bit pricey for the serving but it is NYC.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Super juicy chicken with great seasoning! Good portion of sides (hand the rice and peas). The staff were super warm and friendly, the lady who handed the food to me joked about me being able to handle the heat from the pepper but to be careful. Pepper was a nice heat and good flavour. So many options and I am glad I chose this spot.", "author": "Brandon Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "Great Food! The Jerk Chicken has a great level of spicy yet still loaded with flavor. Great spot for lunch, nice quick service", "author": "Raymond L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Jerkito Burrito (chicken) is so damn good! This has become my go-to at Dekalb. It's just so good! The perfect mix of ingredients, spice, meat everything just wow.", "author": "Dominique S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "I was in the mall and decided to try the food court. I've never tried the food there and I have been craving for some jerk pork, so I decided to give here a try. I ordered the jerk pork w/waffles. The Waffles were sooooo delicious! I did enjoy the jerk pork as well, but I wish it was more spicy. I love all things jerk, so thats what I needed. I do understand you have to cater to all types of people being the area its located in. Overall, it was really good. The seasoning was on point. Just wanted more spice!", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Located in the food market, Likkle More Jerk has a bunch of offerings, from jerk chicken/pork and island dishes to salads and wraps. Service was speedy! Jerk chicken was well seasoned, flavorful and moist, but a little too burnt for my liking. Waffles were delicious and soft, coleslaw was light and crunchy!", "author": "Joyce T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Delicious! Is the only thing I can say after having food from likkle jerk. The jerkito burrito is a Jamaica roti stuffed and I mean stuffed with rice and peas, jerk chicken, cabbage and it all comes together with a spicy mouth watering mayo sauce. I also tried the oxtails and boy the meat was so tender it completely fell off the bone. I honestly can't wait to stop by this place again.", "author": "Rosie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "Jamaican food is one of my favorites, Jamicaan food is my culture. It is completely underrated as a cuisine, and jerk is lowkey one of the most greatest types of food in the world.\n\nBut this is so sad. My mother in law ordered her food, had questions about the food that went unanswered. She brought it over, and the platter was a shadow of what it should have been. The cabbage was off, it was on the dry side, as was the rice which had little to no beans and no real hint of coconut milk. The chicken was cook fairly well though the love just wasnt there, but what dissapointed me most was the sauce, the \"jerk\".\n\n100% barbeque flavored jerk sauce. This could be sweet baby rays, or another name brand sauces jerk flavor. There was no texture, not much heat and not the smoky kind i am used to, no love in it. This was like a warm turkey gravy with a little space. I could cry. I understand not everyone eats their food too hot, but for people who are looking for jerk chicken, they wont be here.\n\nThank you, but where there are so many places down here, I will not waste my time.", "author": "Devon O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-17", "description": "I had the jerk pork burrito. The pork was a bit dry, the burrito was kind of falling apart, and it just tasted like it was missing some sauce or flavoring to bring all the ingredients all together.\n\nService was quick and friendly, although the cashier's friendliness seemed to quickly disappear after I didn't give her a tip (I don't tip at fast casual spots like Chipotle). Overall, with the plethora of excellent food options in Dekalb Market Hall, I would try else where. But I appreciate the innovation (jerk + burrito combo).", "author": "Carlo K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Solid flavor. Had the Fish Jerkkito Burrito. Total price is 10.88. An average sized burrito. About the size of two gyros from a street cart. If your on the budget side, this is likely the best bang for your buck in the market place. There are few dishes for less of a price with protein that isn't fried or beef. Came out pretty fast too.", "author": "David M."}], "servesCuisine": "Caribbean", "priceRange": "$11-30", "name": "Likkle More Jerk", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PIivzXTpGIBvk4zcLepX4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293784471"}