{"aggregateRating": {"reviewCount": 93, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-07", "description": "One of the many gems in Dekalb Food Hall, this Caribbean eatery is a must! It has all the no-frills 'classic' dishes that one might crave. I got the oxtail stew, with their cabbage and rice and peas. The oxtail stew was meaty and fall off the bone, cabbage (and carrots) vegetable side was nicely seasoned with a bite to the vegetable, and the rice, oh the rice. Please ask for meat gravy over the rice!\n\nI also got the chicken patty but it did not survive the photo-taking as I was famished. MUST TRY!!!", "author": "Soki N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "Are you also indecisive to a fault?\n\nDekalb Market Hall is an amazing place that I feel lucky to have nearby, but it can be so hard to decide what to eat with all these options. It's even worse when you're hangry.\n\nSo my advice to you when you're feeling stabby because you can't decide what to eat:\n\nPick up a beef patty from Likkle More Jerk. It's $3 for a delicious snack that's probably the best value in the whole hall, and that you can walk around chomping on as you decide what to do for your main meal.\n\nIf you don't find anything worth getting anywhere else, circle back and rock a Jerkito Burrito. Those are great too. \n\nBonus: \n\nIf your kid does something wrong while you're here, you can say, \"Look what you did you likkle jerk!\" And then leave him/her alone to be accosted by psychotic thieves while you take a trip to Paris.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "When in Brooklyn, great Caribbean food is a must! Likkle More Jerk in the Dekalb Market is all around amazing! \n\nI ordered the jerk fish with rice and peas, which comes with a side of cabbage. The cabbage was perrrrrfect! The jerk fish made my nose runny and it started a mini fire in my mouth, but it was all worth the pain, haha. \n\nI got some extra jerk sauce on the side because I'm a saucy eater. It was delicious...a little sweet, a whole lot of spicy, and a whole lot more flavor! \n\nThere's tons of options in the Dekalb market, but definitely put this on your to do list!", "author": "Shantee E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-28", "description": "My cousin bought a couple of patties - one chicken and one beef. He gave my husband a taste. He liked them. I couldn't eat them because I'm gluten free, so this review is for him and myself. His five and my one average to a three.", "author": "Jacqueline F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "So I was just exploring the food stalls here and came across this stall. Now I've had authentic Caribbean chicken patties when I was abroad so I was excited to try them. I ordered 1 chicken patty and decided to eat it right away. Oh my! I think this was the best chicken patty I've ever had. The crust wasn't too thick or thin. The filling wasn't dry and there was enough filling inside. The patty had a slight spice to it which was enough for me. All in all, it was an amazing chicken patty and I would go again and again if I lived close enough.", "author": "Mayuri K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Solid Jamaican food in Dekalb market. It's all the way in the back and close to the seating area. You can't miss it.\n\nI ordered oxtail stew for lunch. It's sweet and tender, just like what you always wanted for oxtail. Spicy sauce on the side is heaven. It's $17 but good portion can split for 2 meals.\n\nI would come back to try the patties and Jamaican special drinks/ juices in their fridge.\n\nOnly reason giving a 4 star is because they don't have brown rice. It would be nice to have it as an option.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Wow! I just had the jerk chicken burrito, it was everything \u0026 more. I thought it would be super dry because that can happen with jerk chicken but no it was amazing!!' I wanted to buy another one but I'm on a diet lol. Great job", "author": "Tasama C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "Hey yo. \n\nFirstly, I can say that Dekalb Market Hall is quite the site to see. The food hall especially has over 40 food vendors, so instinctively, I wanted to check it out. On the day I came here, I felt something running through my bones, so, I came here after work craving some Jamaican food and Likkle More Jerk fit the bill. \n\nChomped:\nJerk Chicken Plate w/ Rice and Peas\n\nI don't mean to sound like a jerkface, but feel like I've had better jerk chicken. However, the plate definitely provided an adequate portion. The chicken could definitely use... a likkle more jerk seasoning. I totally forgot to check in/mention Yelp for a discount, but I'll totally come back to try the oxtail stew or curry goat though!", "author": "Jerry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "I came here twice in 1 week and that should tell you something about this place. I enjoyed the jerk chicken with waffles. The waffles were soft and buttery. The jerk chicken had a nice smokey char on it. Loved the spices and the flavor. They also include lots of sauces on the side. There's always seem to be a line for this place during lunch hours but the 2 times I went, there were nobody ahead of me. Oh yeah, the beef patty was great too!", "author": "Mimee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "If I order out for lunch and it's bad - my day is ruined. \nWhen I order out for lunch and it's good - I'm happy. \nWhen I order out for lunch and it's outstanding - I'm writing a Yelp review. \n\nI just had LMJ for the first time and the Jerkito Burrito w/ fish was unbelievable. The bread was roti bread, the sauces tasted like tamarind and yogurt. Every few bites I would get a hint of cocunut milk and the light green hot sauce was perfect. It was a symphony in my mouth. \n\nI usually go to Roe's in Bed-Stuy for Jamaican food. But the WAIT is prohibitive. I am very excited about this tantalizing teaser, palate pleaser of a place.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "The Jerk Chicken Burrito here is definitely worth the hype. Tbh the chicken isnt as spicy as I would like, it being jerk chicken and all, but I get that the crowd they are serving doesn't necessarily have the palate for the spice level of Jamaican cuisine. That being said the burrito really hit it out of the park on incorporating Jamaican flavors in a unconventional way. Its a knife and fork kind of burrito, big and wide filled with chicken, rice and peas, cabbage slaw, wrapped in a roti and drizzled with a somewhat spicy jerk sauce and a mild aioli/mayo. \n\nIt took a bit longer that I would have liked to get the food (10 mins) but it was quite delicious.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "I went here on a Friday evening with my cousin from the Caribbean. She wanted to try their jerk chicken because she believes that Jamaicans make the best jerk chicken. She also was not impressed with a lot of the food choices available because they're just unheard of to her and/or she was adamantly opposed to trying something out of her comfort zone. She said the jerk chicken was good and what she hoped for. They have a Yelp deal when you check in but since service is so spotty down there I wasn't able to claim it. I'll definitely come back here and get something for myself in the future.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-28", "description": "I guess the food here is based on the area. We dropped by to have some quick lunch. Staff is very nice and helpful when you're deciding what to order. We both ordered the Jerk fish. One JF Wrap and a JF Salad. The wrap comes with rice and peas(beans) and the salad is a bland mix of prepackaged greens, some pieces of mango and dressing on the side. The fish I found to be very bland. They put sauce on it but I found it so bland i ended up putting more sauce and even hot sauce on it. The wrap the BF said was good. We spent nearly $25 on these two with 1 bottle of Ting. Honestly I feel like this is way to much for bland not filing food. I was disappointed I ended up going to get a crepe. I didn't give them 1 star because I feel that maybe if I ordered the chicken it would've been a better experience.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I stumbled upon this Caribbean unicorn while shopping with my family! I told them to \"Leave me...just leave me\" I ordered myself the jerk chicken and sat at a table alone and devoured this food! The chicken was packed with flavors!\nThe service was awesome- a really friendly staff that made suggestions and wanted me to enjoy my food more than I did lol! Portions were decent as well! \nI'll definitely be back!", "author": "Kris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-09", "description": "Sooooo...I'm a tourist and I've only visited New York once! So this go round, I'm staying in Brooklyn and ventured to the DeKalb eatery, it's at the Fulton street mall. I walked around and around and saw this place. Someone else had placed an order, a burrito, and it looked really good. I go to the counter and I ask the guy what that item specifically was. He said a Jerkito Burrito. It comes with chicken or fish. Knowing that jerk anything tends to be spicy, I asked how spicy was it. He had an attitude and said it wasn't really spicy. What's not really spicy? My wife can't take a lot of heat, so we needed to know. He answered again saying about a six. Ummm that's a little more than \"not really spicy\". I ordered the chicken burrito. It took what seemed like forever. When he called my ticket number. It was already wrapped in a paper bag. My fault for not checking, but the order wasn't my burrito. When I went back to tell him, a lady said, \"I told him\". Then she gave me my burrito. I sat down and it was cold. So disappointed. I didn't even feel like going back. It tasted good, but would've been better if it were hot.", "author": "Marquita a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Jerk chicken cooked to perfection to be completely honest. Also, why did I never think of jerk chicken and waffles? Seems obvious, no?\n\nVery happy with this spot tucked away in the Dekalb Market. With all the choices available I still find myself coming back to Likkle over and over again. Not only is there good food, there is good music and you can't help but dance - maybe even whine - while you're waiting for your meal. The staff is always friendly and won't trip if you ask for extra sauce. (Which I know may seem trivial but this is NYC and a lot of businesses charge extra lol). \n\nIt is deserving of even more than 5 stars. So if you ever find yourself in Brooklyn, check it out. You won't be disappointed. Also, you can't go wrong with the Jerk Chicken and Waffles. Trust me on this.", "author": "Brandon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Literally eat here at least once a week! The Jerk Chicken Burrito is ADDICTIVE! I want one right now just thinking about it, lol. anyway, great food cool staff and quick service!", "author": "Tanazia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Maybe jerk isn't for me? I ordered the jerk pork with rice and peas. The rice was dry and rubbery. The pork hardly had any meat on it. It was difficult to eat because it was mostly bone and fat. I didn't finish my meal because I couldn't.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "#Ordered the Beef Patty with Coco Bread. Beef Patty was awesome. Coco Bread not so much. Tasted just like #bread. Too much bread.\n\nStill #looking for Coco Bread as good as the one from Caribbean Spice (Gainesville, FL). Can't find it in #NYC.", "author": "FakeFoodBabyNY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "My bf tried the jerk chicken with rice and peas (oxtail gravy).  The prices were competive with most of the Caribbean places on the area ($10.99).  He said it was really tasty and the portion size is perfect (the container is deceiving).  He's a fairly big dude so I take his word.\n The smell was arresting me, so I tasted the chicken.  Juicy, smoky and tasty. I was impressed that it had the signature outdoor jerk flavor that is synonymous with the dish.  He said everything reminded him of home with the taste of the food and the vibes/music in the corner by the stall (yes, Jamaican).  We will be back to try some of the other items like the patties, oxtails and of course Bigga soda when they get more flavors.", "author": "Farrah B."}], "servesCuisine": "Caribbean", "priceRange": "$11-30", "name": "Likkle More Jerk", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PIivzXTpGIBvk4zcLepX4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293784471"}