{"aggregateRating": {"reviewCount": 93, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Got the curry goat platter, which came with a generous portion of goat curry, rice and peas, and coleslaw. Goat was nice and tender, just be careful of the bones. WIll definitely be back, and a new favorite vendor at Dekalb!", "author": "Sabeena T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "The jerkito burrito (with catfish or chicken...doesn't matter) is THE GREATEST THING EVER INVENTED ON PLANET EARTH. It's huge, delicious-times-a-million, and medium priced.", "author": "Hans F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Jerk pork was mostly all fat! And bones! The very little meat I did have was very tough. I don't understand how they could serve something like this to someone. This place is too expensive for that. I won't be returning", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "One of my favorite places in Dekalb market hall. The food is AMAZING which just the right amount of spice. Me and my wife are in love with the curry chicken roti. The prices here are great as well, most of the dishes you can split because the portions are so large. Honestly, the isn't a better West Indian option in the area. The only downside is the service isn't the best and the food can take a little long, but it's well worth the wait!", "author": "Charles A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "It was my first time eating there my husband had the boneless curry chicken roti which he loved , I had the oxtail meal and when I say that the oxtail was so good \u0026 tender cooked perfectly and the slaw and rice \u0026 peas was great , I'm definitely going back to get some more oxtails they really are amazing ,it's a must go and friendly workers made it that much better", "author": "Bkz Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Good food, flavorful, tastes like it's prepared with special care. I recommend the curried goat. The chicken and beef patties are also very good.", "author": "Sebastian P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Best Caribbean place Ive been to. The food is delicious. I came here on 10/22/17 with my boss and tried the boneless chicken roti, jerk fish with rice and peas and carrots and cabbage, and the waffle dish. For a first time customer I had no complaints. Service was A++. Music was excellent to. No other way to spend time here eating great food \u0026 most of all listening to soca \u0026 reggae. Yeaaa MON.", "author": "Dreskii L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Good tasty food. Waffles little soggy - I had the jerk chicken with waffles. Chicken was solid with a capital S. Would reccomend", "author": "Abram B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Love this place. Great Curry goat and the patties are full of flavor. Staff are always super friendly.", "author": "Linh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "I went with a friend and was surprise how good the food was, and the staff was very friendly. I took some friends back all the time and I get the same reaction of how the place is good I usually get the jerkito burrito. Really nice, I thought I would be a little more critical about it even though I'm Jamaican but I can't deny the food is amazing.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "OMGoodness!  As a native New Yorker who LOVES good Jamaican food, I get excited whenever I find a place that hits the spot; and this place does JUST that.  Having recently moved back to the East Coast from Texas, I've been in search off some finger licking jerk \u0026 curry.  After checking out the reviews I decided on Likkle More Jerk \u0026 was not disappointed.  My son \u0026 I ordered curry chicken roti, jerk chicken, rice \u0026 peas and coco bread (to go).  Can I just say that none of it lasted long enough to make it to my in-laws in Park Slope (which is not a far drive).  Everything was freshly made \u0026 well seasoned (not salty, like some other places I've been too - but marinated w/curry \u0026 jerk).  The roti was flaky \u0026 cooked to order... the jerk chicken was nice \u0026 juicy.  My taste buds \u0026 appetite are satisfied.  We're only here for the weekend but will definitely be back before heading home to DC.  Sadly, there isn't any good Jamaican food in the DMV so I'll have to get my fix before leaving.", "author": "Malene L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "the first time we ate there , dishes and patties was so delicious ! (In August ) But today , it wasn't good and plus one of plates have only bones and no meat (jerk pork) ....patties wasn't either.. I don't think we will return", "author": "Priscilla R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "great food great service great cashiers food is delicious jerk chicken", "author": "James A."}], "servesCuisine": "Caribbean", "priceRange": "$11-30", "name": "Likkle More Jerk", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PIivzXTpGIBvk4zcLepX4A/ls.jpg", "@type": "Restaurant", "telephone": "+19293784471"}