{"aggregateRating": {"reviewCount": 73, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "best coffee in nyc hands down!! \n\nyou have to try the sparkling cascara.", "author": "Basil Vaughn S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-23", "description": "I've not written review in a few years.  It's bummer that it takes an awkward discussion about how I should not put milk in my pour over.    The gentlemen, is a pure gentlemen and showed stern conviction to the profile of the select estate coffee bean that cost me a well worth $7 cup of coffee, when he insisted that I drink the coffee black.  At first I was like cool this guy knows his beans, and I had nostalgia of when I would have in depth coffee varietal discussions back home.  Or when I was considering importing coffee from central America as a distributor and would enjoy the friendly conversations with farmers in Nicaragua.  Today, I just wanted a pour over with steamed milk.  I tasted the coffee before I poured the milk, to show grace to the man's effort--his conviction to the varietal and roast flavor profile.  And even though he clearly made me feel like he did not want to talk to me, because he was bothered by my milk, I smiled tasted to coffee without milk sat with it. Soft silk, from the still present oils of a fresh roast, coated my tongue, as light fruits of black-cherry danced across the back of my palate, medium bodied weight on the center of my tongue.  He was absolutely correct, a fine bean to thoroughly enjoy a crafted, single estate bean, without any need for any milk. However, today is a morning that I wanted milk with my coffee, and it was an awkward feeling and effort to accomplish it.  This place is definitely worth it, and the gentleman is a gentlemen who showed conviction to the bean, the farmer, and the flavor profile that awaits their drinker--I'll be back next time to enjoy a pour over without milk :)", "author": "Luciano A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Their furniture and the use of plants suggest that they are looking to be a hip and cool place. However, when you visit there in person you would feel like you're at au bon pain or normal starbucks at best. I asked for Vanilla latte but they don't have such option (as aspiring fancy coffeshops would). They had oat milk though! (for sure)", "author": "Hyo Jung K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "I don't love the coffee here. It's too burnt for my taste. The prices are too high. The staff isn't very friendly.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Coffee is good, but the no wi-fi on the weekends is a real killer if you are looking to get some work done. I would gladly buy 2 to 3 coffees, if you offer solid wi-fi. I mean what coffee shop doesn't offer wi-fi on the weekends? You have to be kidding me. Now, I will probably never come here again.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Beautiful space. good coffee. Comfortable seating. I go whenever I am in the area and have a book to read.", "author": "Randal V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "I am in the area for the next couple weeks for work and I just happen to stumble upon this nice little coffee shop.  I like that there is space to do some work here.  I like the free WiFi.  I like the seating, although it could be a little bit uncomfortable on a bench...but I still like sitting on a bench by the window.  I've just gotten the Americano and I like the smoothness of it.  I just wish they had more of a variety on the pastries and snacks.  Maybe they have more stuff in the beginning of the day, so I'm missing out on the good pastries.  But it's a nice place and will be my hangout when I'm in the area.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "I have been waiting for a good coffee shop to open up near my my apartment for seven years.  I basically stalked this place until it opened and came on the first day! I had been to the one in Williamsburg so I knew what to expect.  Simple menu, tasty treats, jungle decor.  I'm a tea drinker, so wish they would add some teas.  Regardless, I am happy they are here and even happier that it's not a Starbucks or some other mediocre situation.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "They've created a peaceful environment in a bustling corner of Downtown Brooklyn. Beautifully arranged space. Hubby enjoyed the cold brew coffee. I ordered the aromatica which is their version of tea. It's fruit infused water, and they can serve it either hot or cold. I opted for the iced version of pineapple/lemongrass which they told me would take a few minutes to prepare. It was refreshing and worth the wait. They offer free water/cups, WiFi, outlets, and plenty of seating. Service was friendly and helpful. No complaints here.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Given how hard it already is to get a table here, this place doesn't really need another great review but it certainly deserves one. The coffee is very high quality, they bake their pastries on site so it always smells lovely, and the decor is unbeatable. It's like a little oasis in the middle of Brooklyn. Great addition to the neighborhood!", "author": "Tara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Love this place!! Very industrial and veryyyy packed. Hard to find a seat but worth the wait. Close to a bunch of cute restaurants for if and when you get hungry.", "author": "Zelal F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Gets pretty busy here even on the weekdays. This isn't an ideal spot to study or work because their aren't many tables, but I am a sucker for aesthetics and this place it the spot. The coffee is relatively cheap and delicious.", "author": "Perel D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "The Decour is beautiful. But the price for the  cup of coffee is ridiculous. If I had known I would have just gone to the coffee coffee cart that I had passed. Overpriced coffee one size only Adderly ridiculous. Do yourself a favor and head to the coffee cart up the block on the corner. You can't go wrong.", "author": "Daniel S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "Devocion", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "276 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U1RLTtfo-1-q9cCIkrE0mQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182856180"}