{"aggregateRating": {"reviewCount": 73, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "My go-to neighborhood coffee spot for beans, pour over, and pastries. A slightly luxury given a drip can be $4 on average and latte at $5, but it's proven to be a great space to work (WiFi + outlets) without the normal loud white noise you get from Manhattan cafes. \n\nDevocion's Williamsburg location was one of my favorite spaces to go and decompress but it was simply too much of a hassle getting from South to North Brooklyn. I'm glad this spot is now here to give off the same vibe and great coffee!", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-04", "description": "Perhaps the rudest customer service I've ever had in a coffee shop. When asked if I wanted take-out or eat-in I looked around for a spare seat and said \"eat-in if there's a spare seat\" to which the female assistant just looked blankly and said \"we don't control the seating\". I couldn't believe how rude she was being and the conversation went downhill from there. I said she'd lost a customer and she replied \"that's fine\". \n\nSo astonishingly bad. I asked for her name so I could  raise it with her manager but she refused to give it. What can you do but walk out.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-31", "description": "The interior is stunning. The windows are huge and let in a bunch of natural light and there's legit trees inside (or very large plants). \n\nTheir coffee is great too! I don't drink much coffee but know a good latte when I have one. Saw a bunch of people sitting just chatting or working - it's a really nice place to just hang out and catch up with a friend.", "author": "Theresa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Probably my favorite coffee spot for several reasons. When I sit down at a coffee shop for more than 30 minutes I am definitely looking for a place with low to moderate noise and great ambience for concentration. The seats need to be comfortable and there definitely needs to be an outlet and wifi. After visiting many cafes, I either get great work environment and crap coffee or bad work environment and great coffee. Devocion does it right for both of these qualities that I seek. \n\nI love studying here in the morning/afternoon since the place has allows for a lot of natural sun-light to illuminate the entire shop and the plants in the middle of the cafe adds to the overall ambience. The center platform has chairs circled around a table for casual socializing, but there are also tables towards the back for when you need time alone to study.\n\nAfter reading more about the company's story, I discovered about the intricate process that reflects in the quality of their coffee. The beans, which are from select farms in untamed areas of Colombia, go through dry milling to remove the parchment. When the parchment is removed, the green bean that remains is shipped to Brooklyn where they roast it. They are the first TRUE farm to cup roasters and the only company that only roasts farm fresh coffee so you know you are paying for the quality!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "Devocion is a great addition to coffee shops in the Downtown Brooklyn area. It's by far the most aesthetically pleasing place to grab a latte and sit with a book to relax.\n\nDevocion boasts some of the \"freshest coffee on the planet\" sourced direct from Columbian farmers and roasted in the US. You can tell they are thoughtful about their beans and where they're sourcing from. \n\nThey have a great selection of baked goods, and the most weirdly delicious croissants. I recommend the plain and guava. As for coffee, I love my typical cold brew (even in the winter months), but their espresso and brewed coffee won't disappoint. \n\nIf you're in the Downtown BK hood, come through!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "This place is beautiful and the staff was very friendly. I do not love iced coffee, I much rather have a steaming hot cup of coffee whether it's warm or cold. However, the barista suggested I try the nitro cold brew and I'm so happy I tried it. Delicious! Super fresh and truly a joy to consume. \n\nThe atmosphere is welcoming and you kind of feel like you're among the jungle with studious New Yorkers surrounding you with technology - ok so maybe not the jungle but you get it! Definitely give this place a try.", "author": "Sheynelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-20", "description": "Coffee is not bad. I find it a bit bitter overall, but I prefer medium-bodied everything really. \n\nIt's a cool set up, with the plants and platform in the middle and all the wood. \n\nService is interminably slow, however. For me, that's a huge downside for a coffee shop. I've been in there in the morning on my way to work and, despite there being no line, it took them 12 minutes to get my order together and ring me up. I just got a cold brew, which is on tap, so I cannot explain to you why they were so sluggish. Anyway, it's expensive and slow, so if that's what you're looking for, this is the place for you. I can't imagine they'd bother anyone wanting to camp out, either, so there ya go: target demographic.", "author": "Claire F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "I think this is going to be one of my  staple coffee shops in the downtown Brooklyn area. The decor on the inside is so cool with the trees and wooden rustic type chairs. I came here with one of my friends and we were able to have good conversation in the relaxed atmosphere. Even though most of the seats were taken when I arrived by the time I ordered seats became available. \n\nI just had a latte and banana bread. Love the cute yellow cup in came in and the banana bread tasted so good. Saw persons around on their laptops and reading and wifi is available as well. Not sure how good the wifi is as I didnt use it but good to know!\n\nAlso we didnt take long to get our orders probably in 5 minutes or less and my latte was in my hand. \n\nDefinitely would be visiting this spot again!", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "Disclaimer: I am not an avid coffee-drinker so my review might not be of much help to someone with a more sophisticated coffee-bean-tasting-palate lol but....\n\nAs someone who usually doesn't like coffee and despises the distasteful after-taste I have to say that the cappuccino is AMAZING! I decided to give it a try and it did not disappoint. I was intrigued by their claim of importing the coffee from Colombia farms and then roasting the beans here in Brooklyn and I've got to say, of all the coffee I've tried in my life this has been the best yet (even better than Starbucks)! There's no yucky after-taste and it definitely tastes very smooth. \n\nThe inside is gorgeous and very chill, with a nice earthy/green plant jungle in the middle that just gives off those peaceful vibes. I usually find coffee shops a bit anxiety-inducing because of all the work and stressed-out folks (or so they seem) in there, but the ambiance is definitely another here. It seems a lot more \"breathable\" and relaxed.", "author": "Lucy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "This coffee shop has certainly earned my \"devocion,\" as I love everything from its great coffee to its beautiful interior space to its exquisite latte art. I was never addicted to coffee until I joined a firm that's near this location, but I feel fortunate that Devocion is nearby to facilitate that journey. \n\nThe interior is beautiful, with an open floor plan, tall ceiling, greenery, and large windows bringing in ample natural light. This alone makes me wish I had more of a \"work from home\" type of job so I could spend the day working here while sipping a cappuccino or two. \n\nBut I must say my favorite thing about this place aside from its great coffee is the fresh selection of pastries - not a large one, but their croissants are very fresh, flakey, buttery, and usually are still warm when you get them! The best is when they have guava and gruyère croissants... they are to die for! \n\nOverall, a very strong coffee shop all around. I hope they continue to stay as awesome as they are.", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-25", "description": "Super pretty ambience and I like their snacks especially the croissant treats. Their infusion water also takes really good too if you don't want coffee. A lot of people come here to do work but it's also a cool place to come and chill with friends over coffee and snacks. The trees/plants in the middle of the store really makes the ambience.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "So happy to see a Devocion in my area of Brooklyn! High quality coffee, green and lush interior, and good hours. Can't wait to become a regular. Anything that makes a solid drip coffee has my heart.\n\nPrices are steep, especially relative to other spots in the area, but it's worth it. The vibe alone is a great reason to spend a bit more to sit or work in their space.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Love the plants in the middle of the cafe. It was such a relaxing atmosphere. I've been here a couple times to study. Lots of seatings and outlets with pretty fast wifi. Just make sure to bring a sweater if you're gonna stay here and study or do some work because you will freeze. \n\nCashless establishment. Friendly staff. I really like the aromaticas. \n\nThe windows are a bit distracting though because a lot of cute puppies passing by all the time.", "author": "Estrella E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Stars are for technically good coffee and fabulous atmosphere, but it's too expensive for its own good. We're talking more than Starbucks prices for a normal drip coffee.\n\nI tried to get a tea once, but all they have are infusions: basically fruit chunks in water. No flavor, and like $4. And no caffeine. Bad choice on my part maybe? I'd rather have a normal tea.\n\nAgain the coffee is delicious - you're gonna love it. The place looks like a jungle inside and it's very cool.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "This place has everything you'd want out of a nice coffee shop where you'd want to sit and get some work done: great coffee, plenty of tables, fast WiFi, friendly staff, non-invasive background music and a really nice ambiance. As other reviewers have pointed out, it's plants galore in here, adding a unique vibe that I haven't seen in any other cafe in New York. Hands down, the best coffee shop in the area.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "3.5 stars.\nAdorable cafe sitting on the corner of Livingston and Bond Streets.\nSince I was in the area and had previously  bookmarked this spot, I decided to give it a try.\n\nThe interior was charming, immaculate and spacious although it was more space than tables. Still, there were about 12 tables and additional seats (without tables).\n\nThe menu was limited--mainly coffee and variations of espresso drinks such as lattes, macchiato, cortado, cold brew and nitro. Most can be served iced or hot. For those craving non coffee drinks, there was an aromatica section of herbal teas, again iced or hot. Two selections  were pineapple-lemongrass and apple \u0026 mint.\nAs far as iced drinks, the largest quantity was just 16 ounces.\n\nAs I pondered the menu leaning towards something coffee, the barista was super helpful in answering questions. Always wary of coffee that's brewed too strongly, I ended up taking a chance on the iced Americano. He was kind enough to inform me that if the drink didn't work for me, he could make me something else.\n\nAlong with my iced coffee, I ordered a cheese, red pepper with jalapeno scone. This was very delicious: filling, not greasy and with a nice spicy mild kick.\nAs far as the coffee---I wanted to love it but didn't. This was not due to the fault of the establishment. I'm probably not a serious coffee drinker. It was kind of strong for me and using 3 splendas didn't work/help. I didn't ask for a replacement either.\n\nFor those who enjoy coffee, being on their laptops or chilling with friends, Devocion is worth checking out. I don't live in this area, but I'm sure it's appreciated by those who do.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "At first glance, Devocion is beautiful. The cafe has a number of large plants separating different areas and there are ample tables next two giant windows letting light stream in.\n\nI went on a Saturday to do some work and found that there was no internet on the weekends which I found to be odd. The cafe had outlets by the tables, however, and you can connect to Link NYC wifi instead which worked perfectly for me.\n\nWhen going to the counter to order I was a bit disappointed by their small selection of coffee drinks. They have a list of \"refreshers\" which I assume refer to teas but otherwise only have very basic espresso drinks. I ordered an iced latte which was nothing special.\n\nI'm torn between whether or not I should go to Devocion to do work again because while I absolutely loved the space the lack of drinks is an issue for me.", "author": "April C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "The team and I stopped by this quaint coffee joint on our way to our annual strategic planning. \n\nBRAND EXPERIENCE\nThis venue was right on brand when you think of micr-brew, hipster coffee culture. Well lit and balanced with hues of brown and cream, the color scheme created a warm, rustic feeling. \n\nCUSTOMER EXPERIENCE\nWe came in with a group of six people and the cashier handled us with ease. He repeated back everyone's order on the first try, turning drinks around in a timely manner. \n\nCOFFEE \u0026 SWEETS\nThe cashier recommended the cappuccino with a wild berry scone to compliment. The cappuccino had the perfect blend of steamed milk to coffee and the berry scone was berry flakey, bursting with sweet, tart and sour tones. \n\nOVERALL\nI don't visit very many places in Brooklyn more then once (there are just so many to choose from!), but I will definitely be stopping in again if I'm in the area.", "author": "Kajana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "I think I'm on a 5 start binge here. This one will be short because I was here so briefly. I'll update later. There are two Devocíon-- one in Williamsburg and this new branch. I've been waiting for it to open. A veritable greenhouse in the middle of downtown brooklyn. I didn't have coffee as I've been on a self imposed restriction-- yes, I know I sound insane. But I did have the aromática-- their version of a tea, made with fresh fruit and infused in hot water. I had the ginger, kiwi, date aromática. Light and refreshing. Plus, free WiFi and outlet. No brained 5 star. \nAs always, Happy Eating and Drinking-- MarieMG", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Very beautiful interior- I've been to a Devocion in another part of Brooklyn and this one is just as stunning. Coffee is amazing, place has such a zen vibe. You can go and hang out with friends and take a book to study. Staff is super friendly and they have vegan options which is always a plus!", "author": "Milka A."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "Devocion", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "276 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U1RLTtfo-1-q9cCIkrE0mQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182856180"}