{"aggregateRating": {"reviewCount": 73, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "We wonder about love and devotion, Lauren and I, and what it means. What makes what worth what...\n\nWe think we're on the same page drinking stupidly expensive coffee in the chic spot that is Devocion. Lauren says she's not ready to settle down. She says she wants to stay with me. She likes this life of coffee shops and art musings, she likes posing for me in front of the mural of succulents and whatever greenery is framed against the dramatic exposed brick of Devocion. I tell her, I'm tired. \n\nNo amount of caffeine can rid my fatigue. She asks of what? And I look around and say, \"This. I'm tired of spending so much money on lattes and pretending to work.\" People of our generation tell me about their jobs and I can't figure out what anyone's actually doing or how they afford seven dollar croissants. I don't know anyone for instance that can lay brick. I do know a bunch of baristas though... And for their survival we shall heed the call to tip, for they depend on the generosity of artist Williamsburg. The economics of oppressed hipsters is simple. It's a great thing I'm one of the few that sells painting. I always tip, making my 4.50 cold brew 5.50... and where does it end? I want to cry, always. \n\n\"We think we're living unique lives but we're all just drinking expensive lattes,\" I say, and she's getting sick of my cynicism. It's the beginning of our end. \"And then we'll leave [Devocion] to eat the same burrito as everyone else, and vacation in the same places, etc, etc.\" \n\nThis is not my New York dream. My dream is lost in the plant wall. My eyes cross. The coffee is good, but I wonder how sustainable, and about how long Lauren's Brooklyn dream will survive alongside rats, before it crumbles under the pressure of needing a savings account.", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "Misinformation took me on a wild goose chase. Popped in here to see if they do the boxed coffee for office events they say no but the burg one does (Williamsburg). Great thanks for the info. I had called the wb location but it's a general number for wholesale and my question on yelp never received a response. I waited till the date I need it today and see they open at 7 great I work an hr later. Get to the shop they look at me perplexed af and point at coffee beans to brew myself. I looked at them like are you kidding, I mean the boxes, they say they don't do that. I let them know that their newly opened location told me they do and they should inform their managers so the misinformation doesn't continue to spread. \n\nOverall second terrible work related experience. Coffee is still great but come on:/  FYI definitely need to jump on those traveler boxes as a business, especially by the downtown business bustling area.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-31", "description": "I've wanted to come here for so long, but the Williamsburg location was always packed. Then I came across this location and was in the neighborhood, so why not. They definitely know how to make good coffee. Was kind of disappointed they didn't have any other flavors or matcha though. They didn't even have chocolate to make a mocha, so I had a regular latte On the weekend, they ran out of a lot of snacks/pastries pretty early on. The decor is very cute like the other locations, filled with plants everywhere. I probably won't come back though. I like my flavored coffee and tea drinks. This place was pretty busy on the weekend with people reading, catching up, hiding from the cold, etc.", "author": "Rebecca W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Love the atmosphere and the very chill vibe. As you walk in there is a slightly raised seating area with lovely plants. The ceilings are high and the coffee is really good. I had the nitro cold brew ($4.50) which was the energy boost I needed. Before coming in I was quite groggy from a nap lol. Will definitely have to come back for another work session!", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Love this garden inspired coffee shop! Ordered a latte and nitro cold brew and both were delicious! No tea selection here which was a bummer, but then again, we live in a coffee culture.", "author": "Maria H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "Ay yi yi! As a Colombian, I am ashamed that this overpriced and soulless coffee shop passes as a \"great café\" purveyor of Colombian coffee! No wonder the Colombian coffee market is depressed. Each of my three visits have been strikeouts. The so-called fresh brew, is stomach churning acid. The lattes are half-assed, and the service is all-assed. As for the \"exotic\" decor, its perfect for the DoBRO dummies that think it's so cool to be seen in the lovely landscaped garden (the only good feature), which, unfortunately, takes up more than half the seating space.\nAmbience? Well the music is a generic mix of \"Latin\", sure to satisfy anybody with no knowledge of real Colombian music. \nTips: hit Reset, get Real, and let your Colombianidad shine.", "author": "Jorge A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "My favorite cafe around the area.  Very peaceful, and the barista is super friendly.  I usually order my latte there, and there's zero mistake.", "author": "Brandy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Incredibly cute coffee shop downtown Brooklyn. I arrived around 11am on a Monday and the shop was quite full with customers on laptops, enjoying free wifi. I wanted to stick around to enjoy the ambiance of the shop \u0026 the barista had no problem with me moving a chair near a wall-plug. I enjoyed a blueberry muffin and iced latte before an actual seat opened up about 7-10 minutes after my arrival and I stayed until about 4pm. The music went from Ella Fitzgerald, and Duke Ellington to Micheal Jackson over the course of the day--great vibes for sure! \n\nOverall: Great staff, good coffee, \u0026 the space is well kept. Great spot to chill by yourself, chat with a friend or productively get work done.", "author": "Jenée S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "This cafe is just okay. The space is beautiful but the coffee, food options, and staff are mediocre. \n\nUsually, the place is pretty crowded, but I was pleased to find an empty seat with ease on a Saturday. Come to find out (after already dropping $5 on a coffee), they no longer have WiFi available on the weekends. Now I know why this place was empty. \n\nThis is pretty disappointing as I spent the $5 knowing I'd be here for a few hours and likely would've made another purchase within that time frame. Instead, I left and will remember to not spend my money here anymore. There's also plenty of space for more tables and seating. Just move a few plants over and you're good.", "author": "London G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "This is my go-to-spot for my daily work day.  The coffee is great, the table tops are decently sized, outlets are strategically placed, and it's beautiful.\n\nPros: The coffee is great and, again, it's a great place to work for a freelancer who needs stable internet and outlets.  You'll see a lot of people collaborating here often.  \n\nCons: Surprisingly, the pastries are... not great.  You'd expect Bien Cuit or quality options but they taste like they were purchased from the corner store.  It gets pretty crowded so sometimes it's hard to find a seat if you come late.  The biggest downside is that, every time I work here, there seems to be little bugs (gnats?) flying around.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "Unique coffee spot - high ceilings, voluminous plantings that help make the environment quieter, a diversity of seating options, WiFi and quality coffee makes for a good spot to socialize, relax or work while enjoying your coffee.", "author": "Rob P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "Their coffee has changed my life. Guava tarts are to die for especially when fresh out of the oven. \n\n4 stars because staff can sometimes have attitude and more than often are just plain not in a good mood. Not the best start to my day to interact with irritable people.\n\nBe forewarned! - No WiFi on weekends.", "author": "Sharleen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Don't let the gorgeous decor fool you. The coffee is bad. So bad. I work down the street, so I've been here several times, and each time the coffee is sour. For reference, I like strong, bitter coffee and drink it black. I have had a cortado, drip coffee, and the nitro cold brew, and every drink here tastes old, sour, and like whatever they made to brew the coffee hasn't been cleaned in ages. The scone I tried was also damp and spongey. To top it all off, the prices are OUTRAGEOUS. Cute plants tho.", "author": "Ilona W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "I could be bias given that this place is so freaking convenient for where I live, but I love it. Great coffee, food and overall ambience. If I'm ever WFH this is my go to afternoon spot to get shit done.\n\nPersonal faves: iced oat milk latte (10/10), kale/feta croissant (10/10).", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Good coffee in light airy and quiet space. Cashless. No WiFi on weekends. Good place to get work done on weekdays or catch up with a friend on weekends. No great for groups.", "author": "Tali E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Open seating area feels very comfortable. Great \"toro\" drip coffee. Good atmosphere and coffee overall.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Really spacious and trendy coffee shop -- I loved the natural elements and warm feel. I came on a Sunday and lots of people were working here as well. The only downside is that options for coffee/beverages and snacks seem to be less than what I'm used to (for example, no chai and they only had a few pastries).", "author": "Keith B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I highly recommend the strong nitro cold brew for the high humidity/hot New York days. A large cup of cappuccino with a sprinkle of cinnamon is perfect for the fall weather. The lighting inside is gorgeous but it does get crowded during the rush hour.", "author": "Kat D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "I'm just so happy I found a decent coffee shop in the neighborhood, great addition and taste fully designed. Not as exciting storefront as the one in Williamsburg but overall thrilled there's one if the downtown Brooklyn area. I'm giving 4/5 stars because although they are not too busy at this time, making a cup of coffee early on the weekend mornings seems to be difficult for the staff to do in a timely manner.", "author": "Kimberly E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "honestly the best coffee i have ever had. i work in chelsea market and i have many great coffee options. I'm obsessed with how good this place and i'm addicted because I would travel all the way here for coffee on a daily basis if i had to.", "author": "J C."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "Devocion", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "276 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U1RLTtfo-1-q9cCIkrE0mQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182856180"}