{"aggregateRating": {"reviewCount": 73, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "This was number one on the list of coffee shops to visit in Brooklyn based on raves from online blogs/forums and it absolutely did not disappoint. The atmosphere is clean and full of life. The seating arrangement are out of the ordinary and inspire socializing but still offer some areas to get work done. They had a great menu and super clean bathrooms. 100% would come back here again if I'm ever in the area.", "author": "Madeaya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Tucked away on the corner of Livingston and Bond, Devocion opened its doors to its DoBro residents about a month and a half ago and I absolutely love this place!!! It's as if you've stepped inside Columbia with its yellow-tiled floors, the large, Amazonian plants that live in the center of the café and infectious Latin beats coming in from the speakers. The coffee is strong, seats are plenty and overall vibes are great for catching up on work or just hanging out.\n\nWhat a wonderful addition to the neighborhood!", "author": "Jane N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Found a cafe that brought me to another country! The place is filled with plants and trees, which gives such a relaxing atmosphere. \n\nStopped by a Monday morning around 10:15am and this place was packed! The place is medium sized, there's enough seats for maybe 10-15 people. I waited a little bit before I ordered because there was only one barista who was busy making drinks for the previous order. She saw that I was waiting awhile so she greeted me first and asked what I wanted before ringing me up at the register. She was friendly and knowledgeable. \n\nI had the latte, which was made to the perfect temperature and taste. Also, beautiful latte art! I honestly wasn't sure what to expect but I'm a strong coffee drinker and it didn't disappoint me. If you like Colombian coffee, this is a place you have to visit! \n\nThe prices are your average nyc cafe prices. They only take card (cashless establishment)! Also, free WiFi!", "author": "Leona L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Super cute cafe in downtown Brooklyn! 5 stars for decor and a tasty latte. This cafe is very spacious, however, there isn't a ton a seating area. When you walk in there is this cute green oasis with 4 chairs, which is a perfect place to do some reading. There are also tables and chairs surrounding the greenery area. (hope that makes sense). The only negative thing I have to say about this place is the music is a little too loud. Aside from that it is a perfect spot to study/have a coffee. There is free wifi too!", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "I love this coffee shop! Great coffee and ambiance.\n\nI'm knocking off a star because this business is cashless. I get that it's efficient, but this policy discriminates against the poor. It also means less cash tips for the hardworking baristas! I hope Devocion will consider reversing this policy.", "author": "Naomi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "I liked the vibe of this place so much but the most the plants inside.\n\nBeen wanting to check it out since it opened.\n\nUnfortunately they were running out of pretty much everything i tried to order so i didn't have the pleasure to taste their infuse nor their fresh oj.\n\nHope to get luckier next time!", "author": "Kiara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Devocion is one of my new favorite neighborhood coffee shops. It's beautiful, with an oasis of leafy plants standing tall in the middle in the high-ceiling room. I love sitting in the leather chairs by the plants; it transports me to some kind of magical garden. \n\nThis is a great cafe to read and work. There are plenty of outlets, fast wifi (although apparently not available on the weekends), a decent amount of seating, and great natural light.\n\nThe menu is on the higher end compared to other local coffee shops. My benchmark is the price of a drip coffee--here it's $3.00 (compared to, say, $2.50 at Absolute Coffee).", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Better in person yet still magazine worthy. \n\nI found out about Devocion because I saw it in a modern architecture magazine called Dwell, and put it on my short list of things to visit in Brooklyn. Lone and behold, I found myself in need of a work space, and I was a few blocks away from this fine establishment. I was so excited to check out the space. \n\nEven on a busy Friday, I was able to find a seat with a plug within 10 minutes of walking in. The space is open with beautifully worn yellow tile, a central seating nook that is between garden and patio with tons of natural light. You have a selection of fine columbian coffees to choose from that will keep you caffeinated for your entire experience and stimulated with a vibrant yellow mug. That's exactly what I wanted, and these details make it feel like a future home rather than a crammed coffee shop. \n\nI'll be back whenever I'm in the neighborhood.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "The cutest little coffee spot with delicious croissants. They are seriously the best I've ever had!!", "author": "Kellee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "I am so happy there's a closer location to me now. I no longer have to travel an hour to Williamsburg and wait around for a seat. This location is smaller and has less seating, but people don't stay as long. I was able to get a seat immediately on a Sunday afternoon when it was almost a full house. They also have wifi on weekends, not like the Williamsburg location. \n\nI got a latte with oat milk since they don't have mocha. It was smooth and strong, just the way I like it. It was also reasonably priced at $ 4.75 and $0.50 for milk alternative. After sitting for a bit, the smell of croissant was in the air and I couldn't help but to get one. I got a chocolate croissant which was a bit on the smaller side for $3.50 and it didn't have much chocolate inside. Besides that, I would say the croissant was very good; it was very buttery and flaky.\n\nI think this place has become my new favorite cafe to go to in this part of Brooklyn. It's has big windows that bring in natural light and the space is really chill. It's the perfect place for me to get work done.\n\nFYI they're cashless and they also have the square loyalty program.", "author": "Vivian Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "New favorite coffee shop in the area! Perfect place to visit for a little escape to Colombia and a caffeine kick.\n\nAmbiance - Latin American music and décor. Huge windows with lots of light and colorful tiles. Huge plants also add a nice touch, as greenery is quite lacking around this neighborhood.\n\nCoffee - Strong and smooth - absolutely perfect. First order was a latte. Latte art was on point, so get your cameras out and get ready to gram it up. Just a little pricier than other coffee shops in the area, but good thing tax refund season is here. \n\nFree Weefee - Can't live without it, so this is another major selling point for me. I could see myself hanging out here for hours to get work done or to catch up with some friends, as there is a sufficient amount of seating and outlets. \n\nAll in all, there's nothing to love more than a dope coffee spot that makes you feel like you're in Colombia when you're really in DT Brooklyn. Looking forward to my visits to come!", "author": "Naomi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "We were on our way into the city and desperately needed a coffee, so we popped in for a bit.  Who knew our lives would be changed?\nNever have I ever tasted a more flakey, moist, and dense croissant in my life.  And I have tasted many a croissant, my friends.  The chocolate one is perfectly delicate and not too violently sweet. \nI've started to make a visit even out of my way just in order to get their croissants.", "author": "Tayen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Beautiful decor. Feels like you are stepping out of Downtown Brooklyn.\n\nFirst order was a cappuccino. Excellent, smooth flavor. \n\nService was fairly quick and friendly.\n\nPrices may be a little on the higher side-comparable to a Blue Bottle or Stumptown.\n\nLots of interesting choices some shops don't have.\n\nTreats look good.\n\nI'll have update once trying more options, but 5 stars to start! Welcome to the neighborhood.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "THe BEST glass of cold brew and cup of pour over I have ever tasted. I loved the style of this coffee shop \u0026 think their coffee if excellent. Not just a normal cup of coffee. You must try it!", "author": "Christian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-12", "description": "Good place to go to if you're in the area. Nothing to spectacular or outstanding about the coffees but they are good and do their job. Cashier could have been a bit nicer. Love the interior space design. Very unique and makes me feel calm. Not too many places to sit when I was there though.", "author": "Honest R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-21", "description": "Atmosphere is nice but they have no teas and their baked goods look day old at best. If the muffins are wrapped in the brown paper it automatically makes me think they come from a hotel.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-19", "description": "The cofee shop is very well decorated.  My issue with this place is the service I recieved. I ordered an Americano and my husband ordered a Toro drip coffee. We were given to go cups for our drinks when we were staying. We sat sown only to notice EVERYONE next to us were given beautiful yellow ceramic mugs with matching saucers. I asked the cashier why were we given to go cups and she said \"Ooohhhh..Do you want a cup?\"  She washed one cup off and tried to give me another cup without washing it. That was not clean at all. I dont want to assume she was not used to catering to our demographic. Nevertheless,  she seem looked annoyed that I requested the same service as the other patrons. Gave me a 2 cups with saucers. I really like the coffee and the music. To bad the cashier was rude.", "author": "VOnda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I was a bit excited to learn they opened another location in Brooklyn which for me it's easier to get to than Williamsburg. A bit smaller and less seating area and thus less grandiose feel when you enter the shop compared to the other location. Nevertheless, the interior deco is comparable (see pics). I ordered a cortado - a bit sour taste at first then finish strong with bitterness. A bit strong for my liking but my friend who likes strong coffee likes it. May return for cappuccino (hopefully less strong for me) or try one of the aromatic drinks (look interesting)", "author": "Shanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Devotion always hit the spot amazing coffee with just the right amount of milk to coffee ration in a latte. Smooth af no need to add sugar to mask bad taste this coffee is pure nirvana!! A coffee lover dream..I dont care about the pastries or small selection of type of drink. It's a specialty coffee shop not Starbucks so yeah. If you appreciate good coffee this is a place to get it.", "author": "Saba N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "A couple of weeks after I published my original review of Devocion on Yelp!, I received the following note from one Ronny A.:\n\n Just a Note 8/11/2018\nFor your review of: Devocion\n\nBecause of ppl like you this world is getting destroyed a day at a time a receipt at a time! \nThose 2 cons you put there is what makes that company great! You fool! \n\nGo give that bad review to your accounting department which are asking for printed receipt instead of an email confirmation which would do the same and stop critizing [sic] people who are actually helping the wold [sic]! \n\nRonny A[full name shortened]\n\n\n\nHere is the original review that I wrote in late July:\n\nCute room, comfortable, friendly staff, good coffee drinks, reasonably priced.\n\nBUT...\n\n1) they don't take cash, only plastic, and\n\n2) they don't produce paper receipts, only electronic ones via text or email\n\nBoth of these are annoyances; the second is an invasion of privacy.\n\nLook, I'm just as environmentally conscious as the next person, but this is highly inconvenient for those of us who need to produce paper receipts for business accounting purposes. Therefore, my associates and I will need to take our meetings elsewhere.\n\nToo bad, because we otherwise liked the place.", "author": "E S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "Devocion", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "276 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/U1RLTtfo-1-q9cCIkrE0mQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182856180"}