{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "UGH. Do not waste your time. \nFirst of all, it's hot as hell in this restaurant. Having the workers sweating over my food is not appetizing. Secondly, the staff there is rude and unprofessional. The wait times to order and to receive the food were ridiculous. When my food was finally done, the cashier yelled \"6\". Order number \"6\". \"6 again!!!\" All the while she's staring at me through the crowd. The only problem was that my receipt clearly said order number 12. When I approached her to get the food, she refused to acknowledge that she had been yelling the wrong number.\nNot worth the aggravation, go to checkers across the street.", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "I'm giving this 5 star because of their great food and most esp the great costumer service, the people that are working here deserve more. They are very dedicated to their jobs and are so amazing and kind. Kudos to the SOUAREY? I don't know if that's how you spell his name but he was the one helping me and he was very kind and patient!", "author": "Victoria P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "I went here after I went to jury duty and they have the worst customer service ever. They barely have any seats. The place looks very old and dirty. I do not recommend this place if you're not gonna be around.", "author": "Xiaohua L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "The slowest Popeye's you will ever go to. Took 45 minutes to get my food. If I hadn't gone up to remind the person who took my order that I was waiting, I might still be there.  They never have enough food prepped, the cashiers seem like they want to just stand around and chat, even in the middle of lunch rush, and there doesn't seem to be any leadership to get things done. Just avoid this place until they either get new management, or are replaced completely.", "author": "James T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "I normally don't review fast food places because I figure they are pretty much the same but today's experience prompted me to write this because it is totally unacceptable how these staff should be allowed to work there.  It is Super Bowl Sunday and folks are beginning to pick up fried chicken and sides before kick off.  Only 2 registers are open creating unnecessarily long lines.  That's complaint number one.  The next is for about my order for a 12 piece family meal where 2 large sides are included.  I opted for corn on the cob and told the woman at the register I wanted my second side to be another side of corn.  I also said I wanted all dark meat.  She said she couldn't give me all dark meat but I told her I don't want any white meat and she finally acquiesced.  (Honestly, why should a customer pay for something she doesn't want?). While waiting I noticed on my receipt she had charged me for the second side.  I had to call her over as she was just standing around waiting at the window for a new batch of chicken to come out rather than take the next person's order which would have been the smart thing to do.  The people in line behind me were getting annoyed for the long wait and inefficiency.   When I questioned why I was charged she seemed to not comprehend and called over the manager who proceeded to tell her that my sides were actually included in the meal.  The one who took my order initially told me the corn was not included as a side, only mashed potatoes and cole slaw.  I pointed to the sides sign and told her I see corn listed as a side.  When she realized she overcharged me she asked if I wanted another order of corn and I told her no, I didn't want anymore corn, just a refund for the extra charge.  The manager was even more lame with the explanation that it depends on who takes your order because the charge for the side can sometimes be added and sometimes not.  This was totally illogical but may explain how the order takers are so ill-equipped to work there.  If the manager can make excuses like that, how can one expect the staff to know any better?  Okay, the horror doesn't end here.  I get home and the order taker short changed me a piece of chicken.  You've heard that a baker's dozen is 13 pieces.  Well, at Popeye's it's 11 pieces!  I want  to give the order taker the benefit of the doubt but something tells me she did this deliberately.  Mind you, there was a long line behind me and I only wanted what was fairly due to me and all these mishaps are because of very poor staffing.  (In hindsight maybe I should have counted my order in front of her but that seemed petty but now seems necessary given the caliber of the staff.). There seems to be absolutely no customer service,  no rhyme or reason to the policy and no staff who fully knows what is included on the menu.  I have no complaints about the food, but the staff should be fired for their incompetence and inability to take a simple order and for a purportedly act of retaliation.  There are so many other places to get chicken and I will go out of my way to any one of them before going back to this Popeye's on Court Street.  I may even send this complaint to the corporate offices of Popeye's so there's something more than a Yelp review for the few who may not get to see this or even think to check Yelp before going there.  My meal by the way, wasn't cheap (it was $28) so I hope something can be done at this location before they lose any more customers.  Luckily, I eat Popeye's maybe once or twice a year so this is not a big loss for me but I don't think anyone who goes more frequently should have to pay money to be frustrated, mistreated or cheated.  It is very unusual for me to complain like this as it's only fried chicken but their business practices on all levels are so wrong that it cannot be ignored!", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Me and Popeye's have a problem.  It's one of those super intense borderline toxic relationships, the kind where you both know you need to give each other space but once again you find yourself face first in a box of fried chicken and biscuits.  \n\nThe servers are unintelligible.  Seriously, I never know what they're asking me so I tend to guess that they're asking \"do you want that spicy or mild\" or \"what kind of side\" and answer accordingly.  Sometimes I'm right.  \n\nOther than that, the chicken is pretty much always hot and fresh, as are the biscuits.  My one gripe is that they tend to run out of macaroni and cheese--duhh it's the best, you have to make extra, though the mashed potatoes and gravy are a decent alternative.   \n\nI wish I knew how to quit you, Popeye's!", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-26", "description": "It's a typical Popeye's. \n\nPlenty of seating upstairs.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-28", "description": "Popeye's is Popeye's - solid fried chicken served fast. But at this location, the manager is the star of the show. \n\n2 instances come to mind. The first time I came in she told me it would be a 15 min wait if I wanted the spicy version which I did. She gave me a free drink while I waited. \n\nThe second time I came in, the lines were a little confusing since it was more crowded. Realizing that I was standing behind folks who had already ordered, I moved to the next line. The homeless man (I presume) in front of me suddenly turned around, started stomping his feet aggressively, and shouted at me. He was promptly told to leave by aforementioned heroine manager. My shocked face didn't reveal it, but I was very thankful to her. \n\nOh yeah ... the chicken here is pretty good too.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "Horrible Customer Service. I had to wait over 20 minutes to get my order.\n\nI love fried chicken, but recommend to avoid this establishment at all costs.", "author": "Wesley B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-17", "description": "Today was my annual hungover Popeyes allowance and I have to say, this location is wayyy better than the one below my apartment on Fulton St where a trip would go something like this:\n\n\"Can I have the #2 with mashed potatoes?\" \n\"BABY WE AIN'T GOT NO MASHED POTATOES.\"\n\"Okay, fries?\"\n\"WE AIN'T GOT NO FRIES.\"\n\"What do you have?\"\n\"THIGHS AND BISCUITS.\"\n\nA friend claims they were out of chicken once...", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-15", "description": "Theres like 6 ppl at 3 registers...pure chaos. They're all confused and slow. Shouldn't be this difficult to ring up some friggin chicken man.", "author": "Nell d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Okay so all day my boyfriend and I were CRAVING some popeyes... Some juicy, moist chicken thighs with crispy delicious fried skin dipped in creamy mashed potatoes. with some gravy.\n\nAround 11:20PM we walk into Popeyes, order 2 butterfly shrimp baskets. The cashier tells us it would be ready in 5 minutes. Okay, so the line has grown to about 6 people. Why did all those customers get their food and walk out, while we were still waiting 15 minutes later? Mind you, they didn't even have biscuits ready to go. Really though? And not to mention of loud and rude the staff was. So we ask her how much longer, she says 2 minutes. We demanded the money back and then she asks the cook if the food is ready and he says yes. So why was it more then a 2 minutes wait??!! Negative, put the money back on the card. She says that she can't do that (bullshit). Then my boyfriend demands cash. She then agreed with her stink ass attitude trying to tell us the food is ready not even with an apology. Got home an hour later then usual and settled for some local fried chicken joint down the block. Boy was I agitated as fvk! \n\nThe next day my boyfriend went to the Popeyes on Fulton St, 2 minutes and he was out! ( he went during a work break and surprised me when we got home, he's the best =) .. and if you are wondering, no I am not a big fine women. I just eat like one )", "author": "J A M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "I love Popeye's, my guilty pleasure. But really, never an order right here. Close would be a compliment. Shorted a biscuit and gravy side, wrong side, no sauce.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Just witnessed a full on verbal screaming match between two Caribbean women employees. I honestly thought they were about to beat the crap out of each other.  The chicken was good. That screaming match in front of customers was embarrassing!", "author": "Stan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "I've known around 3 people that have gotten food poisoning from eating at this location, from eating different items at this restaurant. I'd proceed with caution or seek a better alternative.", "author": "John K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Nahhh I don't think I'll be back. Don't get me wrong, I love Popeyes. It's better than KFC in every way. I used to eat fairly often at the Popeyes near Baruch, and got served some delicious fried chicken.\n\nHere, the fries I had been praising for so long weren't fresh and tasted a bit stale. (I didn't finish them). I couldn't even really taste the spice in the so-called spicy chicken. It was a bitter disappointment. Well more like a greasy disappointment.\n\nMoreover, the seating isn't really well maintained. The staff needs to clean it more frequently, as chairs and tables were pretty dirty when I was there.", "author": "Mohammad H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-12", "description": "Salty, salty, SALTY!\n\nI mean, just about every Popeyes' chicken is too salty.  What, are they trying to give everyone high blood pressure?", "author": "DC M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "The best chicken ever. The staff can be overwhelmed don't take it personally. When you order sides double check because they can be cheap, especially with the Cajun rice. It can be crowded at lunch time and during promotions. Make sure you taste your soda before you leave it might be seltzer water instead of sprite. They have to be reminded to give extra honey and hot sauce.  It's a good deal if your on a budget. They have upstairs seating. I will continue to eat here unless the Department of Health says other wise.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "This is one of the worst Popeyes I've ever been to and I've been to a bunch of them. The positive here is the food is consistent with that of the Popeyes brand, which is good in my view, specifically the fried chicken and fries. On the negative side with the Court Street location: i) lines are very long, ii) there is usually lots of confusion over if there is 1 line or 2 because the ordering area is so small and people are cramped in, iii) the dining area upstairs is dirty and rarely cleaned. I have seen garbage piling out of the containers, iii) the refill soda machine is downstairs so expect to walk up and down if you are thirtsy, iv) given its proximity to the movie theater, shopping and schools, teenage kids hang out upstairs and crowd the dining area, v) don't see a visible bathroom but I believe you can use the staff one near the kitchen, vi) customer service is often slow and at times rude. The Popeyes in Chinatown are definitely better and at a minimum, much more efficient in terms of taking and fulfilling your order. There is a new Popeyes on Flatbush near Fulton St, which may be promising. Note they do not have a soda refill machine.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-14", "description": "This is the Popeye's from Hell and it has ALWAYS been this way. Forget about the food here. We all know that Popeye's is the real \"finger lickin' good\" chicken chain. Let's talk about why I feel that one star is just one star too many for this chicken shack.\nThe staff here is noisy and rude and they don't mind cussing out loud and gossiping amongst themselves in front of customers either. Apparently they're all *ahem* hooking up with one another too because there seemed to be some sort of lovers quarrel going on between a cashier and the manager when I arrived. I hoped that the look of disdain on my face while standing in wait for my food order would bring some sort of change and it did. It made the manager smirk!  Also, when  I made a comment on the filthy, upstairs eating area to a worker who FINALLY decided to clean the tables (with his bare hands), his smiling response was,\n \"Eef you do not like it here, you may always go to KFC.\"\n Huh??? Smarmy little idiot.  It just amazes me that this place has gotten by being run like a prison mess hall for so long. Did that fool really tell me that I could go eat at KFC?! Wow.", "author": "Tanya R."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Popeyes Louisiana Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Ut9Kyp1p1EM6y3Yf2cr3gQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184220835"}