{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "I love popeyes.  It is gross and totally perfect.  This local is often busy and you feel so gross after eating but I can't stop myself from going back....", "author": "Alice E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-28", "description": "This restaurant customer services is horrible , and place is not clean and the food is not tasty , over all need improvement !!!!!  As seen in the picture this is what all tables look like", "author": "Sparkles L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "I have been there three times and every time the staff have been extremely slow. Now I understand that they are underpayed and that the work sucks but isn't it better to just have good flow? Now I also realize why many Americans are over weight. This food will kill you", "author": "Luke P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "Slow service (25+mins wait for common orders such as mild chickens) and confusing queues. This restaurant should not fall into the \"fast food restaurant\" category. Manager sees 8+ waiting around (ordered but waiting) and decided to walk outside and not help. AVOID AT ALL COSTS.", "author": "Irving C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-01", "description": "It's been a year and a half. My girlfriend had a Popeye's craving...so back we went.. We received the wrong piece selection (thighs instead of breasts) and the wrong type of chicken (spicy instead of mild). We ordered one side which only after completing the order and paying were we told they didn't have (as I've said before...how can an employee working there not know that they're out of their most popular sides??) and one side which didn't make it into our bag. At least staff was nice and smiley as she screwed up everything.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-14", "description": "Oh man, this Popeye's is asstastic.\n\nI'm not gonna lie. I love the smell of fried...almost anything. So, when I passed Popeye's, I used to think, let me try that place one day. And then I did.\n\nNARSTYYYYY is a great word that comes to mind. So do: made from a box, salty, overcooked, make me ill, dry, (ok, not all of those are words, whatever).\n\nBut really, the mash tasted out of a bad box mix. The chicken was dry, super salty, and hard to chew. The biscuit tasted like salt and butter. I threw my meal out after three bites. Yuck!", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-03", "description": "My order went something like this:\n\nMe: \"I'd like the #2 please.\"\n\nCashier: *blank stare* \"...what?\"\n\nMe: \"I'd like the #2 combo meal.\" *points at menu sign*\n\nCashier: *another blank stare* \"...what?\"\n\nMe: *remove sunglasses* \"I. Would. Like. The. #2. Combo. Meal. Up. There. The. Two. Piece. Chicken. Meal.\n\nCashier: \"(inaudible) or spicy?\"\n\nMe: \"Just normal is fine.\"\n\nCashier: *blank stare* \"(inaudible) or spicy?\"\n\nMe: \"Normal. As in, not spicy.\"\n\nCashier: \"Okay...so you want what again?\"\n\nMe: *loud sigh and points at menu sign again* \"THE #2 COMBO MEAL WITH THE TWO PIECES OF CHICKEN THAT ARE NOT SPICY!\"\n\nAnd I thought I only dealt with the Olympic elite of morons at work...needless to say, I had low expectation of the food that I carried out of there by the time I managed to escape. But, it wasn't too bad. The chicken was actually quite delicious and juicy. The side of mac \u0026 cheese was eh, and the biscuit was pretty bad. Honestly? You have two food items in your name: chicken and biscuits. I can understand if the side is not that good, but when one of your two named food items isn't good, that's a problem.\n\nI escaped with about $7 in damage and a fairly decent meal. The chicken was pretty delish though, so if I were to ever eat Popeyes again (I don't really eat fast food all that often), I'll probably just opt for the chicken only.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "Some of the best damned fried chicken this side of the Mississippi even if all the msg does put my body into convulsions.  Great tasting battered skin, the meat isn't grungy, and it's moist.  And you're not going through a carton of towelettes to degrease your fingers.  I only wish they would serve fried chicken skins alone.  I'd put the manager's kids through college.  \n\nToo all those eateries who serve \"homestyle\" fried chicken.  Kneel and kiss the pinky ring of the big forearmed one.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "I would give this store five stars instead of three if not for the staff who work there. like honestly the chicken is awesome it will give you foodgasms yes I said foodgasms the staff on the other hand are not so awesome don't bother asking for no BBQ or sweet n sour sauce cause half the time the ain't got any in tht lil fridge of theres. Also if you ask for sauce the cashiers will sneer nd snicker as if it takes such a great effort to pick up damn sweet nd sour sauce and throw it in your chicken box. Also if you ask them for ketchup of hot sauce they will give you like 1000.  Packets like wtf am I gunna do with all tht sauce? Like srsly. But the chicken is good so yeah .", "author": "Mitch V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Sometimes you just can't beat the FRIIIIIED CHICKEN from Popeye's.  I haven't tried Kennedy Fried Chicken or any of the other ones nearby, but sometimes this is just too good to pass up.  Mmmmm....grease.", "author": "Michelle N."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Popeyes Louisiana Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Ut9Kyp1p1EM6y3Yf2cr3gQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184220835"}