{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "Not sure why this location only has two stars. In my experience I've gotten perfectly crisp chicken and moist biscuits every time. I'm partial to KFC so this Popeyes has clearly won me over.", "author": "Lily M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-12", "description": "Very bad experience! Does not respect customer , asked nicely order 10 piece chicken , ask for ketchup, gave me 4. Demanded for more gave me 2 more ,", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "Worst service, dirty store and staff my cashier was Ouma who grunted at me, then he gave me the pictured chicken. I won't even feed it to my dog. I love him to much. @popeys,  If you can't do it right....DONT DO IT AT ALL!!!\n\nFinding the good in the bad. This can be the reason I give up fast food all together.", "author": "Ife M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-31", "description": "Uhh I work around the area and this is by far the worst fast food place I've been to. The lines are absolutely ridiculous and takes me at least 20 minutes to get my food every time. I'm a huge sucker for Popeyes but I will never be back to this location. First of all I feel like I'm going to get mugged every time I'm in there, secondly the workers there are dumber than Patrick Starr. They don't know what they hell they are doing. At 1 PM on Tuesday, one of the cashiers told me they ran out of the ghost pepper chicken wings. Smh. Every time they forget something in the  order. First time they forgot my mashed potatoes and realized when I was back in office and it made me very upset the whole day bc I wanted mashed potatoes.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Probably one of the best Popeyes in NY state.  The chicken is always fresh, they have a high Chicken turnover.  The server is quick and pleasant, very hard to accomplish considering the amount of customer they see in any given day.\n\nThere's seating upstairs but in limited amount due to the high number of patrons.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Nothing to complain here. Good affordable fried chicken. Workers are friendly and customer service is great. But I can imagine what they have to go through everyday with rude customers and random people wanting to use the bathroom.", "author": "Raymond Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "This Popeyes is the literal worst I have ever been to. And I've been to several. They have NEVER had chicken tenders ready and it's always been at least a 10 minute wait. The crew is apathetic and unhelpful. The whole crew. Not a single one of them has any sort of energy or willingness to do anything at all, much less their jobs. This place is the epitome of suckville.", "author": "Randall C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "I went to Popeyes again tonight after a night of a few drinks... or, otherwise I probably would not have eaten fried chicken and had something a bit healthier... but inhibitions were low, \u0026 I gave in! Definitely a good decision tonight. Why? Well, things were definitely spot on tonight. The chicken was fresh; the service was great; and, it was an overall enjoyable experience.\n\nI was especially impressed by Tangie, the cashier. She was knowledgeable, super nice, and attentive. Girl, oh the places you will go. I wish you great luck.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "The cashier wasn't paying attention, and gave me the wrong order. Now I know why the people a head me were cursing her out. I will never buy anything from this location again.", "author": "Brenda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "This is mother day evening and am out with my kids, my son took his money to buy his grandma her fav piece of chicken ,he paid for a 4piece as stated on the receipt andgot 2 pieces in the box, now the cashier practically wanted to fight the customer and i was hoping she would calm down by the time she got to me....this is fuxking crazy and am embarrassed n pissed as hell....m never ever going bk theew to recommend anyone....like WTF", "author": "Acacia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "This place smell like the homeless man that lives in front. ABSOLUTELY disgusting. Popeyes is losing it's touch ever since Burger king bought them", "author": "Moe P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "I stopped by this location on 11/07/17 around 9:45 PM. I got there and nobody was at the register, a young girl came to the register from upstairs because she was cleaning, had no gloves on. I asked for the three piece special, I opened the box in front of her - she pick three over cooked small pieces. I asked if she could change them, she told me \" You already touched the box\" and I told her \" you did the same thing and you never washed your hands. She became very rude, talking reckless. When you give excellent customer service, the clients will remember and come back as repeat customers. New customers are expensive to attract. You need so much sales or advertising effort to attract a new customer. One-time customers are not profitable for most business. The long-term client and repeat customers bring ongoing revenue without the acquisition expense.", "author": "Lou Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-27", "description": "I eat fried chicken once a year, every year. On the anniversary of MJ's death. I just so happened to be devouring 4 fried thighs when I heard the news 5 years ago, and sobbed into my Popeyes box for about 2 hours. It's now become a tradition. \n\nSo I ventured out to this particular Popeyes at 10:30pm. What a mistake. An entire hour \u0026 a half before closing and they had nothing but scraps in regard to side dishes. Take a look at the \"side\" of mashed potatoes I ended up finding when I got home. It was the equivalent of about 2 tablespoons. \n\nThe chicken thighs were delicious, as are the biscuits, but it pretty much ends there. I paid $19.75 for 8 thighs, a biscuit, and 2 tablespoons of mashed potatoes, because they were \"all out\" of everything, and, of course, didn't choose to tell me that until after I paid, and my \"order\" (missing 2 sides) was packed. \n\nThe bathrooms are atrocious. The customer service ranges from nonexistent to awful. The prices are outrageous considering what I got. I definitely will not return to this location again. It might be better if you show up before 10pm, but a part of me highly doubts this. I'd highly suggest an alternate Popeyes location.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Filthy garbage overflowing not changed, tables not cleaned, too long for food to be ready \u0026 it's the beginning of lunch time. No security homeless man harassing patrons for food \u0026 going through the garbage bins picking out food.", "author": "Fanita A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "Crack, straight crack! The employees here are nice. Forget everything else on the menu, all you want is CHICKEN ONLY! I ordered some fried chicken and the lady was nice enough to inform me about their current 9 piece deal. It's a good price but it's mixed. She gave me 3 big ass chicken breast, 3 wings, 2 thighs, and 1 drumstick. Next time, I'm only ordering legs and thighs. Popeye's chicken skin is so bangin. Nice golden crispiness. I like Popeyes way more than KFC. KFC is alright but their chicken skin is extremely oily and too salty. If you can't figure out what to eat, just come to Popeyes! It's so clutch.\n\nIf there aren't any traffic cops nearby, drive with a friend and have him/her go inside and order because finding a parking spot in this area is a friggin bitch!", "author": "Gary L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "Waited in line 20 minutes just to order. It's a fast food joint you shouldn't waste no more than 10 min including picking up your food. Better yet they got my order wrong. Ya'll need to get it together", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "Oh, Popeyes. You are a very bad boyfriend. \n\nI can never let my friends or family know that I see you, because you are forgetful, greasy, and you don't clean up after yourself. \n\nI am not the only one who thinks so. Everyone in line waiting to see you and get a few minutes of satisfaction...we are all looking at one another. And we are all having this silent conversation:\n\nWhy are you here? \nNo, why are YOU here? \nI asked you first.\nBitch, you don't need to be here. Go get on a treadmill.\nHave you even ever been to Louisiana? No, I didn't think so. You don't deserve to be here. \nBitch, he  ain't really like the ones in Louisiana. Who are you kidding?\nI don't care. Me and my guy Popeyes, we go way back.\nWell, I'd better get SOMETHING after you're done getting yours.\nGet out of my line.\n\nI know you know what I mean.\n\nYou may get water from the machine instead of sweet tea at this Court location. You may not get your red beans and rice. Heck, there will probably be no mash left for you. \n\nBut there will be chicken. And it will be bona fide. As will you be, when you surely return to fight the same fight again with all the others who want a piece of your Popeyes but find out that he just can't keep up.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-26", "description": "Another establishment fondly operating on a name and poorly managed.  The estimated time to receive a two (2) piece is almost ten minutes. If you plan on getting in and out of this place you will be very upset. The customer service is unethical to plain upsetting. If it were not for the chicken brand name of Popeyes, this establishment would be on the list of never eat here again. \nI ask myself how can a corporation be run like this.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "Thanks, but no thanks 78 Court Street.\n\nWhen it comes to fast food, I'll eat it once in a while. And when I do, I often opt for Popeyes.\n\nI didn't even order anything from this location and still had a bad experience. That's just plain sad. I then walked out. Why ? Well let me tell you all a story and prevent you from a bad experience yourself.\n\n.My sister and I were taking a walk around this area one day and we started to get hungry. Asking my sister what she wanted, we both settled on Popeyes. We then crossed the street, walked into Popeyes, and were proceeding to look at the menu. Then, comes a very sarcastic ''Hello, welcome to Popeyes'' from one of the cashiers. I look up and smile. Shouldn't have. Because next, I heard laughter. The same cashier who gave me that sarcastic ass laugh was talking to another crew member and was pointing somewhere in our direction. There was no one around the two of us, so, it was totally obvious. I glared at them for a while then decided to leave. There comes the glances I can see from outside. -_- Really ?  Not going to support a bunch of dickheads, nope. Something I did notice though while I was outside the store... it seemed to have to do with looks and/or ethnicity. So basically, they were being little scumbags who thought they were better than others. They didn't do that to anyone else but when it came to some customers, the expression they had pissed me off. I could've confronted them, but knowing me, I didn't. No point in arguing with a fool at all, they'll never change.\n\nLet me mention again, this was right after I walked in the door. Walked out within 3 minutes. -Sigh-\n\nOverall, if you're craving Popeyes and are able to ignore and handle mean dunces, come here. Otherwise, NOPE, NOPE, and NOPE.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "I ordered the 5-piece mix and when I ask the cashier if I can have  a mixture of breast and thighs or breast only. She said she's not supposed to but she got me. I almost burst in to tears of joy. This is the first time in my life that I had breast only Popeyes. Definitely making this my new Popeyes spots.", "author": "Angela J."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Popeyes Louisiana Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Ut9Kyp1p1EM6y3Yf2cr3gQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184220835"}