{"aggregateRating": {"reviewCount": 30, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "4.5\n\nI know I am not supposed to be down with chains... but damn if this isn't a good one! I don't live in a current CAVA city so I didn't know the deliciousness that awaited me but I learned that day! I don't know whether it was my hunger or my weariness but this was one of the best lunches I'd had in some time.\n\nWeary \u0026 hungry. Yes. I had spent hours (seriously; like, four) walking around Brooklyn in brisk weather (spring, my @ss) and in the wrong shoes. Many many times I wanted to stop, collapse and rideshare my way back to Manhattan but then I remembered that that would cost, like, $60 and I kept on my death march. I'm usually pretty good at finding subway stops but I couldn't find one for the life of me. Making my way to Downtown Brooklyn, I knew I would be within a stones throw of a subway line (and, a seat). As I walked through the prefab streets and past the throngs of people lined up for Shake Shack, I knew I didn't have much gas left in the tank. A quick check of my Yelp app let me find a new-to-me spot that promised good food and a warm place to sit for a spell.\n\nPro tip: don't buy a drink at the beginning of the line. Wait until you get to the end and go for the soda fountain. Rather than enjoying the finite happiness of a bottle of blueberry soda, go for the never-ending fountain of the stuff. I blame my delirium. I walked in looking CRAZY and instead of running away, the guy at the counter greeted me and started me on my way. Since I'd never been there before, I had all the questions. I annoyed myself. The clerk didn't let on that he was anything other than helpful. I truly appreciated his grace in that moment. It may seem like a small thing but try getting the same response in Miami/Miami Beach (or, Nashville, these days). People like this gentleman are in short supply in service-facing positions. Thanks to my new best friend, I made the perfect lunch bowl. I think about it often.\n\nWhat was it? Get ready. My green/grains base was spinach and black lentils. Comin' in hot! From there, I opted for the eggplant, harissa and feta spreads/dips. I thought about a lamb/chicken protein combo but not knowing the brand, I went for chicken (as a good standard; in the future, I am mixing). Seeing what I was working with, I topped the goodies with olives, pickled red onions, cucumber, tomatoes, mint, and a little more feta. Getting hungry? I finished the masterpiece with dill sauce AND lime tahini sauce. BAM!! But for my soda faux pas, I would have crowned myself the master of CAVA. I sat down, smelled the goodness in front of me, and got to the business of mixing all the ingredients together with the speed and precision of Snow White's stepmother at her cauldron (and with the accompanying posture). I.could.not.believe how good every bite was. I mean it, y'all. Every.bite.\n\nThe green/grain base was substantial. The vegetables were crisp, the dips were deep in flavor, the chicken was moist and well-seasoned (and, plentiful), and the sauces were bright and flavorful. This was not Karen's potato salad. This was the work of people who enjoy spice and flavor.\n\nSaved my life.", "author": "Johnny T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Came here recently during a lunch break with co-workers. Place gets crowded fast during the lunch rush since it's around the courts, metro-tech and city tech college. \n\nThe food is very fresh and you can tell it's of good quality. Their food is considered \"Mediterranean\" but it's more like Greek or middle eastern style foods on a salads or pita bread. \n\nI got the grilled chicken over salad with hummus dip. It was all good and pretty fulfilling. The only issue is the price. Expect to pay 12 bucks without a drink.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-23", "description": "They give larger portions of your protein of here than in Manhattan! I used to just go for roasted vegetables because I'd get a little why-bother sprinkle of dry, chewy chicken every time I asked for it, but I was happily when I saw their generous scoops here. \n\nOtherwise, I found that everything tasted pretty much the same. If I had reaaally paid attention, maybe I would've guessed that the quality of ingredients to be perhaps? a little fresher, but I can't say for certain. The chicken certainly looked more fresh and moist that I'm accustomed to for Cava, and my friend got their supergreens but did not complain of any of the rock-hard brussels sprouts that I usually associate with that mix at other locations. Again, I can't confirm any of these positives for certain but I am feeling like I might be partial to this Cava location out of all the others for when I'm craving just a big mish-mash bowl of whatever ingredients I want.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "I went to the original Cava in Manhattan (I think it was the first?) and had a 5-star experience, despite the very long line. \n\nWhen it came to BK, so close to home, I rejoiced! \n\nCava is delicious, feels healthy, and for the amount of food, affordable. We go, as two adults and two small children, and have plenty of food with one salad and an extra pita. It's a solid meal for under $15. (Maybe we don't eat a ton, but we always feel full!) \n\nThis Cava missed a 5th star because on our two visits so far, most employees seem like they would rather be anywhere else and are slightly miserable. Not mean, but there is certainly no joy in Cava-ville.* I'm not sure what is so bad about the working conditions there, but hopefully there are more smiles in the future. \n\nWe'll keep eating there and enjoying it.\n\n*Casey at the Bat reference.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "This place is great! There are lots of options and they give you a lot of food (they give a good amount of protein). The food is healthy, sayisfying, and tastes fresh. For $12 you cant beat it!! I will definitely be back.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "in love with their salads. a variety of items to choose from to make the salad to your liking.  to be honest i think i put almost everything on my salad so to me it tasted delish. for the protein i did pick the chicken and the spicy lamb. enjoyed both. will return again", "author": "Ana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-03", "description": "I am OFFICIALLY DONE with CAVA. \n\nI will only eat this chain in the west coast... (see my other CAVA review). Something is seriously wrong with the quality here in NYC. WTF is it?!? \n\nOk - first, NOT that the line was long, it was not managed correctly.  The staff themselves look like chicken running without its head!  It should not take 10 mins to move 1 customer.  There should be a clean line assembly. Period. Hello?! If you're gonna copy Chipotle, at least get the efficiency down!!!   \n\nWhat a nightmare to eat here. Thinking, \"hey there's only 10 people ahead of me, I'll be done in 10 mins\".  Wrong, the line does not move fast (don't listen to those lies), you'll be lucky if it moves at all. \nAnd Be Warn! They confused themselves when trying to figure out the orders of the bowls because the guy totally messed up and \"placed my bowl\" behind the customer after me.  How does that work for efficiency and accuracy? Zero. \n\nAbout my bowl... of inadequacy... rice bowl, with yogurt \u0026 hummus; added grilled beef balls, red cabbage slaw and cucumbers \u0026 tomatoes. Nothing fancy but hoped the food would deliver because once again, I had a really epic bowl in Santa Monica.  This branch - It did not. The beef balls were so dried, as if I'm chewing on beef jerky.  I was so disappointed once again in the quality, that I simply made a decision to forgo eating at any CAVA branch.   Life goes on. Until my next trip to Santa Monica!", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-25", "description": "The people here just the nicest. Kind enough to put up with me arriving 15 minutes before close. They still had almost everything ready for making bowls.\n\nTheir app looks and feels a lot like the Sweetgreen one (which is one of the best), but it's pretty trash and wouldn't let me order for pickup beforehand, so I had to rush over. The guy behind the counter told me it's a known issue.\n\nAnyway, got a greens bowl with spicy lamb meatballs, a TON of veggies, and the harissa sauce + the red pepper hummus. Real fresh, delicious. Maybe a bit on the pricier side for lunch, but definitely a good dinner option as they load the bowl up and veggie toppings are all included!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-13", "description": "For the past year my friends have raved about cava, so I was excited when they finally came to Brooklyn. I came in and got on the line , from start to finish, it was about a 35 minute wait.\nThe employees were nice and very helpful. You pick a grain or salad , or both! You pick a protein and various toppings. Which is great! \nThis is the mistake I made, I mixed everything together in my bowl, which ended up making the food taste bland. \nMy supervisor had also gotten a bowl from here, but she ate everything separately and she enjoyed it! \n\nHere's the downside, I found out that certain city employees get a discount. I definitely don't think this is fair. If you're going to discount one group, give the discount to the other city employees as well. Not cool guys.", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "Still the same flavors as I remembered- my favorite ginormous salad in a bowl, medi-chipotle style. About dam time they opened a bklyn location! \n\nBasically pick your greens, grains (hallelujah lentils), meats or veggies/ falafel, dips and toppings. Oh yes, I always take that come-with pita and an extra one please (wink,wink) not to be confused with the crunchy pita chips they now offer and charge but those r yummy as well. \n\nMy bowl is 9 times out of 10 unclose-able because I just am that person. You know, that person who doesn't agree with $16 salads unless it can double as dinner too. You know what I am taking about. \n\nNevertheless, Cava's crew (not sure how customer service is worked into their mission) is always pleasant even though I am that customer. Love them. Don't know if they love me as long as they smile like they do.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "I love CAVA and although the seating inside this location gets limited during peak hours, there are plenty of tables outside in the square. The lines during lunchtime move relatively quick, but if you're on a time crunch I would definitely recommend downloading the app and placing an order in advance for pick-up. They're so generous with their portions and unlimited toppings, leftovers from lunch can easily translate into dinner.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "Would be 5 stars for taste of food. Only gets 1 star knock for inconsistency that my wife's falafel was over cooked and dry. Definitely a healthier fast food option, will order from frequently. Don't underestimate the spice of harissa.  Great addition to downtown Brooklyn.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "I really love CAVA's grain+green bowls (more on this later), but what keeps me coming back to this particular location is the staff. They're friendly, helpful, and nice and it never feels like they're rushing you. Even when I ask for my sauces on the side (I know, so annoying). Even when the line is crazy out the door.\n\nThe greens+grain bowl is out of this world. For $11.40 you get a huge portion of healthy greens, grains, a protein, lots of tasty and flavorful toppings (as many as you like), up to 3 dips/spreads (yes, 3! My favorite is the harissa), and dressing. I usually can't finish it in one sitting so I have enough to save for a snack later on.\n\nThe best part about CAVA is that I never feel guilty after eating it because the ingredients are pretty healthy (lots of veggies) and so fresh. I could eat it every day and not get sick of it.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "I was lucky enough to get a ticket to their Pre-Ooening tasting! I had the Greens and Grain bowl with the splendid greens, brown rice and lentils as a base. Next I added braised lamb and chicken. There were delicious dipping sauces (I had hummus, tzatziki, and red pepper hummus) and plenty of unlimited add-on. My meal was hefty, filling, delicious and very fresh. All of their employees were friendly and amazing. I even had leftover's that I nibbled on as breakfast. I'd definitely go again. The lemonade from the machine was sweet and delicious. They had a blood orange ginger drink for those who want a less sugary option as well as unsweetened ice tea and some really interesting side flavors. My friend had blueberry soda! Check it out if you're Downtown Brooklyn on Adams Street.", "author": "Anya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Went here on a Tuesday for lunch with a group of co workers. They've been here a few times where this was my first time! I was beyond excited especially because I heard so many good things about the place.\nLocation: It's where the old hill country chicken place was. It's right on Adams Street .\nBusy: Always busy at lunch time so be prepared to wait in line for about 5-10 minutes which gives you plenty of time to figure out what you want to eat. The line moves quickly so don't let a long line keep you away from this place. \nFood: The food is really good and fresh tasting. I got the grains (white rice) and greens (splendid greens) with meatball (beef not lamb) hummus, crazy feta, tzatziki ( on the side), shredded romaine, pickled onions, tomatoes and onions , olives, pickled banana peppers, and the lemon herb tahini dressing. I asked for a lemon wedge, but that got forgotten and instead I got some really good sauce or dressing that was green. Yummy! The whole thing ends up being huge and quite filling! I had the first half for lunch and the second half as my afternoon snack. \nThey have drinks and stuff, but I opted for my water. (I heard the Mexican cola is gross...)\nCost: The price is worth it especially if you're getting two meals out of it. Most people are full for the day after eating here- but it depends on how big of an appetite you have.\nOverall: I'll come back to enjoy a meal that doesn't have me feeling like a fatty!\nSorry no pics I was so hungry!!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "I tried Cava for the first time at this location and now I'm hooked. Cava is like the Mediterranean Chipotle. You pick your bases (rice and/or leafy veggies, or beans), variety of  hummus, add meats, veggies or falafel, then add an assortment of other additions. At the end you top it off with cheese, herbs and/or sauce. \n\nMy favorite is the greens and grains (brown rice \u0026 arugula) with harissa and hummus, half falafel and half vegetable \u0026 I basically add all the additional toppings. Don't forget to add mint and lemon at the end. It adds a level of complexity and freshness to the bowl! I also get the Greek vinaigrette. Their strawberry mint drink is tasty also - I mix it with the lemonade :)\n\nThe food is so fresh and the staff are very pleasant. I recommend if you're looking for good fresh food.", "author": "Briana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-27", "description": "Just got lunch from CAVA and I was pleasantly surprised by it. Ingredients are super fresh and well balanced.  I had a salad with double protein braised lamb (oh yeah, I'll be seeing you again) and spicy lamb meatballs (nicely browned, but too salty for my tastes) with cucumbers/tomatoes, slaw, olives, Feta, Fresh Mint (surprisingly really increased my enjoyment of the whole salad) and the Green Harrissa (which has some heat but isn't overly spicy in my opinion).  Placed my order online and it was out right on time.  I don't buy lunch often while I'm at work,but when I do next I could see CAVA making the cut.  Welcome to the neighborhood, Salute.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "To everyone who gave less than 5 stars, y'all a bunch of haters. Food is always amazing and on time when i order ahead on the app (f**king dope). The staff is always friendly and attentive. My absolute favorite place to grab lunch or dinner in the neighborhood.", "author": "Steven K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "I am so happy this place has arrived in downtown BK!  It's like a Mediterranean version of Chipotle. The line for lunch (1230-2ish) can be insane, so I'll order in advance via the app and it's usually ready when I arrive.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-03", "description": "Great new spot just opened last week, my second trip to CAVA, first trip to this location.\n\nOrdered braised lamb today, a bit bland. Apart from that food quality is consistently good (fresh, tasty, not oily and salty)", "author": "Jimmy L."}], "servesCuisine": "Mediterranean", "priceRange": null, "name": "CAVA", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/PdjHRjS5tJS9tZpc1LUuww/ls.jpg", "@type": "Restaurant", "telephone": "+19292967809"}