{"aggregateRating": {"reviewCount": 30, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Excellent food! I come here all the time when I'm in the area. Never disappoints! I always get the bowl with chicken or lamb and veggies. The crazy feta is really good and the Tahini sauce is just fantastic! So glad they opened up a Cava here!", "author": "Kiya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "This is new healthy Mediterranean place that open where hill country was. Came here for the first time. There was a short line. It was lunch hour after all. You can choice a bowl (greens or grains or both) pita or pita and soup. I got a bowl of greens and grains with a mixtures of super greens, brown rice and black lentils. Then pick the proteins (lamb, chicken or falafel) You get to choose up to 3 hummus. A huge variety of add-on toppings and assorted sauces. It was a filling whole meal. I got chicken but can't wait to try the lamb. I work near by so this place is now part of my to-go places for lunch.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "Amazing fast casual, healthy Mediterranean food that's a welcome addition to the Downtown Brooklyn food scene! The staff is so friendly and mini pita with lamb was divine (and quite filling)! Highly recommend and can't wait to try everything", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Im so happy CAVA is in Brooklyn now! I'm surprised with the negative reviews. The food is great, clean ingredients, and pretty healthy. The service is not as slow as people mentioned here. I think it just get truly busy during lunch hours. It's one of the best options in the neighborhood!", "author": "Gabriela D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "I first tried Cava near my office in Jersey City so I was excited to find one in Brooklyn.  There are so many wonderful possible combinations.  Starting with grilled chicken or meatballs is a delicious base.  Super greens, 3 sauces which are great and finished with lemon tahini.  This location makes great food and the staff is very pleasant.  The only thing I would change is the location as it is a bit far from my place in Bensonhurst.  Feel free to expand this way.", "author": "Ozzie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "For the first try my Mini Pita was just right! Nice refreshing flavor with just a kick of spice. I had the chicken mini pita with purple onions, Cumbers, and topped it off with the green harissa! Perfecto! Service was great as well! Will definitely be back for try (maybe even today! )", "author": "Ericaaa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-14", "description": "Do NOT go here if you have celiac or any other serious food allergy/intolerance!!!  I got sick both times I went here after being assured that I was getting a gluten-free bowl.  Their \"Allergen Chart\" is incorrect, which should be illegal, as some of us get VERY SICK from certain ingredients and don't bounce back quickly. It says the chicken is gluten-free even though it's cooked on a grill with pita -- WTF?!  I got sick after the first time and thought it was because they sprinkled a bready ingredient too close to my food.  The food is delicious so I thought I'd give it another try but watching the meal preparer like a hawk.  So, today I went to order what I got the last time and was told I can't order rice because their rice contains gluten, and can't get the lentils because the rice ends up in the lentils! (And they didn't tell me that LAST time when I got rice and lentils?!). So, I skip the rice and lentils, select the chicken, confirming with the preparer at each step that what they're putting in my bowl is \"definitely gluten free with no cross-contamination\".  Then, while eating, email customer service telling them I clearly got glutened previously, etc... She replies, stating \"while our [lamb] and meatballs and chicken are gluten-free, they are COOKED ON THE SAME GRILL AS OUR GRILLED MEATBALLS WHICH CONTAIN PITA as an ingredient\"!!! [emphasis, mine.]   Got sick after lunch, just got back to my desk, Yelping to try to help prevent any celiacs out there from getting sick.\n\nBackground: I am very good at avoiding getting glutened/sick and was fine for many months until eating here. Only eat here if you do not have a food allergy, as it is delicious, just so sad how they carelessly put people's health at risk.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-20", "description": "Wonderful. Got to experience their soft open. Great customer service, fresh food, good flavors and I appreciate their dedication to not using nuts. I wish they had a seafood option", "author": "W D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-05", "description": "No thanks. I didnt have an opportunity to try this location. One of the employees was using her bare hands to grab salad mixes. She also had a scrunchie on her wrist while she did this.", "author": "Mr H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-03", "description": "pretty average for a pita, definitely not authentic, so many toppings it ends up tasting like mush. nice that there are a lot of vegetarian items but I think it would go much better if they had traditional large thinner pitas that would fit all the goodies", "author": "Maya S."}], "servesCuisine": "Mediterranean", "priceRange": null, "name": "CAVA", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/PdjHRjS5tJS9tZpc1LUuww/ls.jpg", "@type": "Restaurant", "telephone": "+19292967809"}