{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-12", "description": "I am a vegetarian and am always very careful about not ordering meat.  I eat thai a lot and usually look for \"vegetable dumplings\" on the menu and am always VERY clear to order the veggie and not the dumplings filled with meat.  When I went to ghang I ordered the vegetable dumplings, but when I took a bite into them, it was clear that I was eating meat.  As a vegetarian, this was absolutely disgusting to me. I told the waitress that I ordered vegetable dumplings and she said incredibly rudely and angrily, \"No you did not.  You ordered the Thai Dumplings.\"  The Thai dumplings have chicken and shrimp in them and I definitely did not order them as I didn't even recall seeing them on the menu since my brain is so used to scanning for the word vegetable.  I told her that I did order the veggie and she still said that I didn't and DID NOT APOLOGIZE.  She brought me the veggie dumplings, but still, I was SHOCKED that she was so RUDE to me and did not even say sorry.  I have never had a waiter or waitress say that I was wrong---what about \"the customer is always right\" rule?  Well, this time, I was absolutely right and I was incredibly disgusted by her response to me as well as the awful experience of eating those dumplings.  Vegetarians and anyone who does not want a rude waiter or waitress beware of this place.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "I enjoy the food here very much. It's a great go to for family dining. The dishes are flavorful and the serving sizes are large. I usually go  in the afternoon so I have not experienced any issues regarding lack of attention or long waits. The lunch menu is a bargain! But, be warned, if you do not remember to specify that you are ordering from the lunch menu, they won't ask you. You will be charged for a regular entree, and not receive the extra items that would have been included otherwise.", "author": "Laura C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}