{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "This is my takeout place in Cobble Hill for Thai.  I actually prefer it to Joya and I've never really understood the hype on Joya.  That said, this place isn't blow your socks off Thai.  It's decent and it is well priced and that is enough for me.  It's also a lot easier to get a table here if you are going out for Thai.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "Bypassed the lines at nearby Joya and hit up this place instead. Though lots of empty tables is usually a bad sign, we were very happy with our meals. The food was delicious. Pumpkin chicken curry -- right amount of spice, interesting Asian pumpkin, and lots of other veggies in a thick orange sauce. Lava salmon -- well-cooked large salmon filet, with a delicious sweet-savory sauce, and tons of fresh veggies. The kitchen was a bit slow, but our waitress was very nice and apologized multiple times (and gave us a free dessert for the trouble). We will definitely go back!", "author": "Kelly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-03", "description": "I love, love love Thai food and have always loved eating at Tuk Tuk, which is no longer on Smith Street (And hasn't been for quite some time now). However, it seems as though some of the staff is now at Ghang Thai Kitchen, which I had the pleasure of trying out last night. \nThe food was prepared to perfection! I had the crispy, succulent calamari with an entree of Pad Thai w/ Roasted Duck. Absolutely delicious! \nI used to be a pretty loyal customer of Joya, but my god are they a pretentious bunch. What lead me to discovering Ghang Thai Kitchen was the fact that I was overlooked by the host due to my pigment. As I was waiting to reserve a table, the host asked me for the time, then had the audacity to take down the name of the two young girls behind me, who happened to lack melanin. Then I had to tell him my name so he could take it down, which he placed under their names. He wasn't even going to ask for my info... This is 2010 and I don't have time for that kind of BS, so I will no longer be going there since they don't seem to want my business.", "author": "Ms. E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "Smith street location was awesome but new Court street location just average.  Food doesn't seem as fresh. Bummer.", "author": "C K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "They've gotten my delivery order wrong a few times.\nTheir dishes are inconsistent and not that great.\nThere are sooooo many other Thai places in the neighborhood and pretty much all of them are better.  When it comes to Ghang Thai, I say, why bother?", "author": "M M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "Awful.  This was the worst meal I've had in a long time.  The shrimp was super overcooked, the duck was dry, and the vegetable dumplings were mushy and tasteless.  AWFUL.  I like the fountain.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "this is my first real thai place in new york city. i didn't expect much, since i have been spoiled rotten by king of thai noodle and other great thai places in san francisco (and i was totally disappointed by Spice). \n\nthe food was YUMMY! when they say it's spicy - it will kick ass! our party of three had vegetable dumplings, duck noodle soup, vegetable and tofu (feel the pain) spicy tom yum soup, special chicken with red curry, and steamed red snapper.  the dumplings were one of the best that i have had in recent memory - stuffed generously with vegetables. duck noodle soup delicious; the meat eaters cleaned out the bowl out of shear enjoyment. the tom yum soup was full of flavors and it had enough happiness spicy. the special chicken was very spicy but the meat eaters enjoyed it because it had the delicious wow flavors. the red snapper was really good!\n\nthe service was excellent - our waitresses were nice, attentive and efficient! the decor was sleek, modern, and trendy (but in a good way).\n\nthank you for giving me hope that there is good thai food in the city.", "author": "huong n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "Best Thai food in the neighborhood.  Portions are great and service is attentive.  Backyard is cute and comfortable although the tables are a little close for my liking indoors and out.  The bathrooms once again are huge and clean.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-12", "description": "Meh, Ghang Thai was ok. My party waited for about 10 minutes before the server came to take our drink order- pretty inexcusable being we were one of 4 tables in the place. The food was good, but the server was just too brusque for my taste. All in all, it was an underwhelming dinner. With better/cheaper food just steps away at Joya, there is no reason to come back.", "author": "Danielle P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-17", "description": "When you walk into Ghang Thai on Court Street, you are greeted by a soothing waterfall-type design feature and somewhat subtle, yet upbeat music.  Along with the sleek and comfortable design, this stands in great contrast to the other local Thai mainstay, Joya.   Unfortunately, it also stands in great contrast to the food, which is anything but soothing and subtle.  Too often, that is, Ghang Thai, uses unnecessary levels of spice that only serve to hide the usually subtle flavors of southeast Asian food and turn an otherwise fresh and flavorful meal into one note of heat.\n\nThe primary culprit was the See U, a noodle dish, with a sweet soy flavor that I have eaten at virtually every Thai restaurant I have ever tried.  Rarely does it have any spice to it, and so some new element of chili might be welcome or innovative.  But at Ghang Thai, it seems they simply dust the dish with the hot chili flakes you might thoughtlessly toss on an underseasoned slice of pizza.  It ruined the dish. \n\nAn appetizer of roasted duck salad with pineapple, cashew and a chili lime dressing had similar flaws.  Althought slightly better -- and containing an admirable amount of nice crispy duck -- the flavor skewed far too much to the chili side and less to the multi-layered chili-lime-cilantro flavorings that mark a solid execution of this somewhat traditional Thai dish.   Though not as spicy, a chicken dish with eggplant, string beans and the chili-basil sauce well-known to anyone who orders Thai takeout, had a similar lack of subtlety.\n\nIronically, a vegetable dumpling appetizer, while attractively presented, lacked almost any punch -- a tasteless mush of vegetables inside a doughy packet, heightened only momentarily by a slight crunch from a few crushed peanuts.   \n\nOne might think I'm anti-spice.  I'm not.  Ghang Thai needs to learn how to use its chili in a way that doesn't seem one dimensional. For now, however, it's back to the other Thai options in the region.", "author": "Russ F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "Really good food! No complaints, only got takeout though. You can clearly see into the kitchen from the bar and it seemed clean and smelled fantastic!", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "Same great taste as the Smith street locale. More hip space and music. Maybe to be Joya-esque? Stands on it's own. Has a nice outside space but we didn't sit there. Will definitely go back. I wish it was closer to my house!", "author": "Luis F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-08", "description": "I've only done delivery from here.\n\nThis place started out great; particularly when the two Ghang Thai's were open \"competing\" with each other.\n\nIn the last four months, this Ghang Thai has gone completely down hill.  They replaced many items on the menu that included cashews to include peanuts instead (cheaper, obviously). The amount of veggies in many dishes has slowly decreased, with an increase of other cheaper items.  For example, my wife ordered a dish with Pineapple in the name, and had two pieces of Pineapple.  I found similar on the curry that included Pineapple.  Items that say they include string beans now include only one or two.\n\nCorners are now being cut. I know that the economy isn't doing well, but I'd rather a raised prices than decreased quality.  I would have given this place 4 stars when it opened, I now give it one.\n\nBTW, they *will* not correct an error in your delivery order.  I told them I was quite sure that they'd given me real Duck instead of Veggie Duck.  I can tell the difference between meat and fake meat.  I called, they said a new one was on its way, then called back 20 minutes later to say they were sure what I was holding in my hands was Veggie Duck.  How did they figure it out, spy cams? It was real Duck.  I gave up and decided to never order from them again.", "author": "B K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "Lovely place and the food is amazing. Asked the waiter to make my food spicy and damn did they make it spicy. Loved it to the very end! The happy hour is awesome as well for a sangria lover such as myself.", "author": "Marquis V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "I love a good Thai place. I yelped Thai Brooklyn and took a chance with Ghang. Definitely loved the intimate atmosphere.  The yellow curry was perfectly sweet and savory and my boyfriend was in love with the Duck Tamarind. Definitely affordable, nice ambiance, and tasty.  We went to the other location and were not as impressed!! Stick to this location.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-22", "description": "Food is great at this restaurant, definitely a good alternative to Joya when the latter is over-packed.  I actually think the green curry at Ghang Thai is better than Joya's.  I will definitely get take out from this place.  The decor is also very nice and not as loud as Joya.\n\nThe reason I only give it a 3 star is because of the service, or should I say what service.  I went there twice in the past two months, once with a large party of 8 or 9 people, the second time with only 3 others.  Both times the service was slow, the last time I went one of the male server actually took the plates away from the table without asking if we were done, if he bothered to observe the table he would've seen that I actually had my chopstick in mid-air trying to grab the last few pieces of food from the plate before he rudely took it away.  Both times I also notice the same server likes to wear very low cut jeans and as he tries to bend over to take orders from the table next to you, let's just say the sight is not very pleasant.\n\nI think the owner should get his/her servers some training, that will make this restaurant a much better one.", "author": "Iris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "It was my first time eating at a thai resturant, and I'm a fan of it. Not only the food was great, and different, the portion of the food itself was HUGE!!!. The drinks were great. I will be coming back to this resturant very soon.", "author": "malayshia b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-19", "description": "Service terrible and slow. We are the only ones here(telling) and are waiting forever. . Food waaay too salty. Stay away.", "author": "E G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-12", "description": "Two stars only because the food was good. The service was awful and the management seemed nonexistent. Of two glasses of wine ordered, one Malbec and one Pinot Noir, both were off! This was because the dopes don't know that wine bottles, once opened, must be refrigerated! (We returned them and got bottled beer instead.) My wife ordered soup and two appetizers. She told the waiter to bring the fried squid rings LAST! So, of course, they were served first. (They went back.) When our friend and I had finished our appetizers and my wife still was eating her soup, food delivery came to a standstill. The servers were going to wait until she had finished her first appetizer course before serving our mains. In order to move things along, we had to tell them forcefully not to wait for her. (We have seen this elsewhere as well. Where do people get these stupid, rigid formalities?) When I ordered my main dish, I told the waiter \"no rice.\" He said he would give me extra veg. \"Great,\" I said. Somehow, either the CIA or space aliens sent in his double to serve me (you guessed it!) rice and no extra veg! Doesn't a waiter need to pay attention? When we first arrived, they were playing the most god-awful \"music\" on their PA system. I asked one of the sweet young waitresses to turn it down. She did! Later, they jacked it back up to even louder than before. The final blow was the server who disappeared with my credit card. I had to go looking for him in the kitchen to get it back! That \"Ghang\" you hear signals my final visit. Never again!", "author": "Barry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "The manager allowed us to use our February purchased restaurant.com voucher which they otherwise no longer accept. We decided on spring rolls as our appetizer with a hoisen sauce. We then ordered three dishes including the following: Green curry(spicy) sauce with chicken, Pad thai with chicken and an excellent duck dish with a delicious tamarind glaze The food was amazing and i highly recommend the entire varied menu. The service was very good as well.", "author": "Michael K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}