{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "I like this place, it is affordable and vegetarian friendly. I will be going back, but unfortunately, I need to wait till it is warmer weather... any seat in the house on a cold day, gets a terrible draft, the door closes like it is coated in molasses and I had to wear my coat through the whole meal.", "author": "CB H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "this is a delivery.com review.\n\ni just found my new thai place to order delivery from! \nordered:\nchicken pad thai\nmixed vegetables + tofu\nbbq beef\ncrispy spring rolls\n\n(and yes, i know this sounds like a very generic meal but the stomach wants what it wants)\n\neverything was good! well seasoned/good flavor, came at the right temperature, pretty big portions at the right price. ive had a lot of thai take-out in my day (especially from this neighborhood), and this certainly ranks high!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "Don't go to this place if you want good Pad Thai. Went last week with my brother. We ordered chicken and shrimp steam dumplings. Not good. I ordered chicken pad Thai and my brother ordered shrimp pad Thai. It was very sweet. I couldn't finish it. Something was floating at the bottom of my glass of water, I think it was a piece of paper. My brother pointed it out. And he had an ant crawling up his chest. They have a backyard so I assume since we were sitting close to the back , it made its way out the back door. Good prices. They adjusted some of the prices by writing over the original price, kind of tacky. nice clean space. Maybe they have other dishes that are tasty.", "author": "Beverly R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-10", "description": "I've had better thai food. Yep, that's my review folks. Ciao.", "author": "Ola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Stumbled across Ghang looking for a Thai place. From the outside it looks very modern and chic. The inside is small but cozy. There is also a patio in the back but it was closed when I went. My boyfriend and I ordered calamari and the Thai crepe as an appetizer. The appetizers took a while to get to our table, but the calamari was amazing! The Thai crepe came well after we finished the calamari and when we got the rest of food. I ordered the Ghang spicy pan fried udon noodle and it the tastiest dish I've ever had! There was a small piece of paper from a nutrition label in my dish, but I didn't let it ruin my dinner. I ordered the guava iced tea which was really good as well. I gave four stars because the service is a little slow and the paper in my dish. I truly feel as though a four and half star is warranted. We left not feeling disgustingly full, but very well satisfied. I Recommend if you're craving Thai.", "author": "Alana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-14", "description": "I visited my good friend in Brooklyn for dinner last night. We were both craving thai, and decided to dine at Ghang Thai Kitchen, on Court Street.\n\nI love the layout and decor of the restaurant. Very stylish, and modern. The atmosphere is very relaxing and tranquil.\n\nThe food was yummy. I had my usual thai dish from the wok - chicken \u0026 cashew, and my friend had the fried noodles. We both shared the chicken dumplings as an appetizer. The food was delicous, and was served super quickly.\n\nThe only let down for the night, and my reason for rating it a 2 was the very poor service. Our server, was very unfriendly, and disinterested. He made no attempt to greet us, or ask us how our meals were, or if we would like dessert. The moment we finished our entrees he put the cheque on our table.  When I ordered my entree, I actually ordered it without carrots, and asked if the carrots could be replaced with mushrooms. My entree was served with carrots, and I didn't get mushrooms. I wasn't going to say anything, but my friend encouraged me to. When I did, he argued with me saying, I asked to have the dish without mushrooms, and with carrots. 'The dish didn't even come with mushrooms on the menu'!!!! He just walked away, and ignored the problem. Very unprofessional and unhelpful. :( I still however enjoyed my meal. The stir-fry was delicious. Shame about the service though!!!", "author": "Linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "Flavor explosion!!  Top notch, chic Thai at totally ordinary prices!!  This place is almost as good as Schreepapie (sic) w/o having to go all the way to bubble-frick Queens.\n\nGo to this Ghang Thai location, it tops the one around the corner on Smith Street all the way.\n\nWhat you do is you go in and order Lychee juice, or a lychee martini, or a beer.  Then you get crispy spring rolls, crispy duck salad, veggie tom kha soup extra spicy, then get thai basil fried rice medium spicy.  It's the perfect order.  Drunken noodles, pad thai, and lunch specials are also all good.  You will not be able to stop eating this goodness.\n\nThe staff is sometimes sorta clue-less, but in a nice way.  And there's sometimes an odd odor if you sit right in the middle of the place (so go for the front or the back).  But this place rules.  Joya is a joke.  Ghang thai forever!!  Run in for a delightful \"Ghang bang\" ASAP!!", "author": "Jonah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "I loveee this place its cheap and it taste great I like the house soup,fried calimari,there fried rice ,Thai ice tea,and fried icecream yummy.", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "This is one of my favorite places to eat Thai. . It's inexpensive, great food, casual place. . Service is good. It's close to the movie theatre. I always get the curry puff, chicken fried rice (very filling) and sometimes I even indulge in the fried ice cream. Love it! I recommend to try it!", "author": "Nia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "The tough thing about being a thai restaurant in Carroll Gardens and Cobble Hill is that there are so many options.   \nIt's easy for me to compare one place to the next.\n\nI like the casual feeling in Ghang, but the service is a bit inconsistent and it feels freezing in Ghang in the winter.\n I am a fan of their glass noodles, but the ginger chicken is not my favorite in town. Although Ghang is not my favorite thai place in the nabe, it's better than decent and a place that I will probably pop into now and again.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-20", "description": "The service here is probably great...if you're calling for delivery. Quite literally the whole time we were there the staff(not short staffed mind you) seemed primarily concerned with the orders going out the door. Aside from a table of 2 my four top were the only customers in the place, which is telling, and still every move the waitress made fell short of a sloth's glory. When we asked what the e.t.a. of our long awaited dishes was the waitress replied \"why, are you in a hurry?\" WTF! it was one of those moments you regret not having more time to give that question the breathtakingly obvious and hurtful responses it deserves, oh well, opportunity lost. Then, when the food did arrive it was either too salty or just kind of not worth the wait.\n\nGhang thai, more like Lame thai...right?", "author": "Granger G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-25", "description": "We love to stay in a brownstone in the BoCoCa area of Brooklyn. one of the primary reasons for our decision is: Ghang! It is quintessential New York in its look: long, narrow, dark, moody, and stylish. The food is amazing. The duck is phenomenal, crispy skin with tender juicy flesh, it is truly amazing. The prices are very fair and the staff, including the chef/owner, are so very attentive and accommodating. This is a Brooklyn jewel. Calling the other 4 boroughs, check this place out!", "author": "josh j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-06", "description": "After going to the original Ghang Thai (terrible), I reluctantly tried this location because the wait at Joya was too long. Must admit, I liked it much better than Joya because a) atmosphere - not as cramped and I didn't feel like I was going to bump into another party just by moving around b) service - Ghang's servers were much friendlier and helpful and engaging c) quantity of food - quality of the food is the same as Joya, but I think you receive much more food at Ghang. \n\nTheir lunch special is a fantastic deal. A ton of food for less than $10 and I had enough to take home for another meal the day. \n\nStill fairly unknown so you never really need to wait for a table and they accept credit card which Joya does not.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-31", "description": "On subsequent visits the food has been disappointing.  The staff is still nice, which I appreciate.", "author": "Anna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "5 stars because the food is almost always delicious. Their curries, rice dishes, noodle dishes, soups, and salads are consistently excellent. I'm not a big appetizer person, but their fresh summer roll is great. The flavor profile of Ghang is usually a little bit spicy than some other places, so if you can't take the heat be sure to order medium spicy. Generally, everything is quite flavorful and they don't go overboard with fish sauce (which I greatly appreciate!). If you like curries, you can't go wrong here. Finally, I've always found the service to be good; the staff is friendly and the restaurant is very clean.", "author": "AP H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "I've been here a few times for dinner and I've enjoyed it each time.  The food is good (solid pad thai, good curry) and the prices are just a touch higher than Joya down the street.  The service leaves a little to be desired as I've always had to ask for my check after waiting for about fifteen minutes once I finished my meal.  It's a great spot to go before an evening movie at the Cobble Hill Cinema.\n\nAll in all, we still go to Joya when we can eat outside to avoid the extremely loud music they insist on playing, but if their courtyard is full or it's too cold, we come here for a great alternative.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Yummmy! Great Thai food and beautiful restaurant. Came here on a Saturday night to use a restaurant.com gift certificate. We ordered chicken sate, Thai dumplings, Pad Thai and drunken noodles, all were delicious and portions were very generous. The decor was lovely, it had a gorgeous mix of brick and wood with amazing accent lighting. Perfect place for a date!\n\nI will definitely return here!", "author": "Amber W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "I love this place! In a neighborhood packed with Thai restaurants this is by far the best, and has become the only one I order from or go to. Excellent food, though usually on the spicy side. I usually order \"medium\" but at Ghang order \"mild\". I'm a vegetarian and they have great veggie options, including vegetarian duck (way better than tofu). \n\nTheir delivery is insanely fast. You hang up the phone and food arrives. It makes no sense, I seriously do not understand it. \n\nNice small outdoor area in the back.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-14", "description": "Bland jade rice and ghang thai noodles. these used to be much better.. :(", "author": "chris m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Great food and service at this local Thai hangout. Toby our waiter is marvelous. He's caring and conscientious. He kept checking on our table. Tip: food here can be super spicy so say something.", "author": "Wilson L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}