{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "Good food, spotty service.\n\nGhang has great glass noodle soup and is sensitive to vegetarian eaters. They'll take the egg out of dishes that usually come with egg. Not all Thai places offer to do that. \n\nThe service can be slow because they do so much delivery that the kitchen can't keep up if the dining room is full. \n\nGood lighting (quite dim). Better design than your typical cheap-and-cheery weeknight dinner option.", "author": "Laura N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-26", "description": "The Food is delicious but the only thing is they don't give you much food or noodles esp in the drunken noodles. Over all the food is good and staff is great too!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-16", "description": "Questions I have about my delivery experience:\n\nWhy were the Pad Thai and the Drunken Noodles basicallly the same?*\nWhy didn't the latter have broad, flat noodles?\nWhy were there little bits of plastic hidden in the noodles?\nWhy are there two Ghang Thais, a block away from one another? \nWhy didn't I order from the other one?**\n\nJust for fun, I typed \"why\" into Google, and the first three auto-fill responses are: \n\nWhy is the sky blue?\nWhy did I get married?\nWhy is a raven like a writing desk?***\n_________\n\n*Thin, bland noodles with a tiny bit of heat.\n**Laziness. This is the one that happens to be on SeamlessWeb.\n***WTF?", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "That is amazing food especially I like drunken noodle .... So yummy and place is nice and clean . Except kind of wait a bit longer and no enough waiter or waitress ... I guess ... Good and drink are good .....", "author": "Zaw Win T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-05", "description": "This is probably the WORST thai place I have ever been to!\n\nThe SERVICE was HORRENDOUS! We were a group of about 8-9 people and they wouldn't take our appetizer orders unless we were ALL ready to order. They literally pretended they didn't see us. It was actually this young looking guy with a shaved head - seriously, what an ass.\n\nSo there were about 4-5 appetizers ordered - each one came out after the other was finished..uh who does that???\n\nThen after all the appetizers were done we were about an hr+ in. Then they started bringing the food - in the EXACT manner as the appetizers! The first person got their food and he decided then, to tell us they were out of the duck so the 2 ppl who ordered that wanted to switch to beef and pork. WOW.. that guys SEEMS to speak English, but cannot understand what we were saying. IT WAS INFURIATING.\nSo 12-15 min after ONE PERSON GOT THEIR MEAL someone else's came and it pretty much followed this pattern until almost everyone got their food. Then they took the longest on the last dish - did i mention 4 of us ordered the same thing??? just a separate meat. I mean REALLY? felt bad for the chefs and another waiter who was really nice (very young looking kid with glasses).\n\nSo now we're looking at about 2hrs+ and at this point, everyone's ready to go - the \"See U noodles\" were too sweet and/or too peppery. Not worth the wait or rudeness. The curries were watered down and the birthday boy couldn't even eat it. Pad thai  - well let's just say the girl who ordered it came later (didn't know about the drama) and still thought it sucked and i quote \"i don't even know what that was.\"\n\nThis place really was the pits due to that douchebag guy with the shaved head - obviously he hates himself and his life. But now the icing on the cake (no pun intended for the following comment)\n- one of the girls brought a cake for the birthday boy and we asked them to bring out since we wanted to get the eff out of there....\none of the guys FREAKING DROPPED THE BIRTHDAY CAKE!\n\nI mean are you KIDDING???!?!?! that poor guy looked like he didn't mean to bc he looked remorseful) but we couldn't help but think it was on purpose. It's a wonder we even left gratuity at all. That was some BS crap right there.\n\nNeedless to say I will NOT BE RETURNING to this place.\nmaybe if i'm feeling adventurous i'll try the one on Smith st. but i'm thinking uh NO.\n\nDOUBLE THUMBS DOWN!", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-10", "description": "I had to give this place another shot since the Ghang on Smith closed, but I was let down and it pales in comparison.\n\nFirst of all we were placed all the way in the back and dealt with a draft; when I asked about drink specials after seeing an interesting cocktail concoction on the chalk board out front the waiter had no idea what I was talking about, and instead of offering to check, I had to go out to find out. \nThe food is just subpar Thai food. Edible and only worth it if you want a cheap meal out. I got the eggplant dish and just wasn't impressed. They have a huge menu which is nice but it is also always more spicy than you order it. \n\nIt is also NOT BYO-so why go here when the spot that took over the Smith St. Ghang (now called Hop Hap) is??\n\nI am giving it 2 stars instead of one for the wide variety of options compared to similiar restaurants and the nice atmosphere.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Ghang is great. The lunch special is a fantastic deal. I'd suggest the Drunken Noodles.", "author": "Neil V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "I love this place! I take my daughter here very few often after school. It's so relaxing and quiet and beautifully arranged. Would definitely recommend this place!", "author": "Nancy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "The food is great, affordable and quick. I used Gang's catering service for my birthday party and not only got a good deal, but also excellent service, with a custom menu weeks in advance that was easily taking my vegetarian preferences into account. Delivery was prompt and staff are super friendly. I am glad someone saved me a plate of food, as my guests cleaned the buffet up within minutes... \n\nEspecially recommended are all forms of dumplings, 'money bags', and fried tofu crispy noodles with tamarind sauce.", "author": "U G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "The coconut mojito is really awesome worth the price and the size.  Other than that the food is great as well. I have been there four times!", "author": "Annie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Ghang Thai is probably the best combination of delicious food, cheap prices, and aesthetically beautiful space for Thai food in Brooklyn. Five stars! \n\nLike so many restaurants on this strip of Court Street, Ghang Thai is adorable!! The inside is dimly lit but clean and sleekly furnished, and they have outdoor seating in the backyard. \n\nThe food is shockingly inexpensive for such a physically nice restaurant. The \"Sunset Dinner\" is like an evening lunch special that includes a mini-appetizer, an entree, and a choice of wine, beer, Thai iced tea, or soda....for $13! Very wallet friendly. \n\nThe food itself- tasty! I went basic with the dumplings and See U noodles but was not disappointed. \n\nOn a Monday evening it was almost empty, making it a great place to skip the lines and enjoy a leisurely meal with friends or that  special someone you are trying to impress with your Brooklyn dining knowledge. :) either way you can't go wrong!", "author": "Grace A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-21", "description": "So there used to be two Ghang Thai in the neighborhood. This I could never understand. I didn't actually mind though, since I never until recently, ever bothered to come to the Court St. location. That changed because now there is no Smith St. location anymore.\n\nI'm disgusted that the owners chose to close their Smith Street shop and keep this one on Court open. I mean, if they are going to do that, why not move the Chef that rocks from Smith Street on over if they are only going to keep one venue running at a time?\n\nI motor all the way to the Slope for Ghang Thai Smith St. When they closed doors last weekend, I tried hard to like Ghang Thai Court St.\nI did. \nI tried.\nThey failed.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "My go-to place for panang curry.  \n\nI order from here at least once a week.  Sometimes three.  I crave it fortnightly.  I've been ordering from this spot for the past 3 years, and I get the same mostly consistent panang curry loaded with fresh vegetables.  Even though I order it mild every time, the spiciness varies from spicy to RILLL spicy.  And sometimes they accidentally throw in tofu, but I'm so in love with their panang that I overlook those little flaws.  \n\nWas else rocks from this place?  Summer rolls, house salad, veg dumplings, veg rolls, pretty much everything.  My friends have ordered a variety of dishes and agree on the deliciousness.", "author": "Stiph N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "This two-star rating is for delivery service only.  The restaurant itself would get four stars.\n\nI've ordered several times in the past from Ghang, and the delivery was always a bit longer than for the average take-out operation, but worth the wait for their uniformly good fare.  \n\nMost recently, however, after waiting upward of an hour for delivery, I called to be informed that our food had \"already been delivered\".   When I informed them this was not the case, they offered to re-send ASAP.\n\n30-40 minutes later, the food came, but not prepared as requested -- the \"mild\" tom-yum soup was hot enough to bring sweat to the neck and tears to the eyes.  \n\nGo to Ghang for a prompt, delicious sit-down meal with minimal fuss.\n\nAvoid delivery unless you have a lot of time, and patience, to burn before eating.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "The food here is just okay, your standard neighborhood Thai place.  My group ordered a variety of dishes from pad see ew noodles, green chicken curry, to pork basil stir fry.   I found everything to be a bit too salty and I felt really thirsty the rest of the night after eating here.  One good thing is the low price and the amount of food you get for money.  You will definitely not leave hungry.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "The food is good, the ambiance is great, but the service leaves a bit to be desired. I appreciate that the staff pretty much stay out of your way but it's not cool that sometimes they seem to forget they're waiting a table. At least they're polite so if you're willing to deal with that go here", "author": "Dinah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "When I moved to Cobble Hill, everyone said I had to go to Joya for Thai.  I've been there, and it's great.  But so is this place--and it's cheap and usually less crowded.  Outside space: got it. Spicy food: got it.  Great variety of flavors: yes.  I've been a handful of times now, and I've ordered different things each time.  The coconut shrimp app is lovely.  As is the green papaya salad.  Satay: get it.  The green curry is magical, and the udon noodles are doughy and wonderful.  \n\nBottom line: great Thai at a good price.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "I have started ordering here on Friday nights because I just can't deal with the endless phone ringing at Joya, and I tend to crave Thai on weekend nights.  Even though I am a huge fan of Joya, sometimes their delivery feels/tastes/seems like it is rushed.\n\nI've now ordered twice from Ghang Thai with good results both times.  First time I had the Eggplant Wok with Chicken.  They asked how spicy I wanted it, which was awesome because I really like spicy food.  I told them medium and that wasn't hot enough for me.  Dish was good though and the veggies tasted very fresh and not overcooked at all.  I also ordered the calamari app and it was average at best.  Fried calamari, even Joya's which I adore while at the restaurant, just doesn't travel well.  \n\nNext time I ordered the Chili Wok with Shrimp and I got very spicy.  Ok this was too hot and I was sniffling throughout the entire meal.  I'm like goldilocks with the spiciness over here.  I guess spicy will be juuuuuuust riiiight.  I'll remember that for next time.  Anyways, dish came with about 9-10 shrimp that were cooked well, not rubbery and the veggies were again al dente.  I ordered the vegetable steamed dumplings as an app and they were very vegetable-y and just ok.  Since I really like their entrees, I'll keep looking for that juuuuuuust riiiiight app.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "$12.95 for the sunset special was a great price, and it was the reason why I decided to stop in and try the place. The customer service was okay. The waiter had a hard time explaining about the beer and the wine, but did let me taste it rather than explain. The food was mediocre, although the presentation was nice. There just was simply not enough rice on the plate to accommodate the curry that I ordered. Although I ordered mild curry, it was far far too spicy. Not mild at all. So eating it was...challenging. I probably wouldn't go there again, although it wasn't a terrible experience altogether.", "author": "Alexander C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "Pretty average fast thai. Not unlike Song. Affordable and clean. Nothing special though.", "author": "Tony R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}