{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "I live in the neighborhood and Ghang is the best Thai experience I've had to date. I got the lunch special: green salad, two delicious Thai dumplings and a giant Tom Yum Noodle soup with shrimp all for $8.95! The food was flavorful, fresh and beautiful. \n\nBring cash as the credit card minimum is $15.", "author": "Jaime-Jin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Since Thai food is my favorite cuisine, I have made it a habit to try as many Thai restaurants as I can and only revisit the ones that impress me the most. Ghang Thai is one of those very few. Ordered on Seamless a few times and have been so impressed that I decided to patronize in person. Ordered the \"lemon grass chicken\" and this was absolutely amazing. My friend ordered the \"Noodle Tom Yum Soup\" and this also exceeded our expectations. Would definitely order from here again.", "author": "Reena P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "I work nearby and order from them at least once a week at this rate. I typically order the lunch special (which is a solid deal for the amount you get) and usually get the Pad Thai (DELICIOUS) or the Tom Yum Noodle Soup (both with Shrimp). I always order delivery via phone and the gentleman on the phone is always very sweet and precise about my order. I can't wait to visit the restaurant in person once the weather gets warmer. My favorite Thai place in the neighborhood not only because of the quality of the food, but the quality of the delivery service as well. Just got done ordering yet another dish - this time trying their Panang Curry. Can't wait!", "author": "Aster T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Praneet and her staff recently catered an event for us at Brooklyn Law School. The prices were very reasonable for the quantity and quality of food offered. Praneet kept in touch with me and worked with me every step of the way to make it a success.\n\nOn the night of the event, it was pouring but the food still arrived piping hot. Praneet set up food warmers and even brought us an extra side dish. The food was a little spicy but everyone loved it. We will definitely be using Ghang Thai for our catering needs again.\n\n* I also ordered take out for dinner to try before the event and the pumpkin chicken curry was my favorite. Definitely a return place for me.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "My friends and I originally wanted to go to Joya but since it was super packed, we decided to go to Ghang Thai Kitchen instead and was pleasantly surprise because this delightful little restaurant is chic, modern, clean, friendly and quiet enough for us to hold a decent conversation without yelling. \n\nI've eaten here twice and have ordered a few of their dishes and all of them were outstanding. However, I highly recommend their green papaya soft shell crab salad ($9) which is absolutely delicious. It comes with one crab that's lightly breaded and cut into four pieces to go along with my perfectly julienne papaya that was seasoned on queue. This dish is huge and large enough to share. Either way, whatever you order, you really can't go wrong since their food here is pretty consistent and yummy.\n\nThey also have a small patio in the back if you're looking to enjoy your meal outdoors and want to avoid stares from passersby. This restaurant really is a cute little place to dine and best of all, they are now participating in restaurant.com, which makes their meal taste even sweeter, when you see $25 being knocked off of your entire bill!!", "author": "Nga C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "We were lucky enough to stumble upon this restaurant on our wanderings. The staff was attentive, friendly, and accommodated allergy needs. The food was very good. We would definitely go back if we were in the area.", "author": "Beth And Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "I was in search of great Thai food and to my surprise I found this restaurant. The food was amazing . I ordered the Spicy Basil Fried Rice with Shrimp . The waiter asked what level spicy did I want . 1,2, or 3. I chose 3 which was very spicy. Although it was hot it was so delicious. I'm going back again the menu is excellent .", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "These freaking people are great and if you disagree you're someone I assume I'd rather not associate with. Solid go-to's include pad Thai shrimp (pro tip: ask them to remove the tails for you if you're lazy like me) and the crispy angel wings (recipient of my vote for most adorable chicken wing name 2 years running). Never really dabbled in their curry or wok but the other reviewers seem to enjoy them so you probably will too. What really sells this place are its staff who have always been kind, courteous, and gracious, even when I'm desperately calling them after class just 30 min before closing. Great restaurant.", "author": "Galen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Stopped by Joya's around 30 min till close and they turned us away.  Saw Ghang Thai still open a couple doors down and decided to give it a try.  =)\n\nWe ordered: \n1. Pad See Ew (with tofu \u0026 veggies) - the wide noodles were super fresh, and flavorful.  Perfectly sweet \u0026 salty.  I loved the tofu in this dish too.  \n2. Tom Yum noodle soup (with tofu \u0026 veggies) - came with the thin egg noodles, the soup was a little too sweet for my liking but overall it was good.  \n\nOverall, really happy to have found a yummy Thai place for late night eats in the neighborhood.", "author": "Kimberly Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "I just ordered the 'jungle curry'  lunch for delivery .. It was prompt but they forgot to give me napkins and utensils ..luckily I had it .. The food is good .. Not the same as in queens where it is spicy as hell .. Still it was better than other Thai food around the area ..", "author": "Karsang G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "We wanted to go to Joya but as usual the wait was ridiculously long. \n\nWe walked down the block and discovered this treasure. This place is really cute inside and has outdoor seating. \n\nWe were seated right away - there was no wait and the food was just as good as Joya.\n\nI got the drunken noodles with chicken - ALWAYS a favorite and spring rolls. Everything was delicious. My boyfriend got the fried rice (i dont remember with what) and also said that it was really good.\n\nThe mojitos were good size and strong, however, the mango was a little too sweet. \n\nI would definitely come back here to avoid the wait and satisfy my thai food craving. Really liked this place. The service was GREAT as well. Very attentive and nice wait staff.", "author": "Julie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-01", "description": "Good food, HOWEVER, here are my criticisms:  I ordered a tom yum soup, which was not indicated spicy on the menu \u0026 it was. So they brought the soup, boiling hot (which is great, but then you know it's going to take some time to eat it) \u0026 then next thing you know, after a few spoonfuls, they brought the entree!  I found that annoying. So I left the soup \u0026 ate the masaman coconut curry with chicken, which was the ONLY main dish on the menu that didn't have a red paper next to it indicating it was spicy, yet it was. It was very good, however, the sauce did not permeate the chicken \u0026 the carrots were a bit undercooked. All in all a tasty meal, but sorry I can only give them 3 stars.", "author": "Julie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "They didn't get my order correct.\n\nI ordered a chicken pumpkin curry and a papaya salad to-go. I wanted both dishes to be \"mildly spicy.\" When I got home, I started with my salad, and it was covered in chopped-up hot peppers. The salad was too spicy, especially when I ordered mild. If this is considered \"mild,\" then what is \"very spicy?\" Chopped-up habanero spicy? My tongue was so traumatized from eating spicy papayas and shrimp from the salad, that the pumpkin curry was just not enjoyable after. And, my pumpkin curry was spicier than my salad!!!\n\nSPICY ALERT! My stomach was hurting all night long...", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Tons of great Thai in the area (Joya is a personal fave if you have cash), but Ghang stands out. This place is great and inexpensive. Everything from the curries, stir fries, noodles, soups... everything is fresh, tasty and plentiful. On my last visit my friends soup tasted like straight salt water and the waitress was nowhere to be found (despite an empty restaurant) BUT Ghang is still a solid choice for Thai in Cobble Hill.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "Food I will give 3.5 ... Tastes good. Huge menu so lots of choice. It's the usual Thai flavor that you get in most places.... Good thing is nothing tasted bad .. The Tom kha soup tastes v good. Lemongrass chicken was quite flavorful.  \n \nAnd the little garden at the back gets 4... The outside space is small but cute. Tables could be a bit more comfy. \n\nThe waitress was v polite courteous and smiled a lot. Good ! hey serve the sticky rice n mongo !! Please try that", "author": "Gagan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-23", "description": "Well, I came in with my boyfriend on the night of July 4th after the fireworks, so maybe that's where I made my mistake.\n\nThe wait staff was slow, understaffed, and not attentive.  They forgot our order, clearly since we waited about an hour.  I stopped one waitress to tell her but she was too frazzled to care.  She just brushed me off and said it was coming but didn't check with the kitchen.  This pissed me off.\n\nAfter 10 more minutes, I asked another waiter who finally checked with the kitchen.  They clearly forgot our order since everyone who sat after and around us already got served.\n\nThey never admitted to their error.  And they never gave me any discount. \n\nFood was fine if it were on time.\n\nNot coming back due to terrible customer service.", "author": "Anne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Just went there Friday night for my usual Thai style rainbow noodles salad, got to try their special crab meat fried rice. So good, you've got to try.", "author": "Thitima C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "Ordered the eggplant with chicken to go. There were literally 2 pieces of eggplant along with very little chicken and mostly bamboo, which is cheap filler food. Also, the lady there charged my credit card then started pestering me about how it's a 15 dollar minimum to charge and that I should look at the sign.  So weird. Um, maybe next time just mention that BEFORE you swipe my card. With so many great Thai places in Brooklyn,  it won't be difficult to avoid this lousy one.", "author": "Tiramisuzy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "My experience here was quick, cheap and delicious. What more could you want in a Thai place? \n\nThe restaurant was pretty empty when I visited, considering it was a Friday night. There were only a few other tables filled. My friend and I each got their special, which gets you an appetizer (from a select menu, from which I couldn't get fresh spring rolls. Le sigh.) an entree and a glass of wine for $12. Pretty hard to beat in NYC. \n\nThe food is really delicious - I got the steamed dumplings, chicken pad thai and a glass of Pinot Grigio and it was all at the table within 7-ish minutes. My friend's food took a little longer, which we think was due to the frying of her spring rolls. The portions are definitely big enough to warrant leftovers, but I had a few drinks in me and proceeded to clear my plate. \n\nI'll definitely be back if I'm in the Brooklyn area and craving Thai. The decor here makes you feel a little fancy but the prices leave your wallet and belly full. Can't beat that.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "Review for delivery:\n\nOrder: duck pad kee mao extra spicy and the chicken pad thai extra spicy. There's not enough spice in either (I'm not just talking about the heat but also other stuff like basil leaves, etc.) Overall I liked it...3-4 stars for the food. As another commenter pointed out, I like that they don't overly sweeten the dishes...that's one of my pet peeves at Thai restaurants. \n\nDelivery promptness: I got an email notification for 60-75 minutes and almost fainted. Then I got my food in 25-27 minutes. \n\nPortion size: comparable to most Thai places around here. A good bit smaller than what I'm used to back in Austin, Texas but that seems to be the norm here in Manhattan/Brooklyn.\n\nOverall: I will probably order from here again. Not many Thai places around here have duck pad kee mao. This one's decently solid (after some extra sriracha and dried basil I had on hand).", "author": "Diya L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}