{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "Stopped in for an early lunch, around noon. The place was empty except for a table of moms with their toddlers. We sat away from them. Ordered the lunch special. I had the basil fried rice with chicken and my fiance had the wok ginger with vegetables. They misunderstood that we wanted to try 1 each of the lunch appetizers, oh well. They gave us both the dumplings, which were tasty, but extremely garlicky. I enjoyed them, but wasn't warned. The meals were delicious, the basil fried rice though was very spicy. Again, I enjoyed it, but wasn't warned that it was extremely spicy. All in all, delicious.", "author": "Sunita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "I've tried this location twice and only had two types of platters that are pretty much the same, so take my review with that in mind. \n\nThe first time I ordered here, I purchased the Pineapple Fried Rice w/ chicken, it was SO delicious and filled with great flavor! The curry powder to the rice is such a great touch and the rice is cooked to perfection. The pineapple brought a nice sweetness to the dish but I wish the chunks were cut up to smaller pieces. \n\nThe second time I ordered, I got the Thai Fried Rice w/ chicken and it was honestly mind blowing how good it was. The dish came with broccoli, onions, carrots, and some banging sauce on the side they included (it was yellowish). \n\nAnd another thing - the orders typically took half the estimated time which I really love. \n\nHowever, the first and second time I ordered from here, there were NO UTENSILS! I mean I know I'm super hungry, but sheesh, would be nice to not use my hands, you know?", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-17", "description": "Have ordered from here a couple of times now and have come to one conclusion. It's just not good. There are things that are decent and won't make you feel like you've wasted your money but other Thai places probably do better. My latest order was for lunch. Originally ordered the bbq pork lunch special. They called to tell me the pork was unavailable and recommended the bbq chicken. That's fine, I'm flexible and chicken is healthier than pork! Part of the lunch special is an app AND a soup or salad. Got the two Thai dumplings, totally fine, nothing to write home about. No salad though. The bbq chicken was....not that? It was just slightly larger (very thin) pieces of chicken satay with some wet, old vegetables. Was I supposed to pour that incredibly watery, grimace inducing sauce over it? Alas a sauce on the side does not make it bbq. Super unhappy about it. End on a high note, I also ordered a Thai iced tea which was quite nice and the delivery was very quick.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "I have been here twice with my husband. We love the food! The only downside is that the food takes waaaaaay too long to get to the table. We always are waiting three times as long as we should be, despite the place never being busy. \n\nPlus side is that the interior is so beautiful! Love this place. When the service is quicker it will get 5 stars!", "author": "Amani A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-30", "description": "QUITE OFTEN to go orders do not come out complete and have had to go back to restaurants on 2 occasions to get missing rice or salad.  Really bad carry out service also!", "author": "Ariel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "There food is always great to eat and i enjoy everything that they make from there food to there drinks is good the waiter i had tonight made the food very great", "author": "Malek P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "Since I love thai food I am always checking out new places.  This is in walking distance from work, so I decided to try out one of the lunch specials.  While I waited, I was offered either tea or water, and the host/bar person was very friendly so got in conversation with me.  The space is roomy and from my view point, there seems to be a garden area, that would be great during the warmer months.\n\nI love all curry flavors therefore I opted for a vegetable tofu mixed in coconut curry with high heat, because I'm a masochist for spicy hot foods.  The order came with jasmine white rice, salad and a spring roll.  Everything was very flavorful and tasted fresh.  \n\nLook forward to visiting them again and trying out one of their other lunch specials, the portions are just right and the cost is also great.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "I have been here many times but I always order the same lunch off the lunch special menu, \nPad Thai either with squid, shrimp of chicken, the Thai dumplings and the Thai salad. Everything I have ordered has been delicious.  \nAt under $10 the lunch special with comes with the 3 items I mentioned above (There are also other options) is quite the deal. The restaurant itself is lovely and service is first rate.", "author": "Joseph A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Friendly service, and pretty solid dishes, along with a beautiful and peaceful relaxing environment is a five star review from me\n( granted my second visit to this place was yesterday at 10:30, but on our first visit, even with a packed house the kitchen and the service, and the food delivered)", "author": "Queen R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "I have been coming to this restaurant for years now. My favs are the ginger shrimp, mango salmon salad, duck noodle soup, their roasted duck entrees and the Tom kha soup. They always make those dishes well. However, the restaurant has changed management very frequently and as of the past 1-2 years, they run out of items on the menu very frequently, which is a huge turnoff. The past 3 times I've come here, they ran out of what I wanted to order and it was the weekend. How do you run out of menu items on a weekend? To me that's unacceptable for a restaurant. Also, the prices on the menu jumped by several dollars in a span of 3 months or so. I get inflation at some point for sure, but should be done in much slower increments. This place used to be one of my favs, but went downhill with the change of management.", "author": "Sharon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This place has great food and great lunch specials... I used to work in the neighborhood and I ate there at least two to three times a week. The lunch special comes with an appetizer.\n\nFood is always fresh and the people are always really Pleasant", "author": "Mandy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "A group of us were in neighborhood late on a sat nite\nWalked into a few Thai restaurants based on yelp reviews\nEither closing or blaring horrible techno BS music or just unappealing \nWe were ready to give up and go back to the city when we looked up and saw Ghang \nThey were closing kitchen in 5 min but took our order and we were really happy with our dinner \nThe coconut soup was perhaps the nicest I have had anywhere- light flavorful and loaded w fresh vegetables\nThe basil chicken was outstanding\nMango salad equally delicious and all the other dishes terrific\nSurprised anyone would rate lower than 4 so I give it 5 !!   \nGoing back soon but earlier !!!", "author": "Dano O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Great authentic Thai dishes with great dining experience. I'm from Thailand and had dinner here once, think that it's a real Thai taste similar to restaurant in Bangkok. Try curries here, if you want to taste real Thai curry.", "author": "AJ Jirasak J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I came here for a birthday party. The food is really delicious. It's the best Thai food I've had in years. My favorite is the chicken wings. They're juicy and tasty!", "author": "Xiaoquan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "This is one of my favorite thai kitchens. I'm surprised it is not as popular considering the excellence in their meals and service. Whenever I order delivery at work, by the time I hang up the food's ready lol They are usually so accommodating if ever there is an error with my order; proving their commitment to customer service. \nNow the food...my issue with a lot of thai restaurants is that their food is either too sweet or too spicy. As a Jamaican, with a high threshold for pepper, I don't mind, but Ghang is always spot on with their flavors. My favorite is the Drunken Noodles, I usually order it mild because that may be the spiciest meal on the menu. Their curries are great, so are their appetizers, and their drinks as well. I always recommend this place to people looking to dine in the area.", "author": "Janice W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "This place was amazing both food and services, especially the Owners of the restaurant who very kind and so attentive to come and ask if every things are ok . The decor of Ghang Thai us such a unique. The rest rooms are so big and clean. They also serve full-bar if you prefer to have some great drinks. We decided to have baby-shower at Ghang Thai last Sunday after noon, so we called and made a request that we want a party tray of Thai food for 15-20 people ;\nWe ordered: \n: #Pad Thai; our friends and family definitely love this dish and its gone so fast. Thanks to the chef \n: #Thai Fired Rice:  Most simple Dish but kid friendly too. Our nieces, nephews  were really enjoy this dish\n: #Shrimps Roll : Totally significant of this party, fresh full of tastes and very crispy\n: #Mixed Green Salad with Peanut Dressing: Vegan friendly definitely recommend to the one who love light meal and the salad itself is so fresh with the peanut sauce such a perfect combination \n: #Wing and Satay: these two appetizers, I recommend as must have dish for every party \n\nIn short, I mostly suggestion this place to friends and families especially, family's party", "author": "Uraiwan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Have been to this place before and it was pretty decent. Now went downhill. Came here w the family on Sunday night. Service was subpar. Food had good flavor but full of filler. \n\nShrimp summer roll-- full of tofu and filler iceberg lettuce w a tiny sliver of shrimp ($9). Ordered curry w shrimp and pineapple. It came out w chicken. When said order was wrong, replaced it w shrimp w zero apology. Potatoes in curry were almost completely raw. Once telling the waiter, she took it as a joke and chuckled. Green beans were also raw. Shrimps were tiny and maybe 3 pineapple cubes. Pad see u w squid was full of filler iceberg lettuce and 3 small pieces of squid for the entire dish. Fried rice was full of carrots and peas not listed on the menu.\nWon't be coming back here.", "author": "Natalie U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "We decided to have a Downtown Brunch. Food was great my husband enjoyed their fried pork appetizer. I also enjoyed Ghang, the Drunken noodle was the perfect spice to kill my cold.", "author": "Sherqueena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "You know sometimes you just get in the mood for something different. Not the kind of different that leads to trying something new all together but the type of different that is familiar but when prepared differently makes you feel as if your having an all together new experience. I know that was a lot but I hope you get my point. I found that with Ghang Thai Kitchen.\n\nI've enjoyed Thai food may times before but I was most impressed with my meal. The service was prompt and attentive. The honey ginger Martini will make you run in circles it's so smooth. I image most of their drinks are the bomb.\n\nNow, as for the food, I had the Brooklyn Basil for my entree and my partner had one of their signature fried rice dishes. Truly, we both barely looked at each other during the meal because the flavor and spice left us speechless!! We also had their Thai dumplings. The food and appetizers we had should receive an A++ . I really believe both our meals were rather exceptional. My partner usually likes spicy and I do not but that night, I decided to go spicy and it made my dining experience phenomenal. I must try Ghang Thai Kitchen again real soon!!", "author": "Percy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Simply Wow !!\n\nAfter being charged high prices for small portions and so-so tasting food, our host walked us into this place on our last day in NYC. The portions were huge (even by Texas standards) and the food was delicious. We were all stuffed, but I just couldn't stop eating my chicken dish. Our host got the pork chop, turned out to be enormous, and actually TWO chops. And again, very tasty.\n\nThe ambiance was nice and muted and on a cool, rainy night we sat and ate and had a great time.\n\nI highly recommend you try this place. Don't know when I'll be back, but this place will definitely be on my return list.", "author": "Don L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}