{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Awful customer service and mediocre food.  Apparently I ordered $40 of bok choy and carrots.  Refused to remake order or refund anything.  I also have serious concerns about the sanitation standards at this restaurant.  Please avoid at all costs.", "author": "A. J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "These unprofessional, idiots don't deserve a one millionth of a star. I am totally disheartened at the service I received on a date with my husband tonight. \n\nWe got there at 6:05 pm. The place was empty.  Hubby and  and I were the only customers.  At 6:20 pm, I had to signal the waiter, a gentleman,  seated at the bar, talking to anorher employee, a woman whom I will talk about later......\n\nThe gent turns to me and says, \"You ready?\". I tell him yes and he comes over. I asked for drink specials  (as every restaurant has in the area), he told me that they don't offer any specials. Hubby and I order a Gin Pom and a Pear Martini. We also order wings, calamari, ribs and spicy basil fried rice......\n\nA white party of 4 comes in midway through our meal and I notice they didn't have to ask to be helped, for water or ice AND they came to their table frequently......not surprised. \n\nThe chicken tasted like Tyson wings in the frozen food section at Target.  The ribs were old and refried. The drinks were delicious and the rice, exceptional. \n\nThe gent slaps 2 glasses of warm tap water on our table.....ITS LIKE 90 DEGREES! I asked for ice.\n\nIt's time to leave and we ask for the check. I sign and walk out.....NO TIP.\n\nWaitress runs after me on Court St and yells,  \"NO TIP?\" I looked at that chick like she had 8 heads.  FYI....TIPS ARE A COURTESY,  I LOVE WHEN PEOPLE TRY TO HUMILIATE ME (LIKE IGAF) and NO ONE IGNORES ME IN AN EMPTY AND HOT RESTAURANT AND GETS AWAY WITH IT.....DEEZ NUTZ!\n\nI won't be back.....", "author": "Aisha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "This is our \"go to\" Thai place. The flavors and spicy notes never disappoint. Good food should take to some far away place in your mind and this food does. Things can get a little confused at peak after-work take out time, but then that's life in the big city...\nThe curry chicken Rama is my favorite dish.\nThe next time you are in Carroll Gardens-Cobble Hill, check these folks out.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "What a lovely place with wonderful people running it. I came here to dine solo- enjoyed amazing vegan dishes and wine and pleasant conversation with proprietors. their food is so tasty and makes you feel good!", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Arrived here by coincidence at 10.22pm instead to going to my regular Thai Food joint a block away.\n\nRestaurant has a clean and family vibe . was greeted by a friendly staff and ordered Hot Chilli Sour Fried Rice (8.95$) which was to be prepared with Fried Egg, Pineapple, Broccoli , Green Peas, and Tomato Chilli Paste.\n\nAlthough thai food is aromatic the restaurant did not smell like the streets of Bangkok which is a greatly appreciated trait for any asian food restaurant.\n\nThe dish came piping hot in a matter of 10 mins and tested perfectly balanced of flavour and seasoning the scallions were added to the rice at the very last minute which kept them crispy and fresh, however the dish lacked  and peas and broccoli.\n\nIt had flavour of basil but most dominant was the kefir lime leaves and galangal . This dish is slightly spicy and though I ordered medium it would have been wiser to order it low heat instead the next time.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "green curry\npad see u noodles\nthai fried rice\n\ncan't comment on their dining experience\nbut delivery time was standard,\nthe price was right,\nthe food arrived decently hot,\nall while hitting the flavors we were craving\nafter being so deprived in upstate.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "I was highly disappointed to learn the menu changed recently.  On top of that, the prices increased and they even added $$ for udon in already overpriced soup.  I won't go back:(", "author": "Julee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "My favorite Thai in Brooklyn! Delivery always on time and good food! Nothing to complaint about ;)", "author": "Hanna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "This was a great experience eating out and a great atmosphere. The music and ambience was to the T. I felt welcomed and almost at home. Nong my waiter had lots of knowledge of the food and helped by making me some great drinks. Nong kept me happy and is such a great waiter. The overall service was top notch and will be coming back soon. Thank you guys for a taste of Thai in Brooklyn.", "author": "Steven A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Decent lunch spot. Restaurant was not packed during lunch hours, food comes decently quick. I got the lunch special- drunken noodles with vegetable dumplings and house soup. House soup was not good, it tasted like ramen noodle water.. yuck. Vegetable dumplings were ok, nothing special. The drunken noodles I requested spicy, although I like spicy it was a little too spicy. I'll ask them to drop it down a notch, but overall dish was flavorful and tasty. I ordered mine with chicken.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "I have to say, this was pretty damn good Thai food. We first tried getting a table at Joya, but the wait was long, the staff wasn't overly friendly, it smelled bad, and it was overly crowded and loud. \n\nWe happened to stumble upon Ghang and we were pleasantly surprised. We ordered the pad see ew, veggie dumplings, regular dumplings and fried rice. \n\nThe pad see ew was delicious. Not the best I've ever had but certainly tasty. Decent size portion, not huge. The fried rice was so good. Soft rice and a very generous size portion. \n\nRegular dumplings were eh. Wouldn't recommend ordering. Veggie dumplings were much better. \n\nStaff was extremely friendly and very attentive. And the food came out in lightning speed, which was appreciated at 830pm. \n\nOverall would definitely recommend trying over the busier Thai places in the area. Also SO reasonably priced.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Stumbled upon Ghang because I didn't want to go to lemongrass or the usual Joya  (which has been disappointing me for the last few months).\n\nGhang is a very chic and cool looking place, although small it doesn't seem to get crowded. Lighting and decor, very simple yet on point. The menu was very tacky looking (oddly enough) but I guess I can appreciate the pictures of the food they had on there. The waitress was very nice but it seems as if she forgot us even though there was barely any people in there. \n\nI ordered Thai Rice with Shrimp and boyfriend ordered Pineapple fried rice with duck. We decided to go simple just in case (we were really hungry and we were not up for disappointment lol). We also ordered the fried Calamari and Ribs as an appetizer. The Calamari was AMAZING! I love Calamari and I've had quite a share of it in all my years and I can say this is definitely top 3 on my list of amazing calamari. The ribs were very subpar. The Thai Rice was alright, it was average I've had way better. \n\nAlso the drinks were very strong and who doesn't love a strong drink? 4 stars because the rice was very average.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "I had a chance to eat here recently.  I like the ambiance and wood grain made this Restaurant look unique. Although it's a small space it was well laid out and comfortable. The food was good. We had the pineapple fried rice with chicken and drunken noodles with chicken. While we enjoyed our meals service was incredibly slow. We were one of only two couples in the place and yet it took forever to get our drinks. The drinks when they came were very good. I had the coconut mojito and I truly enjoyed it. Better service would have made this a 4 star experience. Truly unfortunate.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "So I like the food. Some of its really good. I enjoy the shrimp Thai\nFried Rice and the Tiger Salad. I have been ordering here for years, a few times a week, and live close by. The last few times I have ordered the guy who answers the phone has been so rude. It's a bummer. Tonight they sent me the wrong order which never happens and you would have thought I was on trial. And it didn't get better when my husband went to pick up the correct order. Yes he went to pick it up even though it was a delivery. They told us to return the food that was a mistake. Which is fine but, if no apology, they hopefully don't interrogate you!", "author": "Gretchen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Joya is overpriced, overcrowded and nothing compared to this place! \n\nEverything was fantastic!!\nThe portions are excellent for the price and the dessert was phenomenal \n\nThis is my new favorite go-to Thai restaurant.", "author": "Latoya W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Main reason for a low rating is the service experienced here..\n\nFood: food was decent, as a table we split some appetizers (fried tofu, summer rolls); for my meal I had pumpkin curry with beef-medium spicy, I enjoyed it.. Perfect amount of spice for me; my boyfriend likes things VERY spicy so he got jungle curry made extra spicy and it was not much spicier than my meal.  For drinks I recommend the coconut mojito (made with real coconut milk and not too sweet), no light beers available\n\nService: we were a large party but there was only one other table seated while we were there.. Waters were not filled, my friend had a fly in her sangria and had to ask for a new glass twice; we felt as if we had to flag someone down everytime we wanted something, no one was checking in on us\n\nAmbience: cute garden in the back for smaller parties, clean inside; full bar", "author": "Kelsea Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Stop by for a chit-chat dinner before heading to a party with my friend from Boston. We ordered Pattaya, corn fritter and coconut mojito. \nPattaya was super delicious, spicy and well seasoned. Seafood was also fresh and big in size!!!. The corn fritter is very delicious, it's  our first time to eat this dish in New York. Coconut mojito also nice, not too strong.", "author": "Bee N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "I was thrilled to hear upon asking before we were seated that their dishes could be customized to omit the soy sauce and fish sauce to accommodate my being vegan and gluten-free. Hallelujah!\n\nI ended up getting the Drunken Noodles without fish sauce or soy sauce and it still tasted really good. I asked for it to be \"medium\" spicy but I'm guessing they were using a more American scale for what \"medium\" meant because I expected it to be spicier than what I got. Still, it had a little bit of a kick ... a little bit more would have been even better. I also expected there to be a little more in the way of vegetables as there were only a few pieces of string beans and onion. \n\nI also tried a couple pieces of the deep-fried tofu and it was surprisingly very light and not at all greasy like I expected it to be. And our server confirmed that the tofu was not dusted in flour before frying like a lot of places do. \n\nFriendly and helpful service. I'm sure I will be back.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "My favorite Thai in the neighborhood.\n\nI mostly know this place from my many Seamless orders. I've gotten all the noodle dishes, and I really came to love their spicy salads, especially the chicken salad. In warm weather, I like to order one of the salads with one of the similarly spicy soups, particularly the Ocean Soup. Neither dish comes in a very large portion, and together they make something delicious and light, and you have to eat it slowly because of all the heat.\n\nWhen I feel like having something bigger, I'll order the duck noodle soup. The broth comes separately from the noodles and meat, and I mix them in a big bowl. It's very spicy, very fatty, very flavorful, and very satisfying. You could probably split it between two people.\n\nI was a customer for months without ever seeing the place. Somehow, I always pictured it as a carryout, I guess because when the food came to me it was in carryout containers. But when I went for lunch recently, I found it was a typically designey Thai spot with a good location on Court Street, a sunny dining room, and a beautiful patio outside. The staff was friendly, and the food was the same food I'd come to love in my home. So in my experience, eating from here is a great experience, no matter how you do it.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Boyfriend and I happened upon Ghang during a walk through cobble hill. I am please to say it was amazing. We shared pineapple fried rice and the mister had spring rolls, shrimp in a blanket and spring rolls. It was yummy. The plum sauce was also very good. I loved the spring rolls- just the right amount of crispy and Mister loved the shrimp in a blanket. Pineapple rice was especially tasty and chicken well seasoned just a tiny hint of curry. Service was great too!", "author": "Stephanie D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}