{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "we ordered from 'ghng thai' this weekend. I was surprised how good the food was! we had\n- duck salad (fresh!! duck was chewy and well done)\n- drunken noodles (bit spicy - i love spicy food, if you like spciy food, go for it!)\n- penang curry with beef \u0026 veggies (good)\n\nI will order it from here again on one of weekends when I crave for thai food.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "I will not overdo the crazy night we had trying to find an open table on a Tuesday night in our home neighborhood...it was Tuesday! Basically, we passed by, said hmm that looks good, then after a mile walk made it back.\n\nNot only did it look good, it was great. Two apps, two entrees and two very full and happy customers.  We've gone back since and vowed to switch up what we ordered, have we found something yet we don't like...no. Enough said.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "1 star for the ambience/interior. The food was decent, but not as flavorful as other places i've been to. I ordered the jungle curry as the menu claimed it's the spiciest. In addition, I ordered it extra spicy, and it definitely did not meet my expectations. I guess my overall impression of the food was meh. I've had much more flavorful thai elsewhere, where they're not afraid to spice it up for me. Not sure i'd return other than for a drink at a place with nice ambience.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "WARNING: DO NOT EAT HERE. SPEND YOUR MONEY SOMEWHERE ELSE. I wish I could give this restaurant a negative star. This place is horrible, the food is absolutely disgusting. Beer was warm and extremely salty food - every dish. Salty to the point that the food is inedible. We were craving Thai food and did not they meet any of our expectations. We took our god daughter visiting from LA - What a disappointment. The customer service is absolutely horrible. The owner and chef is an complete jerk - if he is the owner he should be ashamed of his actions and how he treats his customers. Owners should never yell at customers. SHAME ON YOU!", "author": "Leah P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-09", "description": "I ordered the calamari and the angel wings. The price was good, but it didn't have any flavor and wasn't cooked well. Then the lady begged me for tip.....no beuno. Will not be returning!", "author": "Natasha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "A little uneven, but a nice option if you're in the neighborhood and feeling lost about where to eat and are sick of eating at Joya (which is just a block from your house) but you still want Thai food and anyway you're getting home late from a show in the city and nothing else appears to be open. Just stay away from the pumpkin curry and head for the drunken noodles (and speaking of drinkies...stay away from the wine too). By the way, if you ask for spicy they will actually give it to you. I appreciate this but it might surprise a few people given that so many restaurants wuss out when you ask for your food hot. It's actually hot here. \n\nDefinitely worth a look see.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "I was not crazy impressed but my boyfriend thinks that Joya has gone downhill in recent months and that Ghang will help them pick up their game. So when Joya is slacking, Ghang wins. When Joya is awesome, there's no comparison. Hint, hint, Joya.\n\nThere are definitely more options at Ghang and the prices compare. The food is far spicier though. Medium is more like a spicy anywhere else and spicy is worthy of some milk on standby. \n\nAfter a few months of constant restaurant closings in this hood, I'm more than happy to welcome a new entrant. Especially one that wants to expand their footprint in the same hood as their first location.\n\nGive it a try, especially if you don't have any cash and you're getting a busy signal at Joya.\n\nPS. If you are ordering takeout, make sure you call the right location. ;-)", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "Great decor.  The Masaman curry was spicy and not too creamy.  Chicken was well prepared, no icky gristle.  Nice flavor in the Pad Thai.  Pumpkin curry is delicious, although hot!  Next time I'll ask for reduced spice level on that one.  I'm addicted to the vegetarian duck (also known as seitan).", "author": "Kari T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "Can't beat their lunch special! I love the Spicy Basil Fried Rice and my girlfriend has to have the Drunken Noodles. Wash that down with a carafe of Cinnamon Sangria... Yum!", "author": "Carey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "Walked in on a Sunday night and was seated right away. The place has a nice decor. Service was attentive but our server didn't speak English very well. Some details were left unaccounted for- for example I asked for a cup of hit water which was served to me in a glass (too hot to hold). I was told they don't have mugs, but they serve tea... I ordered a noodle dish with chicken, and ordered it mild as it came with a choice of spiciness. It still came very spicy, which made it hard for me to enjoy. The other people I was with seemed to enjoy their meals. The food came out quickly and overall we had what we needed. Nothing was really bad about the experience, just nothing to write home about.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "Pros-\n\n-It never seems overly crowded, so it's a great alternative to the loud, and over-packed Joya.\n-The ambiance is great. Ultra hip, comfortable seating, and you can actually hear the person across from you.\n-Our dinner came out super quick.\n- All beers are $5\n-Huge portions.\n-The Pad Thai was excellent. Certainly just as good- if not better- than Joya's. It has a bit of a kick, lots of peanuts, creamy, and packed with tofu.\n-Coconut Mojito for $6.\n\nCons-\n-Other than the ordering of our entree, our waitress had no idea what we were asking (drink specials, corona light, chicken or shrimp dumplings)\n-Not once were we checked in on- and there were only two other tables!\n-We had to ask our bus boy for the check, because our waitress was literally MIA.\n\nGhang just might replace Joya as my order-in option, because they take cards AND answer their phones. It's a miracle.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-07", "description": "TERRIBLE service. TERRIBLE food. \nit was infuriating trying to get the waiters attention and it took forever. do yourself a favor and SKIP THIS PLACE!!!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "The food would be ok except that you have to know that \"medium spicy\" means \"extremely extra spicy.\" This is from someone who usually puts hot sauce on things. I almost wondered if this was some kind of stupid joke.  I'll probably go somewhere else next time.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "I appear to be the outlier here since my neighbors seem to think highly of the place. Asked for Pad Thai, \"not spicy.\" Mouth on fire and eyes watering from the first bite. Shrimp seemed very \"off,\" left on plate. Fella who brought it to me seemed nice enough. Manager having a meeting with several potential new delivery employees, blocking the one narrow aisle as I was attempting, unsuccessfully, to pay and leave. Look, run the business in private where I can't see or hear you, not in the middle of my Friday 8PM dinner. \n\nMaybe I was just grumpy. Maybe I miss the Hill Diner.", "author": "Andy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-21", "description": "Stumbled upon this place after realizing our restaurant of choice was closed for the evening. The atmosphere was laid back, with high ceilings, small tables for 2-4 people, and a big window in the rear of the restaurant. The food came out very quickly, but then we didn't see our waitress again until we flagged down a host 45 minutes later for our bill. Luckily we were in the mood for chatting, and it was a great place to do so. I would go here again for the taste of the food and the excellent price.\n\nDetails: The drink special was a coconut mojito which was delicious and inexpensive. My food choices were: Chicken and Shrimp Steamed Dumplings, and Massamun Curry with vegetables and Tofu. The dumplings were decent but there were only 4 of them, and the Curry was delicious but had way more curry than vegetables or tofu.", "author": "Courtney A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I've visitied Ghang Thai Kitchen twice for lunch over the last month. It's just too good not to visit. Their lunch specials are crazy crazy cheap. For under $10 I got a bowl of vegetable soup, a serving of springrolls \u0026 a generous entree from the wok served with rice ( chicken \u0026 cashew nuts). Absolutely delicious!   The service is a little slack, but the food and value for money makes up for it.", "author": "Markus H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "I absolutely LOVE this place, the waitress was very nice, she was able to tell us what taste good and she likes, very detailed about what's in each entree. I enjoyed the spicy red snapper; the chili sauce was great with their jasmine rice. The drinks was good not something to brag about but it was the right mixture. My husband had the chicken and shrimp with rice and vegetables which was goooood also. I can complaint I would def. go back there.", "author": "Meher R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "Great restaurant, I prefer Ghang to Joya. Pad thai is amazing. Good dumplings. Great Thai salad and basil chicken. I have eaten there many times and have never been disappointed.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "I live a block away and have only ordered in.\nVery fast delivery I think it was under 20 mins.\n\nI had the Duck with spicy string beans.  The roast duck may be a step above other places on court.\n\nDefinitely a contender in a neighborhood of decent thai.\nCan't comment on the service as I've not sat down.\n\nAlso I was not aware that it was the same restaurant as on smith.\nI guess they're following the lead of the Uzbek  barber shop (court and smith locations).", "author": "Sheanon C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-20", "description": "past its prime. the spring rolls tasted like something you could pick-up at a supermarket. the mains - pad thai and brooklyn basil - tasted strange. my wife didnt touch her pad thai whereas my BB contained minced chicken instead of the chicken meat one would expect. isnt that MUK/\"pink slime\"? i rather not know.", "author": "Per P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}