{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I have been to Ghang several times and the service is fine, the food is tasty and the atmosphere is top notch. Many reviewers compare it to Joya, and understandably so, but Joya and Ghang deserve to be in categories of their own. Ghang is intimate. The ambiance makes for a personal experience. It's a wonderful date spot. For larger parties, I would go elsewhere or else there's a solid chance you'll be touching backs with a stranger. Also, the menu is haphazardly organized; several dishes' description are incomprehensible because of certain areas with a dark backdrop. Overall, though, I would recommend this place. I particularly like the drunken noodles.", "author": "Anthony T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "We came here before our movie at Cobble Hill Cinema. Originally had planned to eat at Joya but it was packed and the wait was too long.\n\nExpected standard Thai fair but surprised by authentic and flavorful food that wasn't too fussy. Service was pretty good--nothing extraodinary but still attentive w/o hovering too much. \n\nI started with the Ghang money bags and my bf had the Tom Ka. He raved about that soup and said it was pretty much as good as what he had in Thailand so if you like that coconut milk, lemongrass, and chilli broth, go here!\n\nMy appetizer was a bit less successful. Tasted like chicken put pie w/o the chicken- basically potatoes, peas, and carrots in phyllo dough. Too much phyllo and not enough flavor. Sort of like a tasteless samosa.\n\nEntrees were another story. Both were exceptional and we got generous portions for the price (just under $10). I had the jugle curry and my bf had the Red Curry. Both wi/ tofu. Both delicious. The Jungle Curry is marled \"very spicy\" but I didn't find it too hot (I do have a very highthreshold for spice though). The Red Curry was not at sweet as they usually are and tasted like it had some sort of fish or shrimp paste in it. Unexpected but very good!\n\nOverall, I would reccommend. I still want to try Joya but I'm glad we stumbled on Ghang!", "author": "Semuteh F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Awful delivery.. Took over an hour for delivery and they screwed up our order but I was too hungry to get it changed.", "author": "Esther G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Came in late for my bday and was treated like ROYALTY!!!! The wait staff was extremely friendly and courteous, and the food matched their efforts in customer service. I ordered the steamed dumplings, which were AMAZING, as an appetizer and for my entree I had the scarlet red curry with chicken and shrimp, which if you like spicy curry is AWESOME. The surprise to me was the sangria. I'm really not a big lover of sangria but we went thru 2-3 carafes of the stuff and I ate EVERY SINGLE FRUIT!!!! Will def be back again! I suggest you give them a try too!!!!", "author": "Rossano B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Love this place. \nI came here for my friends surprise birthday dinner in which I planned and they were amazing! I made reservations for 9pm and dropped the cake off earlier at around 7. As time continued winding down throughout the day I realized we were extremely late. The host in which I spoke to made sure she called me to remind the kitchen was closing at 11 pm and was willing to take any orders over the phone. By the time we got to the restaurant it was after 10 pm. They didn't rush us but they took our orders and made it extremely accommodating for everyone. They even stayed open late as we lingered. Made some noise and sang happy birthday. Love the staff. Food was great and I'll definitely be coming back!", "author": "Dara J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-26", "description": "Cute place on Court St. The Pad Thai was good, but way too spicy. The dessert was plain bad. We got the fried banana with ice cream. The bananas were frozen on the inside, and the vanilla ice cream had major freezer burn, it tasted like garlic ice cream. Service was okay. Water tasted milky (gross). I don't know if I would go back here!", "author": "Anam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Great service and the food is very clean. You can observe the chef cooking so is a mayor plus! Totally recomended and great for a date!", "author": "Cindy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-13", "description": "Yet another mediocre Thai restaurant in the hood. \n\nMaybe it was an off-day in the Kitchen, or maybe I got a bad cook. It was tasteless, overly oily (Yes, stir fry should be oily) and not really very enjoyable. Not seasoned, just slimy and bland.\n\nService was okay. No real complaints there. \n\nCost wasn't bad, but the portion was tiny. And then, to top off my experience, there was a $10 credit card minimum. Of course I had the lunch special, which was $8 after tax. \n\nReally convenient when getting something to go. Fortunately I had cash, because most places here seem to be cash only these days.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Food  was great prices were even greater .  Myself and my dinner party really enjoyed the service .  I will definitely be back", "author": "Sasha R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "I really wanted to like this place because the decor was nice but the food was terrible and the service was the worst I've ever had. Came here with 2 others, ordered drinks, appetizers and entrees all at once. The first appetizer came after 10 minutes, then 2 drinks, then the last appetizer, then the last drink all spaced 2 - 3 minutes apart. We had to ask for water. Then one persons entree came and we had to wait almost 10 minutes for the other 2! It's like they've never been to a restaurant before and didn't know how to serve people.\n\nOne persons salad smelled like sewage but apparently tasted good, I wouldn't have even tried it because of the smell. My chicken was extremely slimy and insanely spicy and the last shrimp entree was meh. \n\nWould never come here again", "author": "Henry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "This is why 5 stars:\n1. Outrageously good pan fried spicy udon noodles that I am very addicted to.\n2. Spicy drunken noodles\n3. Best Tom Kha soup EVAR\n4. Pumpkin curry \n5. Drink specials! All the time.\n\nAlso a pretty good lunch special,  though slooowww at lunchtime.\n\nI live too far to order out so I've only ever eaten in/picked up, and people who work here are especially nice. It's only ok ambience wise, and runs cold in the winter, but the food is worth it.", "author": "Jill P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "we are the teachers in the near by school. Ordered 3 dishes from the lunch special menu totaled  $24. The bill was for $48 because they did not put it in as lunch specials.  When I called the place she said that never told her it was from lunch specials. She refused to adjust the price and said to sent the food back. She offered to make another order, but our lunch was over by then. When I asked what is she going to do with the food, she said she is going to eat it for lunch!!!! Our school have been ordering\n from this place for years. I think we deserved a better treatment than that. Never again will we order from them.", "author": "Anya G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-26", "description": "Good was pretty good. I got the drunken noodles with pork and it was spicy and flavorful. Wait staff was super slow. Took about 15 minutes to get water, and eventually about 20 minutes to get the check. We had to go up to the front and the check still wasn't separated like it should've been. Cashiers should be a bit more fluent in English. Probably won't return.", "author": "Darden T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "My wife and I decided to celebrate our 10 year Valentine's Day anniversary at Ghang. We were so happy with our choice! We ordered the crispy calamari, herb mussels, green papaya salad, shrimp pad see u, steamed red snapper, taro sticky rice with ice cream, and fried ice cream with raspberry sauce. Outside of wanting big pieces of taro for my dessert, we could not find anything negative to say about the restaurant. All the food was great! I personally loved the shrimp pad see u and always order that dish to compare it against other Thai restaurants, including the ones I tried when visiting Bangkok and Phuket. Ghang more than held its own with the best of them. The steamed red snapper was fantastic as well. We prefer steam fish because we think it really brings out the natural sweetness of the fish, especially when it's super fresh. The seafood appetizers were all very fresh and tasty as well. My wife loved their cocktails and menu selection. She basically wanted to try everything! All the staff at the restaurant were very friendly and always smiling. This definitely made us feel more comfortable, especially during dessert time. Co-owners, Patrick and Bryan, make a great team when it came to designing the restaurant's relaxing ambiance and fabulous menu. They are very easy to talk to and so accessible. We can't wait to unwind and mellow out their again!", "author": "Allen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "Just like most people, I ended up here because the wait at Joya was ridiculous. Actually, there was no host/hostess to be found so we left. \nI read the reviews on yelp saying the food here was comparable to Joya so I took a chance. Sorry to say, this place is a bootleg Joya. The sign in the front said they were having $5 drink specials (no mention of a time frame) but once we got inside \u0026 asked we were told that was over. The food is NOT comparable. The service is terrible. We had to flag someone down for our drinks and practically had to throw up flares to get our check. \nNext time, ill wait for Joya.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-26", "description": "Came here w/ a group of friends and was a bit nervous b/c all the restaurants around it were full and they weren't, may have been the \"GRADE PENDING\" sign posted...\n\nAnywho, we went in ..orders were taken and arrived quickly. This place is pretty much average when it comes to Thai food.  So there was nothing special about it.\n\nI believed we really just enjoyed the fact that we could be a little bit louder b/c we were the only people in there. \n\nIt was average so i mostly won't go back!!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-13", "description": "Very quick service. The Thai dumplings were great. Entree was also great, but wish there was a little more meat and eggplant in it. Also, the menu said it came with jasmine rice, but I received plain rice. Then again, it was only $8 for the lunch special. Would go back again for a quick, cheap, enjoyable meal after work", "author": "Isabelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "The food was good, went there for lunch. The wait wasn't long like most yelper posted. They took our order right away. Would go back", "author": "Daphnée H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Everything at this place is delicious. It is bursting with flavor \u0026 fresh ingredients. I especially love the Tom Kha soup with chicken, the Thai dumplings, the house soup \u0026 the Thai salad. The lunch special is also a very good deal. For about $8, you get an entree, an appetizer \u0026 soup or salad. \n\nI usually order delivery, but eating in is a great experience as well. Either way, service is prompt \u0026 the waitress at the restaurant was attentive \u0026 kind.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Joya was packed like always so my friend and I walked to ghang kitchen. The very first time we went perhaps it was the chef. The food was bland. Last week! The food was so delicious. I ordered the Thai fried rice and my friend ordered Pad See Ew. Both dishes were flavorful and seasoned to perfection. The customer service was great even for a big crowd. Keep this chef and you will always have customers running back for more. I will definitely be returning.  Joya is completely overrated, try Ghang Kitchen.", "author": "Nina V."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}