{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "Not sure that the husband really enjoyed his sweet and sour chicken (guess--not particularly, since there's actually some left). But my pumpkin curry was pretty good, and we both enjoyed the mango salad. \n\nI like that they serve food with a bit of real spice. Some thai places throw in so much coconut milk that the flavor is totally lost.  The ratio seems pretty good here, and I enjoyed the flavor of the squash with the other veggies \u0026 protein. \n\nTook a bit long to arrive, but if it's the only Thai option available on seamless on a rainy Sunday night, go for it!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "I love this place! Have only had delivery but they are timely and the food is delicious. I never had a bad meal here. The veggie dumplings are amazing, curry and soups! A must have.", "author": "Jasyn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "My favorite apps are the vegetable dumplings and the fresh summer rolls! The service is great and not too crowded.", "author": "Jae. D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "I've dinned here multiple time and the first time was the best. It a great weekday lunch spot. Its usually empty when I go. I cant speak for weekends I've heard they get crowded. Lately the rice grain taste under cook but the meat is cook well. Until I find another Thai spot this is where I will go.", "author": "Jazmine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "3.5 Stars...\n\nI'm not sure why ghang would do this but they just opened a second location one block from their other location. I thought they had just moved but both locations are listed on the business card. Not only did they open a second location one block from their first but they opened it next door to one of the best Thai places in the city (Joya), I guess they thought they could take the spill over crowd. \n\nghang is a cool spot, ultra modern and a well thought out interior with plenty of seating. The menu seems to have a bunch more options than Joya and they aren't nearly as crowded, they also take credit cards which Joya doesn't. The most important thing though is the food which was pretty good but I would say Joya is a bit better and costs about the same so I can't rate ghang the same. Also, even though they opened a week or so ago they still don't have it all together and have to write down your credit card information and most of the desserts on the menu aren't available.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "The fried rice is not sticky and full of flavor. If you get it spicy it has a little kick. The appetizer in lunch combo is just 1 piece which is kinda weird. Delivery is usually on time and they label the food which helps when a huge group orders.", "author": "Salim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "Decent food and very reasonable prices.\n\nYou can't go wrong with their many selections of curry, it can be extremely spicy, so if you can't handle it make sure you tell them you want it very very mild!\n\nThe last time I was here I had a lychee Mojito, I really liked it. Will come back again for sure", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Ghang Thai is my family's go to Thai spot. The food is always great and the staff pleasant. My favorite time to go is during lunch for the combos offered; my favorite being the salad with peanut sauce, thai dumplings and either drunken noodle or massaman. I'm getting hungry just thinking about it! You guys have a loyal customer here!", "author": "Nneka G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "Decent work neighborhood Thai food. I got the lunch special with the steamed vegetable dumplings, salad and Shrimp Kee Mao. The steamed vegetable dumplings were okay, a bit on the salty side. The little side salad with the peanutty dressing was my favorite part of the meal. The dressing was so flavorful and the veggies were quite fresh. The Shrimp Kee Mao was a good sized portion for takeout and was enough for two meals. It was a bit extra fishy though which was slightly offputting, but not the worst I have had. I am not sure if I would come back, but it was good to try once.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Food here is always delicious and the service is good. I always order the crispy red snapper and yellow curry shrimp.", "author": "Ms C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "No stars, if it was an option. What a disappointing experience. They were obviously understaffed tonight. I specifically asked for mild flavor for the noodles I ordered. I generally like spice but tonight I only wanted mild.\nAfter almost an hours wait for our meal my noodles were incredibly spicy. I was unable to eat them. I could see the excessive chili flakes. I am all for spice but why ask what level of spice and then serve me the exact opposite of what I requested?\nWorst part- when asked how the food was, after I had already put my fork down and declared it too spicy to eat, I told the waitress I was unable to eat it, too spicy. She said the wait for another dish would take a while. I told her I did not wish to wait any longer than I already had for the previous dish. She took my plate and immediately it was boxed and brought back to the table \"to-go\".\nYes, it was on the bill. No apologies, and no dinner for me tonight!\nNot good enough- too many choices in the neighborhood.", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Absolutely delicious food!  Came here for lunch.  They have lunch special until 4 pm.  Many choices.  Soup or salad, appetizer and entree only for $8.99.  Cannot beat the food and service you get for this price.  Highly recommend this place!", "author": "Shah V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Very good.  Not the best but very good.  The portions are large and if you come for their happy hour you can get a good deal on some of their staple dishes.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "The amount of stars speaks for itself. The ambiance, the wait service, down to the bathrooms...Ghang Thai has it going on! I love this spot and I will continue to go here.\nThe food is so delectable and finger licking good. The waiters always have smiles on their faces.\nThere is a beautiful waterfall at the entrance in which seemed to really entice me! lol\nI suggest that if you are ever in the neighborhood to stop by this place, it'll be worth it! \nJust by typing this review, I want to go back and sit at the bar. smh, any volunteers??", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Had the pumpkin curry here. it's nice they take cards compare to Joya next door. However, it's more expensive than Joya and the food is about the same. They give generous portion and It actually looks pretty nice inside w/ the modern decor and the staff was nice. \nwill prob.come back again if Joya is packed with long wait.", "author": "Ai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Best Thai food in Brooklyn.  I love this place. I don't live anywhere near this please 20-30min drive but it is so worth the time . Got introduced to this  place by a friend 3 year ago  and automatically fell  in love.  Really cool vibe in the day time and very intermediate at night .  I highly recommend the lychee martini............", "author": "Levar S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "Decent neighborhood Thai place, especially for delivery.\n\nHaven't had the problem of overly sweet dishes here, that you get at too many Thai places.", "author": "Devin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-07", "description": "I have NEVER had such a truly horrendous meal as i had here a few nights ago. The wait at Joya was too long so we walked down and found this place, i assumed it would be a good choice because the decor was nice.... boy was i wrong. \n\nWe sat down as a group and for half an hour they never even acknowledged us or asked if we needed anything to drink... there was nobody even IN the restaurant when we got there. We waited and waited and asked if they could take our order and they blatantly ignored us and brushed us off. are you kidding me?? We wanted to order our appetizers first, but he wouldnt take our orders until ALL of us knew what appetizer, meal, drinks we wanted. WHY did it even matter if it took HOURS for them to serve us... \n\nSo we placed our orders and ordered a bottle of champagne..... half an hour later i ask if it was coming.. 10 minutes later they told me they don't have champagne. it wouldve been nice if they could have told me that 40 minutes ago? So we order 2 bottles of wine and of course that doesn't come out till 15 minutes later.. with 4 glasses.. even though we had 8 people. \n\n4 of us ordered the same pad see u noodles but with different meat. these noodles take 5 minutes to make, max. As a group of 8 people, we got our noodles in 10 minute intervals. the first girl got her plate... 10 minutes later the second plate comes out. It took practically an hour for all of our plates to come out. and then they FORGOT about my plate ( even though it was the same exact meal as the 3 other people ) are you retarded?? \n\nWhat got me really pissed was that it seemed like they had something against my group of friends, even though we are honestly all polite and weren't super loud. They seemed to not want to acknowledge us at all. When we finally finished with everything, I could barely ask for the check because they seemed to want to avoid eye contact with us. When i did finally get to ask for it, it took 15 minutes to come out and of course, they charged us for extra plates that we weren't served. So we sent the check back and it took forever to get it back so we can pay. \n\nOverall, my best advice to you is to AVOID this restaurant and go to Joya. I shouldve just waited the 45 minutes it took to get a table there. I wasted hours at this shiteous restaurant.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Ghang Thai catered an event for my student organization recently. They were amazing to work with and the prices were extremely fair. Best of all, everyone loved the food. Thank you!", "author": "Katherine Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "looking back at old reviews, this is for the wrong restaurant! I meant this review for nahm thai in park slope! no idea how it got posted here!", "author": "John P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Ghang Thai Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmK1MoICFfkxAG-4_ecKbw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751369"}