{"aggregateRating": {"reviewCount": 10, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "4 and a half stars for the delicious great quality food every time I visit! I love the not-your-everyday dishes that they offer such as the Stuffed Pepper, the Eggplant Lasagna, and the Lemon Garlic Chicken! Everything is great, but the Rotisserie Chicken is FIVE STARS! Literally some of the best anywhere. Prices are very fair for such great food and big portions. Space is tiny, only fits about 3-5 people and the wait can get long but it's worth it!!\n\nOnly reason they don't get 5 stars is because the rice and beans are just really subpar. But to be fair, I'm Puerto Rican and we're pretty much rice and beans masters; like what Tacos are to Mexicans....Overall this place is a gem and judging by the line that usually forms out the door, all of the locals know about it! Try going before 12pm and after 2pm.", "author": "Tiffany I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "When I say Caesar's never fails! You can always count on this spot for a quick lunchtime salad at a reasonable cost. You may have to wait a bit but it's well worth it.", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-28", "description": "This once oh so desirable establishment has been taken over by another staff except for one person that was there prior. Unfortunately the change in management has resulted in me no longer patronizing them. The foods for the most part the same but the portions are way smaller. \n\nI used to frequent this place for breakfast and lunch, after the change I went by for breakfast, the normal multi grain bread has changed to a cheaper brand that doesn't taste as good, though the new owner tried to convince me that it was the same one. I know it's not because the prior owner, Cesar used to order a loaf for me every week since it wasn't a brand that you couldn't buy anywhere. The eggs were bleh...  \n\nTried the classic half a chicken salad that I used to order and once again, though it tasted the same, the portion was considerably smaller for the same price. \n\nAll in all, as Brooklyn is growing, so are the food options....I've found another spot for my eats.", "author": "CHEVON M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Chill deli. \n\nLooks unassuming from the outside but definitely a gem. I am the type of person who never gives a deli the credit that it deserves but this one has to be praised. I usually stop by before work for a bacon, egg and cheese. It's fast and really cheap. \n\nThey have diet raspberry snapple, but no sugar free red bull - well, you can't have it all. The apples on the counter always look happy, and so does the lady at the register. I don't leave my office to get lunch, but this place really makes me think about it because their rotisserie chicken smells so heavenly when I come by in the morning.", "author": "Carina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Good rice and beans here.  The special half chicken with rice and beans and salad is a very good deal for $7.50. Very filling lunch that could probably feed two. Would get food from here again.  Place is tiny and fills up very fast though.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "I love this place, it's really the only good \"fast food\"in the area. I get breakfast and lunch from there at least 3x a week. The rotisserie chicken is delicious and they have an excellent lunch special. Love it", "author": "Mellisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Quick \u0026 tasty.. Lunch hours line is out the door only because the place is so confined.", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Great little hole in the wall. I always come early before 11:30 or late once that long line has shortened. Rotisserie chicken is always on point and I'm always on the lookout for stuffed peppers or chicken stew. For $6-$8 you get a lot of food but tell them to take easy on the rice and beans. Too much of a good thing.", "author": "Gregory T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "i love cesars gourmet in Brooklyn. The salads are excellent, the rotisserie chicken delicious and the staff is very nice.  Sometimes a long wait but for good food i will wait!!!", "author": "Faye P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Excellent little place as far as the food in the neighborhood and the prices are reasonable. Very healthy grilled chicken and salad along with fried fish or broiled fish with a lovely salad all for $7.00.\nthe only Negative is the LONG LONG line you have to wait on after 12:00pm. The place is really small but I'm sure they lose a lot of business because no one wants to spend half of their hour lunch break waiting on that line and there's only two cooks preparing the food so...it's a tough choice. Other than that...it's the only good thing going for neighborhood food.", "author": "Shaynee D."}], "servesCuisine": "Diners", "priceRange": "Under $10", "name": "Cesar’s Gourmet Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "9 Hanover Pl", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gOeu5-C1qr-0mKACGvGI5Q/ls.jpg", "@type": "Restaurant", "telephone": ""}