{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "So I came to this restaurant with a group of 8 and we all enjoyed our time at this spot!\n\nFirst off the restaurant itself is located on the corner so you get an almost 360 view of your surroundings as it's like a half circle at the corner and squared off. Also there are lovely wide glass windows for you to look out from which came in handy as that day was raining. \n\nSo our group made reservations for 6pm on a Sunday evening. Our waitress was friendly and handled our table well and didn't miss a beat. The drinks were on point as well! I tried the Peruvian kiss with its purple color was exactly what I needed. We all ordered various appetizers and main meals. I had the chicken tamales with onion and olives and tasted good! For my main course I had the Tallarines Saltado with shrimp! The shrimp tasted good but I just found the lo mein was a little dry., needed some more sauce with lo main pasta.\n\nAll in all I'm glad I tried this Peruvian restaurant!", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "We order from here at least 3-4 times a month and it's consistently good. For two people, the half chicken (which comes with two sides) is the perfect amount of food. We always get the rice and beans and the fried yucca - although, I have had to start ordering an extra side of fried yucca because we always end up fighting over the last pieces! \n\nThe chicken is so flavorful and always moist/juicy. It does take a bit of time to prepare so be ready to wait around 15-20 minutes. The empanadas here are also great - we order them when we're in a rush and just need a \"grab and go\" snack.\n\nThere's sometimes live music which makes for a lively atmosphere. Hoping to try some other items on the menu but we just can't stop ordering the chicken!", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-05", "description": "If you're going to order dinner for a crowd and pizza isn't on the menu for whatever reason, you should give Pollo D'Oro a shot. \n\nThey call it Pollo a la Brasa. I don't know why they don't call it Pollo D'Oro, since it's definitely the specialty of the house, but all you need to know is that it's Peruvian rotisserie chicken, perfectly seasoned and available by the quarter, half, or whole. It's a great value. \n\nGet more than you think you need, and make sure you tack on maduros and green sauce. Sure, rice and beans, tostones, and salchipapas are fine accompaniments (the salad is brought down by pale and weak tomatoes out of season), but it's all about that roast chicken. And the maduros. And the green sauce. \n\nAfter our last order, against all odds I actually have some green sauce left over (I ordered extra). Although its deliciousness demands that I pour it all over whatever it is I eat next and/or rub it into my face in a sensual manner, I plan to put it in my fridge until it goes bad or I forget what it is, whichever happens first. \n\nThis is is a completely disrespectful thing to do with such an incredible sauce, but I'm just being honest here. \n\nBecause honesty is the best policy.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Great service, and delicious food. The staff was very welcoming and delightful. The menu has many options to choose from. We went with the chicken empanadas as an appetizer, and the shrimp ceviche and Oro combo that came with many sides. They also made the birthday girl feel very special. Overall great dinner. Will be coming back!", "author": "Crystal V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-24", "description": "I've been here about 3 or 4 times. I love the food. I went again yesterday and it was empty.. there was literally 1 other person leaving when we got in. I thought they would have been a little more attentive with a group of 3. But okay.\n\nI asked for tea, she brought be tea bags and then like 10 minutes later I had to ask for water and sugar. My boyfriend found a piece of plastic in his food. But I dont know how you're not that careful.. there wasn't any other orders.\n\nI will be back but I expect more from this place.", "author": "Doris M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-08", "description": "I was here for a friend's birthday party. We were quite a big group but the staff seemed overwhelmed as certain orders were forgotten or served very late into the service. I ordered the Jalea (fried fish, calamari, shrimp and mussels on top of some yuca fries). It came with salsa on top. The food needed the salsa to provide the contrast in taste and texture. Otherwise, the food became mundane as it is same fried seasoning for all the food. I think the dish needs a sauce or salsa to bring that flavor complexity.", "author": "Huan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "Great service and good location but extremely overpriced for a very basic Peruvian restaurant. The drinks were great, food was good but not great. Unfortunately, I would not come back and wouldn't really recommend. If you are looking for something around that area, choose somewhere else to get the full experience.\n\nPrice- 1 out of 5\nFood- 3 out of 5\nService- 5 out of 5\nDrinks- 4 out of 5\nIG worthy- 2 out of 5", "author": "Carolina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "This place exceeded my expectations. We came after church on Sunday and were able to walk right in and grab a table. They were serving a brunch menu and both my fiancé' and I enjoyed our dish. The sweet potatoes were particularly good. I would definitely come back again.", "author": "Jonathan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Don't come here u less you have ample time to spend waiting for your food. Came here for lunch and it took us a very long time to order and get our food. That is on down side of this place. On the up side the food is delicious and the portions are generous. The food is fresh and flavorful. Had the ceviche and fried seafood platter and it was absolutely delicious.", "author": "Inna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-12", "description": "I'm struggling to report anything positive about this place, though I suppose it is laudable they've managed to bring up their dismal health score in the past. Lamentably, that score is now back at a B, which the restaurant confirmed with some scrumptious hair in my food. While I'm not a connoisseur of Peruvian food, I'm going to go out on a limb and guess that human hair is not traditional Peruvian cuisine. \n\nWe made a reservation on a Wednesday for the following Sunday. In a half empty restaurant, we waited about 20 minutes for them to clear a table for us because the reservation \"came in late.\"\n\nEvidently, not only did their reservations come in via carrier pigeon service, the restaurant reiterated their strong commitment to tardiness by taking a very long time to give us menus or fill our water glasses. This occurred at a time when the restaurant was clearing out, and there were maybe 3-4 tables needing active service. It was also cute that they even invite you to participate in their tediousness by giving you three separate menus to order from.\n\nAs for the food, the ceviche was good enough, but everything else ordered in our party of 5 ranged from low mediocre to terrible. As noted, I received the added bonus of having hair in my food, in addition to arriving cold. \n\nI'm not sure why this (literally) roach motel (see the health scores!) has 4 stars on Yelp. The food wasn't good and the service was slow and seemingly apathetic. The ambiance is poor, with the TVs showing soccer not working and other patrons talking so loud that you can't hear your own party. \n\nThe real kicker and impetus for this review was that the check arrived with an automatic 20% gratuity added. I've never seen an automatic gratuity for a party of 5. In a half-empty restaurant. Moreover, although I'm generally all for people determining their own self-worth, I'm not a fan of it in the restaurant context. I'm especially not a fan of this practice when it was not disclosed anywhere in the restaurant or on any of the 3 menus we were given to order from. It's a particularly smarmy thing to do when the restaurant had the audacity to give such slow and at times non-existent service. Needless to say, we wouldn't have left a 20% tip and didn't appreciate it being forced upon us.\n\nSteer clear.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "Ceviche wasn't fishy at all well marinated and very fresh! Jalea... The fish used to fry was sooo good you can taste thats it's fresh fish and not frozen! Excellent customer service! Only complain was no AC and drinks were a bit weak!", "author": "Nooo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Best Peruvian food I've ever had. I'd travel from Los Angeles back to Brooklyn just to eat there again. Thank you for the wonderful service and making our last day in the city memorable.", "author": "Esther H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Great food and great service! Reasonable prices for amazing Peruvian food and the service makes it even better! I got the Jalea, my cousin got the steak meal and we split the steak empanadas. I was sick so I couldn't have any alcohol! The prices here are good, the portions are great and the presentation better. If I wasn't so full I would've gotten dessert! Will have to come back for that! I will definitely come back and bring my boyfriend with me!", "author": "Atarah J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-27", "description": "The below reviewers must have been paid for their positive feedback. Do not attempt this place unless you have many hours on hand and enjoy average food paired with bad service. \n\nThe appetizers came before the drinks, 20 minutes after we had ordered. These women are sleeping at the wheel, watching them move around the restaurant is a slow motion picture.\n\nI'll summarize. They got our drink order wrong. We had to steal utensils from other tables. They got our appetizer order wrong. My entree came out 15 minutes after everyone else's, no apologies, no update on if or when my food was coming. I paid $30 for five pieces of shrimp, white rice, on a questionable orange sauce. \n\nJust don't.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I heard about Peru Restaurant week which was taken place in mid Oct, Pollo D' Oro was one of the few restaurants participating so I started yelping and looking at the menu and of course it caught my interest, mind you Im from Queens and there are a bunch of Peruvian food available to me but there was something special about this restaurant so I gather the fams and headed to downtown BK. Now parking in street could be tough, but to my luck there was a parking garage just around the corner and price was more than fair, booked it ahead of time and it was no biggie. Back to what matters the most. Staff super friendly, place has large windows so plenty of sun light available. For starters we had Jalea, Leche de Tigre and Causa Acevichada, LAWD!!! I saw this review stating it feels as if you were in Peru and there were no lies, the seafood was super fresh, seasoned to the T.\n\nWe also ordered chicken with salchipapas for the kids, tallarines verdes, lomo saltado and pan con chicharron, even though it was pass 5:00pm they were still offering brunch dishes. They also had special dishes for the Peru Restaurant week which had ended and they mentioned the menu was still available which was a plus for me. Pollo was super juicy and tender, lomo was just pure perfection, right amount of everythibg, tallarines verdes and pan con chicharron were delicious. \n\nDo yourself a solid, uve been working hard lately, treat urself to the best cuisine in the world, Pollo D Oro reppin us right.  \n\nAlmost forgot, we had picarones too, just as good as everything else.", "author": "Luis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I went to Pollo D'oro for Valentine's Day last night, and am happy to say that the food was impeccable! They had a $65 Valentine's Day Pre Fix but we decided to just go with the regular menu and order a few things. \n\nFor our appetizer we ordered cheese empanadas and papa a la huancaina, which was divine. The pr sensation was beautiful with the pink flowers  and all the vibrant colors . I also ordered a sangria which was $7 on their happy hour and was pretty good. \n\nFor our entrees I ordered the Camarones ( shrimp) al Cuzco ($28) and the Pescado a lo Macho ($30). The Camarones al Cuzco was this delicious shrimp dish in their famous yellow Aji Amarillo sauce on a bed of rice. It was just perfection for me. The pescado a lo macho  was a fried fish filled on a bed of mussels calamari and that scrumptious yellow aji amarillo sauce. It also came with white rice and was delicious. I had ordered this dish the last time I visited Pollo D'oro so I told my bf to try it and he was very happy with it. \n\nOverall, we had a great Valentine's Day dinner. The ambience and the servers were nice. It was also not too loud, and we were actually able to talk and hear one another.  \n\nOne thing I would say that they are a bit pricey, but the food is definitely very filling, and a good portion sizes, so we were too full to order dessert. I did however get to try their 4 layer chocolate mousse the last time, and I highly recommend trying it!", "author": "Tahini R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "One of the few restaurants in Downtown Brooklyn that I've been to many times. The atmosphere is great, especially after the sun sets. I've never had an issue with their food. Sometimes for a quick dinner, I would get a half chicken with rice and beans and call it a day. It's enough to fill me up and leave me satisfied. The chicken is nicely seasoned and cooked. Not too bland and not too dry either. The rice and beans are a side dish. It comes with this green sauce that I'm not too familiar with but it goes well with the chicken. \n\nI've had the Lomo Saltado here a couple of times. My second favorite dish here. If you don't know what you want, I recommend this. It consists of beef, tomato, and onion cooked in a unique type of sauce that adds a nice savory flavor. It also comes with french fries and rice. The beef doesn't go dry as there's a small pool of sauce underneath it.\n\nArroz Con Mariscos is my favorite dish here. If you love seafood, you'll love this. It's a flavorful rice cooked with clam, scallops, shrimp, and calamari. You're given onions, corn, cilantro, and lime juice on top to add another type of flavor to it. If you're a fan of savory food with a kick of fresh lime, I'd recommend this. \n\nI'd definitely recommend this to anyone looking for authentic Spanish food (specifically Peruvian). I wish I could try everything on the menu and give a detailed review. I haven't been disappointed yet.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "This restaurant has officially been added in my top 3 favorite restaurants that serve Peruvian food. You see...I'm Peruvian and I am so tired of other people cooking our food and calling it Peruvian food yet it taste nothing like it! This restaurant serves authentic Peruvian food!! It taste DELICIOUS! We had ceviche, seco de Cordero, chicha pisco sour.  The food was so good!!!!!! I truly felt as if I was in Peru eating it. Large portions and the service was great! Our waitress was very attentive of us. I loved the decor because It has a big Peruvian flag hung up. It also has other Peruvian decor around. We took a taxi there because my husband has found parking to be hard to find in the past. We went on a Wednesday night and it had a good amount of people there.\n\nMy only suggestion for the restaurant: work on the pisco sour. It needs to taste more like pisco sour. It tasted a bit too watery yesterday\n\nAlso, it would have been nice to hear some Peruvian music mixed in. The food was so good that hearing Peruvian music would have really taken me back to my country! \n\nOverall, I give this place 5 stars!! Food is DELICIOUS AND SERVICE WAS GREAT!!!", "author": "Jessica O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-27", "description": "This post is mainly just a heads up to anyone with severe food allergies that the kitchen can be a little sloppy. If you have an allergy, make sure you fend for yourself. The food tastes great, and I had a 5 star visit the first time I was there (dinner). This last time though (lunch), I had to ask multiple times about the safety of my food after originally mentioning an egg allergy. Had the kitchen been functioning properly, the server wouldn't have been surprised when I showed her the sauce hidden in my food (looked like it fell from a ladle). It wasn't supposed to be on the entree I ordered at all even with no modifications. Additional confirmation of the kitchen's sloppiness came in the form of a long black hair in my yuca. My lunch had already been comped, so I didn't bother to mention the hair to the server. I really just wanted to stop having to hail my server and leave.", "author": "Colton N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "My wife and I whenever we visit a different city we always visit the Peruvian restaurant. This place was amazing! You may walk in and feel underwhelmed but be patient. The staff was very friendly and service was great. The pollo a la brasa was amazing!! We got to Lima every two years and the food was like I was eating in a restaurant in Mira Flores. The passion fruit was delightful as well. I was not sure what to expect from the cerviche but it was great too. I know manhattan has good food but you have to try this place. Use the Jay st Metro Tech stop.", "author": "Andre H."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}