{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "Came here for \"brunch\" on a Sunday. They don't offer any brunch items but do serve lunch. It was pretty empty but it could be because I arrived at 1:30 and they just opened at 1pm. \nWe ordered empanadas and 2 come in one order. So I chose one beef (which is steak) and one chicken. Even though they're fried they are not greasy. They stuffed the empanada with just the right amount of beef and chicken. Sorry as you could see I was hungry, I ate the steak empanada before I could take a picture. \nFor my entree I ordered tallarin con bistec (pesto spaghetti with steak). Served with a skirt steak and two small potatoes. The pesto sauce had such a great balance of flavors. You should definitely try it. \nFor dessert ...yes...I eat a lot...I ordered picarones. Now being that I'm peruvian I know what picarones taste like and this wasn't the best I've had.  The chancaca sauce was delicious but the actually picarone was not made with the typical dough of a picarone. I would pass on this dessert. \nOverall it was a well worth the visit. Can't wait to come back and taste other items on their menu.", "author": "Sophy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "On business travel and this place by far is the best food I had during my stay in Brooklyn. The waitresses are very nice and they take good care of you. Came back after two years and the food and staff still the best around, brought the wife with me and she LOVED it as well. Pollo D' Oro never disappoints.", "author": "Jam J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Until eating here, I always regarded Pio Pio on the Upper West Side as my choice pIace for Peruvian food in New York City. Pollo D'Oro is leaps and bounds ahead of the game. Their green sauce is superb and they're pretty cool about giving extra should you find yourself wanting more. The ambience is very chill. Both the service and food were excellent. \n\nThe staff was very friendly and willing to make suggestions as I pored over the menu. The tacu tacu steak dish epitomizes comfort food. It was delicious and the portions were generous. \n\nThe rib eye, cooked medium as requested, had nice flavor and was tender. The rice and beans risotto topped with fried egg along with the sweet plantains served as a nice compliment to the steak. The house sangria was tasty and packed a nice punch. This is definitely one of the best dining experiences I've had in the area. I'm looking forward to my next visit.", "author": "Roberto L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "First time. Group of four and we ate family style: cerviche mixto, mussels, quinoa salad, yuca fries, Maduros , hanger steak. Nice cocktails and I had the darker of the two Peruvian beers. Each of the dishes were fresh, delicious and very well balanced and well presented and the portions seemed just right. The salad was enough for the whole table. I loved the Peruvian beer and I ended with a blended Pisco on the rocks (think grappa). The pisco was smooth and so good. \n\nVery well designed interior and as it got darker outside the ambiance only got better. Very good choice of lighting to set the mood. We had Alejandra as our Waittress, friendly, knowledgeable and very helpful. Great service.\n\nDefinitely go back.", "author": "Jack Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-03", "description": "I'm peruvian so I have very high standards for Peruvian food. My first experience with Pollo D Oro was a few months ago.  I had a really bad hangover and I was in need of Ceviche (the Peruvian cure for any hangover).  The fish Ceviche was freshly made, the plate itself was huge, but the portion was very little.  I left hungry and it was also overpriced to be honest. \n\nMy second experience with Pollo D Oro was today.  I ordered by phone took about 20 mins for their quarter chicken with golden tostones. The rotisserie chicken was horrible.  This chicken had no taste, no seasoning, no delicious smell, it was dry, and taste was not pleasing. It was one of the worst \"pollo a la brasa\" I have ever had and I have tried numerous restaurants.  Their green sauce was not that great.  Save your time and $$$$, please try Peruvian rotisserie chicken somewhere else.\n\nTheir empanadas don't have much flavor.  Only have chunks of meet stuffed in them. \n\n*Update - \nAnd to make things worse, I got sick from eating the chicken and the empanadas.", "author": "Arelis T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "I work nearby and have taken food out several times.  The food is tasty, the chicken is always well seasoned and I enjoy their empenadas.  Two issues I have are, the food is expensive for small portions and the service is inconsistent.  Several times the orders have taken unreasonably long and some of the counter staff are rude.", "author": "Tim F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Most amazing steaks! The house salad is incredible and yucca and potatoes fries very tasty.", "author": "Nghi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Excellent food and service - never had Peruvian food before bit i was blown away. You can tell that the owners take pride in their dishes, it was fantastic. I can't believe I forgot desert - but I was too full. We will come back again tomorrow :)", "author": "Suzana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Tucked in off of Flatbush Avenue, this little place deserves some attention.  The 1/4 chicken lunch special includes rice \u0026 beans and a drink for $8.50 and is filling by itself.\n\nBeing my first time, I had to try the chicken empanadas as well - nice presentation and sauces.  The green side sauce is tasty and adds a hint of spice.  Yummy.\n\nThe chicken was extremely moist and tasty and the skin was perfectly seasoned.  Delicious \u0026 satisfying.\n\nMy only worry is this place seemed empty for lunch hour, so hoping they make it.  A really nice lunch spot, especially convenient for anyone working in the MetroTech center.  \nMy server was Alejandra; she was pleasant and attentive.  She also made me smile ;)\n\nOWNER: You should promote yourself at MetoTech, LOTS of hungry lunch goers right across Flatbush Avenue.  Business lunch crowd would be huge for you... If I hadn't looked on Yelp, I would have never found your establishment.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Awesome place the bar maid was very informative the food was delicious we loved the location and menu choices we would definitely.", "author": "Mario A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "I ate here twice in one week - it was that good.  The location is in the rapidly developing neighborhood of Downtown Brooklyn, at the foot of the Manhattan Bridge.  This is a classy mix of Peruvian Food.  I have eaten in many a Peruvian home, and this food was nostalgic.  My 4 and 7 year old devoured the grilled octopus and shrimp dishes.  I tried the seafood combo and their steak and the never old or boring Lomo Saltado.  The wait staff was friendly and accommodating to kids.  The drinks were delicious (House Sangria and a Passion Pisco). \nCan't wait to return to Brooklyn and eat here again!!!", "author": "Laura O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Unbelievable food and very friendly service. This place is authentic. They source many of their ingredients i.e. Peruvian corn and beans from Peru. The flavors are out of this world. Great neighborhood place with delicious food. Get the ceviche mixto to share for sure. And of course a pisco drink!", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "Peruvian Chicken and green sauce rating (only): 4.5 stars\n\nI ordered the ceviche to start and it was so sour, I had to drown it in pepper to make it somewhat edible. The sour taste also lingered. The french fries that my husband ordered were completely undercooked. The rice I liked, the beans that went with, not so much. \n\nThe service (despite being so new) was actually quite good and I don't mind BYOB. \n\nHonestly, my stomach was a disaster post-dinner. My husband was even sicker than I was (and it's rare that happens). I've seen loads of people eat there, and know many of my neighbors that love it, but after that first dinner, I find it hard to want to return.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Delicious food but a little on the expensive side for me. I have been to many Peruvian restaurants and this one has been the most expensive one. Staff was friendly. Lunch specials were really yummy but quite a little long wait for my food.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Here for drinks. Great bartender that is not only friendly but was making great drink suggestions. I wasn't disappointed with any of my drinks. They have a have a large selection of pisco (a grape based liquor). Here on a saturday, the bar is quiet enough to have a good conversation and the ambiance is casual and not too loud.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "I am Peruvian, and this place was truly amazing! The JALEA was delicious. I order duck with rice which was the special of the day and it was mind blowing ! I totally recommend this place. Very authentic.", "author": "Karem M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "This past Wednesday we went to Pollo D'Oro not knowing what to expect and we got so much more than we had hoped for. \n\nOur waitress, whose name I unfortunately can't remember,  was AMAZING! She explained everything,  had great recommendations and made us feel very welcome on top of getting our order to us quickly. \n\nShe brought us a little bowl of Peruvian popcorn with plantain chips and a fabulous green sauce that she said we would become addicted to and we did. \n\nThe drinks were delicious (Peruvian Kiss \u0026 a Pisco Punch) , the appetizers (Chicken Tamale \u0026 Beef Empanada) tasty, the main course (Roasted chicken with beans and rice,  fried yuca and fried sweet plantain) down right finger licking good and the desert (flan and Picarones)  just right. \n\nIt's was an excellent evening without doubt and we will be back again soon.", "author": "Amelia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "This is the best Peruvian restaurant I've been to and I've been in Peru for a month!!!! Outstanding service the chicken is moist and the fried plantains are to die for. Reasonably priced and good ambience. I always come back here .....", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "A nice restaurant.   I went for take out.  Next time I dine in.  Really delicious 1/4 chicken with one side. I chose French fries.   Yum! And the mousse dessert is excellent! Everyone super friendly.   Will be back.", "author": "Ana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "The food was good, the service was awesome! The empanadas are good as well as the rice and beans. Gorgeta is great! Cons they only sell a coscu drink. No beers, no cocktails :( sorry gotta take a start off. I had the beef and chicken empanadas, rice and beans, and something from the appetizer section that has chicken and avocado; is a cold dish and has a purple sauce that have a distinct flavor, so if you are not down to new flavor requested without it! I had a good time before my class at this place.", "author": "Jose J."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}