{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "For some reason this place has been around for 4 yrs and we had no idea! My husband is Peruvian and extremely picky about Peruvian cuisine. We were going to the Alamo movie theater and wanted to go to dinner near by. This place came up on my yelp search. It's not a huge place but nicely decorated. We went around 545pm and because it was early it was dead. They have happy hour until 7pm. On the drink happy hour menu was pisco sour, sangria and other mixed drinks ranging from 7-10 bucks. To start we had the empanadas they were very tasty and came with a delish green sauce. For dinner I went the safe route and got lomo saltado, my friends got the pollo saltado and my husband had the aji de gallina. The presentation and flavors were great. My husband was very happy with his dish. We had to go so I can't speak for dessert. What I will say is we will def go back to this place! It's way closer than trooping it to Queens or NJ for authentic Peruvian cuisine", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "My boyfriend and I were looking for somewhere special to eat for our anniversary. My family is mainly Peruvian and I'm no stranger to its native flavors. While venturing in downtown Brooklyn we saw it in the area and decided to give it a try. Upon entering, we were welcomed and seated. (Nice lighting, nazca lines art and Latin music played.) Our waitress Luciana, introduced herself and explained the pre-fixe menu in detail. Very nice lady and very attentive. We never had to call her over, she was thoughtful and one step ahead of us with extra napkins and utensils and our glasses never empty. I ordered off the pre-fixe menu (appetizer, entree and dessert) and an extra dish. We had cancha while we waited and I decided to try a new drink. I've had pisco sour before, but ordered the pisco punch to try. Bartender was on point. It was very good. The Causa Acevichada was nicely plated and very flavorful. I could taste the Peruvian olive in the sauce. Next we had the Seco D' Cordero and the Pollo Saltado. The edible flowers were beautiful. The onion on the my seco was a wee-bit overpowering and I didn't taste the signature seco flavor until later on. Both plates were good overall as well as the portions. For dessert there was no lucuma flan that I was looking forward to, but we had the trufle. I must say, one of the BEST green sauces I've tasted on American soil. Amazing. I had to take some to go. We were invited to and check their social media for special events and when they had live music. Sundays they have a prepared brunch menu that looks enticing to try. We will be visiting again very soon.\nSide note: bathroom was clean and smelled like pine cones. Just didn't like that the pedal on the waste basket didn't work and I had a hard time lifting the lid with my hand wrapped in a paper towel (kinda slippery). \nPara Luciana: Muy amable y bien atenta. Le agradecemos su atención y tiempo. Por su servicio es la quinta estrella. Dios la bendiga.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-15", "description": "This restaurant doesn't deserve a star or any at that. Everything is overpriced and the food is in very small portions. I'm peruvian so this is a disgrace to peruvian cuisine. Terrible experience I don't intend on coming back.", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Best Peruvian restaurant in downtown Brooklyn with great service and dishes. Their popular chicken is quite tender and tasty especially with the delicious green sauce that always comes with it. I can literally drink that sauce cause it goes well with everything. They've got some great seafood entrees as well and I would recommend the mixed seafood plate and salchipapas as a side which is basically French fries and fried hot dogs. Great combination.", "author": "David H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "Ceviche was so sour and salty, chicken was just okay. I ordered a double of whiskey and got a pour that was less than a single. Like other reviewers, extremely slow service even though we were like one of two groups. It's a shame because I live so close and I wanted to like it but I won't be going back.", "author": "Rebekah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Highly recommended\n\nThis is the perfect place to grab dinner in a nice part of Brooklyn that is not inundated with a lot of tourists. \n\nThe variety of different pisco sour cocktails were very delicious; my favorite was the Purivian Kiss. Although the drinks are made in a particular manner, out waitresses was very accommodating in modifying my drink requests (as I am not a huge fan of super sweet drinks). The drinks are $12+, but there is a happy hour special until 7PM. \n\n\nThe food was just ok. I had the salmon and shrimp special (I forget what it was called), which was suggested by the waitress because my other option was not available. The salmon was cooked nicely (although it was a bit under-seasoned) but the sauce had a weird texture and it already had that \"pudding skin\" before it was brought to the table. Although the salmon was a bit of a miss, the traditional ceviche made up for it\n\nThe picarones were excellent - probably some of the best that I have eaten in NYC. Unfortunately, the sponge cake was not up to par, because it did not have much of a taste and it was really dry. \n\nThe servers were very friendly and attentive, although we had to actively flag down a waitress a few times. I cut them some slack, because we visited during a busy Friday night. \n\nI definitely recommend this place is you are in the downtown Brooklyn area and have a craving for Peruvian, but I do not think the the food is that great to travel from multiple boroughs. That said, I could see myself coming back mostly for the bebidas and a quick ceviche.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I had the most perfect dining experience at this restaurant. They had super delicious food, great drinks, a wonderful presentation of the food, excellent service, decent sized space, and an amazing ambience for groups, date night, celebrations, etc. \n\nFrom the start, the corn on the table with the green sauce is soo good together. I don't know what's in that sauce, but I almost wanted to ask for the recipe. That sauce is too good. Anyways, we ordered the pisco sour and wild strawberry and were very happy with our drinks choice. Then, we ordered the chicken empanadas as our appetizer. The presentation was beautiful, especially with the purple and orange sauces. Omg, this sauce was also super delicious. We cleaned that plate up. \n\nI ordered the ceviche mixto and my boyfriend ordered the lomo saltado. The lomo saltado was very tasty and I enjoyed having a couple of bites of it, but let's talk about this ceviche. Hands down, the BEST ceviche I've ever had. I thought there was a perfect amount of lime juice and the texture of the fish, octopus, and shrimp were all on point, and very fresh! I enjoyed the addition of the dried corn because it provides a nice contrasting crunch to the smooth texture of the seafood. Also, I'm the type of person that likes to save the best bite for last, and I was actually sitting down struggling between choosing the fish or shrimp as my last bite. This almost never happens! In the end, I decided on the fish. \n\nSo happy that we had a wonderful evening here, I definitely recommend this place!", "author": "Gina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "I only had appetizers here but it's above the standard Peruvian joint. \n\nWe came after a festival and looked like we came from a festival and the staff was accommodating and warm. The food presentation is amazing (creative and colorful) and the good tastes great. Will come back if I'm in the area.", "author": "Rosa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "Take me back! My girlfriend and I came across Pollo D' Oro on our trip last year. The food and service was exceptional! We will definitely be coming back when we decide to venture back to New York.", "author": "Sergio H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "I had very high hopes for this place. Especially after all the trials it took to get to the restaurant. After we finally found parking we ended up having to walk quite a bit to get to the restaurant.\n\nWe started with drinks the pisca punch and the pisca beach? Both were good but not incredible. \n\nThe plantains  we had as appetizers were delicious.  And I was excited to see what the entrees would bring. They had just the right amount of crunch on the outside and softness on the inside. The plantains were heaven. \n\nWe had to ask for corn nuts with the green sauce. They were not provided for us until we asked. That green sauce is everything!  It was the best part of the meal.  It actually saved my rotisserie chicken which would have been pretty bland without it. I had the chicken with a green salad. Not worth 10 bucks. We also had the pesto pasta with chicken. Again nothing to write home about. Just ok.  \n\nWe asked for dessert menu but we were told the petition had closed. Oh well.  Probably for the best.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Took my family here for a Mother's Day lunch. I called the day before to make a reservation for 6 and the said that they didn't have any openings until 5pm...as a persistent person I am I decided to try online, I made the reservation and within minutes they replied back to me saying \"your reservation is confirmed for tomorrow, thanks!\"\n\nWe made it there on Mother's Day and for my surprise the place was empty only two tables were occupied...I wonder why the reservation was such a big deal... \n\nThey were serving complementary sangria for the mothers that day, I thought that was a great gesture.\n\nOur waiters were very nice, both girls very attentive and helpful when asking for ingredients and items from the menu.\n\nWe mostly have the signature chicken, salchipapas, lomo salteado, empanadas, and sides like yuca frita, etc... everything was very tasty and well seasoned, nothing less to expect since Peruvian food is one of the best cusines.\n\nFor dessert we had the special of the day the flan with chocolate cake combine. It was ok, not a big deal I wished the flan part was the biggest part and not the cake. It wasn't so flavorful. On a negative note, my mom said the cup where the coffee was served smelled dirty so she couldn't drink it. \n\nI'm giving them 4 stars because they can make it to 5 I think...keep going Pollo D' Oro!", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Another amazing restaurant in Brooklyn! Pollo D'oro is popular, tastefully decorated, has a prime location (glass-walled enclosure at a corner location), and offers authentic Peruvian cuisine. Great from start to finish. Great service too. We were lucky to arrive early (6 pm). The restaurant was completely full with people waiting at the door by 7 pm. \n\nTheir free appetizers are awesome: fried salty corn. The Peruvian cocktails are interesting and unique (fruity). Love the ceviche (sour and spicy sauce). The grilled octopus is a must try. We were stuffed just going through the appetizers. In the end we shared just one main dish which was the shrimps on a sizzling plate. Huge portion. Lots of potatoes (fries). \n\nWill come back!", "author": "Alice J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "I went with my parents, we waited like 20 minuets just to take our order ( it wasn't busy ) after taking our order we waited about 70 minuets just to get our food. However, 4 tables came after us and they had their food. \nIts turns that the were treating us different because my mom ware Hijab. \n\nIt's unacceptable to treat people different just because of the outfit. \n\nWe were excited to try Peruvian food but it was the worst experience ever, I felt bad and insulated because they were judging us and treated us different. \nI really hated this experience, also the manager (he has sleeve tattoo) was unprofessional and disrespectful to us. \n\nOnes again I HATED THIS RACIST restaurant.", "author": "Faisal M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "Well the individual tastes were good but the price for the amount is too high. The dishes were so much smaller than mist other Peruvian I ve gone to and the cocktails we strangely expensive like $15 per piece for pretty regular pisco. All and all nothing too memorable and way too spicy leche de tigre", "author": "Iryna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "Came here for lunch with a co worker today... 1st issue the AC isn't functioning so they have fans instead.. but not enough.. she ordered pasta with steak and I got a 1/4 white meat with salad.. 40 mins later her food comes out and I'm still waiting. I go and ask what's taking so long. I ordered the more simpler meal. Told them to just wrap it up. My lunch was over..Even that was taking long. I go to the register to pay at this point I can't wait any longer.. she tells me just take the food she wasn't going to charge me for the chicken and salad.. fine... get to the car and look.. I ordered 1/4 white meat.. not\nDark meat ! They really need to Train better in service.. food is great. Service sucks! So I didn't even eat the food I wasnt charged for because it wasn't what I ordered.", "author": "Kristina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I came here on a girlfriend date. It was hot out and there was no A.C , they had fans blowing. Other than that, quite a romantic spot. The civeche was delicious,  would definitely come back for it.", "author": "Liyi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "~ Meals for one ~\n\nMy quest to make the most of traveling to the culinary mecca of NYC continues, and I stopped by Pollo d'oro on a weeknight to quit my cycle of seamless-eaten-off-paper-plates-on-a-hotel-bed. \n\nThe place is pretty easy to find, and was a lot more casual than what I had initially imagined. The exterior is almost wholly glass, so you get a good view of the street if you get a window table. Low key AND with options for people watching make this place an A+ option for dining solo. \n\nThere's no host, and the counter at the entrance makes it look like you have to place your order there, which is a little confusing. I tried placing my order there at first, but I was seated really quickly at a window table. The menu can get overwhelming if you (like me) are a newbie to Peruvian food. The server offered really helpful suggestions with minimal input from me. I wasn't in the mood for alcohol, else I would've loved to try out one of the pisco cocktails. Instead, I ordered a house made passion fruit purple corn drink, and after some deliberation, I settled on the paella. \n\nWith ceviches priced around $15, and seafood entrees around $25, this place can easily cost you $30-$35 per person, more if you're getting drinks too. The entrees are sizeable, so this would be a great place to try out with friends who like to share food!\n\nThe paella took around 20 minutes to be prepared, and was very generously topped with shrimp, mussels, clams, scallops, and calamari. The rice was really flavorful too, albeit a little dry. The paella was topped with really well seasoned onions and corn. The drink was sweet and rather meh. I was a little disappointed by their very limited options of non alcoholic, non canned or bottled drinks. \n\nI saw a couple of servers, and while the place was starting to fill up, service got a little confusing. One server took my orders and got me food, and another stopped by to give the check, while the first one tended to tables all over the restaurant.\n\nOverall, this is a great place to get a solo dinner. I couldn't finish my food and had to bag a little under half of it. My next visit here will definitely include some pisco and ceviche.", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Yes, yes, yesssss. The food here is absolutely delicious. Came for a team lunch (reserved ahead of time and understood why immediately after arriving). Within 20 minutes arriving the place was packed. Now to the food, I had the quinoa bowl with chicken which literally would have licked the plate if it were polite to do so and this is why; quinoa was cooked to a crisp texture, all veggies were also crisp nothing soggy, the chicken was juicy and the egg chunks also fully cooked. My colleagues had a number of different plates ranging from salads to fried rice entrees and no one complained at all. All in all this is probably our go to spot now and not to mention the wait staff was nice and attentive.", "author": "Caroline G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "The food here is good, but not good enough that it's worth the hassle. Here's a few things:\nOverpriced - a bowl of quinoa and chicken will run you $24. \nSlow service - we ate here in person and it was slow as could be on a Friday night, it might explain why they weren't that busy. \nPayment - they only take cash, visa or American express and this isn't posted anywhere until you get the bill. I had to leave my husband, go home and come back bc neither of us had Amex or visa on us. \nDelivery - we attempted delivery at 7pm on a Wednesday night, it's been over an hour when the original estimated time was 30-40 mins. I've called multiple times and there is no answer. Finally my husband has now decided to walk over and see if they are even open. When he arrived they said they no longer do deliveries.", "author": "Ailyn M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "I'll be very generous and provide 2 stars, only because I wanted a specific dish in your menu. At 7:20 PM on a Tuesday the front door was locked. One table inside looked at me funny. I again tried the door and their attention drifted away from me. \n\nWho's closed on Tuesday??", "author": "Kraig K."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}