{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "I'm writing this review because the beef empanadas from this restaurant are top notch. I came here with friends who were looking to enjoy a sangria or two with their meal. We were warned on Yelp that liquor is not served here, but we were a little disappointed that it was not voiced at the restaurant when the sangrias were ordered. Other than that (since tons of people have already mentioned this) the service was great, the entrées were well portioned, and the empanadas left one hell of an impression. Be warned: Yucca will fill you up quickly. A plate of chicken and side of yucca may not seem like much initially, but it will leave you pretty satisfied.", "author": "Denzel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Absolutely delicious!  I had the 1/4 roasted chicken my first time and it was so good I came back the next day.  Then I had the Lomo saltado (a hanger steak dish), which came rice AND fries.  It was incredible!   I was visiting from Atlanta and highly recommend Pollo D'oro as a must in Brooklyn!", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Dream about this:\nThe Green Sauce. It's magical. Buy a $5 tub and use it on anything. Bring it to a dinner party and you're a star.\n\nImpress your grandma with this:\nThe Rotisserie Chicken. Seasoned perfectly and oh, so moist.\n\nSmile about this:\nThe service. Friendly and accommodating staff.\n\nGet addicted to this:\nSnackable corn. Corn nut meets popcorn. It's a free snack with your meal.", "author": "Rachelle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "The food here is amazing.  We only ordered three appetizers for two of us and it was a LOT of food!   The ceviche was fresh and quite delicious, especially with their \"hot\" sauce which was really just a spicey green sauce (it's amazing whether u like spicey or not).... The quinoa salad was also really good ... Overall enjoyed the space, nice service, great good!  Hope their business takes off\n\n\n\nFYI they are still working on their liquor license so no booze to order just yet, but they are BYOB and will provide bottle service if you bring your own wine.", "author": "nico B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Amazing food! Came here with 9 after my sisters graduation at Barclay's and wasn't sure what to expect. We were a diverse crowd so I was hoping this was not going to be miss. We had Latin, American and French folks so the place had to be good! Well first we walked in to the sushi place by accident but quickly figured that wasn't the Peruvian place. They are both next to each other and will try next! So we started with the ceviche mixto and yum yum! It was a huge portion and and the fish was soo fresh! For 9 people it really was a good amount and luckily my dad took care of most of it. I also ordered a couple empanadas which were also delicious. For the meals we got different dishes however we all were extremely pleased with all our selections! There was not one grain of rice or French fry in left in sigh after dinner. I was able to taste the Lomo Saltado and the meat was very juicy. The fries that cane on that dish were the best Fries I've tasted in a while and it also came with a rice. I ordered the saltado de langostino which was extremely flavorful and I ate ever bite. Someone had the duck over quinoa and they loved it. Dessert: I think we got a fried banana dish that was crack and my mom got flan! Loved it, hadn't really had much Peruvian hence happy I chose this place! Graduation was a success!", "author": "Diana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "3.5 stars might be right.  You have to knock Pollo Oro one star out of the gate for the total lack of ambiance.  And not just for there being no ambiance, but because they tried to create some sort of mood, and failed. It is like sitting in a terrarium.  Like being a newt, on a tiny, wobbly log in a terrarium sums up the experience. \n\nI went for the sweet spot, roasted chicken and beans and rice.  I was warned not to stray from the sweet spot, or I would suffer.  I obeyed. You should too!  It was okay.  Just okay.\n\nI know there are plenty of much better restaurants in NY.  And the prices are not reflective of the value received, but I give it 3 stars, not in comparison to restaurants in NYC (or Paris, or Tokyo for that matter), but relative to the population of restaurants I suffer patronizing across the USA.\n\nIn town from Peoria?  You'll love Pollo Oro!\n\nGot your knickers in a knot reading this and ready to call me a NY restaurant snob?  Eat at Pollo Oro and compare it to the average restaurant in your town ... see what I mean?\n\nGood luck!", "author": "PJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "The ambiance is great and food is great. I've been there about three times and never fails to delight. I will say the first two times I went the service was sllooowww (went during lunch). But this last time, which was also during lunch, there were no problems.", "author": "L. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Loved it here. Every bring was delicious, friendly staff \u0026 priced fair! We ate our brains out and left super happy.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "I really wanted to like this place. We had ordered in once and, even though it took over an hour to arrive, the roast chicken was amazing with the extra delicious/addicting green sauce on it. However, we were in for a rude awakening when we arrived at the restaurant...\n\nFirst of all, the ambiance is that of a diner. It's a strange little space arranged more for coffee and take out than a restaurant. The kitschy Peruvian music was too loud and there was girls high school lacrosse on the TV. While I had expected an authentic Peruvian waitress, instead we got an Eastern European import who was pleasant but not helpful. \n\nAs for the food, the ceviche was fresh and spicy and satisfying. A little overwhelming actually in that the portion and hunks of fish were so big. For entrees we shared the lomo saltado (steak) and half chicken. The steak tasted as if it were from a Chinese take out restaurant. It literally had that beef and broccoli flavor to it - not necessarily bad but also not what we expected. It came with barely cooked onions and undercooked French fries. The chicken was still very good - and is maybe the only thing worth ordering here - although there was something wrong with the usually incredible green sauce (it tasted strongly of mustard and lacked the perfect balance of old). The sides of rice beans and sweet plantains were solid but unspectacular.\n\nOn top of everything they jacked up the prices from the menu online. Instead of $24 for a whole chicken it's now $28, etc. instead of a good deal it's pretty much as expensive food-wise as other better options in the area. The only advantage is the rare BYOB option since we brought a nice South American Syrah in with us. For a local BYOB night or ordering in the whole chicken, you can consider this spot - otherwise avoid!", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "We stopped in here for the first time tonight. The skirt steak and pesto pasta was excellent. I had a very nice tannat wine from Uruguay and the chocolate mousse was great. The bartender was very knowledgable and friendly. I'd definitely recommend this place, and I'm looking forward to going back again soon.", "author": "Katie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "I have been back 3 times (twice for lunch and once for dinner) since posting my initial review \u0026 service has gotten a million times better!", "author": "Mrs S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-28", "description": "Really nice place. I tried cerviche first time here and I must say it was terrific. Very fresh ingredient, clean place and hospitable servers. Although wait time is little high about 25-30 mins, other than that it was really good.\n\nMust trys: Classic cerviche, verde, quinoa salad.", "author": "Chinmayee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Excellent food and service! Will be back abain!\n\nWe started with the empanas which were amazing, AS WELL AS THE SWEET PLAINTAINS! Then we ordered the pesto pasta with chicken which was delightful", "author": "Saragrace T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "I've been to this amazing neighborhood restaurant a handful of times and have been thoroughly satisfied every single time. It has a little bit more catching up to do in terms of service communication, but everyone is so nice and accommodating! The food is just delicious! The chefs/owners are an all star cast from the Peruvian food scene, so no wonder the ceviches, rice and beans, platanos, chicken, etc, are all top notch. My Manhattanite friends ask me to \"stay home\" and go to Pollo D'Oro every week, so that in itself is a testament to my words.", "author": "Blaga S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Good for lunch but 'hit or miss' for dinner.  Chicken is really good when prepared day of but could be dry and salty when days are slow.  The sides are all good especially the yuca fries and rice n beans!", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Omg this place is the best! I've been here a couple of times now, service is always good, food is on point and if anything is missing they are willing to go lengths for you!!!", "author": "Jasmin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Outstanding food, nice atmosphere. Peruvian food is one of the best cuisines in Latin America. Definitely recommend!", "author": "Juan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "Freshly made Peruvian food just off Flatbush Ave. this is my second time here and the food was great both times. The service is excellent. Try the half chicken with sweet plantains as a side. The chicken is flavorful \u0026 moist and the plantains, perfect. I also had an appetizer order of Empanadas -one chicken, one beef. Both were very good.", "author": "Sue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Went here for dinner on a Friday night and it was surprisingly not very crowded which worried me a little bit but as soon as I tasted the aji (spicy Peruvian green sauce), I knew I was in for a treat.\n\nWe started out with the Leche Tigre and I have to say that was probably some of the best ceviche I've ever tasted. Definitely on the spicier side but if you are a spicy fanatic like me and my date, you won't get enough of it!\n\nWe also got the chicken tamale. It wasn't the best but once we smothered it in aji, it was gone in less than 2 minutes.\n\nMain course we shared half a chicken that came with 2 sides of your choice (we got rice \u0026 beans and fries yuca). The chicken was decent sized and the white meat was drier than I anticipated but the dark meat was absolutely divine. It definitely satisfied my expectations of good Peruvian chicken and almost put in the food coma (the quantity justifies the price!)\n\nOverall, this restaurant is definitely one of my favorites in Brooklyn. Decently priced, great quality food, impressive presentation, and chill atmosphere. Our server was very courteous and attentive which I really appreciated due to my experience working in the food service industry and even the chef/owner said goodbye to us on our way out!\n\nI highly recommend this place! You won't be disappointed :)", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Excellent service. I loved the toasted corn kernels with delicious sauce. The empanadas were good. The rotisserie chicken with beans and rice was amazing. The flan likewise.", "author": "Sue R."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}