{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Best Peruvian food in Brooklyn (en probably in New York). The food is out of this world. Not only the taste but the presentation and creativity. This place deserves to be on any culinary book of Brooklyn. Service is excellent. The place is clean. Prices are reasonable considering the quality of the food and size.", "author": "Salomon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "If you love Peruvian food, this is your place! I had the Causa Rellena  with the quarter chicken and golden tostones. The presentation is delightful and everything was delicious! No complaints here at all. More people need to come here!", "author": "Zita B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Great addition to the area. I had the seafood empanadas, lomo saltado, tostones and the donuts. The portions were healthy and everything was delicious! The BYOB aspect was a plus since there was a wine store right next door. Will be back.", "author": "Pricilla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "We live in the area and have done takeout. It is tasty and inexpensive, and we eat a lot of takeout, so probably will be getting this food frequently.", "author": "M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "I was staying in Downtown Brooklyn and was in need of a lunch spot. After consulting online reviews, I found that this gem was located right around the corner from the Hampton Inn where I was staying. The interior is new-ish, modern and reasonably comfortable. The menu has a number of attractive items including ceviches that would lure me back for dinner at some point when I'm in the area. A sandwich board on the sidewalk advertised a pulled chicken sandwich (Pollo A La Brasa), but it wasn't on the menu I was given. I inquired and it turns out that it's on a separate paper (takeout?) menu, which was kind of odd. The complimentary little starter of corn and a green sauce that had a little zip to it was delicious, as was the pulled pollo sandwich which was bathed in cheese on what tasted like homemade bread. My side of choice, fried plantains were much soggier than I'd prefer, but still were sweet and tasty. The service relatively indifferent and wasn't overly attentive or friendly. Even though the restaurant was barely busy, the food took quite a while to come out. I fully understand that fresh made food takes proper time to prepare, but even given consideration for that, it was still sluggish, especially given the smart streamlining of ingredients in such a place. I suspect that a lot of local office workers love the food here, but choose not to go more often because of the time commitment, which would explain why a place with such great food wasn't busier during primetime lunch hour.", "author": "Bill L."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}