{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Pros: Service, Ambiance, No wait, Green sauce\nCons: Dishes a bit bland\n\nCame here for a birthday lunch on a Friday and it was pretty empty, which was good since we did not have to wait. The tables were nicely set and clean. Our waitress was extremely polite and attentive. She recommended the ceviche tasting which was three ceviche dishes in what they call \"leche de tigre,\" aka Tiger's milk. The fish and shrimp were good in the ceviche but the Tiger milk was a bit sour for my taste. I couldn't tell the difference between the three...It was something to try, but probably not again for me at least.\n\nI ordered the Camarones al Cusco. It was a creamy shrimp dish with rice. They drenched the plate with the cream sauce that kind of tasted cheesy (not bad) but not what I expected. There were good amounts of jumbo shrimps, and the rice was just plain white rice. Even with the sauce, the dish was quite bland BUT that green sauce they have on deck did help. It's a cilantro base sauce with some spices, quite good. I recommend you try it with w.e you're having. My co-workers got chicken, some seafood jump off, and one even copied me (he's cool though). Overall it was a nice spot, but wish the food could compliment the place a bit better.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Set in a glass-walled enclosure in Gold street in Brooklyn, Pollo D'oro is a popular restaurant. The ambience is classy yet peppy.\nI went here for our student worker appreciation lunch. The order for the day was Cheese empanadas, Saltado Tallarines (or Peruvian-Chinese lo mein as they put it) and Pionono for dessert, which is sponge cake with dulce de Leche. \nCheese empanadas- crisp on the outside with beautifully textured mozzarella on the inside- a musty try.\nThe Saltado Tallarines was kinda similar to lo mein- it tasted great, but I couldn't find anything different from Chinese lo mein. \nThe Pionono was to die for! Imagine a Swiss roll with dulce de leche instead of icing. There was raspberry sauce to savor with it and savor I did! \nTo anyone who's around Dumbo and craving some Peruvian food, I'd definitely recommend this place.", "author": "Abhilasha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "Great food, very friendly staff. I had the quinoa, kale salad w/ chicken and it was excellent.\n\nCheck this place out.", "author": "Jason A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Best Peruvian I've had in NYC. Hands down the joint you wanna take your date to impress. Spark her lovely interest.", "author": "Qi X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Oh my! Yum yum yum... here on business, this place was walking distance from my hotel. Ceviche mixto was AMAZING! Shrimp, scallops, octopus, calamari, and fresh fish with a sweet potato cake (?)... So good! I had salmon (which was very good) but my food envy was for the salad and rotisserie chicken I saw go by. I need to come back here just to eat at Pollo D'Oro again!", "author": "Karen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Nice Peruvian place for everything Peruvian you want - ceviche, lomo saltado, causa... It is slightly expensive but the food was pretty delicious and service was good.\n\nEach table comes with free corns and SUPER DELICIOUS green sauce that goes well with everything. It is my favorite part of the restaurant.\n\nMy friend and I got 1. Lomo saltado and 2. Stewed lamb shank. Both are very big portion and delicious. Steak was just right in lomo saltado and it was standard good. The lamb shank was HUGE and there was so so much meat and lamb was so tasty and flavorful. The only down side was that it was a bit pricey - lomo was $24 and lamb was $27.\n\nFor drinks, you have to get chicha morada (blue corn juice). The homemade one was sold out so I tried the bottle one, which was also fine and reminded me a lot of my trip to Peru.\n\nThe service was pretty good as the waitress kept on checking on my table. The place was not noisy and the ambience was very nice for a nice intimate dinner.", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Pollo d'Oro is the neighborhood go to for tasty Peruvian chicken and that delicious, magic green sauce. They have a robust take out business, but eating in is also a treat and a totally different experience you should try.  \n\nThe mainstay is the roast chicken, which is always tender and well seasoned. Ask for an extra green sauce container because while one is good, two is amazing (and who likes to share?) I usually do pick up vs delivery, so the food is always hot (and then I can take it and go for a picnic in the park!) The tostones are always crispy, the maduros sweet and crispy on the edges. I'm ambivalent about their side salad - the dressing is very tart. The woman who is at the take out/pick up booth is always cheerful and helpful. She's happy to let you sit and serve you water if the place is empty and you have a little while to wait. \n\nWe ate in recently and the menu is so much more varied and impressive when you eat in.  There's cerviche, tamales, stews, shrimp, rice dishes. The place isn't super vegetarian friendly, which is the major con. I ordered the lamb stew (Seco d'cordero) which is a lamb shank on the bone, fork tender, that comes with lots of gravy and beans. It's super savory and delicious, I would order it again in a heartbeat. The beans were also tasty and tender, perfect with the white rice that comes with it. Toward the end of the meal, the dish was getting to feel a bit salty, but if you eat everything with the rice or if you split the dish, you may not notice this as much. Hubby had more chicken, nothing new to report there. Service was good - you may need to wave someone down, they don't hover, but there was always plenty of water. They also have beer, wine, and cocktails. \n\nThe dining room is decently big, with seats for about 50, a clean restroom, a chic bar, and lots of blue uplighting. We saw a few dates here, some families, some casual, some celebrating a nice event. It's pretty versatile. There is a spot where you have to take two steps up into the restaurant once you're inside. Keep in mind for ADA or stroller purposes. The tables are not too close together, but one or two strollers would definitely make it feel a bit crowded. \n\nPricing is fair for the neighborhood, service, and quality. Plan on dropping about $20-40 per person, depending on if you drink or not.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Truly enjoyed our dinner. Service was excellent. My daughter and I shared the Tacu Tacu Steak served with \nRice and Peruvian Cannary beans rissoto with fried egg on the top and Sweet Plantains on the side. Since it was a 14 oz Angus Rib Eye Steak we knew it would be enough to share. We added a side of fried yucca. Can't wait to go back.", "author": "Karin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Came here on a Friday night with coworkers. The food was delicious. We ordered some appetizers for the table which included the antichufos (beef heart), tamales and empanadas. Everybody loved the antichufos and even better was the fact that they had a special version that included octopus. The empanadas were on point. One coworke\nr was not too impressed with the tamales saying it lacked flavor. I liked them however. We got the traditional rotisserie chicken which was nice and juicy! The lamb plate which I loved and two beef plates that came with rice. I wish I had ordered the jalea plate. Next time! The ambience is nice inside and the waiters are friendly. I would highly recommend this place. Do note however that a party of five or more are automatically charged a 20% gratuity. The sangria pitcher was a bit expensive. The pisco  sours were delicious.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "Horrendous takeout experience from Pollo D'oro. \n\nSeamless delivery took approx. one hour, which was perfectly fine as seamless gave me this time estimate upfront. However, when the delivery guy arrived I quickly realized that half of a chicken was missing from the order. I caught him before he left luckily and he told me to call the restaurant and let them know. \n\nThe phone line rang and rang and rang. I literally called three time before a woman finally picked up. I explained the situation and after asking for my name, the first words out of her mouth were: \"I packed your order myself and the chicken is in there.\" Really? You are now going to blame the customer and essentially call me a liar after I waited over an hour for your mediocre food? I received no apology whatsoever from this obnoxious woman but at least she did end up sending me the chicken. Disgusting customer service.\n\nOh yeah, and that's the other part of my issue with this place: the mediocre, overpriced food. My boyfriend ordered fried rice for SIXTEEN dollars that he said was fine but could easily have been from a Chinese takeout place. My half chicken also was tasty but again could have been rotisserie from my neighborhood supermarket. And from Pollo D'oro is cost me EIGHTEEN dollars. \n\nI'll just leave it at this.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Really nice sit in place. I got the tacu tacu steak medium well. The portion size was more than generous. It comes with 3 plantains and rice and beans. The meat was tasty but could use a little more salt. My party ordered other items on the menu and they all looked great and were decently portioned. I heard the beer is fantastic as well. The green sauce tho- to die for.", "author": "Achiaa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Great food, helpful and friendly staff, clean environment \nWill swing by whenever in town.", "author": "Jose P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-01", "description": "Food is okay, but it felt overpriced. I had \"Pollo a la brasa\" because I thought that'd be their specialty. It wasn't bad, but it could be better.", "author": "Rafaella A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Came here for lunch and they were very slow and expensive (for lunch).\nUsually restaurants in areas with a lot of office buildings offer a pre-fixed lunch menu with lunch specials and to ensure its patrons can get in and out in their allotted lunch hour.  Not this place.  \n\nThe food was definitely good, though.  Ordered the half chicken with rice and beans and plantain.  Seasoned to perfection!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "I wish I had discovered this place sooner than I did. Once I did, I was totally blown away with the food they served. I tried their steak stew and some of their shrimp dishes. The seasoning was impeccable and with just the right amount of salt, pepper and spice. Being a novice with Peruvian food I did not know what to expect, but the flavor profile was so distinct and tasty I kept wanting more of it. \n\nI have since moved out of the neighborhood but will make a point of returning. I would have loved to give this place five stars, because the food definitely deserves it. I have to take a star away, because from the outside it is impossible to gauge what kind of food they serve in this restaurant (mind you, I haven't even tried their chicken yet). There is no indication what kind of cuisine or experience one should expect. Unfortunately, the decor of the restaurant is very nondescript and gives no indication that they are preparing Peruvian fare. The almost office-like interior design detracts from the otherwise excellent experience the restaurant offers. \n\nIn summary: Five stars for the food and service, minus one star for the generic interior design", "author": "Rikard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Love love love this place. Very cute and cozy. Service was quick quick and the food.... you have to try their food. We have two steak empanadas. Seco de cordero and lomo saltado. Chicha morada and their roasted corn!!!! Must try!!!!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I went here a few months ago the food was very tasty. I had the lomo saltado and ceviche everything was delicious. I wish they could make the place bigger because it's so small.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "I would like to start off by saying that Pollo D'oro has some of the best empanadas I've ever had. I recently had them cater an event and everyone was a fan of the beef, chicken and cheese empanadas. \n\nI have no other way to contact the management at this restaurant which is why I am writing a review. I would love to be able to use them more but getting the empanadas for my event was a nightmare. I had several conversations with both the manager and different hostesses where communication was difficult and strained. The manager asked that I email him, and I did to no response. \n\nI asked for the empanadas to be delivered, at first he said they would and when I happened to call back a few days before the event to add to my order, only then did he inform me that his delivery person doesn't get in until 5pm, thus they would not be able to deliver my order at 4:30pm. I don't understand why he couldn't simply ask his delivery person to arrive earlier, it was more money in their pocket as we would have tipped well on a large order. \n\nThe worst offense probably had to be when I arrived at the restaurant to pick up my order. The chef happened to be at the front and when he saw me he said \"five more minutes\" and ran to the back. I arrived at 4:30 to pick up my empanada's for a 5:00 event. I did not actually leave Pollo D'oro until 5:05 with trays of burning hot empanadas seemingly JUST PULLED FROM THE FRYER. I had called several times and spoken to at least three different people about needing this order filled at 4:30pm, 4:45 at the latest. \n\nLater that evening, when all of the empanadas were eaten within 30 minutes and I called back to order a second set (this time I knew they could be delivered because it was past 5:00), it took me a decent 10 minute phone call with the hostess to place the order. I placed it at 5:45, I called back at 6:50 when they still hadn't arrived and the hostess said they were on the way. \n\nWe didn't get the second set until 7pm, 1 hour and 15 minutes after my order was placed. And our building is located across an avenue from the restaurant. My only explanation as to how it took so long for these to arrive is that maybe the empanadas need to be hand rolled thus, ordering 45 at one time takes a while to make?\n\nTL;DR Food here is delicious but if they want to take their catering business more seriously they should have an easier way of handling and executing orders.", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "It is an amazing perivian food place. The drinks are great. It is a cozy place with kind staff and nice music. Definitely a place to go and try!", "author": "Paula V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "On a diet? Order from here. Took 10 minutes to place my order bc the saleslady couldn't get my apt number correct. Then, you'll waited 1 hr for a fist size rotisserie chicken lunch special for $10.50. I live 5 walking blocks from this place! Could have trained it to Costco and picked up their rotisserie chicken for half the cost and wait time. \n\nPrior time - they gave me someone else's dinner. \n\nTerrible delivery service!", "author": "Ko L."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}