{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "We had a great experience last night at this hidden spot in Brooklyn. Everyone was pleased with their dishes, which included the chaufa de quinoa, seco de cabrito, anticuchos, y picarones for dessert. I definitely recommend this place for anyone who is looking to try authentic Peruvian cuisine and those of us expats who miss it. The drink selection is very tasty and they have happy hour too!\n\nTuvimos una deliciosa experiencia comiendo en este restaurante. La comida estuvo muy rica y auténtica a la sazón peruana. Las porciones eran generosas y buenas para compartir en familia. Recomiendo este lugar para las personas que quieren disfrutar un plato peruano auténtico.", "author": "Natalia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Margaritas were BOMB!\n\nI also had me the quarter chicken which was literally the size they described and order it with the fried sweet plantains (maduros) so good. I loved the chicken fried rice!! It was so fresh and delicious. I could of ate the whole bowl alone and they give you this sweet like ginger garlic green sauce that you must put on the rice. Its very easy to share that. The waitresses were very nice and helpful. Place is pricey but I couldn't beat the great food and drinks! I wouldn't try to park around there cause its a very busy area, cute little date spot on the corner also. it was a HAPPY FRIDAY for me! I will be back =]", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-03", "description": "They gave my order to the incorrect customer. Also my food was missing one of the sides. Very disorganized.", "author": "Gabriela P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Everytime I'm in the neighborhood, I have to stop by this restaurant. The service, drinks and food are always on point. The prices are reasonable and the food is very well seasoned (which is big for me) I recently went here with my boyfriend. We decided to order the cheese, chicken and beef empanadas, the lomo saltado and the pollo saltado. It was amazing! Definitely worth trying if you've never been here before.", "author": "Jeannette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I really enjoyed this restaurant, the food was EXCELLENT the menu is great!!! The desserts are DIVINE and the staff is friendly. I will most DEFINITELY go back and try different menu options.", "author": "Geraldine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Absolutely delicious!! We had food delivered to us and it tasted just as we would've had it at the restaurant. Authentic Peruvian taste . My husband and I ordered the rotisserie chicken and Seco de Cordero . Meat was tender and spices were right on point . Seco de Cordero came with salsa criolla and it was delicious. We actually ordered extra green sauce because we can't get enough of it . Every Peruvian restaurant makes its own green sauce ,but this one is the closest It has ever come to the ones I've had in Peru . Just delicious!!!", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-27", "description": "I called in an order for pick up once but when I arrived at the restaurant, they had a sign that said they were closed for an hour or so. I was knocking on their door and the staff just stared at me. I had to call the shop to explain my situation (while I stood outside their door) and I eventually just told them to cancel my order. I asked if I had to do anything on my end and they told me not to worry. A few days later, my card was charged for the order so I had to call them again and settle the issue with them. There definitely was a lack of communication and I wish this situation could have been handled better. \n\nI've only had take out from this place, so I cannot comment on their service. The first time I got their chicken, it was moist and flavorful, however the second time I got it, it was dry. The lomo saltado is good but the size was pretty small considering it was an entree. I'm not too big of a fan of their tallinares verdes, it was dry and needed more pesto.", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "The Peruvian style lo mein dish was pretty good. Also has Peruvian chicken dishes if you want something more affordable. Overall very high quality food, but note that they do not take Visa cards.", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "While the wait made me feel like giving 2 stars, when the food came, It was so damn good that I have to give 5.", "author": "Will H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "I ordered delivery from here tonight and it has been OVER TWO HOURS and my food has still not arrived. I called an hour ago and they said \"the delivery man left and your food should be there any minute\". It clearly was not. I called back again 20 minutes ago and they said \"I just spoke to him, he is on your street\". He is clearly not. This place is overpriced and the people who work here don't give a fuck. Also it has a B sanitary rating which I just noticed which is disgusting", "author": "James P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "This will be my new favorite Peruvian place the food was amazing. The ceviche was so fresh all the food was so delicious  our server Alejandra was very attentive", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Finally!! A great taste of Peruvian food. I went there just out of curiosity, and I was impressed.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "The food is delicious as well as the drinks and ambiance's be forewarned they don't process Visa card. Only American Express and MasterCard", "author": "Mahogany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Great meal, a little pricey but it's good food. \nThe portions are large. May want to share a meal.", "author": "Arif K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "My review is based on my delivery order on December 27, 2017. I ordered the Lomo Salgado which seems to be one of the more popular ordered dishes (if you look at Yelp reviews and pictures). The meat was very tough and the sauce could've used a lot more zest or flavor. This was a letdown because I've been here a few times in the past and the food is always good!! The white rice was really good- it had a nice texture and wasn't mushy or dry. The fries that come with this dish are a lot more when you order it to go than what you see in the photos when you eat in the restaurant. I got a full container of fries- not the 5-8 fries I saw in fellow Yelper's pics. So if you want bonus fries -order this meal to go. The fries were average nothing to write home about. (Try them with the green sauce.) \nThe tostones were good. \nMy coworkers got the fried rice (which was so so looking to me) and the steak sandwich (which looked really good). They had no complaints about their food. I'd recommend trying the food in the restaurant before you pass judgement.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "This was definitely the best meal we had during our visit to New York City. My son and I enjoyed two different and uniquely flavorful ceviche dishes as well as lamb shank served with rice, white beans and succulent sauces. The service was gracious. Unlike some establishments, for example, there was no surcharge for us splitting an entree between us. My son arrived soaked from a sudden rainstorm and they gave him a towel to dry himself and sat us next to a portable heater. Our only regret is we are leaving town tomorrow and will not likely return for a long time. If we lived in NYC, we would regularly patronize this family restaurant.  Hasta luego!", "author": "Mark C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "This place is really good ! The food is excellent and service is great. We were 5 people and we walked in around 1:30 (Thursday) and we were seated right away. \n\nOur waitress was really kind and we wanted to switch tables after being seated and she obliged. She also made some excellent recommendations and gave her honest opinions.\n\nWe ordered:\nLomo Saltado \nHalf chicken \nEmpanadas (chicken and beef) \nChaufa de Quinoa\nThree chocolate mousse\n\nIt was all sooo good. The empanadas were soooo delicious. The fries that came with the meal were also delicious.\n\nWould definitely recommend and return !", "author": "Maya V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "So I was feeling a bit homesick and decided to go for some Peruvian food. I decided to have the tallarines saltado with steak, it was amazing! Unfortunately, they didn't have the Peruvian Kiss, which is Pisco cocktail with chicha, \u0026 for this reason I don't give the place five stars. The staff is friendly and attentive. The restaurant has a nice calming ambience. I really liked the classic salsa hits they were playing! There is also a bar section. Bathroom was clean.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Pollo D'Oro went above and beyond to redeem themselves for the delivery mishap. No other restaurant or company has tried to amend for a mishap so courteously. When I spoke to them the first time, they said they'd send the same order for free next time I wanted it - when I called 11 days later, they sent it promptly and graciously. I am very appreciative for their efforts to amend their mistake", "author": "SK S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Such a great family oriented spot. The food is delicious, large portions, and the drinks were great.", "author": "Christine P."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}