{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "It's great to have such an amazing restaurant in the neighborhood. It's definitely a weekly fixture in my life. The limo salado and empanadas are a must and having the wine store next door makes for the perfect date night for a reasonable price.", "author": "Smitha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "The food here is absolutely phenomenal. The owner, Manny, and waiters and waitresses only wish to give you the best service around town.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Loved the empanadas, not a fan of the yucca. Would go back though. Friendly counter people.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "I love Pollo d'Oro. I live in the neighborhood and have been several times. The green sauce they bring to the table when you arrive....I always need more because it's gone so soon. Dipping a golden, lightly crispy yuca fry into this complex, tangy, subtly spicy secret sauce is all you need to do. But then you have to order the classic ceviche. I have never tasted ceviche this good in NYC. The bright, tangy sourness of the lime juice on fresh, delicate fish balances with soft chunks of sweet potato and big pillowy pieces of corn, enlivened by the zest of thinly shaved red onion. Delicious!! Then comes the quinoa (the salads are very filling yet healthy) and the rotisserie chicken. You have to order the chicken!! Succulent, cooked to perfection, well seasoned, and very satisfying. I don't even mind this restaurant is BYOB - I love not overspending on alcohol when dining out (easy to do in this town). I want to see this restaurant succeed in this neighborhood and will be coming back.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Good food, service is ok and there is a $10 minimum to use a credit card. I ordered two empanadas and it was like $8, when the bill came I had to order something else for take-out (even though I was already full). No alcohol license, so don't be fooled by the wine glass and bottles that appear to be part of the decor", "author": "S G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "I work right across the street and frequently order lunch. I love their empanadas and baked chicken. Chicken is always moist and flavorful. I just wish that they delivered.", "author": "Melissa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "In the heart of Brooklyn-very cozy and yummy peruvian food. They have a to go station for nearby neighbors in the area. Must try the golden tostones and the chicken is great!", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "I just had take out from here. The food was exceptional. I had the Tallarines Saltado with grilled chicken. It was similar to lomein, like the menu states, but much better. Especially with the sauce added. I can't wait to try dining in.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "The food was presented wonderfully and tasted awesome. The service was even great. The Russian waitress spoke better Spanish than me. But the only setback was that the portion of ceviche didn't match the 16$ price tag. Still a great spot though.", "author": "Aren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Finally a fantastic restaurant in the neighborhood! The service is great but the food is delicious. The seafood is also fresh, and frankly, everything we have tried here has been amazing. So excited to make this a regular of ours!", "author": "Danielle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "A hidden gem in DTBN! Very Authentic Peruvian. A bit heavy on the flavor side for some people maybe but I loved it!", "author": "Lucas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "While traveling on business came across this restaurant around the corner from my hotel. So good I went back the next night. Friendly staff.  Attentive service. Excellent food.", "author": "Ed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "Stumbled on during a lunchtime walk, tucked on the ground floor retail space on Gold St and not visible from Flatbush due the gas station. Excellent preparation and presentation. Still new as of early Nov-2014 and a few things not quite in place - coffee machine (it is coming!). Had the ceviche (simply awesome), quinoa salad (super fresh and zested nicely), on subsequent visits various chuafe (all fantastic), and  1/4 roasted chicken (very tasty). This place is a gem and the staff are super nice.", "author": "Tito M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "The food here is great.  The green sauce is amazing and the presentation is fabulous.  I think this restaurant will do very well in the neighborhood .  I want everyone to go and try this place out and get the green sauce with everything you eat. Its just that amazing. I had the grilled chicken sandwich with a side of sweet plantains.  My dish also tasted delightful. I love the spices and seasonings they used. I will definitely go back.", "author": "Dan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Doing more of the same rarely yields a different result. Replacing the doomed Gold Street Eatery, Pollo D' Oro has landed itself in a residential corporate community that has high dining standards. Gold Street Eatery failed because they thought a business model catering to the completely oblivious clientele that frequent the bodegas along the periphery of the projects would be sustainable. They failed and so will this place. \nThat said, I've had empanadas and they are actually quite good. But that's it. The first time I ordered empanadas, the host gave me a small 1oz container of dipping sauce for 4 empanadas. The second time I asked for sauce, the guy gave me attitude and said they only give sauce with the full meal. Hopefully they can find enough people to give them five stars before the bank comes 'a knockin...\nI suspect that they will never achieve profitability and will be closed within a year.\n\nps: take that stupid sign down that says you open early. None of you wake up until 99% of the neighborhood is already at work.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Great food and I am still giving it 5 stars. However they really need to work on pricing. For example, their 'fried rice' which is exactly like chinese fried rice is priced at $14 and you have a choice of beef/chicken/shrimp. $14 for fried rice is very high but one night I decided to just order that as a take out. It turns out you can't just order a plain fried rice. You must choose the protein. So basically their fried rice cost $20!!! That makes no sense... ! So I hope the owner will adjust the price accordingly.", "author": "Nina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I just finished a fantastic meal that left me amazed.  Amazed at the service, food, and prices!  I highly recommend dining here if you fancy Peruvian delicacy.  The atmosphere is quaint yet modern at the same time.  The food is easily the best of any Peruvian restaurant I have ever had in New York City.    I highly recommend the ceviche mixto... It was incredible!", "author": "Yuli S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "The whole Peruvian chicken was very tasty and with 3 sides for $24 is a very filling and cost efficient meal for 2 people.  The wait for the chicken was  in excess of 30 minutes, however, the waitress did inform us when we ordered that it took a while to prepare it.  Good food takes time and I was happy to sit at the bar watching the game until it arrived.  I suggest that if you are in a rush for take out, call ahead of time.  A new place with a few little kinks but the food is good and I hope they succeed!", "author": "Sam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Awesome, tasty, healthfully prepared and simply delicious food in a welcoming and friendly dining experience!!!  Always look forward to eating there during our visits to New York City!!!", "author": "Carol B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-17", "description": "Have to edit this review based on a few more experiences. The food is good, takes a really long time if you are dining in. But what they really need to improve upon is customer service. I cannot believe how rude the women are who answer the phone. They act like they are being bothered when you call to place an order. Last time I ordered from here, I was delivered the wrong food. I called to let them know (I got another persons food), and they did not offer to deliver my food or give me a refund or anything. Basically, you have to eat the food that you got even though it isnt what you wanted. Ummmm.... Ok? Way too expensive for the portions. Thankfully other places are opening in the area so we wont have to 'bother' the rude women who run the front desk anymore.", "author": "Maya G."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}