{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "I visited here for dinner. Chicken was very flavorful, but a bit dry. Empanadas were tasty. Service was friendly. I came here for a quick, dinner and this place fit the bill. The chicken was really tasty.", "author": "J T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-22", "description": "The worst service of all time, they got our order wrong, refused to correct it and blatantly told us that next time we should order better. Beyond BS, food is not worth dealing with these guys. Cannot even believe had badly customers are treated here.", "author": "Hunter V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "My honey and I had delightful  Peruvian meals  at the foot of the Brooklyn \u0026 Manhattan bridges, down town Brooklyn. Beautiful and friendly people guided us on our Peruvian expedition to tantalizing flavors. Nice place for a date or to talk someone out of something :)", "author": "Dominique C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "I am extremely disappointed with the service I received. Firstly before I left I asked the person who gave me my order if any of the special green sauce was included and he told me yes. When I opended my bad there was no sauce whatsoever included. Also there were no utensils or napkins included in my bag or condiments for my sides. I am extremely disappointed that I was lied to as well as not given any utensils to consume my food with. It's amazing that this restaurant is being promoted within Grubhub when there customer service representatives are blatenly lying to customers as well as not providing any utensils. How am I supposed to eat my food. This is ridiculous I've never had this problem before especially from a restaurant so highly rated. I demand some kind of compensation for the horrible service I received. This is unacceptable. I will not be eating here any longer. I don't know how they expect repeat customers.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "I've visited a few times with friends in the area and I really love this place. The food is fresh and delicious with lots of tasty options for all eaters. Love their house salad with fresh avocados and queso fresco. The staff is always so friendly and service is very fast. Plus, last time I visited they were still waiting for their liquor license so bring a bottle of wine!", "author": "Megan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Brand new, and already a winner. The food was great! Had a lobster ceviche ( on the pricey side @ $24 for an appetizer ) but it was almost large enough to be an entree. Great flavor, just spicey enough, and the presentation was terrific - wish I brought my camera phone. Peruvian chicken in a sauce ( aji de galina ) was delicious. I was almost full after the appetizer and figured I'd take most of the entree home, but I just couldn't stop eating it. Cream sauce was just light and spicey enough. Tasted the fried yucca and super moist chicken breast ordered by my friend, and all in all, it was terrific. Very attentive and friendly staff. Liquor license is in th works so it's BYOB, but there's a terrific selection of wines at the shop next door. Great addition to the neighborhood.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "So anything Peruvian in Brooklyn - I get so excited about and have high expectations. Decor was nice and modern...Great place for a date. We had Lomo Saltado, Pollo a la Brasa, and Tallarin Saltado. The lomo Saltado was okay i've had better. The tallarin Saltado was amazing! the pollo a la brasa was not that great in my opinion. It was overly seasoned and a little dry. Coming from NJ I've had better chicken. BUT the Green sauce they have tastes really good. Dipped my french fries in there and it was splendid :-).", "author": "Michelle Carolina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "I'm not a Peruvian food expert but I thought the Langostino Saltado was great! The service was fast and the empanadas are a nice appetizer.", "author": "Carlos L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Tried this place for lunch.  They do have a lunch special that is not on the menu.  quarter chicken,  rice and beans and a coke. All tasted great.  No complaints", "author": "Mo E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "always better in house.....\ngreat service...\ngreat food...\ngreat pisco sours...\n\ndelivery is fast...hot and delicious...\nit is at our table once at week!!", "author": "Yvonne Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Don't let the lack of people at Pollo D'Oro turn you off from this traditional yet upscale Peruvian restaurant.  Despite being new and not having a liquor license yet (for now it's BYOB and there's a wine shop right around the corner), the service was very good. They started us off with corn and a green sauce that was out of this world!!  While most of the dishes on the menu looked good, my boyfriend and I opted for the specials.  One was a lamb shank over beans; the other was a traditional flank steak dish with rice, beans, and french fries.  Both dishes were very well seasoned and flavorful.  The meats were cooked just right and the presentation was also very well done.  Overall it was a very pleasant experience and hopefully it'll stick around, because I'd love to eat here again.", "author": "Reeves B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "One of my favorite go-to dinner spots in BK. Food is always amazing. They serve this toasted corn when you are seated that is like crack. The beef empanadas and lomo saltado are my undeniable favorites. Chicken is also good and flavorful, and I also enjoy the tostones as well. Eat everything with the green garlic sauce. Service is good, staff is attentive. The food usually takes a while to get out but is always delicious, though the last time I was there we told the waitress we were in a rush and everything came out super fast. Downside is they still don't have their liquor license but allow BYOB/Alcohol. There is a wine shop literally right next door, and the restaurant will provide wine glasses and will even put your bottle on ice (bucket) if desired for no charge. Cute spot, great food, but they need to get their license!", "author": "Eirene Joy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-20", "description": "Okay not great. They have a bit more experimenting to do to get this place above average. At the moment the food is overpriced and the service is spotty. I had a waitress who did not know what I was ordering off their menu and the place had opened only a few days earlier. Management needs to do some training. Also, as long as they are waiting for a liquor license, they need to encourage BYOB and also lower the food prices. I was excited to try the new spot in the my hood, but after such an underwhelming experience, I may not return.", "author": "C C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Great new restaurant very close to Avalon Fort Greene apartment building! The food was delicious, very flavorful and tasty. Try the mussels! The staff was very friendly. Another plus is it's a family owned restaurant. I'll definitely visit again. Welcome to the neighborhood! :)", "author": "Constance D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "This place is so good. I have been here a half a dozen times for sit-down and take out (just finished eating take-out from there tonight, which inspired me to write this review). All of the food is super good and fresh and the staff are really friendly. I haven't ordered anything so far that I haven't liked. Give it a try!", "author": "Eric J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "HORRIBLE EXPERIENCE!!!! I called to order dinner delivery for an executive planning meeting I was hosting in my apartment for my not-for-profit board.  I live 20 floors up (just an elevator ride) in the same building as Pollo D'Oro.  After 40 minutes, I called back to check on the order and was told that delivery time was one hour, as they were very busy.  I expressed my discontent with the fact that the extra long delivery time was not communicated before I ordered. They apologized and promised to bring the order \"right away.\"\n\nI called back 20 minutes later and they did not answer the phone.  An hour and 20 minutes after ordering, my guest were famished, so I walked down to the place. It was not full. The delivery person told me that he had made 2 deliveries all night and was not happy with the tips. They were shorthanded and serving the restaurant while deliveries were made to wait a ridiculously long time.  I asked to speak to the manager and he refused to come to the front to hear my complaint. They refused to take anything off of my delivery order that took 1.5 hours to complete and that I had to walk down to the restaurant to get, interrupting the flow of my meeting.\n\nI refuse to purchase anything from a manager who after screwing up does not have the respect to face a customer and compensate them for the inconvenience that he/she caused.   I would have ordered from somewhere else that night if they were honest about the extreme delay, but instead they lied to me twice about the status of my order, delayed me in serving my guests, and embarrassed me as a host.  Mr. Pollo D'Oro manager: I was a good annuity stream, ordering 3-4 times per month.  I am taking my wallet back to Coco Roco.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "Steak sandwich was okay, but gross, limp, undercooked, greasy fries were not. AND, as I was inexplicably told, they weren't included with the sandwich because I ordered them to take out and not eat in. $17 for a \"meh\" lunch??  Poor policy for a new restaurant.", "author": "Brett H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Found out about this place from my co-workers, and so far so good.  Their chicken rotisserie is the BOMB, specially when you add the Tostones.  The staff is very attentive and the food never take too long to be ready, specially if you want to order for pick-up.  One thing is that they have yet to gain heir liquor license BUT.. BYOD!  Enjoy!", "author": "Carlos A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "The Lomo Saltado, sweet plantains, roasted chicken, chicken and beef empanadas were all DELICIOUS! I put the famous green sauce on everything. Their liquor license is pending so for now its BYOB. There is a wine store right around the corner which is vert convenient. The service was excellent. I will definitely be going back very soon.", "author": "Krystal Anne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "This food is very good. There is a lot to choose from.  The owner and servers are all very friendly. We like the decor and ambience. It's a great new neighborhood spot with a great location near everything.", "author": "Lebleena L."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}