{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Food is ok enviroment is good the way they present the food is nice. Very overpriced service was i guess ok  what bother me was that when they give the check tips are already included  i felt forced or robbed", "author": "Laura Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "Excellent Peruvian food and Pisco Sours. Found this place completely by accident and it was a great find. Great service as well.", "author": "G T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I came here for a Friday lunch with three friends, one of whose family owns the restaurant, so I MIGHT be biased. But seriously, this place is an awesome Peruvian restaurant with even better service to match. \n\nFirst of all, their corn kernel snack is like crack. It should be called kernelcrack or something. \n\nFor appetizers, we ordered yuca, green plantains, and antichucos (heart skewers?!!? awesomely badass). \n\nI had the ceviche mixto. Totally satisfied my seafood craving. It has shrimp, calamari, and octopus, with a whole lotta lime. Delicious. My friends either had the tacu tacu special (steak and rice with eggs) or the lome saltado, which they enjoyed and took home. \n\nI dug this place. The decor is cute and it's unassumingly tucked away on a side street in downtown BK and it deserves to be packed (which it is during peak hours!). Our waitress was sweet and helpful too. Check outing Pollo D'Oro is worth it if you're in the area.", "author": "Darya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "If you love Peruvian food like I do then you need to try this spot out. Nice menu selection and a relaxed atmosphere for dining. Definitely worth a visit.", "author": "Erik T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Best Peruvian food I have had in NYC/Brooklyn area. Service, music and decoration are great!", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Food was delicious. Service was great. Made reservations an hour before. No wait time. Worth every penny.", "author": "Claudio C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "I enjoy the food here ever since they opened. The only problem I have is they open at 12pm instead of 1130. I see a lot of people that pass by  this location during that time wanting to come in but they can't because they open to late. There are a lot of working people in the area who would like to enjoy their lunch breaks eating at this establishment.", "author": "Shonette P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "I visited this restaurant last night and I must say, I was impressed. \n\nThe service: Awesome! My group of 5 arrived on a Sunday evening around 6pm, and we were seated immediately. Of course, it was fairly empty. The host and the waitress was super friendly. She checked on us the appropriate amount of times a waitress should, and our water was refilled quickly also. \n\nThe Food: mixed reviews from my group. I ordered the anticuchos, which are the beef hearts and honestly they tasted so authentic, so tender, and with the green sauce, I would come back for this! My boyfriend got the chaufa de pollo or chicken fried rice and he thought it was good. My cousin got the tallarines verdes con bistec which is the pesto pasta with steak and she thought the pasta was flavorless but the steak was good. My other cousin got the seco de cabrito which I believe is lamb, and she thought it was just okay. Her husband got the lomo saltado and he thought it was good. \n\nThe cons: the bathroom had very little soap which had been mixed with water. For the prices they charge, there should definitely be soap readily available and not diluted with water. Also they had a sign that read, \"please don't throw paper in the toilet\", yet the garbage container was about 4 feet away from the toilet and it was the ones that open the lid with your foot. Do they expect people to hold all their used tissue until they're done, zip up their pants with one hand and then discard them in the garbage? Or did they want people to balance themselves on the toilet with one foot while trying to throw out their tissue? Also, their tables were really close together. I'm an average size person and I wasn't able to get up from the table without disturbing the strangers next to me. These aren't things that would keep me from coming back, but something that bothered me and deserves attention from management.\n\nOverall: I would come back! A little pricy, but I think it was worth it.", "author": "Mel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "This place is amazing.  I have never had Peruvian food before.  It tastes like my grandmothers homemade empanathas with so much flavor.  I love to try new dishes and I loved everything about this place.  Next time I am on the East Coast I am mos def visiting here again.  There was also a mango drink that was very beautiful and delish.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "I always find myself coming back here because it is such a quiet place to go with a friend and relax. The desserts are usually what I look foward to.", "author": "Xeolly V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Five starts specifically for the Pisco. I didnt really eat much, just nibbled since I wasn't terribly hungry. Everything else was good, the food, the yucca fried were quite delectable, and my fiancee had the hangar steak and the yellow sweet plantains which were also delicious, I had a tiny bite. But the pisco was everything. \n\nI'll be back, next time, hopefully with an appetite.", "author": "Randy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "The food was good but the 2 star is because we went for lunch and the a/c was not working and so we did not enjoy the food. Everyone was sweating. 2 Star is also because the service was very very slow. We waited for 45 min for lunch which is unacceptable for an office crowd", "author": "Mel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Pretty average. Chicken was good, but not that much better than rotisserie chicken from the grocery store for the price that they charge. They are also extremely slow.\n\nEver since I tried their ceviche though, they are growing on me!", "author": "Connie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Clean, open and bright space for lunch and weekend brunch.  Does not offer any special brunch items but a mixture of traditional and modern Peruvian food.  Fair prices but not large appetizer or entree sizes; the salad, however, is definitely shareable.  Friendly staff and quick service.  Takeout is popular too.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "The food here is fantastic despite the bizarre ambiance, however be warned that they do run out of the famous chicken from time to time. However, the saltado is also a must try if you do get unlucky. \n\nOh and be sure to ask for lots and lots of the green sauce, it's addicting!", "author": "Tamara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Three of us and a baby came in on a weekday for dinner and we really enjoyed it.  Big portion, moist chicken, and great service (very accommodation since we have a 2.5 months old baby). I'm no expert in Peruvian chicken, but I would go back for more of it.  Did I mention big portion?", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "I came here during lunch with a group of coworkers hoping for a quick and delicious meal. Although I did get a delicious meal, the service was horrendously slow. There was only 1 other table when we walked in yet it took forever to get our food and it came at different times. \n\nFood: I ordered chicken empanadas for appetizer and a quarter chicken with a side of fried yuca. The empanadas were delicious with a juicy chicken filling. I loved the green sauce that was brought to the table. I literally smothered everything in it and it's fantastic. My chicken was juicy and flavorful and the skin was outstanding. The fried yuca was also crispy and starchy. Also very delicious dunked in that green sauce. \n\nService: our food came in 2 waves. Everyone who ordered chicken basically finished eating by the time the people who ordered beef got their food. We asked for the check pretty fast too since we had to head back and that also took forever to come. The restaurant wasn't even busy. \n\nOverall food is pretty good but I'd recommend doing takeout for lunch if you're in a hurry.", "author": "Aimee X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Great food, clean and clean.  Ambiance was great, we did not have to wait to get seated and the staff was very knowledgeable about the foods they server. This was the first time eating Peruvian food and I have to say that I really enjoyed it.", "author": "Carmen P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-26", "description": "i thought i would give them another try. this is what $27 worth of food looks like. never never never never will i order from them again. straight trash.", "author": "Rikki V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I had an excellent experience at this restaurant. The food was cooked to perfection and of all the Peruvian restaurants that I've been to they have the BEST green sauce - paired absolutely perfectly with my boyfriends steak. The restaurant is small in size but packs the punch of a larger upscale urban restaurant. The music definitely sets the mood for a hangout night or a fun date night - just loud enough to drown out other conversations but soft enough to hear everyone at your table. I also love that they have a small window where you can pick up your food to go. The staff was also super helpful and very attentive.", "author": "Kristen P."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}