{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Food alone: 5 stars \nService: 3 \nWait for food: 1\n\nWe waited an hour and a half to get our food. But the food was worth it. Place needs to learn to cook their food in a timely manner. Apparently we were for the first table of the day to get chicken.", "author": "Lee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "The second of two restaurants to open in our neighborhood. WE HAVE TWO RESTAURANTS WOO HOO! \n\nBring your own wine until liquor license is obtained, so head to the wine store 'Wright and Goeble' around the corner on Flatbush ave before dinner.\n\nThis is a Peruvian restaurant, for dinner there is a Table d'Hote for $25, but opted for simple, but delicious salad. Half chicken with two sides looks like a great deal as well - chicken smells amazing, but didn't try it.\n\nThe decore is creative and contemporary, and looks like they will be serving coffee in the morning. Let's hope this restaurant lasts longer than the previous one in that location.\n\nThumbs up!", "author": "erika s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-18", "description": "I get that this place is new, but I wouldn't come back to see if they've improved over time.\n\nSaturday for lunch - dead empty. We were the only ones there. Our waitress seemed to try, but she couldn't understand much of what we were saying and really couldn't answer our questions. \n\nRoasted corn with salt/oil and green sauce on the side was complimentary. Pretty good, actually.\n\nQuinoa Salad - I cannot tell you the number of times I emphasized dressing on the side. She really had no idea what I was saying, but in the end she seemed to understand. The salad came with the dressing already mixed in, so they had to remake it. Let me be clear - this is NOT a quinoa salad. And I'm serious, here. This is a huge pile of lettuce with about 4 pieces of chopped tomatoes, 4 pieces of chopped cucumber, sliced red onion, and some kind of flavorless cubed cheese that tasted and felt just like tofu. There is, at best, 2 tablespoons of quinoa sprinkled on top of this. Order it and you'll see. I was so disappointed. It was such a lame salad. Literally like foraging for leaves in the forest.\n\nAji de Gallina- well this was better, but not great. Comes with a small side of white rice, which is way too small to match the amount of shredded chicken (breast, which is a plus) provided. There are no vegetables other than 3 pieces of potatoes mixed into the shredded chicken. Topped with a quarter boiled egg and one purple olive (these are both also in the thick yellow sauce). For those not used to this dish, it has a very odd flavor. No complaints about this dish, no highlights either.\n\nDuring our dining experience, a few people came in and ordered takeout. One group of friends ordered empanadas and found hair on it, so they sent it back and got a new one.\n\nThe space is nice, though. Tall ceilings and has a modern airy feel.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Food is amazing.. especially the chicken. My purpose of this update is to really push you guys to promote around the area more. Unfortunately your location is a hard find if not literally walking in front of it. I've heard people in my building, which is 1 block away btw, tell me they didn't even know you existed. A lot missed business opportunities. We don't want you to go anywhere.. so spread the word about your delicious chicken!!! :)", "author": "Scott M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "Near little place and close to my hotel. Chicken has great seasoning, and the sweet plantains were delicious. only complaint was that it seemed to take a little long for food to come out, if I'd had a beer with me I wouldn't have noticed. place has a bar, but doesn't serve beer :(. they have takeout too so I'll be back", "author": "Grant S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "The solterito had GRINGO corn. Yes, the most important ingredient in a solterito (rebranded as a plain \"fava bean salad\" in the sparse menu) does not exist in Peru. I sent it back and it was returned with the real thing. The chicken was flavorful, but The rest of our food was mediocre at best.", "author": "Miryam A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "I had the chicken tamale and antichuchos. Both were muy bien!! Great service. I will definitely be back to try the jalea. The peeps next to me ordered it and it looked fantastic.  No liquor right now - I think it's in the works.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "The crispy Peruvian chicken is so good!! I also like the fried banana!! \nWorth trying when u are here at downtown Brooklyn!", "author": "Li-Yen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "My colleague wanted to try this place for lunch so we came to try it out.   The place is pretty fancy and upscale looking.   The entrance is on the side of the street.   I forgot what I ordered but it was steak and rice.  The steak was tough and not easy to chew but the sauce with rice was very very good.   My colleague ordered the half chicken.   The meat was so tender.   He really liked the green sauce.   They served a plate of corn kernels which was good.   I sprinkled it on top of my rice.   The place wasnt packed but there was a lot of ppl.   I didn't like that there was a draft where I was sitting.   Im not too sure how Mich the meal came out to since he picked up the bill but I don't think it was cheap.   I think my meal was like $15-20. Same for him.   The staff was friendly but not very attentive.   I finished my water and was hoping they would refill it.   They eventually did,  but we we're about to leave.   I would go again because there isn't a lot of fancy restaurants like this in the area.   It's a good welcome on board or farewell lunch.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Came with a few friends after work. The rotisserie chicken itself is delicious with the popcorn kernels in a green sauce. Would definitely recommend ordering the Inca Cola with your dish. The waitress was kind and very attentive to our party. Will definitely come back again", "author": "Manuel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "Good service, nice decor. Food had nice presentation but would  have loved (for instance) something sweet like apples or cranberries to balance the salt on the chicken salad (Palta rellena) or give it a kick .. Flavors overall were ok, Nothing impressing definitely need a boost (I had rice/beans(which I barely ate) and  roasted chicken) But maybe I'll give it another try and come back for their ceviches and dessert .. getting here from the subway is kind of annoying", "author": "Ingrid E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-09", "description": "Bangin lomo salteado but the service (as noted by others) is not ideal. We went in for lunch and we were the first ones there.  Our dishes arrived after other patrons (who had arrived later). The food is great... if they could bring the service up to par this place could go from good to great. If you want to make this your lunch hour spot, call your order in so they can start working while you arrive. Again the food is great, they just seem understaffed.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Love their whole chicken dinner entree. The roasted chicken comes with 3 sides and a delicious green sauce. Sides are all excellent (rice \u0026 beans, sweet plantains, salchipapas) as is the chicken. The price is right as well - $28 for a full meal for 2 (+). I just wish they still delivered via DoorDash so I could continue to order from them!", "author": "Rob L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-16", "description": "I love Peruvian food, so naturally I was excited to come here especially since it's so close to my job. The first time I ordered food from this restaurant they charged me to pick the chicken I wanted but gave my coworker the same exact pieces for the cheaper price and gave him extra green sauce without charging him. The food was average at best. Today I decided to give the place another shot and all of a sudden it came to me why I haven't been there in months. I waited at least five minutes before anyone came to the counter to help me and the restaurant was empty. After placing my order I was told that I can pick my own chicken however would be charged because it depends on what parts are available. So I opted to just gamble with whatever was given to me. I received my meal to my surprise I actually got the pieces I wanted and when I asked for extra green sauce I would be charged .30 for each extra because I wasn't charged extra for the chicken. I never asked for a specific type of chicken so to tell me I can't receive an extra sauce for the extra dry chicken that was given to me was far beyond what I could comprehend. Needless to say I won't be returning to this place and will be driving to Pio Pio or Lima instead.", "author": "Jamila A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "My wife and I came in at 3:15 (Friday 6/23rd/17) after they had already closed for lunch. I understand because I manage a restaurant in Oregon. But what I don't understand is why she told us they were going to reopen at 4:00 PM and the sign on the front says 4:15. We left and came back at 4:19 (almost 20 minutes after what the hostess had told us) we were standing at the restaurant front door looking directly at the hostess while she played on her phone and glared at us with the most unwelcome face, instead of walking the ten feet and opening the door for US!! We clearly wanted to eat!! We were starving and road a bus all the way from manhattan to try this place, but never got to try it because of a very bad customer service. It seems like the workers wanted an extra ten minutes of break. She could have at least come to the door and let us know that they were changing the opening time last minute. Or let us in and we'd have gladly waited to order a few minutes.", "author": "Jt M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "The only reason that I am giving this place one star is because their food can be described as decent Peruvian food at a decent price. \n\nThis is a new place in the up and coming popular fort greene area. I have been living here for years with no good quality restaurants so when i discovered this new place with good food I was excited. The first time I had dinner here was when it first open, short staff but very pleasant and great food. I ordered two or three times for take out. Sometime after that I came back for dinner and boy was it different! Somewhere along this short time someone told the staff and management they were a five star restaurant when they really are a two. Rude staff, under quality food, and no liquor license, I thought to myself who do these people think they are. \n\nStill I thought maybe it was a bad day everyone deserves a second chance. I planned my Graduation dinner here with a large party. I called in February, talked to a staff member said that they would be able to accompany this large party. I called in March no one had any knowledge of this, I asked to speak to the manager. Manager said that they are sorry but fixed the problem and told me to call back sooner to the date (which was in May). Called back in April and again no one knew what I was talking about, still not upset about this asked to speak to the manager (Marlon) but couldn't get a hold on him. This went on for the next two weeks both me going in and calling. I thought that he was just a very busy man. When I finally got a hold of him I realized that he wasnt busy. He was a cocky overpaid terrible manager. He was rude, condescending, and just wanted to talk about how he was both a manager and chef of the whole place. He is busy because he needs to go to Pisco events. (actual words he said to me). Owner and other staff members ensured me that everything was going to go great that day not to worry about anything. \n\nWhat ended up happening was that the day of I called Marlon to double check if everything was okay and if he talked to his staff. He ended up telling me I would have to have my 10 guest order from a pre-fixed menu that only had two items and we only had one hour for the table and that he never had a guest with 10 people order only three combos. (I never said this anytime to him). At the end of this whole thing. I ended up not going there, me and my 10 guest went to an amazing place called 200 fifth. MARLON SUCKS!", "author": "Cassandra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Authentic Peruvian food as good as in Queens, but inevitably with Brooklyn prices. Went with my Peruvian sister in law and have been back 3 times. Gotta BYOB if you want alcohol. I'd kill all the fútbol on TV, but hey fits the atmosphere.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "My girlfriend and I went here last night and we both loved it. I would have to say that the food was a solid 4 stars, but what made this place 5 was the awesome service we received. Will definitely be coming here again soon.", "author": "Olsian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Love this place for a quick bite. The half chicken with sweet plantains is my favorite meal. The chicken comes with a yummy green sauce. I don't know what it is but I want more. They also deliver which makes it super convenient.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-25", "description": "Decent food. Bad service. I live in the Oro building so it's convenience to eat/order there. However--they either get the order wrong or doesn't accommodate. They also have the most unfriendly person/people answering the phone everytime! With this kind of customer service I'm sure they will be out of business very soon as the restaurant is almost always nearly empty whenever I walked past. This area is in need of restaurants but I guess we're not THAT desperate.", "author": "M N."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}