{"aggregateRating": {"reviewCount": 227, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Went here for dinner and the food was very good. We started with grilled octopus for appetizer. It was delicious. I had the lamb shank and friend got the seafood paella. I'm a big eater but everything was a good portion size even for me. We had a couple of the drinks and they were really good. They have happy hour until 7. However, drinks were still 10 each which is kinda pricy for happy hour. Overall a good place to go enjoy some good good.", "author": "Mary W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "Review for Dine-In at weekday lunch, only.\n\nPros:  Good food, decent portions.  Bright and clean decor, very well lit during the daytime.  \nCons:  Dine-In lunch patrons are treated as second class citizens.  Lousy lunch service.\n\n\nI was looking for a nice place to have a good quick lunch with the GF, who was coming to see me at my office.  We decided on Peruvian.  The Peruvian choices in Downtown Brooklyn were Pollo D'Oro and the two Tio Pios.  Neither of the Tio Pios had great reviews, while Pollo D'Oro seemed to have good reviews on Yelp.  So it seemed like a no-brainer.\n\nMy GF was running late because parking is impossible to find in the area, so I decided to grab a table early.  The restaurant space looks wonderful in person.  Situated in the base of one of the new apartment buildings that have been shooting up all around Downtown Brooklyn in recent years, the restaurant is airy, spacious, and extremely clean, with massive windows providing tons of light.  It seems like the ideal place to have a nice noontime lunch.\n\nBut the service.  Oh, the service.  \n\nRed Flag #1\nThe hostess/manager/counter-person barely looked at me even as I waited a couple of minutes near her.  She was dressed very nicely and professionally, as if she were dressed to handle a dine-in restaurant.  But that impression is wrong.  There were multiple patrons waiting for food in the area only for take-out.  She was pinging between giving the patrons their take-out food, the cash register, and the phones to take down orders.  I finally asked her if I could be seated, and she told me that I could take any seat I wanted.  \n\nRed Flag #2\nThere was only one waiter.  He was dressed professionally, and was very polite and acceded to requests.  He seemed to work quickly and diligently upon an initial glance.  But after a while, it became immediately clear that he didn't seem to have a good plan in his head of how to properly serve patrons, or he just wasn't trained well.  For example, he gave us our rice without giving us our beans, and didn't think anything of it until we asked him where our beans were.\n\nRed Flag #3\nWhile I was waiting for my GF to arrive, I observed how the restaurant operated.  In that 20 minutes, I noticed that one party was there for at least 10 minutes before I sat down.  They finally got their food nearly 20 minutes later just as my GF arrived.  \n\nRed Flag#4\nOne party of two just got fed up with the service because they had been waiting 30-40 minutes for their food.  As they left the restaurant, they told the hostess/manager how bad their service was.  She only blinked silently in confusion, possibly because she had no idea how to handle the situation.\n\n\nAs for our experience: \n\nThe food was good.  \nThe Quinoa Salad is recommended - nice and hearty, with good greens and other ingredients.    \nThe chicken is juicy and tasty.\nThe waiter was very kind and acceded to our requests, but seemed generally in over his head.  It's not necessarily his fault, as another waiter would have definitely made things smoother.  But he still needs to learn how to work smarter and in a more prepared manner.  \n\n\nOverall, I love the big airy dining area of the restaurant.  The food is very good.  So theoretically, the two should mix well. But at least during lunchtime, the management couldn't make it work at all.  \n\nIn other words, all the restaurant really needs is better service and management.", "author": "DC C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-05", "description": "Food came quick and fairly decent taste wise. The portions are extremely small. Half chicken is the size of a quarter at best", "author": "Keenan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "They do not sell alcohol.\n\nThis place is very interesting. They have a delicious menu and a bar but they do not serve alcohol. I am not sure if they love there liquor license or have not gotten one yet but it is definitely confusing to walk in expecting a pisco sour and being given juice.", "author": "Aisha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "This is a cute place located between Dekalb Dekalb Ave and metro tech. My friend works nearby and we decided to come here after trying Forno Rosso down the block last time. We came in and were seated right away. They do actually open kind of late for lunch at noon.  The place got packed quick. \n\nThe food- we ordered the crispy roast chicken with sides. The tostones, rice and beans, and steak empandas. Everything was pretty good. The empandas were delicious and had chunks of steak in it. The chicken meat however did not have any flavor..the skin was flavorful and crispy though. My friend specifically asked for dark meat only, and when her order came it it came with  white and dark meat. the waitress gave us such an attitude after that. I brought home the leftover chicken and my bf said the green sauce is what saved the chicken meat from lack of flavor\n\nFor crappy service and mediocre food priced higher than pio pio..I think we will stick to Forno Rosso from now on when we are in the area.", "author": "Tracie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Came here for lunch yesterday.  I had two empanadas.  One beef and one chicken.  Both were delicious, and they came with a green sauce that really kicked it up a bit.  My friend had the roasted chicken, rice and beans and he also enjoyed his meal.  The empanadas were $3.50 a pop, which I think is a bit pricey, but not too off from typical Manhattan/Brooklyn fare.\n\nThe one weird thing I have to comment on is, my friend mentioned that he tried to eat there earlier in the week and they were out of chicken.  Pollo means chicken, so if you're gonna have chicken in your name, you shouldn't run out of chicken.  That's like Kentucky Fried Chicken running out of chicken...\n\nOverall, the place looks nice, I would definitely dine in.  The food is tasty, and the staff seem attentive.  Four Stars from me.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Good food- served quickly. Friendly service. Sat at the bar and the bartenders prompted the two guys on either side of me into a conversation. Unusual for me to join in but everyone was welcoming enough. In general, I love Peruvian rotisserie chicken and they met the standard. I wouldn't get their Sauvignon Blanc again but the Pisco Sour was pretty good.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Came here after a game in Brooklyn and very happy I did so. Food and service were great. It's alil hard to find cause it's on the same block as a police station but def worth it.", "author": "Brandon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "My girlfriend and I gave this place a go for New Year's dinner, and what a treat. We love Peruvian food (my girlfriend is Peruvian), and this menu is absolutely stacked with the best of Peruvian cuisine. It's more of an upscale Peruvian restaurant, but the food is without a doubt worth the price of admission. Great service too!", "author": "Cody S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "I didn't like the decor. Blue lights looked very trashy. Food was good but it was not fantastic. It was very hard to tell what kind of food from the menu, and expected to have very original food but they weren't.", "author": "Akane G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Decided to try this new spot near my sister's place in Brooklyn. The food was amazing..literally everything we had (mixto ceviche, cheese tamales, half chicken with sweet plantains). They don't have an alcohol license yet so it's BYOB, but we got to enjoy our amazing meal with our own bottle of champagne so I was not complaining. \n\nIt was so good we even came back the next night for a to-go order of sweet plantains and mixto ceviche. Looking forward to coming back - this place has definitely topped my list of favorite resturants in NY.", "author": "Katleiah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Great food.  Small selection.  Lengthy wait for food, so order appetizers if your really hungry.  Nice and clean.", "author": "Leonard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "Updated review.\n\nSadly the service and the food have both taken a dive.", "author": "Benjamin I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "I love Peruvian restaurants and I recently moved to the Downtown Brooklyn neighborhood. I decided to try this spot because of all of the great reviews. The catch of the day ceviche was red snapper and it was one of the best ceviches that I have ever had. The pisco sour was also perfectly made. The only reason I'm not giving 5 stars is that I liked Pio Pio's chicken better and it was a bit pricier for smaller portions that Pio Pio. I will definitely come back though!", "author": "Tara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Ordered take out. Whole Chicken with three sides. $28 + tax not a bad deal. On the way home (driving) the food smelled amazing. I seriously wanted to rip open the bag and devour everything in it. Got home about 30 minutes later...food traveled well...it was still hot and fresh. Chicken was delicious, very moist and seasoned just right. Also had the sweet plantains, french fries and rice \u0026 beans. Probably can feed a family of 4...I'll be back to try the rest of the menu.", "author": "Richard R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "Over the course of five visits, my boyfriend and I have had the: chicken, empanadas, avocado salad, rice n beans, French fries, French fries with hot dogs, and buckets of that green sauce. And every single thing has been excellent regardless of take-out or dining in. \n\nSome reviewers aren't thrilled with the decor, but whatever. There are enough Brooklyn-looking places all over the world now. I'm coming for the food and it's great! \n\nSo what's not so great- one of the servers. The female server is sweet and attentive enough. We recognize each other and that's cool.  I cannot however stand the male server. He is snide and basically a jerk. He snapped at me once for asking for more green sauce with a whole chicken then refused to let me pay with a credit card because my total was under $10. While on the phone placing the take-out order I asked the girl if CC payment was ok and she said no problem. Oy. And while waiting for said take-out, he got an attitude with another take-out customer about using American Express (which they do accept [or did at the time]). The reason being because the fee to swipe is higher. As the annoyed customer said 'money is money.' \n\nMy conclusion is: come for the chicken, try to get the female server, don't say I didn't tell you so if you end of with the guy who treats the green sauce like liquid gold.", "author": "Brit M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "DO NOT ORDER FROM HERE IF YOU WANT IT DELIVERED!  While the food is above average, the delivery and customer service are horrendous.  It is almost like the restaurant doesn't care about you if you do not dine in. We ordered a \"family meal\" on Seamless today. You are supposed to get a large rotisserie chicken, with sides (rice/beans, plantains, and a salad) . We have ordered here before so we know they are stingy on the sides and the green sauce but not cheap on the price. We purposely ordered (and paid for) extra green sauce for the chicken to offset what they don't give you. Not only did they not give the extra sauce we paid for but also gave us a fraction of the salad you are supposed to get. Granted this entire expensive package of food is recommended by the restaurant to feed four people.\n\nThis restaurant has a history of not giving us what we paid for (yes blame us for ordering from there again). Last time they said they would provide us a credit for the lack of food but they never did. This time I was determined to get my extra green sauce!!  After calling the restaurant 3 times and not getting the right person, the manager said he would deliver the sauce and the salad right away.  This promise came after one of the workers accused us of lying about not getting the sauce in the first place.  Who does that?  Like I'm waiting at home saying let me call this restaurant for a green sauce and salad conspiracy.  Of course the second delivery promised by the manager never came...  \n\nThe lesson for us is that while we love Peruvian food, this is not the place to get it. They don't seam to know how to run their operations and don't care about people who order delivery as witnessed by their reviews on Seamless. Learn from our experience, either go to this restaurant to eat in or get your rotisserie chicken from somewhere else.", "author": "Maurice W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "Mm.... They say they deliver but they don't. \n\nIf they're really busy they'll tell you they can't. Which kind of defeats the purpose of delivery?", "author": "HyeMi K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Placed an order through seamless, the restaurant calls 1 hour later saying they have no quarter chicken and the order is going to take another 45 minutes. They were also not apologetic, not friendly at all.", "author": "Tony E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "I came here on Saturday night with my boyfriend and mother (she's Peruvian)!  Attentive wait staff, friendly owners.  Of course service is always important and they excelled with that here.\n\nSort of a soft opening right now, they were in the process of installing a POS system so CASH only for the moment.  They are also in wait of their liquor license so it is a BYOB spot, conveniently there's a wine shop right near by.\n\nThe restaurant although small, very clean and has a modern feel to it.  It looks like it fits right in Brooklyn--the nice part of Brooklyn of course (it is located in Bk Heights after all).\n\nMy party and I started with causa rellena and anticuchos.  The causa rellena was delicious, it's one of my favorite Peruvian dishes.  The anticuchos were pretty good as well, could've been hotter though.  \n\nMy mother had lomo saltado, I had tallerines verdes with grilled chicken and my boyfriend had aji de gallina.  The tallerines verdes were absolutely delicious, I brought like 75% of the plate back home with me and ate it 2 days later, and guess what?  It tasted the same, just as delicious!  My boyfriend cleaned off his plate and my mom also had to bring her plate home.  The portions were really generous.  \n\nNow here's where we lose a star, dessert.  *sigh* Lucuma... the waitress told me it was a mousse and I thought it was interesting.  I received a puree...no, no, no, no!  We also had a pionono that I didn't enjoy very much.  \n\nAll in all, good food, prices are decent as well and service is wonderful.  Great edition to the neighborhood.  I recommend!", "author": "Yulissa V."}], "servesCuisine": "Peruvian", "priceRange": "$11-30", "name": "Pollo D’ Oro", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/AfetxF9dJsZXJi_Wj71_ng/ls.jpg", "@type": "Restaurant", "telephone": "+17188558088"}