{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Breakfast empanada's with that amazing sauce - HEAVEN. I've also enjoyed the morning glory muffins, perhaps quite a few times when I discovered they were open. (oops) From great service to a wonderful vibe/ambiance, I love coming here for breakfast meetings before work, and love that they have a takeout window (too), for when I have my pup in tow.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "My favorite Dumbo neighborhood spot.  Butler is an amazing all day cafe, and they excel at absolutely everything - coffee, pastries, breakfast and lunch menu items, friendly staff, beautiful interiors, views of Dumbo, and the list goes on.  The menu and pastry shelf are continuously changing, and I've yet to try something I didn't love.  I'm so happy to have Butler as my go-to spot.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Incredibly pleasant services, super tasty empanada, classy decor... and it's just so special Dumbo's vibe! Yes it's happy touristy place but you can truly feel New York State of mind...I would love to try their baking classes!", "author": "Yukari E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "such a cute place! The coffee is delicious and the service is excellent. I will definitely be coming back!", "author": "Melinda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "The best for everything. Breakfast. Brunch. Lunch. Coffee. The best oatmeal I've ever had.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "I wish I lived in NYC so I could come here more often. I had a medium regular coffee and their Sticky Date Muffin. It's GF and so moist and delicious!! Definitely going to come back when I visit the city again. The staff is welcoming and warm. The atmosphere is nice, too. It's small but cute with a modern feel to the interior. I definitely recommend eating here.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Went for lunch this week with a friend. While the lunch menu would be considered \"sparse\", there are excellent choices for a varied palette. The service is attentive and friendly. The prices land where you'd expect them. There's a great view. What's not to like? I'd go back!", "author": "Oliver V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Stopped in today for a mocha and a couple of bakery treats. Staff was friendly and helpful, treats were delicious, mocha was amazing, and I would definitely go back.", "author": "Florence S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "You will smell like bacon when you leave. Without fail.\n\nDon't get me wrong, we really like this place and go several times a week. But now we only go pre-shower. It's funny because our neighbors said the same thing.\n\nI assume it's an issue with the kitchen exhaust?", "author": "Nick P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-24", "description": "I enjoyed the aesthetically pleasing atmosphere and the nice employees who took and completed my order. My drink was not exceptional, but it was on par with what I would expect. Then someone who I assume is an owner/management was very unpleasant to me so I will not be returning. There are plenty of beautiful coffee and tea shops in the area that I would rather give my business to.", "author": "Julie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "If you are open until 6:00 and your menu, posted clearly on the wall states \"Breakfast - All Day\" and \"Lunch - Starting at 11:00\" maybe you shouldn't tell me at 5:31 that the kitchen is closed and \"it usually closes by around 5:00 on weekends.\" Maybe change it to say \"Breakfast and Lunch Until 5:00\"", "author": "Nykki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Had a breakfast empanada, date muffin and americano coffee.  All were outstanding.  Great location with bridge views and beautiful clean warm designed eat-in space.  Loved the brushed brass tables and rich leather seating benches. Staff was knowledgeable and friendly even though it was early in the morning.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "EVERYTHING here is delicious. I especially recommend trying any of the specials -- they never disappoint! (I'm currently hooked on the grain bowl.)", "author": "Megan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-20", "description": "Usually like their takeout window for coffee \u0026 a muffin, (because as the reviewer below said, you really will smell of grease if you go inside) but ordered a cheesecake for Thanksgiving, got home, and opened it to find a messy, childish looking thing in a tinfoil pie pan - definitely not something I can serve at Thanksgiving and not what I'd expect for $35.", "author": "tamera f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Best egg sandwich in nyc. Often the \"look\" and taste don't match but at Butler what you see is what you get. The roll was delicious as was the mayo. Both the egg and bacon were cooked to perfection. The side salad was a superb accompaniment. Across the street from St Anne's Warehouse. Ideal spot. The great views and vibe are unnecessary but are an added plus.", "author": "Lyris S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "This place is awesome.  I'm a big fan of Intelligentsia beans so I expected the coffee would be 5 stars.  The food though is what really surprised me.  I've been there a few times a week since it opened and everything from the Breakfast Empanadas, to the Berries on Toast, and all of their lunch sandwiches have obviously kept me coming back for more.  Super excited to have this place in the neighborhood now.", "author": "Kate E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-16", "description": "This place is overpriced and the food is mediocre, greasy and generally lacks ingenuity or at least anything one might consider novel or interesting. As an example I paid $19 before tip for a breakfast sandwich and a cup of coffee. Everything costs extra. I had to pay $3.50 to substitute my brioche bun (lol) for a slice of sourdough. I will just buy an entire baguette next time (or 3) and bring them for all the sad customers.", "author": "Terry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Really like the bathroom. Really chic. Food was good too, I guess. Like the coffee too.", "author": "Bathroom R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Such a cute little coffee shop right near the Brooklyn Bridge. Gorgeous decor and delicious coffee.", "author": "Hanna H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-26", "description": "Terrible, overpriced and unhelpful. Asked for a vegetarian version of the breakfast sandwich and had to pay extra for them to replace bacon with an egg (which I'm sure is much cheaper than the cost of bacon). Small portions, flat white luke warm and avocado on toast - the bread required a hack saw to get through.", "author": "David S."}], "servesCuisine": "Cafes", "priceRange": null, "name": "Butler", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/w9TYx_hSk33TYAlhNApSMg/ls.jpg", "@type": "Restaurant", "telephone": ""}