{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "My friend wanted to go to Butler as it was on her list of coffee places and I was worried it would be too small but it  had plenty of seating inside. Since it is popular it was filled but we didn't have a hard time finding a place to sit down and enjoy our coffee.\n\nChai latte with oat milk: Not too sweet and it was really good. One of the best chai latte's with oat milk I've had in New York.\n\nPecan Sticky bun: HEAVEN in your mouth. They toasted it for me and it was absolutely divine. It was so sweet but not overly sweet \n\nViews: This coffee shop is right under the Brooklyn Bridge as you can see in the picture with my latte. The view was incredible.\n\nI would definitely visit when I am in the area.", "author": "Prathyusha Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "My friend and I came here on a rainy Sunday afternoon. This coffee spot/ bake shop is definitely an aesthetically pleasing place to take sophisticated Instagram photos of yourself reading or staring off into space with a cup of coffee in one hand. Along with coffee, there are several options for breakfast, lunch, and dessert. This is a wonderful place to grab brunch with friends, complete work on your laptop, or have a nice coffee sit-down. There are plenty of seats around with a beautiful view of the Brooklyn Bridge. The service is excellent and the staff is very helpful and patient. The only downside is the price for most of the food (it is understandable because of the cost of such a prime location), but I can definitely see myself back here. ~~ 8.5/10 \n\nThe menu is seasonal. The chef behind the food is Ryan Butler. He has worked in various well-established restaurants throughout the city before opening this bake shop. There are even baking classes that are held at this location on a weekly basis. \n\nWe ordered the breakfast sandwich, breakfast empanada, morning glory muffin, and Caramelia cookie. Even though we decided on these options, all the options on the menu seemed very appetizing. When our food came to our table, we began eating, but we also noticed what everyone else ordered as well. From the coffee to the food, they were all beautiful. The breakfast sandwich is very nicely put together. The yolk of the sunny-side-up egg is perfectly cooked so you can pop it and watch it slowly drip down your sandwich. The dressing on the salad is most likely vinaigrette. \n\nThe breakfast empanada is very well made. It has a flakey crust and a good amount of filling, though my friend did mention there was not enough smoked bacon in it. The sauce on the side was bland and not particularly interesting. \n\nThe morning glory muffin is a carrot and coconut flavor. The icing on the top is pineapple and passionfruit cream cheese icing, but it tastes mostly like cream cheese. The muffin was moist inside which made it a great muffin. The Caramelia cookie contained chocolate, Macadamia nuts, and Maldon sea salt. Since I asked, my cookie was warmed up before it arrived on my plate. It was very proportionate throughout the cookie. These are great treats to order if you are willing to buy a decent $4 cookie or an above average $5 muffin. I can definitely conclude that this is a more high-end casual bakeshop. It is not your average mom-and-pops bakery nor does it look like one.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "As my first visit at Butler(tea break) i can say that i liked eveything about the place especially the decor and the Brooklyn Bridge view.\n\nTried the chocolate banana cream and it was good but too sweet for me, little over 5$\n\nDefinitely will go back to try their food and enjoy the beautiful view!!!!", "author": "Kiara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I really love this place. Delightful little cafe in DUMBO. Usually pretty busy, because it's so great! There is plenty of seating, and everything I've had here is delicious -- from the drinks to the lunch to the snacks to the pastries. Solid place if you need a quick cup or want to hang out for a bit.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "Love it here! I get to order from the side window with my dog. Best avocado toast I have EVER had. Coffee great, too! They give dog treats, too!", "author": "Jen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "I've come here for lattes a few times and thought they were good. I've wanted to try the food but haven't gotten around to it. It always smells so good inside ! \n\nThe staff are all very nice and the place is a cute spot to sit down and enjoy a few minutes of peace in dumbo !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-20", "description": "This place is going to be a no from me, dog.\n\nOkay, I understand that businesses are going to be expensive in DUMBO.\n\nBut close to $14+ for a tiny sandwich is just too much. I ordered their version of a Cubano (one of their daily specials made with pork sausage instead of ham). It was served on a pretty tiny bun, dripping in mustard mayo. It was pretty good, but because it was the size of a burger bun, I ate it in 5 minutes. That's like $3 a minute.\n\nAnyway, I will say that the space is amazing. Big windows, brightly lit. Lots of tables.\n\nMaybe just stop in for coffee next time.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "Lovely spot with a wonderful view of Brooklyn bridge. I ordered the cold brew with almond milk and sat on the couch with a mini table. Cute decor and great tasting coffee - made better with an amazing view!!", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "Such a cute coffee shop/ bakery/ breakfast in the Dumbo area. We came here before walking over to Janes Carousel with our toddler. Everything was perfect and fresh. We had croissants, avocado toast, egg sandwiches. The coffee drinks were delicious. It was not too busy when we came and there are comfortable seating areas. Toddler friendly.", "author": "Elina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "new coffee shop in the 'hood! love the little take-away window. coffee was very smooth. the dog treat for the pooch was a nice touch. will def return for caffeine fix", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "Cute little coffee shop in the heart of Dumbo. Very chic and stylish. Staff is also very friendly.", "author": "Cleberson S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "Great food and good portions for the price. I got the egg sandwich and definitely recommend! However, I will say they need new to-go coffee cups. I came with my boyfriend and both of our cups we're leaking everywhere and we had to throw our coffee out :/.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-31", "description": "Butler is a new bake shop on Water St near Jane's Carousel in Dumbo. They have a small assortment of fresh-baked tarts, breads, croissants, and other pastries to choose from, along with the standard coffee/tea/juice offerings. There is some seating inside, but they mostly cater to the grab-and-go crowd.\n\nWe decided to eat in one Sunday morning, ordering a breakfast sandwich, some avocado toast, some coffee and a couple of pastries. Overall, we weren't that impressed. Better baked goods can be found elsewhere, and the portion sizes were small for what you get. However, the worst part of the experience was neither of those things. After dining in for 20 minutes, we left the restaurant only to find that we REEKED of bacon grease from the open kitchen. You know, that stale, partially smokey, sticky, regretful smell. I don't know if their ventilation systems weren't properly functioning that day, or whether they weren't turned on, or whether or not they even have them, but we had to go home and shower/change right away.\n\nGrab something if you are in the area and need something quick to go, but skip it otherwise.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Perfect little spot\n\nStumbled upon this little coffee place in Dumbo. Hip menu items and you can sit outside. The service was wonderful. View is fabulous, you can't go wrong with that. Friendly and helpful. The coffee is good, really hip place. Lots of tech young professional people go here (I think!). Would definitely go back next time I'm in the city!", "author": "Sheelz J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-09", "description": "I tried to book the airbnb experience, \"Bake with a Michelin Star pastry chef\" and it was absolutely frustrating. After expressing my interest via message, I hadn't heard back for over 4 days. As there is no phone number for this bakery on their airbnb page, google, yelp, or instagram, I reached out via Instagram DM. Someone eventually reached back out to me, but it was too late and we had already booked something else. I responded to the dm with constructive feedback saying it would be helpful if there were a phone number or if their team could respond to inquiries more timely, to which the person replied, \"I'll pass on the feedback\". Wow. To have a company respond this way is completely unprofessional. I was and am still shocked. Needless to say, I will never set food at this establishment.", "author": "Ciarra B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-20", "description": "Yet another overpriced, soulless, corporate tourist trap. \n\nThe quality of coffee is absolutely unacceptable, and it is, without fail, served in awful disposable cups. \n\nThere are beautiful local favorites just around the corner. Let's hope all the fools and amateurs gather at Butler and lets the rest of us enjoy the really good coffee and matcha at the actually good spots.", "author": "Olga F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "We ran across Butler while strolling through DUMBO on a very cold day with our kids. The baristas were very nice and patient while we managed indecisive kiddos. The hot chocolates they made had adorable foam art that the kids loved, and they were very thoughtful with the temperature for the kids, etc. The drinks were excellent, and the baked goods were a perfect quick treat. This was a great find, thank you!!", "author": "Drew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I LOVE Butler.  Great coffee, amazing food, gorgeous setting, friendly staff right in the heart of Dumbo.  If you're looking for a coffee and snack on the run, a treat from the bakery or a full meal you'll be happy at Butler .. I am a fan of their spot in Williamsburg, and the one in Dumbo is even better.  Do This.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Lovely neighborhood cafe with interesting options-- I had a breakfast empanada and coffee, then the Tumeric latte which was subtle and perfect. Nice people, cool Euro-American vibe, not rushed, not a place to stay and work all day long (not a ton of seating) but a place for a relaxed hour-Long breakfast and coffee. Compared to the nearby Brooklyn Roasting Co, I would say the menu is more interesting here, but if you want to work all day, go there. Different niches.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I am a Butler FANGIRL. I tried the sticky date bun and was sold. I will get this again and again and again and sit in the beautifully decorated interiors with the most pleasing color palette and feel amazing. I'll be back to try their other delights soon.", "author": "Erin C."}], "servesCuisine": "Cafes", "priceRange": null, "name": "Butler", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/w9TYx_hSk33TYAlhNApSMg/ls.jpg", "@type": "Restaurant", "telephone": ""}