{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Had a cup of drip coffee and a baked good on opening day.  Both were quite good, and served with warm panache by the friendly staff in a light and airy space.  Yes, at $8 and change it was a bit pricey, but you get to dine with DUMBO's beautiful people, who seemed as happy as I was to be there.  As an added bonus, it is only minutes from the ferry landing!", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "Butler makes the most delicious pastries and coffee. I love going there for a quick bite to eat for breakfast and later in the day for one of their scrumptious sandwiches. They even have gluten free and healthy options. Everyone who works at Butler is super nice and I love the ambiance of the store. It is my new favorite spot for meeting up with friends and clients in the daytime.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "The rosemary ham sandwich here is divine. Not what I was expecting, but everything I wanted and more.", "author": "S G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Breakfast empanada is amazing! I went to the Williamsburg one for ages - this one is even better, love the space. Really good coffee too.", "author": "Georgia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I love the pastries \u0026 lattes; the staff is friendly, too.  I stop in frequently when visiting Brooklyn.  I love this place!", "author": "Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Nice and welcome addition to the neighborhood but leaving off a star because when you pay by credit card, it automatically defaults to a 12% tip and you manually have to undo that.  I do not think that is right and have never seen that elsewhere at other cafes.  Perhaps its for the tourists but not cool!!  Also, please update your website with what you actually have on the menu!  The outside ordering window is pretty awesome.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Been a regular at Butler in Williamsburg since its opening, and I'm so psyched to have some DUMBO reciprocity. Can't wait to sign up for one of the pastry cooking classes!", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Slick decor. Friendly service. Top quality coffee and food. This is my go-to cafe in Dumbo and it should be yours too.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Butler in Dumbo has amazing coffee and delicious muffins. The gluten free sticky date muffin, morning glory muffin and a chocolate gluten free are all gastronomic delights. Whether I cater coffee and breakfast for meetings or eat at Butler the service is flawless and always enjoyable. The decor is also great and everyone is super friendly.", "author": "Kai G."}], "servesCuisine": "Cafes", "priceRange": null, "name": "Butler", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/w9TYx_hSk33TYAlhNApSMg/ls.jpg", "@type": "Restaurant", "telephone": ""}