{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Im not sure what the mans name was but he was SOOOO nice!! He was the sweetest thing. He made us want another slice just to be able to talk to him.\nWhen we ordered another slice for us to split, he cut it into fourths! \nNot only that, but the pizza was sooooo good! We aren't from New York so we were happy to get GOOD pizza from there. Even the Margherita was bomb.\nDef under rated. Deserves more credit", "author": "Faris Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "This is the pizza I was looking for in Brooklyn. I ordered the meat lovers'.\n\nThe cheese is generous, greasy, and savoury with just enough salt. It was solid enough to have body on the chew but also chewy enough for an extended stay on the palate. \n\nThe dough is floppy and thin, as I prefer. The dough catches just enough grease to become flavorful in it's own right. \n\nThe Italian sausage topping was fresh, well-seasoned, and generously portioned. The pepperoni had a slight slice and enough grease to diffuse itself around the palate on the chew. \n\nI've been in a slump for New York pizza, eating a lot of low-rating Dollar slices. For a bit more Pizzetta gave me the slice I've been looking for. It's thin, it's greasy, it's savoury, the cheese is thick and well-bodied (adding interest to the mouthfeel.) The meats were well-seasoned and each carried distinct flavors and texture.", "author": "Jack M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "Solid slice in Brooklyn heights. Great range of flavors from bbq chicken, meat lovers, chicken broccoli, and the classic cheese and margherita. These last two are the most popular and I ended up going with the Margherita just to see what their take on it was like. They have fresh mozarrella with pesto swirled on too. It was a flavorful mix of pesto, tomato and cheese. \n\nMy favorite aspect was the crunchiness of the crust. Tasted fresh and delicious!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Pizza in NYC really is better in Brooklyn.  I got a pepperoni slice and a veggie slice.  It was so good, I did a replay!  The ingredients were so fresh and the cheese was so tasty.  I know they use quality ingredients.  I washed it down with a can of sparkling water.\n\n\nHighly recommended!", "author": "Steffanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-02", "description": "Even though I should know better, Piz-zetta gets four stars because it satisfies a certain craving. It's pretty much exactly what I wanted from a pizza place as a kid. The sauce is sweet. The cheese is greasy, salty, and gooey (and there's so, so much of it). They even have Yoo-hoo in the fridge and sell chocolate chip cookies that they warm up in the pizza oven. If you have a job in Downtown Brooklyn that makes you want to stress eat while regressing a decade or two, Piz-zetta might be exactly what you're looking for. Your parents wouldn't have let you get a chocolate chip cookie, but you have things on your mind.", "author": "E. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "This place is amazing and the location is great for me. I love the pepperoni slice because the sauce is delicious and the cheese melts in your mouth. The service was great too and the workers were very attentive. Anytime I'm in the area I make sure to stop by and order some food. I'd also love to say they have the best chicken rolls here and the garlic knots were a perfect addition to the pizza ! I will be back for sure.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-25", "description": "Okay. I'm just gonna fill you all in on something. This is shitty pizza. It's the most mediocre and unsatisfying slice I've had in NYC. Frankly, it shouldn't have the rating it does, especially when the competition is so much better. I think the service was adequate, and the atmosphere is friendly, but the Za is not worthy of a high rating. I got the buff chicken and since then my body has become an uncontrollable faucet of diarrhea.... so I think that says enough. Don't go here for good pizza, but if you're desperate for a slice... it'll do.", "author": "Tristan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "What a great pie! Two blocks from my hotel, Piz-zetta ranked at the top of my Yelp search for close-by pizza. I split a large meat lover's with my pal from work. The crust was flawless, sauce flavorful, and toppings delicious. The kitchen moved quickly to prepare our order. There were people ahead of us, but everything moved quickly creating no wait. Dinner was rad!\n\nThey serve medium and large pizzas, slices, and calzones. We opted for carry out though there is some seating at a counter on the left wall. \n\nThe restaurant itself is simply decorated, the prep counter with its plexiglass barrier dominating the right side. The character, my opinion, was embodied in the Brooklyn accent of the guy who took the order. As a visitor from D.C., it was great to hear that accompany the sought-after New York style pie.", "author": "Joseph E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "PIZ-ZETTA IS BETTA!!!!!!  Best.  Pizza.  Ever.  Get the slice with the sauce and pesto on it or the grandma-  you can't go wrong with either.  Lived in NY for 9 years and this is some of the best pizza I've ever had.  Now I live in DC where the pizza sucks.  I would drive 4 hours just to eat the sauce/pesto slice it's that good.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "They make one of the best Buffalo Chicken pizza.  Moist flavorful chicken,with a killer white blue cheese sauce which complements the mozzarella very well.  Pizza is cheesy and you get the buffalo wing taste.  A lot of places the chicken is always dried out and the sauce not cheesy enough probably because it was overcooked and the sauce not freshly made.\n\nIt's our goto pizza place for buffalo chicken pizza", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Very good pizza. High quality ingredients! Get them by the slice too. Get the vodka sauce slices! Trust me they're delicious", "author": "Angel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Delicious pizza and great chocolate chips cookies. It was a pleasure talking to the owner great guy and very funny too.\nLooking forward to our next trip yo NY to have that delicious pizza.", "author": "Hussain K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "One of my favorite pizza spots in this area, I believe they are now under new management. The garlic knots are amazinnggg so soft and fluffy I love them lol. I have tried a number of slices here and I don't have a complaint. They also have chocolate chip cookies that my coworkers love. Definitely recommend the place and I'll always go back if I'm in the area and craving pizza.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Yeah, this is the kinda of pizza I came to NY to eat. Feel like the mozzarella was the best ingredient and it made the whole pie better. \n\nService great. Could use a broom run through it.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Grandma slice is perfection!  The sauce, the garlic, the crust:  It doesn't get any better than this.  Like real Sicilian pizza from Palermo!", "author": "Richard S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "Update:\n\nOne of the owners reached out. From the pictures of other reviews, I think I just caught them at a bad time. I am going to stop by, try a slice, and will update this review afterwards. I am also changing this review to two stars for the positive communication. \n\nOriginal Review:\n\nThoroughly confused by all of the positive reviews. My large pepperoni pizza is sloppy, greasy, and tastes cheaply made.\n\nMaybe the person working on 8/8/18 @ 6:00 PM needs to be re-trained because the pizza in the photos of other reviewers looks pretty good/made with more care. \n\nI threw most of it in the trash.", "author": "Justin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Not much in the area so while I was searching for a convenient date night idea I found this place. It's not at all romantic to be honest, and very casual, but the food made up for that. The Grandpa pizza was SO good, got a slice and it had grilled chicken and pesto. One of the best slices of pizza I've ever had. The chicken Parmesan roll also amazing. And my husbands meatball parm delicious. Garlic knots super garlicy like they are supposed to be. We had no complaints at all. Affordable and great pizza.", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Italy meets NYC. Great old fashioned authentic pizza. Delicious crust, fresh mozzarella cheese (not substitute or low-fat) and homemade sauce. Excellent garlic knots, stromboli, spinach rolls, etc.  They also have specials (2 slices and a soda for about $7). \n\nAnd you must try their fresh baked chocolate chip cookies. Have them warmed in the oven. They won't dry out because the cookies will be wrapped in foil so the chocolate melts perfectly.\n\nNow that's a tasty guilty pleasure lunch for less than $10. Pretty good for BK.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Loved this place right when I walked in.  The man whom greeted us was out going, loud and very friendly.   But, had a little spunk to him and his east coast personality.\n\nOrdered a slice of all meat, garlic knobs and a soda to split.\n\nThe pizza had just the perfect amount of crispness for the crust.  The meat and cheese were to for for!!!", "author": "Sissy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-12", "description": "The grandma pizza is just garlic on top of bland tomato sauce with more garlic powder. Disgusting. Their pasta is good but pizza should not be garlic and tomato", "author": "Paloma D."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}