{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Excellent pizza. Had the veggie and margarita. Loved them both. Also clean inside. Friendly service.", "author": "J P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-29", "description": "Went there recently to satisfy a pizza craving. The place was clean, the staff was pleasant. The pizza was ok, but, not outstanding. The pizza sauce was somewhat bland.", "author": "Jeffrey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Best pizza place in the area! Blows Monty Qs and Antonio's away. There are no creepy workers here; like the previous establishments that I mentioned,which is refreshing! Cheap and fresh food! The guys who work there are great! Thank God I found this place!", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Food was good but the best part is the owner. A gregarious brooklyn native he makes eating in a great experience.", "author": "Madeline H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "The pizza is really good, the crust, the cheese, the sauce. The people are super, super nice. They made a mistake and sent a cheese pizza instead of a pepperoni one and promptly brought a new pizza, apologized and told us to keep the cheese pizza as well. They care and they know what they're doing. Good combination.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "I have had the great fortune of being in an elevator whrn a man was signing the praises of Piz-zetta.  He loved their pizza.  He said it was really authentic.  He raved about their spinach pizza.  I love spinach and especially sauted spinach with garlic and olive oil.  I had to go there right away and try it.  It was amazing.  The spinach was just like it had been sauted and it had been.  I asked.  I was on cloud nine.  I have been back several times this week.  I have tried theri cheese pizza, blanca, broccoli, and had the spinach again.  All were fabulous!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  Their prices are great too.  Try it, I think you'll love it too!  Enjoy!!!!", "author": "Toni C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "Love their Margarita slice!!! I have only ordered to go but it's seriously the best pizza in the area. Very very fresh \u0026 for sure doesn't look or taste like it's been sitting out all day like most places. No more $1 pizza for me!", "author": "Katrina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "The best pizza in Downtown Brooklyn / Brooklyn Heights. Everything about it is near perfect.", "author": "Richard T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "I live around the corner, and I come here way too much. It's a consistently good slice of pizza made and served by good people.", "author": "Sara B."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}