{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Decided to go here based off of reviews, and OH MAN... Let's just say I'd travel to Brooklyn just for this pizza. And I'm from Michigan. The sauce is magical.", "author": "Leigh I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Solid slices - lots of options too! We had the grandma (great sauce), a veggie, and a vodka sauce which was great. The guys working here are also super nice. We can't believe we've been down the street from them all these years and never went. Will definitely be back!", "author": "Ross F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "The best pizza in Brooklyn Heights, no question. Try the Grandpa, cool twist on a New York classic.", "author": "Prashanth C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "For me regular pizza.the neighborhood make it  more expesive.it was ok. Nothing really so fancy", "author": "Evelyn O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "We ordered delivery here and we were pleasantly surprised. Service was quick and inexpensive and the pizza was pretty damn good! The garlic knots were also very tasty! I would definitely come back here for pizza again.", "author": "Alexis W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "An Elite here said this was the best slice they have found, so figured would give it a shot.\nMy regular slice was pretty excellent.  Flavorful crust, folded perfectly, thicker but with a perfect crispiness.  Cheese was plentiful and good quality.  Couldn't judge the sauce because there wasn't enough of it.  Didn't taste pasty though.\nToo much oil on the slice, I blotted off with napkins.\nMargarita slice was also quite good! \nReally nice guys working.\nFinally- a pizza place I would actually return to!", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-14", "description": "So the manager contacted me on here then deletes the message,  I should have been refunded for the meal. It honestly was that bad,  should have gotten the pizza. \nLast week my friend ordered from here and got a few pizzas,  if I knew she was going to go here i would have advised otherwise but the pizza was very good.  Really enjoyed it,  pasta should be Completely Removed from the menu though.", "author": "Kristal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Popped in for a slice and was pleasantly surprised. Crispy crust, great flavors. Making a mental note for the next time I'm craving pizza and am in the neighborhood. I left wishing I had a good reason to eat another slice.", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Best cheese pizza my wife and I have ever had! We told the owner that we were visiting from CA and he gave us a slice on the house! \n\nWe hope to visit again! Thank you again", "author": "Sean N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "The pizza was only ok. I expected better. It was lacking flavor. I ordered takeout so I can only speak to that experience. The food was delivered quickly.", "author": "Kay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Love their baked Ziti and their Penne de la vodka, they always manage to hit the spot! I usually get mine delivered and they are always fast, if there is any mix up the owner will sort it out right away! Highly reccomended", "author": "Pierce H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-03", "description": "I simply gave this one star just because they decided to cancel my order and simply refunded my money. For no reasons! But I believe it is because of where I am located, not a kind of a snobby, rich and whitey spot, just a regular hoody that they'd rather be a jugdy bigot racist than deliver the food to here. What a waste of my time waiting for the pizza I wanted to try with my boyfriend! Now, I will never ever want to try this place in person.", "author": "Jhan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Wow. This is tasty, amazing pizza. We first ordered from here for my son's birthday party at the Transit Museum a few years ago because it was close by. Figured that if pizza wasn't that great, the 3-year-olds wouldn't be picky but as soon as I had a slice, I was WOWed. Perfect sauce to cheese ratio and sauce has great flavor, to top that. Have ordered a few times since for our kids and their friends, and it's been delicious. We're always hoping the kids won't eat it all! Need to try the Sicilian and other stuff.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-02", "description": "Apparently I need to come back for the pizza. Until then this is your pretty basic Italian joint that has a good variety.\n\nI had mozz sticks and a chicken parm hero. Solid, but really the mozz sticks came from the microwave and freezer. Maybe a flash fry, but the cheese was dry and condensed. Think it might have cooled too much on the way to delivery too. Then again they are just mozz sticks, what else was I expecting?\n\nThe chicken parm hero was good inside, but the bread was pretty dry and cardboard like. Nothing great.\n\nMaybe this one is on me .. I did order from a place called piz-zetta and I didn't get any pizza. Probably makes sense to try out their pizza and hopefully have a better experience than mine.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "I go to school in the downtown Brooklyn area and I get sick of paying way to much money for a good lunch. I love pizza but I can't stand the dollar pizza places in the area. I just wanted good authentic pizza. This place was very tasty. It wasn't pricy at all. And there was ample seating. If  it's pizza I want..here is where I will go!!", "author": "Jasmin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "The buffalo chicken slice was really good as I'm very particular about buffalo chicken pizza because it's my fave. The plan slice would have been just as good had it not had so much cheese. It was like extra x2.", "author": "Summer F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Ordered pizza and a salad a couple months ago, and the salad had pickled veggies that were so salty, they were inedible. I wrote twice (I have an aversion to using the phone no thanks to being a hotline operator on 9/11) and didn't hear back. Today, I wanted another pizza and wanted it fast, so I tried Piz-zetta again. I ordered on their website and wrote a note on the order explaining the bad salad of the previous order. They not only sent along a replacement salad, they also separated the pickled veggies, which were edible but still salty.\n\n********\nEDIT:\nAnthony from Piz-zetta called! He explained that the pickled vegetables were prepared elsewhere and that he will do something about it. Excellent. Looking forward to the improvement.\n\nThe rest of the review is mostly about these pickled vegetables, which I believe will change, so it no longer applies to the rating. Might as well explain, but keep in mind that Piz-zetta did not prepare the pickled veggies...\n********\nHow can Piz-zetta get 5 stars?\n1. Respond. Write or call back. If someone emails, just write a quick note. Say sorry and that you'll fix it.\n2. Make it healthier. Use salt with nutritional value and use less of it. Salt can always be added; rarely can it be removed. Besides, a lot of people struggle with hypertension and have to avoid salt anyway.\n\nThinking about the pickled veggies makes me not want to give more than 3 stars; I'm happy that they separated them from the rest of the replaced salad, but not happy about the pickled vegetables in general. When I make pickles, I use no more than one tablespoon kosher salt (less salty than Morton's) or Himalayan salt (high in nutritional minerals) per quart of pickles, and it's sufficiently salty. The pickles in their salad must have had at least two tablespoons of cheaper nutrient-stripped salt per quart. Rinsing it made it easier to eat, but it still tastes like cheap salt, and it made me lose some of my appetite.\n\nI ordered at 5:15pm and it arrived around 5:45. The pizza is still good. But as I mentioned, the cheap salt made me less hungry. Call me a foodie; I'd rather pay more for better quality.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "This is my go-to pizza joint when I'm in Downtown Brooklyn. I have yet to find another place that makes a margherita slice as good as theirs and it's my regular order whenever I visit. The sauce is key; I hope they never change whatever recipe they're using because it's fantastic. And the ratio of sauce to cheese to crust... just perfect. On top of that, Anthony (the owner) is super friendly with the customers and makes you feel welcome every time you come. I wish I lived closer so I could eat there more often.", "author": "Michi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I enjoy this pizza so much. The delivery service is super fast. Everything is so great about it. It's worth every penny!", "author": "Klethy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Update: was refunded right away. Owner himself called and apologized (some kind of computer glitch) and now I know they are closed on Sunday's . Still the best pizza in Brooklyn! \n\n\n\nOrdered thru website. Pizza never came. Paid with credit card and was charged. Called after waiting for a while and realized they were in fact closed. Cool but please note that on online ordering site so I don't pay $25 for a pizza that is never going to come. Sad BC I ordered from here before and always liked it but now will have to find another place . Would give 0 stars but that's it an option.", "author": "Kristin S."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}