{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Great slices, great atmosphere. Father and son operation is surprisingly effective and fun to watch.", "author": "Chris J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Really great service, good pizza. A bit greasy, the only thing changing my review from a 5 to a 4. Had a sausage and pepperoni large. Good stuff.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "GREAT PIZZA! Great! The staff is also so friendly and helpful!  The garlic knots are delicious.\n\nALl the ingredients and food is fresh, it doesn't appear it has just been sitting for hours on end.  Great new place that I will continuously revisit.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Serves classic NY slice.  Well- balanced crust, sauce and cheese ratio.  Crust can hold up on its own which is represents a NY classic!  especially when you order with toppings!  Great delivery service as well.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "When I order take out, am told it will be ready in 10 minutes, and arrive in 20 minutes, I don't need to see you suddenly start to cook my order and try to engage in small talk for the next 10 minutes. When I ask, just apologize - I'm not an idiot and I called in advance so I could avoid the wait to begin with. And when there is not a single other customer there and not another pizza being made, maybe don't stand there playing games on your cell phone the next time an order comes in. Lastly, when someone orders a \"medium\" pizza and you give them a large, the proper response is probably not \"you have to say 14 inch for us to know.\" \n\nOh...pizza was ok. Wings were garbage.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Service - Good\nAmbiance - Cool and Simple\nFood - Good\n\nWent twice. Felt in love with how thin and crusty the pizza was, second time, it was mushy and bleh,  what happen????\n\nMar/04/14\n\nThe owner himself has reach out interested to know what went wrong and I really appreciated his attitude and all owners who care this much for their business. I give them the benefit of the the doubt that my second experience may have been a simple bad day at work, and will go back one day to review once again. Until then they deserve an extra star for caring.", "author": "Ronald D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Love the guys at this place so helpful to a \"tourist\" on local recommendations. Their meat lovers was so fresh with a crisp crust.  The sauce on the Sicilian pizza was to die for!  Hot and fresh. Local place for a casual bite", "author": "Morgan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "While staying in Brooklyn,  we were guided by the concierge to this place for delivery. Pizza was delicious. Delivery guy forgot soda. Called and they said they would take care of it\nToday,  there was a credit on our card for the $2. They could very easily forgotten about it. Thanks for being above board. When we come back to Brooklyn,  we will be definitely have their pizza.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "This place has fabulous apps but their round pizzas are not good - the slice doesn't stand on its own. The grandma is the exception and should be your go to order.", "author": "Sean O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "This place is so good. I just started working around here \u0026 I've been going every day for lunch and getting two slices of margarita pizza. Delicious!", "author": "Ceanne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Yummy, cheap, big slices. A great place to fill your gut with stuff in NYC for less bucks. Nothing fancy or amazing, but it gets the job done.", "author": "Lizzy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "We've tried this pizza twice now, and both times have been basically not bad. It's sort of reliable pizza, ala cheesy and greasy. I agree with another reviewer who said the flavors are not too challenging- excellent description.  I am a little surprised that the reviews here verge on an overall total of five stars.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Awesome food and friendly staff. Took a group here from out of town; everyone loved it!", "author": "Henry Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Came here on New Year's Day and they were closed. The door was unlocked so my girlfriend and I walked in unknowing because the owner and his son were behind the counter. He told us they were closed but told us to sit down and he would treat us to some pizza on the house so we didn't have to eat sub par pizza somewhere else. Had the grandma and a piece of margherita pizza. The pizza was incredible. The best I have ever had and the service was second to none. Highly recommended stop if you are in Brooklyn!!!!", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "stopped in for lunch and was pleasantly surprised by how delicious this pizza was!! The sauce is on point and, at 3.50/slice, it was a deal!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Fresh quality ingredients. Far superior to your average slice spot. Had the margherita and highly recommend. Only thing that would elevate it further is a brick oven, but this isn't a fancy or old school spot. I'd get a slice here in a heartbeat but not a whole pie.", "author": "Joshua K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "So yummy. Had mozzarella pizza and peperonni pizza and did not disappoint. Guys working there were super nice!!! Can't wait to come back. Also very great price for quality of pizza!", "author": "Cass R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Stopped in to get a couple slices and was pleasantly surprised. This is authentic New York style pizza. Try the buffalo chicken pizza with ranch!", "author": "Greg T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "Love this place, friendly employees and great food! I use to walk past this place all the time and one day I decided to get lunch from them. Not only have I been back I recommended them to my coworkers. Very flavorful and good size portions. I paid under $10 for lunch and still had some left over for dinner. You can't go wrong!", "author": "Sam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Quick, easy spot to get a slice of pizza. Good service and nice atmosphere if you  decided to eat in.", "author": "Bernadette W."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}