{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "This by far is my best place to get a slice of pizza. Always fresh always great taste. The margarita slice has that great flavor of sauce tomatoes and fresh mozzarella. This is def a must come. Just don't come on a Sunday they are close. But hey when you sell pizza that taste this good, no need to open on a Sunday....", "author": "Luis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Best pizza around. The Grandma pizza is insanely good. And Anthony, who is often behind the counter - is an absolute gem and such a pleasure to chat with. I always leave Piz-zetta with a smile on my face.", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "the pizza was really tasty and the kids love it\n.clean place and nice people. the price is not expensive too", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Within walking distance of my hotel.  Clean.  Good customer service.  The owner was a friendly \u0026 funny guy.  They sell whole pies and individual slices.  They could use a few more options for the slices.  We also tried the garlic knots, meatball, \u0026 fried cheese.  The knots were really garlicky and buttery, yum.  The meatball \u0026 red sauce was a'ight.  The fried cheese was standard fried cheese, served with a cup of marinara.  I would absolutely come back here.", "author": "Masil M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Really like this place for delivery....can't go wrong.\n\nTheir pizza is great and their delivery is on time.\n\nEnough said.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Stopped in while on vacation and got the buffalo chicken slice, amazing!!! Perfect amount of spiciness but not overpowering. Also got a little pepperoni roll type thing that was filled with a ton of cheese which was spot on for what I was looking for. Only thing I would've changed was serving the pepperoni roll with some marinara sauce to dip it in. Price was spot on, those two items and a bottle of water was under $10.", "author": "Brian P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "One of the better pizza joints in the neighborhood. The mushroom pizza slice was perfect- the crust was thin and crusty and there was a generous amount of sauce, cheese, and mushrooms. You could fold the pizza up and eat easily eat it on the go. My pepperoni slice was also tasty, albeit a little greasy. My only minor complaint was that the crust of that slice was a bit soggy, so the eating process definitely involved more napkins! That said, the pizza here is delicious, and the service was very kind and quick. There is a decent amount of seating, and the Italian rap on the television was entertaining. I'd certainly order more pizza from here, and so should you!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Want the authentic NYC pizza experience?\nDine in at this place, great and I mean great NY style pizza.\nAfter you approach and eat the point of the pizza, fold it and let the orange grease drain off.  Repeat.\n\nThis place is on a quiet street between brooklyn heights and cobble hill.  \nYour already made pizza will be waiting for you, just point it out and they'll pop it in the oven to warm it up.  \n16 in gluten free pizza available too, just a little longer wait.\nTry the knots, thr bread and of course every slice offered when you are there.\nWant thr real deal?!  Here it is!", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Wanted some new Tori style pizza and I for what I asked for!! Amazing pizza !! A must eat", "author": "Dallas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Rarely do I give out five stars, let alone take the time out to write a review. But for this, I had to.\n\nI was craving a margarita pizza with pineapple (probably a CA thing). Not many NY pizza places carry pineapples, but this place did (extra star). Upon looking at the reviews and pics, we decided to give it a try. We got a medium for a little under $20.\n\nThere was a perfect amount of fresh sauce and mozzarella and they drizzled this green pesto sauce on top, along with the pineapples. The perfect balance of sweet and savory. The crust had a perfect crunch and wasn't too bready like most places, we actually ate all the crust (worth the carbs in my opinion).\n\nThis pie hit the spot and was exactly what I was craving. Will definitely order it again!", "author": "My T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Very, very good pizza. And fast, capable guys behind the counter. Hubby and I came here and tried a slice of their margherita, the chicken parm, and garlic knots. Great red sauce, top quality ingredients. Wish they had seating other than the high counters with stools, but still a great pizza option in the area.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "The pizza here is so delicious! I wouldn't exactly describe it as the typical New York style think crust but it's still great. The cheese, tomato, and the crust were all perfect. The best part was that everything was fresh. I also loved the service here. One of the guys (possibly the manager or owner who was wearing a hat) was incredibly friendly and funny. I appreciated that especially considering some places don't care about service at all. The prices are amazing too. My boyfriend and I got 3 slices of pizza and two bottles of water for about $12.00. I'd recommend this place to anyone. It is a must try.", "author": "Ann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Great spot for Pizza.  Fresh ingredients.  Sauce from whole tomatoes skinned. Nice owner with long heritage of pizza making.  Good cheese and lots of it.  One of the best places in neighborhood.  Also, fresh, clean, bright space, which is not common for a traditional Brooklyn pizza spot.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "Good standard pizza!! Prices very reasonable and shop very authentic. Not an outstanding piece of pizza but very comforting on a cold day. Will go again!", "author": "Romeo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "This pizzeria is doing it right! Good pizza, grab square and you're good to go.\nDelivery is timely and they have a huge selection of pizzas.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Very good (food: 4.5 stars), delicious, and very hospitable. Gave us free cookies too. Legitimate!", "author": "Kevin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "The staff is so friendly, the pizza is fresh. And the sauce is amazing! The grandma slice is really really good. Great for lunch . Def a lil gem. Oh and the prices are great! I'll be back", "author": "Natalia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Good Pizza. The service was super friendly! It's really hard to go wrong with Pizza in Brooklyn so the friendly staff makes them stand out from the rest! There were a few tables to sit inside. Other than that it's probably a take and go place. Came here on a cloudy Saturday afternoon. The place wasn't busy but had a good stream of costumers going through.", "author": "Gina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Piz-zetta deserves six stars. We came here late at night when they were closing up and they were extremely nice and made us a pie. We ordered the family usual (half cheese, half pepperoni/sausage) and some knots. All of it was absolutely fresh and delicious. Then they gave us free cookies too!\n\nThey were super nice to our kids, they told us some great stories about the neighborhood pizza places that have come and gone and we'll be back again. My only gripe is that they don't deliver all the way to my place!", "author": "Jimmy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Unbelievably amazing pizza!! Don't miss out! Fresh-- they make their sauce peeling their own tomatoes, cheese etc. \n\nSuper nice owners/ operators, good prices, very clean. Best pizza I've had in months.", "author": "Sara P."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}