{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "I've been given a challenge... find the best slice of pizza in NY.  Now, I know many people have set out on this daunting, some would say impossible task, but a challenge is a challenge!  To make it at least a little easier, I have narrowed the quest down to the best slice in Brooklyn and let me tell you... Piz-zetta was my first stop and it has definitely set the bar sky-high for the rest!\n\nI recently watched the Brooklyn nine-nine episode where they talk about how to rank a pizza joint (Watch here: http://www.youtube.com/watch?v=GqI7k6AA7LA) and although I am still not sure about how to determine \"mouth-feel\", Piz-zetta has got it all!  Delicious sauce, perfect sauce to cheese ratio, the dough was chewy, but not tough...  The best part was the service.  The guy (wish we had gotten his name!) was chatty, friendly, recommended we get a slice from the fresh pie coming out of the oven and even customized each slice for us after tossing the dough high into the air!\n\nTo be honest, I wasn't expecting to be impressed, but I was, and for many reasons.  After this challenge is over... we'll be back!", "author": "Jessie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "We were looking for a no-frills pizza joint before going to the transit museum. It was just want we wanted. Great pizza. Friendly staff. Kid friendly.", "author": "Donny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Best pizzeria in the area, and a lot better than most of the pizzerias I have been to. They have a delicious New York slice made with house made sauce, and cheese sliced differently from all the others which makes it that much better. Also it's not just any cheese, you can taste that it's legitimate mozzarella. \n\nAnyway it's a great place to enjoy some NY slices, you'll be satisfied.", "author": "Aleksey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Went here with my boo.. after class on a Tuesday night. The place was empty for a week day. I had 2 slices of pepperoni and buffalo wings, my boo had 2 slices of cheese with garlic knots. The pizza was reheated my buffalo wings were made to order and the with hot and spicy. Over all, the food here was good. We'll be back.", "author": "Shaneeka S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "Ill give the buffalo chicken pizza 4 stars. The plain only 2. I had the pizza delivered both times which does take away the beauty of it. The buffalo pizza came hot and crispy and tasted pretty good. When I ordered 2 plain pies they were terrible. Was more like the 99cent pizza on Flatbush Ave. The dough was weird almost crumbled, the sauce was a little too sweet and there was way too much cheese. The pies are very small despite ordering the large ones this time I didnt see any difference. Im sure the pizza tastes better if you get it there. I would not order from here for delivery anymore.", "author": "Paulie X K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "One of the best cheese pizza I've had till now. I liked it because they crust was thin.", "author": "Kushagra A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "I just ate 4 pieces of Grandma and I might cry with happiness. This is the closest thing to how my grandma used to make it, thin crisp crust throughout and perfect sauce.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "I was hungry for a slice so I checked Yelp to see what was nearby and it led me here. I chose a slice topped with broccoli, spinach, artichokes and cheese and I was so happy with my choice! Delicious!!!", "author": "Mary Ann U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I was in New York last month and my sister , mom, niece and I walked all over NYC and across the Brooklyn bridge we were exhausted. We were starving. We happened upon this place with a little help from yelp. When we entered no one else was in there (still late afternoon/early evening) and we took a quick look and ordered. We must've looked tired and hungry. I think the guy who helped us was the owner. After we placed our order he kindly just gave us water. He also asked my sister if we wanted to door closed (it was a little chilly and we had my baby niece). I thought that was very nice of him! The pizza was super delicious and the service was fantastic! I highly recommend this place!", "author": "Cindy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "The positives: Clean, ample seating.\n\nFood and service - meh.\nPizza subpar. This was 99cent pizza at 2.75 a slice. Lower quality cheese, sauce almost non-existent. \n\nService behind counter indifferent. A positive engagement goes along way.  A greeting? A thank you? They seemed to care less about customers -  too many other good options nearby. Avoid.", "author": "Billy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "I've ordered three times. Not good. I've had pizza, pepperoni rolls, penne a la vodka, chicken Alfredo, mozzarella sticks, wings. \n\nThe penne a la vodka tasted like a bad jar of marinara sauce. The pizza the second time around was definitely better than the first. \n\nEverything else was just blah. The chicken Alfredo had the same issue. It was just bland and not the right flavoring for sauce. Their pasta dishes aren't on point. I would prefer dominos pasta.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Best New York pizza I've had! Service was fast and the pizza was affordable.\n\nOrdered a slice of fresh mozzarella and sausage.\n\nThe fresh mozzarella was just slightly chewy and the sauce was a touch sweet with a hint of basil. A great combination. The sausage added a nice layer of spice to the standard cheese pizza. They did not skimp and every bite was loaded!\n\nWhat made the pizza so good was that it was so crispy without being overcooked. Loved it!\n\nCheers!", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Would give 8 stars :)\nThe marinara pizza so far tops all pizzas I've had in NYC and I was born here :)\nThe sauce was particularly delicious and the crust was perfect in thickness and crispiness!\n\nService was friendly and relaxed.  Loved meeting Anthony (the owner?)!\n\nCame here with neighbor and her 11 year old daughter and my 4 year old son after visiting the NY Transit Museum.  We all had a great time and not a crumb was left.  \n\nWill definitely be back!", "author": "Ali T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "This is my first time at this pizzeria and the closest pizzeria to my school (or nearest to me is 2 Bros - eh, cheap pizza but not the tastiest). I decided to stop by this pizzeria on my way back to school and I had a square 'slice'. It was crunchy and thin bottom and the cheese made it even better. I was lucky and I was able to have the corner 'slice' and the crust was suuuuuper crunchy. Even though I didn't order anything else, I will definitely come back for their square pizza!!", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "It's the best gluten-free pizza around! They're happy to make special concessions for people with 1001 dietary restrictions (ahem, me), and the pizza always comes out exactly as described. Delivery is speedy, too.", "author": "Eve L. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Ordered seamless from here tonight and was very impressed...delivery was very quick and efficient and the pizza was fresh and tasty. We tried the grandma square pizza, which had a thinner crust, mozzarella, and sauce, as well as a ton of seasonings (garlic alert!!!). Will definitely be adding this to the seamless rotation when looking for a fresh delicious tasting pizza!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Stopped for a slice while on business in Brooklyn. Great crisp crust and flavorful sauce. Very authentic a a great little spot for a quick slice or takeout.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Great pizza. Anthony with the heavy Brooklyn accent helped make the experience feel very \"New York\"", "author": "Will M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-26", "description": "Great place to just stop by and grab some food that's great price quickly. I had tried the sausage and pepperoni slice and garlic knots. They were a bit on the oily, and I do wish that the garlic knots were more garlic-y. Overall, still good though.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "Just got a pepperoni slice from here during my lunch break. Very good pizza. This will be my to go place for pizza during the work week.", "author": "Veronica R."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}