{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Omg this pizza was divine! I got the margherita pizza as is. It was thin and crispy, but still a little chewy!", "author": "Kristina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I've lived in New York my whole life. 30 years. This is up there with some of the best pizza i've ever had. I had a plain slice, pepperoni, and margarita. So much flavor and cooked at just the right temperature, so you can dig in immediately. Place is clean, staff is friendly and the prices are fair.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "The Margherita pizza had my attention at first glance. Mozzarella cheese layered between chunks of tomato sauce and sealed with a tasteful drizzle of basil oil makes this one of the best I've had! I've never been to the store but have ordered it as take out only. Arrives super fresh. This, since my last 3 visits is now a must-have, every time I travel to NYC!", "author": "Fauz H M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "So you know In Mona Lisa where Slick Rick says \"I'd rather a slice of you \" well that's the case here at this place. Shout out to the super cute and courteous cashier guy here. Also the pizza is  but I'll go back for the guy and his adorable accent. No but really. Go get a grandma slice and a margherita slice. Delicious. The quintessential pizza spot when you want a Brooklyn slice. I'll be back for sure.", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "So, I've done it.  I've gone and found a quality pizza joint that makes a mean buffalo chicken slice.  That place is Piz-zetta!\n\nLight and crispy crust with just the right amount of wing sauce, mozzarella and chicken.  This is not the type of slice that will make you fall asleep at your desk later, its not heavy*, its not 'too much.'  It's just right and you should probably order two slices.  And an iced tea**.  And have a seat at one of Piz-zetta's many counters to enjoy your lunch.\n\nBuff Chicken slice + a can of Lipton iced tea = $4.75.  My belly is happy and it didn't cost me a lot to get it that way.\n\nBonus points for the free wifi!\n\n\n*I did NOT add ranch to my slice, which they offer.  The addition of ranch dressing may or may not cause this slice to become 'heavy.'\n\n**3 cases full of drinks - Snapples, sodas, etc etc.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-04", "description": "Pizza is ok. Pasta tastes like Chef Boyardee. \nNot sure why we tried this place a second time.", "author": "Kristal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "I haven't had pizza in a while and, tonight, I was absolutely craving it! Enter Piz-zetta. After reading the reviews, I decided this was definitely the right place to go to. I ordered on Seamless - a caesar salad and a Chicken Parm pizza with a host of additional vegetables. On Seamless, Piz-zetta allows you to pick all sorts of vegetables and meats for free. I took full advantage of that!\n\nI ordered my food at about 6:58 and it arrived at roughly 7:40. Just about 40 minutes from ordering to delivery is very quick. And the pizza was absolutely loaded with the vegetables I ordered. I did order pineapple too, which wasn't on the pizza, but I won't take a star away from that. The pizza was still hot when I received it, the slices are pretty thick, full of cheese, sauce and toppings. It wasn't greasy, just really good. I was very pleased with my pizza. I could only eat one slice because it was so filling!\n\nThe caesar salad was also wonderful. There were a lot of croutons and the dressing was on the side as I asked. I did not find a lot of parmesan cheese on it but I just added my own. The salad also had tomato slices, which I thought was a really nice touch. The dressing is creamy, garlicky and delicious. Sometimes caesar dressings taste too fishy and this one definitely did not.\n\nOverall, it wasn't perfect but it was absolutely delicious! I'll definitely order from Piz-zetta again.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "I tried their cheese pizza today. It was okay. I saw there reviews and thought it'd be a very tasty slice with a lot of flavor and unfortunately I was disappointed. The pizza itself has very thick breading and was bland . This pizza by all means will not blow you away . It's just to fill your stomach up with unhealthyness. I don't really recommend this place. I also tried their cookies and There just as boring as the pizza. Nothing hit the spot for me.", "author": "Abbas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Piz-Zetta is an amazing pizza place. I always order delivery and it's always super quick. Also the pizza is amazing and taste just as great the next day. I love the classic pepperoni but their Blanca is incredible. I highly recommend you giving this a try.", "author": "Sterling E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Best pizza place in the neighborhood, and I have tried quite a few of them!!\nFirst of all, if you are the type of person who doesn't showcase anger issues over \"pineapple on pizza\" I have to tell you this place has THE BEST Hawaiian pizzas!!\nBut don't lose hope yet, if you're not that adventurous, their plain cheese pizza is plenty good too!\nLastly, if you are into mix and matching, there are a whole bunch of toppings you can pick from to make your own delicious Frankenstein pizza!!\nDon't forget the garlic knots, and definitely ask for extra marinara sauce!!", "author": "Nazanin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "After a day of walking around, we opted for delivery. Our order was completed through the Yelp app which was easy.\nA NYC cheese pizza and garlic knots was around $20. \n\nThe pizza was nice and cheesey and foldable (a must for a classic NYC pizza). \n\nDelivery room around 20 minutes. The pizza was too hot to eat right away! \n\nWe would order again,", "author": "Lea H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Ever have one of those days? The kind of day where work is a pain in your ass, the Mets lost in miserable fashion the night before, your wife realizes she's way out of your league, you're getting static from the cowards, etc. (I gotta say, today was a bad day). \n\nYou know, the ones where nothing is going your way. Well...pizza. Pizza helps.\n\nAnd Piz-zetta is here for you. They make a good slice (I like the margherita better than their standard). And they nice guys behind the counter (it's a real family biz) might see you eyeing the OBSCENELY garlicky garlic knots, and give you a couple on the house.\n\nAnd suddenly, everything seems a little bit better. Except your breath. Your breath is now TERRIBLE.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Oh, hell yeah!!! This is what I'm looking for in pizza when I come to New York! Small place, clean, fast service, friendly Brooklyn dude behind the counter. Delicious pizza with the best cheese and sauce I can remember, on a thin crust. Awesome!", "author": "Dave J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "In New York it seems common for people to talk about their go-to favorite pizza places. When I'm asked? First response:  Piz-zetta. A slice with mushroom, a grandma, maybe some knots... and don't miss their cookies and brownies too.", "author": "Oliver S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "Pizza was undercooked. Too bad -- flavors were really good. Also door left open on a cold night plus TV set to ABC Family with the sound on high equals not a great eating experience", "author": "Carl B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Excellent slice size and price. He made a great recommendation. Definitely try the vodka sauce slice, it was delicious.", "author": "Sandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "I know everyone was raving about the pizza but the pepperoni slice I got was good, but not spectacular.  Maybe it just tasted like the pizza was out for a little. But it wasn't bad. It's a nice little place with plenty of seating. Wasn't busy when I went.", "author": "Justin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Great pizza and chicken parm! Good customer service as well. The workers are always happy and into it", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "I loved the sauce on the pizza here. It was really tasty and the crust was great as well. I had the pesto pizza with fresh mozzarella and it was so good that I got another slice. Everyone working there was really friendly as well. I will definitely go there again next time I am in Downtown Brooklyn.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "My favorite pizza place. Always fresh and tasty. Try their chocolate chip cookies - one of the best cookies", "author": "Alena R."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}