{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Great pizza place.  I had the margarita pizza.  Yum, yum, yum. The guys behind the counter are very nice and cute (bonus!).  Clean and inviting.  Definitely worth your time and money.", "author": "Dee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "I LOVE their classic Margarita Pizza! Its hands down one of the best I've had. VERY tasty red sauce with fresh Mozzarella. I'm not a big Pizza person but I frequently find myself craving a slice\n\nOwner is also super nice! Great friendly staff", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Needed a place to eat that delivered to the Sheraton late night. Found these guys with fresh pizza and a bomb chicken parm hero! Check them out.", "author": "Abdul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Great thin crust pizza. Fast delivery. Will order again.", "author": "Goran T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "I ordered a pie : half pepperoni and half spinach+black olive ...I ate the whole pie that night so that tells at least it taste good lol...and they were super nice...\"I'll buy that for a dollar\"", "author": "Joel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "FAST/ON TIME DELIVERY: Super nice bike delivery guy who seemed to take the freezing wind in stride! He even held the door open for me as I went back inside - extra points Piz-zetta for employing gentlemen. \n\nINCREDIBLE PIZZA: I got the Margarita Pizza - hot and delicious (the whole tomatoes mixed in the sauce is pretty clever - it adds bursts of juiciness as you chow down, without making the crust soggy. And mmmm, the crust!\n\nTHEY GO THE EXTRA MILE: I didn't see ranch dressing listed on the site I ordered from, so I mentioned it in the notes that if they had ranch, to please add a side. They delivered as requested - and really good ranch at that ;) \n\nFresh, hot, \u0026 fast - I'll definitely be ordering from them again!\n\nTime for seconds...", "author": "Laura K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Just starting this out by stating: I am not a pizza aficionado.  You know the type.  They have a million opinions about every single pizzeria in New York.  I'm a Midwest girl who's been in the city long enough to appreciate good pizza, but a pizza is a pizza is a pizza, am I right?\n\nThat being said, I do genuinely love the grandma slice at PIz-zetta.  I've always preferred a thinner, crispier crust and the grandma does not disappoint in that aspect!", "author": "Christine H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-28", "description": "After reading the reviews for this location and being from out of town, I was really excited to try a local, authentic pizza joint. After a long day of work (8 pm) I decided to order a pizza for delivery and got 1 half Margherita and have Bianca pizza. They told me it would be an hour, so at the hour and a half mark I called to check on my pizza. The pizza hadn't been made yet and in return I was offered a cookie for my long wait and told it would be another 15 minutes which then turned into 30 minutes (10 pm delivery). Once I got the pizza, I don't know if it was thrown together this way or if it was the delivery service, the Margherita toppings were slid over off of half of the pizza. The flavor of both were good, but it was mostly mush that I ate with a fork. At that point I was hungry and just ate it as I couldn't wait any longer, pregnancy will do that to you. But I was very disappointed all around in this business. I gave a two star only because the flavor was good so maybe there's more hope of you go in person to eat here.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "Super fast delivery.  We tried the Meat Lovers pizza and enjoyed it thoroughly - the crust and sauce were really good, just the right amount of cheese and meats.  Prices were very reasonable.  \n\nWe also tried the 'meatballs' and a saled - both were good, would order the meatballs again, they were great and a super value at $5.00 for  6 meatballs in sauce.  I liked that when I included a note for a side of anchovies, they confirmed back immediately that they received the special request.  \n\nThe deliver was very friendly, and super fast -  we would definatley order from Piz-zetta again.", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "My husband found this place by accident a couple of weeks ago stating it was the best pizza he's had in NY.  I clearly had to find out for myself so he took me one night and I Must say, it is really really good stuff. We liked it so much we brought my mom, step-dad and aunt for lunch.  They were so nice and attentive, even gave us some pep and cheese filled rolls on the house! I def recommend giving these guys a try, you will be hooked like we are!", "author": "Bella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Unbelievable.  A pizzeria that really makes sauce with real peeled tomatoes and fresh mozzarella!  What a treasure.  I took my slice back to the office for a lunch time meeting and I had a lot of envious states .You can really taste the difference in the quality of the sauce.   Their signs boast that the pizza is made with love.  #true story", "author": "Dawn D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "This place is ok. Nothing special. Why they have a 4.5 star rating is beyond me. Not saying they're bad, but absolutely run of the mill. Perhaps, the other take out places in the neighborhood are worse. They are better than the cheapo dollar pizza places (though not by very much.) They are certainly not as good as the upscale pizza places, but it's not fair to compare with those as they are way more expensive. To give some specifics, their sauce is very sweet. It's not sweet to a disgusting extent, but it's the only flavor of the sauce, and I would be shocked if it was accomplished with anything other than the addition of sugar. The crust is not as thin and crispy as a traditional skillfully made NY pizza. This is not necessarily a minus for me as it was not a bad crust. There is a lot of cheese which is a plus in my book.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "We've brought groups here for the past two years when we are in Brooklyn. We love the pizza, and the guys running the place are great. We have people in our group who have serious gluten issues. Piz-zetta was very knowledgeable and provided the best gluten-free pizza our friends have ever eaten.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "What a pleasant surprise.  We ordered delivery, got a grandma pie and a white pie (with spinach added on).  Both were great!  \n\nDelivery took a long time but at least they called to let us know they were sorry about it.  \n\nPrices were reasonable.  \n\nThis is a great alternative to Sottocasa's brick oven pizza -- not quite better or worse, just different.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "I did in fact give them another chance and I was very happy. The pizza was great and their stuffed shells are awesome. Delicious sauce. If you don't want undercooked pizza, tell them you want it well done- I did and it came normal", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "My hubby visits Piz-zetta all the time.  He loves it and so do I.  The owner who runs this joint  has really great stuff and he is friendly, too.   I like their veggie slice with real garlic and their garlic knots.  My hubby likes their pepperoni slice and the eggplant parmesan hero.  It is huge and tasty. The shop has some seating enough for at least ten to fifteen people.  Plus, it is really close to transportation: Borough Hall train station (2/3/4/5).", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Fast service, and delicious pizza. Gotta love good and fast pizza delivery!", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Overall positive first impressions of Pizzeta\n\nI think I meant to order a Margarita slice but mistakened it for the Sicilian slice.  But that's okay because I think that was the best Sicilian slice I've had. I love how crispy and garlicky the crust is - the cheese and sauce also taste very fresh.\n\nService is great too...the gentleman who served me offered me the corner slice even though I didn't ask! \n\nI dont eat pizza too often but I definitely would return here if I'm by the area.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "Great traditional Italian pizza (no fennel here) done right. Prices are pretty good too.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Very good pizza! Nice and clean place with a very friendly and personable staff! Good spot to bypass all the fast food junk on Court street and still a nice quick meal on the cheap.", "author": "Ashley T."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}