{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "This place is great! The guy working there was very friendly and accommodating. He made us a single slice of delicious white pizza when they had sold all of the other white slices. It was so good with tons of ricotta, just as it should. He even let us pay with a CC for the single slice, even though it was below the minimum. Would definitely go back and I definitely recommend!", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "One of the best pizza places in the neighborhood. The sauce is so fresh and cheese is to die for. The margherita pizza is the best here, to the point I can eat a whole pie by myself. Honestly if you want authentic New York pizza, please just go here! You won't be disappointed!", "author": "Christi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "I stopped by here for a work lunch, and this pizza made me want to curl up and take a nap afterwards.  Which is a good thing.", "author": "Chung W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Nice crispy crust and good taste.  If Piz-zetta were located outside of NYC, I probably would've given it 5 stars because the crust is that good.  However, there is just too much competition in the City, and 5 stars should be reserved only for pizza places that have a unique qualifying factor beyond a nice crust that sets it apart from the rest.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "As a former Chicagoan, I feel like I know pizza and the pizza here was great.  The employees were also nice and accommodating.  Definitely deserves 5 stars.", "author": "K G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I lived next door to this place for a year. It took a few months for me to try it after watching the previous owners try and fail to run a pizza shop at this location. Everything at this place is excellent -- the pizza, the pasta, the homemade soups. It is just about as good as this kind of inexpensive pizzeria can be. I miss being able to run down and pick something up here.", "author": "Wesley Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "This pizzeria made a good first impression. The delivery was fast and the food was hot when it got to me. I ordered the baked ziti with meatballs. It was delicious and tasted fresh. The tomato sauce was nice and light and the meatballs were great. The bread they served on the side was nicely toasted buy also soft in the center just the way I like it. I can't wait to try something else next time.", "author": "Danyiell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "OMG best pizza I've had in a long time. My family was visiting so we ordered a couple of pies. My family loved it. Also it was delivered quickly and was piping hot.", "author": "Doe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "I was in the Court St. area and close to eating my own arm when I pulled up the Yelp reviews on Piz-zetta. I'm not a pizza connoisseur or anything like that but holy hell... this place makes a delicious slice. The service was friendly and the restaurant is pretty much pristine. My only complaint? I wish I lived close enough for delivery. Ha! :)", "author": "Aziza W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Really great owners, made us a pizza before they closed. I'm from out of town and I wanted a damn good slice of Brooklyn pizza, not thin crust, and this hit the spot!", "author": "Chadwick V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "A pizza is a pizza, right? NO!!!\n\nAnyone who has any idea of what good pizza is knows that it all comes down to one main thing - the sauce. This pizza is really just to die for. You can just tell that the food is just really fresh. \n\nAside from the traditional \"regular\" slice, their grandma pizza is really second-to-none. I can  imagine myself eating a whole pie of that without blinking an eye.\n\nLastly, the staff was ridiculously helpful and just made you feel like you've been a regular customer forever even though you just walked in for the first time.\n\nThe only downside? I don't work closer!  Bottom line - go check it out and thank me later.", "author": "Vincent F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I couldn't wait to write a review... So I decided to write it while I'm sitting I'm Piz-zetta's... I must say that this pizza is one of the best... The garlic knots are to die for.. Great sauce too. Only down fall is... There's not one on the west coast. If I make it back to Brooklyn, I'll be stopping in again.", "author": "George V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Whoa Whoa Whoa\nJust ordered delivery from here. It came piping hot and is DEEEE-licious. I got the amazing Margarita pizza. The crust is great. The sauce has got to from fresh tomatoes and the cheese definitely real. They are operating on all cylinders. Will have to dine in next time. \nWhoa", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Really terrific pizza. The ingredients are top-notch (great, great sauce; generous real cheese; superb crust-- you can taste the semolina but the crunchy/chewiness ratio is ideal). Some of the best pizza I've ever had, and I'm from Brooklyn and have been eating pizza for 50 years!", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "This slice joint is much better than most random pizza places that pepper the greater New York area. The cheese is salty and melty, and the slices are well-topped. Prices area reasonable, and the service is friendly.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-24", "description": "I came here expecting better for a NY pizza joint with such good reviews. I got a slice of chicken broccoli and a slice of margarita, the  latter was much better and more authentic tasting. Regardless, both slices had a good crust. This place would be comparatively much better if it weren't in such a great pizza town", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Looking for a quick bite after visiting the nearby transport museum we stumbled upon this little place. I loved it! Made me feel as I was in Italian Brooklyn, good service, nice atmosphere. Both pizza and ziti marinara were great and good value.", "author": "Emiliano C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Closer to 4 1/2 stars but not quite 5. I had the Sicilian slice, and asked for it extra crispy which the man behind the counter was happy to oblige. The thing that stuck out to me, besides the pizza, which was well above par, was the service. The men behind the counter were very polite and happy to help myself and any other customer that walked it. Also, the pizzeria was definitely cleaner than most. I will definitely be back, as I take classes just around the corner. Happy to have found a new regular spot!", "author": "Erin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Best pizza in NYC!! This a go to spot. You won't regret the trip. The owner is also really personable. Definitely will come back on my next trip to Brooklyn!", "author": "Ariana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "At first I felt bad coming here because I always thought My Little Pizzeria on Court St was my \"go-to\" pizza place, but after the pizza I had today, I don't feel guilty anymore!\nThe Margarita is so delicious! Nice, thick crust, fresh thick mozzerella and tomato sauce. Absolutely delicious!  I've also had garlic knots which are very tasty. And their chicken  parm sandwich is also very good. They use strips of breaded chicken and lots of cheese. The best part of this place are the very friendly workers who always smile and are cordial with every customer.", "author": "Aisha J."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}