{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "What a treat after a long day of being a tourist. The fact that they offered free delivery to our hotel was great plus. We ordered NY cheese pizza that was very tasty. (8 slices to a large), garlic knots (just to add more food because well...teenagers.), a sausage \u0026 peppers roll, and an eggplant roll. The rolls were delicious, especially the eggplant because it was different. The sausage roll was equally tasty and satisfied the teens as a more \"pizza-like\" experience. This fed my fam of 4 perfectly after a day walking all over the city all for $40 delivered w/tip. Yes please. \nSorry no pics. We were hungry.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "I know some slices that are better\nBut I still love the food at Pizz-etta\nI might bring Barbie here\nMaybe after a beer\nWhich somehow makes her get even wetter\n\nIf you take the pizza from this place then you must be taking the pizz... etta. By the way, I'm already here, what's your ETTA?\n\nExtremely friendly and enthusiastic employees at this pretty good Pizzeria in downtown Brooklyn. It wasn't one of the best places I had in the city but it isn't one of the worst either and although the slice itself is probably around a 4-star when you add on the very enthusiastic employees and the fact that this particular neighborhood doesn't really have a lot of pizza then I think it just about deserves 5", "author": "Fox E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-29", "description": "I come here every once in a while with my coworkers when I get the pizza craves since I work in the area. My go-to slices here are the margherita and the sausage and pepperoni, I mean they always seem to do it right here with those two slices. \n\nLove how the margherita slice has this drizzle of the pesto sauce across the slice which goes amazing with their tomato sauce. Not that many places do the margherita slice like they do it here and it's arguably better than most of them. The sausages and pepperoni here is just oozing with mozzarella cheese and always STACKED with the sausages and pepperoni. Definitely worth it cause I always leave feeling full after those two slices. The crust is decent, nothing outstanding there but definitely folds nicely and is the thin-ness of my liking.\n\nStaff here is very friendly and greets you the moment you walk in. Great hospitality, great pizza, what more can you ask for? Definitely stop by for a quick slice.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Authentic Brooklyn Slices like back in the day!! I literally have been walking around looking for pizza that taste like this! The sauce is not sweet,\nThe crust is not gooey but crispy and the cheese/sauce ratio was perfect!! I only had the plain slice but I'm bringing all my friends here just to get a slice or two!!!", "author": "Deanna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Piz-zetta is my go-to spot for pizza delivery. Easy to order online via Seamless or their website directly (they usually offer promos codes too). Delivery is incredibly reliable and FAST (I mean FAST!!!). The pizza always arrives way ahead of schedule and comes out steaming hot (as if I were to sit down and eat it there). The pizza has great flavor on top of a chewy crust with a generous amount of toppings too. Pizza isn't too greasy either so you don't feel terrible after eating. This place isn't a fancy sit-down, however, a solid place for a pizza delivery, takeout, or to stop in for a quick slice.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-21", "description": "Really awful pizza, cheese was completely off when it came to me. They should be checking the pizza before it makes it in the door to me. Never again.", "author": "Court K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "Yum! Great pizza, great price, great service. I ordered a slice of cheese and a slice of pepperoni. The pepperoni was good, but the simple cheese slice was incredible! I honestly don't know what they did to make it taste so good, but it was. We also split a round of garlic knots, which were extremely garlicky and hot and fantastic.\n\nIf you are looking for a cheap place for lunch after visiting the New York Transit Museum, definitely give this a try. You won't be disappointed, although you may find other museum-goers having lunch with you. We had a rousing conversation with a little boy and his toy subway train!", "author": "Deb G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "One of the many stops on a recent food crawl, this was a planned stop, especially with a handful of kids in tow.\n\nCharming place with a simple, laid back feel and courteous staff. Ample seating up front. Generally well maintained environs though nothing fancy as far as the decor. \n\nThe slices we ordered were devoured. Not because we were super hungry but because the pizza was just plain good. Nothing fancy, just well executed preparation, quality ingredients, and great taste. This is what I expect when it comes to genuine, top notch NY pizza: just keep it simple and wow me with the flavor. If you do that, I can overlook other shortcomings. They did that. I was happy.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-29", "description": "I work near by and always pass by at lunch. It's quite crowded. Decide to give it a shot based on yelp reviews. Pizza margarita is delicious. The pesto sauce adds lots of flavor. The sauce has chucks of tomatoes. I can't wait to try the other slices. The place is big with plenty of seating area. Free wifi.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "Had the pepperoni slice- it was regular \n\nDidn't care for the crust. And had to add more seasoning to make up for the lack of cheese toward be crust.\n\nWasn't horrible. I'd eat there again. There were pies that looked a bit more appetizing, so maybe those slices are why they get a lot of positive reviews. Idk.", "author": "Rashon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "We've been on the search for some great  pizza and Piz-zetta hits the spot. It's a small family run joint with great pies \u0026 slices. Today I was flying han-solo, so I just got a slice of margarita! \n\nThey also have bottled sodas  and lunch  specials. If you're in the mood for something else they serve pasta  and salads as well.\n\nIf only we could actually watch them making the pies...and no public restroom", "author": "Amy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "I loooove this place. I've only ever ordered takeout or delivery, so I'm only basing this review off the pizza quality itself and, man, this pizza is perfect.\n\nIt's a pretty thin crust, but the edges are a decent thickness - the perfect balance. The sauce to cheese ratio is perfect as well, and they don't skimp on the cheese. If you're looking for a solid buffalo chicken slice, you HAVE to come here. It's the best buffalo chicken pizza I've found in the city so far and I don't say that lightly. The plain cheese and pepperoni are also solid choices, and the prices are pretty standard all around, especially for the area. \n\nCan't recommend this place enough!!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "I. Love. Pizza. \n\nWith that being said Piz-zetta is conveniently located near my place of employment. They have seriously upped their pizza game as of recently. They have tons of specialty slices like BBQ chicken, buffalo chicken, chicken and broccoli and broccoli and mushroom. (I think you get it by now.). They also serve desserts like brownies and cookies. This is a must in an area where there's a pizza place on every block.  Usually I would go to one of their competitors (I won't mention who) but since it's so close when I'm feeling lazy I love coming here. \n\nThe staff is awesome, they have plenty of indoor seating, and the food is always fresh. It can get pretty packed around lunchtime during the week but they move super quick too. \n\nAnother helpful tip, pick up the coupons by the register on your way out for 15% off, we can all stand to save some extra $$ and put it towards food.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Piz-zetta Pizzeria is a perfectly fine pizzeria.  \n\nThe service was curt and quiet as expected from a random New York pizzeria. \n\nThe place seemed clean.\n\nThe slices I tried were tasty, though not worth going out of one's way for.", "author": "Dimitrios D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I honestly love this pizza spot so much and I am absolutely blessed I work right by it. My go to slices are the vodka slice, chicken chipotle slice, and the margarita slice.  Brooklyn pizza at its finest !", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Passed by on way home from work.  Their plain cheese slice was $2.70 and was nice and cheesy. And they leave out lots of oregano garlic chili flakes for you to shake on. I decided to eat in rather than take out because the place had a good vibe. The radio is on and people are friendly. I look forward to coming back again.", "author": "Holly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "Super friendly joke cracking owner and quality pizza! Veggie slice, meat slice and margarita were great. Lots of meat and crispy crust.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Amazing pizza in Brooklyn. Small shop and they do deliver. This is my second time here. My first was in Feb last yr. And you see I made it a point to go back", "author": "Irene T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "Solid New York pizza. I tried the standard cheese slice and the Sicilian. Both were good. Quick service. Seems like a nice shop.", "author": "Vegas K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "Good solid slice! I ran in here to grab something quick before a meeting. The location is convenient to lots of places and transportation. The prices were very good, comparable to most places now. There's some seating with a few tables and a little bar type table in the front. The guy at the counter was nice and accommodating. It's definitely on my list of places to drop in when I'm downtown.", "author": "Suriyati B."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}