{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Mostly love this place. I work across the street and have been coming for years. The pizza is fresh and the store seems clean and well run. My only complaint is that the mushrooms are preserved in a liquid that makes them a little rubbery and soggy - and that sometimes they don't put the slice in the oven long enough but that's easily remedied by just asking them to cook it well done. The staff is so friendly, has a family feel, and prices are reasonable and fair. Their Caesar salad is good too. If you're looking for a slice or a salad, highly recommend.", "author": "Phillip G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "This place is a great find! The pizza is fantasic - thin, crispy crust with chewy, amazing sauce that tastes like San Marzano tomatoes, and savory goody mozzarella. The margarita was one if the best I've had - has fresh mozzarella alternatively under and over the tomato sauce plus a drizzle of basil oil. My son loved the pepperoni pizza (which he almost never eats despite asking for it) and told me that I should get it the next time). And there will definitely be a next time! \n\nFYI, no restroom, good amount of bar seating (no tables), and decent lunch specials from $5-$8 (including drink).", "author": "JK S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "I've ordered from here a number of time and always love the pizza however I had to give 4 stars because it wasn't cooked the way I asked and ordering a pie should come with more that 1 plate", "author": "Marie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "I love their pizza. What more is there to say? For me, perfect balance of sauce, crust and cheese, excellent seasoning. Reasonably priced neighborhood slice and pie shop. Nice guys who run it too. Throwback to when NYC was a small family business time. Happy to shop and recommend this place.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "The Grandma Margherita is a solid choice. I got delivery so I can't speak for ambience, service, or wait time, but they were quick and the pizza was better than some others in the area that also deliver. One star off for forgetting  the marinara for the garlic knots even after we called to confirm it would be included. However, I will definitely will order again because the pizza was really just that good.", "author": "Emily I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "I wish they let us give 1/2 stars - I'd give Piz-zetta 4.5.  It isn't the best pizza I've ever had in my life, but the Buffalo Chicken slice was sublime!  It's now my go-to pizza topping, and you just can't find it any better than here.  The slice is not only drenched with buffalo sauce, but also drizzled with ranch!  And this is no mamby-pamby buffalo sauce - it really has a kick to it.  If you like Buffalo wings, you have got to try this!", "author": "Karen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Love them!!!! I sent a few pies and appetizers to my sister for her birthday as a surprise to share with her office. She works in downtown Brooklyn, and I am not familiar with the area, so I called 4 different pizza places to put my order in before I landed on Piz-zetta. \n\nThe reason for the multiple attempts? I wanted them to write a birthday note on the box and explain that it was a surprise and I wouldn't be there when they were delivering the food. I also always ask employees if I've never eaten there what the best items on the menu are. All the places I tried before Piz-zetta either didn't understand what I was doing or got frustrated when I asked for suggestions. \n\nGoing on customer service alone, I give them 5 stars. They completely got what I was doing and made suggestions. But on top of that, my sister and her office RAVED about the food and that they'd definitely be ordering from them again!\n\nI ordered her garlic knots, bread sticks, margarita pizza, eggplant, and veggie. She loved everything!", "author": "Pamela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I really liked the pizza I ordered from here. I didn't give it a 5 because the pizza was thinker on one side than the other and it made the thinner pieces taste a lot different. I ordered the grandmas pie and was really pleased with the flavor. Definitely a place I would order from again and hope that the pizza is more even. My friend has the plain pizza and she was happy with hers as well. We also ordered mozzarella sticks. Not the typical ones you get but they were still good. Overall happy with our experience.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Their \"Grandma\" slices are the best you'll ever have. And their garlic knots? To. Die. For. Seriously. I've had lunch here three times in a row. On one occasion, as I was paying for my pizza and garlic knots, another patron came in and professed that the grandma pizza slice he just had a few minutes prior, was so good that he had to come back and get another one. We started chatting and he informed me that he is a native New Yorker and that this pizza was one of the best he's ever had. Listen. As a transplant from Los Angeles, I felt validated by this new friend of mine. We know how native New Yorkers feel about their pizza. I don't really know what they do to make their pizza (and garlic knots) taste so good and so fresh. But in all honesty, I don't really care. I'm just content knowing that when I want some good pizza, I know where to find it. And it only took 15 years of me living in NYC to do so.", "author": "Nneka U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "My wife and I found Piz-zeta on our recent NYC trip. Best pizza we've ever had!  The crust, the cheese the toppings. If you're looking for authentic New York pizza  Piz-zetta is a must! Owner was very friendly, told him he needs to expand in Dallas, TX!", "author": "Cleveland W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "If you're looking for basic/traditional everyday pizza, Piz-zetta is your place. Fresh ingredients, fast delivery. Reminds me of the old school pizza parlors I grew up going to throughout NYC.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Great pizza at very affordable prices. Whole family loved it. Crust is not to thin or thick, and has a great texture. Excellent sauce. Loved their meatball topping. \nMust try!!", "author": "Ana E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "This is probably the best slice I've had between Prospect Park and the Brooklyn Bridge. The crust had a great flavor and shattered when I bit into it, The sauce on the margarita was rich and had a great meaty tomato flavour. Piz-zetta is definitely going in my rotation.", "author": "Chase G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "LOVE this place. I discovered it last year and have been hooked since. Every chance I'm in the area, I have to get a slice! The sauce is ridiculously good. This is what a slice should taste like!", "author": "Jamie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Not a bad slice at all. I'd ask them to make it extra hot because it wasn't super warm. We had a grandma and a margarita slice. Grandma slice was excellent, margarita slice was pretty good. The pizza was nice and crispy. I'd come back, it's a solid slice and not too expensive.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "This is one of my go-to delivery spots in downtown Brooklyn. The pizza is great, and the service has been excellent. My favorite is the standard margherita - so much fresh mozzarella!", "author": "Sheela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Best gluten free pizza out there! I get it 'well-done' which helps with crispiness and taste. The guys are so nice, too.", "author": "Grace D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "I was staying right around the corner and it took them more than an hour to get to us. By the time we got our food it was cold. The pizza was delicious but I wonder if I would have eaten as much if I hadn't been starving. The garlic knots were ice cold.\n\nAddendum: The owner called me the next day, apologized for the food getting to us cold, and offered me my next meal free. So customer service gets a huge freaking bump. Sweet people there.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "I had the pie delivered to the room, they are super fast. The pie was descent, had good flavor. I would recommend trying if your in the area.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Great pizza and friendly service. They use fresh ingredients! You have to try their margharita slice, it's the best! The restaurant is so clean, too. They even have free Wi-Fi!", "author": "Nicole G."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}