{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "A friendly staff readily serves a limited but plentiful selection of big guilt-inducing greasy slices of delicious pizza. Front Street has a bigger selection and is more NY Style, but these slices are far richer with far more flavor. I enjoyed it and will find excuses to come back and feel guilty about gorging delicious pizza again.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Excellent pizza and the cookies are great!\nThe guys are very helpful and the place is clean and comfortable. I'll be back!", "author": "Fred F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "I am a tough critic when it comes to pizza. Boston Italian guy... I can be real critical when it comes to pizza and this place is legit. It's good Sicilian style pizza. If your looking for a $1 slice, u won't find it here. What u will find is good pizza at decent prices. \n\nTip: check in there to get a BOGO 1/2 off deal.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Real good pizza. Both thin and Sicilian, but I only got thin: Margherita and veggie. The mushrooms could've been better, but overall, good hot pizza with nice service and clean space.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "After a long and STRESSFUL day of apartment hunting in NYC, I'm SO glad I came here before they closed. The owner is AWESOME and the pizza is to die for. My sister had a slice of Margherita and I had a slice of GrandMa. BOTH WERE DELICIOUS! Eating this pizza was a great way to end a hard day. COME. HERE. NOW!", "author": "Tameka G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Pizza here is very good and so is the service. Catered from here before for a small event and they delivered very quickly. The delivery guy even helped me carry the boxes and bring them into the event room. They also provided plates and napkins for free. The owner/manager with whom I placed the order was also helpful and friendly.", "author": "Tamanna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This is what pizza used to taste like everywhere in New York back in the day.  Perfect combination of everything; cheese, oil, sauce, thickness of crust.  All super fresh and high quality ingredients, served by the slice, if you like.  Not pretentious cracker crust with a few basil leaves, not expensive \"designer\" pizza like Co., just perfect, oily, New York pizza fresh from the oven.  The staff is local Italian and best of all, the price is reasonable.  Best pizza in New York for the price, and you don't have to wait in line for an hour.", "author": "Armand L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-28", "description": "Went back. Very friendly service and OK pizza. \n\nI've got to disagree with Yelper Vincent F...who says that it's all about the sauce. The sauce here is good but there's way too much of it...the cheese just floats on top and slides around. For me, it's mostly about the crust (kind of bland here) and the overall combination/ratio of crust to sauce to cheese...which for me just doesn't work here as much as I'd like. Sorry, Vince.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Went onto Yelp to find a pizza place around Brooklyn heights and we are sure glad we found Piz-zetta! We ordered the large Margarita and Meat lovers pizza; both were delicious, generously portioned, and had the right amount of toppings to crust. The tomato sauce was perfectly seasoned and ingredients tasted fresh. Plus, the owner was really friendly + kind, which made our first experience of ordering Pizza in NYC that much better.", "author": "Annie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-04", "description": "Nothing too crazy. The pizza didn't look very appetizing, but was actually pretty tasty. Very nice owners.", "author": "Ivan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "The lasagna pizza was unique and delicious. Doesn't get the 5 star because I reserve those for \"must eats\" but this is definitely something you should try if you're in the area, say after exploring the NY transit museum", "author": "Shehryar M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Delicious pizzas ! We had Barbecue pizzas, a Bianca pizza and a Pepperoni pizza.\nNevertheless the Bianca pizza might need a little more spice because the all cheese combination makes it a bit flavorless.", "author": "Lucie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Very good pizza. Been ordering from here for a couple of years now. I'm partial to the roni and chicken parm pizza, cheese does the job as well.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Ordered the cheese slice and it was heaven. Thin and crispy crust topped with a good tomato base with a hint of basil (you can go crazy and add more dried basils if you want) and good mozzarella! And it was made fresh and hot from the oven!", "author": "Elenna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Great Brooklyn pizza. Thin, light, crispy crust, tasty sauce. It has been a long time since I've had pizza in Brooklyn, and this did not disappoint. Modest price, too.", "author": "Willard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Took my Girlfriend here for her first true New York style pizza experience (shes from PA) had a amazing experience pizza was amazing had a beautiful sauce great combination of soft but crunchy crust with fresh cheese overall amazing taste would recommend anyone looking for good pizza", "author": "Elijah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "We checked the on-line reviews, and this place was near the top.  When we realized it was 1 block from my daughter's apartment, that confirmed our choice.  \n\nWe shared a Margherita pizza, with two sodas.  It was great!  Only down side was no ice for our sodas - the machine was broken.  But, the man next door was gracious, and gave us 2 cups of ice.  \n\nThe highlight of our visit was Anthony, one of the owners.  He is the best!  He is very engaging, and even gave us some free dessert samples!  Way to go, Anthony.  That is the difference between a chain pizza joint, and Piz-zetta's - personal service from the owner himself, who just happens to be from Sicily, but was raised in Brooklyn.  It don't get no more authentic than that that!\n\nWe highly recommend Piz-zetta!", "author": "Margaret B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "Waited 45 minutes after I ordered to tell me I was outside the delivery rang (less than a mile and half).", "author": "Asher E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Good sauce, good ratio of ingredients,  not greasy. Plain and simple, my go-to spot for the best traditional style pizza in the neighborhood.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Shockingly friendly service.  Nice people.  Great place for a quick slice.", "author": "Jeffrey H."}], "servesCuisine": "Italian", "priceRange": "Under $10", "name": "Piz-zetta", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ypkelmb58TjpnwFbAMtJIg/ls.jpg", "@type": "Restaurant", "telephone": "+17184227878"}