{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "Ordered through Seamless on Christmas Day. Was very happy to find something other then Chinese being open.\n\nDelivery was pretty fast. \n\nI ordered the vegetarian lunch special which came with an Eggplant Parmesan, Penne Pasta and a side of roasted Zucchini. Food was delicious and totally worth the price.\n\nI will definitely be visiting the restaurant in person soon.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-26", "description": "Ordered on Postmates last week and it came on time and was hot upon arrival. That's basically where the positives stop. That, and the fantastic fries, which were sprinkled with Parmesan and were delicious and crispy. So, if you want to shell out about $10 for a side of fries - yeah, they're great. \n\nNow, onto the pasta. My boyfriend had the gnocchi bolognese and I had the squid ink spaghetti with shrimp. Both pastas were around $21 or so although I don't remember exactly. The portion size was generous, but the pastas were just bad! The spaghetti that I ordered had a very weird taste to it. I've had squid ink pasta a number of times before and it's never tasted \"off\" to me - this one did. It was also super mushy - granted I tend to prefer my pasta al dente, but still. I didn't like the sauce at all. Shrimp were great, but it was such a relatively small part of the dish. Gnocchi were slightly better but the bolognese was bleh. It also looked like straight up cat food.\n\nAll in all, for a decently pricey place Broccolino was a massive disappointment. You know it's bad when the fries are the best part of your meal. Skip this place and go to Frankie's instead.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "Great pizza...if it didn't always arrived COLD. Seriously, this is a constructive critic because I Do  want to keep ordering Broccolino pizza. But I've order pizza from this place four times in the last month. It's good and ingredientes are fresh and despite living only a few blocks away, it always tastes like it's been cooling for ages. Is the bag they use for carrying it? The wait in the kitchen? Please sort this out so I can keep enjoying your pizza.", "author": "Carlos A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Very quaint, Italian-infused spot with cool vibes and standard dishes. I did wish my mimosa was a bit better.\n\nIt was empty when we walked in so I was pleased we were seated right away. I believe the competition is tight on this block though. Cafe Luluc is across the street so they do have the tendency to attract heavy crowds. \n\nNevertheless, we were seated and presented with brunch menus. I settled for an omelette with mushrooms and cheese and my sister ordered steak and eggs. My son had pancakes.\n\nMy omelette was good and standard but nothing for me to do cartwheels for. The pancakes were very fluffy and tasty. My sister enjoyed her pancakes and eggs. Overall, the meals were decent.\n\nThe only con was my mimosa. It was blah. It didn't have the \"brunch taste\" that I was looking for. Definitely watered down. My sister's wine was very good. The Merlot was perfectly chilled and hit the right spot. It was her drink so it would've been wrong for me to keep sipping.\n\nWould like to come back and try their dinner menu.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Broccolino is a cozy sleek Italian restaurant in Brooklyn. The service is excellent, the food is very good and the wine menu is sparse. \nThe decor is modern and clean with a large marble bar and menu is painted on a large marble slate. \n\nWe arrived with our extended family for a Sunday night dinner. \nThe warmest spot in the restaurant is in the back, next to the pizza oven. \nThe place was very quiet but the pasta was so good! We ordered tartufo pizza (large), pesto pasta (1), clam linguine (2) and wild boar pasta (4).\n\nThe tartufo pizza was fragrant, crispy and cheesy. The wild boar pasta was rich, cheesy, and had umami flavor. The cooked down wild boar and mushrooms tasted like sausage stuffing with melted cheese sauce. \n\nThe rose moscato tasted like soda. \n\nThe waitress, host and owner were so hospitable! They were quick to fill our water, and bring champagne glasses for our moscato. \n\nI loved the food! Thank you for hosting us!", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Wow! What a gem! The food was unbelievable and the service was superb . I would would recommend any occasion!", "author": "Enrrique I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "My night at Broccolino started off a bit shakey... \n\nUpon arrival, the staff ignored us, then said they didn't know how long the wait time would be. At all. We decided to sit at the bar and get a drink while we wait..and then were told that we would have to wait ten minutes to order drinks because they were busy. At this point I was pretty irritated at this horrendous customer service but my dining companion wanted to stay... so we did. \n\nThe rest of the evening went smoothly. The staff did a total turn around once we were seated and they took excellent care of us the rest of the night, and even gave us complementary shots. The food was decent, but small portions for the pasta.\n\nOverall, the employees just looked VERY overwhelmed. The restaurant was pretty busy. Having only TWO people working in the whole restaurant - hosting, serving, bussing, and bartending was literally a recipe for disaster.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "No crowd on a Friday night. Spacious, cute ambience, with music but quiet enough for a good conversation. I haven't been to the Dean street location but my friend has, and this one is perhaps more pleasant. \n\nWe got the bruschetta for appetizer - large portion, no skimping on the mozzarella, fresh. Lacked abbot flavor, but there was balsamic provided on the table which was perfect. We got the il broccolino (broccoli rabe with sausage and cavatelli) and the ragu with tagliatelle. Again, large portions. Both were satisfying. The slight bitterness of broccoli rabe worked well with the savory sausage. Ragu was good - hard to mess up a ragu too much - but I felt like it lacked a bit flavor. The pasta themselves were mediocre I thought. A bit on the thicker side in terms of texture. They were both good, but I've definitely had better pasta in NYC (let alone Italy). \n\nThe tiramisu for dessert was the highlight for me. It comes in a mug, looks very much homemade, and it's the best I've had in a long time. You can taste every ingredient and the ratio was perfect. \n\nI would come back to try their pizzas and definitely for the tiramisu.", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Been to their other location on Dean and was happy to see that they opened a location on Smith St.\n\nIt's a rustic, cute, cozy space that was disconcertingly empty the evening I went for dinner. Come on neighbors, let's show some support here! It did make for a ideal place for talking, since we basically had the place to ourselves for most of the time. I ordered the tagliatelle al ragu. It was pretty yummy, the pasta was al dente and the ragu was hearty and meaty. Portion size was slightly smaller than I'm used to, but no real complaints. I wanted to enjoy it with a glass of wine, but the person I was didn't want to drink, so of course I couldn't out of solidarity, and therefore I was very sad (and immediately ceased all invitations to said person). However, I was much cheered up by our server, who gave us a dessert on the house! Much appreciated!", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Satisfying meal and excellent service!\nVisited here for early dinner on Monday around 5pm. I was the only customer at that time.\nI ordered vongole and mojito.\nThough they delivered the wrong food at first by mistake, their excellent food and service made up for it! \nVongole was perfect for me. it was neither salty nor plain. Clam and garlic mingled quite well! \nMojito was also good. neither too sweet nor bitter. The flavor was what I was looking for!\nAlso, they offered me free appetizer and shot, which I really appreciated.\nI was able to finish eating all the foods, which explains how much I enjoyed eating here. \nI definitely recommend this place, if you are looking for decent Italiam place in Brooklyn. \nWill definitely visit here again!", "author": "Denny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "Wish I could give 0 stars not because the food isn't good or the decor or service but because I have no clue about any of it!! I placed an order through uber Eats and waited over an our with my order saying it was being \"Prepared\" then 1 minutes before they close my order is cancelled by the restaurant!! Great now it's too late to order elsewhere and I of course must go on a voyage for another place for dinner. If you can't fulfill the order just cancel it right away so people can move on with their dinner plight!", "author": "Liz G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Small ambient Italian establishment a block from\nBarclays. It was incredibly authentic and owned and run by Italians. Pasta was homemade and incredibly flavorful. Prices were fair. Overall a great experience and would recommend to anyone.", "author": "MP P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Most definitely a fan! Such a cozy, inviting, adorable little place - didn't even notice when they sneaked in but I sure am glad they did!\n\nI've seen a sign in the window for a while but wasn't sure when Broccolino would open its doors and while having my heart (sort of) set on Ramen this evening, I was driving by and decided \"ramen will have to wait.\"\n\nLove the decor, staff are super friendly, drinks - awesome Negroni!! And now - the food. After hearing all the specials, I wished I wasn't dining alone tonight! Everything sounded amazing and I was having a hard time deciding. I'm grateful to the very sweet and friendly waitress who gave me the heads up on portions being quite big and so I ended up with buratta and saffron seafood risotto. Buratta was good - not mind blowing but good. I'm not a huge fan of tomatoes. The risotto - wooow. I am so happy with my choice! Let me just say - I'm writing my review between bites! Ok so it's true that I also am here alone and have nothing else but my phone BUT! The point is - risotto is fantastic!! \n\nWonderful addition to the area!", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Great food and delivery! Highly recommend. Love the spaghetti and meatballs. Food still tastes great with delivery.", "author": "corissa m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "I'm so delightful for the opening of this restaurant. Me and my partner who happens to be Italian had dinner here and it was a hit. The food is extremely fresh and authentic. We had the \"tagliatelle al ragu\" and \"cavatelli broccolino\". They both get five out of five stars. We had the house red wine which was really good. I love that it comes from tap out of the wall. Something that you would only see in Italy.\nThe winning dish for the night I have to say is the tiramisu. The best tiramisu I've had in my life!!!! The consistency was great and I love the strong espresso liqueur. \nI can't wait to come back from brunch as well as the dinner specials. I noticed them written on the wall after I already ordered. Charming new go to restaurant in the neighborhood!", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "These guys don't seem to know what they're doing. I sat at the bar, and there was no hook for my bag near my seat. That was already mildly annoying. My drink took way too long for the bartender to make--and it only had 3 ingredients. (There was only one other customer in the restaurant, and he already had his drink. So I don't know what the problem was.) I had to ask for water. Then I was served 4 overpriced meatballs ($18) without a placemat, or utensils. When the guy asked, \"Is there anything else I can get you?\" I had to say \"A fork and knife?\"", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "I ate here last week, I had a very good experience,good food and good service. The pizza was really good like in Italy", "author": "Christian I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Great place with awesome pana cota . Friendly staff  who offered us complimentary after drinks", "author": "Yuriy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Pizza was great! Very high quality ingredients, especially the cheese! The meatballs were perfectly spiced and cooked. The sauce tasted homemade, with the perfect amount of basil and fresh garlic. We came with our 2 1/2 year old, and the staff was so sweet and accommodating- will return soon!", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "The most amazing Italian dinner this side of the pond!! Would definitely come again. Early dinner for Barclays Center Event. Highly recommend the pasta, tiramisu and chicken Milanese. Thank you so much to all for the great service!!", "author": "Mary L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Broccolino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "213 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0W8BNaUal-SZE-P7zLcu3g/ls.jpg", "@type": "Restaurant", "telephone": "+19179091858"}