{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "I've been to Broccolino twice and both times have been very disappointing. 1st time, they named me a pick up time and then I had to wait there for 20 minutes. When they brought it out it was cold: turned out they'd had it there all the time. Second time was tonight: 18-inch 4-cheese pizza for $30. My wife and I are skinny folk but it didn't nearly fill us up. Incredibly thin dough, but it was the cheese that was particularly awful. I could taste the ricotta there but nothing else really. perhaps one crumble of gorgonzola, the Swiss cheese was nondescript and the mozzarella hardly fresh. All in all, to be avoided.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "My husband and I absolutely loved the food.  We had an amazing brussel sprouts salad and meats grilled to perfection.  Staff was friendly too. I hope the neighborhood catches on to this treasure.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "This place is so great!  The food is fantastic, really some of the best Italian food in the neighborhood.  You can't go wrong, all the pastas are amazing. The staff is so incredibly nice and helpful.  We love this spot.", "author": "Jacqueline C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "Food is good but not great. The waiter/manager (?) who waited on us was extremely rude. This was our second visit. We won't be back. With so many great Italian restaurants in the area, you can skip this place.", "author": "Heather J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Loooove this restaurant. Delicious and tender pasta, excellent wine on tap and a charming staff. Love the first Broccolino and will definitely become a regular at this second location !!", "author": "Kathryn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Wow!  We walked into this place because we didn't want to wait elsewhere, and were so glad we did!  Great food - unique menu in a sea of similar brunch options along smith - great service, and kid friendly.  We will be back.", "author": "Zach D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Very pleased with my dinner at Broccolino. Me and my party all had excellent homemade pastas with devious sauces. The tiramisu was exceptional as well. Nice ambiance and very friendly people running the place.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Disappointing. My saffron risotto was nothing like a northern Italian risotto. It was overly buttery and cheesy, too dense, thick and heavy, and just not good. The only cheese that's supposed to go in a risotto is parmigiano, at the very end -- the one I had was loaded with an unspecified melted cheese  and tasted like a dish prepared by somebody who threw together random ingredients, knowing nothing of Italian cuisine. I never had such bad risotto in NYC before. I would never get it again and you shouldn't either. Perhaps it was an off night, so we'll give it another chance, but only to try the meats. It's s cute plate, with friendly service, and it was a bummer that the food was so mediocre.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "We're looking for a great meal close by and found this adorable new spot.  Asked for meals to go since we had the puppy in tow.  Quick, polite service and the food was delicious!", "author": "linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Wow what a great little surprise this was. We ordered the grilled fish for two: salmon, sole, calamari and shrimp. Tasted like Italy. Very nice vibe in there as well. Would definitely come again.", "author": "joe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Great BYOB in  heart of Millburn center.  I've eaten here numerous times and always a great meal.  The staff is friendly - even had dinner at the bar a few times- service is great.  It can get noisy on weekends but the food makes up for any small inconveniences.  Highly recommend", "author": "Sari L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Broccolino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "213 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0W8BNaUal-SZE-P7zLcu3g/ls.jpg", "@type": "Restaurant", "telephone": "+19179091858"}