{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "We love ordering from the Dean St location. We get the same thing multiple times a week lol. So imagine our delight when another location of our favorite restaurant opens down the street from our home!!! \nUnfortunately, the chicken was chewy and the salads were very wilted and yucky. We tried ordering from them twice and both times the flavor was just off. For some reason the main location must store its food in a way that maintains freshness better or something.\nDon't get me wrong, we love this place, just not this location (for delivery - we haven't eaten there physically yet)", "author": "Michele K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "My boyfriend and I came here on a Saturday night. The restaurant is spacious (unlike many Brooklyn restaurants) and they open their windows and doors when it's warm out. It seems that the bar area gets busy later on at night, but when we arrived around 7:30 it was empty. \n\nThis place may be good for drinks, but I don't recommend it for dinner. The waitstaff is overly casual and are pretty careless. \n\nWhen we ordered, the waitress did not write down our order. In fact, she even did some side work (cut up bread and cleaned up a table) before she placed our orders. My boyfriend then received the wrong entree, which I assume was due to the fact that the waitress memorized our drinks, appetizers, and entrees instead of writing it down. She apologized, and replaced his entree with the correct entree about 15 minutes later. After that, no one came to check on us or offer us dessert. I don't know if this is due to the casual ambiance of the restaurant, but it made for a pretty poor dining out experience.", "author": "Jacqueline M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "Had dinner here last night with other 3 people. The service was extremely slow, there was a big table of 10 people, 2 tables of 4 and there were 2 waiters for the entire restaurant. I think 2 people were not enough to serve all the tables. We ordered 1 appetizer for two people and the main course: pizza and pasta. The appetizer took a while but it came and it was good. While the two people were eating, I kindly asked the waitress to start making the two pizzas since me and the other friend didn't order an appetizer and we were pretty hungry. She said okay. Well, the pasta ordered from the other friend came out pretty quickly while for the pizza it took about 20 minutes. Two out of three pizzas came and still my friend who didn't order an appetizer was still waiting for her pizza and after 30 minutes came and it was cold. The waitress heard us complaining about it and with attitude she asked us if there was a problem, so in Italian I said yes, there is a problem, and I listed all the above to her but still with attitude she was blaming the fact that she was serving other tables and a few other reasons. I was shocked by the bad service provided and by the low quality of the pizza. I'm Italian and the two waiters were Italian too so I was expecting better service and better food. Anyway, I don't recommend this place at all. If you want to eat real good and authentic pizza go to Sottocasa, it's in the neighborhood and the quality of the service and the food is excellent!", "author": "Ester L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "In the few short weeks Broccolino has been open we have made it our neighborhood place. The setting is really warm and inviting, yet still casual. The wine on tap is fantastic and easy for big groups. Make sure to try one of their salads, which are huge.\nPasta is impeccable, in the three times I've been there, it's always been perfect. You really can't go wrong with any of the selections.\n\nWe have yet to try brunch - but have heard great things. Also, they deliver, which is awesome on nights you don't want to leave the house!", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "So yesterday I celebrated my birthday early with my family due to the fact that my husband has to work today (Saturday). Before the day began, I was looking for a place to get dinner after we saw Guardians of the Galaxy 2 over at the Court St movie theater. I headed over to yelp to see what the other yelpers yelped about for good eats in the area and I came across this little spot. Although there were only 11 reviews, due to the fact of all the reviews the raved about the food and one negative about the service, I decided to take the chance. \n\nI scoped out the Smith St location on google (due to the fact that it's closer to the movie theater than the Park Slope location) and also checked out their website. I had noticed that it was a small restaurant so I opted to reserve a table just in case. \n\nWhen we got there, I noted that it wasn't packed yet but seeing that it was raining all day and finally stopped, that could have been the reason. When we walked in, we were greeted immediately by their staff and taken to our table. The waiter was really kind and even joked around with my 6-year-old son, which made me relieved because it did appear to be a bit more of a formal atmosphere. It was really elegant looking and relatively quiet so if you have rambunctious kids, this may not be the spot for you. \n\nIt's relatively pricey, I had the special which was the Black Linguini with Lobster in Tomato Sauce, my husband had the Gnocchi Ragu with Veal, and for my son Ravioli in Butter Sauce with Sausage and Asparagus. We also had sparkling water and I had a glass of Chardonnay.  No appetizers, salads, or soups. Just some complimentary bread. We also shared a Panne Cotta with Strawberries (which is a type of a pudding). Our meal came out to $107. \n\nThe meal, amazing but it took a while for it to get to us. My son was getting so impatient and so was I and I wasn't even starving but my son was. When it finally got to us, it was so delicious but it felt as if they could have given more. I wished it was more. I wasn't really full at all with this meal. I am not talking stuffed but I am talking just full and satisfied. I have been to quite a few Italian spots, and even other European/Mediterranean restaurants and I have to say that they usually put a lot more on your plate or at least give you a soup or salad with the meal, so that was a letdown. Other then the amount of food given, I was completely satisfied with the service, the food quality and taste, and the ambiance of the restaurant. \n\nSo, the main points about this place:\n\n1) I think that with the price they could have had a simple salad or simple soup with their main dishes. \n2) The ambiance is more of a formal setting however, you can go casual (which we did) just giving a heads up on the vibe of the place.\n3) A bit more quiet, good for kids but maybe not an ideal place for kids younger than 5. Perfect for a date night though.\n4) Kid friendly but note above.\n5) Delicious food.\n6) Service was awesome.\n7) Food takes a while so don't go there starving.", "author": "Alisha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Excellent brunch! Steak and eggs with Bloody Mary. Attentive and thoughtful service and nice ambiance though music is a little hokey. Very nice experience.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "This is a new restaurant in my neighborhood so I decided to try it out for delivery. I ordered the veal Milanese at a pricey $29 and a custom made pasta dish (spaghetti with butter and grated Parmesan cheese) for $15.50. About 25 minutes after ordering, the restaurant called me to tell me they were out of veal but could give me chicken Milanese instead. I agreed. I assumed there would be a price difference, but I got no discount for having the chicken instead of the veal. Once the food arrived, I was shocked at how small the portions were (please see photos). The chicken cutlet was tiny (in their photos, it shows two cutlets that you should receive, but this is misleading). The arugula that came with it was in a separate plastic bowl with a long hair in it! In addition, the pasta looked like a child's portion and the grated Parmesan cheese, which cost an additional $2.50, was about two spoonfuls in a tiny plastic container. I will not order from this restaurant again. The quality of the food does not justify the small portions and price (and the hair was the icing on the cake).", "author": "Blair B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I love this place. Amazing food. Amazing environment. On the house desserts and drinks", "author": "Abby S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "The brussel sprout salad was inedible and the meatballs were super tiny.  For how expensive this place is, this quality should be much better. Please don't waste your money here.", "author": "Adrienne D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "Service is the best part. But food is average. You could cook the food at home. Wine list is limited and they don't disclose what wine it is in the list or the year. They just tell you what grape it is. We had the tiramisu for dessert and it was so sweet and no essence of marscapone or liquor.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "After a long day in the city with my family, I ordered delivery through the Eat 24 app. It gave the normal 45 - 60 minutes for delivery. At the 60 minute mark it was \"out for delivery\". After contacting the restaurant and Eat 24 multiple times - now 2.5 hours after placing the order I canceled. May be a great place to sit and dine but I'd avoid delivery from them.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "I adore Broccolino! Last week I took my parents there for a combined Mother's day/birthday brunch. The food is very affordable, and the Smith Street location actually serves real carbonara instead of that alfredo knock off that most restaurants in New York try to pass off as the real thing.\n\nThe staff was lovely, and I'll definitely return soon.", "author": "Carine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "I'd like to rate this place higher, since folk are having a hard time keeping something in this particular space. The gluten free pasta is appreciated, but those with GF needs are not high on their list of clientele accommodations. When I ordered the GF pasta with cream sauce the server, and likely manager (or owner?) looked like the wind was knocked out of him. The dish was bland and the sauce was too thick. Further, when they asked about it and we discussed it, the other server/ manager suggested adding a little pesto. Then she promptly forgot all about it and never brought it. The staff are decent, but not super well focused and service is inconsistent/disparate. At the end of the day, this place is over priced for the culinary and dining experience, and while good, not great. Would not return.", "author": "Fridah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "I loved this place very casual authentic Italian food. Freshly made pasta. I had there sparkling rose wine. It was amazing. For an entree I ate the wild boar sausage pasta dish it was delicious! Definitely recommend it. For dessert the creme brûlée does not disappoint.", "author": "angelique v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Some of the best pasta and sauce I've had in NYC in years. Unique flavors. Try the duck ragu with fresh pasta. \n\nGreat service. Food also delivers well. Super impressed. Fyi I'm a native New Yorker who loves Italian food.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "An all-around great meal and experience. The food was delightful--we had 3 different pasta dishes--a filet of sole dish and 2 salads to start. All were flavorful and well-presented. The atmosphere was cozy and also chic and the service was incredibly warm and attentive. A delicious neighborhood gem. We will absolutely be back.", "author": "Ariel D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "I've ordered delivery from here twice and both times were seriously lacking. The first time I ordered the black linguini with lobster.  The linguini was extremely soggy and barely edible. The pasta should be al dente. Perhaps the pasta became that way during the delivery process but I find it hard to believe that it wasn't already overcooked. The lobster was still in the shell and was a mess to get out. The sauce is what made up for it. The second time i ordered delivery I ordered spaghetti with clams and garlic and oil. Instead of spaghetti I got linguini and it was not edible at all. The pasta was a complete soft mush. At the price of these dishes I expected a lot more and was highly disappointed. This has turned me off to dining here all together.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "A welcome addition to Smith Street. I've enjoyed the location on Dean Street for some time and was happy to see it closer to my house. Food and wine is wonderful as always and the staff is charming. I will definitely keep this in my neighborhood rotation.", "author": "Alison J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "I really liked this place. My husband and I went a few weeks ago and I got Lasagne and it was great. Nice vibes good service.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "A very happy discovery! We Yelped restaurants near the Cobble Hill Cinema, looking at reviews for a place for dinner. Saw Brocollini, remembered reading that it had just opened and decided to give it a try despite the small number of reviews.\n\nWe were glad we did. We ordered the Eggplant Parmesan Melanzane, the Paccheri (fat, handmade tubes) with Lamb Ragu, and the Spinach Fettucini with Boar Sausage and Mushrooms (Fettucini a La Cinchiale). The pastas were delicious. Hubby and I shared our orders and agreed that both were great - lovely sauces, pasta cooked just right. I also appreciated the generous portions -  aren't you tired of hub cap-sized saucers with rice bowl sized indentations in the middle for cup sized servings, when they know that many people have a pasta as the entree?\n\nThe Eggplant Parmesan Melanzane was just ordinary, though. \"Nice\" but nothing memorable. I would have loved to have a bit of melted mozzarella on it. But this was a purist execution.\n\nService was a little slow. The place is understaffed, understandable that a new restaurant doesn't want to commit to too many hires too early. But it was painful to watch three people handling a nearly full restaurant and the bar as well. Reminded me of the trop about the one-armed paper hanger.\n\nNevertheless, we will be back. Brocollini has a lot of promise and I'm hoping they get their sea legs soon.", "author": "m t."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Broccolino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "213 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0W8BNaUal-SZE-P7zLcu3g/ls.jpg", "@type": "Restaurant", "telephone": "+19179091858"}