{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "I have friend that used to live near the Fast and Fresh Deli and he would rant and rave about it all the time. While in law school, he ate their chicken torta about 5 days out of the week. Sometimes he'd have 2 in 1 day. That's how much he loved their tortas. While I don't think I could eat it everyday of the week, they are very good tortas. Fresh ingredients and they don't skimp you on meat or avocado. They make fresh watermelon juice in the summer which is the perfect way to enjoy a weekend morning in Brooklyn.", "author": "Kim N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-19", "description": "Fast and Fresh Burrito is a morning hangover favorite, and an afterwork must-stop for a $5 six pack of negro modelo. Living right next door may not be the healthiest life choice, but certainly adds to my happiness factor.", "author": "Cindy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "Finally! I discovered a Mexican restaurant that serves authentic Mexican food that is cheap and delicious. The only thing I regret about this place is that I passed by it for 6 months, and never walked in because it didn't look good from the outside. Well, now that saying \"don't judge a book by it's cover\" really means something to me. I've eaten here twice, both take out. The first dish i ordered was the chicken Enchiladas, which were cooked to perfection in a delectable tortilla. The chicken melted in my mouth as it was moist and tender. The second time I came here I ordered the Quesadilla not expecting anything too exciting, but instead I found myself biting into a piece of cheese heaven. I think the tortilla was cooked in a wonderful kind of oil because the texture was the perfect combination between soft and crispy. I've never tasted anything quite like it. The succulent chicken impressed me once again, and at that moment I knew that Fast and Fresh Deli was the only Mexican restaurant I will be eating at in my neighborhood from now on. Adios Pacifico.", "author": "jennifer d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "Love this place.  Everything is good.  A friend who grew up close to the border of Mexico discovered it, said it was as close to authentic as you can get in NYC,  and took me there.  I'm loyal now.  I usually get the tostadas (3 for $7.50) or a burrito ($6.50).  And a beer.  It looks like a bodega, but they have a cute little patio out back which is nice in the summer.  My only wish is that they would be open later (kitchen closes at 7:30pm).  Love the cooks too, so sweet.", "author": "b b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "Spicy pork burrito. Weekly.  The best Mexican grill/bodega in the area.  The back patio is a great respite for lunch and the staff are very friendly. Grab yourself a tallboy and enjoy.", "author": "j i."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-18", "description": "i called and called...why bother saying that you open at 6am if you don't and you don't even pick up your phone at 8am. bummer. i liked the burritos enough to follow up but i hate false advertising more.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Amazing chorizo tacos, best tacos in BK, and cheaper and bigger than the tacos from the trucks in Red Hook.  Closes too early, 6:30pm, but that is give or take an hour, depending on business.  Seating on the patio to relax and enjoy beers.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "this is my dream \"restaurant.\" literally there is nothing better to me than $6 tacos, grabbing some beers and sitting in an awesome garden with your friends for as long as you want. i want to move to boerum hill for this place alone. an $18 six-pack of pacifico seems insane to me, but whatever, it's worth it.", "author": "Emma H."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}