{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "I ordered the chorizo burrito here last night, and it was very good. Ingredients a little mushy, but the taste was all there, and the cheese was melted all over the place. No real complaints. Cheap, also. The tamales here are also very good. The food prep seemed a little longer than I expected, but it was worth it. Great for sit down or carry out.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "Very quick and friendly service.  \n\nIf you do not want to sit outside (ie: hot, rainy, cold, etc), don't eat in.  There are two awkwardly placed tables with chairs inside.  Makes you feel like you have a table setup in the middle of a 7-Eleven.  \n\nI had the veggie burrito... which was good... not amazing... but fresh.  It was also huge for $6.50 and the salsa (which they forgot to give me on the side), was very good.  \n\nI need to go back, get it to go, and get meat.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-09", "description": "This place is so unexpectedly good! It's fresh, inexpensive, Mexican food with just the right amount of spice. My only complaints are I wouldn't say it's fast and they don't always pay attention when I ask them to leave something out or etc. The garden is a really nice, shady place to kick back. Wouldn't recommend going there to sit down on colder days--there's not much room to sit inside.", "author": "Tina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "My fiancee and I decided to try this place after walking past it about 50 times. I think it was the little backyard that made us really pay attention because its an otherwise, unnassuming bodega. We were shocked by the low prices and very happy with the authenticity of the food. The employees are very nice and and the backyard is awesome. Great place to go if you're looking simple and delicious tacos and a low-key environment. We will definitely be going back soon!", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-13", "description": "Regular corner deli.  Sometimes good and bad. Serves boars head meats so that's a plus.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Having recently moved from Chicago, I'm constantly lamenting the lack of decent Mexican food in NYC.  This place is the closest I've come to an exception.  \"Fresh\" is the right descriptor: the ingredients are high-quality, and the tacos are well balanced and served with slices of lime and lots of cilantro.  This isn't greasy Mexican food -- it almost seems, like, healthy or something. \n\nWhen in doubt, lean toward the pork products (chorizo, pastor) which are excellent -- the carne was a little weak by Chicago (La Pasadita) standards.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "Best burritos, nice friendly people. Back patio with tables and chairs, eat and drink", "author": "Alberto H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "Good place for tacos and all kinds of Mexican products. Get the carnitas torta. Do it!", "author": "Mike H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "This place has some pretty good food.  I like their vegetarian torta a lot, and it's not a bad price.   On the other hand, their cheese enchiladas are pretty awful.   Their guacamole is mediocre, but it's leagues above what some of the tex-mex places give you.   I used to think this place was pretty cool because the price was right, even if most of the menu wasn't that great-- but recently their prices have been random when I order here.  Different prices for the same thing on different days--saying that they changed the price but haven't put it on the menu yet, etc.  Which is fine, except 75% of the appeal of this place was the price.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-08", "description": "Veggie burrito, 24 fl. Oz. Modelo especial, sunny Monday afternoon, what the fuck more could you ask for? This place is the balls.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Walking by you'd never know there is some of the best Mexican in Brooklyn served inside but it is.\n\nIt's basically a bodega that has food service and a few seats inside and a backyard. \n\nPrices are low and the food is really tasty.\n\nFrom my very uneducated eye/pallate it seems pretty authentic and has a lot of things not usually found on places in the neighborhood, including goat and tongue.", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I really like this place. They don't have tripa, or even lengua like my favorite taco spots do but what they do have is very tasty and prepared the right way. I just had un de chivo, un de chorizo, and a spicy pork, the spicy pork being my least favorite. Next time i will probly try cecina. And the price is right, at $6 for 3 tacos.", "author": "Joey V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "My boyfriend and I have both lived in California (he's from there,) and are always moaning about the state of Mexican food in NYC. I like La Bonita on Bedford but hate to go to williamsburg and of course the red hook ball fields make up for the general lack of good latin cuisine. Yesterday I was walking home on Atlantic and noticed this little deli on Hoyt and their sign advertising Mexican food. Now Cobble Hill and Carroll Gardens do have quite a few Mexican restaurants but not of them have passed muster thus far and my heart skipped a beat for a minute, feeling somehow that this might be the one. I went in, took a look around, saw Mexican's eating there and bought a 100 pack of corn tortillas for $1.50. (By the way, none of the markets in my neighborhood, and I have some of the best around, carry corn tortillas. What's up?)\nTonight we ordered from them and we couldn't have been happier. The tortilla was properly steamed, the rice was properly flavored, the cheese, crema and avocado all perfectly proportioned. FINALLY.\n\nAddendum: it closes at 6:30 so it's more of a weekend treat. That's fine!", "author": "Molly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Best quesadillas EVER. I go here once a week for lunch and I get either the spinach quesadilla for $7, the veggie tacos for $6, or the veggie tostadas for $6, all with chipotle peppers. The portions are big and sooo delicious. They have a nice large shaded seating area out back which is perfect on summer days. There really isn't any indoor seating so you have to take out if it is cold/rainy. Unfortunately their meat it is usually fatty/boney so I avoid it, which is also why I have to take away a star. However, if you are craving some authentic mexican, you can definitely find it here.", "author": "Victoria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "Deeeeelicious. I had an $80pp meal at a high end manhattan Mexican resto last night and it didn't even come close to fast n fresh's $7 burrito. Or it's tacos. Or it's guacamole. Fast n fresh holds true to its name, you can order the same thing there a  dozen times and it'll be different every time. They use only the freshest they can get that day so it always changes but is always delicious!", "author": "Edward Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "This place was a nice surprise in this neighborhood. Tasty burritos, friendly service. I'm from CA, have the same high expectations of mexican food as the other reviewers and am always satisfied with their food. Fast, fresh, and cheap, which is a rarity in this city.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "After an exhaustive study I've concluded this place has the best damn chorizo I've ever had. My god, I swear I can't get sick of it. Best chorizo in the city. \n\nThey make some other mean dishes too. Delicious, cheap, friendly. Serves beer and have an backyard for the summer. Chorizo tacos and beer with lime in the sun equals fine living my friends.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-20", "description": "This is the place to get Mexican food, for cheap, and with a big wallop of authenticity. The exterior of the deli may look sketchy, but the food definitely isn't! I ordered the chorizo cemita, and my stomach died. My friend ordered three burritos, and wanted to cry because they were so good. And he never cries, my friend-- that's saying something. There is some waiting involved, along with some language barriers, but once you get past those obstacles, you will thank those that made your food and thank yourself for waiting it out.", "author": "Cat J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "I lived in California for many moons and learned of the wonders of awesome Mexican food.  However the dearth of palatable mexican in NYC has never ceased to amaze me.  But now my prayers have been answered.  \nI work near Fast and Fresh, and was skeptical when a friend recommended it.   From the outside the place looks like every other deli in the city.  The inside doesn't exactly inspire confidence either.   But, ohh the food!!!  This is the real deal folks.  Hands down the best Mexican in the city.   Each and every Torta on the menu is excellent.  The tacos are simple and delicious.  In the summer the watermelon drink is refreshing and cheap.  They have a little back yard with a bizarre mishmash of chairs, tables and decorations yet somehow it works.  I can't stress how good this place is.", "author": "Thomas N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-26", "description": "Three stars on a first visit and I'm guessing it'll only climb on subsequent trips. This place genuinely outclasses Mexican joints that are five times prettier. It's a real surprise find in the middle of Boerum Hill--maybe one of the hood's greatest dining secrets?", "author": "Jeff M."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}