{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-15", "description": "I'm sorry but I have no idea how this place got 4 stars. I ordered a torta- millanesa de res \"breaded beef\"... I literally could not chew it. The meat was inediblely dry \u0026 tough, it had no flavor. Garden seating in back but no condiments on the tables, if they're not gonna season the food, atleast provide condiments. What I think is they cater to mostly whites \u0026 so they skimp on certain extras that are normally made available to their own. I know this cause even at taco trucks that all the locals in Bayridge frequent ( mainly Mexicans) have all the little condiments, tomatillo sauce, salsa verde, chipotle, cucumbers, jalapeno, limes  etc. available to their customers.  I'm Puerto Rican \u0026 I make better Mexican food. And one thing I hate is paying for food outside that I can make better at home. Very disappointed!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "Stopped by when we were in the neighborhood for BAM, but would definitely repeat the trek for this place alone.  Fast \u0026 Fresh featured some of the most authentic Mexican food this one-time Californian has been able to find in NYC including real-deal goat Barbacoa (I had a Carne Enchilada plate).\nWould be great to return in the summer to enjoy their outdoor patio with a torta or burrito and some cheap beer.", "author": "Jake K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Just a quick update on a dish I tried recently... cheese enchiladas.  Eeks.  Don't do it.  stick with the chicken mole enchiladas and burritos... pass on the cheese enchiladas or you'll be sorry.  Still def worth a trip, just be selective about what you order.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "I haven't had a burrito yet from here.  I came here on a tip from several Yelpers.  They told me to get the burrito...but I couldn't resist ordering a carne asada plato.  So I got that...and a beer, to enjoy on their patio.  It was a great Spring day.  Ironically enough when I show up there for lunch last week, I saw three of my fellow classmates there chowing down. \n\nWhile I was eating my plato, I felt like I was transported to a far off land south of the border...although maybe this was because the patio looks like it's straight from Mexico or Brazil or something.  har har.  Anyways, I felt my plato was decent.  I've had better to tell you the truth -- this means you Taqueria La Bamba from Mountain View, CA and beloved childhood neighbor of mine.\n\nI'll definitely come back since I live in the area and I am getting that craving for a burrito.  I'll give that one a try next.  But yeah, this was overall a pleasant surprise!\n\nIn fact, while I was eating outside, my friends and I said this would be an awesome place for a party out on their patio.  Seriously.  It has delicious food.  And it's also a convenience store --- which means you have easy access to ice cold beer.  I may have to try this...", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "Consistently delicious.  I do the Veggie Tacos  generally for lunch and have never been disappointed.\n\nFunny how many people compare this place to Mile End nearby.  Montreal Jewish Deli vs. small Mexican deli.  You might as well compare this to the antique stores.  \"We ate here when we couldn't buy the Eames chair we wanted.  The tacos tasted better, but were uncomfortable to sit in.\"  Please compare like items.", "author": "Louis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "3 Taco special is amazing. The outdoor patio is a bonus for sure. I tried one of each taco they were all equally amazing.  If your in the area you won't be disappointed.\n\nWell seasoned meats with fresh onions, cilantro, and guacamole wrapped in two fresh corn tortillas. Nom nom nom nom nom nom nom.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "It's hard to find good Mexican food if you don't have time for a trip to Harlem or Bay Ridge. This spot fits the bill just fine, if you have a morning or afternoon taco craving. They close at 6:30pm, so don't count on them for dinner! \n\nThe tacos al pastor come highly recommended. $6 for a platter of three!", "author": "Emma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-19", "description": "I stopped by last Sunday after an unsuccessful attempt to try the pastrami at Mile End (at least 30 people were waiting for a table, no thanks!).  The tostada (sp?) was remarkable, the chicken has a ton of flavor and melds nicely with generous portions of cheese, refried beans and guacamole.  I thought the spice was perfect, but my girlfriend was a little overwhelmed by the jalapeno.\n\nAlso tried the salted beef tacos and guacamole with chips.  The beef tacos were decent, could have used a little more flavor, but I liked the healthy portions of fresh ingredients enough to give them another try.  The guacamole was tasty, too, heavy on the tomato and onion, light on the garlic.  However, the chips were underwhelming; cold and dense.\n\nTwo drinks, chicken tostada, three tacos, guac and chips: $20.  Way too much food for the two of us (and I can put it down), definitely worth another trip to try the remainder of the menu.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "cheap and easy for mexican food and assorted other items. They offer outdoor seating in the back, but the place is really on the grimy side so we got food to go. Taco's are pretty good 3 for $6 and the salads were very reasonable too. They also have a beer fridge. Staff are nice and friendly too.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-16", "description": "In Brooklyn today I was craving tacos. Mexican Tacos are wonderful things, they seem so simple to make but a simple slip up either in the use of dry meat or not putting enough cilantro will bring a taco down from the perch of flavor ecstasy to mediocre to sadly, just plain bland. I decided to go to downtown Brooklyn/Boerum Hill to visit Fast and Fresh Burrito Deli in hopes of finding something that will not only satisfy my craving but make yearn for more.\n\nFast and Fresh Burrito Deli is an interesting place. It looks like a run of the mill deli providing your basic bagels and bacon, egg and cheese on a roll for breakfast and cold cuts sandwich for lunch. However, there is so much more here. The huge deli menu throws many wonderful options out at you including Mexican delights tacos, burritos, Tortas and Cemitas. The american food menu includes burgers and gyros. They have smoothies and milk shakes to round things out. The deli also sells mexican food products over the counter (like habanero spiced chips)items not normally found in other delis. Nevertheless, I was looking for tacos and that's what I went for.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-18", "description": "Would love to give these guys a higher rating, since the food is really good, and about as authentic as you'll get in nyc, since you have real Mexicans manning the grill...the only drawback is its tough to get a real vegetarian option here, since everything (including the grilled vegetables that are part of the veggie burrito option) is cooked on the same grill. For such a small establishment you almost cant even expect them to do otherwise, but still it would be nice to eat there conscience free if you are like me and have some dietary restrictions. For the most part I have to avoid this place, but have had one or two burritos there, but it's hard to eat when you can't do it with a clear conscience.\n\nI'd definitely recommend if you're have no eating rules, and are looing for some authentic mexican at a great price.", "author": "Abdul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "I've already gone back.  This time I got the three tacos for $6.00.  They were AMAZING.  They gave me two al pastor tacos instead of one al pastor and one carnitas, but that's okay.  I forgive them.  I also had a taco de carne, probably the best out of the three that I had.  Mmmmmmm...totally my new Mexican place.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Like the reviewer before me I stumbled upon this spot and took a look inside, saw the classic \"NY Deli\" setup and was immediately skeptical about the quality of the food but after my first meal here I realized this place is the real deal! \n\nNYC is nearly void of decent Mexican food options, the only decent ones in fact are the super expensive spots in Manhattan. But this place is an exception to that rule. I am a vegetarian so I haven't tried too much on the menu but what I have tried is terrific, authentic and cheap:\n\n1. Torta con queso. It's a sandwich with Oaxacan cheese, lettuce, tomato, avocado and jalapeno on an authentic roll (the roll is most important, you cant make a real Torta with an American or Italian style roll). Highly recommended. \n\n2. Cheese Tamales - amazing. I brought a few home for my wife and she was also blown away. \n\nMy brother is a meat eater and has tried the Spicy Chorizo Torta which he believes to be the best option on the menu in his opinion. He also enjoyed the Spicy Pork Torta and, less so, the Carnitas Torta. \n\nTo add to the wonderful cheap cuisine this place has an impressive outdoor space in the back. It's HUGE, enough room for probably 25 people to eat at once. And they have tall boys of Modelo Especial. (Which is rare to find in tall can form.) Nothing beats sitting out back in the summer, eating a Torta and chugging a tall can of Mexican beer with your friends. My only wish was that they had a speaker system in the back blasting Chalino Sanchez music all day long. Perhaps I'll mention it to the very nice owners.", "author": "Johnny R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "my husband and i chose this place because we were looking for a quick lunch near our hotel where we thought there might not be a wait.  \n\nwe arrived around 12:30 on a thursday and there were about 5 people standing around in this tiny store.  it was a little confusing to figure out where to order and when to pay.  we finally figured it out and ordered two tortas and grabbed two waters.  we ate at the outside dining tables in the back.  the area had nice shade on a sunny day.\n\nsandwiches were very good.  flavorful and huge!  very fast service.  we were in and out (and very full) within 20 minutes.", "author": "sommer m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "I really wanted to like this place because it has the no frills vibe I love but the food was uhhh at best. I had the chicken fajita (very little chicken, no flavor), guac (huge portion but very bland) and chips (more like pita chips - think and bland vs light/crispy chips I was hoping for). Service is very nice and they have a great patio in the back but the food is just not worth the trip. Total tab was $16 (takeout)", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Family-owned ~ family-run authentic mexican \"quick fare\". Fresh \u0026 clean. Everything is made by Victor, and run up by Norma, his wife. \nNothing misses here for good, solid and extremely well-priced food.", "author": "P H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "PERFECT for sitting outside and drinking beer on a sunny day. just delightful, and the only other people there were old men in baseball caps sunning themselves. made me feel like i had made a secret discovery, when really i had just found the place on yelp.\n\nthe food is amazing. i couldn't get enough of the tacos or the quesadillas. also the service is much better than you would expect from a deli.", "author": "Jane F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-29", "description": "I almost wish I had never gone to this place.  It's going to make me fat.  I know it.  I just had their burrito w/ chorizo (only $6.50!) and now I want to try everything on the menu.  Like now.", "author": "joanne s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "Best burritos in the hood. Hands down. I crave them almost daily.", "author": "Gentry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-08", "description": "I lived around the corner from here, and it took me an NY Times  articles about how great the mexican food was, for me to look past the Boars Head and order.  I've been trying to make up for lost time since.\n\nThey've got sopas, tamales, all sorts of \"fried thing of the day\" in yummy bad for you sauce of the day.  But, I can't really review any of that, because I always get the world's best sandwich, which they call the \"porc torta\".  Without mayonaise because it's gross.\nIt's pretty amazing - roast pork, fresh avocado, cheese, tomator, lettuce, and hot peppers on a slightly toasted kaiser bun.  There might be bacon, but my wishful thinking might make me an unreliable narrator on that one.\n\nThey also have watermelon juice, or cantelope juice - that's usually pretty amazing. I don't speak spanish, and unfortunately, I annoyingly tend to forget that sometimes, but I swear to god, evertime I ask for the jugo de melon, they correct me and tell me it's agua de melon, and then everytime I ask for the agua, they correct me and tell me it's jugo.  My mother. My sister.\n\nThe sandwich \u0026 a large jugo/agua will set you back $6.", "author": "andrew G."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}