{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Fast and Fresh is the kind of place you WISH all your local spots would be: delicious, dependable, cheap.\n\nIt's the kind of place you take a friend for lunch when they visit your office, when you want to show them a \"local favorite\" and maybe want to buy their lunch without breaking the bank.\n\nIt's the kind of place where many of the regulars order in Spanish, and you stand behind them in line and grin to yourself because you know it's going to be good.\n\nIt's the kind of place where $6 gets you three tacos with fresh corn tortillas, plenty of guacamole, and lime wedges to top the whole thing off. \n\nCash only. Check it out.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I will weep openly if this place ever closes. Besides the delicious home-style food and little back garden, I don't know what magic is allowing a mom \u0026 pop place to keep going in a neighborhood I got priced out of years ago. I eat here whenever I'm in the area, and I solemnly pray to the Gentrification Gods that they stay forever. I love them so much, I had them cater my 40th birthday party (they can do parties, just ask! Victor is the man). Is F\u0026F fancy? No. Do they use the finest local/organic/trendy ingredients? No. Do they serve \"the best (Mexican food item)\" in New York? Don't know, don't care. Is it simple, tasty, and authentic food, made and served by awesome people? Yes. Those are your reasons to go.", "author": "J H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "This Mexican restaurant is definitely authentic! Only problem I feel it's a little overpriced but I guess that's park slope New York for you.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-01", "description": "I really wanted to love this place. I had a little mexican bodega in the east village which served the most authentic and delicious food around. However, I thought the food here was just mediocre and not very fresh. It looked like the various trays of meat had been sitting there all day and I was worried about even ordering it. I was excited about the mole chicken burrito from past reviews but it was only decent and pretty gooey with too much sauce. The highlight was actually the fish taco, which was very good with fresh tortillas and avocado. The pork tamale was too dry and too spicy. The guy I ordered with didn't understand any english and my little spanish wasn't enough for him to get the order right, so I left with one less taco than I thought I ordered. The prices are great, but I think there are better options (like maybe the brand spanking new Oaxaca across the street).", "author": "James A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-15", "description": "This place is disgusting.  Even when  reading through the 4 and 5 star reviews, people make note of all the gross crap they do like microwaving their meat before putting it on the grill, leaving bones in the meat, their al pastor not being true al pastor, etc.  And then there are the people leaving great reviews stating basically that it's the least crappy taco joint around but guess what, that still means it's crap.\n\nTheir tortillas are stale, their meat is never fresh as far as I've seen, the salsas are weak, the service is slow and the place is not close to clean.\n\nI know this is Brooklyn but my god, people, have you never had a decent $2 taco in your life?  I guess not.  \n\nThis place and the reviews are a joke.  Go ahead and read them or if you dare, go try the place.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Amazing, quick, and delicious Mexican food. They also have a casual and spacious backyard dining area. A neighborhood gem!", "author": "Laura V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "LOLZ TACOS DOWNTOWN BROOKLYN. The whole  affair is a pinche joke. Or so I thought, until I realized that Boerum Hill is practically IN Downtown Brk, and therefore three seconds (er, about a five minute walk) from my office. Caliente! \n\nSo, this isn't the best taqueria in the universe... in the grand scheme of things, it is fair to middling. However, surrounded by the likes of Super Taco and Happy Taco (both Chinese Mexican aka gross floppy wet tacos with gov'ment cheese, iceburg lettuce and tomatoes as toppings), Fast and Fresh Deli is my workday wet dream. I got the 3 tacos for $6 special last time I was here, and my juicy carnitas tacos were properly topped with cilantro and onions with a side of raddish... and I almost cried. Not from the onions, but from pure, unadulterated joy. \n\nSeriously, decent prices, friendly service, a solid carnitas taco, and actual Mexican owners... FFD is where it's at in Downtown/Boerum Hill. It's raining today but I've just enticed myself into a frenzy. I may just have to put on my rain booties and take a walk. Hasta luego! :D\n\nPS:I was just reminded me of an important fact. While it is true that 99% of the time I am a vegetarian... my main downfall is a good, meaty taco, preferably of the carnitas persuasion. #facepalm", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "Chorizo taco, goat taco, and salted beef taco. \n\nGood deal... 6 bucks.... But the tacos that special. \n\nNow I wouldn't really call it fresh if you're microwaving meat and then throwing it on the grill. No bueno. \n\nWilling to give it another shot to try your nachos but you guys close at 6:30. No bueno again.", "author": "Aviv S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Great, cheap, authentic Mexican food in an un-pretentious, friendly setting with great outdoor seating in the back.  Very deceptive as this place looks like a bodega but it's actually rather awesome!", "author": "Brett G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "AMAZING! Best Mexican food I've had in NYC so far (this coming from someone from San Diego). Cash only!", "author": "Andy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "I can't speak for their authenticity but my wife and I eat in little local Mexican places oftern. We had fish tacos and vegetarian tacos and they were very tasty, fresh and well-seasoned. And nicely priced. We like the hipster tacos across the street and we like Buddies Burritos, but we like this little mom n pop hole-in-the-wall better. Way better than Gallito's.", "author": "Happy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "This spot is amazing!!! Literally the BEST tostadas I've ever had! They have continuously served fantastic and fresh food for the past 12 years I've been going here!!! Victor the owner and his wife are great! It's sad that some other company opened a fancy taco shop across the street from them... But let it be known... I will not stray!!!", "author": "Piotre W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "This is the best, most authentic Mexican spot in the area. It's a great, low-key place with an awesome back garden where you can eat. So much better than the other taco places nearby, and the family that runs it is incredibly sweet and nice. Also has great breakfast burritos and cemitas.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "I love this place. Awesome food and great price. Very fast and good service. I will be back for sure. I hope day will have some more specials.. :)", "author": "Pajic A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Very good tacos. Tortillas seem homemade. It's authentic.", "author": "Jesse W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "Most Mexican joints in NYC are disappointing. This one is pretty good. 3 tacos $6. Chicken 3 stars.  Al pastor descent for this far north and bonus points for adding pineapple. Beef taco was made from a guisado.  Pleasantly surprised.", "author": "Edwin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "After eating here at least a dozen times in the last year I figure it's about time for an update. Fast \u0026 Fresh has never failed me. I've ate in the backyard, taken it to go, had it delivered...and each and every time I have finished my meal with a smile on my face (and a very full tummy!).\n\nI've had the tostadas, quesadillas, tacos, and burritos. My co-workers have had their hot plates, Cuban sandwiches, taco salads, and burgers. Nobody ever finishes a Fast \u0026 Fresh meal disappointed. \n\nI love this place. It's my go to spot and the perfect little hide out when you just need some down time from the office. If you haven't tried it yet - you really should. They make their tacos with love and the people who work there are great.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "I grew up in Southern California and spent five years in Northern - yet never thought of myself as a Mexican food snob. Everything was just cheap and good -  that became my baseline expectation. From San Diego, to Huntington Beach, to Santa Cruz, to Berkeley, to Sacramento - nothing struck me as particularly exceptional or terrible. Everything was just \"good Mexican\".\n\nThen I moved to New York. (I'm sorry to play into this cliche, but let's just be honest.) \n\nIs it really so much to ask for some reasonably priced, unfancy, authentic Mexican food in this city? Haughty Mexican-Cuban 'tequilerias' - sure. \"Taco trucks\" in the back of hipster bars - got it covered. Chevys? NO PROB. But seriously - what does a girl have to do around here to get a decent $6 burrito?! (And don't you dare say Chipotle!) \n\nThat's why I love and cherish Fast and Fresh Deli. Their burritos (carne enchilada is my favorite!) - full, delicious, sour creamed. Their tortas - all tasty (and a little greasy, sure) and filling. Their Mexican candies, chips, and sodas - yes, yes, yes! I feel lucky to have a place so close to my home ... that brings me truly Home. Yes I went there! Believe it!", "author": "christine h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "Fast + Fresh doesn't look like much from the outside, but they do an amazing torta. My favorite is the grilled pork and pineapple. I have only had the tortas, but look forward to working my way through their menu.\nThere is a small backyard area. They have a good selection of beers. What else do you need?\nNote: they close at 6!\n:(", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "What is love? Chorizo burrito don't hurt me, don't hurt me, no more...\n\nI've given out a lot of 4 star reviews lately; is it because I always walk into good places, or I'm just that naive about the places I go to and my incredible positivity just gets the best of every situation I stumble upon. \n\nSaturday lunch time I have several options, one of which is a burrito freshly made at this establishment right here before you hit Atlantic. There's a lot of fresh ingredients and you feel like they take care of what they are making; it takes a little bit and even that makes me feel better about the food. Snacking in the backyard is the best; it's bare bones, with a few tables, some sunlight, etc. You feel not like the hungover owl, but like a renewed squirrel, ready to pounce on the day. \n\nShut up that made sense...to me. \n\nThere's a pretty full menu of Mexican fare here and I can't wait for summer to bring me here again.", "author": "Victor L."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}