{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-15", "description": "My office orders from Fast and Fresh fairly regularly.  It's typically pretty good, nothing to write home about but consistent.  Today they seriously dropped the ball which made a lot of very hungry people that were stuck together in one office super irritated which is never fun.  \n\nFirst of all the delivery took over an hour and we had to call to see where it was. Honestly I think they forgot about it because it was another 20 minutes before it arrived after we called so we waited almost an hour and a half total for the food..If you want it, you are better off walking there to get it.  Delivery is not a good option here.  \n\nSecondly, the two vegetarian taco salads that were ordered were missing items.  They came without the taco shell (which is the best part), without any beans, the avocado that was in the salad was hard and not ripe, and the two salads both had chicken on them when they were ordered vegetarian.    \n\nLastly, they tried to overcharge us about 12 dollars on the whole bill.  I told the delivery guy who was super nice and agreed it looked like too much and advised me to call the restaurant.  Luckily they adjusted the bill after we called again.\n\nThis is not the first time they have messed up something on our office orders but this is certainly the most irritating.  Except that time when someone ordered three tacos and they only brought one....", "author": "SarahGlenn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Came here and had a burrito asada. One of the more delicious burritos I've had - very authentic and all around good Mexican food. Definitely coming back here more in the future.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "Food by itself is 2.5 stars, okay for NY standards but only worth going to because I live a block away and miss the LA taco scene. Al pastor was dry and I didn't see any pineapple that was supposed to be included. Beef was slightly better but nothing special, and they don't do asada.. red sauce was a bit weak. \n\n\nPrices are a little inconsistent too, I ordered to go and they charged me a bunch of extras like $1 for the onions to be grilled and $1.50 for 3 red sauces? Something that people who ate there were squirting out of bottles for free. What was supposed to be a super cheap meal somehow added up to $14 for a torta and some tacos. \n\nI do like that they are totally friendly to cilantro haters though.", "author": "R G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "The food is solid and even better is the backyard garden which makes you feel like you are relaxing at a hostel on vacation (and I mean that in the best possible way).", "author": "Susanna E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Best tacos in brooklyn. Everything else is hit or miss, stay with the great variety of unique tacos. The chivo (goat) and chorizo are my favorites.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "-tacos were so authentic\n-sat outside in the back on a nice day\n-casual\n-soooo inexpensive - I forgot I was in NY!!\n-chips for the guac were homemade\n\nI will be ordering takeout from here next time. Excellent find.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "This place is one of the last remaining amazing spots in Boerum Hill. In a neighborhood that is being overrun by chain restaurants and clothing stores we have to protect the little mom and pop businesses in this place tops that list for me. These guys will charge you $3 for a breakfast sandwich with eggs and cheese vegetables beans green sauce meanwhile Sparrow cafe down the street charges $9 for something much less substantial and satisfying. Plus they have an amazing backyard where you can eat your sandwich and  watch a soccer game.", "author": "Melody G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "Short version: bad food - go across the street if you want flavor.\n\nLet me preface this review by stating I am Mexican. I came here because of all the reviews hailing this place as \"the best Mexican food around.\" We came here and tried the chicken taco, the carne asada taco, the chicken tamale, the horchata, and the carnitas taco.  The salsas were very mild.  All the meats inside the various tacos were not seasoned well and the taste was bland.  There was no flavor.  The tamale was very dry.  The horchata is definitely the syrup that you buy and add water because it was also not good.  Clearly, all the people raving about the food here have never had authentic Mexican food to claim it's the best Mexican food ever.  I'm not saying it should be 100% authentic or the best Mexican food ever; but to have call unseasoned bland food Mexican food is offensive. Should be renamed as Tex-Mex food. For the price, I'd rather go across the street and pay a couple bucks more for Mexican food that has flavor.\n\nI will say great customer service.  Just not great cooks.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-02", "description": "I want to like this place. It's quaint, family-owned, and caters to a local crowd and the people that work there are super nice. The menu is varied and the food is cheap. But unfortunately, the meat is also cheap. Like very cheap, maybe grade-C chicken (is that such a thing)? I dig the authenticity, but I don't need to eat the same quality of meat they'd serve back in Mexico. Got a sandwich from there today and not only was the chicken pink and undercooked, it was also grizzly and frankly didn't even look like chicken. I'm writing this review for myself as much as anyone, so I can hopefully remember to skip this place next time I walk by. Because I really like the idea, but my stomach might not (jury's still out on that one..)", "author": "Bill B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "When I first found this place (thanks to Yelp), I was over the moon because it seemed so amazing and authentic and they made the guacamole fresh to order! And the idea of it being in a tiny Mexican deli was great...it seemed like a little hidden gem, which I think it definitely is, but I'm also realizing that these places are pretty common in NYC, this was just the first one I ever made it past the facade with. The outdoor seating is pretty awesome too. And so cheap!\n\nThe reason I'm only giving it 4 stars is because I wish it was open later...8 doesn't seem too early to close, but the past few times I've really wanted to go there I've been too late and pretty bummed about it. I also halfway wish it wasn't cash only, but at the same time it wouldn't be what it is otherwise, if that makes sense...\n\nIt's probably a good thing that it closes semi-early and doesn't take credit cards, otherwise I'd be taking advantage way too often. You should go for a taco!", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Enchilada taco is the best. The guacamole is great too - she makes it fresh in front of you when you order it. But the best part is the backyard - great to sit out in the afternoon", "author": "Avantika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Their shrimp fajita is really good \u0026 filling. Even though it tasted great couldn't eat it all one time only ate like half they put a lot of shrimps, \u0026 everything else in there. The Philly cheesesteak is really good too. If in the area again would definitely stop by again!", "author": "Sheprica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Amazing, authentic Mexican at a super reasonable price.\n\nDo not be fooled by the outer facade.  What looks like another bodega is home to some amazing burritos, tortas, cemitas, and tacos.  Everything I've tried there has been delicious and the portions for the price are unbeatable.  The staff is always friendly and accommodating.  While the fast-paced counter service suggests takeout, grab a Corona Familar, get your burrito to stay, and walk  past the counter out into the large back patio.  Under a trellis, you'll find long wooden picnic tables and a large flat screen on the wall playing Mexican league soccer. \n\nThe store is also a great place to find Mexican specialty grocery items like Oaxacan cheese and homemade chorizo.\n\nTotally out of the blue, I once went to eat at Fast and Fresh with friends while there was a large family party in the backyard.  Instead of telling us the back was closed for the occasion, they invited us in, gave us free beer and tequila and made us part of the party.  Truly amazing people.", "author": "Nick K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-17", "description": "What a disappointment.  Come on Yelpers! Best tacos outside of California? Give me a break. There are hundreds better Taco restaurants in other parts of Brooklyn and in the city.  The Red Hook Taco Trucks are a million time betters.\n\nWe had the spicy pork, chorizo, chicken and steak tacos - it wasn't terrible but it wasn't spectacular either.  \n\nGiven that its 10 blocks from my place, it would take a herculean effort to get me there again", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "This place is amazing. Everyone that works there is so friendly and the food is delicious. The spicy pork tacos and guacamole are delicious. Overall, most of the tacos look great. Would definitely recommend, can't find better food for a better price in NYC.", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-16", "description": "I have a favorite mexican spot in Chelsea called The Great Burrito that place is awesome. Only prob is I live in BK, and I was not about to take the hike so I came to my good friend yelp to fine some mex and not that tex-mex crap served by asians. \n\nI saw all the 4 and 5 star reviews and said let's do this, but once I got there I thought do I really want to eat here? The place was filthy, it look like the type of place you could score some crack or weed with your tacos. But going by the reviews I thought what the hey I came this far.\n\n I ordered from the menu above and thought my glasses, need glasses to read this fine print.  I got the 3x $6 tacos. After ordering I paid the cashier who had just sneezed all over his hands, then he took my money and give me my change and napkins with the same hand, I almost said keep the change but pimpin ain't easy,  \n\nI was really hungry so I scarfed down the first taco, saying hmm. ok not bad, started working on the second one and into my second bite I felt something wiry, me praying please let this be cilantro, please let it be, AHH CRAP! A Long curled wiry hair. I said ain't this bout a b!t@#!  I was pretty much done at that point. Listening to the guy behind the counter saying he just started the flu. GROSS!!!! \n\nI felt dirty after leaving, like I just eat tacos while sitting in a public bathroom, while the person in the next stall was taking a sh!$! \nThanks, but NO THANKS!!!", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Fast and Fresh deli is conveniently located 2 blocks off the Hoyt-Schermerhorn (ACG)stop, it's tasty and cheap.... maybe not super fast as the title suggests, but still worth a visit. \n\nWhen I go I get the 3 for $6 tacos, al pastor with extra radishes. I took off one star for two reasons, the first is that the pork used in the sandwiches still had bones it in and I was not expecting that. The meat was tender and properly seasoned, but I hate having to eat around bones when having tacos. I did, however,  appreciate the thick chunks of pineapple and their salsa. The second time I went they didn't have radishes and that really put a damper on my meal. I know, I'm nit-picking, but it's all a part of the authentic experience. There's a cute patio out back, mexican tunes on the background and bottled beers in the fridge. They have great deals on their combination plates, tortas/sandwiches and it seems they have some good breakfast specials too. \n\nIf you like Mexican food, this is the ghetto stop for sure.", "author": "Suzy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I love this little taco place. Great Mexican food, prepared to order and very reasonable prices. Don't you dare go to the chain store across the street!  This place has everything you need and more.  Nice little seating area in the store and in the back, or great to-go orders.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "If you're looking for authentic Mexican cuisine you can come here price is great food was lacking a bit of flavor but you can work with it.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "I would give this no stars if possible. After ordering by phone, using the menu off menu pages, the food arrived. However, the price was double what it said on menu pages. $14.00 for a fajita, rather than $7.50. If it was good, then I wouldn't be so outraged. This was the worst Mexican food I have ever had. Missing some of the ingredients, bland taste, and the tortillas came in a plastic bag just like it was from the grocery. Nothing homemade with that. Thoroughly disappointing experience, and with so many other Mexican restaurants in the area, don't make the same mistake I did.", "author": "lance k."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}