{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-03", "description": "This place is a real gem. If you happen to have wandered in because you were curious, good for you. It's like finding $10 on the floor. \n\nFrom the outside, it looks like a regular bodega. Once you walk in, you'll think you're just ordering some tacos. Suddenly you see an outdoor area with seats and tables. Nothing fancy. Feels like you're in Mexico City eating outside. \n\nThe tacos are another story. Super delicious. Super satisfying. Super cheap. \n\nCarnitas - not your typical carnitas. It has the crispy pork skin!\n\nAl Pastor - pineapple pork. The best I've had. \n\nLengua or beer tongue - so tender and tasty. \n\nComes with a roasted jalapeño that's spicy. The home made hot sauce is equally satisfying and delicious. \n\nIt won't be long before the masses go where it'll no longer be a hidden gem.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "I LOVE THIS PLACE! \n\nBeen coming here for years since college was nearby, and it's been my favorite comfort food (especially after exams). Honestly at first I was quite skeptical of ever entering, but I would always pass by because I went to Absolute Coffee so often, I thought I may as well! And it's been one of the greatest food decisions of my life!\n\nI usually snack on a chorizo tostada and add extra avocado on top. There's usually a bit of a wait (~5-10 minutes), but once you get it it's just like wow, this is heaven! It's a mountain of fatty goodness on top of a crispy tortilla shell. It's loaded with chorizo and spicy oil, some bean paste I think, a bunch of sprinkled cheese and cream on top with the avocado. The process of eating it is pretty messy but your stomach will appreciate it. Super yummy and I don't think any other place I've been to can top their chorizo tostada.\n\nI've tried their tacos, torta and burrito bowls, and agree with others that the torta isn't very amazing, but everything else is great, though the chorizo tostada really tops all for me! Also love that it's a local, family owned establishment - the lady and gentleman at the front are always very kind. The back has more space to eat if you need it too.\n\nNote that prices have gone up slightly too, but it's understandable considering the area and that chorizo tostada that is practically a meal for me has still been under $5 -- score!", "author": "Corinna Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Hands down the best tacos in the area. This place may not look the part but the food is solid. I will be coming back here more often.", "author": "Vimal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-20", "description": "Ehhh last couple times I went they really did the bare minimum on the meat. Still good but deducting a star.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I apologize I didn't take any picture of my delicious pulled pork tacos - extra spicy,  blame it on my hungry stomach.  I was on my way to pick up a pair of shoes I bought online from Macy's and I passed fast and fresh.  I made a mental note to return because I didn't feel like cooking. Again,  I tell you, I must walked pass this restaurant a million times and never noticed it.  Honestly,  it must be because it's Halloween night. So, I did return and got two spicy pulled pork tacos and they were the best tacos I've had in a very long time.  Fast and Fresh won me over with just two tacos,  I can't imagine what I might be feeling right about now if I had a burrito or a sit down dinner.  Go Fast and get your life!!", "author": "Percy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "So hubby and I were in the neighborhood and he um... Torta thought it would be a swell idea to stop here for lunch. He was hangry and not in the mood to wait while I angsted over other possible options.  If I ever wanted to win the proverbial war, I realized this was not a battle worth fighting, so Fast \u0026 Fresh Burrito Deli it was.\n\nNow, to back up for a second, this used to be an occasional go-to for us back in the day.  But it had been a looong while since we'd eaten here and sure, I was Torta curious to find out if it was still good:\n\nAnyway, would you believe I wound up getting a Torta?  Well, I did; with spicy pork, aka enchilada.  And I don't know... the bread was a bit dry and probably bordering on stale.  And all I could taste was meat, which just wasn't special enough to carry the whole sandwich.  To me, a well-made Torta is all about layers of flavor, and I just wasn't feelin' it with this. \n\nFrom what I remember, the Tortas here used to run around $5 or maybe $6 and for that price, I can be a whole lot more forgiving. But they've inched up to $9 now, and more $ = higher expectations.  On the plus side, this was big enough for me to save half to take home to the kid, who fwiw, also found the sandwich to be pretty 'meh,' without any prompting from Mama.  That's my boy.\n\nHubby got a 'Burrito Bowl' for $9.50, which I think is a newer thing. He enjoyed it well enough, but not so much that he feels compelled to ever eat one again.\n\nIn the 'every bit as awesome as I remember' category, the backyard is happily still the same.  I love how this otherwise random-seeming deli opens up to such a charming, little outdoor space. \n\nSince I wouldn't protest *too* much about returning here to dine 'al fresco,' when spring hits, am going with 3 stars.   But ultimately, am Torta disappointed.  In fact, I don't want to Taco 'bout it anymore.:)", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This place is a great authentic gem in downtown Brooklyn. It's a no frills spot serving up affordable, tasty Mexican fare. Tacos, torras and burritos the size of your head for very reasonable prices. The chivo (goat), carnitas and spicy chicken are all amazing fillings. They also have an amazing outdoor sitting area in their backyard for nice weather. However, no alcohol. A beer with the food would of made this perfection.", "author": "Rivya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Discovered this little hole in the wall while walking around during my lunch strolls in the neighborhood.  Was pleasantly surprised to see this spot  serves up some really tasty dishes at a reasonable price.\n\nMy favorite items to indulge in are the huaraches, or soft shell tacos either the vegetarian, fish or shrimp ones.  Everything is always fresh and the food goes well with sorrel/hibiscus drink or horchata (rice milk drink). \n\nThe best part of this little gem is the outside seating area, it's so rustic yet serene when enjoying lunch on a warm sunny day.\n\nThe staff are very nice and accommodating, even when you desire an item with a particular protein, they'll hook you up.\n\nThe place is always buzzing with neighborhood workers, construction workers and municipal employees, grabbing a bite to go.  \n\nIf you're in the neighborhood, definitely stop by and grab a bite.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Great local joint with authentic Mexican street food. Price is right too. I'm a fan of Oaxaca Taqueria across the street, but generally prefer Fast and Fresh. This place also has a nice backyard to sit and and eat in.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "Fast and Fresh is a great option for quick Mexican Food.  I like to take my order and sit in the back yard.  I usually ask for the daily specials, which usually vary from day to day.  I'm open minded, and one day I was fortunate to try the stewed goat tacos.  It's a great way to try Mexican items that you don't normally find around this area of Brooklyn, like pancita \"Mexican tripe soup\" or fresh tamales (chicken, pork, cheese). Victor, the owner is a nice guy.  One day I asked him if he could make me some agua fresca for an event that I was catering.  I supplied the watermelon, and he was kind enough to make it for me.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "I ordered three tacos the shrimp beef and one chicken I really like the shrimp and it was very spicy are usually don't like spicy but it was a very good flavor next time I will try something else", "author": "Nina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "We got chilaquiles with pork and huevos rancheros for breakfast this morning.  The rancheros was great but the chilaquiles were among the best I've ever had.  It's a pretty unassuming restaurant but it has character and I'm really excited to go back.", "author": "Ted A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "I'm from California where we know GOOD Mexican food and this is about the closest place I have found in the city that makes the beans just right. They make a mean good ol' fashioned burrito that hits the soul. I highly recommend!!!!!!", "author": "Neel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I had been missing good mexican food ever since moving from California. I'm so glad I found this place! Service is friendly. Portions are huge. Ingredients are fresh. I got a burrito about the size of my head for $9. \n\nI do wish there was more seating inside, but once summer comes around, the outside eating area will be really nice.", "author": "Sophia H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "Not a fan of this place. A bit pricey for the quality. I'd rather have gone to chipotle. The chicken quesadilla didn't taste the greatest and was very oily and greasy. They don't give a lot of beans or lettuce with the order. It was my first time here and probably won't ever be back.", "author": "Cyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Caught them before closing and they were happy to place my order for take out. My veggie burrito had carrots in it which I don't remember listed on the menu.I'm allergic unfortunately so I had to pick them out. But preparation was fairly fast to make and burrito was really good otherwise.", "author": "A. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "REALLY GOOD breakfast burritos served all day. Ask for the hot sauce. Low key and perfect for a quick bite. they have a backyard but we went in the winter so we sat at one of the stools. They have free delivery so this may become our new go to weekend breakfast spot. They have a pretty big menu and I want to try a few more things. Lots of vegetarian options. Highly recommend!", "author": "Tali E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Unassuming deli/bodega serving tasty and solid tacos, flautas, nachos, and other Mexican fare. This is the best Mexican food I've had in NYC and my son always begs me for the chicken tacos! There is backyard seating area in the back, but we usually order our food to carry out (or for delivery) since the interior of the restaurant is essentially just a takeout counter.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Great vegetable burrito! Lots of flavor! Cash only, but you can practice your Spanish :)", "author": "Ariel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Had 3 small tacos - goat, Al pastor, Verde Pollo. All were great and a good amount of food. There is also a nice backyard area to eat in.", "author": "Amit P."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}