{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "My favorite tacos in the neighborhood. They're cooked to order, tasty, and reasonably priced. My favorites are the chorizo and chivo tacos. I usually order them to go but there's a small backyard patio area in the back. Small, family-run business. Cash only.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Unpretentious family place that offers the biggest and most delicious quesadilla.  Feel free to shower it with hot sauce and peppers on the side.  Go to the backyard, because it is amazing to sit there and chow down your food fearlessly!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "I'm a 30+ year Mexican native that's been living in NYC for 4 years, although there are some great Mexican places around the area; when your looking for something close to downtown Brooklyn, good Mexican food is hard to find.\nI stumbled upon this place by accident, the un assuming facade and the word deli would never make you think that this is the most authentic Mexican food you will find in downtown Brooklyn hands down. The owner and operator is a native Mexican which is refreshing if you consider that a lot of Mexican food spots have non Mexican owners and only employ Mexican cooks.\nI started off with a torta de milanesa, a typical Mexican chicken cutlet sandwich, and, it was out of this world, definitely legit, at 8.50 (tax included-cash only) I would say it's a bit pricey but if you take a step back and look at how much a chicken cutlet sandwich will run you at a deli and it's about 3 bucks less on average.\n\nThe tacos are awesome as well, the Barbacoa (lamb) taco is probably up there with my favorites along with the pork carnitas pastor and then chorizo.\n\nIf your in the mood for Mexican food and don't feel like trekking it all the way to far Queens this is the place for you.\n\nMy only comment would be the tortillas, everything here is made from scratch and with love but the tortillas seem to be white corn pre made, which is ok, but as a native Mexican the tortilla for me is the key to any Mexican meal and nothing beats a yellow mixtamal tortilla preferably hand made, this would probably raise prices but I'm sure they could find a provider of more legit tortillas.\n\nAll in all this place gets my 5 stars, I've eaten here dozens of times, the owner is the coolest guy (gifted my wife and I some pan dulce at a point) and you can tell that the 10 years he's been running this shop with love have paid off, this is the go to for all the hard workers in the area and a testament of the will to succeed that immigrants bring.\n\nBravo!", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "I went this afternoon and everything was great. Guacamole, tacos, cemita and tamales where on point", "author": "Robert F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Quick and easy authentic Mexican comfort food. Im not used to paying more than 2 dollars for a taco because i'm from Cali, but otherwise the food here is delicious and just what i'm used to. The al pastor and asafa are bomb, I go with an asada torta and 2 pastor mini tacos. Those are my favorites, and it's cheaper and tastes better than other Mexican restaurants in the area. I'd rather go here than any fancy Mexican place any day.", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Who knew that there's great Mexican food in Downtown Brooklyn? Having moved from San Francisco last year, I've been searching for a good pastor taco in vain ever since!\n\nThankfully, Fast \u0026 Fresh delivers delicious, inexpensive Mexican food in a low-key, homey environment. While you won't find California avocados here, you will find a trio of perfectly seasoned al pastor tacos for just $6. Their burritos include some unorthodox touches like roasted peppers and tomatoes, and are also worth trying. There's a spacious back patio which is perfect for big groups or just relaxing in hot weather. A must-try if you're in Downtown BK for lunch!", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "THIS PLACE IS AMAZING !!!!, with all honesty the best most authentic Mexican food I found in Brooklyn. Everything is made with love and you can taste it!. I also enjoy the Mexican sodas they have to really feel like I'm in Mexico. I would recommend a burrito, but if it's too much for some people, soft shell tacos will do the job. Must try if in downtown Brooklyn you will see what I'm talking about.", "author": "MR. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "When I say that I love you, Fast \u0026 Fresh Deli, I don't mean some cheap, fleeting love at first sight. I'll be the first to admit that in the past, I've been sucked in by a greasy taco at a vulnerable time in my life. However, the deep, abiding affection I feel for you is a friendship, a mutual respect that's been built up over time through trust and burritos. \n\nYou've been there for me whenever I've been betrayed by the inconsistency of a slutty sandwich shop whose initial promise had me flying high one day, and sobbing into soggy bread the next. You've been there for me with a quick and greasy torta during prime brunchtime, when waits are interminable and no one seems to care that I might die if I don't get some food in me fast.\n\nSure, there might be tastier tacos around,* and your al pastor isn't really al pastor...but I truly appreciate that you always offer such excellent value, and that your chorizo burrito is consistently satisfying. \n\nI don't just love you; I like you too. \n__________\n\n*Not in the immediate area though. This joint absolutely poops on Pacifico's food.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "I've been to this place many times, and they over charge me every time I go there. Even when I show the lady the price in their own menu. But I noticed that every time I send my Hispanic or White friends there they get charged the correct price. So I send one of my friends there again as I waited outside and they were charged the correct price. So I went in as soon as my friend stepped out and I ordered the same exact thing. The lady still overcharged me. Smh...I will never go there again.", "author": "Machel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "This is my favorite place to get mexican food in all of NYC! This place seems like your average deli from the outside but on the inside they make some of the best Mexican food in New York. I live in Manhattan but whenever I am in Brooklyn I make it a point to stop by here. \nI usually get tacos or tostadas. The tacos always come served on two corn tortillas. I've tried pretty much all of their meats and they are all delicious. Their Carnitas is always perfectly tender and tasty. The tostada shells stay crispy and somehow hold up all of the toppings that they put on them. \nMy one recommendation if you go is get a chorizo tostada. It is one of the best things I have ever eaten!", "author": "Maria G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "The burrito is still warm in my belly as I write this review, so I think I can provide a fair assessment of how it is.\n\nI've been on a quest to find a SoCal burrito in NYC. So far, all the recommendations I've received haven't hit the mark -- until now. This is the most authentic San Diego-style burrito I've had since moving to the East Coast. If you're a Californian, you'll feel right at home at this hole-in-the-wall spot. \n\nMy recommendation is the mole burrito, but the tort as look really good too. The reason I docked a star? The chicken was a little grisly. But the mole was perfect, as were the beans, rice and crema.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "I work in the proximity and had passed by this place countless times largely due to its modest appearance.  This wound up a mistake as this place is a little gem that serves great authentic Mexican food.  Now,until I started coming here, I had not been fan of the Mexican cuisine (thanks, east coast!), but this place made me reconsider.  The backyard seating area makes it great option for a lunch sit down.  As I said, the place is not appealing to the eye, but perhaps that's a blessing in disguise as it definitely adds authentic charm.\n\nI highly recommend the steamed goat tacos -  love it when they add the fattier goat pieces in there :))).   The chicken mole burrito is the favorite of those  I've tried so far.  Here, the creamy, rich mole sauce is a standout.\n\nThis place is a no-brainer, especially for lunch.  The food is delicious and cheap.  Can't ask for much more.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "My FAVORITE Mexican restaurant in the neighborhood! Victor and his team are always friendly and kind, and the food is delicious and authentic. Its great for take out or delivery during the week. And in the warmer months, the back patio is a great secret hang out spot for locals! Not long ago a flashy new Mexican take out chain was opened across the street, no doubt to cater to the gentrifying newcomers to our area. But it is a taste-less, white-washed version of the authentic Mexican you can have here. Newcomers do themselves a disservice if they don't give this lovely local mainstay a try! Long-time area residents like me know where the great neighborhood eats are located, and this is definitely one of the quaintest!!", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Great tacos at very reasonable prices with a great backyard to boot. A family owned shop -- the owners are terrific and very welcoming. Highly recommended!", "author": "Boaz W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "The food was very good and flavorful but seems like they might have upped the prices and lowered portions  compared to some of the older reviews I see on here.  I ordered the al pastor burrito plate not in the tortilla perhaps that's why I was a little underwhelmed with the portion.  Don't get me wrong it was enough but I was expecting a huge portion based on the reviews here.  Also at $9 I can't say it was a great deal considering the price.  I will say it was very tasty with a noticeable garlic  flavor I'm not used to getting in most Mexican joints I've tried in nyc, I liked it.  Would definitely try again just not quite what I was expecting. Was hoping this would be a good regular place for me whereas it'll likely end up more like an occasional place I eat from.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "I love everything about this place. Sure, it's not the fanciest looking place in the neighborhood, but they have so many authentic Mexican food items to choose from. \n\nVictor and his wife, the proprietors, are extremely friendly... If you see something that you're not sure of, they are more than happy to give you a sample to taste. \n\nThis place beats Oaxaca across the street hands down.\n\nAlso, in reading some of these 1 and 2 star reviews, it's clear that some people just can't be satisfied unless their plates are flaked with gold and someone is fanning them with palm fronds.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Good street style Mexican food is hard to find in this city. This place is on point.  Do yourself a favor and skip the fancier chain taco shop that is across the street and dip in this place instead. Sure it's smaller, grittier,and warmer in the summer but...\n\nThey have a range of 2$ tacos with real Mexican ingredients, such as mole, lengua, pastor, chorizo and among others. Their breakfast sandwiches and burritos are huge AND delicious. \n\nI think the street style burritos are the real star of the show. It's enough for two meals and comes in at 6.50. They've also got a nice covered patio in the back that is great for eating with co-workers.", "author": "Wes C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "Like you are Mexico! very authentic! \n\nCheap and decent burritos . The place doesn't scream cleanliness though (actually we couldn't even find their score card) \n\nFor $6.50 you get a hearty size burrito. It's not fancy but it's definitely more authentic then the Oaxaca across the street (which btw seems a bit cruel having both across from each other) \n\nAlso the lack of Mexican beers here really doesn't help. The back patio would be perfect for beers and burritos.\n\nThe girlfriend did have a upset stomach after .. Again just like Mexico!", "author": "R J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "With World Cup season upon us again, this is now my favorite spot in downtown Brooklyn to grab food and watch matches.  First of all the food is great.  Not great for Mexican in downtown Brooklyn on the cheap, it's really good authentic taqueria.  The tacos and burritos are flavorful, fresh and delicious.  I've never had to wait too long for the food, they make everything fresh, so I'm usually ok with any wait there might be.\n\nThe prices are very reasonable, $2 for tacos and $5-7 for burritos.  Add to that a nice covered outdoor patio with a TV to watch soccer.  There are long wooden benches and tables, as well as table and chair sets.  Indoors there isn't much seating, it's mostly counter space with bar stools.  So it's not ideal to eat in if the weather isn't good, but take out always works.\n\nThe biggest problem I had was trying to cheer and comment on the game even though all i wanted to do was stuff my face with delicious food.\n\nI know, I know, first world problems.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "The burritos here are legit. They've got their Al pastor down. Chorizo torta is also very good.", "author": "Michael C."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}