{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "FINALLY, really solid Mexican food in downtown Brooklyn. After last week's disaster of mediocrity at Gallito's, Yelp led me to Fast and Fresh Deli, which is really just a takeout counter with a fantastic backyard.\n\nSplit the pastor cemitas and carnitas torta with a coworker, and both were really solid. The pastor was really well-marinated and delicious. Sandwiches run $8.50, which is a reasonable price and they're well worth it!\n\nNext time, I go for tacos. But I will 100% be back. This place came out of nowhere! Totally recommended.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "This place is amazing and authentic! The staff (Victor) and company are the best! Extremely welcoming and the food is top notch! It's always fresh! This place has become my go to place for everything Mexican! You guys rock.", "author": "Craig K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Outdoor seating in back. We were there are 6:30 pm on a Friday and there was lots of open seating. The torta and the cemita were good. We got the pork roasted with pineapple.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Great authentic Mexican food for a decent price. Love their tostadas! Always come to this place when around the way", "author": "Joel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This place is awesome and now my go to when I'm craving authentic Mexican tacos and food. I stumbled on it leaving the gym and was craving potato and egg tacos. I'm coming from Texas and missed grabbing a foil wrapped breakfast taco with salsa verde. The restaurant didn't have breakfast tacos on the menu but the woman said she would make what I wanted! I got two potato, egg and cheese tacos and four chorizo and potato tacos. They came with cilantro, onions, limes and salad verde-- exactly what I was craving! They didn't disappoint! I will be back because there were a few more things that caught my eye on the menu... carnitas, flautas... great find!", "author": "Tresha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "This is a GREAT Mexican food joint! The food is authentic and DELICIOUS! The people working here are so kind and welcoming! \n\nThe backyard space is also really cute!\n\nDefinitely a place worth checking out! I come from Prospect park just to get their delicious authentic food! It's also really affordable!!!", "author": "Karina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "Really good Mexican food here. The first time I heard about them was when a friend told me that he and a bunch of other SoCal friends stopped in because they could make you Carne Asada fries here. Yay customization!\n\nI'm not the Mexican Food Queen of SoCal by any means, but I have some standards, and Fast and Fresh ranks pretty high. I've had the tacos, the burritos, the nachos, and all were good here.\n\nThey are a cute, clean, mom and pop shop, with decent space and good outdoor space in the back. And I wish I could come here more often, but, as strange as it is to type this, I can't afford to eat Mexican food regularly. Which is really weird. And that's the ONLY thing that makes me unhappy is the price. I am aware that their location causes them to up the price, and in New York, if you want decent Mexican food, you really have to go hunting AND pay more than you'd like. So it's par for New York, but man, it's depressing!", "author": "Melody C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "I need to update the review I submitted four years ago 'cos the prices have increased considerably since then. The Fast \u0026 Fresh Burrito I used to order for $6.50 is no longer on the menu \u0026 all burritos are now $9. \n\nWhile I'm surprised that a Mexican deli like this can still exist in such a gentrified section of Brooklyn, I'm not at all surprised that they had to raise their prices. \n\nI stopped in this morning, en route to JFK, \u0026 ordered a 'Mexican Breakfast' of Huevos Rancheros. While it was tasty, I don't eat out of styrofoam (on behalf of Planet Earth), \u0026 $8 is a little on the pricey side for a meal like this. \n\nIn closing, Fast \u0026 Fresh still receives the San Francisco native stamp of approval for flavor but I am gonna have to retract my 'Eatin' Out in Brooklyn on a Budget' award from 2013.", "author": "Beau W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Yummy chorizo burrito $9. Pollo cemita $8.50 (chicken sandwich on sesame bread). Pollo con Chipotle taco  $2.50.  Portions are not huge but very satisfying.  It's cheaper than foods you would find in the area and that's not full of grease.   Food is authentic Mexican. Fast casual kind of place.  Cute outdoor seating in the back.  Everyone from the lady cashier,  the cooks, guys working in the back are very nice.", "author": "Sue H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "This is literally a little hole in the wall. I cant tell you how many times I've walked by and never I mean never noticed them. Thank you guys at Yelp! Walked over here during lunch. Cute little place with a nice backyard looking place to eat. This time I did take out. Ordered Steak Torta. It was good. HUGE bread! Comes with breaded steak, lettuce, tomato, Mexican cheese, crema, frijoles(Mexican beans) avocado and jalapenos. Yes all that in that torta. Check out the pictures. Made it to work and was shocked. Finished 1 half. It was tasty and filing. My only complaint is the meat is really really really thin. I could tastes it but there wasn't much. Maybe next time I'll get the tacos instead. This place isn't expensive for the area it's in of course.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "Come here for the cheap tacos. Stay for the backyard.\n\nTacos are about $2.50-$3 apiece. Get the chorizo or the chivo (goat) tacos. You can skip the pork ones. Their pastor isn't actually al pastor (no spit in sight), and the enchilada (spicy pork) was just okay.\n\nThe tortillas seemed a bit stale to me. And they're pretty barebones when it comes to condiments (there was very, very crusty bottle of Valentina hot sauce on the counter).\n\nService is a bit slow. I watched a woman walk in to buy some chips and get ignored by the staff. She even called at them, and they just told her to wait. Tacos took awhile to make too.\n\nBut oh, the backyard. A wonderful place to be when the weather's nice. It looked like they had just started setting up for the summer and futbol season. There was a Mexican flag that still had creases from being in a package, and there were employees putting up an off-brand flat screen TV. I imagine it'd be a fun place to catch a game and eat a couple of tacos.\n\nThey're not officially BYOB, but if you ask nicely and pour your beers into a paper cup...\n\nAnyway, go to Sunset Park or Queens if you want good tacos.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "So happy these people are still here. They renovated the front area with a place to eat at the window and the back yard area is still so nice. I had an amazing pastor taco which they had never really had before. \nOne sad thing is they stopped selling beer. I'm thinking because of the seating area they needed a liquor license. I'm bummed. Modelo good with tacos. \nDon't go to the stupid hipster place on the corner. Go here and be happy. These guys right across from Steven Adler. Have a taco. Support local business.", "author": "Mimi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "3 stars for now. My breakfast chorizo burrito ($8) was tasty but had small pieces of egg shell in it. On the plus side, they have a nice backyard space.\n\nI will be back to try their food again.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "My frequent go to spot for a quick, affordable bite. Run by what I like to imagine is a Mexican family unit, Fast and Fresh literally lives up to its name. Food comes out quick and it tastes fresh. The menu covers all the Mexican classics and executes it well (I particularly like their Tostadas). The place also has a nice looking seating area in the back. Directly across is an Oaxaca Taqueria. They do better tacos, but Fast and Fresh is better priced.", "author": "Daniel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Not bad at all!  Looks like a rando shop that might serve you crappy food but it's pretty good burrito!\n\nI'm from SF originally and I was always told good Mexican food doesn't exist in the east coast.  I opted for the chicken mole instead of the famous al pastor cause I don't do pineapples :(.\n\nThe chicken mole burrito uses chicken leg meat instead of breast (so said on menu)  I also opted out of sour cream, but yes to everything else including cheese!  \n\nI like how the mole isn't overbearing but still has that small kick to it.  The meat is soft and easy to bite and yes, the bits of peppers is different than a Cali burrito but I liked it nonetheless\n\nTotal for the burrito was $7!", "author": "Laurie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "Chill back yard. Al pastor tacos were super greasy. I'd return for the back yard respite.", "author": "Alan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "This place has great tacos! I love tacos, and this place is legit! Fast, friendly, and tasty, I'd highly recommend.. the outdoor space is super cute too!", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "If you want authentic Mexican cuisine this is the spot you want to visit. It may not be fancy but at the end of the day I'm looking for homemade style food. \nToday I'm having a torta de Milanesa de pollo. The tacos here are excellent and the nachos supreme are out of this world.", "author": "Bolivar A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "This place is racist. I, a black person,  very nicely ordered two soft taco. Remind you in the other taco restaurants, this takes 3 mins  to prepare. The lady who took the order  told me 5 mins. Three customers came in and placed their order after me and were  all served before me. The customers  were Spanish and white.  Remind you, the white man who ordered  the same two chicken tacos as me got his order, sat down and was almost finish when I git mine. When I told the woman who took my order that they served all before me, both her and the cook had the nerves to tell me that they were here before me, as if I was not there when they placed their orders after me. The 5 mins that I was told to wait turned into at least 15 minutes. I picked up the racist attitude, especially  from the cook, who proceeded to argue with me, but I told him it's okay, because I knew that I was going to put them on blast. With all the racism going on in this country, I am asking black people to not support fast and fresh burrito deli. I lowercased their name, because that taco spot is beneath me.", "author": "Iehienka W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "I've been looking for an authentic no frills Mexican fast food place and I found it. I highly advise you to drop by here after shopping at Fulton mall for a lunch. The tacos were pretty good and 2 mini tacos and half a torts were enough to make me full, which comes to about $9. Which is almost Los Angeles prices for Mexican food.", "author": "Ani S."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}