{"aggregateRating": {"reviewCount": 168, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "For a little deli and anyone desiring some good Mexican food for a good price - this is place to be.  They have also have a covered outdoor patio!", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Great place, food is pretty good, and employees are very nice.", "author": "Giorgi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Pretty good Mexican breakfast burritos. Perfect treatment for the hangover. Grab your self some coconut water while your at it.", "author": "Leonard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "If I had any musical skills, I would write a love song to this place because it has gotten me through so many hangovers that it probably deserves a bequeathing. \n\nThree carnitas tacos, extra lime and extra spicy, large bottle of water. weekend saved.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "This is my go-to taqueria when I don't feel up to getting on the subway and going to Sunset Park. The Mexican couple that runs the place is sooo sweet, and their food is reliably good (even by my snooty, SoCal standards). They have all your basic tacos, tortas, cemitas, enchiladas, and ensaladas, and on the weekends they have special dishes like goat stew and pancita (for fans of more authentic Mexican food). For reasons unbeknownst to me they also have regular deli staples like hamburgers and heroes. Needless to say I have never ordered any of those.\n\nTheir tacos are probably worth 3 or 4 stars, but they get the 5th star for being so personable and because during the summers they make the BEST aguas frescas (jugo de sandia FTW!!!) I just wish they were open later in the evenings, because no one in NYC gets off work by 6 pm.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "I'm a texas transplant and this is the best cheap mexican I've had in NYC hands down.  The burritos, tortas, and salads are all great.  Quesadillas and tacos are pretty good.  Get the chicken burrito.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Excellent, authentic burritos (among many other options).\n\nTo be clear: this is a deli--order at the counter, and if it's nice out there's plenty of seating in the back yard.  But if it's winter, this is not a place to sit at and eat--there's just a counter with a few stools.\n\nThat said, their delivery is rapid and the food is excellent, so I highly recommend for takeout or delivery or to sit in the yard when the weather is nice.", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "This is another \"secret\" place that everyone knows about now.   I lived around the corner from this place for three years before I finally tried it- and wow!  What was I doing going to Pacifico all that time?   Fast + Fresh is far, far better. \n\nI bring out of town friends here all the time because it's one of those excellent New York under-hyped cheap dining experiences.  My last out of town guest went back three days in a row!\n\nFrom the outside it's just an ordinary looking deli.   You order at the counter and get your food on a paper plate on a plastic tray.  (They also do takeout and delivery).     Everything I've had there has been great.      Tacos are 3 for $7,  the breakfast torta is $3.50.   It's a great bargain.   In my experience, Fast \u0026 Fresh is not and will never be  fast.  But it's worth the wait.  Fresh ingredients and wonderful food made with care.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Living in the East Coast, it's really hard to find good Mexican food.  Whenever I go to California I'm always eating at least one Mexican meal a day.  Now I'm not even going to suggest that this place is up there with Californian Mexican food but it's probably the best mexican food in the Bococa/Brooklyn Heights area.  Do not go to Mexicali Rose.  Go here instead.  I absolutely love their veggie burrito.  So big and delicious.  \n\nThey also have some amazing breakfast sandwiches and burritos.  You can even eat there because they have a nice outdoor area.", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "I'd add two other adjectives to their name, delicious and reasonably priced. I eat here at least once a week, and love it.", "author": "William K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "this place rules.\n\nfood is delish. prices are cheap. quiet outdoor seating in the back.\n\nive gotten a carnitas burrito here twice and both times i wanted to kiss the nice man making it. the pork is juicy and just the right amount of fatty. burrito is stuffed with rice, cheese, salsa - and it is HUGE. \n\nthe storefront is pretty deceiving, as this place also sells a buncha other random food things, but don't be fooled. they know what they're doing. you can definitely eat well for under $8.", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-23", "description": "I wonder how much accidental business they get from people not getting into Miles End across Atlantic ave for one reason or the other (long wait, 4-5:30pm break, etc.)\n\nI became one of those \"accidents\", and as (mis)fortune would have it, it was on the same day Dos Toros had a soft opening night with free food at their new Carmine and Bleecker location. So I had two burritos on the same day, both judged through the filter of my San Francisco Mission district burrito past life memories.\n\n\"Fast and Fresh\" wins in price ($6.50), but loses in ingredients. Rice and beans turned into unpleasant mush. Pork would benefit from being better roasted. Decent for New York and passable overall, but not a crave-worthy burrito.", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "By far the best tacos in the downtown Brooklyn area.  Chicken tamales and Chorizo tacos (with avocado) are bomb.", "author": "Stewey D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "Chicken Taco\nEnchilada (spicy pork) Taco\n(salted beef) Taco\n\nVery fresh and fast! Cheap and tasty too. It was a ton of food, but all quite tasty. The enchilada taco was my favorite of the three and was very rich in flavor. I added some crema fresca and with the squeeze of lime (a slice was given for every taco) it was perfect. I am not a big fan of corn tortillas but on these I did not mind. The salted beef was a bit dry but still flavorful. The chicken was my second favorite and held on to it's juiciness. The cilantro and onions on the tacos added that freshness and I would definitely return again. The backyard seating was a bonus and it was a nice experience overall.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "Surprisingly good Mexican food in a place disguised as a cheap bodega.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "The best burrito I have found in NYC.  I don't get any meat so can't vouch for their meat, but they never bat an eye at my filling wish list.  And their chips are great.  And it's cheap and you never wait.", "author": "jm s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "I can't get enough of their shrimp burrito.  The best Mexican food I've had since I lived in Texas.  Great service. Great prices. The breakfast burrito is delicious as well.  You won't be disappointed.", "author": "TJ M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Love love love this place. Their spicy pork (and regular pork) tacos are amazing. Reminds me of home (San Diego) and the back patio area is really fun too! Wide variety of drinks and food as well. Our go-to for Mexican food.", "author": "Julia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "Good prices, decent food. I like the chicken cemita myself.", "author": "Howard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Great for breakfast. Egg torta, egg tacos, breakfast burrito are all excellent. Take out primarily with small outdoor seating area in the back.", "author": "A G."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Fast and Fresh Burrito Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7YX6KMMk5m36oOAAyO9vwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188021661"}