{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Very tasty and all of this for $11. Felt very nourished after this meal. The Kitchori was interesting - glad I came on Monday! Thanks guys", "author": "Zoe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "I've been meaning to try this temple cafeteria for awhile but am not normally around the area during Monday-Friday lunchtimes. Now that I've tried it on a day off, I really wish this was near my work because it's a perfect midday meal/mental break type of place - affordable, quick, friendly and low-key. I split a $12 complete lunch and a $2 extra side with another person, and we were both full. The food has a home-cooked taste and seems free of excessive grease and salt that you sometimes get with commercial kitchens. Decor is simple but has a welcoming vibe.  \n\nIf you're put off from trying it only because you imagine sticking out among a crowd of robed hippie types, don't be. There was a variety of people from the community eating there and the guy serving our lunch was so beaming and friendly that it kind of made my day.", "author": "Zoey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "Govinda's is the type of place you'd never expect to find in NYC, with the added benefit of actually being *IN* NYC. \nA true hidden gem, nestled in the basement of a Hare Krishna temple in downtown Brooklyn, Govinda's offers top notch food made with love at prices fit for a pauper's wallet.\nGV has a constantly revolving menu, so don't expect the same thing twice! Fret not, because everything here is crafted to perfection reminiscent of your mother's kitchen, with an environment just as peaceful and loving.\n\nI come here as often as I can, which is still not often enough! \n\nTip: Free flavored water and teas!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "What would I do without Yelp. Seriously. I would have NEVER known about Govinda's had it not been for Yelp. The food was really good and for suchhh an amazing price!! ANDDD IT CAME WITH FREE DRINKS TOO!!! I came on a Tuesday when they were serving baked tofu filet's which were BOMBB. And the women serving the food was superrr friendly!!", "author": "Liana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "As others have mentioned it's in the basement of a temple, with a high school cafeteria set up. They serve vegan/vegetarian dishes (a lot of Indian cuisine). I would've never known the place was here had I not found it on yelp, actually.\n\nThis was my second time here today for lunch. I tried the pumpkin paneer (which was very good) with rice, salad, and sautéed cauliflower/spinach/peppers. \n\nEverything tastes great no flavors were overpowering or too \"spicy\". Did I mention it was all $10, and came with free mint lemonade. In addition the people serving the food are very congenial. \nReally cool place, good food, good price.", "author": "Raider A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Wow. Everything people said was true and even better. This was not just amazing vegetarian food in a fun fusion of Indian flavors and contemporary favorites but served in such a peaceful and fun environment. I will be back very soon for the delicious Chana masala, the mastery of eggplant dishes and everything else.", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "The vibe here creates an ambience of peace and harmony. And of course there is great food. All but two options were vegan. You have to get the samosa. I will be back when I visit Brooklyn.", "author": "Carlton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "I'm a meat lover and I have to say, I go here quite regularly because the food is great. The Eggplant Parm is an amazing choice though they did change it so it's mainly served on Thursdays rather than Thursdays and Fridays. Definitely get there early because they may run out of things you like but stuff is constantly being brought out from the kitchen so there's a lot for you to try. Their curry-style potatos are great, the cabbage meatballs are kind of meh for me, and a lot of the other dishes (too many to name) are good. Their desserts, namely their Cheesecake is absolutely delicious. I think it's better than Junior's. The one with homemade whipped cream and blueberry compote is definitely a must try and the portion is huge.", "author": "Brandon Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "I feel like I've just hit the jackpot.\n\nAnd by jackpot, I mean I've discovered delicious, cheap, fresh food in the most unexpected place imaginable. Yes, I'm talking about in the basement of a hare krishna temple. Don't you just love that?\n\nYou can wander past this place without doing a double take. There's no large neon sign. No flyers. No people advertising outside. It's good ol' fashioned word-of-mouth marketing and of course many thanks to all of you. When you walk in, look past the man that sits by the door and past the temple services and to your right you will find Govinda's. Picture this: Walk down a flight of stairs into what looks like a much-needed-rennovation space that reminds me of an older catering hall/cafeteria. The walls are a interesting shade of green and it's a veryyyy casual atmosphere. And..... I love all of it. \n\nThe staff here is incredibly friendly and always have a smile on their faces. If you look at the sign on the wall (see picture) it'll tell you the price breakdown. Everything is made that day (buffet style) and fresh out of the kitchen. Their desserts for the most part are vegan so if you have dietary restrictions, always ask! They're very accommodating. \n\nAs for the food. Holy cow (irony, I know) this stuff is GOOD. No GREAT. They offer vegetarian/vegan options without sacrificing any flavor. I've been able to each lunch here (Mon-Fri 12:00-3:30pm) a few times and their star dish IMO has to be the eggplant parm. It's not your traditional eggplant parm by any means in that there's a underlying hint of curry with every bite. Super \"meaty\" and cheesy. I've also had their: pumpkin soup, quinoa salad, curry chickpeas, roasted curry potatoes/veggies, vegan cookies and cupcakes. Their meals come with their own homemade multigrain bread which is pretty stellar like everything else. \n\nNot only are the portions pretty hefty (I have yet to finish my full lunch), but they're very reasonably priced. Everything I've had here has been nothing short of amazing. I'm looking forward to becoming one of their \"regulars\". \n\n***TIP! Their daily offerings are usually posted on their facebook page. So check that out:\nhttps://www.facebook.com/govindaslunch", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "I love this place! Part of me wants it to remain it's beautiful little secret. However, I'm on yelp to share the secrets with my friends. \n\nI am a pescatarian but love going strict vegetarian. Govinda's is the best place to be vegetarian. Vegetarian here does not mean grease, cheese or processed. Quiet the contrary, everything I have here taste delicious and utilizes, grains and vegetables with spices. You will find some cheese sometimes and it is still delicious!\n\nThe portions are always generous. I do 3 sides and sometimes I can't even finish my plate. I always do 2 warm sides and a salad. The salad always has options of toppings such as beets with feta. Yes and Yes!! One Friday I came and as if they were waiting for me. I ordered the eggplant parmesan. There was a roasted cauliflower side and the salad with beets and feta. All ingredients I love! The eggplant was perfection! Sometimes I come here specifically for eggplant. \n\nThe menu is always changing. I have been there a number of times and still manage to try something new. It's delicious, cheap, filing and you will leave here happy! \n\nThe secret is officially out!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Extremely affordable; homemade and delicious.  This was a fantastic find on a cold a Friday afternoon.  Don't skip dessert. While the bread looked bland it was sweet and wonderful.  Juice was like tang and the soup tasted watery.  Music and ambience a little headache producing, for me.  But overall, pretty darn awesome.  The main corses kept me full all day.  A great value and cultural experience unlike any I've experienced.  Apple pie worthy of return visits.  Yum!  Cheap!  Outstanding cultural experience!  Nice sampling of vegetarian food.", "author": "Amy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "An amazing place for nutritional food. Once you try it you cannot go to any other restaurant in this area ;)", "author": "Ilan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "The is my fast food dream come true. I love the whole concept. Cash only, basement of a temple, no-fuss, straight forward vegetarian buffet served by the temple people with spiritual music playing in the background. I go for the full meal, which for someone who eats a lot, is a lot of food. That includes rice, several dishes, bread, salad, soup. It's only opened weekday lunch time. When I'm in the area for a work-related training, I always make the 10 min walk over. Totally worth it.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "All good vibes here. Doesn't seem like a restaurant at first but if you go downstairs you'll find a very low key cafeteria. The portions are generous and the food is authentic. They also have a variety of delicious vegetarian dishes to choose from. The gentleman working the counter was really nice - I didn't have enough cash on me and he said \"pay me next time.\" Who does that???\n\nI'd definitely come back and give them my business. The people running this spot are genuinely KIND. Stumbling upon Govinda's totally made my day.", "author": "Cynthia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "I never write a review but this place really deserves one...\n\n\nWhen you first arrive the place seems very strange but don't TURN away like I almost did but I continued as I was taking a friend for lunch. The people are the most inviting and so nice you feel like your overseas. I'm not really a vegetarian but my friend is that's why I chose the spot as soon as my friend and I tasted the food we knew we came to the right place. The food is excellent and the people are great I would definitely be back!!!!!\n\nPlease don't change the uniqueness of this place that's what makes it.", "author": "Wil R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "I got an allergic reaction from something I ate there and wrote them a message on Facebook politely asking for the ingredients to try to identify what the culprit could be as per my doctor's orders. UPDATE: They did get back to me.\n\nAs for the review of the place/food itself - as everyone has noted its in the basement of a temple. Very plain and almost cafeteria / soup kitchen setting. There's a small section with the food that is served buffet style (CASH ONLY). Everything is vegan/vegetarian and the menu changes daily. Thursdays and Fridays are the most popular days because those are the days they serve eggplant parmesan.\n\nThe food itself is affordable - $4 for one item, $6 for 2 items and $7 for one item with 3 sides. There's an $8 and $10 option as well and they give you a good amount of food. $4 for cake and $1 for cookies\n\nIt was a little confusing though because given their menu I should've been able to get 2 eggplant parms for $6 but was told I would have to pay $8 if I did that. The wording of the menu did not make that clear at all.\n\nSERVICE:\nThere's a woman there who was very friendly and pleasant, but there was also a guy there helping her who had a sourpuss face, unfriendly demeanor and nasty attitude. He made me feel uncomfortable every time I went up to look at the food (I got some food to go at the end of my meal) and made me not want to go back.\n\nWhile he was already in a sour mood before I had any interaction with him, I think the later bad vibes he sent my way stemmed from the fact that I handed him money over the counter and instead of him looking to see that there were quarters in my hand he simply dragged the money out of my hand, which resulted in some quarters ending up in the quinoa. \n\nHe looked annoyed at me even though had he been paying attention he could have avoided that accident. (p.s. - he didn't change the quinoa container after picking the quarters out. EEK!)\n\nTIP #1: If you have t-mboile there's no internet connection in the basement\nTIP #2: CASH ONLY!\nTIP #3: Go on eggplant day (Thursday and Friday) but go early because it's their busiest day and they do sell out\n\nMajor gripes - very short operating hours, they do run out of the stuff you want, and the line can get really long", "author": "Camille H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "The place was pretty nice lol. When I saw that the place was described as a cafeteria, I was worried that it was gonna look like those cafeteria's from my high school years. Those brought horrid memories especially with the food. CRY. Fortunately, it wasn't like that, phew\n\nAtmosphere: The restaurant is at the basement [lol, dont be creeped out]. It has a classy, nice yet casual cafeteria-ish type of dining area. There is a wall painting of a Hindu god, a few chandeliers, a couple of cute flower decorations! Hahaha, see? Now that's seems pretty nice.\n\nFood: Everything is VEGETARIAN! Their small menu changes daily. However, their menu items range from decent-delicious. It's also very recently-good priced ESPECIALLY THE WHOLE MEAL VERSION! Ooh, btw get the FREE drinks at the end of the food ordering line: i love the green mint iced tea [trust me so refreshing!!!] \n\nPrice: Very cheap-reasonable! At most, for a whole meal, you'll probably pay like around $13 for a huge meal! The whole entre came with a salad too. ;D\n\nWorkers: The servers are really nice and friendly. They are willing to answer any questions you have! \n\nEnd: If I'm in the area [btw very nearby the Brooklyn Bridge Park, so if you wanna hang around there, definetly drop by], I will drop by!", "author": "Elaine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Fantastic food. The \"homemade\" bread made in-house and cookies are especially excellent.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Pure magic! \nOrange! pink! mint!\nPlant based \u0026 delicious!  \nNo dead animals \nHappy plants\nHappy belly\n$\nFriendly staff :)\nBlue gods playing flute under paradise Apple tree \nWill be RIGHT BACK HERE !!!", "author": "E E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "I'm vegetarian and have lived within walking distance of Govinda's for about seven years now. I don't know why I waited so long, except I was a little intimidated to walk through the Hare Krishna temple to the basement, which sounds ridiculous even as I type it ...\n\nThankfully, I am totally over that after my first visit. I got the $10 full meal deal, which was fully twice more food than I needed and I am not a dainty eater. Rice, roasted sweet potatoes, chickpeas in a spicy sauce, a sort of grain meatloaf, greens with cauliflower, two kinds of salad, soup, bread and lemonade. I think my favorite was the grain loaf, but really I loved the whole absurd array because of all the different textures, colors and flavors.\n\nWhich is good news, because I will be eating it again tomorrow.\n\nFriendly and quick, it's one of the best lunch deals in the neighborhood.", "author": "Colleen N."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}