{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Very good vegetarian homestyle Indian food. Delicious and healthy. You'd get vegetable preparations not usually offered at the typical Indian restaurants.", "author": "Ame S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I was so hyped to come to Govindas because I heard it was so good. I have to give my disclaimer that I love a menu! I hate walking in blind as to what food options there are when I get to a place or I have to hover over others to see what the options are. I especially hate doing that when I can't identify what the food is. Alas, Govindas and I got off to a rough start. I came here especially for the eggplant parmigiana which was good. The slice is small- see picture. I also got some potato dish that possibly had curry or tumeric in it, cauliflower that had potatoes and other stuff -insert shoulder shrug- and a roti-like option they had. The portions are a bit small if you're on a traditional American standard diet. The eggplant Parmesan and roti thing I got were both dense so I had some of my sides to take home to compliment my dinner.\n\nI was told I could go on Facebook and see what being offered each day- no too helpful for a person that needs to see what it is. I think some labels on the glass would be helpful so patrons could know what it is. I'm not a vegan or vegetarian but I would imagine that would be helpful so you don't order something that looked like it was ok for your diet and then it turns out it isn't. Also it would be helpful if the signs they have posted about the cost specifically states what was and was not included. Samosas NOT INCLUDED. Cupcake NOT INCLUDED. \n\nI don't know if I'll go back here with so many places in the area where I could spend $11 and know what I'm getting.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Very non greasy homecoming style food. Not sure about pricing but only few options available. I got tofu, eggplant, veggies with salad for $10. Cash only. It's very good, not restaurant style but super casual. If you choose to stay, you will also get a cup to get drinks.  I also got cupcake ($2), just fine (the topping isn't good). The cheesecake is super good! ($4 or $5) big slice with fresh prices of strawberry! The place is actually not far from Dekalb mall station or A/C train station. \n\nRecommendation - cheesecake", "author": "Kay W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "Well, you don't go for the ambiance. It's in the basement of a temple that frequently has a vagrant or two resting outside of it.\n\nWhat we go for is a hearty, reasonably-priced ($13), fresh, vegetarian lunch. We also go to support the institution that is always so welcoming and polite to its guests. \n\nTheir menu rotates by the day of the week. I think I've tried all five meal, but might have missed one day. All have been tasty. My favorite is the eggplant parmesan day (I think it's Thursday's).\n\nThe service is always exceptionally polite. Give it a try and maybe I'll see you there.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "I'm always full and satisfied every time I leave this place. They have bunch of vegan/vegetarian options. Definitely love the nut loaf. I still remember the first time that I tried it. YUMMY! I went to heaven for a second after eating the nutloaf. \n\nA place that everyone can enjoy. Even my friends that are not vegan/vegetarian were pleased and would recommend Govinda. They always have something delicious to try. Both affordable and delicious.", "author": "Estrella E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "I have officially died and gone to heaven. Wow, what a lunch! It was my first time here as I was working in the area and I got the complete meal with 6 different dishes + dal and drink, all for $12. I mean...\nEach and every bite was delicious beyond what words can express. No greasiness, heaviness, saltiness, over sweetness... just a well balanced meal that featured and respected the real flavors of the food. Yeah, I will go out of my way to come here. What a find!", "author": "Kat D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Amazingly ridiculously good food served by an amazing ridiculous staff at amazingly ridiculous prices. \n\nGovinda's is my favorite place for food in Brooklyn. I get the largest platter and save some for later. I can't believe experiences like this exist in such an expensive, globalized and commercialized place like NYC. Thank you to you, thank you.", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-21", "description": "Govinda's is back in business. The food is still great. What's missing is the loving atmosphere that existed before. The current staff works hard and are attentive. But the caring and love is lost. Wish this wasn't so...", "author": "Jose S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Dropped by Govinda's for the first time today.  Trekked from Manhattan to experience the overall vibe and, food-wise, I wasn't disappointed.  \nI went for the full meal platter ($11) and asked the very nice and cordial cook/server for recommendations. She asked if I want a vegan or vegetarian dish.  I saw the eggplant lasagna with cheese and decided to be vegetarian for the day.  She then stacked my plate up with a bit of everything (eggplant lasagna, rice and beans, quinoa, sweet potatoes, all types of vegetables, salad, bread and a small cup of split pea soup)  This was an an adventure.  \n\nBTW, I got there at 2:30pm, an hour before they stop serving food, and felt like I had the whole place to myself.  It's like a school cafeteria type setting with mellow music playing in the background.  The place is dimly lit or not extremely bright but it adds to a relaxing vibe.  I saw people of all ages and nationalities, dining there. \n\nI think the full meal platter can be split with 2 people unless you want to be gluttonous or you are scheduled to run a half a marathon later in the day.  After spending a good 30 minutes finishing my meal and on the way out, one of the cooks asked how I liked my meal.  With a smile on my face, I told her it was very good and pointed to my entire empty plate which was close to being licked clean.   \n\nThey have a new fan here.  The food, overall, had the right spices and tasted great.  Thumbs up!", "author": "Sir Choclet .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "Giving this restaurant more than 3 stars is just a misleading info.\nIt's located in a basement, very limited selection of food.\nPeople were super nice and it's cheap, the food OK at most. It is not a gurme nor an exceptional small /hidden place. Quick and cheap OK food", "author": "Guy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "A must go place for the vegetarian and vegan food lover .Good food, not spicy.\nThe place is spacious and has a peaceful ambiance..hare Krishna Hare Krishna", "author": "Anurag S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "I did a long run from Manhattan, and arrived ready to eat. Give me all the carbs and veggies!\n\n***LOCATION \u0026 INTERIOR***\n.A casual cafeteria style eatery under a temple tucked away in Brooklyn. It's kind of dark and dingy, but relatively clean. There are a lot of tables so you don't have to worry about not having a seat.\n\nThe food is served off to the side hot bar style so you can see all of your options. There were two ladies serving food when I went, and they were both super nice. One of them patiently told me all of the food available for the day and gave recommendations.\n\nWhen I went a little after noon on Good Friday, there wasn't a line, but by the time I finished my meal there was a pretty long one. The ladies work efficiently though, so I'm sure it moved fast.\n\n***FOOD***\nYou have the options of 1 to 4 entree choices or a full meal, which I think gets you every entree, plus soup, bread, and salad? You can also combine some entrees, like rice \u0026 beans counts as 1 entree. The prices are very reasonable.\n\nI opted for the 3 choice for $9, and then got 2 cupcakes for $1 each. FYI, it's CASH ONLY!!!\n\nAll of the entrees I got were very good. They tasted homemade--not too greasy, and were very flavorful. The only one I didn't like was the mixed greens, which were drenched with wayyy too much dressing. I wish they just served greens and had dressing on the side for you to add by yourself.\n\nWhat I loved the most though were my vegan cupcakes! I got one of each available, chocolate and cherry. The chocolate was okay, nothing special, so I only had a bite. The cherry cupcake though OMG SO GOOD. The cake part was moist, fluffy, and sweet, while the pretty magenta frosting was the perfect balance of sweet and tart (more sweet than tart, which my sweet tooth appreciated). It rivals Georgetown Cupcakes' vegan cupcakes as the best cupcake I've ever had...and it's $3 cheaper. I was almost tempted to go back and get another one, but I somehow resisted.\n\n***NOTES/RECOMMENDATION***\nGo for the cheap, homey vegetarian/vegan food and don't leave without dessert! I can't wait to go back and try a few more entrees and desserts.", "author": "Cindy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "This is an awesome way to eat.\nIn the basement of a Krishna temple, there is a nourishing, home cooked vegetarian meal waiting for you...seems fitting.  \nFor $12 you can get the full meal and feed two people (or at least that's what I did yesterday, and my husband is a steak and potatoes kinda guy).   \nI could go on about how clean everything is, or how great their fresh juices are, but I will just leave it at I wish this place were 24 hour!  (Can I just ask why you can only get the worst, or best, depending on your mood, kinda food at 3am?!)", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Hidden gem in Brooklyn.\n\nServes vegetarian and vegan Sattvic Indian and Italian cuisine Monday to Friday. Amazing food.\n\nhttps://www.facebook.com/govindaslunch", "author": "Pratham S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "What's good here? Mostly everything!!\n\nI've had the eggplant parm (my fav), Veggies, lentil soup, rice,  beet salad, quinoa salad and even the bread is so soft and so good !! I'm not a fan of the lentil loaf though. The food is nicely seasoned with Indian spices and they give nice size portions. The cheesecake in this place is heavenly, it's enough to slap yo mama and ya daddy. It's creamy, not too sweet, soft and doesnt have that milky dairy taste. And the crust?...the crust? Omg.. the cheese filling with the crust is such an amazing pairing. This place is quite popular so you might see your coworkers there. You pay for combo items and the most you would spend on food is about 12 dollars which is steal in downtown Brooklyn esp. during lunch time. The lines can be a little long but they move efficiently and quickly. GV is changing management and wont be open for a month or two so will wait patiently until the grand reopening but until then, I'll continue to bring my lunch.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "My go to zen lunch place. Delicious and affordable. The workers are amazing and are always willing to answer your queries about the menu with a wonderful smile. They have different food every single day. I love this place.", "author": "Lj C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "This is probably the best Govinda's  restaurant ive been too. The food is super delicious with so many options. They had vegan cheese cake that was excellent. \nI gave it 4 out 5 because of the space where you eat. It's more like a cafeteria in a basement..not the best atmosphere.But the food will make you come back.", "author": "Isabel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Amazing food, amazing staff! Loved it so much!\nRecommend it! And cost friendly too. Good for a work day meal. Simple food, and reminds me of home made indian food. The ladoos are out of the world. Same with pedas. Must try dessert and the eggplant lasagna is amzaing!\nGreat!", "author": "Sabrina Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "How did I not know about Govinda's?!?! After all, I'm a native Brooklyn-ite, love Indian/vegetarian food, practice yoga and appreciate the (Eastern religion) principles that are tied into it.\n\nI happened upon this temple/cafeteria a few weeks ago as I walked down the block, but it was past lunch time so I was unable to eat anything.  As I left, I made a mental note to return and more so after I read all the stellar reviews on Yelp.\nI finally made it to Govinda's today for a quick, late lunch.\n\nI arrived around 2 PM, and it appeared the lunch rush was over. When I stepped inside the Hare Krishna temple, a gentleman at the entrance desk directed me to the staircase leading to the basement. The room was large-ish---with school-like  cafeteria appearance arranged with several round tables and a bit dark. Enough people were still having their lunch and socializing.\n\nThe buffet food bar was situated not far from the entrance and I was warmly welcomed by 2 of the servers.\nThe woman explained all  the seemingly delicious selections (from eggplant parm, cabbage and string beans to potatoes, salad, quinoa and bitter melon). There were other extras such as bread, rice and dessert (also chutney). Although it was a bit late, it seemed that food was still being replenished. I was undecided as everything looked quite good. The eggplant parm was apparently popular and immediately recommended; however, being Italian--I wanted to try something that was more along the lines containing Indian spices/flavorings.\n\nA fresh batch of bitter melon was being replenished as I was deciding. I was informed it was quite bitter but very healthy. And so having never tried it, I chose it as my one item ($5) but the woman was kind enough to split 2 selections and count it as one. The prices vary according to the number of selections chosen from the buffet bar ($5 for one, $7 for 2, etc.) My other selection was the quinoa salad (she even threw in a chapati on the house!). As far as beverages, there were several varieties for purchase or either free lemon water or mint lemonade.\n\nThe vibe of the cafeteria was lovely. I could smell incense burning from the temple upstairs and Hare Krishna music was audible throughout the room. When I settled to one of the round tables to eat my lunch, I was thrilled with the bitter melon and quinoa selection (the bitter melon wasn't too bitter after all). The melon was fried and flavorful and the quinoa salad with grape tomatoes was cooked just right. I had two (plastic) cups of the mint lemonade which was really delicious and minty. My lunch was filling and enjoyable.\n\nI am looking forward to returning again. I like the vibe, the people are very friendly and best of all, the food is delicious and cheap! I highly recommend (no need to be a Hare Krishna worshipper or vegetarian. All are welcomed.)\nCheck it out for yourself.  CASH ONLY.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Cupcakes that melt in your mouth and they are vegan! Including their bread baked fresh every day. Their samosas- if you have not tried it, you are missing out! Our go to lunch spot that never disappoints. Just make sure you go early before all the delicious food sells out because it always does. Cash only, friendly, and a place to eat comfortable. You can mix and match every day and will always have a different meal. Tip their amazing business!", "author": "Andrea Z."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}