{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Staff was super nice, food was delicious and so plentiful I ate some later because there was too much for the $12 deal. I also got a cupcake and loved it, chocolate flavor! Ambience is definitely cafeteria style, so not charming but the staff more than make up for it!", "author": "Ola H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "You'll be hard pressed to find better tasting vegetarian dishes served from a friendlier staff. \n\nWould definitely recommend and try again.", "author": "Galen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Came here one time over a year ago for lunch with a friend. It was a bit hard to find cause its in the basement of a Buddhist temple but I loved the down-to-earth, no frills vibe of the place.\n\nTo order: Walk up to the cafeteria-style counter. Tell the dude how many items you want. Pick and choose your items. He'll place your food in a Styrofoam tray. You pay and then, you're good to go. Make sure to get the free spicy pickled veggies near the cash register. They also have complimentary water and  some type of sugary drink in self-serve orange containers. \n\nLove the perfectly fluffy texture of their jasmine rice. And the fake meatloaf. Good quality vegetarian food near downtown Brooklyn.", "author": "Laura Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Very tasty food. Happy i stumbled on this spot. MY only qualm is sometimes they be trying it during the end of lunch hour when they barely fill ya plate up! Or when i be getting burnt food sometimes but other than that i love it!", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "I'm so glad I finally had a chance to come by. I came here earlier this week after running some errands on a rare weekday off work. I've been to a Govinda's in Dublin, so I assumed this location would be similar. Indeed, this place is pretty similar to the canteen in Dublin: for a small sum of money, one can get a heaping pile of food that will nourish your soul and your body (or so I like to think). \n\nThe server was a sweet young woman who was happy to hear that I've been to another location. After I told her I wanted to try their full meal set, she gave me my food in a to-go box, just in case I couldn't finish everything. Good call on her part because I didn't end up finishing everything and I did have to bring some of it home. The menu changes daily and on the day I went, there was a black-eyed peas dish, a paneer dish, and a cauliflower dish. The salad had lentils in it and everything was fairly light and not heavy tasting. Which is good, considering how much they heap onto your plate.\n\nI wish they were open at other hours, but I'm just glad that they exist within NYC. Will definitely consider coming back here if I happen to be even remotely in this area during their open hours.", "author": "Cinthia K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "I've been interested in visiting Govinda's for years.  It's in the basement of a Hari Krishna temple.  Weird!  It looks like the house of worship basements where I have attended low key bar mitzvah receptions.  The food was not nearly as tasty as I was hoping.  Many dishes were mushy, for example mushy rice, mushy green beans.  The portions were large, so I did waste a lot of food, sorry.  If you are hungry, yet not picky, a vegetarian, and have a limited budget, this would be a sensible place to eat.", "author": "Kari T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Awesome food and service in a no-nonsense environment. Good variety in vegetarian dishes that are also easy on the palate. Will  come here again.", "author": "Sonika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "There are certain foods that I can say I want to pull it over me like a blanket, get comfortable, and with a big stupid grin on my face, start munching all around me. I don't even care about the logistics, I just want it to happen. That is what their nut loaf does to me.\n\nThe food is WELL priced for the huge portions, especially given how good it is. I am a meat eater *gasp*! But good food is good food. Folks. And if hearing \"vegetarian\" turns you away...well, I guess you can't call yourself a food lover.\n\nIf I were to be perfectly honest here, minus the nut loaf, I would give the food here an overall 4. Meaning, it makes me happy, but it doesn't send me into food heaven. I've had the cheesecake - and while amazing portions (seriously, they give you like 1/6th of it per slice), it was a tad too sweet for my taste.\n\nBut I love that it's in the basement of a temple, I love the homey feel of it, I love the people, I love that the chef (chefs?) has been cooking since 15 and completely used to cooking meals for hundreds (if not thousands) of people.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "I was skeptical when my friend suggested we go to a vegetarian place in a temple for lunch one day. Really skeptical. \n\nI mean, I love vegetarian food - dont get me wrong. But Ive had BAD vegetarian food, and while its not up there with \"bad sushi\" or \"bad Indian food\" bad vegetarian food is dry, dense, and makes you want to shove your face in a cow.\n\nBut, of course he used the words \"delicious\" and \"secret entrance\" so I was sold on it.\n\nI will never question this guy again. We walked into the temple and turned down the stairs into a cafeteria-style open room. We got in line and I just followed suit and ordered the $10 special (everything). Secretly, I ordered it because I knew if there were two things I didnt like, there were at least 2-3 more options there on my plate.\n\nWe went on NutLoaf day... which kinda creeped me out (I dont even really like nuts), but it was a hearty and moist cake with what felt like some almonds/pecans/cashews really finely added. The acorn squash was seasoned and just slightly spicy and salty - which paired great with the chana masala and the stewed kale. Nothing was overly oily (the squash has a solid coating to keep it from sticking while they roasted it, but nothing that made me cringe) and I loved the spices they used on everything.\n\nI didnt get a chance to try their desserts, but its on my list of things to tackle next time (and when I say next time, I mean tomorrow).", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is my favorite place for a healthy and satisfying weekday lunch. \nThe seating area is a very clean basement hall, and the staff always plays soothing chanting melodies to accompany the warm chatter of others enjoying their vegetarian feasts. \nThe eggplant parmigiana dish served on Thursday is better than most \"Italian\" restaurants and costs a fraction. Also, their desserts are absolutely amazing. I recommend getting the full meal, $12 for a bunch of main dishes from the fresh buffet, dessert, and a drink", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Such yummy food for such an amazing price. We shared a lunch plate and enjoyed every bite. We will most definitely be back soon for another awesome lunch special! Xo Lala and Ash (IG: @lalaandash)", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "Wait, there's a vegetarian joint in the basement of the Hare Krishna temple?! I had to try it. I'm not really sure why, as I'm neither vegetarian nor Hare Krishna, but I couldn't resist. I was strangely attracted to it, like a completely straight moth to a very gay flame.\n\nHaving now dined at Govinda's, let me tell you that you are not there for the atmosphere (it is in actuality a basement cafeteria). You are there for the affordable, delicious vegetarian cuisine served quickly and efficiently with a smile. I had:\n\nEggplant Parmesan: This was AWESOME. It was as hearty and satisfying as vegetarian food gets.\n\nQuinoa salad. Fresh and perfect, not as mealy as quinoa can get if you don't do it right.\n\nBroccoli and peppers. There was a vague curry flavor, and they veggies were well executed and a nice complement. \n\nCabbage, peas and potatoes. Not a huge fan of this one. It wasn't bad, but I should've known better as it's not really my thing. \n\nAll this food was piled high on a tray with a slice of surprisingly wonderful, hearty bread (that I'd easily buy a loaf of if available). It was way more than anyone needs for lunch, and it cost an even $8. You can also purchase less items for less money, or get it all with soup and salad and I believe, dessert (cake or cupcakes) for $10.\n\nCash only, and dine in as long as you don't mind Hare Krishna music and plasticeware.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "So, it has been years since I entered this place. Went today with a coworker and immediately felt at home. Great atmosphere for a relaxing meal.  Amazingly friendly staff. Huge portions. I am always a bit nervous going out to lunch in uniform but not even a second glance. Will be back more often. HARE BOL!", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Get over being worried about the fact that this little gem is in the basement of a Hare Krishna temple and that the food is cooked by, and served, by members of the faith.  Get over any kind of snobbishness around decor.  And get ready to eat some of the best vegetarian -and vegan!- lunch around at the best price in Brooklyn, served by genuinely friendly and cheerful people.  I've been 3 times and each friend I've gone with has in turn gone again with others, and all report back that their friends loved it too. The \"meatloaf\" on Wednesday's is to die for. Am working on the cook for the recipe and who knows, maybe I'll get it!!", "author": "Carol W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "Hard to find is an understatement. It's not any food place around the area that I've been to before. It felt like walking into a church rectory. But the food!? YES! Very authentic, best and tastey vegetarian place in Downtown Brooklyn area. This will definitly going to be in my lunch rotation. Ok I'll will be selfish and tell everyone to stay away!", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "1. yellow split dal- ok. needs some onions or garlic something more to it in my opinion. I don't \n    know what.\n\n2. shredded carrots with black eyed peas- personal taste didn't even try\n\n3. chana masala- the chickpea dish it burned not a lot though. I really don't like spicy dishes.\n    I don't eat chana masala so I have nothing to compare it to in all fairness to them.\n\n4. tossed salad with sunflower seed dressing I believe.- was tasty.\n\n5. rice- ok, bland or good. I can't decide.\n\n6. samosa - take it off the menu or do it better.\n\n7. cauliflower and stringbeans- are cauliflower and strings beans. - ok.\n\n8. orange-lemonade the drink. Something like that. Way to bland.\n\n9. raisin bread- Their raisin bread should be the standard for raisin bread everywhere. So \n    awesome.\n\n10. Nut-loaf -  awesome.\n\n11.. mango cupcake- tasty.\n\nI was given a lot of food for $15.00.  I am not sure why I paid $15.00 though.\n\nService- outstanding.\n\nWould I go back again? Absolutely.", "author": "Patron -."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Perfection. The food is amazing and the people are great. Only issue is eating too much! Best kind of problems anyone can have. \nTry the cheesecake!!!!!!!! A must have.", "author": "Goura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "This place is a jewel under the surface omg! The food here is so delicious the spices the smells love it! The prices are the best part this place worth every bill you spend there and it's no expensive at all! Save some room for the cupcakes!", "author": "Juan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Excellent  dal, beans, nicely cooked rice, amazing bread and wonderful vegetarian options. Had an amazing meal for only $7 (2 veggie + bread + rice + dal)\n\nThe eating area is a little dark, very simple, it's perhaps a bit closed in as there's no natural light, but the food is so delicious that it is ok and you will forget about it. \n\nI also wish they served in environmentally healthier plates for the \"eating to stay\" clients as I really hate styrofoam.. wish they use paper instead or perhaps some stainelss steel dishes.... hope they will consider as suggestion. \n\nI will go back when in the area. \n\nThank you!\n\nNamaste :)", "author": "Cristina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "This place is truly amazing! When Yelp came up with Govindas while searching for food near work,I was not entirely sure what to expect since even though the name suggested an Indian place,the food pics suggested a varied cuisine(eggplant parm,cheesecake?!)It was a pleasant surprise to find out it was in the basement of a temple,giving me an opportunity to visit both the temple upstairs and sample the tasty fare downstairs.\n\nEvery morsel here is seasoned to perfection.The salads and side dishes with zucchini and quinoa are not exactly Indian food but they have managed to combine the best flavours of both Indian and western cuisine to create an extraordinary fare equally palatable to everyone.My favorites are the eggplant parm and the delicious salads.\n\nThe desserts look heavenly(I am yet to try those since sugar highs in the middle of the day are not good for the rest of my work day).The best part is that they have managed to make the food light and non greasy while still retaining the taste,making this a perfect place to hit up for lunch.\n\nThe free pickles and lemon flavored water are a nice touch to make you fall even more in love with this unassuming place.The prices are really low and you kinda get the feeling that here,it's more about people enjoying the food than actually making a profit.The people serving the food are super nice as are those who come to eat here. Many a time,total strangers who seem to be regulars here have offered tips on what to get.I guess good food brings out the best in people. Definitely unique and hugely satisfying!", "author": "Aparna K."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}