{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "This place's food is DELICIOUS! I ate like a pig and didn't break my wallet. Everything tasted very fresh and was very well-prepared. The eggplant parm was amazing. The Indian options were great too, and extremely flavorful. The line can get long, but moves pretty quickly. The seating area is just like my high school cafeteria, except the tables are round instead of rectangular. There are a few smaller, rectangular tables for small groups or folks dining solo. I will return!", "author": "P C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "I'm not vegetarian.  This place is delicious, and switches up their menu offerings frequently... keeping it fresh!  They have a basic cafeteria setup, where you choose a few items from some heated trays and they slop into a styrofoam container onto a plate.  No frills.  Just great food.\n\nWatch out, some weekday lunches get really crowded", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Well spiced and cooked food in the basement of the Hare Krishna Center. Served cafeteria style (small scale). Very reasonably priced and large portions. I had a wonderful squash, coconut milk sweet potato soup, black eyed pea curry. All great. The day that I went everything was vegan except for the yogurt sauce, I think this includes the baked goods but I'm not positive.", "author": "Jessie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "First time going - Great food for a great price!! Anytime i see asparagus soup I am going! It was so delicious! I will be returning very soon!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "Lunch options near long island university are pretty weak and likely to lead to an early grave.  Stumbled on this place today and had to check it out.  Everything I had was delicious, fresh, and healthy.  You can get three vegetarian dishes for seven dollars and the portions are huge.  They also give you complementary bread that they bake fresh daily. The people who work there are really friendly and helpful.", "author": "marni s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Our office is temporarily stationed in downtown Brooklyn, and most of our staff has been going to Govinda's just about daily. We kind of can't stop -- it's incredibly delicious, wholesome, almost entirely vegan, and just plain great. While there last week, a man on line said, \"This used to be a best kept secret. Now I hear it's on Yelp!\"", "author": "SI L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Food is incredible, portions are great, and the people are kind. You can't beat this wholesome vegetarian restaurant in the basement of a temple.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Great place, and great alternative atmosphere to the pretentious places popping up all over the place along with the new skyscrapers. Staff and food are excellent, even the free side of bread is great. Hearty meal for $7, or really stuff your face for $10 and spicy aromatic food that I could eat every day. Nice big tables for groups, and the line isn't that long after the intiall 12-12:30 rush.", "author": "Yurkaa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "This vegetarian kitchen, located in the dim basement of the Hare Krishna temple, is an oasis in a nightmarish desert of delis and fast food joints.  Govinda's offers flavorful and creative vegetarian dishes and soups, samosas and vegan cookies and cakes.  I lunched at Govinda's almost every day during my two weeks of jury duty and I think back fondly on that time (unfortunately they are only open during the weekdays).\n\nFor $5, you get your pick of three items from among the vegetarian fare on offer for the day, two slices of fresh-baked bread and as many Indian pickles (sour mangos!) as you can stand.  The menu rotates.  Some of the dishes that I remember tasting include palak paneer, gobi masala, aloo gobi, baked tofu and karela melon.  On Thursdays I think they serve eggplant parmesan - take a look at the board outside the entrance.\n\nThe people are friendly and the food screams healthiness.  This place is a treasure.", "author": "Kelvin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "Finally got to eat at Govinda's 2 weeks ago. The food is absolutely delicious! Food and served with smiles and lots of positive energy. All of the food is so good. Not a full vegetarian yet, but this little gem of good freshly prepared daily main courses, scrupcious desserts and VERY healthy portions at reasonable prices, makes Govinda's the hidden treasure of downtown Brooklyn for a \"timeout\", no cell phone activity allowed, and good food. We have been there twice, and plan to make Thursday (eggplant parmesian day) our regular Thursday meal eatery.", "author": "Ying G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "The cheesecakes are smashing - wayyyyyyyyyy better than Junior's. The eggplant parm is a must and the drinks that are included in the meal are some special infused water and mango something. Go. Get the complete meal and eat leftovers later.its alot of food to eat all at once and not get stuffed.", "author": "She Eats Real F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "I have eaten at Govinda's several times and as was written in all the other reviews, this is one of the best values in New York City!  \n\nThe food is flavorful and their fresh bread is amazing!  Also the people at Govinda's are very friendly and do not try to proselytize you while you are eating.\n\nOne warning. Their basement is not air conditioned, so it can get quite uncomfortable in the summer. But at any other time this is a find not to be missed!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "This place is the absolute worse!!! A big J.K.  It's actually the best.  Everything is amazing.  I'm actually ok waiting on the semi long line here (lunchtime).  It's so peaceful.  It's located inside the temple.  If you don't know or can't find it, sucks to be you.  o.k. o.k., it's in the basement of the temple, between Nevins and Bond St.  Great service, No embellishing, the cheesecake is comparable to Junior's.  No, no, it's actually better, lighter, not to sweet just amazing.  Get two, you will thank you me. Peps say it's a hidden gem, it truly truly is.  This is my go to spot for delicious vegetarian food.  Look, their menu changes, believe me, everything is divine.  The lasagna is fabulous, our office fights over the bread, cauliflower and especially the cheesecake.  Oh, CASH only, no ATMs.", "author": "T J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "Went for the first time the other day, it was good but I didnt think it was spectacular like most of the reviews. I am not a vegetarian but I can appreciate non meat meals. The people were really nice and the cafeteria seating was plentiful.  I couldn't have the eggplant lasagna everyone raved about because I can't have dairy. I will try it again though. Huge portions+++", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "Can't say enough good things about Govinda's.  Contrary to some reviewers, I actually love the ambiance.  There's beautiful, mellow music and a flower floating in a vase on each table.  The walls are a vibrant shade of teal.  Everyone I bring here loves it and the value can't be beat.  My top spot in Brooklyn.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "$10 tray of food fed 2 adults and a toddler!! Solid Indian food everytime we visit. No elevator so we had to carry stroller downstairs.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "Thursdays is Eggplant Parm and Quinoa Salad.  I go every Thursday because it's absolutely delicious.\n\nDon't get scared off that it's in a temple.  It's just a cafeteria downstairs, you don't have to deal with anything regarding the Harekrisna church.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "When you realize where the door is to this place (I can't remember if it's push or pull) but do both just in case. Then go downstairs and into the cafeteria. There you will find a very nice, very attractive lady who will explain everything on the menu to you in a soothing, appetite-building voice. At least I did, and if you don't then I'm sorry. Besides all that, the food is great, all vegan, minimal soy or other fake vegan crap and you can tell it was made with care...maybe not love, but definitely care. The place is chill with a few older folks, veteran-like. It was dimly lit and relaxed. A great place to meet a friend for lunch and good conversation. I certainly will be returning.", "author": "Kelly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "So cool! I love the vibe down in the basement! Everyone seems like a regular, asking the chef how she's doing, recipe advice, how to pronounce things. The rice and chick peas are delicious. I want to try the soups next time. I asked about the veggies and she made a joke about how they were just roasted veggies and not Indian at all. That's cool with me! The price cannot be beat. Make sure to grab some of the sesame carrot chutney (?) at the end of the line. Spicy and delicious.", "author": "Jude D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "this is the best food in this neighborhood. \nI've been coming here for years and never have I been disappointed (except when they run out of something cuz like cmonnn I love it and I'm hungry, y'all).\n\nTheir breaded tofu cutlets with this amazing sauce, mmm legit salivated at the moment. The price is oh so right, I'd like them to cater my event aka my lunch everyday. \n\nI'm not a vegetarian and this place still rules. I love the cafeteria/bowling alley/skating rink atmosphere and the awesomely diverse group of folks who eat here. \n\nYou walk up to the line and ask the nice lady what they've got today and pick your poison. You literally can't go wrong. Straight up, its 7pm and I'm already planning my day tomorrow around going to get lunch here. \n\nWalk in through the door and down the stairs and you won't get hare krishna'd. (jk these folks are very giving and sweet).", "author": "Emma S."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}