{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "My favorite types of restaurants in Brooklyn are those that you can walk right past and not even know they were there. Govinda's takes that a step further; you can walk inside and STILL not realize that a buffet of delicious vegetarian food is waiting for you just below your feet.\n\nAs the second most hipster thing I've ever said (refer to Bunna Cafe in Bushwick for the first), Govinda's is some of the best (and only!) vegetarian food I've had in the basement of a Hare Krishna temple. Say what?? Thank god I had Yelp lead to me this place, as I'd never discover it otherwise.\n\nEach day, they offer a completely different menu of vegetarian mains, sides, salads, and desserts. If you are terrible at making decisions like me, or just want to try everything, definitely get the complete meal for only $12. There is literally nowhere else in the city that you can get amazing food in epic proportions for such a low cost.\n\nIt always includes a curried type of light soup with a fresh salad, and AMAZING freshly baked bread. From there, the possibilities are endless; the menu changes every single day and is usually updated on their Facebook page. Once I had pasta salad, mixed vegetables, veggie keftas, and chickpeas, while today I had a tofu fillet, rice with chili, broccoli, and cabbage with potatoes. Their meals tend to have a lot of curry flavors and lean heavily on carbs/starches, but I'm not complaining one bit.\n\nAnd whatever you do, do. not. skip. dessert. If there is cheesecake available, get it. It's a huge slice for $4, but perfectly rich, creamy, and decadent. All said and done, you'll probably get 3 meals out of the complete set with your leftovers, and you'll still never get tired of eating.\n\nThe food is really simple and definitely tastes homemade, but I mean that in the best way possible. The lines at prime lunch hours definitely attest to Govinda's popularity, but everyone is really nice and the line moves quickly. Keep your eyes peeled for the sign on street level and be prepared to eat your weight in vegetarian goodies.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "a truly delicious meal:\n\neggplant parm\nkofka(sp?)\nbeets and salad\n\nthey also had cupcakes! friendly environment in the basement of the hare krishna temple! i recommend this for vegetarians and non-veggies anywhere.", "author": "Henry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "You will not find food made with more love and nutrition than at govindas. Be sure to come on a Tuesday for tofu fillets with exquisite green sauce - or rather stay home and save more for me", "author": "Des W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Another Hot Vegan spot to go!!!!! The food is great and I can't wait for them to come to Queens. Talk about fresh food, oh man. I need to learn how to cook like that. \n\nI celebrated there for Thanksgiving and Christmas and it was all you can eat buffet. Desserts over thirty and drinks at least four flavors were included but I was unable to eat everything. Let me know your opinion if and when you go.\n\nOh, did I mention they have the world best samosa. That's right, I said samosas.", "author": "Cherry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "From bread to salad to main dish, they don't cut corners. Everything is extremely flavorful, and the kitchari with yogurt is the creamiest and richest version of the dish I've ever had. The only thing I don't like is their free \"juice\" - it's too sweet and artificial. But the free infused water is great. Restrooms are clean and the staff here is sooo friendly. Here is the weekly menu on rotation:\nMonday - kitchari\nTuesday - tofu\nWednesday - nut loaf\nThursday - eggplant parm\nFriday - parm and whole wheat pasta", "author": "Joy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "The right time at the right place!  Everything was so good.  We walked in and headed downstairs the a huge space cafeteria like area with tables and steam food stand served by two great service with a smile guys.  Ambience was simple but tasteful and got great music playing. \n\nHere was we had:\nBreaded tofu- tuesday special- was very good and crispy and not greasy at all. Get the green sauce.  So good. \nSalad with dressing-  the dressing is so tasty \nSquash and carrots-  very good and flavorful.  \nStew beans-  tasty and well seasoned.  \nPotatoes-  very good and crispy. \nBroccoli and peppers-  steamed but good. \nVeggie samosa-  its baked. So good.  Get the sweet sauce that's got the condiment area. So good.  \nDesert-  veggan cupcakes-  good. \nRaspbaerry cheesecake-  very good.  Not too sweet. But too bad it's not veggan but I got a piece to go.   Their cookies r not veggan either.   Too bad. \n\nI so glad I was around the area to try this place. I would definitely go back but so hard to find parking.  Next time I would take the train.  \nFood and service were awesome.   Drinks and breads were free.   All the food were so perfectly seasoned.  Not overpowering with spices like I expected.   I was up for surprised.   I recommend everyone to try.", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "I've been meaning to get myself over to this Hare Krishna temple for their buffet lunch since I moved to the neighborhood three years ago! I finally went today and it was just as great as I expected. Essentially a large cafeteria in the basement, there is a small buffet set up with different specials each day. Today they served breaded tofu with sides such as rice, lentils, broccoli, beans, cole slaw, salad, bread, etc. Prices are so reasonable and you pay based on how many items you want. I had a plate with four items and paid $10. It was a huge amount of food and everything tasted great. Make sure to taste all of the condiments too which added some extra flavors. I felt full but healthy afterward and also enjoyed people watching while I ate - you'll find everyone here! From large Indian families to Brooklyn hipsters, everyone will feel at home.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Awesome vegetarian/vegan lunch spot. This is as good as it gets.\nFood is made from scratch with fresh ingredients. Excellent customer service and atmosphere. The Head Chef, Satya, runs it all! She is amazing and very knowledgeable about various cuisine and their health benefits. She started the business years ago and has grown it with her determination and hard work! HIGHLY RECOMMENDED!!", "author": "Bm C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "This place is literally my second home. It's dangerous working within walking distance of this place. I've definitely gone multiple times per week. THAT'S how tasty it is. \n\nReasons why this place is the bomb (because who doesn't love a good list!):\n1) The options are endless - They have a different main dish every single day of the week. On top of that, they have rotating sides (which are really main dishes in themselves). My personal favorite day is eggplant parm day, also known as Thursday. They give you a HUGE cheesey hunk of parm and as many sides as you can handle. \n2) Speaking of sides, you can basically choose as many food items that you want, ranging from one item ($5) to a complete meal ($12). \n3) You can combine two items into one! I love getting rice and beans together as one item. It helps with the cost and allows you the opportunity to try more delicious items!\n4) The portions are huge! I personally love getting the four item plate. It's only $10 but is enough food for two meals! \n5) I'm like Oprah. I love bread. I love it. And Govinda's has a fresh bread option every day! It's a carb lover's dream come true. \n\nMoral of the story: Go here. Go now. (But only if now is between 12-3pm M-F, otherwise they're closed)", "author": "Chey O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "The food is phenomenal! Everything is made from scratch, from the cookies and cakes to bread and salad dressing.  A variety of healthy options. Portions are quite hefty. The atmosphere is calm and soothing. The staff is friendly and knowledgeable of the health benefits of the various items. They even do a  Thanksgiving all you can eat feast every year with 30+ preparations. Amazing experience every time!! Great place to take your family, your clients or by yourself to get away from the hustle and bustle!! Highly recommended!!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Hearty healthy lunch with super friendly staff. Definitely a must go place! In the downstairs of a temple, it is perfect for lunch and clean and tidy.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Absolutely off the charts. This is not only some of the best vegetarian food I've ever had, but some of the best food, period. I almost wish I could get married again so I could hire them to cater it. The prices here are moderate, but for the quality and quantity it's well worth it. \n\nHare Krishna!", "author": "Jason R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "So happy to finally try Govinda's Vegetarian, the food here is delicious and the people here are so friendly! I enjoyed everything I tried. The gripe about this place is that it operates on limited hours they are open from 12:00pm to 3:30 pm, Monday through Friday. Another thing is that they are sometimes closed so check Facebook for announcements and for the menu for that day.  Love this spot!", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "This place is fantastic. My only complaint about Govinda's is that it's not open for dinner. It operates out of the basement of a Hare Krishna temple and is only open for lunch during the week.\n\nThe buffet rotates, but has a lot of consistent standout items. You can get a gigantic platter of delicious food, easily big enough for two meals for the price of one.\n\nI like that you can get 4 or 5 different dishes and surprisingly their vegan cupcakes are incredible. Most of the food is vegan and all off the staff are very friendly and helpful.\n\nSatya, who operates the lunch service and catering is a kind and generous woman who is really passionate about her job. The restaurant is a non-profit which operates to feed the members of the temple and raise money and you can tell they take a lot of pride in what they do.\n\nMy personal favorite dish is the Kitchori which they have on Mondays. \n\nThey do serve the food on styrofoam plates so if you are environmentally conscious, I'd recommend bringing one or two containers with you to east out of- which is also convenient because you can easily take the leftovers home because you won't be able to finish it.", "author": "Eli S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Hidden gem for veggie lovers under a hindu temple in the basement. It is set up as a cafeteria with a food area. You are able to choose between full meal (a huge plate enough for two people for $12 which comes with rice, bread and soup) or multiple items small plates for $9~11. Each day they will have different daily special (and today was eggplant - YUMMY!). The side dishes include: sauteed cabbage, string bean and carrots, braised tofu and quinoa salad. I also got an extra scallion naan for ~$2 as my friend and I were just sharing a big plate.\n\nAgain, the place is in the basement of a hindu temple and the decorations are very interesting and it almost feels like that you were in a hindu palace a little bit. The place is very spacious and they have big tables for groups as well.\n\nDo bring enough cash (~$13 per person) as the place is cash only. In case you can't find the place, in front of the temple there is a menu board showing daily specials. Walk right in and downstairs. Be ready to enjoy!", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "This restaurant is a hidden gem in the basement of a Hare Krishna temple.\n\nThe set-up is basically cafeteria style.  You order your food, it's placed on a tray, and you walk to a table (unless, of course, you do take out, which they offer).  The prices depend on how many items you choose for your plate.  You can also order sides, such as veggie samosas for an extra cost.  The décor is basic, and they play Indian music (mostly Hare Krishna chants) which makes for a nice/cool atmosphere.\n\nAs for the food: WOW!!!  I had cabbage balls which were amazing.  I also had mixed veggies which were cooked to perfection and wonderfully spiced.  The eggplant parm was interesting, but in a good way.  My family (Maltese on my mom's side, with some Sicilian relatives) makes it differently, but the spicing made for a most tasty variation of a classic dish.\n\nI wanted to order a side of samosas, but unfortunately they were still being cooked.  While I was disappointed, the 3-choice option was very filling, and I left feeling very happy.\n\nThe people who work there are very nice.  When you enter the temple, there is usually a person at the front desk to welcome visitors and point them to the restaurant.  We arrived a little early and spent some time looking around the temple, which was nice.\n\nThe restaurant is only open on weekdays for lunch, starting at noon.  It's a bit of a schlep from my office in midtown Manhattan, but I had taken the day off and was playing tour guide for a visiting friend.  While eating, it looked like the restaurant has a loyal following among locals.  With food like this, that is no surprise.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I love this place so much I have, and willing, to take a day off from work and trek all the way from jersey city to get here. It's that good. And healthy. And the people behind the counter are incredibly friendly. It's the best deal for lunch in the city. \n\nCome with an empty stomach and Tupperware. The complete meal should be called the complete day--- there's that much food. All for $12.", "author": "Liza P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "So glad I finally checked this out! To be absolutely stuffed on vegetarian Indian food for under $13 is a true blessing in today's Brooklyn. And I'm glad I rolled through for kitchari day, because I am all about that ghee, tumeric, and daal life!\n\nThe price of admission included great herbed yogurt dressing, arugula salad, piles of spiced chickpeas and sweet potato, vegan saag paneer, basmati rice, stewed black eyed peas, and lentil soup. Drinks are unlimited and there's a selection of chocolatey desserts (frankly, the only kind). This is one of those super weird, \"only in New York\" spots that is absolutely worth trying if you find yourself in the vicinity at lunchtime on a weekday. And if you've been to some of the world's more kirtan-infused yoga studios, you will pick up on the vibe immediately.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "The best place to eat in downtown Brooklyn, one of my favorite places to eat in NYC. The food is beautiful, healthy and delicious. What an unlikely surprise in the basement of a Hare Krishna temple! This is the exact kind of thing that makes NYC special.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "So i hate to put it this way, but i think it's quite true..this place is perfect for hipster vegetarians and vegans...\nThe service is great!  They are so nice, friendly and helpful. The portions are generous.\nThe food is made for the extremely sensitive palate (read bland).  When i eat Indian food i expect an explosion of flavor in my mouth..not so here...\nThe vegan cupcake was perfectly moist...\nThe free orange tang-like juice was a very nice touch.\nOh, the pickled veggies (chutney) was very authentic and delicious..\nAll in all, good value, great staff, okay food", "author": "Sally A."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}