{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "By now my fiance doesn't bat an eye when we're in NYC for a wedding, and I tell him that after we pick up his tux, there's a Hindu temple that serves a cash only vegetarian lunch in the basement around the corner and this is probably where we should go eat. Like of all the places we could go to eat, I'm walking him down stairs to what looks and feels like a soup kitchen for those without a place to call home.\n\nOf course everyone there is super pleasant. I mean like, when we asked if was cash only, we were told \"it is, but if you don't have it, you can pay us some other day.\" The two of us shared a $10 platter which pretty much got us everything that was left on the buffet (getting there later in the day means that some items are gone already!) and then ordered some other misc stuff too. Seating is family style at round banquet tables, so buddy up with anybody among the mix of people and families that only a vegetarian lunch in the basement of a hindu temple would be able to bring together.", "author": "Allison K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Great vegetarian cuisine for cheap. You get so much food for $7. I was full for the day.\n\nIt's like a cafeteria, when you go to the counter, order three items, then enjoy. \n\nThe lassi tasted very fresh\n\nFpr beginners: They only sell lunch, and the place is inside a Krishna temple and u have to go downstairs once you get into the temple", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "I have been eating at this place for a long while now and let me tell you, these guys are great!!!!\n\nI would eat here every day if I could! The food is delicious, inexpensive, the portions are big and you don't feel guilty afterwards. Honestly the best and most consistent vegetarian food in Brooklyn.", "author": "E A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "I've been wanting to eat at Govinda's for awhile, but since it's only open during the week from 12-3:30, I haven't been able to stop by until now. But I am sure glad I had the chance to today!    Lunch is served cafeteria style and you have the option of tasting the whole menu or picking and choosing the items you want.  You pay based on how many items you select.  Everything was delicious and the portions are very generous.  Most of the items were vegan and the staff is very friendly so you can ask any questions re: dietary restrictions or anything else.  I'll definitely be back!", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "I've been on the lookout for exotic spots around the city to eat. I enjoy diversifying my plate and seeing what different cultures concoct to satisfy that same feeling located in the abdomen all around the world. I heard about Govinda's and decided to check it out. \n\nI must say the photos didn't do this place justice. I first entered the Hare Krishna temple (where Govinda's is located) and was greeted by a \"Namaste\" from a kind woman. Before I could even smile at the authenticity of her kindness, they asked if I were there for lunch and politely pointed towards the staircase leading to the basement. I thanked them and went on my way. \n\nAs I conquered the steps, I glided into the destination and behold - Indian music (for lack of a better term) hummed in the background, large round tables littered the area, and a small kitchen was set up on the far right side. I inhaled and immediately knew I was getting my money's worth. \n\nOne dish I recommend getting is this hot salad made with cauliflower, green beans, kale, potatoes, and more, all sautéed with spices, including tumeric. They even serve free mango lemonade (with no added sugar) along with your dish. \n\nThis is a great place to go for a date, lunch on the go, or just to relax from the heat. It's a wonderful experience for anyone wishing to escape the bustling streets of New York and enjoy some vegan/vegetarian grub. Go there often enough and you might catch me chowing down too.", "author": "Garrett K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Oh.. My... Gosh. Best $10 lunch option in the area. SO GOOD. Seriously i'm hooked. The bread was fresh baked, light n fluffy. The sauce that came with the breaded tofu was incredible. even the \"refried\" beans had a great flavor, nothing too spicey and enough food for leftovers!!.'\n Not thrilled about the Styrofoam packaging for \"to go\" meals but oh well.", "author": "Arielle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "The best vegetarian/vegan Indian food you'll find for your money...PERIOD! This place has a rotating daily buffet menu with dishes like potato aloo gobi, spinach daal, split pea soup, fresh rosemary breads, and vegetable samosas. For $6 you can lunch till you heart's content. Don't forget to try their delicious mango lemonade.\n\nCash-only cafeteria-style dining with a very friendly cross-section of Brooklyn office workers, locals, and parishoners. Did I mention it's in the basement of a Hare Krishna temple? AMAZING. Just found my new go-to lunch spot!", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "So delicious and all vegetarian! Absolutely loved it. The full meal is so much good you can easily share. Although I didn't and almost ate everything just because it was delicious.", "author": "Joana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Came here, got the eggplant, thought I died and went to heaven. Even the bread they serve on the side is amazing. A huge serving of healthy (can food this good really be healthy?!), delicious, fresh food for seven to ten bucks. 'Nuff said.\n\nIf this is the kind of food they serve on the regular at a Hare Krishna temple, I might need to look into converting.", "author": "Bill B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "I can definitely say Govinda's offers the best vegan Indian food in Brooklyn.*  $6-$8 will fill your hungry lunchtime belly to the bursting point with creative, homemade Indian dishes that change daily.  Everything is served cafeteria style by a sweet, smiley lady.\n\nEntrees range from nut \"meat\" loaf, chana masala, quinoa salad, lentil daal, vegan eggplant parmesan, curried kale, etc.  The slices of raisin bread they serve are free and go great with the daal.  They also have free mango lemonade for all customers, but it usually runs out by around 3pm.  The lunch buffet is open until 3:30pm on weekdays only.\n\nGovinda's makes food that my grandma would make if she were Indian.  It tastes so homemade, unique, and infused with thought, love, and care. I would love to meet the head chef and thank him for creating such unique Indian dishes that are delicious and always perfectly spiced.\n\nThank you, Govinda's, for giving me a lunch option other than Two Bros or Subway!\n\n*In Manhattan, that title goes to the NY Dosa cart near NYU.  Thiru (the cart owner and chef) is the man!", "author": "Kelley K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "I really can't say it better then garret (see bellow) so ill keep it short. Great food. Great people. Great vibes. All at a great price. \nI really love the Enviroment tucked away like a hidden gem. The large tables allow you to connect with others without any pressure. There are also smaller tables for a more intimate lunch. \nThe food. The food might blow your mind. Layers of flavors in every bite wakes up your palate in the best way possible.", "author": "Chandra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "So delicious and totally affordable! You can get a \"complete meal\" for only $10 and it's a lot of amazing food! This place feels so communal, you sit at open tables with strangers in a cafeteria like setting. The servers are so friendly. My new favorite spot. I will have to go back and try a $1 cookie!", "author": "Evelyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Its the best me and wife ever had in NY, hands down. The flavor of the food is so nourishing to the soul.", "author": "Kenroy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "There's not much more to say - all of the previous reviews seem to be spot on. The food was good, and you really can't beat the price! Remember, this is not fine dining and there is no table service, but it is fairly nice for what it is (a basement cafeteria).\n\nI recommend going with someone who you can share with. For 10 bucks you can get some of everything, but it is far too much food for one person to eat. My girlfriend and I shared the 10 dollar deal and still had leftovers to take home.\n\nLove the unlimited iced tea/juice (though as noted, it runs out towards the end of the afternoon, so come before 2pm to ensure it is truly unlimited).\n\nCash only.\nThey have take out containers.", "author": "Ellen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Delicious cheap vegetarian food in the basement of a hare krishna temple? Yes, please! \n\nThe food isn't wildly creative or super crave-able but it isn't about that. It's about the fact that it is copious, cheap, and healthy. This is the kind of meal that clears your head and gives you energy for the rest of your day.\n\nMy boyfriend and I shared a $10 plate and both left full. Physically and spiritually.", "author": "Tee E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Go Govinda's!! Go Go Govinda's!! I enjoy meat as much as the next person, maybe even more if you read my BarBacon review, but this place knocks my socks off consistently.  It's conveniently located next to my office and I have come to enjoy my lunches there.  The food is all vegan or vegetarian, flavorful and delicious.\n\nIf you need clean eats in the downtown Brooklyn neighborhood, then go here.  It's only open Monday through Friday noon to 3:30 pm, so get it while the gettings good.  Thursday is a good day to go if you like Eggplant parmigiana.  The rest of the time the menu is littered with Indian inspired vegetarian fare, fresh salads, soups and desserts.  Don't sleep on the cookies they are fantastic and vegan.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "Don't even want to tell you guys about this, the line gets longer every time I go! \n\nMy office goes wild on Thursdays aka Eggplant Day. The quinoa, salad dressing, and bread alone are worth the trip. Follow them on Facebook to find out the daily specials. \n\nGovinda's not quite as cheap as the basement-of-a-temple stylings might make you think, but the delicious food will have you ready to convert.", "author": "Corinne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "I was so happy when I had to work out of the Brooklyn office for a few months: I came to Govinda's for lunch at least twice a week. The cafeteria is located in the basement of the Hare Krishna temple, which is on a can-be-desolate stretch of Schermerhorn next to some government (social security) buildings. The menu changes daily, but you can get deliciously full for $6-8, $10 if you want lunch and a snack later. \n\nI had it down to the eggplant parm and a slice of cheesecake. (Really, I could get a whole tray of that eggplant parm.) The service can be slow because it's usually just one person and the serving sizes vary (I WANT CORNERS ALL THE CORNERS) but it's a low-key kind of place, with communal tables and a bus-your-trays policy. There is complimentary water (sometimes cucumber water) and special teas (hibiscus, etc.) by the napkins \u0026 cutlery.", "author": "Audrey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "My friend urged me to go for lunch with her to this hard-to-spot place. There was no sign out in the front. Once you go into the building, you go downstairs to the basement. It's a cafeteria style - you choose what you want. They had a very nice vegetarian meal - Vegetarian Lasagna, Quinoa Salad, Warm Zucchini Salad, cupcake, cheesecake, and bread. My meal was only $6 for 2 selections. \n\nIf you are a vegetarian, this is the place to eat. It was delicious!\n\nGovinda's is open Monday thru Friday during lunch time only. \nCheck out the daily menu on facebook https://www.facebook.com/govindaslunch", "author": "Minty N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "I love their lunch,  it is always tasty, the eggplant parm is really good.  Another plus is the free juice. I definitely recommend,  and it is healthy", "author": "Mick E."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}