{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "One of the best vegetarian places I've been too. Great deal for the amount of food you get. Friendly staff.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "For less than $10, the best and filling vegetarian meal.  Specifically: \n\n- Tofu Patty with Green Sauce\n- Nutloaf\n- Sauteed Kale\n- Quinoa \n- Dahl \n\nAll very tasty and excellent!", "author": "Monica Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "Great vegetarian food in a long long time. Their food speaks for itself. Right from the chutneys ,refreshing salads and lemonade to the pickle *amazing pickle* . Absolutely pure and home -like cooked meals. A tray full of real good and healthy vegetarian meal in not more than $10! Must visit!", "author": "Amrapali P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "I took my coworker here for lunch because of all of the amazing reviews on Yelp. I have to say that it is a great place to find homemade food for lunch that wont hurt  your wallet. I personally did not enjoy the nut loaf as much as everyone, but everything else was great! You get so much food and everyone there is super friendly. I paid $9 for 3 entrees, and I had some food to save for later. Overall, I love concept and like that there is something different each day. Can't wait to try the Lasagna on Thursdays.", "author": "Puja P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "Just do it. Seriously. This place is wonderful. Walk down the flight of stairs and pay  $10 cash for a heaping plate of yummies, bread, soup and salad. \n\nTrust me you'll leave full and happy!", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Not the type of place you would expect in the heart of Brooklyn, but surprisingly one of my favorite lunch spots in the city. They offer cafeteria style dining, nestled in the basement of a Hare Krishna Temple. The space is very peaceful, and the people working are especially kind. The food is out of this world - all vegan or vegetarian - with a changing daily menu. I've been here many times and I've never been disappointed. The portions are generous and all for around $6-$8. Give it a try, you will be hooked!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Great find thanks to Yelp! Completely unexpected place to eat, hidden underground of a Hindu temple. They serve very good quality vegetarian food in nice quantities and pretty cheap! It is $7 for 3 items, $8 for 4 and 10 for a complete meal. I was full with 3 items and the free bread ! Also the people serving are very welcoming. Lots of space and cosy feeling. Very relaxing oriental/Asian music.  I highly recommend !!", "author": "Marie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Govinda's isn't swank or fancy. It doesn't try to be something it's not. It's a simple restaurant located on the bottom floor of Brooklyn's Hare Krishna temple that caters to locals who live/work in the area and who want something fast, healthy and easy on the wallet. Open weekdays from 12:00 - 15:00, Govinda's Kitchen offers a rotating menu of Indian-inspired vegetarian and vegan options including soups, warm/cold salads, breads and desserts. It is, by far, the best value for money within a 5 km radius of Schermerhorn. Don't read more about it, just head over there. Now.\n\nWant Bang for your Buck? Try the Buffet at Govinda's Kitchen: http://fortheintolerants.com/?p=3809", "author": "JoAnna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "This place is AMAZING!!! The food is GREAT!! The prices are fantastic!! The staff is AWESOME!!! I had water, two salads, soup and a full meal for $11 and they have free juice in a cup if you drink juice. So yummy!! I had the cheesecake...OMG..yummers!! The guy told me that the \"crust\" is made from cupcakes. DELICIOUS!!", "author": "Luwana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "This is place amazing veggie heaven! I get lunch here at least twice a week. Good vegetarian options that is also delicious. Love!", "author": "Y Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Tucked away in the basement of a Hare Krishna temple is Govinda's Kitchen, a vegetarian cafeteria of sorts with amazing food! Who knew? \n\nI made my way through the line where there was one person serving from a buffet and you have your choice of as many (or all of the items) that you like. I opted for the four item plate (I wanted to try as much as possible!) and got the tofu steak, eggplant/potatoes/peas stew, cucumber salad and baked beans. I also got a samosa and an oat chocolate chip walnut cookie all for $11. I got my items to go just in case I couldn't finish it all (I suggest you do the same, the portions are large) and had a seat at one of the big round tables in the center. They have a couple chutneys on utensil table, and me being the big fan of condiments, got both to try as well. I was ready for my feast. \n\n Boy was it a feast. Who knew vegetarian food could be so filling and tasty! I started with the tofu steak which was lightly coated in a seasoned breading and slightly bland, but with the green sauce and the tamarind chutney it added just enough flavor to it. The eggplant/potato/pea stew was thick and hearty as was the baked beans and also went nicely with the sweet tamarind chutney. The cucumber salad was refreshing but a bit on the bland side as well and could use a bit of salt or acid, but was nice to cut all the richness of the other sides. The cranberry bread was super tasty though and very soft and pillowy just like I like it. The samosa was probably one of the best I had. It wasn't greasy at all and the filling and pastry were both nicely seasoned and light. Finally that oat chocolate chip walnut cookie was the perfect sweet and chewy end to the meal. \n\nSuffice to say, I couldn't finish all of that in one sitting and it was definitely at least 2-3 meals worth! They definitely don't skimp on portions. I was fully stuffed and had plenty to bring back to work to snack on for the rest of the day. Great meal, great price and though the cafeteria style setting isn't the nicest ambiance, it is a relaxing space and a nice getaway from the hustle and bustle of Downtown Brooklyn. I will be back.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "I have no idea how this restaurant is because I couldn't find it!!  After walking up and down the block at least half a dozen times, I gave up.  Is it closed?  I have no idea.  They really should get better signage.  I was with a friend and she couldn't find it either.  We gave up and ate somewhere else.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "Amazing! Cheap. Great Lunch Place. So wonderful. Good people, good hearts. And in a perfect location. Made my visit amazing. For sure going to come back! Remember it is cash only!", "author": "Alana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "I come here at least every other week for lunch. We always get the $10 meal and either share or if we're really hungry have our own as our food for the day! As a vegetarian it's really hard to find places like this that serve up great filling food but you can always count on the krishnas to do the trick for ya!! I love the katchoris that they make on some days and the samosas are awesome!!! Everything is so fresh and the menu changes daily so you don't know what you're getting really until you show up! They make a mean mean eggplant parmesan!!!! So yummy so happy whenever we go!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Best cheap lunch around.\n\nGovinda's is my go to for lunch in the neighborhood. Service is food hall style in the basement of a Buddhist temple. If you are looking for vegan food make sure you ask. Some items are vegetarian. The khofta balls are the my favorite. There is also always a good beet salad.", "author": "Tom K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "Not just hype! I read the reviews and was excited to find a vegan spot to add to my lunch options. \n\nGovinda's lives up to the reviews here and I am now a fan! All of the food is cooked and served with love, there's peaceful vibe downstairs, and the cupcake I had was AMAZING!!", "author": "Greg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Great food \u0026 friendly staff. A lot of vegetarian options here \u0026 it's like home made food. It ll be hard to find another place like this ! Highly recommended !", "author": "Juan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Govinda's is a rare vegan treat.  We had been to the temple in Queens and also ate cafeteria style in the basement.   You could miss the building aisle as it does not look like a temple from the outside.\n\nToday the food was delicious.  We had baked winter squash, cartelized in the oven with light curry flavors.  The soup, a smooth lentil soup with small cumin seeds was delicious and light. We also had a mixture of rice, lentils and other vegetables with an amazing herbed yogurt sauce.  The green beans and potato curry was a little spicier than the other curries and richly seasoned. The salad was fresh with slivers of carrots and a variety of mixed greens in a wonderful herb vinaigrette.  It was all topped off by a fresh mont tea.\n\nTwo of had lunch for $16.  They charge by the dish and it gets cheaper and cheaper as you add dishes.  So go hungry.  You won't miss the meat!\n\nNamaste!", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "A healthy island in a sea of pizza and fried food.  Cheap vegetarian food, pretty good. Friendly folks running the place.", "author": "Gee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I'm a huge fan of eating here! Very fairly priced, friendly service, and incredible vegetarian food. I've heard that food made by loving hands, surrounded by those in pursuit of a higher cause, passes a positive loving energy forward to those who consume it. And that's how I feel about eating at places like this. The love and generosity would be enough. But then you get a delicious meal as well. So I will be coming back again and again and again. Thank you Govinda's!", "author": "Jon C."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}