{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Really surprising find. Upon first glace, it was just an open room with a lady standing behind a makeshift buffet serving food. However, once served, the weird atmosphere was redeemed by the food. Not what I expected at all but was cheap and delicious.", "author": "Nicholas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Perfect in all ways, as long as you're okay with eating in a basement. Food is excellent vegetarian, fresh and delicious. Staff is friendly. Price is RIGHT. I am addicted to the lentil soup and samosa, with free mint lemonade. Best deal, however, is the $10 giant lunch box, with soup and salad and all the dishes of the day. If you get it to go, you can stretch it to dinner easily. One of my favorite places in NYC. Btw, you cannot see any signs from the street, so just enter the temple and go downstairs, following the sign for \"banquet.\"", "author": "J V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Good, cheap, \u0026 healthy for body \u0026 soul. The good is not of you're looking for authentic indian fare, the spices are a bit dulled to accommodate the mostly non Indian patrons. Still it's good, and everything is made there including the bread 3 food choices \u0026 a slice of the amazingly delicious raspberry lemon cheesecake ran me $10. \u0026 I had to pack a to go bag. The meals are set at $3, $5, $7, \u0026 $10 comes with fresh baked bread, chutneys, lemonade on tap or water. And the service is friendly.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "You will not eat in a more unique setting tharn Govinda's.  Tasty (not overtly spicy/indigenously Indian) vegan fare in essentialy what feels like a church meeting hall (it's a former municipal building that is now a temple) but the veggies, beans and starches are out of this world.  NOT FANCY! but super original", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-06", "description": "The food is strictly okay. It might appeal to the palate of westerners but for Indian who have grown up on spicy and flavorful food, this will be a definite let-down.\n\nI wasnt expecting great things with the place since its in the basement of the Hare Rama Hare Krishna temple. The place was pretty neat and clean and quiet enough to enjoy your lunch. \n\nThe price is right and the woman serving the food is polite. \n\nThe food is not bad, but I am pretty sure the people who have grown up on the real Indian food, will not like it.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Delicious food at reasonable prices, and you feel like you are \"in the know.\" My only complaint is I wish they were open for dinner!", "author": "Jess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Solid, tasty fare and good sized portions. Great value! We all need to support places like this.", "author": "Ryan I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "Absolutely great value. You have choices of $3, $5 and $8.  All depends on how hungry you are.  The portions are very generous and the food is always fresh.\n\nI absolutely recommend the Quinoa salad.  It's served cold with cherry tomatoes and chopped parsley.", "author": "Jaime D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "What a deal! $10 gets you a huge plate of everything including salad and soup. We have eaten at the one in Hawaii and in LA and this is by far the best!", "author": "opqr s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "For vegetarian food this place is not bad.  Go for meatless Mondays!", "author": "N. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "A rare place this is. Not many places you can get a big selection of vegies on the same plate. All flavored different. Very inexpensive. A very relaxed peaceful place to eat. No one pushes religion. All around good vibe. Warning their is no Air conditioning. Too hot for me on the hotter summer days. Menu changes everyday. You can go on facebook to  see the days menu. We love their different style of cheesecake. Our favorites are the broccoli with sweet potatoes \u0026 the tofu sticks. The only problem with the food I find is that the eggplant \u0026 potatoes often come out to salty for me. That's not a big problem. Their is still always plenty to eat. Govinda's is a vegetarians delight.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "I usually don't go for the vegan restaurant over anything else around but for Govinda's Kitchen i have to make an exception. This food is spectacular, cheap, and will leave you satisfied. It is conveniently located in the basement of a downtown Brooklyn Hare Krishna temple. Transportation all around, and good vibes in the place. Its cafeteria style and the menu changes all the time, but no matter what is on deck it is delicious. If I have one gripe, its that the hours are hard to catch.", "author": "Dominic D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "I've been to Govindas all over the world, but didn't know this place existed a few blocks from my workplace until Yelp featured it in an e-mail on Brooklyn vegetarian choices this week.\nOpen only a few hours at lunchtime, and from the chat there, not every day--so call ahead--Govindas is basically a lunchroom with counter service of a limited menu of delicious vegetarian food, some of which is vegan.  I had a delicious mixed vegetable dish, rice, a green salad and a lentil salad.  With bread and \"juice\", I spent $8.\nI wish their promotion were a little better--I'm sure I'm not the last Brooklyn vegan to learn about this place!", "author": "Janet G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "Having just started working in the area, I have been looking for healthy \u0026 cheap options for lunch. So when one of my co-workers kept raving about the tofu filets at Govinda's, I had to check it out. \n\nShe was right to rave - the food here is excellently and lovingly prepared. I have been twice, both times on a Tuesday when they do the tofu filets (which ARE delicious btw) and they give you a tasty little sauce to dip them in if you like. The sides I have tried so far were a mix of zucchini, brocolli and peppers, cabbage \u0026 potatoes, kale and eggplant \u0026 potatoes. All of them were great. For $7 they give you a lunch that will satisfy but not leave you in a coma at your desk!", "author": "Cheryl M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Unreal food. Unreal price. Don't miss out. The kofta was my favorite. $7 gets you three sides (you could easily save half for dinner) and $10 gets you everything they're serving that day (which could EASILY be saved for dinner AND the next day's lunch). They didn't start serving exactly at 12:00 PM the day that I went-- more like 12:15. But still plan to get there early because there was quite a line-- with good reason!", "author": "Lai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "I say 5 stars because every time I eat here I feel satisfied and happy... What more can a person ask for? Good food and good karma!", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "Those of you'll who go \"tsk tsk\" at us vegetarians should go to this place..:P  I was in the area, I was terribly hungry and a quick yelp later decided to try this place. By the time I got there it was just a little past their mentioned lunch hour, and I was pretty sure I was going to go back empty stomach! How wrong I was, the gentleman at the reception ( it is housed at the Hare krishna temple) was so friendly and showed me the way to the lunch hall and also spoke to the people there to rustle up a meal for me( just me!). The food was unlike anything I've eaten before. It was simple, delicious, cheap and healthy - bean sprout salad, dal, fresh salad, roasted vegetables all served up with bread in a little plate. I ate a hearty meal and while I walked out oatmeal cookie in hand, I still couldn't make up my mind about what was better - the food or the people that serve it. *wipes tear* :D", "author": "Preethi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "GO! As a recent work transplant to Downtown Brooklyn I've quickly learned that options for a healthy (and sanitary) lunch are hard to come by. Govinda's Kitchen is both of those things. The menu rotates daily, but seems to be consistent weekly. I've gone on two different Thursdays and gotten the eggplant bake--it's delicious! I also love their samosas and the dipping sauce they have at the end of the hot line. Free lemonde as well! Bring cash as they don't take cards.", "author": "hannah s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "An oasis!\nAt last a healthy, affordable and delicious 100% veggie and vegan lunch spot in this area!!! If anyone knows this section of Brooklyn it is a strange juncture off Flatbush and Nevin's where the healthiest things to eat are fried foods and soda - a veritable wasteland.  Located in the lower level of the Hare Krsna temple, $8.00 gets you a complete lunch which includes a featured entree like baked ziti for example and a vegan choice like tofu in a cashew sauce, rice, soup of the day, two choices of vegetables, a salad, and a slice of fresh baked bread. The tea is complimentary.  Extras are samosas, a pastry like triangle stuffed with potatoes and peas, kachoris stuffed with peas and chana dhal and cake which range in price somewhere between $2.00 and $5.00 an item.  The only downside is that they are only open for lunch :( Hours from 11:30 am to 3 pm  Monday through Friday. Cash only. Take away or sit down.", "author": "Ekayani C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "I went here for the first time based on the amazing Yelp reviews, and it did not disappoint! What an amazing deal for a delicious, healthy lunch in Downtown Brooklyn. This is my new weekday lunch spot.", "author": "A M."}], "servesCuisine": "Vegetarian", "priceRange": "Under $10", "name": "Govinda’s Vegetarian", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "305 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Hl6hwJzxv6QHf7xoksrzkA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556714"}