{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Came to Cecconi's in Brooklyn for the first time tonight. Every single dish that came to the table was phenomenal. Started the night with the whipped ricotta and prosciutto plate, followed by the truffle pizza, and completed our meal with the lamb pasta review. Our server GianFranco was attentive and very helpful throughout our dinner and we were taken care of by the house manager Luigi. After our experience tonight, I will definitely be checking out their location in Los Angeles. If you're in Brooklyn and looking for a delicious meal paired with an amazing view, I would highly recommend Cecconi's in Dumbo.", "author": "Shaida S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "5 stars for the ambiance, decor, and stunning views; 3 stars for the food.\n\nIf you want to impress a date, your future in-laws, or potential business partners, Cecconi's DUMBO is going to do the job. This may well be the most beautiful restaurant in Brooklyn. On the ground floor of a former warehouse, Cecconi's features a massive bar with a white marble countertops, aquamarine blue leather seats, gleaming chandeliers, black-and-white tiled floor, exposed bricks and wood beams, and a fantastic wood-fired pizza oven right by the bar.\n\nOverlooking the East River, with a magnificent view of the Manhattan Bridge, the Brooklyn Bridge, and the skyline of Manhattan, the outdoor seating at Cecconi's is sure to impress as much as the indoor dining rooms.\n\nCocktails, all $15, are excellent. From the selection of 8 Negroni varieties, to 10 other cocktails plus 3 house tonics. Moreover, if you're not drinking alcohol, they have some tasty mocktails.\nI wish their beer selection was better, though.\n\nAs far as food, however, you have to know what to order. Pizza here is delicious, as the wood-fired oven makes a perfect Neapolitan pie, thin and chewy. Their pizza menu is limited, though, with just 5 pies available, ranging in price from $20 for a margherita, to $46 for the black truffle and zucchini blossom one.\n\nTheir own burrata is also delicious, whether served as an appetizer with heirloom tomatoes, or on a pizza with bresaola, wild mushroom, and parmigiano.\n\nAs far as cicchetti, i.e. small dishes, the shishito peppers are delicious[1], just as whipped ricotta with truffle honey, even though it came with crostini that were likely toasted a long time ago, in a galaxy far far away...\n\nFor appetizers, alongside the burrata the veal tonnato with caper berries is also excellent; a dish you don't see very often.\n\nAs far as pasta, both the cavatelli with lamb ragu' and the agnolotti with wild chanterelle mushrooms were both really good. Tasty, and satisfying; perfect pasta dishes for any season.\n\nOther dishes were disappointing; the butter lettuce salad with sprouts and avocado was sad, and the eggplant parmigiana, cooked in the wood-fired pizza oven, was surprisingly bland. The short ribs with mashed potatoes, truffle, and horseradish, on the other hand, is a great winter dish that packs a lot of flavor.\n\nOverall my feeling is that with your food you are paying also for the great view and the impeccable service. The Dover sole arrives at your table on a cart and is filletted right in front of you. But it's also $64[2].\n\nI usually come here on a Monday, as I have a \"membership keychain\" that gives me 50% off for up to 4 people. Given the hefty prices, and the hit-or-miss food options, I am not sure I would come here regularly without this great deal.\n\nAlso the menu states that \"A 20% service charge will be added to groups of six or more\". However, every time I've been here I've always seen a 20% gratuity added to my check, whether it was 2 people or 4. I'm fine with a 20% tip, as the service here is great, but why write one thing in the menu and then do something different when the check arrives? It's a deceptive policy which seems unnecessary. Just state that a 20% tip is automatically added to every check.\n---------------\n[1] It comes with grated bottarga on top, which I love.\n\n[2] Intended for 2, but still, $64 for a sole?", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "Amazingly terrible service and mediocre food, but you really can't beat the view and location. That alone keeps this place packed and the redevelopment of the area sure makes this seem like a Michelin level experience. Since they sure do seem to charge exorbitant prices.\n\nIf you don't get a seat outside on the water, this place is just a cavernous Pasta Pomodoro that's dimly lit and seems to be run by a higher level.\n\nI can't recommend it completely, but the view and location are sometimes just too much and for that reason if you're around, come check it out, if at all for the happy hour and giant bar in the middle of the restaurant.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "I've been to both the LA and Miami locations and this location does not disappoint!!! The service is by far some of the best I've ever had!! Always sweet and completely professional...I love that they are beyond not pushy as well, your dining experience feels important to them! Pizza is amazing, pasta, my husband has had the steak and last night he enjoyed the short rib (he loved)! Their Always willing to accommodate any changes or allergies...I just this place!! Second time back and I will be returning \n\nI also recommend the California Cab by the glass and the sav blank very yummy if your not doing a bottle", "author": "Daniella V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "This place exceeded expectations from the time we walked in the door. The host, I believe her name was Alison; was so warm and welcoming that it was a breath of fresh air to witness. Our server Raul was amazing and\nattentive to our needs during lunch and did a great job with timing our foods throughout each course. I can't forget about Kenny who was so knowledgeable with spirits and cocktails and great conversationalist. I can't wait to come back during the spring and summer time to take advantage of their beautiful deck. \n\nFood: \nthe prosciutto is ahhh-mazing \nBucatini is flavorful and fulfilling\nTagliatelle is meaty \u0026 consumes with delicious spices", "author": "Domo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "The ambiance of this place was really nice. I went with two of my best friends here for dinner and we had a cute intimate table by the window over looking the Brooklyn and Manhattan Bridge. The hostesses were very nice. I came straight from the airport and they stored my suitcase for me while we wait. \n\nThe service, however, was insanely slow. I had to ask the server if we can order drinks because he didn't offer and it was taking forever for him to come back to the table. Also, they brought our pizza 1 hour later because they thought we were still eating our other food. We were waiting for the pizza and thought they had forgotten it since they were taking so long and so we filled up on the appetizers. When they finally brought our main course (the pizza) an hour later we were so full and their excuse was that they were waiting for us to eat the other food before bringing out the main course! We never had a chance to eat our pizza. \n\nThe appetizers were really good though and we enjoyed the free flatbread we got for checking in on yelp! The drinks were absolutely amazing and very refreshing.", "author": "Serena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This place has a very chic and classy atmosphere. The staff is extremely pleasant and the view of the bridges is remarkable! I went during sunset and sat near the windows. \n\nThere are many people walking around in that area (Dumbo Waterfront) so if you're looking for more of an intimate experience I'd recommend sitting inside near the windows. If you're in for a more casual experience I would  definitely recommend sitting outside if the weather permits!", "author": "Marley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "Ambience/decor/location/service: 5/5\nFood/drinks: 2/5\n\nWalked by while out with friends in Dumbo and the pizza and pasta looked so good we decided to get a table. We got sat in the lounge table area near the windows so had access to sunlight and some of the view. The hours listed on Yelp say the restaurant closes after lunch service and reopens but I called and they said they were just continuously open. Not sure if Yelp needs an update or if this was a one time thing. \n\nGot the basil pasta. Very dry, bland with no taste. Even with the added salt and cheese it couldn't come around. Cocktails are $16+ but they're also mediocre. I actually had to send my drink back because it wasn't good-- 2nd time I've ever sent food back, but it was that meh. \n\nGirlfriends I was with say that the Bolognese and the Beef Tartare was good. But everything else... sigh.", "author": "Bomi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "Came here for the view and it was beautiful. Food was okay; I ordered the buffalo mozzarella pizza well done and the cheese was sliding off my slice! Chicken was okay a little oily. Only had one cocktail the hibiscus rhubarb and it was not great too bubbly so I switched to white wine; a very smooth Gavi di gavi. The fried gelato dessert was just as I remembered it  overall I'd rather go to the one in Miami but would return for the view and maybe to try the truffle pizza.", "author": "Desiree M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-16", "description": "Nice. A bit noisy but hey Sat early evening in dumbo!\nThe boozers seemed to like their cocktails and I liked the desserts (come on folks put the desserts on the full menu, I design a meal from the dessert forward!!).\nThe view seems to be a big attraction in this part of town  (as a guy I am the one seated with his back to anything of interest) .\nNot a very extensive menu but thrilled to see healthy type stuff (even a vegan dessert ... yummy chocolate flourless type cake with delish coconut ice 'cream') ... but the minestrone soup had way too many potatoes (potatoes In minestrone? Not enough beans! ) and the tuna tartare with avocado was a flavorful tasty treat.\nLocation and vibe  are this places'  greatest assets ... I prefer a more extensive menu and less atmosphere, that just me.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "The entire experience at this location was phenomenal! I visited NYC and by far the best food and service I had was at Cecconi's. The whole staff was very nice and my server Marko really stood out to me. I highly recommended visiting this restaurant and sitting with my server Marko who had world class service. He was extremely hospitable and the suggestions on what he gave we're all delectable. Marko handled himself very professionally. And for me his care while tending to my table made me feel extremely welcome and comfortable in the restaurant. I went in a little before lunch time and during my visit the restaurant got packed. Marko still attended to me in a personable way and assured everything was to my satisfaction. (I was also a solo diner but the great service made me feel like I was the only one there!) The food also had complex flavor and was presented beautifully as well as the drinks. I sat outside on the patio and the view adds to the ambiance try to do so if it's nice out. Again I HIGHLY recommend visiting this restaurant and if possible sitting in Marko's section. Food entree: Beef tartare", "author": "Tsola O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "This restaurant exudes class. The decor is eclectic and dimly lit, which gives a very cozy intimate feeling. The wait staff is extremely knowledgeable on literally everything, from the food to the vast array of wines and specialty drinks. The food is amazing, and the service is outstanding. Definitely a spot you want to try if you haven't and continue to visit as a regular customer. Definitely a place for a high end date.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Love love this place. Came here after getting married. The food and drinks is so good. Everything was well seasoned. They have a whole roasted cauliflower that is so good. It made me want to be vegan. That is how good the cauliflower was. Looking forward to returning in the warmer months.", "author": "Jen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "The view here was absolutely incredible. While the vibe is a mix of formal and casual (mostly at the bar), its still a very luxurious feeling restaurant and perfect for a nice date if you want to impress! Food is decently portioned and fairly priced for its location and atmosphere.", "author": "Ruby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "Amazing restaurant, view and food! The services was superb and Raul made our visit very enjoyable. If you seat by the window you will have an amazing view of the sunset.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "This is my second time coming to this aesthetically beautiful restaurant. I made a reservation 12/12/18 in advance for my fiancé's birthday. I chose this restaurant for its wonderful view and as such requested a window seat for party of 2. Upon arrival, the hostess informed us there were no window seats for us unless we wait 30 minutes- \nthis was understandable. We opted to be seated sooner if there were no window seats. \n\nIn taking our party towards the dining room, my fiancé and I noticed TWO tables open by the windows. I asked why we weren't being seated there instead, as I'd requested. The hostess responded \"those seats are reserved for the GM's girlfriend\". I informed her I too had made a reservation but I guess that didn't count?  About 10 minutes later, the hostess returns saying \"oh I'm sorry I was joking before\" and quickly scurries away. I never received an apology or any accommodation for this. Later, the happy birthday dessert was given to me instead of my fiancé. Although the waiter did apologize, I'm extremely disappointed in the professionalism and service at this restaurant. I'd clearly seen empty window seats and I had clearly indicated on my reservation it was HIS birthday. The table remained free until the last ten minutes of our own dinner. \n\nI truly hope they train their staff for better, honest service. \n\n\nAs for the food: Very nice portions and plated nicely. Good food overall but not remarkable. Certainly not worth the price between lacking service and just good(not great) food.", "author": "Kayla-Marie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-08", "description": "Stupid, stupid, stupid hostess at the door. We asked the hostess to store an ice cream birthday cake in the freezer and she puts it in the regular refrigerator, suffice to say the birthday dinner is ruined when a melted ice cream cake is brought to your table at the end. What a god damn idiot, we strongly reiterated that this was an ice cream birthday cake and it needed to be in the freezer. The whole point of going was to celebrate a birthday. \n\nThe manger apologized for their mistake and waived the check, which is the only reason for not being lower than 2 stars. If I had to pay for their mistakes than that would've made me furious. \n\nReview of the food:\nCalamari - Average, can't say that it was better than your local pizza store. Small portion and way over priced at $17\nBuffalo pizza -  Good\nBeef tagliatelle pasta - Below average, too much sauce masking the taste of the actual pasta\nBlack truffle agnolotti del plin - Below average, would taste better if the agnolotti skin was thinner, all I tasted was the dough. Also the meat was minced so finely that it was more like paste than biting into actual meat.\n\nWaiter was very nice.\nManger was ok.\nThere were a few hostesses that night, one in particular can't even do something so simple.", "author": "Howard N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Why is this not 5 stars? Perhaps the hostess can work on her comprehension skills and master the art of not having a stink face. We came here early and left our names for the wait list for outside seating. She told us two hours and it will be ready. Fast forward two hours later they try to sit us next to the bathroom in the corner. We tell her no we specifically asked for outdoor seating, so we waited another hour. When I asked the hostess how many people are in front of us on the wait list, she said give her a moment... and then went on to help the ppl behind me and then forgot about me even though I was in front of her. I waited patiently and then asked again and she said we offered you seats but you didn't want them. Jesus Christ, answer my question! Finish with me and then tell the other customers that there's no more space for them. She did this to us twice, same hostess. The others were nice and friendly, but the older one did not, and also didn't seem to be too familiar with the iPad functions. Anyways we got our seat 3.25 hours later. Thank god the kitchen was still open. We sat two tables away from the window with a good view, so much better than the corner table they originally had for us.\n\nThanks to yelp I got a small complimentary pizza, no toppings but pretty good. The avocado chickpea dip with vegetables was interesting. Some of the veggies we couldn't recognize but we still ate it. The calamari was amazing, and the octopus salad was perfect.  You can't go wrong with these seafood appetizers.  \n\nWe ordered a pizza, can't remember which one... but you won't be disappointed. Also got the beef tartar, very salty but definitely a good taste. It's so dark inside you can barely see the food or take good pics. Our waitress did a great job, she was so professional.  \n \nWe were able to change our table to outdoor seating for our desserts. Well worth it, at least we didn't wait 3.25 hours for nothing. We ordered the creme puffs with hazelnut gelato and the tiramisu. The creme puffs are worth it and are very filling. The tiramisu is very sweet but very good. These toe desserts were too much for the three of us. \n\nGood food with good vibes. (Except at the hostess table... unfriendly and less competent than I expected out of such an establishment)", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "Came here for brunch. It's by the water with a classy touch-great ambience. We got the shakshuka minis (was great). The customer service was also amazing and the alcohol. I wasn't a fan of the green vegetarian salad and pizza. It really just looked like a bed of lettuce and the pizza margarita didn't have much on it, very basic.", "author": "Jaclyn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Great food and environment! Great place to come when in Brooklyn. Enjoy eating my gluten free pasta and drinking my wine. Since it was raining we didn't go outside but the view from a amazing!", "author": "Veronica M."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}