{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "5 Stars on the review, 3 Stars on the food. Only worth dining here if you get a comfy cushioned seat outside along the water. The view beside the water toward the Manhattan and Brooklyn bridges are sparkling, stunning, iconic. \n\nHowever, the food: people raved about the honey ricotta toast appetizer, but it was like a cold sugary spread on cold, charred toast. Do not recommend.\n\nThe bolognese pasta was by far the best, but still not standout, while the pesto pasta was rich and good, but not worth the price.\n\nPrices are too high here, and unless you're sitting outside on a picturesque New York day,", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-11", "description": "Came here for Birthday celebration, beautiful space and view!\nFood in general are great, cocktails have lots of options and are interesting.\n\nApps-\nBrussel Sprout - normal where you can get at other nicer restaurant.\nWhipped Ricotta with Honey - I want to love it but way too much honey and made it too sweet.\nCarpegna Prosciutto, Burrata, Gnocco Fritto - kinda an intense dish not sure how to describe....\nVeal Tonatto - it was okay, texture was very full and fatty?\nFried Calamari - it's a good friend calamari\nOctopus - it's a good octopus (ugh food like this you have everywhere I really don't know how to describe!)\nHamachi Crudo - very good, was worry it would be fishy but it's actually fresh and refreshingly seasoned.\nChicories, Kale, - yummy vegetable\nBuffalo Mozzarella Tomato Basil Pizza \nBucatini Amatriciana - normal pasta nothing special on the flavor but love the texture and chewy level of the pasta.\nTruffle Agnolotti - probably best of the night! Creamy but not too creamy with shaved truffle on top!\nLamb Ragu Cavatelli - didn't try , was told it's too gamey.\nBranzino - second best of the night! Smelled so good, the meat was so tender and juicy, perfectly seasoned also.\n\nWould definitely come back maybe during sunset time in summer!", "author": "Emi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "I went to Cecconi's for the first time today - I had the meatballs, which were very good -in a delicious Pomodoro sauce.....I dipped the warm homemade bread in whatever sauce I had leftover.\n...but they truly save the best for last - the profiteroles - pastry shells with a creamy gelato drizzled with dark chocolate...they're incredible.", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Wow! A wonderful evening! Great service by Michael and the manager Alex! Beautiful Brooklyn night ! \nThe restaurant has a nice ambiance ! Nice casual bar seating area to grab and drink and get a few appetizers. \nDrinks and cocktails excellent! \nFood was delicious. We started with the pizza special - white pizza with cheese and asparagus \u0026 pancetta and egg! Crust was light thin with a Smokey char from the oven ! The steak was a really good! Tender and perfectly cooked. The pasta bolognese had a nice rich tomato sauce ! The special banana dessert was a kicked up banana cream pie ! delicious! \nGreat restaurant to do family style. Share the appetizers share the home made pasta ! Share a walk outside to see a great view of the Brooklyn bridge !", "author": "Es T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "After a full year of not being back, I made my way back to the iconic waterfront of Dumbo. Dealing with cobble stone streets in a sports car, parking on an impossibly narrow street, signs of movie shoots warning of impending towing, and the crowd of tourists love locked on our iconic city gave way to a magical experience. \n\nWould Cecconi's live up to expectations? Would their pizza oven be down again? Would it be uncomfortably hot or cold? I am glad to say these are all part of the growing pains this wonderful establishment worked out.\nUpon emailing them, I found out that the earliest reservation on a friday night for two would be 10:15pm. I was instructed that the bar area was first come first serve (a great hint for those of you vying for iconic views and cocktails.) \n\nWe decided to wing it, went on down and were greeted by the host. He was gracious and told us that if we wanted to wait for a table (at around 7:30PM) it would be about an hour to an hour and a half wait. We opted to try our luck at the bar and sure enough found two seats near the door leading outside to the patio. \n\nThe bar tender greeted us warmly and gave us menus, the very low level of lighting made me feel a bit geriatric, whipping out my iphone and lighting up the menu to see what delectable treats were being offered. We started with a cocktail for the wife I believe it was called Between the Bridges and a draft Peroni for myself. upon checking in with Yelp! i was offered a free bufala pizzette which i graciously claimed. their oven burns at a blistering 900 degrees and its evident in the quickness of the pizza and that remarkable char that accompanies every pizza. \n\nWe didn't stop there, Octopus soon followed thereafter, incredibly soft and seasoned perfectly. It was the epitome of what Octopus should be. \nWe shared a Main of truffle shaved pasta, Agnolotti del pin adorned with a shower of black truffle shaved on top. filled with a delicious filling, and earthy from the truffles. this dish was rich, and captivated our senses. \n\nWe yearned for more and soldiered on, Our next course was Tagliatelle beef bolognese. the pasta al dente to the tooth! plenty of bite, my wife stated it was a bit too al dente for her taste. I told her this is the way true pasta should be cooked! the bolognese was amazing, made with small dice of beef versus beef mince. sweet, savory, tangy and yet rich from the beef. this was a perfect bolognese. \n\nWe weren't done. not even close. I then ask the Bartender if our pizza was ready, he goes, he wasn't sure whether or not we wanted it. post haste he put in our order, a few minutes later, steaming hot, we get our pizza, adorned with porchetta, artichoke, olive, mushroom and fontina.... MY LORD this pizza was AMAZING. steaming hot, stringy fontina, tiny little mushrooms, the saltiness of the olives... 2 beers in, I am drinking on one of NYC's iconic waterfronts, enjoying a true italian pizza with great company and a fantastic atmosphere. Life does not get better.... \n\nthat is until the the wife ordered the profiteroles, glanduja gelato, with chocolate sauce. the waiter came over, placed our profiteroles down and then showered them from above in a bath of chocolate sauce. decadent and sweet this was the perfect ending to a perfect evening. \n\nThank you to all the gracious waiters, the countless times our place settings were replaced, no less than 5 times, and the sincerity and warmth of the bar tender last night. I can't wait to make my way back here again, and I promise it won't take me a full year for it to happen either!", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "Classy ambience inside, outdoor seating has beautiful views of the Brooklyn Bridge and Manhattan skyline. I like bringing out of town guests here for the wow-factor of the views at sunset/dusk.\n\nA few things you've got to try here: Whipped ricotta with truffle honey, ahi tuna tartare (made fresh, tableside with mint, avocado and chili!), and any of their expertly crafted cocktails. \n\nI've also recently had their chicory salad which was really great (and seasonal this time of year!)\n\nIn my opinion, the pizzas, pastas, and entrees have all been perfectly fine, but underwhelming compared to what you could get at NYC restaurants that truly specialize in those areas. No huge complaints, but also nothing I've had that's worth raving over (other than what I listed above).", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Such a lovely place.  This is my first time here.  One can see they've figured things out to the T.\n\nThe front of house is quite efficient and methodical.  Servers are attentive, warm and welcoming.  Even the runners greet guests as they bring food/drinks to the table.  Even more impressive was when my son asked where the bathroom was, and a waiter immediately stopped everything they were doing and lead us to the bathroom.  Well done.\n\nThe food here is quite focused and streamlined and from what I can tell is probably seasonal.  It's not overwhelming.  Everything just made sense for a place like this.  The Tagliatelli was delicious, properly portioned and Al Dente'.  Wine selection, like the food menu is very much focused and streamlined.  My dinner mates ordered off the glass menu, while I had 2 bottles of the Hunt Cabernet Sauvignon.  Drinks from the bar are also quite good.  My glass of Gin and Tonic came with artisanal tonic water on the side.  I'm impressed.\n\nThe dining room (s) are expansive but intimate at the same time.  Most tables line the river facing view.  We were lucky to have a seating during the golden hour, it's beautiful.\n\nPrices are in line with the area.  Good for large groups or just a date.  Good for families with kids too.  Not noisy at all.\n\nWill be back to try the rest of the menu.", "author": "Shea H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "Service looks messy and the waiters are running like they are lost. Restaurant had plenty of tables available but need to wait for 25 minutes, what was ok, but then we were placed in a corner table at the end of the restaurant, even if they had plenty of available tables. Very different from the service in other Cecconi restaurants. Hope it improves", "author": "Antonio F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "I came here for brunch with a friend on a Saturday and we enjoyed our food. Service was on point and if you check in on yelp you receive a free pizza appetizer. I ordered a pain ah chocolat aka a chocolate croissant with my entree. I had eggs royal smoked salon and a fresh cold press green juice. Whatever my friend had she enjoyed as well. Definitely a really good menu. I'd come back for happy hour to check out the drinks!", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "We went to Cecconi's last night and it was perfect.  We didn't have reservations so we sat at the bar.  Adel and Kristen were knowledgeable and attentive. Even on a very busy spring Friday night they managed the service, answered questions and had authentic interactions with us throughout the evening.  Excellent service.  And.... The food was as good as we had hoped it would be!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Great vibe, great food and great staff. BRIANA who works at the front was by far my favorite! Answered all my questions and made my guests and I feel very welcomed. She went out of her way to help and we are grateful!", "author": "Jonny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Everything was impeccable from the service, to the drinks, to the food. Prices were high, but you definitely receive a quality experience worthy of the bill.\n\nThey have a custom Negroni menu, which I immediately dug into to try their Negroni Mexicana, a delicious variant with Fresno chili essence and cacao nibs. Highly recommend. \n\nMy dinner mate and I both ordered pastas, the pesto campanelle for me and the tagliatelle bolognese for him. Both were expertly executed and bursting with flavor. The pasta is obviously made in house and had the perfect amount of chew.\n\nThis place definitely gets busy, so I recommend making a reservation and potentially planning on waiting a bit even with a reservation. The social club above sends a lot of clientele down.", "author": "Evan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-23", "description": "drinks are great. very summery and not too sweet. Ordered beef tartar and octopus to go along with the drinks. Food can be a little too salty to my taste. Overall, great environment and the service is amazing!", "author": "Yujie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "One the worts dinner i ever had: kale salad the amout of kale that was served in that bowl i could cover the 4 top table with it and it would look way better than the green area out there and few shavings of parmesan cheese???? I had to order more cheese. Chef order your self a salad and see whats been served and evaluate. Whipped ricotta by far the best item we order thumbs up! Meat balls good ok. Calamari: for the standard of your restaurant the expectation its great, a total disapointment overcooked and fishy either your cooks are not rotating food properly you are not paying attention to your product your sauces need to be ramp up.tuna tartar: if you are doing it tableside make sure the whole show its table side not 4 feet away from your guests it defeats the purpose!, train your servers to do it properly it was totally bland,  not enought acid, no salt, fresno peppers??? No where to be found total disappointment. Braised shortribs chef you have to sit down with your sous chefs and eat this dish: my expectation when ordering a braised ribs is when meat on bone is falling off if boneless super tender when pulling it, the one i got was either microwaved or if reheated in convection oven it was left in there for long time drying it the hell out of it and the ribs was not cooked long enough the meat was like or had the texture of overcooked skirt steak the worst ever. Branzino ok. Cavatellin ok. The icing of the cake was when we asked for the check to server he brought it to the table and enphasized the tip its not included, you must leave it in cash. You should thank your god that you have that cafe at the waterfront and people would do anthing to sit there cause look at your dishes they came back half way eaten. Otherwise you would be kind of running out of business.", "author": "David F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Ok, decor is very nice and elegant attempting to raise this restaurant to an upscale lever because of its location. However, it's basically an Italian restaurant with single serving pizzas and pastas. There is nothing out of the ordinary here.\n\nOther than where you are seated to enjoy the beautiful view of the east river and the two bridges, Brooklyn and Manhattan, it's an overpriced place.\n\nService is average. If they wanted to be upscale, waitress should had introduced herself including name and perhaps, smiling a little.\n\nWe were six in our party, and food was not served all at once. The pizza that my colleague ordered was delayed and therefore, making her wait alone because we were hungry and opted to go ahead and eat.\n\nOverall, you can take a walk around this area of DUMBO, and save some $$$$ by skipping this place.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "I love the location within this small shopping plaza . The view of the Brooklyn bridge is fabulous . \nThe pizza is great as well as the appetizers .", "author": "Hassen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "The atmosphere and the service is the best in Brooklyn. Take a look at the pizza and the pictures it has real truffles.\n\nStrongly recommend!!", "author": "Edward S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Not sure what's going on with the other reviews, but we had an excellent time. We arrived around 7 and waited about 30-45 minutes for a table outside with a beautiful river view - well worth the wait I think.\n\nValue - Seems most of the bad reviews are around value - we paid $110 for two people before tip with two drinks, two mains and an appetizer (plus a second appetizer free, courtesy of Yelp check-in). For the view it was well worth it, especially if you think about the River Cafe nearby where you'd be spending $250+ and forced to wear a blazer (ugh) \n\n-The free pizza through yelp is about half a personal pie. Dough was deliciously fresh!\n\n-Drinks - I got a great \"cobbler\" drink with whiskey, peaches and curry spice that really knocked my socks off. \n\n-Kale salad was delicious and crunchy with bits of apple in it\n\n-Branzino - usually the sauce was some olive/tomato sauce but I asked them to switch it up to the spicy butter sauce and asparagus (the one that usually comes with the salmon). It was a delicious boneless fillet, with a super crunchy skin and beautiful texture. Cooked perfectly!\n\n-Service was A+ and they even knew how to get photos of us with the best lighting. They had more than enough employees handling table reservations and cleanup \n\n-Overall, I also liked how they have a \"less is more\" attitude. They don't bring you a ton of additional sauces and condiments. The food has a great deal of flavor on its own and the portion sizes are perfect. I came out not feeling too full the way I sometimes do with Italian food.", "author": "Hal D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Wow what a mixed bunch of reviews.  So I guess I was one of the lucky ones   \n\nGot a table outside over looking the river and bridge and have to admit it's absolutely breathtaking. \n\nCheck in on yelp and get a free pizza , are you serious ?  If you don't do this you are either mental or too proud. \n\nEverything we ordered was fantastic and staff were extremely attentive. \n\nI highly recommend the pizza ( it's free ) , the octopus it's tentalisng( couldn't resist the play on words ) and the tuna tartare freshly made at your table. \n\nThey forgot the espresso but honestly were so embarrassed they offered one on the house. \n\n\nThis is the ultimate date spot !", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "The view here is amazing! My sister and I were seated at a window that looked out to the Manhattan Bridge. Absolutely beautiful. The food and ambiance were just what we were looking for. Our server Allison was attentive and helpful. Great service, wonderful staff, beautiful food, and amazing view! Go here ASAP!", "author": "Kimberly V."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}