{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Been wanting to try this and I'm so happy I did. I will definitely be back once it gets warmer. I had the free yelp pizza which was yummy. I had a glass of rose as well as the lamb cavatelli. I also split a burrata. The view is to die for as always.", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I live in the area and am kicking myself for waiting this long to get to Cecconi's. Lovely experience from start to finish. Friendly service from their diverse staff. Elegant bar with lots of beautiful people. Very good food (including gluten-free pasta, among plenty of other gluten-free choices). Unparalled views of the Brooklyn Bridge and Manhattan Bridge.  I look at this view pretty much every day, but it never gets old, and it's still special in a restaurant setting -- especially for your out-of-town visitors. What's not to love about Cecconi's?", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Amazing area! People, view and food all looks expensive and fancy! Only thing you need notice that you need wait long time to get your table to eat!Haa", "author": "Yu L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "My favorite restaurant in the city. Im going to keep it it short because no matter how much anyone can write, it will never equate to the amazing that this restaurant brings. If I ever find any place that fulfills be on every level (food/ambience/decor/service/staff) everysingle component for me is a 5 star. I love you Cecconi :,)", "author": "Stefano G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I had a great experience with my wife, nice service, good environment and wonderful view of Manhattan from outdoors tables. The food was just perfect.", "author": "Sun R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "By far, one of the worst services I have experienced. My wife and I arrived for dinner around 10:15 pm. We couldn't be seated further away from any sort of view but the kitchen. Meanwhile, the restaurant was at 25 percent occupancy. Nonetheless, we sat down and ordered a bottle of Pellegrino, two diet cokes, an ahi tuna tartare appetizer, a ricotta honey crostini, calamari and a chopped vegetable salad. After 10 min the waiter Brings the calamari over. Upon the first bite, there was an over powering smell of bacon or ham. I called over the waiter and asked him to smell the calamari. He looked at me like I had 10 heads. He said that they don't have ham and the only thing that could give the calamari that smell is the veal that they fry in the same oil. (Note to pescetarians) He took back the calamari and soon after brought us our ahi tuna which was sub par at best. Then, our plates were taken away and we waited for our other 2 orders. They never came. All we saw were waiters zooming by with other orders. This was going on for like 20 min till we both got agitated and finally we spotted and called over our waiter. He came over and we asked where is our food? He looked like a deer in headlights. And! Tried to convince us both that we did not order another two dishes. Being that it was past 11, my wife and I were both tired and did not want to deal with incompetence and false accusations. We asked for our check and the waiter brought it back to us and had the audacity to tell me he had removed the calamari from the bill! Ummmm hello? I sent it back and didn't even eat it! Thank you for the favor. I'm no novice to food or restaurants and I have plenty of friends and family who work in the industry. It's an absolute travesty that this place has a beautiful ambiance, view, and decor and is run this way. I wouldn't recommend this spot to anyone. Train your staff and perhaps take notes from a real restaurant group like the Hillstone group.", "author": "James G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "WORST DINING EXPERIENCE OF MY LIFE. Would give 0 stars if I could. I came here for my mother's birthday. Waited for 2 hours for food that NEVER arrived. We had to get the food in a doggy bag to go -- and they gave us THE WRONG FOOD, including dishes that we explicitly stated we were allergic to to both the manager and the waitress. We repeatedly called, for days, to complain and tell them that the food was incorrect but no one picked up the phone. We sent emails to the manager complain and no one ever responded. Avoid going to this restaurant at all costs. They do not care about their customers and their service is abhorrent. Do not give them a cent of your money.", "author": "Jana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Waited over an hour to be seated despite the fact that I'd made reservations beforehand through Open Table. \n\nHad 5 different servers come to our table; we constantly had to hail someone down that came our way to get any service. What's interesting is that the restaurant by that point wasn't too busy, but the staff chose to be inattentive to their guests. Even the table next to us said that they were experiencing this with their service.\n\nEven after getting their attention and placing our orders, they still managed to get a few things wrong. They never came back to refill our waters, we had to ask twice about when the drinks we initially order would arrive, and had to ask several times for plates as my friend and I were sharing our entrees. \n\nWorst of all, the staff didn't seem apologetic or realize that their service was completely subpar. If your guests are going to pay $$$, at least get your act together. \n\nAvoid this place like the plague.", "author": "Johanna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "By far my favorite place to eat in brooklyn. This has probably been my third time eating here and it has yet to disappoint. Everything is always amazing here. The service, the view, the ambiance, the food. It's a must if you're ever in the area!", "author": "Cathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place have unfairly rated 3 stars!!!! I been in 4 rated by yelp  on Emmons ave on the water, \u0026 its day \u0026 night! The place is spectacular inside \u0026 outside, it had roaring 20s vibe, bartender was super attentive \u0026 helpful on making choices from the cocktail menu. On a beautiful july night we wanted sit outside \u0026 had no problem to wait for the table- its what the drinks \u0026 good company for.  I red reviews \u0026 even people complaining about service- loved the food, \u0026 me \u0026 my husband is foodies- so food meet \u0026 exceed our expectations! We shared 5 appetizers: grilled octopus, beef  carpaccio, calamari \u0026 beef tartar, shishito peppers- everything was excellent /presentation \u0026 taste, dinner had excellent choices \u0026 we try each other dishes \u0026 every one of them was great- branzino, lobster pasta, salmon, steak, short rib \u0026 agnolotti- was favorite on my taste. Service was attentive, polite, knowledgeable! I really dont see what other complaints about ( if restaurant had problems with the stuff \u0026 they took care of it )- its even extra start to the management, or may be that was unfair reviews. So I encourage to go there for romantic dinner with a great view ( many places with a view luck on food/ not this one) \u0026 leave  your honest reviews. p.s- this review is not solicited or paid, i am going write bad one to that restaurant on emmons ave....", "author": "Evgeniya B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "Service was terrible. Hostess and servers were snooty, wouldn't let anyone sit outside even though there were tons of tables open, and didn't refill water/drinks, even when asked. Everyone's meals came out at different times. The food was also not very good. I got eggs Benedict, it really had no flavor. The people I was with got a pizza and the eggplant. Also, no real flavor. Not worth it.", "author": "Jill M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "The hostess was the worst. Slow, bad service, bad food. Their highlight is the Brooklyn Bridge view and she gave us the worst table in the back when it was empty. \n\nPretentious, bad space distribution, the tables are forgotten. You can be seated in front of a wall. The food bad and mediocre, not tasty, the pizzas are horrible. A bad neighborhood restaurant.", "author": "Samuel M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "The view and the atmosphere is worth going for. The vibe is laid back, almost making you feel like you're on vacation. \nGreat drink menu! So many interesting and delicious combinations. \nThe food.. was ok. The fried calamari was very salty, pizza was pretty good, but nothing special.\nI'd go back for drinks but that's about it.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "I'm glad I didn't read any of the reviews before we went here.  My husband and I went on a Sunday afternoon and the menu was for brunch.  \nWe had burrata with cherry tomatoes which was delicious.  Then we had a pizza with artichokes, porchetta and fontina cheese that was fabulous.  \nI definitely would like to try their dinner menu, hope go go back soon.", "author": "Gail S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "Not a pleasant experience. The bar manager seems to be exceptionally pompous and the cocktail menu is nothing special. Do you train your staff before they have to stand behind the bar and make drinks? The restaurant is a revolving door, so that says a lot. No thanks!", "author": "Alessia E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "The upscale space with low class service is not a match made in heaven! Sure we came in with no reservation, but when we are ready to drop over $600 the restaurant should pay a little attention to us! Survive at the bar was lackluster with multiple mistakes that is not in accordance to this place! Lack of consistency and posh attitude are not a good combination!", "author": "Byron R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Horrendous!! I called to make a reservation and was never able to get anyone on the phone.  I left a message and no one ever called back. Since it's Father's Day we were prepared to wait and walk around so I didn't follow up anymore with the reservation.  The wait was 1 hour and I was told I couldn't sit outside since I didn't have a reservation.  After and hour I approached the desk and was ignored by a manager on an Ipad until another woman came over. I asked for a round table with the high back chairs and was told those were for reservations only as well.  I suggested that if reservations were so important that they should return calls of people trying to make one! 20 minutes later all we had was water and I had to ask someone to take our order. We ordered drinks, a pizza, 2 apps and 3 entrees.   Drinks came and one was dropped on the floor right next to me splashing all over me.  The manager was standing there...not an apology was made. While I was in the bathroom the pizza came without the apps. About 20\nMinutes later a waiter came over and asked if we had ordered two other apps and we said yes. 10\nMinutes later our entrees arrived and I told them we would like our apps first so he took the food away. Another waiter returned minutes later with the same entrees telling us it was our fault bc he asked if we had our apps?!?!  He did NOT ask that and I am pretty sure He should know if we had apps or not, why would he be asking us??  Also, if you bring my entree before my appetizer you should apologize to ME!!!! I then began looking for a manager!!   It's  clear to see why the place is a disaster! Manager stood there, uttered an apology and offered no help or solution.  We refused to leave without paying for the pizza and drinks and left money on the table. Good thing my husband is such a good sport bc this would have ruined most people's day!!!!  The one star I gave is simply because Yelp won't let you write a review with the ZERO stars this place deserves. \nHighlight...the bathrooms are clean!!", "author": "Maria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Great environment and ambiance! Amazing for a date lunch/dinner with your SO. Really nice view if you seat outside. Service was great as well! Highly recommend this place", "author": "Cristian E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Amazing experience. We seated in a table by the window. Beautiful view and nice staff. We ordered a pizza and a pasta and both were delicious. It's not a cheap place but it's not very expensive as well. The decor and the bar are very well designed and give a cozy feeling. I want to come backs agin soon!", "author": "Fernanda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "I spent the early afternoon at my dear friends baby shower in the private room. We had a beautiful view with velvet curtains that kept us cozy overlooking the East River. Nate was the most accommodating, friendly, attentive and down to earth person. He was so sweet with my 4yr old son and gave everyone else the same attention. The food was delicious and flavorful! Thanks for making my friend's day so lovely for all of us!", "author": "Jennifer F."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}