{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "I decided to divide what I would rate the service (1 star) with what I would rate the food (5 stars) and find a middle. Our reservation was at 5:10. We weren't given our table until 5:40. When we sat down half the restaurant was empty so why we had to wait for 30 minutes was probably a mismanagement on the hostess' part. \n\nThen we ordered a bottle of rose. But we were only given a glass. We had to remind the waiter it was a bottle. \n\nThe food was excellent. My daughter took one look at my beef Bolognese and made me switch with her. However her spaghetti was just as good. \n\nIf you check in on yelp you get a free pizzete and it's so tasty! \n\nWe finished eating by 6:50.\n \nHowever we didn't leave until 8:10! The waiter was no where to be found we had to hunt him down ask to pay and then wait more to pay. Once we did pay we had divided our bill between our party evenly yet they charge my cousin the complete amount while the rest of us 1/4. So we had to wait even longer for them to refund her and charge her the right amount. Great food bad service.", "author": "Kayla T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "Excellent food at a very nice restaurant. We were able to sit outside on the patio on a beautiful day. Service and food were both excellent.", "author": "Jim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-10", "description": "Came here on a Sunday at 10pm. I ordered the spaghetti with lobster, and brussel sprouts on the side. This was my first time at the Dumbo location, the view of the Brooklyn bridge was amazing and the vibe was calm. The spaghetti was 6/10, the noodles were a little under boiled and it was kinda salty. Brussel sprouts 9/10, really good they were like creamed or something. A+ I enjoyed it a lot. My friend got the pesto pasta and said it was a little salty but still good. Dessert 7/10 chocolate hazelnut gelato. Our server Antonio N was great he made sure we were good the whole night. One thing that didn't sit well with me was after the check was paid at 11:42pm, my friend and I was finishing up our drinks and a different server came up to us and said they are closing and we should hurry up. He was politely kicking us out but I feel like it was unnecessary being that our bill was paid and last call was 10mins prior. Obviously we are leaving when we finish our drinks, it's not like we can order anything else and it's not like we are going to stay here when the drinks are done. Have some patience, that was very rude and embarrassing. Other than that my experience here was nice.", "author": "Drizzy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-24", "description": "Tourist trap to the max...an expensive one at that. The food was fine and decent, and the service followed suit. But..if you're not sitting outside on the water, there's not much to this place. They have a pretty good happy hour, and my entire table was satisfied with their dishes. My only complaint was the prices are a bit steep for some of the more simpler pasta dishes. Also, the bathroom was a mess, with nothing to dry your hands with but tissue from a box. (Just saying, if you're gonna charge the prices of a fancy restaurant, be fancy...including your bathrooms).", "author": "Lexi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "We had a reservation for 7:45 pm on a Sunday night but showed up around 6:30 asking if we could be seated not only earlier but also outside. The host and hostess said sure and seated us almost immediately at one of the best patio tables where we had an amazing view of the Manhattan bridge. I had the black truffle pasta and my boyfriend had the lamb ragu pasta and we both shared the calamari. The black truffle is probably the best pasta I've ever had, considering I love truffles. And my boyfriend enjoyed his pasta too. The menu was not as expensive as expected, $29 and $24 respectively, but also the serving size was not as big as we expected.  However, I'm not sure if the serving size was small or I just really wished I had more because it was that good! We then shared a tiramisu, which was a big enough for both of us. Our check came out to be about $120 for an appetizer, two entrees, a dessert, and 3 beers before tip. I can't wait to come here again!", "author": "Jeanette N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "We went to a play close to the restaurant; the play organizers recommended to grab a drink from Cecconi's if you arrive they early... we did it afterwards and it was a great recommendation. Our water was great, he even shared that he preferred serving on Sunday's since it's not as crowded and could really take care of his tables and customers.\n\nThe wine recommendations were excellent and each plate was exactly as described. Extremely delicious! I have to say that portions for appetizers are little but if you are actually having a 3-course dinner you will have the perfect treat. \nDon't order the pizzas, go for their pastas and tartares. \n\nWe have a great surprise with their meringata dessert and coffees. \n\nPrices are reasonable based on the location and we were seating outside facing the river, so that made it extra!  Definitely recommending and coming back.", "author": "Nydia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Food is great and Raul is the best so nice and attentive! Told us about all his favorites which were so good! \nTry the spicy margarita and kale salad!\nIG- sarahannetravis", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "First time here and I understand why there's always a wait.  Food is really good and service is great.  I enjoyed the lemon ricotta pancakes, quiche with spinach and a pizza.  How could you not order a pizza at this place?\n\nOn a nice day sitting outside is great but inside isn't too bad also.  I sat at the bar and really enjoyed my brunch.", "author": "Sean D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "I went to Cecconi's on Jan. 1st to ring in the new year with a nice meal and this place did not disappoint. \n\nWhile I went there for the ricotta hotcakes, I made my reservation during the shift from brunch to dinner ( my mistake), and they were not on the dinner menu! :( However I got the meatballs to start which were so bomb! Cooked in the tomato sauce which was filled with basil and garlic, every bite was orgasmic. For the main menu, I had the short ribs with polenta and it was juicy and moist. The meat practically fell off the bone. The sauce that it came in was savory which was a good mixture with the polenta and meat from the short rib. \n\nI also had the eggplant parmesan- there was bit of a confusion as the first waiter put in my order from the brunch menu when it was suppose to be from the dinner menu. That being said, they compt my eggplant Parm so I am having that for lunch today. The few bites I had of it were delicious. The eggplant melted well with the cheese and sauce. The sauce was reminiscent of the meatball one. \n\nI sat near the window on the leather couch area they have looking out to the Manhattan bridge thinking about the new year and reflecting on personal goals and achievements. \n\nThis will def be a regular spot for me in 2019!\n\nCheers!\nLaMonday", "author": "LaMonday V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This restaurant is one of DUMBO's best kept secrets! \n\nFor one, the view of the Bridge is soooo beautiful. There is outdoor seating that allows you to eat and overlook the beautiful view. \n\nThe staff were very attentive and professional. Dressed in white tuxedos/ suites beautiful chandelier. \n\nMost importantly they have authentic Italian food. The brick-oven truffle pizza was to die for. The risotto was so fresh.... The pasta tasted amazing! \n\nOverall, definitely come here for a special occasion. The food, ambiance, and staff are sure to please!", "author": "Jesica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "THE AMBIENCE. THE VIEWS.\nI frequent this place alone for the service and the views. Whenever it's warm, please always get seating outside along the water with the bridge right over you.\nThey really put it a lot of effort to provide you the best service ever! So let's get into the food...\nThe best appetizers I've had is the calamari, ricotta with the truffle honey (the BEST) \u0026 the tuna tartare. I love the tuna tartare with the avocado and mint.\nNow for the food, I would definitely stay with the pastas and pizzas. Outside of that, it can be a hit or miss. The short rib is a miss. Not flavorful and the red wine is overpowering. With that being said, I really loved the branzino \u0026 the beef ragu pappardelle. I think the pasta was the best dish out of all the ones we ordered.\nThe tiramisu is a MUST here. Actually, I think all the Italian desserts are great here.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "Nice place with good drinks. My husband and I went to dumbo at Saturday afternoon. It was crowded everywhere. But glad we chose Cecconi's to have a drink and rest. The cocktails are so delicious.", "author": "Yueming Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-06", "description": "They constantly loose reservations, made us wait 50 minutes looking at four tables for a party of two that were empty for those 50 minutes instead of having us have lunch on that table. The bathrooms wouldn't have any toilet paper or hand towels and the check we got at the end of our visit had a third pizza on there which we did not have. Inexperienced and unfriendly staff should not work at a restaurant like Ceccconi's.", "author": "Philipp P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Last Saturday it was pouring. I was held hostage by Kwik Park (see my review of this evil parking garage) and was faced with 6 hours to kill during a bike event in DUMBO, so I ended up at Cecconi's. I am so glad I did. I sat at the bar right in front of the pizza oven to warm up. I nearly cried; it was so cozy. When I regained my composure, I noticed the decor was gorgeous. I especially loved the white brick, the marble bar and the exposed beams laden with crystal chandeliers. I now want to redecorate my home to match. The bartender was attentive, professional and wonderful. He called me \"my lady.\" (sigh) I ordered a glass of the sparkling rose to warm up even more because, the idea of being trapped in the rain and day drinking seemed like a good pairing and boy, was I right. The rose arrived in a heavy traditional style etched crystal glass. I felt like a princess in a drowned rat sort of way... and I was treated like one despite my now untamed frizz. I was comfortable and serene... and starving. I decided on pizza: bresaola, burrata, wild mushroom, parmigiano for $26. It was the most amazing pizza I've ever eaten. I watched them make it right in front of me from the raw flour and fresh ingredients and saw it popped inside the open oven, the luscious doughy bubbles forming before my eyes. I savored every bite. This place made being unexpectedly trapped in the rain a delight. I can't wait to go back!", "author": "Mitzi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-11", "description": "I don't write Yelp reviews, don't enjoy writing this one. Cecconi's sent me a reminder to be on-time for my reservation, they then said that they weren't able to seat me for upwards of 45 minutes after. Left at that point. Sorry, just can't do that to people.", "author": "Eamon L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-10", "description": "Horrible! Ordered octopus appetizer and it was greasy and charred to a crisp. Very gross!", "author": "Samy Jo L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Well I read the reviews but here is mine\nHopefully you will find it useful\n5 stars. The food is delicious - pizza,tiramisu,the short ribs,chocolate ice cream\n5 stars ambience and the river view\n3 stars the employees while friendly took a while to respond\n1 star. The check took quite a bit to obtain\n5 stars for the restrooms \n\nThis place can be better but like an NFL team who has plenty of talented players yet there record is 3-15 and so is this restaurant.\n\nThere is something about this restaurant that is not clicking \nStill their food is delicious.", "author": "Javier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "I went on a date here last night and was a little late for my reservation. I was greeted by the hostess Frankie. She was a doll and made sure we were seated right away! Our server Allison P. was super attentive to our needs and made the night special! The Calamari was fantastic! I will definitely be returning here soon!!!", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-26", "description": "Gorgeous. 5 stars for decor, ambiance and view.\nSuper trendy and chic. \nRating 3 stars as I was a little bit disappointed as food was just OKAY. Expected more from a Soho House property in terms of food and service. Anticipate waiting time even with a reservation. Worth grabbing a table by the patios/window.", "author": "MK K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Beautiful views, good vibes and great service really makes this international chain restaurant worth a visit. The area itself is amazing and getting a table outside is probably the go to move but we sat inside and we loved it as well (it was a bit chilly). Side note - if it is chilly and you sit outside they give you cool blankets to throw over yourself to keep warm. \n\nThe place has some interesting cocktail creations. I could say the prices are all $15 for any cocktail BUT it's well worth it. You just got to love a place that knows how to master a cocktail especially for what you pay. We went with the soho mules and ended up getting another round!\n\nNow let's get into the food. The pizza was delicious we had the original buffalo mozzarella pizza (got it complimentary from our yelp check in- thank you), whipped ricotta truffle honey crostini (nice and light appetizer to start with) as well as the burrata and cherry tomato appetizer. \n\nAs an entree we shared the bolognese pasta and it was delicious, really can't go wrong! We really wanted to try the tiramisu everyone was raving about but we were stuffed so it's definitely a good reason to come back! ;)", "author": "Alex B."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}