{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "I wanted this place to be good because we live right around the corner. Have been three times now with each visit more horrible than the one before. \n\nLast night, we sat at the bar hoping to have a couple drinks and grab a pizza and sat there for literally 15 minutes, not a single bartender greeted us, nobody dropped a menu, and we had to walk out with nothing. \n\nLast time we went in, we waited, I'm not kidding because we had an appointment that we were late for because of this, 20 minutes for a check. I flagged down managers TWICE begging for the check and still waited another ten minutes before anybody came to drop it. \n\nThis place is a nightmare. It's in a gorgeous location with great views, but there are other options and the food isn't good enough to justify putting up with how bad the service is. STAY AWAY.", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I went there last night with a bunch  of friends. The entire wait staff was amazing. I would like to give Maria a special shout out... she was on point everyone at the table felt so special and well taken cared of... the food is always amazing\nMy favorite appetizer is the ricotta and honey it's so yummy.  My salad was delicious and my salmon cooked to perfection ...", "author": "Michaella W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "Probably one of the worst meatballs I've ever had. Salty and herby. The herb and salt flavors so overpowered it was hard to tell if there was any meat. They were the size of small cocktail meatballs and the price of filet mignon. \nNo doubt a great location ! Service indifferent. If you want to spend a bunch of money to see and be seen ... go there. If you're looking for good food and service... pass", "author": "Mike P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-14", "description": "you'll have a better experience going to the Olive Garden in Times Square. Severely disappointing experience given the good brand behind this restaurant. Hostess - Meghan- needs to be fired immediately. After playing 20 questions with her questioning my reservation, she demanded that I Point to my party of 4, when I pointed to my parents, she said \"nice try\". !!!!!!!! Did she apologize? Not to me, to my boyfriend. Because, you know, why apologize to a woman, the man is obviously the one that counts", "author": "Eugenia N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-04", "description": "As someone who has worked in both the fields of luxury goods \u0026 services and hospitality I would rate my experience as Cecconi's as poor. \n\nI had previously dined here for brunch and has a pleasant experience, however, dinner was a different story.  The maitre'd was not transparent about the timing of our table and we ended up waiting over an hour for a reservation I made three weeks in advance (the first moment the time slot became available).  The remainder of the host staff kept hiding in the coat closet to avoid questions.\n\nOnce we were finally sat, we had to order all rounds of food (appetizers, main courses, sides, etc) at one time because \"they were running behind\". Because we were sat so late after our reservation the specials were already all sold out.  \n\nWhen we were paying the bill the waiter was hovering over our back the entire time we were signing . We felt extremely rushed.\n\nThe women's restroom  was not very clean (toilet paper all over the ground, toilet paper rolls not  in their stations, etc.).\n\nThe ambiance of the restaurant is very nice and the food was tasty, however this was all canceled out by the other displeasing factors.  The manager spoke to us at the end of our meal and was very friendly; hopefully future diners do not have these issues.", "author": "Emily N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "One of the worst culinary experiences I've ever had. I've never been so underwhelmed. Decor and service is the only reason they deserve a star (just kidding he forgot one of our dishes). Where do i begin? The eggplant parm which was served burned or the ravioli which had zero flavor. Please spare yourselves on the tuna. I had such high hopes but this was terrible. If you are looking to actually enjoy dinner, skip Cecconi and go to sugarcane next door (not an add but word of advise)", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "I went here for brunch with some friends. The buffalo pizza was delish (would come back just for the pizza). and the drinks were nice. The ricotta hot cakes and hash browns were really good. I enjoyed my eggs Benedict and the deserts we had was delish even the vegan chocolate cake. Request outdoor seating for a nice view of the brooklyn bridge and water. The bathroom was clean. The service was very good and they were understanding about one of our parties running late and did not give away our table. Would come back again.", "author": "Nicoda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "It's a great date place with a great bar. My husband and I checked in at the 1 hotel, upon arrival we asked the concierge to make a reservation at cecconis (a friend had suggested). Our concierge said it was fully booked, impossible. So we took a chance and went anyway, with no rsvp. The host suggested we go to the bar and be added to the waitlist. We really enjoyed outlrselves, the bar tender was really nice, he kindly gave us a wine tasting, and even gave me a on the house glass of wine. The hostess briefly came for\nUs to let us know oyr table\nWas ready. We ordered the steak tartare, the pene a la rabiata, and the linguni with octopus. Everything was delicious, the setting was very cool, lovley view, and incredible date spot. I highly recommend it.", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-04", "description": "Just went here for dinner this evening and felt I needed to write this review immediately. \n\nI wanna start with the fact that the food we got was delicious, but this place is a tourist trap much akin to those found in Europe. \n\nWhen we first walked in they did have a table ready, but the hostess actually told me that they needed us out by 730pm. It was 611pm when we got there. I have never had a restaurant tell me when I needed to leave their restaurant by. Usually once seated they will have to find a different situation for any people coming later or reservations. \n\nThe service was very slow and there was constantly ppl clearing off the tables around us. The waitress asked if we wanted water and I said tap water, she brought a bottle which I figured was free, little did I know they charge you for water. Such a joke a bottle of water is $9.\n\nWe ordered our food, and two cokes. We got 1 coke and then the food came. Then I got my coke. Also nowhere on their menu is the price of non alcoholic beverages, which I now get why. They have the oddasity to charge $5 for a small barely full glass of coke. Rip off! I didn't know the price and so ordered two. Big mistake I spendt $20 on 4 small sodas. What a joke. The only thing I can say is their chicken and short ribs main courses we're good as we're the mashed and roasted potatoes. I didn't want to leave a tip, but did. This place rips you off from the water to the soda and the service is terrible.\n\nWill not go back as it's too insane to spend that much money just on beverages non alcoholic ones. \n\nFood is good and nice ambiance just don't expect it to be cheap or fair prices. Tourists ugh", "author": "Caroliine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "I am amazed at the low reviews. I'm guessing it's largely due to price (expensive) and long wait times (even with a reservation). But the food is great.  Particularly the pizza and pastas. Pasta specials often rival top Italy quality. And the decor and vibe is excellent. Great date spot if you have time and are willing to shell out some money. Alternatively, great for a quick pizza at the bar.", "author": "Omar H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Wait was extremely long which was expected on a beautiful Sunday afternoon. The service is why I knocked a star off. It took an hour and a half to get our food, which gave us time to enjoy the atmosphere and weather outside but after waiting 2 hours (yes, totally our choice) for a table we were pretty hungry. Luckily, we had ordered appetizers to hold us over. Waiters were not overly attentive, water went unfilled and I was never asked if I wanted another drink. They were super quick to refold our napkins whenever we went to the restroom though. Pizza was so so and my entree, the cavatelli with lamb ragu was excellent. All in all, an overall good experience but did expect better service considering the expense.", "author": "Marissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Came to have lunch with my Wife and our friend. My friend works around the area and took us to this place. The walk to get here is beautiful, it's right by the Brooklyn bridge on the pier and they have outside seating. Unfortunately we did not get to sit outside but we still got a little view of the water. The food is pricey, but we came on a Monday and my friend explained everything on the menu was 50%off which I thought was really good. Service was excellent and the food was amazing. We each got different dishes plus apps to share. We ordered calamari and pizza for apps. The calamari was good, nothing interesting. The wood oven pizza was really good, the sauce had tons of flavor. My friend got short rib with mash potatoes, my wife got spaghetti with lobster, and I got branzino with spinach. Everyone was satisfied with their dish including myself. I would definitely come back here again but hopefully I can enjoy the outside setting.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Terrible service, even with a a reservation, the waiter ignores us. Servers are very rude here and it's always very busy. Plus the food is just okay.", "author": "Chenyu L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-24", "description": "It looks and smell great but I never got to try. Bar tenders slow and made a number mistakes with drinks order. We were told 30 minute wait for a table but hour and half later still nothing after being told three times we were next being seated. Meanwhile, easily 10 tables sat unused. We did not seem to be the  only ones unhappy with the service. Finally we just left, after paying a hefty drink bill. Super disappointing.", "author": "Riel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "This place is pretentious for no reason. Lots of cute restaurants in Dumbo, choose something else. \n\nMy husband, my friend Sarah and I decided to go for a late lunch around 2:40 on Labor Day. They said it would be a 45 min wait, which I'm fine with if the restaurant is truly busy. We waited at the bar and from the area I could see (about half the restaurant) there were 3-5 open tables at all times. They were in no hurry to seat people, and it felt like they just wanted to make people wait. Even though we asked about the open spots, we were told we'd still have to wait our 45 min. \n\nOnce seated, service was slow and it took asking multiple waiters for water and finally the bill. Because everything took so long, we were running late for our train. Me and my friend were only half way done with our meal, but we asked for to go boxes. They took our dishes to box them up and never came back. We finally got up to leave and tracked down our waiter. He said he was sorry but they gave our food to another customers by mistake!!! If we had 15 more min they'd make us something else... we declined because we were already late and very frustrated at that point. \n\nBottom line... lots of restaurants with good food, don't waste your time or money. Very disappointing.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Poor experience from start to finish. We arrived at this restaurant at around 2:30 PM on Labor Day. This is one of those places that quotes a waiting time simply because they what to create an illusion of exclusivity. We were told our table for 3 would be a 45 minute wait. We chose to grab drinks at the bar and stand while waiting. At any one time, we could observe 3-5 open tables. \n\nThe staff was either ill-equipped or unwilling to reseat customers in a timely manner. On average, from the time it took guests to leave to have new guests sit down was 20-25 minutes (again with open tables so it was not overly busy). \n\nTo be fair the beer and rosé ordered were good. The pizza was slightly above average. The staff was inattentive throughout. To obtain water and to go boxes, we were forced to reach out to other waiters in the area for help. Finally, when asked for 2 to go boxes, our food was actually given to another customer. The restaurant offered new dishes in 10-15 minutes, but due to the long wait time, serving time, and travel plans, we declined. \n\nOverall the entire restaurant staff has chosen to prioritize reputation over service and has failed at both. I would not recommend.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "Obviously the location of this restaurant is amazing, along with the beautiful decor, it creates a wonderful ambience for a dining experience.  \n\nUnfortunately, the food and service do not measure up.  The menu has nice choices but portions are minuscule and flavor could be amped up a little.  \n\nThe service is really where this establishment disappoints.  We had a reservation and still waited 40 minutes to be seated.  It was a struggle for everything.  We had to ask multiple times for menus, water, and even our meals.  All at the table were served except one person who waited 30 minutes longer than everyone else.  She had to eat alone after everyone else was done.  We didn't make a fuss but the manager sensed our dismay and offered her dish gratis, which we thanked him for.  However, when the bill came it was on there.  We paid and we left..  \n\nThis place seems to be too big and too trendy for its own good.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "Was taken here by friends, so I didn't see the bill, but my impression is that Cecocni's is very proud of their restaurant. It was relatively kid friendly and comfortable. We we didn't get an outside seating but it was a hot day in summer and we had the banquette nearest the window so could see a bit of the water.  Food was probably a little better than average, but for Italian in Brooklyn, it disappointing.  I would guess it goes over well with tourists who think they're seeing \"real\" Brooklyn and fancy people who live in the buildings that have pretty much closed out former locals.", "author": "SK V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "Pasta is my weakness. I eat it at least once a week and have my go to's all across NYC - from the mom \u0026 pop spots in South Brooklyn to high end venues in Manhattan. Having heard about Cecconi's from friends, and walking by on our way to Sugarcane last week, we decided to give it a try.\n\nThe beef tartare was OK at best, all the pastas (we had the cavatelli \u0026 lobster spaghetti) were served with a boring red sauce that was extremely bland. The truffle polenta was inedible. Honestly it felt like every dish lacked flavor and needed additional salt \u0026 pepper, and I'm not big on salt at all.\n\nLastly, the chairs in the dining room are extremely uncomfortable.. It's unbearable to sit in them and they're very uninviting. The service was OK.\n\nOverall this place is one big \"meh\".", "author": "Dmitriy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "By far one of my favorite places to visit in Brooklyn. From the amazing steak tartare to the wonderful entres everything is greatly executed and very well prepared.  I can't get enough of this place. I have been to the Cecconi's around the world but this one is definitely my favorite. The views you see are also phenomenal", "author": "Anthony K."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}