{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Very small portions and had to ask for water about constantly , over priced , wouldn't go back  or suggest place", "author": "Pina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "Doesn't look like I would want to experience it for the 4th time. We came to celebrate my birthday And I mentioned to girl that's the day that I've been trying and would be very nice and important to me if she can accommodate only for two of us me and my husband being busy with work and kids don't have many chances to come by. U trying to convince me in something that didn't change from 1st to 3rd visit. I was checking on you guys before you opened a few times so I was so happy to see you open and that's what I had to experience. I kept trying and??? Poor customer service. Didn't get a chance to check anything else , guess why, couldn't get in.", "author": "B G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "This place is a great in general, but the other day,  I ordered a mushroom/zucchini blossom/goat cheese pizza.  After a few bites, I asked if it was exclusively goat cheese and was told that it has mozzarella.  I pointed out that it is not in the menu and the waitress said, \"yes. it's not in the menu, but it has mozzarella\".  The goat cheese was only sprinkled.  I am allergic the cow's milk and fortunately only had a few bites.  Otherwise, I would have been in the ER with an asthma attack.  The staff(waitress and manager) responded promptly and showed concern, but the menu needs editing to say the least.", "author": "Paul S. R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Ambience was perfect! Our drinks were amazing (I was super impressed). We waited about an hour since we didn't have a reservation (I would suggest making one) but hanging by the bar was a great time as well! (Shout out to the bartender who just moved from Baltimore who entertained us and a 4 yr old ) The Appetizers are YUMMY, staff- friendly and did I mention they sat Justin Bieber and Steven Baldwin right next to us?! If you're looking to stay local and have a NICE dinner with drinks (for any occasion) I'd def recommend.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "My friend recently celebrated her birthday here. Out of the party of 5 no one enjoyed their dish.  I expected more from this franchise as most reviews are 4-5 star ratings. \n\nI ordered the Chicken which was $27 along with a glass of red wine. My colleagues order the Salmon, and some type of Pasta. Being that this chicken was $27 I expected some good seasoning. When I bit into that chicken it was the most unsatisfied I'd ever been over half a chicken. There are restaurants inside Chelsea market that have baked and seasoned a chicken way better. What a waste of money. \n\nOne of my colleagues asked me what was the best part of the meal. I said the \"still\" water which was $9 a bottle of which you can get for $4 elsewhere. :-) \n\nThis place was a joke. The service was actually spot on. But I did have to look for my server a couple of times. \n\nYou're paying for the ambience, the view and good times with friends. Besides that, take your money somewhere else. I felt so bad for my friend because she even complained about the Salmon. We paid for our dishes and left for ice cream. \n\nSECRET- There's a rooftop that many don't know about near the elevator. Check it out.", "author": "Javaris S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "Worst dining experience I've had in New York for over 2 years. Every point where something could go wrong, it basically did. \n\n1. During reservation, they mentioned that a set menu was available at $55 per person. But failed to mention that as a party of 9 we would be actually required to order off the set menu which didn't include any pizzas. Had to \"discuss\" with the management for 40 mins before a compromise was made and we were \"allowed\" to order a couple of pizzas in addition to the set menus. \n\n2. The food was brought out in a strange order. Pizzas came before appetizers. Then one salmon was brought out first (and the waiter actually smacked my colleague in the head with the edge of the plate whilst setting it down - didn't seem too bothered or apologetic about it), and the rest of the food came 7-10 minutes later. \n\n3. The whole dining experience took almost 3.5 hours! One of our group had to actually leave before the mains arrived because no one estimated it would take this long. And the servers would not even bring her meal in a takeout box in time. Every time we asked them multiple times they said the food is almost ready. Perhaps if they were packed it might have been more understandable, but they were more than half empty the entire time. \n\n4. The food was only decent. Nothing special. I will say that the drinks were great though. But not good enough to redeem all the other problems. \n\n5. They tried to charge us for each entree from the set menu separately. This lead to the bill being almost 200% higher than it should have been. \n\nAnd these were only SOME of the issues. \n\nBy the end of it we were so tired with everything in there that we just wanted to leave. The manager didn't even bother coming over to check on us the entire 3.5 hours we were there, so we had to actively go find him. AVOID this place. I would give 0 stars if I could. Absolutely terrible experience.", "author": "Udit G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "[5 stars] for food, [-5 stars] for service = 0 stars... had to give 1 star because Yelp will not accept 0 stars.\nFood and cocktail was amazing, the rest was a disaster!\n\n1. Wobbly table that they did nothing to remedy. We were a party of 4 seated at 2 adjoining table.  One of the tables was so wobbly, it was seesawing about 5 degrees from one end to the other.  The wait staff unsuccessfully tried to fix the table, then shrug their shoulders and said - there's nothing else I could do about it.  No offer to seat us at a different table, no apologies.  Just, \"WELL, CAN'T DO IT\"!\n\n2.  Bug in wine.  There was a bug in the wine, we asked if they could swap out for us.  I witnessed the staff behind the bar pour the wine from one glass into another then gave it back to our waiter.  Well, I could have stuck my finger in the wine glass and pinched out the bug if I knew that was what they were going to do!\n\n3.  One dish was forgotten. We ordered a side of vegetable and it never came\n\n4.  Nickle and dime.  We were charged extra for a few small slices of Crostini for the ricotta cheese dip\n\n5.  The women's bathroom looks like it hasn't been cleaned for half a day.  The waste bin for paper towels were full, no paper towels (and no hand dryer) and the sink top was dripping wet\n\nThis is supposed to be a reputable chain, couldn't they send their A-Team to set the front of the house operations straight?", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "The food is okay but overpriced. The dessert dough was stale and the chocolate ice cream was only ok", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-22", "description": "Food was good and the place is beautiful but the service was awful. \nFirst of all they give you a really long waiting time even if there's plenty of tables empty (mind that we were there for Sunday brunch so no reservations allowed). The huge number of empty tables (for more than one hour) when reservations are not allowed makes completely no sense.\nThen we waited 15 min to get water and menus, another 20 min to get drinks, another 10 min for food and then another 20 min for the check, basically nobody and I mean nobody checks on you to see if you need anything (pepper, another drink, satisfaction with food). I'm sorry but I think this was the worst service I've received in 11 years of living in this city. Really really awful. Managers are around but they don't keep an eye on tables and bar to make sure things run smoothly. People around us had similar experience.", "author": "Foodlover N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Only reason im giving a star is because I cant give 0...terrible service.   We waited 2.5 hours to sit outside and they gave the table that came after us. Not knowing that we heard them check in, they lied to our face and said they had reservations.  We waisted 2.5 hours of our lives here that we will never get back.", "author": "Allen I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "The food is 4 stars. The service and waiting time with a reservation is 1 star. \n\nWe waited about 30 minutes for a table outside. It took a while for a waiter to come take an order. She took an order wrong, and forgot to remove it from the bill. Over all, the service was slow and bad.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "Was so excited to try this restaurant, as I've heard so many good things about it. Unfortunately I was disappointed. \n\nThe restaurant is a beautiful, rustic space, and in the summer would be awesome to sit with a view of the water. \n\nWe ordered a bunch of appetizers and entrees to share and everything I tried was pretty bland, and lacking in flavor. The only redeeming dish was the short rib with mashed potatoes and the drinks. \n\nI wouldn't come back here for dinner.", "author": "Alla K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "I've been coming to this location since it opened. It is by far one of my favorite places to go too. The ambiance and interior are really beautiful as well as the amazing view from the terrace of the water and Brooklyn Bridge. The staff is excellent and the bartenders are very knowledgeable on cocktails and specialty drinks. I deal with Chelan a lot and she is a true experienced mixologist. I have had many different items on the menu including the tuna, the pizzas, the meatballs as well as every happy hour item and I have never had something I didn't like. I love going to this place and it is something I truly look forward to as well as appreciate. Attention to detail here is key to management and being in the industry I really appreciate that. Highly recommend.", "author": "Cait M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "I made this reservation after reading reviews about poor service and was completely pleasantly surprised. I thought the service was wonderful.. very attentive, polite, and kind. I came for lunch after my graduation and they made sure to make it a special occasion. The table was ready on time, outside as requested. Aside from the great atmosphere and service, we loved the food! I'd come back any time.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "By far one of my favorite restaurants. Checked it out last night for the first time for my anniversary with my wife. We had an amazing experience. Great ambiance, amazing staff, and delicious food...all that with a view :)\n\nCame back a week later with friends, and my review stands! Everyone loved it!\nWe had no reservations this time around, but we were told to come in a bit later on that usual 9:30/10PM to be able to find a table and eat. Didn't mind the time, so we walked in at 10PM, and we were told it was too late to sit and have dinner. Staff was a bit rude about it although we were told to come in around 9:30/10PM over the phone.\nWe almost walked away, but Joy was able to help us out and sort the misunderstanding. So thank you Joy for letting us have another great dinner at Cecconi's!", "author": "Mikey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "One of the best meals I've had in a long time! The place is beautiful, very chic and posh. We had a table with an amazing view, in fact every table had a view. Had the ahi tuna tartare, ricotta honey crostini, grilled octopus, branzino, tiramisu and chocolate torte. Everything was fantastic! Can't wait to go back and dine al fresco.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "The food was on point, everything we had was great, kale salad, ricotta crostini,  Pastas, pizza. The food was delicious. Wine was excellent. View, as mentioned previously, Brooklyn's best. \nTook a star off for service. I was going to go with five stars but remembered how we sat for close to 20 min and had to force some one to come and take our order after asking 3 different people for a waiter. It was the host who finally took our order.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "On the recommendation of a colleague my favorite foodie and I made reservations here for brunch. 4 stars for ambience. Took off 1 star because some tables are to low. But having said that amazing views, decor and service. Food is 5 star delicious. Portions are on the smaller side but filling. We had the quiche and the egg spinach Florentine goat cheese Benedict with avocado (like butter) and chicken sausage sides. Mimosas were flowing and leave room for dessert- you won't be disappointed. We shared the special; a fresh raspberry filled donut(s) topped off with chocolate. \nDo make reservations esp. If you want sit outside.\nGreat date venue. Nice for cocktails and watching NY views.", "author": "Liz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Great location, stellar service, knowledgeable staff and most importantly good food. \n\nIt's not your everyday drop-in and drop-out restaurant so I recommend making a reservation as I saw some guests get turned down during prime dinner time due to full capacity - especially if you're trying to dine outside where the view of the Brooklyn bridge is so breathtaking you want to order another bottle of wine just to sit there for another hour. \n\nI however, opted for the beautiful AC-controlled dining room where my friend and I sat in the back corner sandwiched between a couple and a few business men. We were prone to be forgotten amongst the more important tables, but our waiter was extremely tentative and accommodating. I ended up sitting there for 2+ hours lost in flowing conversation enjoying great food. \n\nTake advantage of the sommelier for a great wine recommendation. Ask questions if you don't know something and don't be afraid to try something new. They have a great wine menu to pair beautifully with its Italian-themed food so take advantage! She brought us a bottle of kerner, a wine I was trying out for the first time and we finished it EASILY. It's an extremely vibrant and zesty dry wine (cross between Riesling and Sauvignon blanc).\n\nOn to the good stuff. \nBeef carpaccio- simple and delicious. What more is needed?\nTruffle pizza - it's not on the menu but if you request it, they make it happen. Topped with generous portions of thinly sliced truffle (not truffle oil), this pizza is the ultimate treat. Crispy and chewy crust that's slightly burnt on the edges is the best. \nSpaghetti with lobster - different from your average seafood tomato sauce. It's probably the saffron that makes a difference but at this point in my meal, I was a little bit tipsy and couldn't pinpoint what it was that made me coming back for another bite. Point is, I couldn't stop eating this one. \nPanna cotta (dessert special) - I normally hate this dessert because of its jello like texture and gooey consistency, but we ordered it upon both the waiter's and sommelier's recommendation and it was one of the best decisions we made that night. It was incredibly smooth and velvety, like a ribbon elegantly grazing your mouth. Sounds crazy? Try it yourself. \nCherry crostata - it was good too, but not as good as the creme brulee.\n\nOverall, I was hesitant to try this restaurant after reading the numerous mixed reviews, but I'm glad I stopped by.", "author": "Judy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Work in the neighborhood, and have now been here twice for their daily 4-7 p.m. happy hour. Once was was as a couple, another time with a group from work.\n\nI've been really impressed both times. The bar area is cozy and beautifully done, the happy hour menu is generous, and all in all the atmosphere is excellent. Each time we've had their happy hour wine offerings ($7 a glass with generous pours), and have now sampled everything on the food menu. There are a number of great small plates from between $4 and $9, including mixed nuts, calamari, wood-fired flatbreads, meatballs, and a few veggie plates.\n\nDefinitely recommend visiting outside of tourist season if you don't want to wait, but this is a very welcome addition to the neighborhood. I'll be back often.", "author": "Max S."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}