{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Took my family from Australia to show the sites of BK. It's a great setting but that's about it. The service is horrible and arrogant. We had 8 for dinner put down 4 credit cards, signed for all 4 but they actually decided to charge the only guest from Australia for ENTIRE amount which meant extra charges for them so they're effectively stealing money from people. Have left 3 vms and sent half dozen emails and they refuse to reply. Would go anywhere else in Dumbo.", "author": "Meredith G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "I called this place earlier in the week to make a reservation for 10 people, they said reservations weren't available. The lady I spoke to recommended that I come in about an hour and a half to two hours earlier to put my name on the waitlist if there was one--so I did. When I got there, they told me they're not doing any walk ins and can't accommodate my party and that the girl who spoke to me on the phone shouldn't have told me to come in early. This whole situation ruined my plans for the night leaving my party of 10 and I nowhere to go.", "author": "Anusha J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-09", "description": "Kitchen is doing well Front of house is lacking severely. I see why they only get 3 stars. Very disappointing service. Get it together!!!", "author": "Dane M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "Update:\nFood is really a 3/10. It's on par with a pizza shop's menu. For example: I got the Branzino tonight. $34, so you'd expect something a little special. Nope. It's just grape tomatoes, next to olives, next to spinach, the fish on top with basic seasoning. Seriously, who OK'd this menu??\n\nOriginal review:\nAmbiance 11/10, food 8/10. It's the most beautiful restaurant in the entire city. The bar feels like 1920s, bartenders in white tuxes, great cocktails, views of the water and park through windows framed by the Civil War era restored coffee warehouse. The restaurant area is big and spacious. My wife and I have tried a few dishes and the food is good, not great. We much prefer the food at Atrium right down the street. The problem is the menu - it isn't inspired or creative. So while you won't be blown away by the culinary experience, the atmosphere more than makes up for it.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-28", "description": "We are locals and went there this weekend. It was a beautiful day and we sat outside. The food was excellent but the service was spotty, slow and there is a lack of attention to details. \n\nThe food-we had burrata, watermelon salad, brick chicken and steak. The appetizers were excellent and the entrees solid. \n\nUnfortunately we ordered at 5:45 and food took more than 1:15 to arrive. We have a two year old so usually restaurants in Brooklyn are sensitive to avoiding a meltdown. After 45 minutes, I called over host who said that our order just was placed.\n\nThe patio chairs are not conducive to eating rather lounging. \n\nThey need to decide if they want to be a tourist trap or serve the locals. If it is the former, don't change.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Had a late dinner here which was really pleasant. The food was delicious and affordable (in my opinion), and the views from the patio outside were unreal. My only criticism was of the hostess who left us hanging for 30 minutes despite multiple tables being open (it was after 10 pm on a weekday, so it was hardly busy). However, this was made up for when we asked to have our table moved to a better one... we were accommodated quickly and the staff was incredibly nice about it. I'll be back.", "author": "Louis V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "The food and service were excellent. View is hard to beat.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "\"Cecconi's the legendary spot from Miami and London comes to DUMBO Brooklyn. I hate to say this but it didn't impress me. The spot is beautiful but the fact that I Waited over an hour for a table for 2 really bothered me. Luckily we bumped into some friends at the bar and we chatted for a bit which helped pass some time. We were seated and The service wasn't anything special. It took a while to get a waiter to get us water and drinks. At this point it was late and we didn't want to eat heavy. The burrata was creamy and delicious. The truffle agnolotti were just ok and for 60$ for 3 slices of shaved truffles I wasn't happy about it. The branzino was ok. I was told the Dover sole is fantastic but if it was an hour earlier I would have ordered it. I wouldn't reorder if I was to go back. I had heard such amazing things but I didn't leave me wanting to come back. Maybe I'll give them another try?!?", "author": "Joe C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "Food was OK. The service was bad (took forever for waiter to come over, never refilled water, never cleared empty plates). Many Fruit flies surrounding the table and we were sitting inside. Wouldn't recommend...", "author": "Jon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Fancy new restaurant with great cocktails. Perfect date spot after a nice stroll in Dumbo. A much needed addition to a neighborhood lacking quality bars and restaurants.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "The views were beautiful. They went above and beyond to try to make us happy and have a good experience, but the food just wasn't good and definitely overpriced. There was a wedding shower going on, this would be a great venue for a party!", "author": "Jesi R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "TERRIBLE service. Staff can't manage to bring orders with timing not even close to acceptable.", "author": "Thiago L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "Great ambiance and the staff was very attentive.  Food was good, except certain items, like the fried calamari and eggplant, were oversalted.  The flavor of foods should not be overwhelmed by salt.", "author": "Bess F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Great views, but it ends there. Extremely rude and pretentious staff. Slow service. Food is mediocre at best. Truffle is flavorless. This is one of THOSE places. $200 for flavorless cold pasta. Don't waste your money. Can't imagine this will stay in business.", "author": "G. K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Waited an hour and a half to be seated outside. I get a text to let me know table is ready and I get sited inside because they made an error in the reservation. No apologies, nothing, but they did offer me to wait another 45 minutes for a table outside. Great way to start my evening at Cecconi's!", "author": "Alexandra B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "The only thing good about this restaurant is the decent view. For the price point, the quality of service and food is below average. I came with a party of eight and no one really cared to finish their food. We had a wide variety of drinks and food items and the best rating for each was \"eh, ok.\" The service by the main waiter was not great (for a tab of $600+). The people who fill up the water did well. There were managers walking around but none seemed to particularly want to engage with the customers. You're in New York City with a variety of options, do yourself a favor and go elsewhere - nothing here is worth it.", "author": "Viral J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "Reservations system is very bad. We made a reservation 2 weeks ago and waited over 1 hour for a table.  Service is poor and un attentive \nFood is over rated.  There are so many better places in bklyn .", "author": "Richard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The Crostinis and whipped ricotta with honey truffle was absolutely amazing. The girl at our table literally wanted to take a few orders to go (after we had a good 2 hour dinner sampling a large portion of their dishes). The tuna tar tar with mint was a fail, they need to rethink that dish. The rest of the food was great. The view from their outdoor seating in dumbo overlooking the Manhattan skyline was probably one of the rarest most unique views of the City from Brooklyn you can witness. Also a walking distance from the Ice Cream Factory, so it's a great date spot for dinner and nearby desert while enjoying a literally unreal view. This place will get more packed as brooklyn continues to develop", "author": "Jon L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "Went to Cecconi's the other day for brunch with a group of four of us we sat near the bar in the lounge style seating which was very nice although if you are visiting on a nice sunny day then I would highly recommend getting there early and trying to snag a seat outside!   We all agreed that the food was good but it was definitely prettier than it tasted... I ordered the baked eggs which says it is made it arrabiata but did not have much flavor to it and was definitely not spicy at all.  If you check-in at this location the give you a complimentary flatbread which was the best part of the meal it was like a cheese pizza without sauce and the dough was very fresh!  The service was a bit slow as well so I would recommend choosing a different place if you are trying to get out in a timely manner.  Over I think I will need to give it a second try as the location is just too good to give up on it after just one shot.", "author": "Maddy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "Every negative review ab service, or lack of, is spot on.  They need to hire new managers bc this was the most disorganized establishment I've had the displeasure of frequenting.  The short manager is more concerned with kissing the butts of \"vips\" rather than dealing with real concerns.  Excuse me if I didn't wear every piece of designer I've ever owned to have lunch.  I made a reservation and was eating an hour and 15 minutes later!! Once we finally got seated, she squeezed 3 of us at a 2 too.  We saw a bigger table leave and asked for the table and the manager said it was for 4 people only and had been reserved.  Well we just saw 3 people leave and that table was left empty for another hour.  Fine, we sat at the tiny table shoved halfway into a shrub of rosemary.  We didn't get water at our table for another 20 minutes and that was after hounding a staff member the entire time.  Other parties were clearly disturbed by the slow service and most employees were just standing around and acting busy when no one was actually working! I couldn't believe how many people work here yet no one was doing anything! Don't they want to make more money by actually producing food and moving tables?! After sitting there we saw another group get seated (saw them while at the hostess table) at a table that was empty for an hour!! I will never return bc I have zero patience for laziness and ineptitude when I'm trying to spend money.", "author": "Olivia C."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}