{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "BOTTOM LINE: This place has more to offer than just food \u0026 drinks.\nTIP/S: become a Friend of Cecconi's do invites to insider events\n...WHO: party of 1\nWHY: F.O.C. Insider event\n\nWHAT: (Deets) I first happened upon this business via an incredible Yelp Elite event where I signed up to become a Friend of Cecconi's. Since that time, I've attended a Spa event, a Meatball cooking class, a wine tasting, and today a Spiritual session. \nGuests were invited to choose from a 15 minute sample session of Astrology, Tarot Card Reading or Reiki with Jill Lindsey practitioners. I chose Reiki with Mr. Luis, and was blown away by how light and enlightened I felt both during and after. Thank you Cecconi's for bringing variety and edge to patrons who are more than just foodies. I appreciate you.\n\nWHEN: 3/27/19\nWHERE: main dining area\nHOW: 4 train to Citibike\nBATHROOM: roomy, multiple stall, separate gender\nWIFI: did not use\nDRESS CODE: As you like\nSERVICE: cordial", "author": "Minah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "is is the second time I have been to this restaurant, the first was with my parents and my partner. We had amazing food and the waiter was brilliant. He knew exactly how to talk to a group with 70 year olds and 35 year olds. Suggested good wine to go with the food we ordered and he even got us to buy a bit more because he engaged with us in a personal way.\n\nRecently, when I went there with my partner and another friend, we had a bit of a different experience. Our waiter asked us if we have any questions and then walked off before we could order. Our appetizers came before bread was delivered to the table and while he came back to check on us, there was no level of engagement. It was all just... standard.\n\nWe had to wait for our table when we arrived so we sat at the bar. Perfectly fine as we didn't have a reservation. It took the bartenders at least 5 minutes to give us the drinks menu because they were talking to other customers (possibly friends) and one was on his phone - I hate phone in the work place! Once we had our menus, it was another 5 minutes before they came back to take our order. The bar wasn't busy, they were just busy doing their own thing.\n\nThe pasta I had was great but I was the only one in the group who liked their meal. Apparently the mushroom on their pizza took away from the bresaola flavour.\n\nThe young man who greeted us at the side door, and took us to our table, started our experience on a positive note. He smiled and wanted to help us when we arrived. I would have loved to have had him looking after us the entire meal.", "author": "ThreeSteps T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-18", "description": "The restaurant is beautifully done. The food is decent but not something to rave about. \n\nWe had initially request al fresco dining and the maître d told us our table would be ready in 20 min. 45 min later they proceeded to state the table wasn't ready while there were 4 open tables outside. We settled for indoor dining. \n\nThe 5'8\" waiter with glass and receding hairline (don't recall his name) was rude. As my family was looking over the menu discussing the plates, the waiter proceed to lecture us like uneducated diners who did not know the difference between the plates. Once our drinks were ordered, the waiter delivered them and dropped them on the table with force. When it was time order our entrees, the waiter proceeded to write down everyone's meals and pretended to listen. One of the entrees was incorrect and it caused drama with runner and one of the dining room managers. The rubber and the manager were talking for two-minutes staring at the table like we were lying and trying to get something for free. As I stated before the food is nothing to rave about a few steps up from a Maggiano's Little Italy. Dessert was also ruined they forgot one of the cakes. Their reasoning made no sense as our reservation stated there was a birthday so they \"forgot\" to bring out cause of confusion. \n\nFor a SoHo House owned restaurant this was subpar.", "author": "Marc M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-09", "description": "To be honest, I really had such high hopes for this place. However, the initial opening/welcoming really left a sour taste in my mouth.\n\nI was hoping for a a patio table. Unfortunately, half the patio was closed when I got there. To make matters worse, they would only let me seat at the bar. If I wanted to eat at the bar, I probably would have asked for a table.\n\nFine, I thought. I had already come this far. Why don't I at least give it a try. I ended up getting the lunch special, which was a side of caccio e peppe pasta, chicken piccata, and a salad of field greens with peppers.\n\nThe salad as incredible. The chicken and pasta however? Not so much... the food was incredibly dry and lacked seasoning.  Definitely overpriced for the quality you are getting.\n\nAll in all, the experience might be worth it if you were promised a table. However, not even being given the option to wait for a table really made it not a great experience.", "author": "Richa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "I first encountered this restaurant at a Yelp elite event I went to. I tried almost all the food offered and all of it was fantastic, so naturally I had to come back - once the weather was warmer. The service here is exemplary - they wait on you hand and foot. My friend and I had some wine, a red and a white, both fantastic. As for food, I ordered the lobster pasta - it is delightful, just full of lobster flavor. My friend had one of the pizzas with meat. She liked it. You really can't go wrong ordering anything here, everything on the menu is great. I say this as someone who isn't particularly fond of Italian food. We were offered complimentary limoncello, always a nice after dinner treat. I will definitely be back.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "This is a trendy spot for Upscale Italian with some\nunbeatable views. Overall, a little on the pricier side, but I enjoyed every dish I tried here. \n\nWould recommend the black truffle agnolotti and bresola/burrata pizza. Great spot for both groups or dates.", "author": "Chris I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "Went on a weekend for a birthday brunch (with a reservation) and it was packed. I didn't feel crammed or overwhelmed though thanks to the big open space \u0026 high ceilings!\n\nWe were seated by the window facing the bridge and the water which set a positive mood for the rest of the meal. Our waitress was friendly but not as attentive as I had hoped. It took a while for us to get waters \u0026 get our orders in but she was apologetic.\n\nAs a group of 5, we ordered a salad \u0026 two pizzas to share. The food was good but not particularly great either. The dessert however was OUTSTANDING! We shared the Lemon Meringata \u0026 I'm pretty sure we were all scraping the bottom of the bowl. \n\nI would most likely go back if I'm in the area.", "author": "Hannah J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "Cecconi's is a great place to go on a fancy date or to celebrate a birthday. The outside seating options are accompanied by beautiful views of the East River and the city skyline. It is a bit pricy but the food is great! I had the broccoli pizza and my friend ordered the lobster pasta. I didn't love the pizza but the pasta was great. Service was amazing! Our waitress was really attentive and helpful. Would recommend for a romantic evening or a fancy group dinner.", "author": "Bina A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-27", "description": "A little disappointed in the service part of this experience.   Waiter was not attentive at all.  He felt very mechanical as if he memorised his remarks and we could barely understand a word he was saying.  \n\nWe were not offered bread before the meal.   We asked and he brought it well into our meal.  We ordered an appetizer and the main course arrived before the appetiser, so we cancelled it. \n\nI ordered a glass of wine upon arrival.   He must have forgotten because we had to remind him.    He never came back to check on us.  \n\nThe food was good.  Had a pasta dish.", "author": "Lillian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "Fantastic service. I have been here for brunch and dinner. Pricey, but the ambiance and service make up for it. The skillet eggs arrabbiata are phenomenal and I can't stop thinking about them at breakfast time. I will be going back ASAP! The octopus was tastefully seasoned, cooked perfectly, and served with nice array of vegetables.", "author": "Lily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "Delicious drinks and a beautiful view!! Unfortunately, very very small food portions that did not blow me away", "author": "S M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "**UPDATED REVIEW**\n\nSince my first review, Cecconi's has added a lot of plant-based items to the menu. I chose the pasta, shishito peppers and the veggie appetizer with carrot puree. I would say the veggie appetizer was my least favorite, but I was also craving something heavier. \n\nThis time around our waiter, Kenny really took service up a notch. He answered any inquiries about the menu genuinely and with passion, so he clearly enjoyed working for Cecconi's and made out night feel special\n\n\n----------- \n\nWe wanted to switch up our Friday routine and ended up here for a late night Friday dinner. Before coming to Cecconi's I would definitely recommend making a reservation, we were able to get one the same night, but it was pretty crowded so I would plan ahead. \n\nThe ambiance in this place is fantastic, it is situated right next to the Brooklyn Bridge and has a beautiful view of Manhattan. They also have outdoor seating for the summertime. \n\nWe were seated in a small table in their second dining room which had comfy chairs/pillows. They had an array of specialty cocktails, and a large wine list. The wine looked slightly above market price, so we decided to get 1 cocktail each. The vodka soda came with a side of soda and a half-full glass of vodka so you could really limit and make the drink to your taste preferences.\n\nThe avocado and veggie appetizer was just okay and didn't really blow me away for a 5 star rating, it was a plate of raw veggies with a small dish of this avocado spread, so you could easily whip this up at home. \n\nFor dinner, I had the cauliflower floret, and my boyfriend had the steak and truffle mashed potatoes. Both were absolutely fantastic. They served the cauliflower with this amazing nut spread, so if you plan on ordering that, I would highly recommend asking for extra sauce on the side, because it really takes the dish to the next level. \n\nAll in, our meal was $140 with tip,  and the steak was on the pricer side ($65) so definitely come prepared.  Whe service was incredible and their servers all go out of their way to make your experience great.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "Ambiance here for sure gets 5 stars. It is beautiful especially on a nice day with a nice view of the water. Our waiter was exceptional and even cracked a couple jokes  without being too corny ! We were seated closer to the outside part and they even offered blankets, which was a first. It is absolutely dim and you may need a phone light to order. I got the vegan pizza which was ok. I wasn't a fun of the olives and instead of mushrooms i got artichoke which i didn't like too much either. Also, be sure to check in on yelp and get your complimentary wine !", "author": "Anissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "Came here to kill time before a wedding at the Dumbo loft. We luckily found 2 seats at the bar facing the pizza oven. I love how you can see them making the pizza's while enjoying a cocktail. I am a sucker for open kitchens. We definitely enjoyed the high end service and the cocktails. This is an old school approach to cocktails where your vodka soda will be served separately as a vodka and small bottle of soda.\n\nI wish I could have tried the food but I didnt have the chance to. There was a great view from patio since the restaurant is right under the bridge.  \n\nThey also had an awesome pizza oven that was pumping out great pizza's. I would definitely come back even though it is a high end joint. Enjoyed our time.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "Located just a few floors below are office - it's a great spot to go and grab something to eat.  A little upscale for a lunch spot, but the servers are super friendly, helpful, and quick.  I had a seafood dish that was out of this world, and I will definitely be back when visiting the office.", "author": "Koli D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "We ordered 3 appetizers and pizza (for main course).\nBeef tartare - was excellent\nHamachi crudo - excellent\nOctopus - good. A little bit chewy but good.\n\nBlack truffle pizza - excellent.\n\nUpdate:\n\nSecond time at Cecconi's.\nOrdered Beef tartare,\nCalamari - excellent\nRicotta crostini - excellent\nWhite truffle pizza - absolutely amazing.\n\nLemon meringata - amazing.\n\nHighly recommend.", "author": "Vitaly L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-06", "description": "I made reservations for a Monday night for 7:15pm, and I'm glad I did because there was a couple ahead of me who was quoted a wait time of 45 mins-1 hour. We had to wait a few minutes for our table to be ready, but it wasn't bad at all. I'm used to dimly lit restaurants, but this one was probably the most dimly lit place I've been to. You could hardly see the food or the menu. I was seated near a door, so I had some light from the outside but the rest of my party had to use the flashlight on their phones.\n\nThe service was kind of spotty. I think there was some confusion over who would wait on us, because there was a man who introduced himself to us first and then a woman came over and did the same introduction. She remained our server for the rest of the night, and she was very friendly and sweet. But, it wasn't anything to write home about. We had to ask for a lot of things, like the dessert menu, more bread, etc. There were also a few times throughout the meal that servers approached us with food/drinks that we did not order, and were actually for the table next to us.\n\nThe food was delicious, albeit on the salty side. We all ordered pastas as our mains and meatballs to share. I had the bucatini, which was really good. The portions are rather generous, which I was pleasantly surprised about. We also ordered a slice of the tiramisu to share, and it was great. Overall, I enjoyed it and would come back again.", "author": "Ada C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "We ended up going for a Saturday lunch, with no reservation and sat by the bar. \n\nThe view is amazing, staff was very friendly and attentive.\n\nWe only had few starters and drinks. Coctails are really good. Tuna tartare was one of the best ones I ever had. I also highly recommend whipped ricotta w truffle honey crostini, calamari, burrata and eggplant. Pricey but absolutely worthwhile...", "author": "N A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Had an amazing evening! \nWe had reservations at 7:15pm. Came early on and sat at the bar until our table was ready! \nOur female bartender was AMAZING! Her recommendations for apps and drinks were on point! And customer service was 5 stars!\nWe ordered the French Connection and Between the Bridges! So yummy! I then received the free wine (Pinot Grigio) by checking in on yelp... \nApp ordered was the whipped ricotta!!!! MUST HAVE when going here. \nTable was ready right on time and our waiter, Jose had THE Best customer service and was very tending to our needs. \nWe were seated at a table with a beautiful view! New York steak was delish and so was the ravioli! \nSo glad we chose this place to eat in DUMBO!", "author": "Mae A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "I've actually been to Cecconi's before (for one of the BEST Yelp events ever). I work nearby, so of course I took advantage of the opportunity to have lunch there.\n\nIt was summer, so no outdoor tables available. But they sat us right at the window still with great views.\n\nI had the lamb ragu cavatelli, which was excellent. And at $24, I'm glad it was expensed.\n\nWe were in a rush, so we skipped apps, but from my previous experience here, their burrata is AMAZING. Along with their veal carpaccio and meatballs!\n\nDefinitely stop in if you're in the area and looking for a more upscale meal!", "author": "Kenny C."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}