{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "I was so disappointed by the behavior of the woman in the front desk. She was so disrespectful and literally never looked at us when she was talking to us. The food was burnt! We ordered a pizza and asked them to change it and they did not even apologize for the food they put in front of us. We thought it was enough and asked for the check..", "author": "Aisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Great food!!! Coming from Chicago where we have phenomenal food!!! Will definitely come back next time were in New York!!!", "author": "Scottie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "The view is the only thing this place has going for it. The food was just regular restaurant Italian food nothing special. It was priced because of the view not the quality. The service was horrendous. I think it was a hostess who finally took our drink order after 30 minutes only for them to mess up the order. Then we continued to watch them bring our dishes to other tables, get rejected and come back to us. So 45 minutes to get drinks at our table was a little rough. The apps came out within 5 minutes of ordering them though. The best part was when the check came. Sides we ordered that never came were on it, the drinks they messed up were never taken off and then there was a pizza we never ordered on it. After adjusting it to what we did consume I was surprised they didn't comp anything for the poor service. Underwhelming for a special occasion dinner.", "author": "Lorena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "A Brooklyn  bridge away from the Big Apple, a breathtaking view of the city this new comer Italian restaurant under the umbrella of the Soho House delivers good Italian fares at a decent price. It has still room for improvement and in several visits it did exactly that....\n\nFSD (Food Service Decor) ***  **** *****Pascalpicks.\n\nThe Decor is exquisite  with bricks marble and leather along with a central oven pizza and open kitchen , High ceiling and beautiful outdoors cafe, great seatings at the bar, the restaurant dining room is extremely confortable , well executed design and proportion as well as the acoustic. it get a 5 stars rating as far as the decor is concerned Cheers to the brits who did not spare any Pounds here .\n\nThe Menu is well balanced between apt teasers  and main courses I recommend their fresh home made pastas  and poisson du jour , the pizza are great to share for large parties.\nI also recommend their 4/7 Aperitivo (/HH) where you can drink refreshing beer at $4 or a $7 glass or munch on  olives or pizzete at the same price. Great Idea and concept cheers to that ! Happy hours are usually not very happy especially when you get the bills it is refreshing to see the prices of the 80\" 90\" back if only for the afternoon collation (Pardon my English )\nthe Barmaids are friendly and prepare great cocktails with a push on the trendy Negroni done with all alcohols . \n The service and hosts are friendly with faces already seen in other top restaurants in the city ( Raoul, Claudette, Opia etc )some of them are French and must have been hired by the very professional hospitality specialist  , Jean Baptiste Caillet , whom I met at various popular restaurants like Balthazar or Le District  in Battery Park City. He embodies the art of the French Maitre D reminescent of the 80\" in New York. Ah the golden Era!\nHis style of management is definitely \"Guest satisfaction\" oriented , a rare skill to find in a now millennial generation that frequents  trendy places such as the Soho House who is mostly members oriented and plan to open a private club on the roof of 55 Water street opening in January 2018 .\nOverall Cecconis is a great experience and an alternative  breath of fresh air in the now trendy Dumbo . \nKeep up the good works and may you improve always for our great satisfaction.\nBon Appetit!\nPascalPicks", "author": "Pascal D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "This place is gem! I loved everything about this place. The beautiful restaurant, very unique, the very friendly staff, and just the atmosphere was brilliant ! And the orange juice was the best!!", "author": "Milissa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-28", "description": "I contacted the restaurant about a month before opening to celebrate a good friend's birthday on opening week and at first the response was good, even though I couldn't secure a reservation. As it got closer to opening the GM was unresponsive on getting back to me to schedule a day and time. \n\nThe day finally came to try out Cecconi's and the reservations management was a bit rude about picking our time slot we could get. So we showed up early and they still could not commit. \n\nThey were not flexible on seating a party of three at the tables closest to the water outside. So we took what they gave us even though nobody ended up sitting at the table we requested during our dinner. \n\nOverall the food was ok. Ribeye came out cold and on the check they ended up charging us more than was on the menu so we had to reconcile on our own - they need to make sure the computer matches what they sell on menu. \n\nAll in all not a great impression for our first visit and it didn't feel comfortable. We've been to other Cecconi's around the world and this one needs some serious help.\n\nI wouldn't go until they demonstrate they know how to run service and be consistent with food quality. Won't be back for a long while if ever.", "author": "Amman B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "great view, with an average pizza. The reception staff were great, kind, but the waiter was not patience, mainly considering it was our first time there. They delivered a \"birthday cake with lightened up candle\" by mistake in out desk, which I thought it was a kind gift from the restaurant since in opentable i had flagged that it was my aunt's birthday. So we promptly started to sing happy birthday. The waiter just took it from our table while we were singing, making us fill humiliated and taking something that was not ours. If he is the one in our desk again, I would ask to switch.", "author": "Juliana O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-10", "description": "Disappointing service. We were visiting from Australia and had a brunch booking for my birthday. From the moment we sat down, it was apparent our waiter's only mission was to try to make us spend more money. We said we didn't want sparkling water, just normal, and they tried to crack open bottles of evian rather than give us tap water which we had to refuse, which he made a point of making us uncomfortable over. He tried to force us to get cocktails, rather than simply asking what it was we wanted to drink, and even when we asked for the bill, tried to convince us to get dessert, even trying to manipulate me by saying it was my birthday and I should at least have cake. The awkwardness ruined the entire vibe of our brunch. The view and food were good, but unfortunately tainted by an uncaring waiter who acted annoyed the entire morning.", "author": "Anneliese C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-05", "description": "The food was fine-to-really good; the setting, right on the East River, spectacular; but though the staff was obviously working from a playbook meant to make customers feel welcome, we were abandoned for long stretches, especially after the main course plates were cleared and we were waiting for dessert menus. Understandable, as this place is vast and full of tourists, and we were there for Sunday brunch; on the other hand, we are not going to rush back.", "author": "Azaro M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "The food was good. They gave us a really good seat with an amazing view. The service, was HORRIBLE, we had to ask several times for the things we asked, I really had never experienced such a bad and slow service.", "author": "Lina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "split the bill with someone, we both got charged twice, and the calamari tastes like pure salt. otherwise a nice location", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This place is an absolute GEM! There aren't enough superlatives to reflect my pleasure with this restaurant. The service is EXCEPTIONAL. Clearly, they were all trained by the same team.  The staff work as a team to ensure your every need is met. This may be the best staff I have ever encountered. The ambiance is wonderful and the view of the river, the bridges and the carousel add to the charm. The food is also fantastic. The ingredients are fresh and are impeccably prepared. Please know that this is not microwaved food so allow time for this deliciousness to be prepared. I will go to this place, over and over again.", "author": "Lavinia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "The restaurant was really nice and sort of reminded me of Miami at the entrance. We had the pleasure of sitting outside where we had a beautiful view of the bridge and water. My only complaint was the service. When they sat us they took approx 15 minutes to even get our drink order. Then it took about an hour to even get our entree. After making a complaint the manager was nice enough to comp us the entree. The risotto was delicious along with the branzino! I wasn't so crazy about the meatballs but everything else was delicious.", "author": "Chelsea C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "Only good thing about this place is the view. \nVery disorganized with reservations. Bartenders act too busy to get you a drink. The food is good but service is just overall bad.", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Unbelievable view, great experience,  food was terrific, did not get rushed out . Defineatly will be back", "author": "Diana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "A Brooklyn resident for some time, I wanted to try out the new Cecconi's in the marvelous rehabilitated warehouse building in historic waterfront Dumbo.  \n\nThree of us went for brunch on a beautiful, bustling Sunday afternoon.  With no reservation, we were promptly accommodated inside at a comfy table.  The experience was lack luster from the get go.  After waiting nearly 10 minutes for someone to greet us at the table, we received water and ordered beverages.  Upon ordering our brunch entrees, it took almost 45 minutes to receive our food. When we received it, half our orders came out and we waiting over 5 minutes to receive the rest of our food.  By that time, our entrees were cold. The brunch egg options were embarrassingly small for the price point and were simply average.\n\nAll in all, service was inattentive, slow and mediocre. Food was cold and boring. Gorgeous location and building, but truly a disappointment.  Won't be returning to this tourist trap - I'd recommend Atrium around the corner.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "The food is tasteless. The risotto is bland rice w a few peas. The service was nasty. And even after you have dinner. If it's after the \"last call\" for drinks at 11pm they will not serve you at the bar.", "author": "J P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "They do have a beautiful view and a nice decoration inside but if you are like me and care about your reputation recommending places to friends believe me you would rather not choose this one. In most of my reviews I give 5 stars because it's way to say \"thumps up\" go there, however this place is a \"no no\" therefore my harsh 1 star.\n\nBefore going there I had checked the menu and prices and thought they had pizzas and other Italian items that I might like. However because we were a large group of 8 they didn't let us choose individual items and forced us to go for the $40 pre-fixed menu. The pre-fix is basically 3 appetizers and 3 entrees. None of the choices looked appealing to me, yet I had to go for those. To be fair, my Italian friend said the Burrata was above average for New York, but that's it; as the eggs that followed were very average and the overall quantity of food in the pre-fix proved to be light. I left the table still hungry not daring adding a $17 pizza to my already pricey $40 brunch food items. I was super embarrassed for my friends who wanted to keep this under a small budget but they couldn't. In addition, when the bill came they added the tip to our cards without asking our permission. I myself regularly spend $60 to $80 on brunches without giving it a second thought, but them removing spending control from us really made me angry. In summary, this place is very expensive for what you get and their strategy is to optimize on squeezing money out of you with prefixed and tip already included.\n\nOk that was about the restaurant generally speaking... Now let's talk about this very bad incident that happened to the Italian friend I brought with me. The following Monday of that weekend she noticed a $645 transaction whereas we were all given ticket receipt of $90 per person. The bill was split equally among the 8 of us. My friend called them complaining, they kept saying that the manager will call her back and solve the problem, but no action was being taken after multiple attempts throughout the week. Then on the Friday she reached someone who told her that they won't give her money back unless we gather the money from the other individuals who didn't get charged, unbelievable... Can you imagine us what we had to do? Contacting individually everyone, checking if they actually got charged, collecting the money, etc... all this to solve a transaction they illegally executed (ticket receipt was not showing $645). Facing this BS, my friend and I went in person on our own free time to the restaurant so we solve the problem. There it took us 30 minutes to be finally put in touch with the relevant person, they were still playing us hoping we'd give up. It's like they wanted us to make a scene and finally be heard; or otherwise it's assumed you don't care enough about the money. When the manager came the interaction was succinct. He just asked us the transaction we wanted to go away and fixed it immediately, no explanation whatsoever provided. Very weird. I suspect the staff fucked up and tried to cover their mistake hoping we won't care enough about $645 and challenged us to it. In the end, I didn't even pay for that meal so it's not all bad but god I won't ever go back there... So much time and energy wasted for little reason...", "author": "Maxime B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "They are close. Amazing decor. Food is a 7. Noodle Pudding in nearby Brooklyn Heights has much better pasta. But here you get the views. Service was attentive but waited almost 2 hours for table outside, but it's Saturday in August and 75 degrees so it's to be expected. Pistachio gelato fraudulent lol but hazelnut and blueberry sorbet very good. Oh and red wine list by the glass to be desired. Had a few, only the cab was good. Three and a half, rounding up to a 4 because I expect it will only get better.", "author": "Meryl H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "Beautiful location, especially on a nice day.  But the place doesn't seem very well managed. WE were told there was a 60 minute wait for a table for 2.  Which is fine since we didn't have a reservation on a busy, nice night.  But we were left at the bar for an hour and forty minutes without being called. Meanwhile there were a number of tables that were unoccupied.  We enjoyed our drinks at the bar but were not impressed overall.   Won't be back anytime soon.", "author": "Rob O."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}