{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Truly a fantastic experience. From the time I made the reservation until I left everyone was so accommodating.\n\nI have a dairy allergy and my friend who had a 30th birthday does not but they created he most beautiful vegan dessert for the both of us that he didn't even notice and loved it more than any of the other desserts he could've chosen from.\n\nOur server Allen was AMAZING. So attentive. Made us feel like we were his only table (obviously not that case as it was decently busy even for a Wednesday).\n\nOur hostess Jasmine was truly a gem and she made the minuscule time we interacted with her warm and inviting. \n\nI am sad I missed our bartenders name (where we waited before our reservation). He truly made us some fantastic cocktails and gave 5 star service even when so busy with other customers.\n\n\nA MUST VISIT", "author": "Spencer V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "Rating is strictly for the bar and drinks. Beautiful bar and decor. Loved the overall atmosphere and vibe of this place. I would love to come back to try there food. Bartender seemed a bit overwhelmed the night we were there but was very friendly. Overall good location and decent drinks.", "author": "LItennis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "Outstanding service, food and ambiance.  I will definitely be back.  Try the beef tartar with black truffles and quail egg, the whole roasted cauliflower, whole Dover sole ( filleted for us table-side) and the heavenly tiramisu.", "author": "Cancion F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Lovely place with a great view! Get the Truffle  Pizza was amazing. Took my mom and aunt and they were very happy with it too.", "author": "Natasha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Such a charming spot in Dumbo, Brooklyn. Gorgeous views of the Hudson where you are able to see both the Brooklyn bridge and Manhattan. The pizza is delicious, and ambiance is so lovely. Love the details and charm", "author": "Lena K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "I went here for the first time for  \"Friendsgiving\". I wanted a great meal in an intimate setting with 2 great friends. Mission accomplished. The Service and food were incredible. We were given the best seat in the house with a direct view of the bridges and  river. I liked the vibe of this place from the moment I stepped in the door...from the industrial art loft aesthetics to the sexy, smooth music. The ambiance was chill and on point for my tastes....down tempo, hip, luxe.  We had the early noon seating  for our Thanksgiving family style meal. Gnocchi w/shaved truffles, pulled dark meat, mushroom bisque... mouth still watering at the thought. The hostesses were cheerful and warm coming in and going out. After the meal they allowed us to relax for many hours without being rushed out for the second seating. Im a real Italian and basking in he after glow of a good meal is what we do. I can't remember the last time I had a meal in NY without feeling rushed throughout or at the end.  Our main server Nick was attentive, happy, courteous and accomodating. He was point in every sense.I love when people take pride in their work and you could see that he did. Its the fist time I ever thought of returning to a restaurant and asking for a specific waiter. Nick is a machine. I will be back maybe even for xmas. This would be a great place for anyone looking for a good date spot to actually talk and get to know another human. If people still do that sort of thing. Thumbs Up to the entire team that day it felt like it was very well managed. Thank you all for giving me a beautiful Holiday experience and now a beautiful memory.", "author": "Blond B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "After entering I can see how the restaurant has low ratings, stood directly in front of two hostesses for easily 10 minutes not a single one of them said hello, spoke to me, even looked up from what they were doing.. Then as i was about to turn around and leave the one hostess leans over to the other and asks why im standing there! Then one finally asks me if i need a table... Need to work on staff in the front. Restaurant is too beautiful to have such unprofessional hostesses.", "author": "Jenna N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "11am reservation, waited about five minutes. Waiter asked if we wanted still or sparkling water and we said still and he came back with a bottle of evian, and we did not think anything of it. Order delicious cappuccinos and lattes, and each a entree. Disappointed in the amount of breakfast entrees since we were there for brunch but still delicious. Kicker was the end. We were charged 9$ for a bottle of water that we just assumed was tap. At no time were we told that it was not just tap water, nor did we request bottled water. The ladies at the table next to us said he automatically just gave them unbottled water, so not sure why he gave us fancy bottled water. Manager was apologetic and compensated us for it. Nothing special besides a beautiful view and atmosphere.", "author": "Melanie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "Good food, good drinks. No wait, because we decided to sit at the bar after been told there was a 15-20 minute wait for tables by the hostess.\n\nSaw a few empty tables for a long time while enjoying ourselves at the bar. Hope the manager is aware of this issue and micromanage the seating of guests into the empty tables if necessary.", "author": "Billy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "Cecconi's gets a 4-star instead of a 5 because while the food was excellent and the ambiance is amazing, the service was extremely lacking.\n\nI had 9PM reservations, yet was seated after 10PM. During that time I had been told by the hostesses numerous times that my table would be ready any minute. Thankfully I continued to ask or I'm not sure I would have been seated, even with the reservation. In any event, once seated we were greeted by a server who said she would be taking care of us, although never returned! We kind of just had a bunch of different people throughout the night.\n\nNow to the food - definitely made up for it all. We started with a bottle of wine and the whipped ricotta. This was incredible. For main we went with the arribiata pasta, bufala mozzarella pizza and a side of the truffle polenta. Each was DELICIOUS. Especially the polenta.\n\nHopefully the service steps up.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Very nice ambiance down by water , food was OK . Well described  but not executed well . However great cocktails and wine list !!", "author": "Chanel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "This was by the WORST dining experience I've had in NYC. It started as soon as we arrived, when we had been promised a table outside via multiple phone calls prior to the reservation date. The hostess was incredibly rude to us and could not explain to us why we were being denied a table outside when there were MULTIPLE tables open. \n\nThen, the waiter showed us virtually no attention. We had to flag down random waiters to take our orders. \n\nFinally, we had asked for two desserts because we were celebrating two birthdays. They brought out the desserts when one of the birthday girls was in the bathroom and just threw the plates down on the table. \n\nTo top it all off, we had incorrect charges on the bill and the food was extremely sub par. Stay away", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Customer service is great! View was amazing . They seated right by the window as requested with no problem. Ordered cauliflower, rigatoni, calamari. All delicious. Thank you", "author": "Anellia E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "A perfect spot if you are one of the beautiful people that want to be seen.  I went there at 4 pm on Monday with a friend to have dinner outside.  We we told that because we didn't have a rreservation we could not be accommodated.  We had our overpriced average tasting meals while all the outside tables stayed empty.  When we questioned a manager he just played dumb and skipped back to his hostess station and was going to ask his team what happened.  Just a line of bullshit to get rid of us.  Don't waste your time of money", "author": "Jerry E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Came for a special occasion and was not disappointed! The food was so good, we especially loved the calamari and meatballs.  The views are picture-perfect!", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Wait staff excellent. Food - excellent. Ambience - excellent. Very romantic when the sun goes down and these guys are serious about their craft. Love this place, will be back", "author": "Chiazor I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "I am a huge fan of Cecconis. I was so excited to try this new location. I cannot believe how disappointing  it is. Service is slow and terrible, food is below average. People who work here seem to have an attitude. The party next to us was smoking! Who wants to eat while smelling someone's gross cigarettes!? We told the staff multiple times and it wasn't resolved. They said they can't control them and what they do. Ummm, how about asking them to leave for breaking the law? The best thing about this place is the location and the view. Go for drinks and sit at the bar! Don't bother with the food or getting a table. It's not worth the bad service and the hour it takes to get below average food. \nAfter writing this review, I think I'm going to report them for allowing people to smoke. It's illegal  and they need to take it serious. It ruined our experience.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Went for lunch and can't wait to come back for dinner and cocktails. Ended up here because Juliana's had a line, and happy I did.\n\nGORGEOUS ambiance. Perfect for a date or family visiting.\n\nThe pizza is thin and crispy, and the toppings stay put (unlike Love \u0026 Dough nearby, where everything slides off). I'm a huge cocktail nerd and their drinkware/presentation look great.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "This was my THIRD time back at Cecconi's, and I really think it gets better and better each time. The service as always was impeccable, from the host, to our waitress. The view of the water and bridge with the snow falling was the perfect atmosphere to enjoy a delicious Hot Toddy! I also tried my girlfriends Arios coffee cocktail which was INSANE! The drink had vodka, espresso, grand marnier and I couldn't stop stealing sips. For food we enjoyed the creamy burrata as an appetizer which came with the perfect pairing of beets, and the kale apple salad. For our entrees, I personally ordered the short ribs which were so tender, you only needed a fork to pull it apart, while the rest of my group ordered the agnolotti, and bufala mozzarella pizza. We also split the whole cauliflower which was huge, and delicious. We all enjoyed our meals so much and I cannot wait to come back!", "author": "Lindsay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Great food. Great service. Was a little on the expensive side but it is a gorgeous view.", "author": "Gioia M."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}