{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-31", "description": "Poor service: we were hosting friends from London and came for a long lunch. Seemed to spend the whole time looking around trying to get attention from the waiting staff.  Food was great but service was so poor that we even had to stand up and serve our own champagne and wine to the table throughout the lunch. Embarrassing.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "Food was good but the service needs improvement and they need to better enforce the no smoking law outside in their dining area.", "author": "MARISA P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "I am surprised by all the negative reviews. Happy to say my experience there was just lovely. Had lunch there with my aunt and my cousin. We shared two delicious appetizers: the burratta and the guacamole with crudites. The burratta was creamy and sweet, and the guacamole was a bit chunky and nicely seasoned.\n\nOur main dishes were very nice as well. My aunt had the salmon with asparagus, which she enjoyed; cousin had the asparagus bagna cauda, which she loved; I had the porchetta and artichoke flatbread pizza -- the smaller size -- and it was perfect for lunch.\n\nWe shared two desserts, which were lick-the-plate delicious: chocolate mousse and tart and pistachio gelato. Perfect finishes to the meal.\n\nYes, we had made reservations. Yes, it was busy, but the service was friendly and attentive. The setting is lovely. It's not a place to just drop in, especially during the busiest times of day and especially during the warmer months when more folks are out and about. But make a reservation and go!", "author": "Dorrie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Great Food, Service and views!!!! :) Their pasta, pizza and appetizers are to die for!", "author": "Ibernia P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "Worst wait ever! 40 minutes after appetizers, the waiter came around to apologize for the long wait for the entrees. 20 more minutes after that the manager came by to apologize for the wait. These 60 minutes no one refilled the water nor the bread. 15 minutes more then came the entrees. While waiting I saw a silverfish crawling across the floor toward my feet. I squashed it. When the entrees finally came, the seared skin of the branzino was too salty, the seared skin of the salmon was too salty, and the pasta dish was also too salty. Aside from the waterfront view, I don't understand why anyone would dine here.", "author": "G. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "While this place is indeed going through some growing pains, the pizza cooks, are spot on! Roberto and Colin, were amazing, pushing out spectacular pies today during the brunch craze. It was insanely busy but they had a rhythm going. I will go back for dinner soon.", "author": "Violet P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Had such a great experience, went back today.   This may sound negative but it is not.  It is just some insight.  Key lesson, don't be fooled by Open Table or the barrier thrown up if you show up without a reservation.  In other words, give it a chance.  There were no reservations available until Sept 11 for a table of 4.   That said, we showed up and asked for a table for 3 and after the game of 'do you have a reservation?' there was no issue to be seated right away and it was clear that there would be no issue to be seated, so drop the perception your doing me a favor.   My view it is better to admit, there are limited number of reservations but keep some tables available for 'walk ups'\n\nWe ended up sitting at the bar and again had an awesome experience.  Service was attentive and more importantly the food was great - fresh ingredients, flavors well developed and helpings appropriate to enjoy the serving..  We expanded on the shishito peppers, risotto verde, chicken under a brick and caponata all consistently and well prepared.   We expanded to try the rigatoni and pizza with mozz; tomato and basil.  Both basic but brilliantly and freshly prepared.\n\nAgain from my prior review, I appreciate that the size of the restaurant necessitates creating a 'vibe' but given the growth of the neighborhood and surrounds, I hope the restaurant finds the vibe it deserves with the reality of those who will be regulars.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "I went to Cecconi's this weekend and unfortunately was disappointed in the meal. \n\nPros:\nAmazing burrata - one of the best I've had\nPizza was delicious, though the truffle one was not worth the $$\nAmazing view\nLobster pasta had a lot of actual lobster in it (but the sauce was bland)\n\nCons:\nTheir kitchen was completely disorganized - they brought out one person's entree with the appetizers, followed by half the entree, then salad, then the sides of the person who already finished their entree, followed by the rest of the meal... completely wrong.\nWe received incorrect cocktails\nTwo glasses of wine were corked\nCalamari was rubbery\nManager didn't even bother to come over after we mentioned our issues to the server\nAll the tourists stare at you since you're right on the pedestrian walkway\n\nAll in all, fine for drinks and an app but definitely not worth the money for an actual meal.", "author": "Allison K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Went the day before they opened, met the manager who was nice and friendly, told him we lived in the neighborhood and were excited to be regulars.\n\nWe left and came back a couple days later on Saturday, 20min before opening. The extremely curt and rude hosts, like robots told us, sorry, we are fully committed but we are accepting limited walk ins. Not friendly AT ALL and very cold although we were really friendly to them.\n\nI asked for a menu and there was no, \"here you go, let me know if you have questions, please feel free to take a menu, etc.\" Nothing, just blank stares. Decided to leave and go to the lovely coffee shop next door, an outpost of a great Vin Hill restaurant. Finished and walked by Cecconi's again about an hour later, TOTALLY empty. I mean, why lie?? And why lie to potential returning customers who live in the hood?? Who else is going to be going to this place when you turn away ALL the locals?\n\nThis whole snobby experience is beyond me. We live in a luxury condo in dumbo and live a pretty good life and to be treated like we were low class vagabonds and didn't deserve any real treatment from this restaurant is not acceptable. I will not be coming back to this place. This attitude at the front is enough for me to dismiss this place. If they can't tell from their ratings, they need to make some serious changes.", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "update: \nafter speaking with someone from cecconis, i came back for a second chance and had an entirely different experience. \n\nthe food has improved ten fold, didn't try the calamari again but i venture to say it's much better. the front desk seemed to be running much more smoothly. i'm happy to say that they seem to have worked out the initial struggles and it shows in every aspect of what they're doing. would go back. would recommend.\n\n-----\n\n\noh lordy, where to begin....\n\ni made my reservation for 9:45 for 6 people, we ended up being 2 (i guess i have no friends?) and got there around 8. we asked if there was any way they could accommodate us earlier, they kindly said they could seat us in ten minutes. fast forward, they did not seat us. every time we checked in they said \"oh sorry! one minute\" but  it wasn't until 9:50 we were seated. \n\nTo be clear, if they had said they couldn't accommodate us till our reservation time, that would have been FINE. but they did not say that. \n\nonce seated, we received one of the worst plates of calamari i have ever tried. like really terribly bad. i wouldn't wish it upon my worst enemy bad. the waitress said she would remove it from the bill. the food besides that was totally decent.\n\nwhen the bill came, we asked for the under 27 discount we receive as soho members. they said it was applied but no itemized bill was included. when we got the bill it turns out they had not comped the calamari and had also added a cocktail by accident. not a good look to mess up the bill and not include the itemized receipt.\n\nall in all i will not be heading back anytime soon. the view is great but not worth 3 hours of annoyance.\n\n\nside note: all the servers were very friendly and courteous.", "author": "Juliet W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Had a great experience! #goodfood #goodservice #greatlocation #greatview I will definitely be back especially for happy hour.   Been to the West Hollywood location and I like Brooklyn location much better!", "author": "Gayle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Came here on a friday night with my husband and some friends. They sat us outside since we previously made reservations. We had an amazing view of the city, in a very laid back environment. Service was fast and the food was great. Loved the meat and cheese platter and the vast variety of wines. Will definitely come back.", "author": "Esther C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "I went here for dinner with my family at 6pm and it was delicious! We walked in and were seated promptly on the outside patio that had an incredible view of the Brooklyn Bridge. The GM came over to greet us and he was so sweet and welcoming! My little cousin who is 7 was with us so we ordered him the Margherita pizza and he loved it. \n\nI ordered the risotto verde and it was super delicious. My uncle got the Ahi tuna tartare that was very light and refreshing. The salmon was also great!\n\nFor drinks I would definitely recommend the house rosé!!\n\nThis place is slightly upscale but it really depends on what time you go. It's great for a family dinner, date night, or even eating solo. The view is amazingggg!", "author": "Jessie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "My son whom lives in New York invited us to dinner here at his favorite place in Dumbo The \"Cecconi's \" He called three weeks ahead of time for reservations. Upon our arrival the front desk people were very nice, they stored our luggage out back ( we were flying home after this dinner ) We were giving the seat right by the entrance, we asked if this was the best they could do and the hosted said \"everyone wants good seats\" well did everyone in your establishment this evening call three weeks prior? I would have to guess I don't think so. We tried to make the best of it, an ordered drinks, apps and dinner. The drinks were good and the app was very good, but dinner my lasagna were just ok, one ordered pizza and it was good nothing spectacular. We tired to get our waitress attention three of four times for little things, never saw her again until we got our bill- I have to stay I was sad by the lack luster of this visit and so was my son whom wanted our last place we ate/ visited to be special. My son had ate her prior had a different experience so I am hoping they just had a off night. I have to say after leaving the restaurant we walked outside and the view is just amazing of the city and bridges.", "author": "Debra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "The service was really great. Everyone is extremely friendly and accommodating. I'm vegan and they were more than willing to change menu items for me. Highly recommend, but you need a reservation.", "author": "Artemisia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-21", "description": "Great view--food is good--stick with simple dishes, salads, dips and you'll do fine. It is noisy!", "author": "Harry S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "This place is cool love the decor and the drinks are great and pizza is good. A good place for a meet up at bar for a scene and nice view. Wouldn't come here if i was starving and wanted a serious meal but more of an app and drink and a fancy vibe.", "author": "Gena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Had an outstanding meal here last night. I love how they've decorated this place - modern, but still feels somehow rustic and homey. Amazing views of the Brooklyn bridge. The service was excellent and very attentive. I recommend the agnolotti with mushrooms, the black truffle pizza, the branzino, and the profiteroles for dessert (yes we had a ton of food). Overall an excellent experience- but make sure to make reservations!", "author": "Lydia T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "Server was horrible .... Forgot to put my friends entree and pretended it was because we had appetizers and my brick over ... Chicken doesn't take over a hour to cook ! Was slow service and couple next to us had a disaster of ordering dessert and never got it but pay the bill .. Nice location but they need to step it up .. We should of went to Julianna's ... I will never go here again .", "author": "Victoria V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "I made a dinner reservation 3 weeks ago for tonight, with my biggest client for a dinner meeting. We are all in the fashion business. We 3 women were told we were too early to be seated for dinner to step aside, we opted to have a drink at the bar (which we should have been directed to do) I checked back in with the hostess who then escorted us to a knee height table in the bar .. I objected as I looked into an empty dining room.. hostess went back to podium and seemed firm in saying this was our table..a waitress walked by and said there are plenty of tables in the dining room.. do not settle.. all this is very humiliating.. so When the hostess never came back I escorted my clients to an open table and we sat down.. the waiter greeted us and took drink orders but the maitre 'd came over twice to further humiliate and berate us for sitting in the empty dining room If we were 3 men this would never have happened.. I was embarrassed and will never spend my or my company money here again.. nice going little bearded man", "author": "Maryann S."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}