{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Well, I wish I could review this place, but was unfortunately never able to eat here. My husband and I spent the day in Dumbo and decided to stop by for a couple of cocktails and some appetizers, as it was a lovely day. We waited in line to speak with one of the hostesses and, when we asked if there were any open tables facing the patio/water, were told we were welcome to walk back there and see if there were any open bar stools and/or bistro tables facing the outside. We did so and spotted an open bistro table facing the patio. We waited a few minutes to see if someone else was going to sit there and then politely waited for a waiter/host to walk by and nicely asked if it was okay that we took the table. The nice waitress let us know that sure, that was fine and to go ahead and sit down. We started to do so and were suddenly and extremely rudely interrupted by hostess #2. We were told in an unbelievably rude tone and manner that 'SHE was the hostess, NOT the girl we spoke to, and would let us know where we could sit'. We were then told that the table was 'promised to someone else' and that there was nothing else available. Needless to say, we left immediately. My husband and I have lived in Manhattan and Brooklyn for 5 years and have seen our fair share of snobby and rude people, but this one really takes the cake. Not sure who this little girl thinks she is, but she needs a reality check, pronto. Pretty sure the only good thing that this place has going for it is the view. That, and the fact that there are inexplicably very few restaurants and bars along the water in Dumbo. Very poor show, Cecconi, but I'm sure you don't care at all and are full for dinner every night of the week with reservations of poor sap tourists who don't know any better. Whoever hired this hostess should rethink his/her choices and judgment. As a business woman, I cannot imagine ever, ever speaking to my clients in this manner, no matter the situation. If the table was taken, fine, she could have nicely let us know there was a mistake made and we would have completely understood. We're not maniacs, we're a nice couple in our mid-30s who earn very nice salaries. This place sucks. Save your money and time and go elsewhere.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "My fiancée and I were treated to a meal at Cecconi's and it was amazing, no holds barred. From the appetizers to the delicious cocktails, our entrees (branzino cooked perfectly and the cavatelli), and the many delicious deserts (tiramisu was my favorite and chocolate tart hers), everything was delicious. We would definitely go back and recommend Cecconi's: the food, service, and views from our outdoor seating were all great.", "author": "Ben R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "The food here is TREMENDOUS!!!!! I am baffled by why they would have only 3 stars. The only problem we had was a couple of dirty tea cups for our after lunch tea, but this was quickly rectified. I still happily give them 5 stars.  And please try the whipped ricotta appetizer....there are no words! Also, beautiful decor and view!", "author": "Caroline F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "We have lived in the neighborhood for almost three years, and we were excited when we heard Cecconi's was coming to Dumbo. On Sunday 6/10 at around 1 pm, my wife and I see the place half-filled and are like let's grab a drink on a warm summer day. We get to the entrance, and the waitress is like sorry we aren't open with a slight hint of attitude. Then she lets in the group of people that comes after us. Common sense suggests: (i) half-filled restaurant, (ii) we just opened and (iii) every person who walks in is a potential regular. Given these facts, any person would like an explanation as to why the restaurant is half-filled then they are told it's not open. I guessed that perhaps it was only open to members of \"Soho House.\" At the very least, give a pleasant explanation as to why the restaurant is closed despite having around 100 people in there. Further, don't make assumptions that because a person looks a certain way they couldn't possibly want to eat here or they don't belong. All in all, I will never spend a dime in this restaurant and will continue going to Atrium.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Being in Dumbo which is obviously baby friendly, Cecconi's is NOT baby friendly. I'm all for leaving babies at home past a certain hour, but my 2 friends and I strolled into Cecconi's on a Wednesday afternoon with our strollers around 3pm and were turned away. They claimed they \"weren't seating new parties\", but we watched 3 additional groups come and sit while we were ushered out. We offered to fold our strollers to save room, but they told us that wasn't an option. I'm a big fan of Cecconi's in LA, but this was truly upsetting and I would not recommend going if you have kids.", "author": "Dayna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "The worst - was so excited to try this out as dumbo is in SEVERE need of restaurants and unfortunately they really disappointed. Location and decor are beautiful, but that's where the compliments stop. Hostesses are beyond rude. The restaurant doesn't have its act together and the excuse of \"previews\" can only go so far - this is amateur hour. I requested an outdoor table, reiterated it when the reservation was confirmed- was instead seated inside. When I complained I was told that requests are \"just that, and are not necessarily honored \" despite there being ample availability outside. When I demanded to sit outside we were seated comfortably, but then were told we needed to move to another table. When we finished our appetizers it took an additional 40 min before receiving entrees. The food was \"eh\". I think all this would have been passable had it not been for Jasmine and Ibena's nastiness upon arrival -- the food and service I could dismiss because of previews, but their attitudes were inexcusable.  I'm\nAssuming that the staff has experience in the industry, but you wouldn't know based on the experience I had. This isn't Manhattan and it's not primarily going to attract Manhattan based people, and attitudes and shortcomings like that will not work amongst neighborhood people, perhaps it will pass when Kushner transforms the Jehovah Witness buildings into offices, but until then I can't see how it will survive on anyone other than tourists unless it really improves.", "author": "Jillian b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "Picked this place for a date night on July 29th, 2017 and it was a huge disappointment!  Right before making our way over to Cecconi's, my bf and I got engaged under the bridge.  We had a 8:30pm reservation to celebrate, but we weren't seated for almost two hours!! Seemed like all the \"regulars\" were seated before us.  When we finally got to our seat, it took while before we were even able to place our drink order.  For starters, we ordered the meatballs which were SMALL RUBBER BALLS that tasted like they were bought from Costco.  The pizza was ok, but not worth it.  For main meals, I ordered eggplant parm that was inedible and my fiance got the pasta. Terrible. Didn't even bother to order desert since we were so turned off by the initial wait and entrees. Don't waste your time here especially on one of the most exciting nights of your life.  It was a real damper.", "author": "NIcole H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Appalling service. It is a scandalous imitation of the amazing restaurant in Los Angeles. The place was dirty, it felt like a school canteen and the hostesses were so bitter they probably chew lemons.", "author": "James R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "The restaurant looked amazing and the menu was very similar to what I have experienced at other Cecconi's. I gave it one star because I arrived thinking I could eat at the bar and when I saw the \"Modified Bar Menu\" the Senior Host called it that, I asked if they could seat me (party of 1) at 6pm on Monday night when the restaurant was mostly empty, and I was informed that they were fully committed and they had no room. I asked what was modified about the bar menu but the Senior Host just pulled out a full menu to show me that the \"Modified Bar Menu \" was really just an edited version of the full menu. Anyway, I give this Cecconi's an F for poor treatment. Maybe they could learn from LA or Miami where they do it right.", "author": "Todd B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "The ambiance and food were superb!  They were so kid friendly but adults still felt the cool vibe!  The new manager from LA was so accommodating!  We could not have had a more fun outing!  Almost as good as Barano!", "author": "T W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "This place is good if you sit outside and look at the view. It is trendy and I think brooklyn people are getting mad because it is too \"corporate\" .  I liked it and thought it was fun. The ambiance is cool and the inside will be nice in the winter. The food and drinks were pretty good. I had fun.", "author": "H T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "After being promised better service and a better overall experience, my friends and I gave Cecconi's another chance and returned for dinner a few months later. The restaurant did a complete 180 from when it first opened. From start to finish, the service was terrific and everyone, from the hostess to our waitress to the manager on duty, was extremely attentive and accommodating. We tried a bunch of different appetizers and pastas, which were all truly delicious. We also sat inside this time and got to appreciate the beautiful decor and cool atmosphere. Thanks for a great evening.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "impossible to get in. the reservation line is always busy. when we walked in 3 (!) hostesses at the front desk were extremely unfriendly, took awhile just to make an eye contact and get their attention. just curt reply: we do not take any walk-ins. I asked to make a dinner  reservation a week in advance, the answer was \"you can't, we are fully booked\". not forthcoming at all. Such a great setting, and such a poor execution. Few of my friends managed to get a meal there, and all complained of very mediocre service.", "author": "Juliana P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "so disappointed, heard amazing things about this spot and been passing it all summer. it didn't deliver. the salad had the ends in it, the pieces you're supposed to remove while cutting! the \"dressing\" was all vinegar, i basically ate half an avocado for dinner. the calamari would have been good if they gave us more than a child's portion. no one asked if we wanted more drinks, quite inattentive staff. the pasta with truffles was a big draw and unfortunately, the truffles tasted like paper, the pasta was again, child's portion and we are leaving starving and confused, how is this place packed full??", "author": "Kristin-Marie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "Food is good if it comes. Service is just disinterested lazy and bad.  They basically treat everyone like a tourist.  Took 20+ minutes to order and I had to order my drink - an ice tea - 3 times.  My friends drink was wrong. The waiter disappeared and the manager took our order. The meat plate was supposed to come first before the hot food except it didn't.  I know this sounds petty but the prices are high so I expect more.  On the same visit ran into friends who also had bad service. How disappointing", "author": "Ben P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "It started with the very uninviting hostess. Prior to arriving we called and asked about reservations. We were told they do not take reservations for lunch and open at 11:30, with waterfront seating being first come first serve. When we arrived and asked how long it would be for an outdoor table we were told they were \"committed\" for reservations today and waiting was just not an option according to the smug,  brunette hostess. Her attitude was less than inviting and more so very unappreciated as multiple outside tables sat empty while we dined inside. Since I had come from the city to enjoy lunch with a friend we decided on a table with an outdoor view. Lunch was good but the menu was very limited. While they offered many vegetarian options and pride themselves in local fare the restaurant was \"sold out\" of many dishes or the chef wasn't \"happy with the tomatoes.\" Our server was wonderful! Not only was Stephanie knowledgeable and willing to offer an array of other items that were available and delicious, her knowledge of the menu was impeccable. My friend asked for his pasta without cheese and while it could have been a server error, needed to be corrected.  Unfortunately, we had to witness Stephanie being scolded by the bald (didn't get his name) manager for this mistake which made made for an uncomfortable remainder of our dining experience.  His unprofessional and male dominating, demeaning behavior toward Stephanie was sadly inappropriate. Needless to say, I will not be recommending this place to friends, although if anyone does go, I hope Stephanie treats you as well as she did us.", "author": "Kara L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "I went here  Wed night during christmas week. I'd been waiting to eat here for awhile since other times it was too crowded and was only able to have drinks at the bar.  I made the reservation 3 weeks in advance for my birthday dinner. It was a very cold night so it wasn't too busy. We were a party of 9. Our waiter was good.  Told us about the 2 specials they had that evening. One being filet mignon. I said that's what I want.  Another friend ordered it as well. Hers being med rare mine Med. Filet came and I couldn't cut into mine.  Waiter brought me another streak knife. Wouldn't cut. He actually asked me to turn it over to try and cut it to no avail.  I even used my friends knife that was cutting hers fine. He said let me speak to the manager. The manager came to me and said that he cut the meat in the back, it was fine and that maybe I should try to have it prepared a diff temp.  At this point I said your waiter saw me try to cut into it and shouldn't my friends be harder to cut and that I should have my steak prepared the way I like it. I told him please bring me another steak.  Nothing about let me make this up to you. The waiter said I'll buy you a drink while you wait. My steak came after everyone was finished with there meals. It was ok nothing special.  Some birthday dinner!! Everyone at my table had dessert and coffee. At least offer me a dessert. When the bill came just the drink was off.  Like I said waiter was good. Great views. Lousy managers. I say mangers because another manager  came to speak to another friend about it and he told him just get her dinner!! It's her birthday! Go to the Atrium a couple of blocks away... awesome food, service outstanding managers!! I'm sorry I didn't go there", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "Beautiful restaurant in a great location. Absolutely no point in making a reservation. The 2 star rating was due to the hostess, Chanel, who was incredibly rude and condescending. The other two hostesses \u0026 manager managed to seat us (just a party of 2) 45 mins later (after they attended to multiple walk ins).", "author": "Amy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "did a pizza making class here - not only totally delicious, the staff was extraordinary and the place is charming.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-15", "description": "A friend of mine wanted to meet at Cecconi's for dinner. I called on Wednesday to make a reservation for Friday. Was told that there were no tables available. I was flexible on the time but no, no tables at 6, 7 or 8. So we went around 6 on Friday, and the restaurant was full of empty tables. When we left, it was still full of empty tables. What's up with that? The food could be better. Cauliflower with anchovies- the taste was way off.  Did the chef even taste that? Calamari was too spicy and kind of a small serving. The Agnolotti with truffles was too al dente, not flavorful enough and kind of smallish. Tiramisu was decent. Decor and lighting is totally fab. Had higher expectations. Food up the hill at Noodle Pudding 10 times better and half the price. Wanted to love it because the space is so beautiful.", "author": "Gerry D."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}