{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I really enjoyed this restaurant. Great ambiance and view if you can snag an outside table. The drinks were strong and food was very good. The bread and olive oil they serve is not notch. We split the eggplant Parmesan and porchetta, artichoke, olives, mushroom pizza. Delish. Highly recommend.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Honestly the previous reviews of this place had me a little hesitant, but the views and location can't be beat.  I ended up being pleasantly surprised.  I came in with a party of 6 and the entire table received good service and the food and atmosphere were quite lovely.  The waiters were attentive and the staff was really friendly.  I had the spaghetti with lobster and sampled several shared appetizers, everything was tasty.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "My fiancé and I had an amazing time!! The staff was super nice and friendly !! Our waiter Allen was very informative and always made us feel welcome and comfortable, he answered all our questions and led us to make the right food selection which was a ten out of ten!! Sergio was also very helpful!! When we didn't know which wine to pick he gave us a very detailed description of each of the wines listed on their menu! He was also super friendly!! All and all we had a great time and will definitely be back again :)", "author": "Rosalind L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "We were a party of 8 people for dinner. The food was good, appetizers were a bit small, the main course was tasty, but at the same time, the ribeye had 1/4 of fat. The worst part was the service was very slow. They need to hire more wait staff and more cooks. We got pretty tired of waiting, and asked for dessert to go.", "author": "Clayton T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Cocktails fabulous, food fabulous and a killer view.  This place is so elegant, no detail too small left unconsidered.  I can't wait to come back here!", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "DO NOT WAIST YOUR TIME AND MONEY!\n\nI seldom  write reviews, especially negative ones. But, after dining  at Cecconi's last Saturday night, I feel that I can not be silent. Not being a stranger to the New York food industry, I was looking forward to an opportunity to dine at this new Dumbo establishment. \nUnfortunately, the only good thing I can say is that the views are fantastic, but  you only can enjoy them if your table is outside or if you are seated next to the windows. The service and the food do not deserve any stars, the decor is outdated for all but those who are nostalgic for an old-fashioned setting. \nWe ordered a variety of appetizers (nothing remarkable), a pizza (very ordinary), one pasta dish (nothing special, very heavy on sauce) and a risotto, which came served on a saucer, had no taste whatsoever and the rice was not cooked through. And the bread was stale.\nEven with everybody's expectations that prices in locations like this one will be higher than usual, the cost of this meal leaves you appalled. \nWhen this city has so many fantastic, innovative places to eat, Cecconi's feels like a throwback in time.\nI am guessing that the owners simply cater to the tourist crowd, who will not pass up an opportunity to enjoy a gorgeous view of lower Manhattan at night.  I can not imagine, however, that anyone will go there twice after experiencing such a disaster.\nWhat a disappointment for New York!", "author": "Helen K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "My partner and I called numerous to make a reservation over the phone. Unfortunately no one had answered the phone neither of the times. We have been wanting to go to the restaurant due to its great great food and environment. \nSince we couldn't get a reservation because no one answered the phone we decided to go to the restaurant and wait for the table because we were eager to eat there. \nWhen we arrived at the restaurant, the Maitre D turned us away because they told us they would not be taking down anymore names  because they very busy and had other customers waiting for a table. At that moment I decided it would be more effective if I spend my money at another comparable great restaurant. \nA restaurant with great service never turn down and make the decision for the customer who's willing spend upwards of 100.00 or more on great food and drinks. All the Maitre D needed to do was give me an estimated time of what the wait could have been and let my parter and I decide if we are able to wait for table. Your business (being part of the restaurant industry) has to main goals; customer service, and amazing food. You failed at providing an amazing customer service experience and you also failed at providing great food because I was turned away. I will share this experience  with my friends and family and most likely not revisit the restaurant again.", "author": "Stuart D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "I really wanted to love this new restaurant in my neighborhood.  The first time I came with some friends from out of town, we waited 2.5 hours. I was OK with that knowing that it was a new place and it was to be expected. The hostess was not very friendly when our table finally became available and overall the service was quite slow. When the waiter brought the salmon entrée out, the entire piece of salmon slid off the plate on to the floor.    They were barely apologetic about it but did quickly get another one off the line (probably someone else's plate).  Today was brunch. Having made reservations, we were seated promptly. The views from outside are great and I suppose they will do well just because of location.  The appetizers were quick but the entrée was really delayed. About 30 minutes with nothing on the table. The manager even came to apologize. I ordered the hanger steak and it was TINY!!! For $24!!! It was only 5 small slices. We ordered the lobster spaghetti. It literally came with 2 small chunks of lobster and the shell of the tail for $34!!!!  Although tasty that is completely insane!  I wish I took a picture. I asked the waiter and he said he was going to speak with the kitchen. He returns telling me that they apologize and will not charge me but I could pick something else. Honestly I was just over waiting for so long and decided to just call it. They come from such a \"brand\" and will do well just due to tourism and location. I don't mind high prices, it's just a shame that their service, and quality are not up to par...", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "I went there yesterday and everything went wrong since the minute we arrived in the restaurant. First we waited an hour and a half to get our table even though we booked a week in advance and they told us we would only have to wait 20 min. The food is disappointing compared to the other Ceccioni's locations. The service is unprofessional, the staff extremely rude and kept making mistakes with our order one after the others during the entire dinner. When at the end of the dinner we asked to talk to Manager to tell him (very nicely) that some things went wrong in order for them to fix it for the next clients he seemed so annoyed and showed so much attitude. I work in hospitality myself and I've never experienced such a rude way to talk to clients before. We definitely won't come back.", "author": "Marie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Impeccable food, impeccable service, stunning views, amazing design and vibe. Really classing up the Brooklyn water front like few could. Cannot wait to make it back!", "author": "Terremoto C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Amazing location beautiful view. The service needs a lot of improvement but I give 5 stars because the food is incredible! The crudo is to die for. Look forward to my next visit!", "author": "Carlotta P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "While I haven't even eaten here yet I am already put off by the service.  I made a reservation a month out for 6 people at 8:30 for next week.  I called last night to ask if we could change the time to 9 pm.  The person who I spoke to said that she needed a password to access the system and so could not tell us whether it would be possible to change.  She said she could only put a note accompanying our reservation with my ask of 9pm, and would confirm the day before our dinner whether they could accommodate us. I have never encountered such a ridiculous and inflexible reservation system and am considering canceling entirely and going somewhere else that can actually take a reservation AND modify it, and isn't limited to a 24hour window to adjust. People need to be able to change their plans based on restaurant availability, and all I needed to know was whether or not a table for my party was or wasn't available. Based on other reviews here, I have no confidence that the service if we do actually go will be any better than what I have experienced already.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "beautiful scenery, food is excellent! definitely a go to in BK.", "author": "Alissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Food is delicious and made to perfection although still in preview. Can t wait to try the real menu! The decor  and location are impressive. This is my new favorite spot! I don t understand the long reviews written in this page. Who has time to that in this city???Looks like some one got paid to write a never ending story. What is important to me is food, service and decor as a true New Yorker and definitely as an authentic reviewer this place is a 5 stars one.", "author": "J J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "went here for dinner last night and omg it was phenomenal from the view of the manhattan bridge to the food. we got the honey ricotta apetizer which got my taste buds feeling all sorts of goodness . also, got the buratta salad which was just as yummy and the tuna tar tar based on another yelp review . the tuna tar tar was disapointing . we also got the branzino with a side of squash with mint which we enjoyed . cant wait to come back .", "author": "Riva G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "This was the third time I had dinner at this restaurant and it will be my last.  We first ate there in August with friends and was told they didn't have our reservation.  Although they did accommodate us, it was really frustrating to be standing and waiting until someone made a decision to seat us.  The food was just ok.  So we decided to take out of town friends there last Sunday because after all you can't beat the location and view.  However, the food was terrible. We ordered the calamari for appetizer and it was only warm and really chewy.  My friend ordered the huge veal chop which by the way came with nothing but a lemon wedge.  It was really dry and tasteless, and $52 which was ridiculous.  Her husband had a special pasta with butter and sage and was so overpowering with butter he couldn't eat it.  Me and my husband had Bronzino and rigatoni bolognese which came Luke warm.  Feeling frustrated we vowed not to go back.  Friends convinced us to give it another try last night and we did.  Well, our first instincts were correct.  The food was horrible.  I decided to have pizza instead of the dinners and it was the worst.  It was Luke warm, the mozzarella was really dry, over cooked and the basil was wilted and dry.  I can get better pizza on any corner in Brooklyn.  Everyone was very disappointed with the service and the food.  The only thing this restaurant has going for it is ambiance and view.  Would only stop in for a drink.  Very disappointed!!!!", "author": "Patricia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-19", "description": "Went during the week mid afternoon and was able to get an outside table with no wait. The day was perfect to be outside and this is a major plus of this restaurant as there are few views to match. The food was delicious and both well prepared and of a decent portion size to leave you well satisfied. Fish ordered was cooked properly moist inside and crisp skin outside, the veal/tuna sauce combo was done to perfection and is a genuine Italian dish not found in many NY establishments. A few elements were not up to speed ergo the three stars. Service was professional and prompt but  with a demeanor that was not particularly welcoming. A part of a good meal is overall atmosphere which includes a pleasant vibe from the server. A nod to the bus boys who did have a pleasant attitude and a few smiles to share. The other small glitch was the app was served at the same time as the main dishes, not a major issue as everything tasted so good but apps are generally served to whet the appetite and normally get served first unless otherwise requested.  While we ate outside, the interior is equally inviting and in colder weather would definitely be a comfortable place to dine.   Well worth a visit if youre in the DUMBO area.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "The tuna tartare was barely OK and very bland. The drinks were bad. The pasta was not tasty and the filet steak tasted like it was thrown around the floor onto a wet soggy floor. In addition, this restaurant had a MAJOR sewage flood disaster where they shut down the restrooms for almost 2.5 hours and my wife and our friends were not able to use it. Then the Managers forced some thin young girls working there to mop the floors and bathrooms instead of the guys rolling up their sleeves and doing the job themselves. The restaurant reeked of toilet water and we were totally disgusted. We called the manager over to complain of the foul smell and inquired where our girls can use a bathroom and they told us they need to go outside the restaurant and walk 4 blocks to the nearest restrooms which were all CLOSED! This place is poorly mismanaged and they did not even have the courtesy of making our drinks complimentary due to the horrible experience all of us had that night. The ONLY reason I gave this place a 1 star review is due to the water view. Otherwise, do not waste your time and your $$$$$.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-29", "description": "I live in dumbo and have been here twice.   I was excited to have a new restaurant in the neighborhood but I have to say it disappoints.  The first time I called to make a reservation but they were booked.  I asked if they accept walk-ins and they said yes.  We went down a few minutes later and were told they weren't taking walk-ins that night.   We asked if we could have dinner at the bar and they said yes (they should have offered instead of just saying no walkins).  The drinks were good and so was the carpaccio and pizza.  The calamari wasn't good.  The space is gorgeous and we knew they were working out kinks so we were excited to go back.   Went back the next weekend and sat at the bar.  This time the menu was very limited and the food was mediocre.  The meatballs tasted like lemon and the tuna tasted off.  To top it off there was trash all over the bathroom floor.  Hope things improve because it would be great to have another regular spot in the neighborhood.", "author": "Sammie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "Unfortunately, the service is so shockingly bad that it fully detracts from the great location and mostly tasty food. We were sat almost an hour after our reservation time and the hostess kept saying she'd go outside to check how close our table was to being ready and come find us to give an update. She never once did that and I kept having to go back up to the hostess stand to try and figure out what was going on. There was very little apology for the inconvenience and then things only got worse with our rude and inattentive waiter. And the time between starters and main course was over 30 minutes. I'm just surprised that given how many restaurants Cecconi's have under their belt that they didn't send their best and most experienced staff to get their service up and running smoothly at their latest outpost. It actually became laughable that the service was so frustrating and incompetent. Very disappointing.", "author": "DM C."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}