{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "Came for brunch. Beautiful space, great views if you're sitting outside. Service was solid. The food however was below average. Our simple dish of eggs were both extremely overcooked. Meatball app was average w a very sweet sauce. We simply could have done better by going to westville around the corner or walking to Jack The Horse in Brooklyn Heights. \n\nMaybe good for a cocktail to appreciate the space, but I call tourist trap.", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "The only reason to eat here is for the outside tables to people watch and enjoy the views of the river and bridges. The food is fine but nothing exciting. The octopus appetizer was the best thing out of 6 dishes we ordered. The host at the door (guy with a goatee) was pretty rude and snobbish for no reason. Our party was complete 15 min after our reserved time and when we asked to be seated, we got unnecessary attitude that annoyed all of us. No hospitality felt while checking in. However, the wait staff was more than friendly after we sat down so that made up for the poor experience in the beginning. Also, don't bother with the vegan chocolate cake...not good.", "author": "Sue Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "After a visit to the Brooklyn Historical Society museum in DUMBO, a friend and I stopped into Cecconi's for a drink and some small bites. We were in between the lunch and dinner meals, so they were only seating people in the bar, which worked perfectly for us. It would have been nice to eat on the outdoor patio, but the bar was quite lovely.\n\nThe vibe in the bar is just pure luxury and glamour. It is decorated with plush turquoise chairs, big exotic plants, and beautiful chandeliers. The bartenders wear crisp white jackets. And the old warehouse structure adds a little bit of a speakeasy feel to the place. \n\nWe had some happy hour cocktails with very reasonable prices. And we also tried the Fried Calamari and Buffalo Mozzarella Pizza. Everything was delicious And the service was actually quite good! I can't wait to go back!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Ambiance is great much like the West Hollywood location. There is definitely a buzz in the air at the bar. We enjoyed our food too. We did have a bit of a wait but overall, we enjoyed the experience.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Loved this restaurant! Feel like this is a hidden gem inside the market, the view is beautiful and food was delicious. My girls and I went for a birthday celebration on a Sunday night and there was no wait and service was great. Definitely recommend the Pizza with black truffle and goat cheese it was delicious! All the other entrees and dessert were great also!", "author": "Pri P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Yeah i gotta make that 4 stars.\nThe food was plain very good. Staff super friendly and a killer view. I had the avocado  toast with the egg florentine on spinach. Just pretty awesome. The runny egg on the spinach is perfect. The avocado  thick rich and well mixed with things. \nIt only lasted a bit long before it came. Also the coffee and deserts were timed to far from each other timewise.\nGuys dont u fricking get it that i want my icecream with a sip of coffee damnit! Whats the point of bringing that coffee after all is done... \nAlso they let people wait and make it difficult to reserve. Which doesnt make sense cuz there was this awesome table empty and empty.... i know its new york. The reservation mobster technique does not have to make sense...you are not an A lister so you just wait... i get it", "author": "Richard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "All in all... I would definitely recommend this to everyone. Food was delicious, drinks were amazing. We were late for our reservation and they accommodated us with no hesitation. Huge O shaped bar, some seating with velvet lounge sofas, amazing Manhattan Bridge + Brooklyn Bridge views.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Best spot in the neighborhood. The food is good, the atmosphere is spectacular, and the view is amazing.\n\nThe lobster spaghetti is my absolute favorite as is their wine collection. Didn't love the lettuce bib salad.\n\nIf you check in on Yelp you get a free mini pizza, which is enough for two people in my opinion.\n\nThis is the place to be in dumbo.\n\nBoris is THe BeST bartender.", "author": "Grace K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I had a reservation and there was barely a 10 minute wait for an outside table.  The view was fantastic. We went there towards the end of brunch around 4pm on a Sunday right after walking the Brooklyn Bridge. The food was pretty good we shared the bresaola, burrata \u0026 wild mushroom pizza,  it was good but the crust was a little burnt on one side. The burrata was very nice on the pizza. We also shared the eggplant parmigiana, it was a nice piece layered with thick pieces of breaded and fried eggplant and mozzarella with a nice thick tomato sauce. Overall it tasted nice but the eggplant was a little chewy and rubbery and had more seeds than I like. I had a few cocktails and they were ok. Overall I'm pretty happy with my experience but I will probably only go back with out of town friends who visit me in Brooklyn. It was a little more pricey than my usual brunch spot but it was worth it just for the experience.", "author": "Bklynzizi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "A couple of friends and I wanted to come here on a Thursday afterwork. I called and they said they had no reservations available but tables around the bar didn't require that. Ok. We arrived around 6 pm. We were able to get a table for 3. The venue has a great ambiance. The original arches from the warehouses with chandeliers. I would say It's a great date spot. We arrived on time for happy hour. There's only three drinks for happy\nHour and three price range appetizers $4,7,9!) we ordered the pizza, meatballs and calamari. The food here is not traditional Italian. The calamari had a kick (spicy) which we liked. The meatballs were small and had like a lemon zest after taste? My friend liked them I've had better meatballs. The pizza was ok for what it was. For dinner I got the rigatoni bolognese and my friend ordered the agnolotti with truffle. The serving size are not large. They are the serving size we are suppose to eat lol so if u have a big appetite, make sure u get apps\nAlong with your entrees. Both dishes were good but the agnolotti with truffle was amazingly tasty and I would order that next time. \nThe specialty drink at happy hour that I got\nWas the mixed berry americano. It wasn't really for me. It was refreshing but had like a spicy mustard after taste. After that I just stuck to Sauvignon blanc lol \nWhile we were dressed for the place there were some ppl seated near us very casually dressed. Bc it's a touristy area it will be mixed. But the view of the manhattan bridge and decor as a New Yorker, I couldn't imagine rolling up in there with shorts and tee. Just saying.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "The food here was very tasty. We don't usually eat Italian because we cook Italian, but we really wanted to eat near the Brooklyn Bridge. We were not disappointed, the food was excellent.  It was s little pricey for the portion size, but we are talking New York prices. If you want a great view of the bridge and a nice dinner I would recommend this restaurant.", "author": "Janice R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "What used to be a sort of creepy and decrepit warehouse space has been transformed into a modern business park with restaurants and an exotic car museum.  Cecconi's is one of the new tenants and is fitting right in with the high-rent neighborhood.\n\nThe decor here, as I would describe it, 1960's Miami chique - with big ol' leafy plants; deep, blue velvet chairs and benches; checked floors and chandeliered ceilings; and the staff in starched shirts and jackets.  Don't forget the waterfront view. Very impressive, if you're looking to impress.  \n\nThe food here is a bit more humble.  But only a bit.  While it's pizza and eggplant parm, it's elevated yet familiar; rich yet approachable.  I recommend the ceviches which are made tableside.  The prices are a bit surprising, but think of the ambiance and the views!  That don't come for free.", "author": "Margaret T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "Empty glass of wine for 10 minutes - none of the 5 bartenders behind the bar offered a refill\n\nEmpty glass of water for 20 minutes - 5 bartenders busy with restocking / prepping for dinner service, completely ignoring me. Unacceptable.\n\nPizza - very good\nCocktail list looking promising\nGood looking restaurant\n\nwill return for more food and drinks - until then - one star", "author": "Ciprian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "I have previously visited two other Cecconi's locations, both West Hollywood \u0026 London, and now since the Dumbo location has finally opened at long last and is located practically in my back yard, I have already visited three times. Twice I sat at the bar and ate, and this past Monday I had made a reservations to take some very discerning foodie friends who were visiting from out of town. Our reservations was for 6:15 and we had the option to wait for a table on the terrace, but due to the mugginess, we preferred to be seated in the main dining room. That being said, our table still had an impressive view of the Brooklyn Bridge and the East River. \n\nOur server Jennifer was professional, efficient, knowledge and warm. We were also visited by a couple of the managers Nikki and Joy, who stopped by to see how we were enjoying everything. \n\nAs with both West Hollywood and London, the food was amazing. Some of the dishes I have tried and loved since Cecconi's Dumbo opened last month are as follows: the Calamari, Salmon, Roast Potatoes,Tuna Tartare, Lobster Spaghetti, Buffalo Mozzarella Pizza, Whipped Ricotta with Truffle Honey, Gianduja Profiteroles, Tiramisu. All of it full of flavor, note* I highly recommend trying the Whipped Ricotta, so creamy, a little sweet, a little salty. SO tasty! Oh, and the olive oil. I've never had better!  \n\nAnd for drinks I have enjoyed a classic New York Sour, and lots of wine (Cheers to the wine manager for the wine selection; a nice variety and at reasonable prices). I'm a huge fan of the Nero d'Avola...and I enjoyed a very strong Matcha Latte today, it was served with some pistachio biscotti which hit the spot, and gave me a little jolt to boot!\n\nI was pleased to learn about their happy hour which is from 4-7 from Tuesday to Friday. Not too shabby that one can enjoy a $7 glass of wine at the bar and enjoy the view and appreciate the design aesthetic of Cecconi's! \n\nI have already booked another reservation for August for a special occasion. That's my one bit of advice, if I should have any.  Definitely plan in advance for a dinner visit.", "author": "Jolene S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Hostesses are inept, dismissive and EXTREMELY rude - namely girls named \"Alex\" and \"Juju\" - unacceptable for a place of this caliber, which shouldn't rest on its laurels just because it has a view.  \n\nShowed up for an 11:45pm reservation, not sat until 12:51pm after having to walk up and check in with them 4 times during which they couldn't have shown more disinterest and unconcern.  \n\nI totally get it - this place is busy - but the hostesses could have a little more soul and warmth in their eyes, and hospitality - you are a restaurant charging a premium after all.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Wow! After seeing what happened to the couple ahead of me I should have followed my instinct. I saw them waiting and they gave their table away. We waited by the bar and ended up leaving. Bartender was nice. Would never come here. Hostess were extremely rude.", "author": "Nita J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Group of 4 of us tried this on a recommendation. Showed up without a reservation and expected a wait, so not surprised it was 30-40 minutes. Put our name in, provided a number for texting, and went to the bar for a drink. After round 2, realized it had been over an hour. Inquired about current status and was told they were setting up our table and it would be no more than 5 minutes. Ordered round 3 intending to move to the table...finished round 3 and after a total of 2 hours waiting walked out. They never texted us and we left with a nearly $200 tab.", "author": "Hunter W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "This place relies so much on the view that they forget about everything else. \n\nWe went here on a Sunday night at 6:00 pm they told us one hour wait for outside seating. When we checked in at 45 minutes we almost got yelled at. At 1:00 they told us 15-20 minutes at 1:20 minutes they said outside is full they can offer us inside. Only after some solid yelling did they all the sudden realize that they had 6 empty tables outside (really 6). \n\nFood was good. Service was lousy. We ordered everything together the appetizers came the pizza never came. When I asked they told me it's coming. When I asked again they said we never ordered pizza but they would bring in 5 minutes. 25 minutes later pizza still didn't come meanwhile all the other food and drinks where done. When I asked the waiter to cancel the pizza it felt like I did him a favor. \n\nWow really bad.", "author": "Ahron K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "I think it was the first time I've ever had undercooked and overcooked pasta in the same bowl. My friend had the same experience with a different dish. Hands down the worst $24 bowl of badly cooked spaghetti I've ever had. Beautiful views, terrible pasta. Oh, the pizza was good. Service lackluster at best.", "author": "Megan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Just enjoying a laid back, average Sunday with my best friend Courtney cause this is what we do leisurely", "author": "Katie H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}