{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "Do not recommend. Try Vinegar Hill House (even VHHFoods) or Atrium instead. (Dumbo resident of 4 years)\n\nWe made a reservation 1 week in advance and requested outdoor seating, fully understanding that it's first come first serve. When we arrived there were 4 patio tables available, two of which would accommodate two but we were told they could not seat us there. Upon seating us inside the waitress told us, and I quote \"it's so gorgeous outside right now, I guess you have to be in here, but at least you can see the window\". We promptly left.  Currently having dinner on the VHH Patio, it's lovely.", "author": "Jess K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-26", "description": "Maybe my experience at Cecconis was not\nThat great because it was fashion week and it was filled with models including Cindy Crawford and her daughter but our experience was terrible. We went for a friend's bday brunch and left very disappointed. Our waiter/waitress changed three times and no where to be found. Our apps came\nout  with our meal and two of the meals were cold!!! I'm guessing everything was sitting there a while because no one knew who our waiter or waitress was. The view is beautiful but I would\nOnly return for a drink and the view definitely not for dining.", "author": "Pamela T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "I hate to rag on a new joint, but these guys are not getting it done.  \n1) Service is really bad.  They have so many people running around, but their attentiveness is awful.  Getting a manager or waiter's attention was really difficult, the tables on either side of us were going through the same issues.  These issues are, on their own, are not a big deal, but as a whole they add up to a mediocre at best experience. \n- With our meatball app (best dish) we were asked if we wanted bread.  It never came, then we asked for it again...roughly about 10 minutes after the waiter originally offered it to us.\n- We had 45 minutes between our apps and entree.  This fact sucks, but its worse because we were never asked if we wanted another drink (my cucumber drink was good).  I had to flag down our server, which is hard because they aren't looking at us (the customers), they are looking over us.  We had a 30min period where we were drinking nothing and we were looking to get boozy.  After getting the wine order in, we waited 10mins to check on it and the waiter then goes to pick it up, he was learning how to replace tablecloths via another manager.  Then I flagged down our server again for a glass of drink and the same thing happens, 10mins passes and I have to ask where my beer is. \n\n-I get this spot is new, but it has multiple locations around the world and a great reputation.  Where is the training and management?  It didn't feel like the servers or managers \n\n2) Food was very weak.  Meatball app was the top item of the night, soft texture and satisfying tomato sauce.  This is not an endorsement of the wonderful meatballs, it is an indictment on everything else. \n-Ragu pasta dish, this came 45mins after we were done with our app.  Pasta (papradelle I think) tasted fresh with the right texture, but was very bland.  I don't think it was cooked in salted water, nor was is tossed in with the ragu.  It tasted like nothing.  The ragu itself was very meaty, which I liked (not my wife), but it was just not cooked enough.  The meat didn't fall apart, it was like under-cooked brisket. Flavor was fine, texture was far from satisfactory.  Lastly, the waiter said this dish came with ricotta swirled in, there was no ricotta.  We were not going to point this out (flag the waiter down again? Not worth the effort.) and wait another 45mins for another dish.\n-Salmon was cooked fine, seasoned well.  There was no sauce to make it anything more than just a piece o salmon. Grilled asparagus were perfectly prepared with a great salty char.\n-Fried zucchini was way too battered.  It was on the salty side, but that's normal in my opinion. The batter simply outweighed the zucchini and just felt like you were eating fried batter, which is good for about 5 bites then you realize you are eating fried batter. \n-Pounded veal chop looked awesome, people around us had it and it looked great and sounded like people others were happy with it. \n\n3) Design is really weak.  We sat in the area to the right most section of the restaurant near the open views of the water.  Tables are close together, which is exacerbated by the two columns that block the abundance of waiters from flowing freely through the restaurant. The waiters and sometimes the manager do these table side salads, which is a nice idea, but this 'service' further congests the area, the table they wheel around for this is 5ft x 2ft maybe.  Also, when our waiter was making salads, there is no chance of getting his attention, nor are the manager or the other waiters jumping in to support his tables.  This is such an odd thing because there are so many people working.  \n\nThis is long winded and I am not comfortable with being so critical, but this place aint cheap.  Hopefully changes can be made, location and the look of the restaurant give it great potential.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Just back from Cecconi's and had their 4 to 7 happy hour\nspecial menu\n.  A return trip and everything was delicious.  Andre and the bartenders gave us first class service\n\nLooking forward to coming back.", "author": "laura z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "Awful service. Had reservations for 8:45 and arrived at 8:40. Am writing this review from bar at 9:28 and still waiting for my table. Was told when I checked in that they were \"making sure my table was ready.\" Guess it was a very messy table", "author": "Ando R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "The best! We tried only pizza, but it was delicious! Excellent view, district and food! Come back soon)", "author": "Marina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Great view on the Manhattan bridge, from Brooklyn. If not too cold take the outside table. Attentive service, and superb food. The chicken salsa verde is unbelievable, a subtle fennel taste and a delicius gravy with onions make a great combination. I was in a work trip but definitley will go back with family and friends.", "author": "Judith F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I decided to give them another chance and they came through with flying colors. The food was lovely and the service was great. Way to turn it around, guys!", "author": "Miller S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "Food good - but awful awful service. Our waiter went missing for 90% of the evening. He brought out our mains with our starters. Our credit card went missing once we gave it in for the bill.... they ran out of wine after one bottle. They brought the wrong side dishes out. \n\nOur waiter tried to claim they were in 'preview week' but that's no excuse - there are 3 other of these restaurants that are fantastic (london, Miami and LA) - this was sub par and not worth the money until they sort out the service. Should be better for the brand and money it is. \n\nGreat setting.", "author": "Louise H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "If you like a rude hostess stand, then this is the place for you. Can't rate the food as we did not get past the rude, snooty hostess.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "Bad service. Decent food. Food took 1 hour to arrive. We complained with the manager. The manager asked our waiter and we could see him shrugging his shoulders and pointing to the kitchen. Not caring at all. Also we were told that the place was fully booked, but we saw empty tables for the 2 hours that we were there. I saw the hostesses turn away at least 10 potential customers with 1 hour or 1:30 hour waits, but when one well-dressed good-looking family showed-up without a reservation, they seated them in 5 mins. Pretentious restaurants are out of place in Dumbo.\n\nAvoid this place. Go to Vinegar Hill house next door, instead.", "author": "Eusebio P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "Not the best service. Brought our pizza before our salads. Then ordered salmon and chicken for our salads and the protein arrived 10 min after the salad. Plus the order was wrong. \n\nWould be great if they had a single server designated to your table but instead they have a bunch of servers but no one knows all of the details for the table.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "Revisited on 6/26 \"Happy Hour\". Beautiful summer day in NYC but bar is way too dark. Bar menu fine print says that \"VAT\" is already included in bill along with 12.5% \"discretionary\" service charge ( whose discretion, management or customer?). Although bill was one that provided no detail, only lump sum $52 for 4 happy hour drinks,  I was told discretionary tip was not included. It is this inattention to detail that makes this new Dumbo location a MISS on any trip to Dumbo. AlMar and Atrium beat the hell out of this expensive mistake. As Trump would say, \"so sad\".", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Let me say that I was extremely excited to try this new addition to the DUMBO dining scene.  The restaurant is in a gorgeous historic warehouse on the Brooklyn waterfront with breathtaking views of the East River and bridges.  The restaurant itself is also beautifully designed.  Based on the presentation alone, I expected a fine dining experience.\n\nI had a reservation for dinner.  I arrived a couple of minutes early and checked in with the hostess.  The entryway was extremely crowded.  The hostess asked me to take a seat while my table was being prepared.  I ended up sitting in the entryway for close to 25 minutes!  \n\nDuring the time I was waiting, 15 to 20 inquiries were made by various parties (many appeared to be tourists) about the wait time for a table.  The hostess told each that the wait was between 2 to 2.5 hours for a table inside and about 3.5 hours for the patio.  She did not put anyone on a wait list and never took any phone numbers down just in case any tables opened up.  \n\nThen, several walk-ins. who apparently knew the hostess, entered -- with no reservation.  They were seated promptly without having to wait.  This rubbed me the wrong way, so I approached the hostess.  After speaking up, the hostess seated my party next.\n\nGiven how the hostess was turning away 15 to 20 parties during my 25 minutes in the entryway, I expected the restaurant to be packed.  As I walked into the main dining room, I was shocked to see as much as one-third of the main dining room and  another section of the restaurant empty!\n\nThe food and wait staff were mediocre, but I'm not going to be back unless this restaurant changes the way the hostess/front of the house operates.  No one wants to be treated like a second-class citizen when they are paying $150+ per person to dine at your establishment.", "author": "Cassis S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "I wanted to bring my Girlfriend here on a Date so I called the place three times no one answered. I drove from Astoria Queens about 50 minutes with traffic and when I entered the place. The waiting time was two and a half hours so I asked to sit outside they told me it's not available while there was two guys sitting there. Horrible experience and the hostesses were unprofessional. If you want to waste your time and have a horrible experience this is the place to be. If I could give them less than one star I would.", "author": "Juliano H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "Do NOT eat here. I thought that most of the bad reviews were from people who didn't have a chance to get seated. However today I was a victim myself. \nWhile the view is great the restaurant doesn't warrant a visit. \n\nNot everything was available (pizza oven was out of service and tomatoes not ripe..) but me and my group ordered pretty much everything off the menu and were left hungry and unsatisfied.\n\nEverything was sooo bland. As a starter we had the charcuterie, tuna tartare, eggplant parmigiana, ricotta toast and a salad - the flavors were extremely unbalanced and portions very small.\nThen we had the Bolognese, lobster spaghetti and cavatelli and although we were hungry (did I mention the awful bread? tiny basket and super dry bread...) we couldn't finish our main dishes because it was simply not edible.\n\nI'm not sure what the hype is. If you need to cross it off your bucket list just go for a cocktail and enjoy the view in the summer.\n\nI feel sorry for the locals having to give up so much real estate for a place that is that awful.", "author": "Cinesina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-10", "description": "Not worth the pricey menu for the poor service that you get. We saw the place and thought it had a wonderful view of Manhattan so we decided to give it a try for brunch on Sunday. Really disappointing, not only we made a reservation and still had to wait for a table, but the waiter was missing in action a lot, food came at different times and the plate for one of us took almost an hour.... on top of everything we had a lot of little mosquitos all over us... in summary not worth the price, a wonderful location and place waisted, will try other options for that view, not coming back!", "author": "Maria O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "The place was nice and the food and drinks were good, but the service was truly awful. It baffles me that so much would be spent on the fit out and rent but not invest in staff. They seemed overworked and not a single item was delivered in an acceptable timeframe and we had to follow up on all requests, including getting our credit cards back. There must be other businesses nearby that don't treat their customers as an inconvenience.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "Well, the reviews are mostly true. Absolutely gorgeous location and interior, but stuck-up hostesses and our server was incredibly condescending and arrogant. He was also rude to the woman who was refilling our water and clearing our plates (we wish she could have been our server). The food was highly okay but nothing blew us away. I'm curious to see how this location pans-out.", "author": "Cally A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "After posting a negative review about Cecconis, I went back to give it one more shot and they proved me wrong.\n\nWe waited 10 minutes for an outdoor table which was fine. We were put in between two bushes so we had a perfect view of the bridge.\n\nThe food was absolutely delicious and the service was on point as well. Shout out to the Italian manager and Mika who served us. Thank you for the wonderful experience. I will definitely be back now!", "author": "Jay K."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}