{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Rarely do I find a place in downtown Brooklyn that makes me feel like I'm in the 1920's or like another Yelper put it \"a member of a members only club\"!that really isn't a club at all. I was on my lunch break and on a whim decided to try a dish and a drink at Cecconi's.-boy am I glad I did! This place is super old school Hollywood glam with the waiters in white suits and black bow ties. I ordered a glass of prosecco and a tuna tartar. The waitstaff was quick and friendly and even honored my request to bring me my order as quickly as possible. The tuna tartar was first presented to me and the waiter rattled off everything that was in it and asked if I was ok with the ingredients. When I said yes, he promptly made my dish tableside. The decor and even the glassware had my jaw on the floor. I wish I had more time here but unfortunately I had to go back to work. I'll certainly be back but next time with a date!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "This scenic restaurant is going to have to get its act together if it's going to bring people back. Came here on a Saturday night and waited legitimately an hour after my reservation to be seated, as seemed to be the case with everyone hurdled by the hostess' desk. Every time we would check on our table, we were blatantly lied to about how much longer it would be. This kind of dampers your spirit once you actually do get seated. However, the food makes up for it- everything here is great and there are tons of vegetarian options. Got a regular pizza and it was delicious. I hear the truffle pizza is amazing and will definitely try that if I go back. Pastas are also really good. Be sure to get the truffle polenta side- it is next level amazing, topped with black truffles, and melts in your mouth. Service was lacking and definitely needs a step up at this kind of restaurant. There were times we couldn't even find our waiter and we were left pouring our own wine. Would love to go back but will give it some time. Hopefully the service will improve.", "author": "Cherie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "We truly enjoyed out visit to this new Dumbo experience. The food was perfect and the service wonderful and attentive without being annoying. We were given ample time to enjoy our meal. We will return soon.", "author": "Bernadette H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Cecconi's finally arrived in Brooklyn and it was certainly worth the trip! We started with the fried calamari and burrata with heirloom tomatoes. Both dishes were delish! For the main, we had the margarita pizza and pappardelle pasta. We also enjoyed both of these dishes as well. Lastly, we had tiramisu to satisfy our sweet tooth. All of the dishes were excellent, no complains at all! The drinks were delicious too and served in the most beautiful stemware! My favorite things about Cecconi's was the view, obviously, and the decor. The view cannot be beat. You're literally looking at the Brooklyn bridge on one side and the NYC skyline on the other. This spot is the epitome of the perfect location. Also, as someone who loves interior design, the restaurant was stunning and done very well! Its something that shouldn't go unnoticed because it truly was beautiful. Our only complaint was that the service was actually pretty slow. I wanted extra sauce for the fried calamari and since the server never came to check on us, I ended up eating it plain. We also wanted extra bread for the burrata, again, we waited a while. Considering the restaurant wasn't very busy and there were 2 servers per table, I'm not sure why they never checked on us. The only thing I can think of is that it's because it's a new restaurant, but for a restaurant of this caliber, I definitely think they need some work in that department. Again, that's my only complaint. The food, the view and the price were definitely worth the trip to Brooklyn!", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "Meh - this place is a major sh@t show! My husband and I love Cecconi in London (especially their new location at The Ned hotel London, where my husband takes his clients for lunch all the time), so we were excited when they are finally opened one in New York.\n\nWe had a brunch reservation today at 12:15pm - we arrived on time (from Tribeca) and got seated at 12:30pm. We ordered tuna tartare for our appetizer, waffle and salmon on the side for my husband and eggs benedict for me. The tuna tartare came out about 15 mnts after we placed the order - it was ok. After we finished our tuna, they took away our plates AND NOTHING happened after until 1:45pm. What I meant by nothing is - our water glasses weren't filled, the waiter didn't check on us at all and NO sign of our main entrees. \n\nWe got restless by 1:45pm (1 hour and 15 minutes after we sat down) and asked several waiters the status of our entrees (btw, there was no assigned waiter to our table - it was a different waiter who took our order and who served the tuna tartare). They said they will check the status. 15 mnts later - still no sign of our entrees. One random waiter accidentally gave us meatballs, which we didn't order. We sent it away. \n\n1.5 hour with no sign of our entrees - we've had enough! We asked for the check and complained to the waiter who deliver our tuna tartare. He said the manager will come by. She came by and apologized to us, she walked us out and gave her email address (her name was chanelle). She told us that they were having problems with the kitchen. Sorry - this should have been communicated to us in the right manner - no excuses!\n\nFor you who lives in Manhattan, save your money on Uber rides to Dumbo - they are plenty of better restaurants in the city.\n\nSuch a disappointment, a beautiful restaurant with unprofessional and poorly trained staffs - we will never come back!", "author": "Ruth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Fantastic addition to the neighborhood. We had a great experience from the beginning to end. When we first walked in hostess was friendly and approachable and we were seated promptly. Food was incredible. Tuna tartare and all the pizzas are a must, specially if you pair with a glass of Rose. Overall it was a pleasant experience and I look forward to go back.", "author": "Juliana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Just read some other reviews...Man, people are ROUGH on this place! My husband \u0026 I had dinner here last night and it was amazing! Especially the ambiance! Of course the prices are high...it's literally right next to the water in beautiful DUMBO. Have ya'll seen the River Cafe's prices? I actually laughed when I saw them and then realized they wouldn't want our money anyway because we didn't have a dinner jacket for the hubs. So yea, it's expensive but it's really not bad. I had two glasses of wine plus we each ordered an app and a small meal and our bill was only $80. For prime real-estate in NYC, that's not bad. We actually joked that we hope we can still afford this place in a few years (hoping they don't raise their rates).\n\nAnyway, onto the food. We were greeted with tall thin breadsticks and a few minutes later someone brought a warm bread basket and water. Here's what we ordered:\n\nMeatball App: 4 small meatballs but the flavors were great!\n\nBurrata App: AMAZING! This was easily the star of the show. HIGHLY recommend. The heirloom tomatoes were out of this world and the consistency of the burrata was heavenly.\n\nCavatelli with Lamb Ragu: Flavors were spot on but my husband was a little sad the portion wasn't bigger. Although with all that bread he ate, I think he left very full.\n\nButter Salad: Yea I did a salad for my entree, but I'm on a diet haha. The salad was sooo perfect though. Those amazing heirloom tomatoes back again and just the right amount of avocado. \n\nI'm honestly shocked to see so many 1-star reviews and encourage you to take them with a grain of salt. It sounds like most of them had issues with service. Yea, it was a little slow, but we were in no rush and were just taking in the views. \n\nOverall, maybe save this place for when you have some time and want a nice relaxing dinner with great atmosphere. We'll definitely be back! \n\n- - - - \n\nOn second thought, this place was the worst...jk, I'm just saying that so I can secure a table in the future! ;)", "author": "Red R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "So after reading all of the negative reviews I was a little skeptical about trying Cecconi's BUT given it's reputation, STUNNING interiors and prime location I gave it a try. My husband and I came in for happy hour which was AMAZING! One of the best happy hours I've ever seen!! Lots of food and drink options all for $4, $7, and $9!!! While at the bar the service was fantastic. We were constantly taken care of and the head bartender was exceptionally great who informed us that during there soft opening, there was a lot of facility issues which kept them from being able to function at full capacity. Made sense to me being that the restaurant is in an old warehouse building. A lot of the reviews also talk about the overall vibe as being rude but everyone from the hostess's to the waiters was incredibly pleasant. Will be back regularly!!!", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I'm not a big yelper but I just HAD to leave a review because this place was AMAZING and is now my new favorite restaurant in NYC...I really don't understand how anyone could leave any negative reviews on this place ...first of all the place is BEAUTIFUL!! Inside the decor and ambience is a sexy classy vibe and outside wow just wow the view is incredible right under the Brooklyn bridge on the water facing the city...the service was excellent we were a little late for our reservation and they were nice enough to accommodate us and still seat us at an amazing table with a view...the waitstaff was very attentive and our food came out pretty quickly....now to the food....WOW.  Every single thing we ordered was delectable.  Not ONE COMPLAINT.  We ordered the burrata, the octopus appetizer, the breosola pizza, the ricotta honey truffle, the meatball appetizers, the lobster spaghetti, the lamb ragu (insane!!), and the veal chop.  EVERYTHING and I mean EVERYTHING was delicious.  We already made reservations to go back next week.  Do yourself a favor and ignore any negative reviews and go check this place out...you'll thank me later.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "I was super excited to try out Cecconi's because the view is amazing and it's in my neighborhood. I was INCREDIBLY disappointed. The service was terrible (they told me there was no outside seating when there were at least 5 tables open outside and sat me inside until I spoke to a different server). They brought me the wrong plate and told me the appetizer I ordered was enough for an entree, but it came out as five small pieces of fish and was barely enough for an appetizer. When they finally brought me the right food, it was not enough for a full meal and it was unappetizing. All in all...bad food. Bad service. Walk by the water, it's more worth your time than an eating at this restaurant. I won't be back.", "author": "Ali B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Amazing place! Food, drinks and THE VIEW simply the best", "author": "Jax A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Horrible customer service. The manager was even rude when I called to ask questions about the wait time. They will not give you information about wait time or availability unless you are physically at the restaurant. I didn't even eat here because I refuse to spend money places where people are rude to me before I even sit down at my table.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "Worst service I have ever experienced, and I eat out several times a week. The waiter forgot our order, and ignored us when we tried to catch his attention, giving us that just-a-minute lifted finger signal but never actually showing up. When we finally tracked him down and stood in front of him to complain, he didn't think it necessary to apologize. He basically shrugged when we told him that we weren't willing to wait any more....They actually deserve only one star, but the setting and the views are nice.", "author": "Iliana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-28", "description": "They gave me a wrong menu, it was a miscommunication between me and the waiter.  I noticed it was the wrong one when I checked because the price was higher. I was not sure it was the wrong menu by the appearance of the food. But the waiter did not understand and was rude. And the wrong menu was very salty.", "author": "Ji O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Unfortunately, our entire experience was tainted by the welcome experience and poor hosting. Our reservation was at 7:45 and we arrived on time. We were told to wait on the side for a moment while tables were getting sorted out, but little did we know that we would end up standing and waiting for 31 minutes until we were seated. I totally would have understood if it had been properly communicated that [insert reason here] was creating a delay, but instead we were repeatedly told that our table (of 5) was being set, when in fact it had not even been cleared. Tell us the truth! Tell us that the wait will be longer than expected and that we can grab a cocktail at the bar! Anything! After briefly apologizing, the host did nothing to remedy our situation--did not send us the manager as a show of good faith, seat us in a more prime location, or comp us a dessert or an appetizer (not that we would have expected this, but any offer would have been nice). We felt as if we were being treated like tourists though we are locals who work in DUMBO and live nearby. The food and drinks at Cecconi's are good, but not worth the lack of respect we received. I'd rather go to Vinegar Hill House or Romans.", "author": "Alexia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-16", "description": "If you are vapid, don't appreciate good food, helpful service, courteous service, or orders that arrive at your table correctly, have we got your dream restaurant! We came for brunch on Sunday and were seated in a near empty dining room. We assumed we'd have great service since there was only out party (of 8) to pay attention to. It was amazing how hard it was to place our order--nobody was checking on us--and when the food came without one of the plates wed ordered (a bowl with a basic from the kitchen, no cooking involved), we had to beg three different waiters and it finally came 15 minutes later, after we'd eaten. The food they did get right was underwhelming-- at least the tiny portions were. You can buy a tote bag from Ralph Lauren's daughter in law at the adjoining shop so there's that.", "author": "L M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "staff here are THE WORST. we called to add a person to our res, instead they changed the res from a Sat to the following Monday. we showed up \u0026 they were totally unapologetic and would not seat us \u0026 then sent an angry email when we didn't show Monday!", "author": "Sophia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Excellent place, view and food. Andre behind the bar provided excellent service, nice and friendly. Top place to go here.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Prior to coming to Cecconi's, we had seen the dozens of scathing reviews of this place, but my girlfriend and I decided to give it a try because it was difficult to get a reservation and we had heard good things about their outposts in other cities. Boy were we we wrong. Yes, the location is beautiful and the decor is great. The service was sub par and the food was nothing to write home about. $34 for a few pieces of lobster on undercooked pasta? No thanks. The service was lacking, we had to ask several times throughout the meal to have water poured and we had to ask several times for them to fix a wobbling table. The waiters did not know what was available on the menu and could not tell me what specials they had or what beers they had on tap. The wine and aperol spritzs were tasty. Will not be coming back here. There are better restaurants in the area with the same beautiful views and with better food and better service. We sincerely wanted to like this place and give it a try and we appreciated the fact that a representative from the restaurant is responding to their negative reviews but it just doesn't cut it.", "author": "Scott E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Had a wonderful time dining at the chic new Dumbo location this weekend. The decor is gorgeous, the food delicious and the service immaculate. The team took great care of my friends and I, and you can't beat the the truffle pizza! So happy to have an LA staple on the east coast. Can't wait to come back!", "author": "Jamie A."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}