{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Solid drinks  and amazing pasta with lobster also lemon sole great place for food and insane view. Great service too. Highly recommend", "author": "Elena V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Had a perfect date in Dumbo on the waterfront at Cecconi's. Simon was very accommodating with my reservation. The decor is Impeccable. Amazing food and handcrafted cocktails. Definitely one of my new favorite spots.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "I guess people love to hate this place. My review is specifically for dinner and specifically for dining at the bar. I've eaten dinner here 4 times and I have nothing but amazing things to say. Bartenders are so friendly, food is amazing (crudités, lobster pasta, and tuna tar tar are the highlights), plus the drinks are delicious too. Definitely a must go in my opinion.", "author": "Cameron L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-24", "description": "This restaurant appears warm and inviting from the decor to wood fired oven to the hostesses...but that's where it ends. They service staff acted as if we were invisible.  Even after again asking a hostess for service the server did not approach.  While we were complaining we overheard the couple behind us make similar unsatisfied comments. We walked out and let others know not to waste their time.  Very disappointing experience.", "author": "Carly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "My brother and I come here all the time on Monday evenings and share a delicious meal together, but this past Monday....it was even BETTER. We had a lovely, adorable waitress named Jordy who made our experience an absolute ball. She was well informed about the menu, the cocktails, she was bubbly, conversational (which, let's be real here, Soho House is not known for its hospitality.....) so we were happy to have a waitress who was a doll. We will definitely be coming back when she's working!! \n\nAlso the new Cauliflower entree is to die for.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Beautiful, sleek and modern luxe restaurant with a chill but homey feel. A big, beautiful marble square bar is surrounded by turquios leather club seats with lush green plants atop. The bartenders and wait staff wear white shirt and neat ties. You feel like you are in a different place when you are here. And the view, of course, is amazing.\nThe food is outstanding. The buttery, bangin' burrata was better than any i've had and absolutely worth the extra calories. Baby heirloom tomatoes were super fresh. I want more. \nThe pasta!!! The agnolotti ....no words omg....if its a cheat day, or not, get this pasta! They are little pockets with parm cheese and a delicate mushroom sauce...i count agnolotti now instead of sheep when im sleepy and waiting to dream...\nThe dover sole was fresh and delish w a light lemon sauce...tots delectable. Wine list is big...go for the nero d'avola...perfect....\nTop it off w espresso and profiteroles and your night will be perfect while you stare at the bridge getting moonstruck on a full belly....buona notte and buon appetito", "author": "Via G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-26", "description": "Cecconi\"s  is an Italian restaurant chain based in London so there is really no reason to talk about the food.    This is Brooklyn so there is no limit to the number of  great Italian  venues  to be found.   The room on the other hand is quite upscale and the view from the outside dining areas are very much more than delightful.    It is a great place to bring your visiting friends and relatives.  As a native New York they made me feel like a tourist a virtual stranger in my home town. \nWhen we called to make an 11 Am reservation for Saturday morning I was told  that it would have to be 10:45.   We arrived at 10:45 only to find that they don't really  open  until 11.  They just want to get the suckers  lined up in the lobby so they can fill the tables quickly.    The reception was officious and you could feel the tension between staff members and the hostess. \n The cream for my coffee finally arrived  as I finished the last drop of my black coffee [ coffee was good].  Hey, that was probably my fault,   I had only asked twice.   Oh yeah, what' kind of Italian restaurant does not put bread on the table? \nThe location, in the Brooklyn Bridge Park is great.   If you pack a lunch or pick up some takeout food you can have the same view for  the cost f your food only and you can get cream in your coffee if you like.", "author": "jim r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-18", "description": "Great space - beautiful interior, rustic, charming with a wonderful location along the waterfront in Dumbo. Very busy (no surprise - it was a Saturday night ) so it's not unusual that the staff might be a little frazzled. From the moment we sat down until we finished we had 3 different waiters, each one a little more confused and disorganized than the one before. Wait time for everything from the glass of water to the drink order to the server taking our food orders was way too long. At no point along the way did anyone stop back to see how the entree was, or offer pepper, refills, nothing. There seemed to be at least 4 managers walking around in suits but clearly not enough service staff. Food was basically fair. Interesting sounding menu. For the starters, burrata was good, so so carpaccio. Entrees luke warm but by then we were too hungry and too tired of waiting to try flagging down a server and tell them. Mediocre salmon and branzino. Make sure to order sides or you'll leave hungry - small portions. One last point. When there are only 2 people at the table they need to bring the courses out together - how hard is that? All in all, not a place I'd revisit.", "author": "John W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Worst pizza ever! Burned and when I asked the reply was no it wasn't... so hungry had to eat it. Don't come here!", "author": "Diane H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "Food was decent, cocktails eh, service pathetic. Waitress knew nothing about the dishes or drinks, and made no effort to find out. One entree arrived ten minutes after the others - no apology. Barely got checked in on throughout the meal, then had to keep after them for the check after we told them we had a play to get to. Will not return.", "author": "Leonard K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "Food is good, but nothing particularly sticks out considering how high the prices are. Stay for the views and decor, if you can get a seat outside!", "author": "L G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "This is a great place to come with your parents/older family visiting from out of town. I don't think the food is necessarily so great, but it is good enough. And the ambience and views make up for the food being good but not amazing. I would come back here if I was with my parents because it is a nice place that's not too trendy or young for older people.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "This place is a bit like Westchester comes to DUMBO, but they do a good job with a decent pizza and Italian menu. You feel like you're in a mall, and you sort of are, but it's a great spot to eat if you're going to St. Ann's. I'm glad it's there.", "author": "S P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "A great little spot right on the water. Good food and a great place to have an adult beverage. Service was great and the views are amazing. Worth it!!", "author": "Evan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Amazing cocktails and food.... Tuna tartare is the most delicious I've ever tried! Beautiful view of Manhattan Bridge and the East River. A must visit place!", "author": "Ekaterina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Had amazing meal, amazing drinks, amazing view and great service.  Have no idea how so many negative reviews. Every dish wasn't just on point but was great.  Place is a great destination to eat and hang at", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "I recently moved into the DUMBO area and wanted to sample the places in what is now my area. This was one of the first places I checked out.  Most awesome part of this place the amazing views which are just in a word fantastic.  Also the ambiance and coziness are also really good and spot on.  \n \nMy fails at least for now with this spot one the prices - they are expensive and a little too rich for my blood to use here as a regular go to place and I really wanted to.  Also we came as a group a bunch of friends and me and they pigeon holed what we could order on the menu like we were pre fixed - I am a little finicky food wise it's just me so that made things difficult I choose this spot because I looked at the menu and found things that I really did want to order which I was told could not because we had do the $40 pre fixed thingy that they stated.  The food itself I was not impressed I mean not the worst that I have eaten ever, but it was definitely not my best. It was somewhere in between.  Also, our drinks I had 2 Moscow Mules and they were the most watered down drinks I ever had. That is a huge and epic fail for me it just is. I did have a friend that had the Ahi Tuna Tartare and they said it was amazing. I am not a fish person though.  Also I would have liked for what we were paying for the portions to be larger than what they were.\nMy last boo boo with this place is they automatically include the tip like that should be our decision not you demanding that this is what you are giving us for gratuity.  I can't say this will be one of my new places to go in Dumbo I heard excellent things about the franchise but have yet to be impressed.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I recently took a large group for brunch. You are basically paying for the view. Food was nothing special and drinks which were also nothing special took forever even to the point where I had to tell the waiter to take the drink off the bill at the end because we never received it. After ordering brick chicken the waiter asked what side we would like with that implying it was included. Of course once I got the bill he charged us for the \"side\".  If u didn't get the side u literally got a plate with just chicken on it. Pretty sad. Lastly and most frustrating part of this brunch which will cause me to absolutely never go back was at the end once I asked for the bill. I received a piece of paper that just had the total then a line for tip right below that then total and sign. I asked for an itemized receipt like any normal human being would ask for and only after asking  for that you will see that 20% tip was already included in the total. Total scam. Go anywhere else.", "author": "Will A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "My boyfriend took me here for a \"birthday\" brunch last weekend. From the moment you walk in (the area is gorgeous to begin with) the atmosphere just makes you feel good. We wanted to sit outside but there was a wait (which is good for a restaurant) they sat us by the open doors which gave us an amazing view regardless. The wait-staff were very friendly and had extensive knowledge of the menu. I would recommend anyone to eat here or even grab a drink at the HUGE bar that has wrap around seating. Can't wait to come back!", "author": "Kyle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Dressed with an ambiance to impress, it is a lovely place to go for a romantic dinner,  a fun brunch, and birthday gathering, a cocktail hour, and even can be casual as it has guests from all walks of life. \n   I have an appetite for creative cocktail menus and as a Soho House practice, it has been passed on to this artistically inspired space. \n  I am a vegetarian and there was plenty to choose from.  Which is sometimes a challenge. The service was very good. As busy as it seemed for a Monday lunch, all of the servers were attentive and my water glass filled at every moment. \nAnd yes, the cocktails!!! The Picante de La casa (spicy margarita) was perfectly balanced. The Whipped Truffle  Ricotta was savory and generous with truffles! Cacio de Pepe seems like an easy dish to make but it is so many times just as easy to be bland. It was perfect. Kale salads are usually a boring option for me as Vegetarians usually have to always resort to salads, but this one was savory, and perfectly dressed with pecorino and a citrus dressing. \nIt was busy for a Monday, so I was happy I made reservations on Open table. This venue is perfect for the summer and the winter as it will be just as cozy. I will definitely return to host a group of friends!", "author": "Natalia R."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}