{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Mediocre food in a nice setting.\nExpect your soup to be served luke warm, your pasta cool and congealed and your bill to have an error.\nThe management pays lip service to your complaints.\n\nNice atmosphere though and swamped with people who care more about the view then food.", "author": "Edward R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "To demonstrate how poor this establishment is, I want to make it clear that I have never before written a Yelp review. I signed on specifically to save others from the bad experience I had here. \n\nThere are two things that are terrible about this place (1) the service, and (2) the food. I was excited to try this place-- I live a few blocks away, and I typically like to find a good restaurant and become a regular. I enjoy good food and I'm happy to spend a fair amount on the experience. I thought this might be the place. It ABSOLUTELY is not. \n\nLet's start with the service.The manager (Joy) is incompetent. I should note- I have never before complained about a restaurant employee. This was a uniquely irritating experience. \n\nJoy is unable to handle customers, and downright rude. This is an experience I have never before had with a manager in New York city, after a decade of living and eating in the city. We made a dinner reservation for a special family event. We ordered, and they first forgot half our food, then brought it at seemingly random intervals. After we had finished and were drinking our digestifs, Joy told us that we had to leave right away. This was after spending $500, and having ordered a round of drinks and desserts that had not yet arrived. She told us that they would give us a round of drinks on the house at our table before we left--which we insisted we didn't want. Then when the drinks arrived, she yelled at us for still being there--when we were there BECAUSE WE WERE WAITING FOR THE DRINKS SHE TOLD US WERE COMING TO US THERE that we hadn't wanted in the first place. \n\nMy issue isn't even that she literally kicked us out because of poor planning on her part and trying to overcrowd the restaurant-- an experience I have never before had at a restaurant purporting to be a nice establishment. (It would usually be handled by buying appetizers or drinks for the waiting customers, nicely escorting us to a round at the bar, or...you know....doing your job in the the seating.)  It was that she was rude, and aggressive, compounded by the fact that she tried to blame her staff for what was clearly not their fault. She ruined a serious family moment. \n\nPerhaps I could get past that if the food was excellent. But it was not. It was EXTREMELY inconsistent. The fish was tough, overcooked and bland. The pasta was unduly vinegary. The eggplant tasteless. The appetizers are fine - if you are forced to eat here (and I recommend you don't) then I would focus on the appetizers (the whipped ricotta is nice.) The cocktails are o.k (The negroni's are good, though some of the other cocktails are a bit too mild in their taste.) \n\nThe view is lovely if a bit loud (you can hear the trains on the Manhattan bridge quite clearly), and our actual waiter was perfectly nice. But that is about all I can say in the establishment's favor. On the whole, you are are  better off going to shake-shack around the street. Leave this one the tourists who don't know any better.", "author": "Broo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Very good food, service, and views. This place really made our engagement lunch special. Proposed on pebble beach with lunch here after. They even brought out champagne for a toast and some complimentary ice cream for our small family party. Pasta was very good (and i'm very particular with Italian) and the wood fired pizzas were spot on. Would definitely come back", "author": "James G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "I live in the neighborhood. \n\nThey don't cater to us!  \n\nI've walked out twice because I cannot get anyone to say hi to me after willing to pay 20 dollars for a simple cocktail. \n\nOver the past couple of weeks I've been checking my bicycle at coatcheck. (Not a problem at any other fine dining restaurant in the city). \n\nThe GM told me today he \"simply cannot allow it, I have 15 baby strollers in the back\".  \n\nLet's size this up:  \n\n1. Baby strollers don't get stollen.\n2. Baby strollers don't cost upwards of 10 thousand dollars.  \n\nDear GM: coatcheck is there to protect property\n\nMake the tourist chain the baby stroller outside while I'll take my business elsewhere.  And I'll enjoy my delicious experiences in restaurants that understand food instead of catering to masses of tourist and handing out the worst pizza in the history of fine dining!!!", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Gave it another change and made reservation. The food is AMAZING like I was expected from cecconis. The service was great too but need to make sure that you have reservation in advance. \nThe view is unbeatable)", "author": "Anastasia E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "First time writing a review but this place was terrible- waited 15 min for a waiter after asking multiple people, salad was wrong, waiter didn't know ingredients of dressing,  flank steak was only 3 oz and overlooked, waiters didn't know ingredients of the sauce, got charged more than the price on the menu, identified all these issues to the manager and he did nothing. \n\nWe have been to multiple Cecconi's around the world and this is joke.", "author": "Iva V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "To make a long story short, we were turned away by the hostess by the way we looked and/or dressed and we were politely told to leave. It was a hot and humid Saturday June afternoon in a very touristy area, but it wasn't like we were wearing t-shirts and flip flops. Even NYC stalwarts like Gramercy Tavern and Gotham Bar and Grill would ever treat us like this place did. \n\nI didn't want to write this review since this happened on the weekend they opened, but after reading up on some of the other reviews, I had to agree with what other reviewers were saying. \n\nHighly pretentious and stuck up.", "author": "Erwin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "2 stars because the waitress was very kind and because of the prime views of the bridges. They lose the stars because we came to dinner with a small service dog and received dirty looks from the get-go. The manager even came up to us after we have already been served by the wait staff to let us know the dog is unwelcome, even in the outside area and to please keep her off of their cheap plastic wicker outdoor furniture. Then came the food. We got the buffalo mozzarella pizza and a pasta dish with pesto. The pasta was cold and for better wood fired pizza, go anywhere else in Brooklyn - this was just plain burnt and dry. We redeemed a yelp deal for a free appetizer, which then showed up on the bill. It was quickly resolved, however they were slow to return the check. All in all, don't expect great food or service, but if you want a drink and to watch the sunset behind the bridges, this is a good spot.", "author": "Josh R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "Live in the neighborhood a few blocks away, and was excited about the prospect of a regular, new place to eat and drink and enjoy the beautifully renovated building.  (Having been to the Miami and CA locations)   \n\nStopped by the restaurant on two occasions.   \n\nFirst time with a colleague, where 90% of the outdoor space was vacant, to be met by hostess with attitude saying the outdoor area is fully committed.  Instead suggested a table in the back of the bar.  After walking around the bar twice, and pressing the hostess, managed to sit at one of the several open tables (according to her all of these were reserved groups of seats).  Preview menu.. so only really pizza's. \n\nOverall felt very unwelcome, and annoyed that a place with a such solid reputation was requiring us to go on the offensive just to sit and have a cocktail and drink and enjoy the vibe. Really weak hospitality at the hostess stand.  \n\n(When calling the restaurant and checking the site earlier in the night, the place shows completely booked).   \n\nRestaurant obviously playing some kind of outdated, 2000's era game to make everyone think it's packed, and the cool spot, while every time I walk by it's empty out front. \n\nWent back again this past sunday to grab brunch.  Encountered the same attitude up front about a walk in.  (The place showed empty again but of course its fully booked online/by phone). \n\nTheir marketing strategy must be to turn away all regular residents with rude attitude at the front hostess area.   We love the new building but will not be coming back or bringing guests and friends over, nor will we recommend it to friends and others in our building.   Will advise our network to stay far away.  Hope this saves you the time and energy of a negative experience.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Great location with awesome views and good decor. Fairly new to NYC and I believe there are still a lot of things to be improved if their goal is to match the original Londoner spot. Had to sit by the bar since they were closed for brunch at 2pm on a Sunday. WHAT?! Probably a place that I would only go back over the summer to sip on a glass of prosecco on their outdoor area that BY THE WAY requires reservation even if the tables are not occupied at all. Go figure! Overall, the service was just ok and my credit card got charged twice. If you are into seafood, the lobster with pasta might be a good choice but for sure not the best in town. Typical situation where you basically pay for the location.", "author": "Thi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Amazing lunch on Memorial Day with my family. The restaurant was\nslammed but the food coming out of the kitchen and the European \ntrained staff steadied the ship. The Black Truffle Pizza, tableside\ntuna tartare were near perfect. My family also loved the lobster and spaghetti and the lamb cavatelli dishes. A well selected and fairly priced\ncocktail and wine list completed a super dining experience. We will be\nback very, very soon as it was a near perfect afternoon.\nDouglas", "author": "Douglas F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Came to Brooklyn with my husband and daughter to meet a good friend who recommended this restaurant and we were not disappointed! We shared a bottle of rosé and started with the whipped ricotta with truffle honey. This was by far the best and most memorable dish I had in the city this week. The tuna tartare was amazing and the service was extremely attentive and friendly. The mini wood-fired pizza was delicious and the perfect size for me. The server brought us a tasting of two red wines to choose from when the time came for our second bottle, which was a nice added touch. I would definitely come here again. Before you leave, don't forget to exit through the back of the building and see the city lights along the waterfront. It was the perfect end to a wonderful evening.", "author": "Brenda A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-29", "description": "Dined there last weekend for dinner (still on soft open, I assume, because the menus still had \"preview\" printed on them). Location and decor are great (and reading other reviews, we lucked out with an adequately polite hostess). Started with cocktails, which were pretty solid, and the whipped ricotta and cured meats were both fine. \n\nThen we got to the mains (which took a good while to arrive), and this is where the \"style or substance?\" question is answered. I had overcooked pappardelle with a salt-flavored Bolognese sauce. The mister had the prime ribeye - right temperature, no seasoning. Food without flavor is like [insert thing lacking necessary thing here]. \n\nWe did not finish our respective entrees (besides being bland, they were also massive), but we were in a particularly chill mood that night and it didn't seem worth it to kick up a fuss with the river view and a comfortable corner seat (plus, Shake Shack was around the corner). We cut our losses with more cocktails and wine, although we're sure the server completely forgot about us by the last round (they said it \"took them a while\" to find the Vin Santo we ordered).\n\nDid we come on an off night? Did we order the wrong thing? Should we cut them slack for just having opened? Questions abound, but none of them pressing enough for a return trip unless word comes out that their food is much improved.", "author": "Genesis W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "I was pleasantly surprised by the quality of this restaurant! We were assuming that it would be very touristy due to the location and therefore not serving quality food/service. In regards to the location, yes it is filled with tourists and a lot of strollers! If you are looking for a nice brunch away from the touristy scene then this is not the place for you. While the service does need a little bit of improvement, the food was incredible! We came for brunch this past Sunday and ordered two drinks: Bloody Mary (very good!) and a Bellini. For our food we had the Cavatelli and the Lobster Linguini. I was personally blown away by the Cavatelli and was tempted to order another bowl! The linguini had a good portion size for the lobster and was also delicious! In regards to the service, my only complaint is that the servers do not know the menu and are unsure what they should be recommending when asked. If this was improved then the overall experience would be great. We will definitely be back!", "author": "Ali C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "We waited an hour for a table, despite having a reservation. What could have been a subpar night (we were getting very hangry) was saved by our wonderful waiter, Dion. Dion is extremely personable and attentive. He was the reason why we had such a great experience. \n\nThe bartenders were lovely while we had to wait - a special thank you to Paddy for keeping the Rosé coming! The atmosphere in Cecconi's is beautiful and the views are even better.\n\nIf it wasn't for the wait, this would be a 5 star review.", "author": "Ashlyn R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "Hot mess. Total chaos to check in. . Showed up at 2:15 on a Sunday for a 2:30 reservation and was told they were seating the 1:30. Empty tables everywhere but couldn't honor a reservation time. DUMBO is Disney in NYC\n\nThe staff is very gracious and the space gorgeous. Joyana, the GM, was incredibly attentive and save the day.\n\nI may come back without my husband and hopefully the kinks would have been worked out", "author": "Janie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "We have now tried them for lunch and happy hour and were very disappointed both times. \nFor lunch in October, the food was average, but the service was horrible. We waited for 45 minutes for one of our items and it was just mediocre when it arrived.\nTonight we went back for happy hour. The staff is snooty and didn't even ask why my husband didn't have more than a sip of his cocktail. The reason was, it was horrible and undrinkable. \nWe will not be back.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "The worst ever in the history of restaurants. If this was the last restaurant on earth, I would starve to death rather than walk back through those doors. Phineas the bartender was very very nice. I would let him serve me a drink given the above scenario, but would have to be outside of this horrendous establishment with the money going directly to him.", "author": "Ellie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "I walked into brunch...I was told it was an hour wait to be seated outdoors...I decided to wait by the bar have some drinks eat some appetizers...My bartender came by once...the hostess was very kind and attempted to make everything better by lying and saying I was next on the wait list..I waited about an hour and half...though the food was good and drinks were great service was A HORROR STORY! (Typical NYC price)The bartender rarely came by when I ordered drinks. They had two bartenders and the bar was full.  \n\nWe spoke to the manager about our wait and he was very accommodating though the outdoor seating is a must do it is a WAR ZONE! People prolong their wait time and it is very hard to get a spot. I think they need to develop a better system than what they have now. The manager accommodated the wait with drinks and app on the house. I have been to many nice places with a view and this is one that needs help in this area. FOOD WAS STILL AMAZING!", "author": "Mari E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Having dined at Cecconi's in London, Miami, and West Hollywood, I was excited to check out the new location. Fantastic ambiance, view of the east river and in-line decor and menu options found at the other locations. \n\nVisiting for Sunday brunch, expect long lines and lots of families, or this could have just been because it was Father's Day. The space is expansive with large bar area and a side dining room with outdoor space.\n\nFrom a food perspective, the Tuna Tartare is mixed tableside, the classic pizza is a must just for the dough alone and a nice Rose on tap or a cocktail will certainly add to your experience.\n\nKeep in mind, they are still in preview mode having only been open a week. A couple hiccups during service, but nothing to warrant some of the bad reviews thus far.", "author": "Brandon G."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}