{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "I can not say enough about Vittorio. He made our day absolutely amazing and cannot thank him enough. We called ahead and asked if the patio was open because we had a dog, they said yes but once we arrived it wasn't. They opened it specifically for us and we received service directly from Vittorio. The food matched his charming and sunnny personality. We will be back!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "I have dined in Cecconi's Miami, LA and has always been very happy with the food and service, however what is wrong with the front of house in Dumbo?! The hostess ( both of them) didn't make any sense, we had a reservation made and were never invited to the table it took me 2 trips to the host stand and 5 minutes of arguing( incredible) with the hostess to still get seated at the table that I didn't like. When I asked for the table I liked I was told it was on hold for a bigger party( it was a 2 top).... just to watch her sit a couple at that table 5 minutes later! This is ridiculous and I honestly felt like she just did it to get me upset. I'll never be back, if you charge 42$ for a pasta educate your staff on basic restaurant etiquette. Food was fine.", "author": "Vasikisa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "I heard about this restaurant from a colleague and told my boyfriend that this was where I wanted to have dinner on my birthday.\nWell yesterday was my birthday.\nWhen we arrived there were 2 hostesses at check-in. They welcomed us with a smile even though they appeared to be super busy. After confirming our reservation they were talking amongst themselves about which table was available. We stood patiently with no problem. Then a man, who appeared to be a manager, walked over and asked us \"is there a problem?\"  to which we replied \"no\" and the hostess explained that she was getting our table and he walked away. Right then I should've told my boyfriend that I didn't want to eat there and left but we were led to a table and brushed off the disrespectful treatment from the manager. \n\nService from our waiter and the rest of the restaurant staff was pleasant and the food was delicious but I will not be returning. \n\nThat Manager saw 2 Black people, 1 in a hoodie under his coat, and decided in his little mind that we couldn't possibly be there for dinner and there had to be a problem. \n\nPlaces like this can't have my money.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Update: Second time eating at Cecconi's- Though  have been here at night a few times and it is a big scene akin to the Brooklyn equivalent of Red Rooster Harlem. Glitterati, literati, sexy people, urbanites and suburbanites.Good news food has fared way better, service is another story.\nAteL \nAnchovies with potatoes- $4 on bar menu\nBrick chicken with salsa verde $26\nSitting at the bar the first time for 20 minutes without service- I walked out and then returned. Water arrived and 10 minutes later a waiter. You don't know if they are laid back on purpose, but later find out that they are not laid back on purpose, but muddled at best. No matter, being unhurried here adds to the sexiness of it all. I sat near the pizza oven and the pizzas look amazing, and the oven is fab. The anchovies arrived with what I thought were toast points. They were actually, hot crispy potato wedges- and together with the anchovies, off the charts.\nThe brick chicken with cippolini and spicy salsa verde was also delicious. The Almandine bread still steals the bread show- though the grissini which I wasn't offered looked visually appealing.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Super nice bar area. Very elegant. Yet casual for after work drinks. Great place for a romantic night out.", "author": "M D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Beautiful scenery the whip ricotta and honey truffles is one of my favorite dishes from here also enjoyed the lobster and spaghetti.", "author": "Taleea C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "I really liked this place's atmosphere and ambiance. The beautiful people definitely go here and it's super fly in that regard. What I do not like is how expensive it is. Holy lord - $150pp for brunch is absurd. The pizza is good not great. The salmon is good but not for the money. Yes I am well aware you're paying for the location but the drinks are criminal.\n\nIf you have to come here, dress to impress. It's a beautiful restaurant. Perfect for a date or an expense account.", "author": "Stefanie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "We decided to give Cecconi's a try on a recommendation of a local \u0026 yes I was a little nervous by the reviews I'd read. We walked in at lunchtime \u0026 there did seem to be quite a few people waiting at the entrance. We were a party of three and were seated quite promptly. We sat inside it was pleasant and the service was good. I chose the Spaghetti, Maine lobster, saffron \u0026 basil pasta and enjoyed a couple of their cocktails.We finished off with a coffee. Nice ambiance and perfect after a stroll over the Brooklyn Bridge. Next time I may opt to make a reservation and sit outside as the views would be spectacular. On my observations people here were dressed casually but smartly.", "author": "Lyndal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Phew. The ambiance of this place gets you right when you enter the building. Amazing. If you get there early, I highly recommend exploring around. You're right under the beautiful Brooklyn Bridge.\n\nThe food was amazing as well. My favorite dish was probably the beef tartare, but everything else was delicious as well. Shishito peppers were fire, mahi mahi, truffle pasta... The dessert was a great way to finish as well. Dark chocolate tart with PISTACHIO gelato.. done.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "This is not a place that I'd have chosen to go on my own (based off of the stars alone), but one of my colleagues had organized a team happy hour here. I'm fuzzy on the prices because a lot of the items were ordered by my colleagues. \n\nThe place has a very lux vibe, with wooden furniture, plush chairs, and chandeliers. There seemed to be a deck outside but it was raining that day so we didn't end up going outside.\n\nI tried out two of the cocktails - a mixed berry concoction, and a Moscow mule. They were both a little watered down and weirdly bitter. The fried calamari we ordered was crispy and seasoned well. The meatballs dish was a hit at our table as well. The mixed nuts and olives, not so much. We also ordered and split a few flat breads which were way too much bread and not enough topping. \n\nThe service was all over the place and a lot of my colleagues got drinks that they did not order, and few were left waiting for a long time. There were more than twelve of us between two tables, so Cecconi's could've decided to allot us one server exclusively, considering the amount of food and drinks we ordered. \n\nThis place seems to be a tourist trap, especially considering the prime waterfront location. Not a tourist trap I'll get caught in again, for sure.", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-08", "description": "Bonjourno and Digorno hehe. All jokes to the side. \n\nI have been visiting the cecconis of the world for as long as they have been around. I have enjoyed the eastern standard all over as it is a very refreshing drink. And I don't even drink because of my religion!!! Unfortunately my visit to the one in DUMBO was extremely sub par. As far as I see it, this restaurant was setup as a gimmick.\n\nI understand that this restaurant is fairly new but there seemed to be no rhyme or reason for any of the decisions made that night. I ordered the tuna tartare for me and my lovely wives and while all other tables received table service for their tartare, mine was made so far away I thought they were catching the tuna in the river. That was just the beginning. One hanger steak arrives for one member of my family and then another arrive 20 minute later, what is? Ricotta arrive before pizza, what is? Fork fall to ground, no fork for 3 minute after pasta arrive, what is? These are the what is!?\n\nThis is fine and I understand that restaurant get busy sometime and things are chaotic. What really made me uncomfortable is that one server was screaming at a bussing boy for not doing enough work. As far as I could sometime see he was alone filling water for entire section outside seating! I felt bad enough to give him words of encouragement and a nice looking blue dollar ($100!!) for his pocket.\n\nMy words of advice treat everyone with respect!! Not only people who are members of your club! I heard about your club!! You dont! \n\nTreat staff with respect! They are working hard! And treat customer with dignity, even if they aren't in your club, they pay many money. Goodnight!", "author": "Parshnit B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I just read below a comment about the manger. I am quickly becoming a regular, in the past 2 months I have had dinner at least 4 times. \n( get the beef tartare ... amazing ) \nEach time the same 2 managers were present ... each time they have touched my table with class ... even the time when my blind date sent back the perfectly good wine he ordered whilst abusing our poor waitress for hours. If anyone should have been frowned upon. \nEven then , they were above and beyond professional. \nThey have a steady customer in me ... I am SO happy to have such a place in my backyard. \n\nMany praises to you all", "author": "Lia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "I'll start out by saying I was nervous about eating here after the mixed reviews. But it was amazing. This is not a place you should go to \"pop in\" for dinner. The service is very paced. If you come here for a dinner experience then this is a must go, don't go here if you're wanting a quick dinner.\n\nWe made a reservation and then opted to wait for an outdoor table. During that time we grabbed cocktails at the bar and the calamari and meatballs and just relaxed and enjoyed the atmosphere. About 45 minutes later we got our table which was the perfect amount of time for the apps and drinks.\n\nWe were seated with that gorgeous backdrop and ordered more drinks and the agnolotti and salmon. Both were amazing. All in all our experience was about two hours and we had a great time.  I cannot wait to return here.", "author": "Casey D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Cecconi's dumbo is chic and delicious! They have a special happy hour special that occurs in the bar room from 4-7 daily. On the happy hour menu there are a variety of dishes such as pizza for 9 dollars, meatballs for 7 dollars and  a wide variety of beverages ranging from 4$ beers to 9$ negronis! The decor and ambiance is amazing with the backdrop set as the manhattan and Brooklyn bridges. This is a beautiful place to dine and watch the sunset.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "Had heard a lot about Cecconi's from my friends who lived in London, so was super excited to come here to celebrate a friends birthday this past weekend. Unfortunately it was raining that day so no outdoor seating but also meant restaurant was overbooked. We arrived and checked in - 5 of 7 were here. We were told everyone needed to be here and to hang out at the bar. When we asked to be seated as we were planning on ordering drinks and apps, they stated another party of 8 was ahead of us (which makes no sense). Essentially the hostess was clueless on what was available and rude to the birthday girl. We chatted with manager who promptly gets us a table (that was open and empty!) and we are off to restart the night. Must have been our lucky night - we get a server that seems pretty new. Ordered a few pizzas, salads and mains- which all came out so quick and at the same time! I'm not sure how their kitchen staff is managing their orders because you normally would space out the appetizers and mains. Our waiter keeps disappearing for a good amount of time and asking someone else for help or ordering any drinks becomes pointless bc they all tell you to talk to your server, who was not able to be found. \n\nDessert and coffee - again need to work on kitchen management, as coffee came out 20-30 mins after dessert. \n\nFelt like the staff was not trained well, not able to handle groups (we were a group of 7), not refilling drinks, etc. \n\nOver all food was ok, view was great, but service terrible. Would not recommend coming here.", "author": "Sera I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "The view is amazing, the interior is lavish, the food is great. I've had good service here. I especially adore the host named Chad. It's a fancy place, so just say No to comin' all scrubby. Happy hour menu is tasty and a good value. I used to think this was a \"models-and-bottles\" type of place, but I haven't experienced the pretension I thought it would have.", "author": "Rosie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "I made a reservation for this restaurant a month in advance. I requested table outside in my reservation and they did not accommodate my request. We ordered salads that were supposed to have heirloom vegetables, that were no where to be found. The piece of salmon they brought looked gross. It is as if they ran out of food and just halved the salmon.  I won't ever be returning to\nThis location or the one in Miami.", "author": "Rachel N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "Lovely views and a cool atmosphere. Bit loud if youre looking for a relaxed dinner. The pizza is great. The pasta not so great.", "author": "Nicolas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "The ambiance/location/views/service. The bar is beautiful, but the summer view is better\n\nThe service here is great and the bartenders are super friendly. The negroni menu is extensive, I wish I was more into them. I ordered the following: whipped ricotta, meatballs, black truffle pizza, truffle polenta and short ribs.\n\nThe whipped ricotta was unbelievable -- truffle honey and ricotta is a fresh combination that gets you started really well. If there are ever meatballs on a menu, I try to order them because knowing how a place makes their sauce is big to me. The presentation is nice yet the portions here are somewhat small. All of these were ordered by two people who happened to skip lunch. \n\nThe truffle pizza had me raving for a week, I actually had to go back and get it. It's worth the somewhat high price because everyone should know how well goat cheese and truffles go -- best specialty pizza I've found in the NYC area. Truffle polenta was interesting, would absolutely order again. \n\nI love gin and the Last Word is pretty good... just make sure you get the truffle pizza and whipped ricotta.", "author": "Jesse C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "I came here with friends for dinner and the food was amazing! We shared the shishito peppers, tartare, carpaccio, and calamari. Everything was excellent. I likely recommend the tartare and peppers. \n\nI had the spaghetti with lobster and it was delicious. I tried the other dishes which were the tagliatelle, angliotti with black truffles, and lamb ragu. Everything was excellent. \n\nWe shared the profiteroles and it was a huge portion and the perfect end to the meal. \n\nThe ambiance is trendy and fun and service was great.", "author": "Garima V."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}