{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Good food. It is a Italian. Very good location , place and view! The food it is good but expensive and not much quantities. They charge 5 dollars for one very small coke.  The pizzas are ok.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Worst service I've ever experienced! The waitress was ok, but the 2 hosts were as cold as ice! The food was ok but not worth going back because of the people who work there.", "author": "Beatrice P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "Great location with lots of space to improve their food. I had the salmon. The skin reminded more of charcoal, medium rare was well done, and there was absolutely use of spices at all. Very plain. It was actually very hard to identify the food due to the lighting situation. Our neighbors returned there food two. A simple pasta dish. After taking a look at our other neighbors boring dessert  we just had a espresso macchiato. That one was quite good.", "author": "Christoph D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "\"Pro tip\": No restaurant in NYC is above treating its patrons respectfully. Hostess was so rude to both customers and staff that we walked out. Will never return.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-21", "description": "This place is indignantly stuck up. If you and your significant other are looking for a pleasant meal by the water, don't be fooled by the exceptional location. Service was snooty and lacked personality, and the food was overly salted and dripping with grease. Had high expectations for this up end meal, very disappointed.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "A lovely place to wind down and take in the lovely views of the city. The space is beautiful and all the employees were equally as lovely, from the hosts to the bartenders-which I feel is a hard thing to find in the city. Food is consistent every single time. You can't go wrong with anything on the menu-but do try the burrata.", "author": "Jayme R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Went under a friends reservation, service staff seemed a little cold and impersonal but we shrugged it off as being a New York vibe. Our server Mika, was good. She was very friendly and seemed genuinely happy to have us as guest. Drinks arrived within less than 10 mins. Perfect timing for our flow of conversation (delicious negroni). Started with the Vitello (amazing, I will admit I have a weakness for veal so that's a bit of a biased opinion), fluke (okay, but nothing to write home about), Margherita pizza was outstanding, period. We decided to stick with the classics for our mains: lamb ragu, surprisingly not gamey at all, a hint of sweetness and a slight touch of spice which made the pasta delightful, lobster spaghetti was satisfying flavors worked really well together perfect texture, chicken was delicious, temperature of steak was on point. Dessert was so comforting. Tiramisu was subtle and sweet and the texture of the lady fingers were just as I expected. Profiteroles were outstanding, period, that ice cream was to die for! Overall my experience was a positive one and I would return! Don't forget to take a walk out back after your meal, amazing views!!!", "author": "Najmah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "Came here for my anniversary, was attracted to this place because of the beautiful view and great ambiance. To start the place is beautiful. Very classy with a cool Brooklyn vibe, however the service simply SUCKS. Our waiter did not come to our table until about 15 minutes after we sat down. He was very short and barley came back to check on us. What I can say is the woman who was busing the tables was more attentive and friendly then our waiter. The food was very good. We had the meatballs to start and the pizza. Very delicious. Overall, this place was very good, however the service definitely needs some work..ESPECIALLY for the price you are paying.", "author": "Brianna M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "Food is extremely average and expensive and service, especially the hosts, are so rude!! Don't bother going here. I live in Brooklyn close to the restaurant and I wouldn't go back because the staff is so rude.", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Had dinner this past Saturday celebrating our 33rd. Wedding Anniversary.\nThis is the second time we have eaten at Cecconi's and were not disappointed. I had the Bronzino which was perfectly cooked and my Wife had the short ribs which were perfectly cooked as well but needed some more seasoning. She had to ask the waitress for a little hot sauce. The appetizers were great as usual. We had a very nice view of the river and the light snow which made the evening kind of romantic for us both.\nThank you staff for being  so attentive. We did not have to ask for anything during the meal with the exception of a little more seasoning on the short ribs.\nMy wife and I will definitely be back again  or with my office staff since I work on Old Fulton Street.", "author": "Marc B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-04", "description": "First off I have eaten at the location in South Beach and the food was very good. \nI Stopped by on a Sunday around 1130 the restaurant was empty maybe 15% full(maybe three tables in the whole outside had people at them). Went inside and asked about being seated for a quick bite with one other person. Was told very very rudely by a young model thin hostess that they were completely booked. I said we live a few blocks away and are members of soho house, we just wanted a quick meal. I mentioned we weren't looking for a long boozy brunch just something quick. \nWas once again told very rudely that they have 300 people on the reservation list. The whole time the manager was standing next to the hostess and even though she was speaking to us in a very rude way he did nothing. \nWe left and took a walk through the park and made sure to circle back by the restaurant an hour later. Guess what still empty. I guess all those tables cancelled? I will not be going back. I'll give two stars since how could sitting on the patio on a nice day having a drink be horrible. Besides that I'll trust the rest of the reviews on here and just enjoy the restaurant the next time I'm in Miami.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I wish I could give more than 5 stars.  I organized a party of 12 for Saturday brunch.  Everything was perfect!  Upon entering we were greeted by smiles and promptly seated.   The food exceeded all expectations.  All 12 of us were impressed on how delicious everything we ate was.  I want to thank Danielle, Vittorio and Terry on making the day a memorable one.   A group of good friends enjoyed a fantastic meal.   Thank you all and we will be back.  Grazie mille......", "author": "Donna T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "I made a reservation here for an anniversary dinner. The place looked really nice on the inside and had a beautiful view on the outside. However, when I gave  them the reservation name, they told me there was a party going on and the whole Restaraunt was rented out. I traveled over an hour to come here and the best the manager could say to me was \"well sorry, see you another time.\" This was completely unacceptable and has ruined my chances of going back here. Horrible customer service!", "author": "Jesse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Came back tonight and was blown away by the quality of food and service. Cecconi's Dumbo has officially gotten over the post-opening hump. We had champagne while waiting for our table, amazing drinks ( I LOVED the Eastern Standard), amazing burrata, perfect entrees (branzino and cavatelli - to die for!) and decadent desert (tiramisu and chocolate tart, still dreaming about both!!). Would definitely recommend Cecconi's to anyone looking for a great date night or night out!", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Adel is the person who turned around my would have been a poor experience into an awesome one!\nWe sat at the bar around 5pm and it took a good ten minutes to get any attention from a bartender. \nAfter we ordered our cocktails, we asked for a menu. It took another fifteen twenty minutes even to get anyone's attention to be asked if we had any food allergies.  Then nothing for another ten minutes of no attention. \nWe almost walked out at this point but Adel came to us and asked if we had a person tending to us. And we said not one person but whoever would turn around when we called for attention. \nHe not only apologized for the confusion and my BF tried to blame it on a possible time of transitioning into evening shift. But Adel said 'no excuse, we will make it right'. And he certainly did!  \nAdel is a true professional and a huge asset to this restaurant!  \nI will come back but I will also check to see if he is at the bar before coming over from The other side of East river!  \nAs far as food, their pizza is fantastic. Octopus salad is tasty but a bit too salty. But still enjoyable. \nDrinks are amazing here. He made me a spritzer which was out of this world!!!", "author": "Jin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-04", "description": "This restaurant doesn't really have it together service-wise. The hostess asked us 6 times whether we had reservations. Finally, I decided just to stand at the hostess stand so that we got seated over 45 minutes late. \n\nService aside, the food was very good. Just don't expect to be seated timely and plan on a rather \"dining\" experience.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Every single time I have been to this restaurant, I've been treated like gold. The service from the management to the bussers has been perfect. The food is always delicious and their wine list is excellent. I really don't understand the reviews about bad service! I even recently had an event in their private dining room and the guests were blown away by the food and of course the ambiance. It's really hard to do the elegant, cozy, upscale, but still homey vibe and this place does it with seamless perfection. It is right on the water between the manhattan and brooklyn bridges so you can imagine how amazing the view is from their patio.", "author": "Joolee T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "One month young and off to an amazing start!\nCecconi's has it all beautifully tastefully designed interior absolutely best outdoor dining in dumbo as it sits on the main level of the perfectly restored civil war building on the river offering thick cushioned seats enticing you to sit and stare as you indulge in delicious Italian food. Loved my lamb ragu cavetelli and excellent wine straight from the hills of sicily's Mount Etna. Lovely and attentive wait staff as well as friendly hands on management. Go for a snack, for breakfast, for pizza or a full course meal. Go for food, service,amazing views oh and at very reasonable prices.", "author": "Tess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "The interiors and vibe was amazing, loved the ambience. The food was really good, and the service can be improved. Other than that I had a great experience.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "Food is no good. Just don't go unless you hear they've completely changed their menu or chef.\n\nService is alright, waiters don't know clear table before bringing food.\n\nEverything is tasteless or just not good tbh.\n\nView sh*ts on the food.", "author": "Noelle N."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}