{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Ambiance is special, food was excellent, service outstanding. Pizza is light and tasty. Chopped salad big enough to share and delicious. Pasta's were fabulous. The views of the Brooklyn Bridge at night are magical. An occasion place for sure, make reservations.", "author": "Sue M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Aside from the amazing view, can't help but agree with other Yelpers. This place needs to hold itself to higher standards. Ordered the Avocado \u0026 Chickpea Dip with Crudite and Chopped Salad. The dip was absolutely delicious and the chopped was as well, however, it's not a traditional chopped salad which would be nice to have known when ordering. Our server only visited when taking our order and all appetizers came out prior to our drinks which was, in my opinion, poor serving etiquette. The drinks were delicious once they finally arrived which was after we finished eating. Overall beautiful locale but overpriced for no reason and service can use a kick in the ass!", "author": "Shanice O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Sat at the bar. Bartenders are really great and took care of us well. Appetizers: Ricotta with honey and steak tartare were amazing. Very good and fresh. Got 2 pastas: cavatelli with lamb ragu and agnolotti with wild mushroom. Oh man. The agnolotti was so good we ordered another plate as we were eating it.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "If I could give this 0 stars I would. It's terribly run, the food was not good, and the drinks were UNDRINKABLE. The hamachi crudo is way too salty, the rosé spritz tasted like cherry medicine (I took 2 sips and had to order the house rosé instead). I ordered the butter lettuce salad with salmon. They had run out of butter lettuce so they offered arugula with it instead (gross). The salmon was tiny.\n\nFood was terrible and service was even worse. Because it is international chain (?), there is an extremely entitled attitude here. Ceconni's relies on its name, not on its the service, nor its food/drinks. It's actually embarrassing for Soho House to be associated with this restaurant.\n\nI left my credit card here. I called the next day to ask if it was there. It was and I asked my coworker who lives nearby to come pick it up. She generously agreed but texted me saying she wasn't able to because she needed to have my ID. This restaurant is inconveniently located in dumbo. It's not terrifically easy to get to (there are not a lot of  subways). I told my coworker the name, type, and kind of the credit card. I understand Ceconni's is concerned about their customers safety, but please focus more on the basics (like the food, drinks, and service) before making unnecessarily inconvenient rules about picking up credit cards. Thanks.", "author": "Alisa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "I am extremely disappointed with this place. I called on a Friday to make a reservation for a Saturday and they said they didn't have any tables available however, they said we can come in and the waiting time would be 30 minutes to an hour. When we arrived, we were told \"we're not taking any walk-ins.\" Considering it was my fathers birthday and we commuted a long way, Ceccino's should have been able to seat us. They are completely hypocritical and their customer service is extremely poor.", "author": "Sanela D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "So all I see in response to the Yelp reviewers is a message from the GM saying check your inbox ? I wish they would issue a public response as to what they are doing to improve he overall experience. Are they making changes to improve and listening to customer feedback?", "author": "Michael N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "I live right across the street and so wished that I had better experiences here. Both times I booked far ahead of time for brunch. The first time we had to wait 15 minutes after our reservation tiem to have our table set. The second time, they said we could sit outside if we waited 30 minutes. We returned 30 minutes later, and then waited for another half hour by the hostess stand. All the while, we were given no updates, and essentially treated like we were in a line at Disneyworld.\n\nWhen we were finally seated, we were underwhelmed by the service, no bread baskets. Food was decent; everything tastes good after you've been waiting a while and have built up the food to be worth waiting for. It is not. If you must go, I'd recommend the arugula pizza or the kale salad.", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "This is probably one of my favorite Italian places in Dumbo I have tried I would recommend the pizzas to anyone who likes pizza and the last word is now one of my drinks. All in all I love this place.", "author": "Justin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Place is still working out kinks, really hope they get there. \n\nFood quality seems mediocre.\nWater refills require requests \nBredsticks require request\nPlace is gorgeous \n\nMaybe the issue is understanding", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I was at Cecconi's Dumbo a few weeks ago in June and had one of the best lunch-get togethers I have had in a long time.  The weather was perfect and we luckily were able to have a beautiful table outside and the weather was perfect.  We had booked a table about a week ahead and purposely booked a late lunch time, knowing that would up-our chances of the top outside real estate.  We had awesome pizza's, super healthy and delicious Salmon and the best rose and literally sat outside, not rushed for hours looking at the gorgeous view.  Also, our server Cal, was great!  They had only been open a few weeks and she knew the menu like the back of her hand and was super attentive without being over bearing.  Cecconi's is definitely a place to see and be seen, but at the same time it has a very chill and relaxed ambience with wonderful staff.  Well done Soho House Team!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Really nice addition to the neighborhood.  Amazing views if you can score a seat outside, but even if it's packed and you can't get a seat, the bar area is great.  Just wish they would add either plain waffles or plain pancakes to the brunch menu.  The waitstaff is wonderful.  Highly recommend.", "author": "Brooklyner B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Was excited to try this beautiful restaurant. Made a rez 10 days in advance, noted birthday celebration and even called a day prior to request a table near a window in dining room. Arrived, awesome bartender, great drinks - told table is ready and they point to the one next to where we are sitting at the bar. I kindly asked for a table in the proper dining room and was told \"you'll have to wait awhile as this is all we have at the moment\"..We wait 15 minutes only to be taken into the half full dining room and told as we are being seated \"We were able to move some people around to accommodate you.\" What - ???? There were at least 3 tables in my view that were empty for over an hour... Food was OK, service slow...(when we asked about the specials we were told of 4 items each over $100 lol)...Anyway, will def go back for drinks and the nice bar staff, will skip the dinner and head next door to Sugarcane instead.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Now they've started taking reservations designated for outdoors it seems to actually be less efficient. When we first went you couldn't reserve the outdoors and we got seated in 20 minutes. We arrived early for a reservation this time and was seated 45 minutes after our reservation time outside. Learned that they do not monitor the 90 minute limit for parties of two. I think the issue is if they would have told us when we checked in it would've been 45 minutes we might have made a different decision. They told us 20 minutes so we had a drink and a bite at the bar.  \nOther than the long wait the service was excellent and we really enjoyed most of the food particularly the salmon. Out of the special veal dish by 730 which we would've had. \nSpecial mention to Nigel who explained what was going on. Big place. Small kitchen. Small portions. Nice evening with people lingering. Seemed he cared and tried to make it up to us.", "author": "F.D. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "Absolutely miserable Experience!!! Hostess sucks no effort to make things happen on their end! Made reservations using opentable making a note that it was my grandmothers 81st bday and if possible to get a table by the window a month prior to my 6:30 pm dinner reservation. My party notified me that they were looking for parking at 6:30 pm so they were running late. I told the hostess Jasmine I'm sorry they are looking for parking shouldn't take longer than 10 minutes. My entire party got there at 6:45 pm we had to wait until 7:30 pm meanwhile they continued seating people. I've worked as a hostess in restaurants in the city. I understand you are fully committed but you make exceptions and either hold the table or make give us the next table not continue seating. At 7:30 another hostess approached me to tell me it's more of a wait, the minute I asked to speak to a manager she turned around and said right this way! Thanks for helping me celebrate my 81st grandmothers bday had an old lady stand for that long! DISGUSTING oh and loved the seat close to the bathroom but at this point nobody fcuking cared!", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Beautiful design and the views, staff a d management were very professional and knowledgeable.   Can't wait to make this a regular spot for date nights, brunch, girls night out and late night cocktails!   Fantastic job guys!", "author": "Hercy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "THE BEST!! The ambiance, the food, the staff, and of course the best waiter ever...Dion.  He is fantastic!  Great personality and awesome understanding of the menu.  This is my third visit, and I'm not local.  Had to bring my friends during our girl's trip.  We will definitely come back and can't wait to see Dion again.", "author": "Flavia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "We walked in with no reservation to have brunch and were told that there was no space, that we'd need to be placed on a wait list, but that we could sit at the bar though. So we sat at the bar no problem. From the moment we sat down to the moment we left, there were SEVERAL available tables that we could have been seated at. When I left and told the hostess this, she had nothing to say and no explanation to offer but \"sorry.\" I get trying to hype up a new restaurant, but this is NOT the way to do it. I live one block away but will not be returning. I highly suggest you don't waste your time here.", "author": "Kimberly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Vittorio and chris are  the reason for this place is now good owners beware don't f this up again......", "author": "Robert P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "My wife and I had were walking around DUMBO, checking out all the new stores and restaurants since the area was renovated. The last time here, probably 3-4 years ago, we went to the Smorgasburgh in the remnants of an old brick building. \nIn our travels we walked past Cecconi's twice but never considered going in until realizing it was about dinner time and we wanted to eat locally rather than near home (an hour away). So, we walked into Cecconi's and were immediately seated, without reservations. They sat us at the last table near doors to go out under awning, which was great because we had great views and were assured of staying dry as rain was imminent. \n\nAside from the very attentive wait staff, we ate several delicious courses. Being foodies, we shared the Whipped Ricotta with truffle honey and crostini. Exquisite!  Not being terribly hungry, we each ordered the Rigatoni Bolognese and paired it with a Cab (wife)/Nebbiolo (me). Being a huge bolognese fan, I was pleasantly surprised with the sauce and portion size. \n\nWe finished the meal by sharing a fruit galette with yogurt gelato and I had coffee. It was the \"icing on the cake\"!!\nWould love to visit again but sit at their amazing bar!!\nSo, kudos for the ambiance, staff service (Maria), and great views!!", "author": "Vince B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I gotta say i was impressed with this place. When we arrived the place was packed but despite how busy it was we sat almost immediately for our reservation which is a good start for any restaurant. We sat outside it was a bit on the chilly side but they gave us blankets for the kids. The appetizers were good and the pizza was excellent. What stole the show for me was the lobster pasta dish. I have eaten in some of the  \"best\" italian restaurants in brookly/manhattan and this was on par with any if not better. My wife loved the lamb ragu. Also a side note we arrived when it was brunch and my son wanted a steak. We were told it wasnt available BUT the manager made it happen and brought out a delicious NY strip for my son which he said was excellent. All in all between the service/view/food quality i think this place is a home run for dates/families and groups looking to have cocktails. We will definitely be back!", "author": "Vin G."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}