{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "One of my favorite italian restautants in NYC! The location is drop dead gorgeous. food was amazing and great ambiance. Staff was so nice and attentive. Food came beautifully served. I loved loved loved the ricotta and honey appetizer best but we also tried the burrata pizza and the butternut squash pasta which were both insane as well. Would HIGHLY recommend for a special occasion. Planning to come back and have my college graduation dinner there!", "author": "Alegrita A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-03", "description": "We came by for lunch and got seated with a great window view of the river and Brookyn bridge.  The dining area is spacious with a very nice atmosphere.  We shared the calamari appetizer that was very good as was the Bresalo Burrata pizza and Tagliatelle Beef Bolgnese.  Tip - check in via Yelp to get a free glass of wine.  Their Cabernet Sauvignon was very good.  The Profiteroles dessert was great but the Chocolate Tart was so so.  It's worth the visit if you're in the neighborhood.", "author": "Ray L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "I haven't been to DUMBO to hang out in a few years so I was very pleasantly surprised to see how much DUMBO was enhanced. Cecconi's is truly a GEM and a beautiful new addition to Brooklyn gorgeous waterfront. I cannot stop raving about this place. The staff, the food, the drinks and the decor are simply divine. I cannot wait to return here for \"Half Off Mondays\" and see the amazing and super friendly staff again.\n\nA HUGE shout out to Riccardo and Stevie. Both were amazing bartenders, very knowledgeable, and just such beautiful spirits!", "author": "Kendrick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "This was perfect. Great food and great service! Perfect views ideal for any situation! The food is impressive!! Good amount and delicious... great wine selection!! Even the expresso coffee was remarkable!! The price might be on the high side but the quality is worth it. \nfull of tourists but great restaurant!  I'll be back.", "author": "Danny O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I came here for Family Dinner on Sunday evening. We made a reservation for 6:30 PM and were led to our table in the adjacent room from the bar. Cecconi's has a cozy, fancy vibe but also has large windows  that look upon the Manhattan Bridge and the East River. It's a delightful spot for a nice dinner or drink.\n\nThe waitress was incredibly helpful when choosing wine for the table and also offered her own suggestion on dishes and explained the menu thoroughly. The service was spectacular.\n\nWe got the Caesar salad, the arrabiata pasta, and a meat pizza. All three dishes were delicious. Even with all the food served family style, my group devoured it. We finished the meal with scoops of gelato and the pistachio gelato should not be missed!\n\nAfterwards, we walked along the water. What a wonderful place to dine and enjoy food! Definitely recommend!", "author": "Maria W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "The food was great and came out extremely quick. We were lucky enough to have a gorgeous day where we could sit outside. \n\nSo I made my reservation through their website. The reservation was for 4:45. After walking around Brooklyn all day we decided to go at 4 and see if they could seat us a little earlier. When we got there it was almost as if the hostess didn't take us seriously (being that we are 25 years old and look like we're 18). She told us she would have us seated sooner than 445 and suggested we have a drink at the bar, which we kindly accepted. 4:15 passes, 4:30 passes, 4:45 on the dot a male host homes up to us and seats us outside. We did receive our food rather quickly but we had 4 different waiters we didn't even know who to tip at the end of the meal. Our waitress had zero of a personality, along with a bad attitude, almost as if we were a bother to her. \n\nAll that being said, food was great but be prepared to be put on the back burner if you don't look old enough to be in a place as snooty as Cecconi's.", "author": "Kristan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Came here for a late lunch / early dinner Saturday \u0026 was able to be seated right away.  This place is super cute. Love the velvet couches \u0026 brick wall.\n\nWe ordered the ricotta honey truffle crostini, shishito peppers, the octopus, steak tartare, salmon entree , and the agnolotti with black truffle.\n\nI thought everything tasted amazing - I did not taste the octopus but my girlfriend enjoyed it.  I ended up putting a layer of the honey ricotta and then added the steak tartare on top and that bomb combo should be on the menu, just sayin ;).\n\nThe service was great too. The server tried to make sure our table was never over crowded with dishes and always asked if we were ready for the next dish. \n\nI will definitely be back when it is warmer! I would love to sit outside with that gorgeous view.", "author": "Alyssa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Cecconi's is such a great addition to the roster of amazing restaurants popping up in DUMBO. It used to be pretty difficult to eat somewhere while staring at the Manhattan skyline across the water. You would have to shell out hundreds of dollars to eat at the (I'll say it, overrated) River Cafe. Well no more! Because Cecconi's is here with its gorgeous old school glamour decor and significantly more affordable food!\n\nThey have a pretty extensive All Day menu but you can't go wrong with a good old fashioned hand made pasta dish. My husband would not stop raving about the rigatoni bolognese. And I am salivating thinking about the pasta with mushroom cream sauce that I ordered. The sauce was not overwhelming like cream sauces tend to be. I wasn't blown away by the appetizer (avocado and chickpea dip crudite) and wish they gave fresh bread instead of thin bread sticks but the tiramisu I had for dessert more than made up for the short comings.\n\nI will happily return to Cecconi's to try more things on their menu, especially for the 4-7 weekday deal.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-23", "description": "The food was okay, probably a three, maybe a four star review, but inability to find the restaurant really got the whole evening off on the wrong foot.  To get to the restauarnt (at least in the winter when the terrace isn't open), you've got to go through a shopping atrium, but there are no signs indicating that, and when I called the restaurnat to ask for help locating the place, it goes to a recording asking you to leave a message. NEVER going back.", "author": "Martin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "This place was very nicely put together, and esthetically pleasing. There is no doubt about the fact that despite the enormous size, they play the New York waiting game. ( make it exclusive, and people will want it more). I went on line for reservations, and couldn't get a table, then went there only to wait 50 min for an estimated 30 min wait time. I then go inside, and the place is 65% full. \n\nOnce inside, we ordered the appetizers, which were child sized portions, but tasty. Then the food was well done, but again on the smaller size portion wise, but I think the quality was present in the dish. \n\nBut bam!!, that bill was enormous. And it seemed a bit underwhelming and not worth it for this experience. 300$ for 4 people with only 2 drinks on the bill was a bit much for pasta and buffalo mozzarella apps. \n\nI wouldn't return here unless I wanted to wow somebody with the ambiance, but not for the food, some portions, and the value.", "author": "Bernard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Cecconi's is delicious. The whipped ricotta is to die for. New favorite spot, can't wait to go back.", "author": "Emma B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "I would award Cecconi's five stars easily for ambiance. It boasts a large space and comfortable seating, even at the bar which I would guess could shove double the seats around its perimeter than are already surrounding it. I think what brought this rating down, plain and simply, was the food. Unfortunately, my last two nights out have consisted of the same fundamental issue: beautiful decor and picture-perfect backgrounds with merely pretty good cuisine. I will expand on this: I thought the ricotta hot cakes were fairly priced and decent, the hash browns were good (a welcome change from the college dining hall version), and the bread was quite good as well. However, my quiche was nearly cold when it arrived. Honorable mention: the orange juice here is freshly squeezed, and it's really like nothing I've had before. Our service was attentive and professional, and the hostess deserves a raise! (We dined yesterday, 2/3.) I would return for the gorgeous view (perhaps for drinks and dinner) considering the overall locale along the water/proximity to the bridge. It took us quite a while to get all the way down to Dumbo, and foresee myself reserving brunch tables a tad closer to home in the near future.", "author": "Jess S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Please let me start with saying that I was first introduced to Cecconi's thanks to a Yelp Elite event last year (2017). It was one of the best events and best restaurant introduction that has ever happened to me. Thank you Yelp for the introduction \u0026 Cecconi's for hosting that wonderful event (yass). Second, huge shout out to my waitress for this review I am about to do. Her name is Jordania and she was such a wonderful waitress. Absolutely enjoyed her service and recommendations, thank you! :)\n\nReview for dinner on 1/29/18:\n\nAs I said, I've been here before for the Yelp Elite event, so I got an idea of what I want to order and what I want to try/explore more of. There were some items that were served that night that was no longer on the menu so I was pretty upset.. I really wanted to eat it again but oh wells :(\n\nI ordered the follow:\n\n-Beef Tartare: super amazing. Please do yourself a favor and get it. This is one of the best beef tartare I've ever eaten ugh.\n-Shishito Peppers: super yummy. I was surprised at how good they made it.\n-Special Appetitzer that had fluke (really good but completely forgot what it was called. Just refer to my photo please)\n-Burrata: not as amazing as when I had it during the Yelp Event so I was kind of upset but it still wasn't bad. And they garnished it differently than the event.\n-Special Pasta: It was a truffle pasta but oh man. It was so good and creamy, I loved it. But what I really wanted to eat was to revisit the dish I had at the Yelp event: the agnolotti with truffle (ugh please cook it for me when I return, pretty pretty please. It was so good. So upset it's not on the menu anymore.. seriously upset...)\n-Special Fish: Mahi mahi with couscous, super soft fish meat and yummy couscous. We all loved it.\n-Chocolate Tart with Pistachio Gelato: very yummy. Highly recommend if you are someone who loves dark chocolate and pistachio gelato like myself *wink*\n\nDrinks:\n-Vanilla Wlanut Boulevardier: it wasn't bad but not my kind of taste.\n-Applewood Smoked Old Pal: I had a drink at the event that was like a spied orchard( (again, not on the menu anymore :( ).. it was really good but this one isn't bad either.\n\nOverall, beautiful atmosphere. Absolutely enjoyed my meal here yet again. Will come back eventually. Hoping some of the items I mentioned will return to the restaurant. Jordania, you rock. Thank you for recommending all the specials to us, that was an amazing meal. Dreaming of the day I come back soon, mmm. This place is worth a try if you're reading this! Come with a friend or a date. They have outdoor seatings for the summer, perfect for dates!", "author": "Suki W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Excellent pizza, excellent pasta, excellent view with such a rude service! The attitude is not very friendly and customer-oriented at this branch of Cecconi's. Particularly the (the Asian guy with the glasses)host who shows us our table ,which we reserved beforehand, he reprimanded us telling that if we sit outside\"we should stick with it!\" and not try to move back inside if we feel cold because he was such an impatient and all of us hold ourselves not to argue with him in sake of our pleasant dinner night! Otherwise he deserved the same rude attitude he showed!  \nOther than the unpleasant and unfriendly service, this place deserved a huge 5 STAR!\n\nThat is the best pizza I've had in New York so far!", "author": "Jas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Not even done with dinner and I have to give 5 stars. The service is excellent, the food is on point. You'd have to be an Asshole to have a bad time here. And My back is to the beautiful view!!!Don't want to leave can't wait to come back! \nAre you hiring???", "author": "Fernando P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "I'll start with the only positive thing I have to say about this place: it's beautiful. Spacious, wonderfully decorated, and slightly homey for what it is.\n\nFood is good but there is something about the menu that is slightly lackluster. It's definitely not good enough to make up for the horrific service.\n\nMy first time there was for a work lunch with ten people. We asked for something rather specific (wine on a separate check) and it wasn't done. Not a big deal, but when we reminded the waiter after he brought our check over, he rolled his eyes and huffed and puffed at us. Furthermore, we were in a hurry to leave and continue our day so I signed the check in a quick fashion without anyone from the staff mentioning to me that the gratuity was included due to our party size. I'm sure it said it somewhere on the menu, but I handle a lot of large party meals and that is typically something that is pointed out when the check is received.\n\nMy second time there was another work lunch; this time only myself and one of my employees. Our waiter all but ignored us after half our food came out. We saw that the table next to us was offered parmesan cheese after we finished eating. When we asked about it, we were told, \"it's a restaurant, you order things\". Generally it's pretty standard in a restaurant to be offered cheese and/or pepper with your meal. About ten minutes went by once we were done and our table had been completely cleared off before we were even able to flag down our waiter for the check.\n\nIt's nice to have more options for restaurants in Dumbo, but I doubt I'll be coming here again.", "author": "K D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "Amazing atmosphere! Beautiful decor with views of the Manhattan bridge and east river. The bar has beautiful teal chairs and it's the perfect spot to impress a date or friends visiting town. Menu was okay- typical trendy Italian restaurant with pizzas that are trying too hard and too many ingredients. The cavatelli was delicious however.  Service was less than par. We waited an hour to get our pizza and when we politely said we assumed they forgot the pizza and now it was late and we had just asked for the check the waiter gave us a lot of attitude.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Stopped in for lunch as we walked the area.\n\nSeated indoors right away, outdoors was  30-45 mi it's wait.\n\nWe enjoyed the glimpse of the view of the Brooklyn bridge \n\nWe started off with cocktails \n\nThe fresh oysters were delightful'\nBarata and vine tomatoes with basil and olive oil. The best mozzarella I have ever had!!!\nCalamari fritti was  out of this world.  The ambience and atmosphere was lovely and we will definitely be revisiting.", "author": "Claudia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "OMG\nDon't go here.\nWorst service.\nWorst management when I complained.\nTried to charge 40.00 for 2 glasses of wine when menu said 12.00 each.\nStaff looks down on you if you know what I mean.", "author": "Betty O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-22", "description": "Well, let me say that we are locals and not tourists.  Been here several other times.  I'll start with all the positives.... service and ambiance.  The rest all downhill.  The calamari was tough as shoe leather. Basically inedible.  The pizza was good but the  VERY VERY soggy bottom could not be overlooked.  Also a very small pour of the wine at $18 a glass.  Cecconi's you can do better than this.   Big disappointment. Won't be returning.", "author": "Susan R."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}