{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "Our table had AC unit water dropping on our food but the waiter did not do anything about it or wasn't even sorry. He was like 'oh yeah we have that problem.' Like it's a sure thing. I don't think I deserve that kind of service where you pay over $100 for dinner for 2. Food was good but what a shame. Horrible management.", "author": "Olive O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Linguini and a glass of Sav Blanc put me back right around $40. Very tasty and surprisingly quick during lunch.\nIncredible ambience and the food was top notch.\nDefinitely a return in my future.\nCheers,\nPhil!", "author": "Phil W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-21", "description": "We hadn't been to Brooklyn before and were suggested this place for dinner. The ahi tuna app was very good but my brick chicken was over cooked. I ordered the vegan chocolate cake and coconut sorbet to go and got home to realize they left out the sorbet. I was very disappointed for the price and scale of the restaurant. The outdoor location was great for the view and the inside if decorated nicely.", "author": "Lindsay L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "Very disappointing service. We waited literally 2 hours for our main course (the restaurant was not crowded). I was the only one to order pizza for my main course in my party. The pizza came 20 minutes before everyone's main courses so I ate a cold pizza by the time everyone was served. Normally at other restaurants that serve pizza, the waiter let's you know that the pizza will come out at a different time than the other entrees. I wasn't given this warning.", "author": "Madison R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Birthday Dinner for 12 a huge success! we had an amazing time, amazing food, excellent service! pizza pasta galore! Great group service, super welcoming staff with beautiful atmosphere and stunning views!", "author": "Mister D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "My friends had a very intimate gathering of people to celebrate the birth of their first baby.  It was perfect! The room was beautiful, the restaurant team was perfect, and the food was right on the mark!  This was a wonderful spot to gather!  Thank you to the Cecconi's team who made the party so lovely.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Where do I start!!\n\nI visited this place on a busy Wednesday night with my sisters who were visiting from Texas. Upon arrival we were greeted by this lovely, upbeat, perky host (over heard the guy standing next to her say 'no problem Luett' so I'm guessing that is her name lol any-who she asked my name \u0026 did I have a reservation after confirming she stated my table would be ready in 5mins (I was 15mins early) and politely asked did I want to start at the bar or wait on the couches , I opted to sit on the couch. After about two minutes we were seated. \n\nOur server was Anna! Omg she was as great as luett! She gave us great suggestions on what to order what wines taste best she was just simply amazing!!!\n\nThe food came out quickly and was delicious, we had the whipped ricotta, octopus, Buffalo pizza, ravioli, spaghetti \u0026 cauliflower!\n\nThis place is a must visit!!", "author": "Louise J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "My friend and I came for happy hour on a beautiful Tuesday evening so this place was packed! We'd initially had a reservation for 5:30 outside, but happy hour is only at the bar, so we moved inside. We stood for a bit until a couple of seats opened up, which was fine.\n\nThe happy hour deals are just so good! $9 select cocktails, $7 wine, we also got the crudité which was amazing and the avocado dip was delicious (I think this was only $7). We also took advantage of the yelp check in to get a free pizzette each. \n\nOff the regular menu we ordered the whipped ricotta with truffle honey which was amazing! I've been thinking about it since.\n\nThen, our bill took a while to come, so our bartender gave us free mini glasses of rose-- so nice. \n\nSomehow we left paying less than $25 each for multiple drinks, and we were actually full from the few appetizers we split. \n\nWould definitely recommend happy hour-- just get there early!!", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "The food was great! Especially cauliflower and profiteroles! Great service too. You can also enjoy the city view and happy hours from 4 to 7 ))))", "author": "Tatiana F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "Posh Italian restaurant in Dumbo with beautiful decor and Ok food. Came here for brunch on a Saturday afternoon. The staff was friendly and managed to accommodate 5 of us despite not having reservations.  The pizza and pasta were Ok; but the LEMON MERINGATA dessert is one you cannot leave here without trying! Absolutely delicious especially on a hot summer afternoon!", "author": "Tiffany F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "I just moved to Dumbo and have eaten here about 6 times in the last 2 weeks. It's a gorgeous setting on the water and the food and drinks are delicious. \n\nOur experience one time was almost soured by less than friendly treatment by the hostess when we sat down. She informed us that we couldn't sit at a table that would most comfortably accommodate my baby's stroller because we were only 2 people. I pointed out that there were other parties of 2 sitting at the same 4-top tables. She replied that \"they had reservations\" and I said that I had a reservation too. She very rudely and reluctantly allowed us to sit there anyway, but she sent the manager over to let us know we had to give up the table at 1:30pm because he planned to combine it with the adjacent table then. No problem, we agreed. But at about 1pm, they sat a new party at the table they supposedly needed to combine with ours. There were also several empty tables around us the whole time we were there. I noticed in a below review that other diners had similar experiences with the hostess. \n\nLuckily, this bumpy start was quickly remedied by our amazing service from Raul. Raul makes excellent food and drink recommendations but in general is just extremely warm and friendly and attentive. Yusef also helped to make our experience wonderful. \n\nWe will be back thanks to Raul and will ask for him every time.", "author": "Catherine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Look this place is understaffed and the service can seem lost. The checkin is a mess. Lots of walk ins slowing everything down especially European tourists (you know what I mean). But I found the staff to be friendly and accommodating - we switched tables after being seated and got a great table at the window. The cocktail program is on point. For reals. Every course was delicious. Our truffle pasta was on a Batali level. With gentle prodding you can move things along. The power move is probably eating and drinkng at the bar. If you want another drink and you see a server just grab them. This isn't fine dining. It's a fun hip very nyc spot with a great crowd and an amazing view. Had a great time and def coming back. Highly recommend. I'd give it five stars but at this price point service needs improvement.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Had a wonderful brunch today. The food was great and It's great for toddlers as well. Highly recommended!", "author": "Susan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "I was initially skeptical about a high-end, UK-based, restaurant chain that boasts stellar Italian cuisine coming to Brooklyn, a borough (and city in general) that probably does Italian better than anyone outside of Italy. I was right to think the food wouldn't live up to local expectations. But I was wrong to think that that's what Cecconi's is really about.\n\nCecconi's is a public restaurant that's meant to feel like a private club. Its gorgeous space is a mix of red brick walls, rustic blue chairs, pearl white tabletops, and matte gold accents. The waterfront location is hard to beat, patio seating boasting views of the Freedom Tower, Brooklyn Bridge, Jane's Carousel, and Manhattan Bridge all in one social media-ready panorama. The clientele is equal parts old money, new money, and just-well-to-do-enough wannabes like moi. It's an excuse to get a little bit more dressed up than usual. It's a sure-fire date night winner.\n\nAnd while having the allure of a place you can't afford, the prices really aren't all that offensive. In one of the most expensive neighborhoods in the city, Cecconi's Dumbo could probably charge more and get away with it. (Not that that's a suggestion.)\n\nBut the food. It's easy to feel like this is where Cecconi's falls short, beneath the high bar it's set for itself (and probably more accurately landing within totally acceptable cuisine territory on a general scale), given the restaurant seemingly checks off all other upscale boxes. The house-made pasta in my Maine Lobster Spaghetti was fresh and well-cooked, but the advertised saffron notes went unnoticed in chunky tomato sauce. The Kale Salad paired well with its diced apple, but the greens were nearly shredded to smithereens. The Whipped Ricotta was more like a mousse, yet had hints of honey and sea salt that came through with the right crostini bite. Nothing was mind-blowing. Nothing was terrible. That's all to say, it's mediocre Italian, in a city that really has no time for mediocre Italian.\n\nRarely would I recommend a restaurant after that admittedly lukewarm culinary breakdown. But somehow, Cecconi's is an exception where I am almost hypocritically telling you to look past all of that and not allow it to deter you from planning your next date night here. Like I said, it's just not all about the food here. It's about the vibe, the views, the scene, the illusion of exclusivity, the fact that it's just a really nice, respectable place that'll impress your date. And again, one that looks way more expensive than it really is.\n\nGroucho Marx famously resigned from the Friar's Club of Beverly Hills by quipping something along the lines of \"I don't care to belong to any club that will have me as a member.\" If Cecconi's was a real club, I probably wouldn't be let in. But thankfully, it's not, and therefore, all it took for me to walk through those doors was a reservation (albeit one month out, so plan accordingly). Cecconi's allows me to fake it without the self-stigma concerns Mr. Marx so cleverly joked about, and trust me, there are worse-off places to dine on middle-of-the-road Italian. So try to fuhgeddaboudit. And welcome to the club.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "OMG! Where to start? The View, the food, the staff, the drinks? Fantastic! We were a party of 6 on a busy Saturday night. We were lucky to score a reservation on Open Table. We have visited the South Beach location on several occasions and were anxious to experience the Brooklyn location. We were not disappointed. The food was terrific! I had a big lunch so I opted for the ahi tuna tartare and the butter lettuce salad! Amazing. In our party we also ordered the spelt orecchiette, arrabiata, pecorino; the meatballs; beef tartare; and the buffalo mozzarella pizza. All raved about their selections.  The portions are small, but the quality is excellent. We will be back!", "author": "Susan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "Reviews pretty much speak for themselves. This is an average 3 star restaurant, with average food. We ordered the tuna tartar, kale salad, two pizzas, and dessert, and it wasn't anything spectacular. The views and ambience of the restaurant is what you're paying for. Unlike in the other reviews, the food came out very quickly. Waiters however, seem to always be in a rush, and not really have time to explain things.", "author": "Marta D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Awesome views, and wonderful food! Great, friendly service. Raul is a very gracious and attentive waiter!", "author": "Sharon A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "Atmosphere : Really cute place. Beautiful views. The staff is very friendly. If you don't have reservations - good luck . \n\nFood : truthfully - just over priced italian food. We got the meat and cheese platter which was good. For entrees we got the beef bolognese \u0026 the ravioli - small portions ; wasn't great . \n\nWorth the experience if you're around .", "author": "Tania M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-08", "description": "Stay for the views but pass on the food and service. \n\nThe waiter was friendly but when we asked for bread, he ignored us until we asked for a third time. They proceeded to give us skinny bread sticks while other tables got bread. \n\nI ordered the salmon and it was a bit overcooked and dry. My friends had the pizza and eggplant parmigiana and thought that the food was mediocre. We also ordered the calamari to share and that was too rubbery.", "author": "Tiff L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "We enjoyed an amazing brunch here - everything was impeccable! The setting is so beautiful and chic. Mimosas were delicious in lovely coupe glasses. The whipped ricotta with truffle honey is a MUST! Eggs Royal and Eggs Benedict were the best we've ever had. Everyone loved their food and the ambiance is gorgeous.", "author": "Lucy H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}