{"aggregateRating": {"reviewCount": 507, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "We stopped here based on many reviews thinking we would enjoy a good meal in a nice ambience.\nThis place has TOURIST written all over it.\nThe service was unbearably slow and inattentive.\nThe food was mediocre at best. We were excited to try some of the well reviewed handmade pasta. We ordered Agnolotti and Campanelle and found them to be lacking. Do yourself a favor and try one of the many local places in Dumbo.", "author": "Fran O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "I work in a Michelin Star restaurant very long. I have never been more pleasantly surprised by any restaurant I've been. The bartender ADRIAN did an amazing job.\n\nMy boyfriend wanted to bring me to Cecconi's since the winter. Today, the weather was finally nice and we decided to go there. We didn't book a table, since it's only Tuesday and wouldn't be busy. But, on the contrary, it was with one hour wait. Very disappointed we went straight to the bar to have a drink before we sit.\n\nFirst thing I noticed is the uniform of the bartenders-a white suit with a tie. It really looked nice.\n\nThe cocktails were amazing. Our bartender did a great job. Not only that he is an amazing bartender-he's a great server too. Open hand service all the time. He was exiting the bar in order to setup or clean the bar. Proper way of cleaning, first my plate(I'm a lady), after my boyfriend's - taking the utensils one by one. My water glass wasn't empty. Before my last sip of the drink, I was asked if I want another one. \n\nHe also made very good recommendations. The Special of the day was mentioned in the first 5 min!!! He had a huge knowledge of the menu. \n\nAt the end we decided to stay at the bar because we got 5 star service. \n\nThe food was amazing. One of the best beef tartar I've ever tried. Our bartender placed salt and pepper right away, but we didn't need-everything was perfectly seasoned. \n\nThe prices were normal. \n\nThank you so much for the beautiful experience. I will be back.", "author": "Iskra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "This place was great for a date on a summer night. If you go here and do not order the whipped ricotta with truffle honey- I personally give you 1 star. It was amazing I just wish they gave you more bread with it! But because they have the free buffala pizzette when you check in here it filled that extra bread craving. My bf loved the calamari here but I was not a fan- it was not as fresh and the batter was too thick for my liking. But the ricotta, pizzette and the meatballs we got were great. Our server was also very attentive and they got me a tiramisu for my birthday with a candle. The view here is also amazing so make sure you sit outside!", "author": "Megan V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-05", "description": "Skip it. Having been at other Cecconi's in London and Miami I assumed this would be the same great service and food. It misses the mark across the board. The staff is rude, they do not honor reservations and you will wait forever, unorganized and the food is nothing special. This restaurant is a complete mess. Do yourself a favor and take a pass on this one. There are too many great restaurants who know how to operate and serve great food.", "author": "Joni W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Boulivadier, spicy salami and mozzarella pizza, carpaccio and lemon meringue dessert  Great service, great view, outdoor seating with a great view. Get the lemon meringue!", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "This restaurant is located right on the DUMBO waterfront and offers incredible cuisine with beautiful views. My grandmother and I sipped on pear Bellinis which went down dangerously easy (in the best of ways). We started with the fried calamari, which was lightly breaded with a little spicy kick, as well as an avocado and chickpea dip and crudité platter. The platter came with a lot of veggies, and between this and the calamari, they alone could have served as our meal. We ended up both ordering the salmon and asparagus as our entrees and it was fantastic. The asparagus was perfectly cooked and the salmon tasted delicious. Finally, we had some of the pizza they offered and it didn't let us down. I would eat here again in a heartbeat!", "author": "Riley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "The food is fantastic, the service was warm, friendly and attentive and OMG, the view from the terrace was spectacular, making me feel like I was on vacation or something!  I took advantage of the check-in offer (small pizza), which was delicious.  I splurged and had the spaghetti with lobster, which was outstanding.", "author": "Deborah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Best restaurant ever! The Ricotta with truffle and honey is out of this world and you can't go wrong with any of the pastas!", "author": "Savanna Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-19", "description": "Cecconi's in LA is a high-walled institution, known for its celeb-spotting and glamorous guests. This Brooklyn outpost may be a tad more subdued when it comes to star-spotting but the food is just as good. The starters are generous, and the service attentive -- should you run out of crostinis to go with your delicious ricotta spread, you'll be brought more without haste. Warm atmosphere, and a lovely place to enjoy a beautiful evening appreciating a New York version of an LA staple.", "author": "Nadia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Absolutely amazing restaurant experience for those of us spoiled with fine dining inNY. Had an amazing time celebrating our girlfriends birthday, stunning views, delicious food and drinks, cozy and luxurious design and top notch service, especially our waiter - RAUL, gave us a royal treatment and made our birthday celebration absolutely amazing, definitely coming back here. If you come here ask for Raul to serve you. Great times and great dining and wining experience", "author": "Mira J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Come for the view, but be sure to make a reservation first.  The bar scene is a great experience on its own, but to ensure seating for your party, be sure to make a reservation.  The food was really good and the pizza was a step above.  The reason this doesn't quite reach five stars is because the service is inconsistent.  Bartenders who say they will be right with you, but never return.  Servers that inconsistently check on your table during the meal or fail to come back when you want to ask for the check mar an otherwise enjoyable experience.  I will still return for the view in the warmer weather so I can enjoy a seat outside.", "author": "Ally B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Came here for surprise by my husband. The hostess was very nice and accommodating. It was busy night and long wait, but they offered us a seating for 2 right by the window overlooking the Manhattan bridge and Jane's carousel. The waitress was nice and attentive. The food okay. The tartare was the best!! Definitely will come back again. I enjoyed the experience.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "One of the most beautiful view in the city and food is not even less. Super cozy, extremely yummy and absolutely heart melting service. Thanks to Raul (our waiter) for making our Birthday Party so special. He took care of everything and gave us great recommendations. Definitely will be back.", "author": "Alina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Just was here on Sunday for brunch with some friends.  The restaurant was nice, clean and good service.  I would highly recommend making reservations as they do take reservations, however despite not having reservations we only waited 30 mins for a table in the Courtyard as all the outdoor seating facing the bridge was taken or already reserved. The food and drinks tasted good, everyone reported liking their meal and food having flavor. Bathroom was clean and nice, I noticed someone replenishing supplies and emptying the overfill waste basket(trash).", "author": "Rochelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Came here for my birthday brunch , first time in NY and this place was amazing! Also their complimentary birthday dessert was amazing", "author": "Liz T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "My husband and I came here for our 1 month wedding anniversary and we had a wonderful dinner and experience. The place was pretty packed on a Monday but as soon as you come out where the outdoor seating is - you understand why! The views are so beautiful! You see the Freedom Tower, the carousel and the Bridge. \n\nOur waiter was very nice and attentive. He came over to us several times throughout the dinner asking if we needed anything else and checked in with our experience. \n\nNow for the food: \n\nAppetizers/Starters\nThe meatballs - so good\nThe tuna tartare - fresh, delicious\nThe guac \u0026 chickpea dip with the fresh veggies - refreshing, tasty and light\n\nMain dishes\nAgnolotti, chanterelle, truffle, parmigiano - AMAZING! i love pasta. This was so good, creamy, flavorful \nHusband had the salmon which was perfectly cooked but he liked my pasta better. Next time he will have a pasta dish lol.\n\nDessert\nThe panna cotta - perfection\nProfiteroles, gianduja gelato, chocolate sauce - dough, ice cream \u0026 chocolate sauce - cannot go wrong!\n\nWe will definitely be returning \u0026 trying one of the pizzas (or maybe all) lol.", "author": "Julie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "Terrible food,terrible service the only thing that i was enjoying was the view\nOf the bridge deff not going back anymore", "author": "Agos S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Me and my husband came here for the first and we loved it! The atmosphere inside is super cozy, but elegance at the same time. The view to the Brooklyn bridge is just breathtaking. Very nice location for the restaurant! \n\n\nThe stuff is so polite and friendly, waitress came over every 10-15 min to make sure everything is fine. Everyone is smiling and trying to help. \n\nI also really liked the design inside of the restaurant! They have some cool paints that I would love to have at home. Music is playing on the background so it's not annoying, but you don't eat in silence as well. \n\nTalking about food, everything was great!! 5+++. We got rigatoni bolognese ( mouthwatering!), wood oven pizza with buffalo mozzarella, tomato and basil ( it was thin as I like and delicious). We also got some Parmesan and prosciutto for start. It was fresh and smelled like Italy lol. \n\nAlso you can find a lot of nice cocktails variety, we ordered Aperol Spritz ( good as always ). Well, definitely a nice experience and we will be back with friends!", "author": "Nikolina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-10", "description": "Well... I really really really wanted to like this place... why is does the service have to ruin the most beautiful atmosphere and space ?? Cecconi's had every potential to win me over and have my loyalty forever... \n\nCame here 9:30 Sunday night. The place was not busy, I am not sure why it took 1.5 hours to get pasta dishes \nDrinks also arrived 30 min after ordering :(\nI mean, cmon...", "author": "Alina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Omg! Spaghetti lobster the best the I ever try, the service is amazing , I love the cristal glasses this is a fancy place my friend and me else have so a good time here we spend like 4 hours eating and drinking lol.", "author": "Brenda H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Cecconi’s Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "55 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HkjbGNqRM-tIpOXeCmh2sg/ls.jpg", "@type": "Restaurant", "telephone": "+17186503900"}