{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "They have the best breakfast..... Everything is fresh and delightful.  Friendly atmosphere and on a Saturday they in early.....yayyyy!!!", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "Affordable place, lunch specials between $5-$9.\nSmall inside, around four tables.\n\nIt gets crowded during lunch hour.\n\nTuesdays and Thursdays, they serve cow foot soup. I love soups, but I really love this one here.\n\nIt is always served hot and with lots of cow foot.\n\nThe soup has chunks of carrots, pumpkin, dumplings. The taste has its kick with some pepper, but who's complaining?", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This is my favorite place for patties in all of NYC. I've been coming here for years and I have never been let down. Their staff is always warm and service is always fast. All of the food is good here but the patties are my favorite.\n\nIn general, I don't love how Jamaican food places run out of patties after a certain time. It really breaks my hungry heart. I really wish I could get Jamaican patties at all times of day, especially around dinner time.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-19", "description": "I decided to try Patty Plus on the hottest day in Spring since NYC has been hit with unusual weather. I was visiting for breakfast as I was taking my son to a tutoring session at Sylvan right across the street from Patty plus. \n\nI ordered a salt fish and provision (s) and a beef patty for my daughter. The provision still had water on it. The server didn't drained it out so it got mixed into the salt fish which didn't have flavor. The salt fish with tomatoes and onions are supposed to have some remanence of salt. There was none. My daughter didn't like the beef patty and neither did I. The meat had a unseasoned taste. There was absolutely no flavor in Patty Plus food. \n\nThe location is perfect, but they need to improve breakfast and their patty's", "author": "Petrina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-01", "description": "Just order two soups from Patty Plus...  I found a roach in my soup, after sharing it with a friend... and drinking almost half of the large cup of soup...  When calling to complain although they didn't seem bother they did apologize and gave me a full refund...  Worst part I'm sick and now I feel even worse!", "author": "Pdpg P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-15", "description": "November 15, 2018, lunch time, I bought a small chicken soup. Behold, there were no chicken meat and abundance of chicken bones, as if Patty Plus Restaurant feeding a Dog!  \nThis restaurant should be a-shame of themselves on serving nothing but chickens bones in a cup of soup I gave One Star and this restaurant should get a half of Star instead.....SHAME ON YOU, PATTY PLUS Restaurant Brooklyn NY 11217!!!!", "author": "Sheba G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Downtown Brooklyn is a desert when it comes to Caribbean food - you're essentially stuck with Golden Krust and this. Yesterday, I ordered the small curry chicken and a small brown stew chicken. Both came with rice and peas. One was $6, the other priced at $7. The portion sizes were plentiful and the food was delicious. They also sell roti, but uh... I've never been brave enough to get roti from a Jamaican restaurant - gotta' leave that to the Trinis. There's always rotating specials as well. Yesterday was no exception, as they had jerk pork. \n\nI'll definitely be frequenting here more often, now that I know that it's a great value.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "After craving authentic beef patties, we decided to go here for lunch. This was by far one of the worst patties I've had in my life. I am unsure of what kind of meat was used in their beef patties, but it was disgusting. Never again.", "author": "Tameka Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-19", "description": "no customer service skills what so eva... you service represents your food... kick rocks...never again", "author": "Dre H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "I didn't read the reviews before coming here. Just came because I wanted a chicken patty. The owner was closing for the day but she took pity on my and let me in. The patty was delicious, the best I've had down here in a while  (bc golden Krust is just not cutting it anymore!). So I decided to bring my husband over and he ordered the roti and I the jerk chicken. I was a bit disappointed with the chicken, wasn't spicy at all but the roti!!! Oh was that roti amazing. In so much that I ended up switching places with the husband, sorry not sorry :-) The only suggestion I would make is to get fly tape. There were too many flies there for my taste.", "author": "Beatriz R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "I'm so upset I hate eating Caribbean food when it does taste like it. The stew chicken was horrible has no favor and watery. I'm forcing myself to eat this and I haven't ate all day. I don't see myself coming back here especially since it was my first time but customer service was good", "author": "Ikihesha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "This is a must stop if you are in Downtown Brooklyn. Their food is phenomenal and the service is spot on. Jerk chicken, jerk pork, oxtails and whiting cannot be beat. Homemade hot sauce is fire, absolute perfection.", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Authentic and amazing Jamaican food\nYou don't go here for customer service. You go here for a taste of Jamaica in Brooklyn", "author": "Mohammad S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "Well first off I seen the name and figure it's a 5 star party store and they got all kinda patty's but they don't they chicken patty was a lil dry and I'm disappointed I drove 35 mins for a dry patty and they only had chicken and beef so they sucks wouldn't go again", "author": "Shotah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "I love this place the service is great the staff is fast and friendly. the food is proportioned so well. the sweet delivery boy usually gets to me within about 20 mins of me placing my order. I only ever had one issue a new girl only put 2 pieces of chicken on my platter but when I called the friendly manager apologized and sent a new plate of their delectable   curry chicken their potatoes are so good", "author": "Tini S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "I got the oxtail meal with rice and peas, veggies and plantain and a beef patty. Food plate was good but I wish they had sides like Mac and cheese. Patty was okay. The crust tasted good and homemade but the beef filling was lacking in flavor and it looked like there was some sort of filler inside, not just beef", "author": "Tatiana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Patty plus is lit! The food is made with love and the people who run it are truly the best. The rasta pasta is a much try...yo really can't go wrong. Love this place!", "author": "Craig K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Food here is amazing. Have not had anything I didn't like.  Definitely has a very homemade quality to everything.  The chicken soup is hearty and filling.  The curried goat is crazy flavorful and perfect amount of spice.  This place is a home run.", "author": "Cam R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "We use to order from here on the average  of  2 to 4 times a week  until March  3026 when we  received an order of cabbage with a cooked  dead  roach.  When  we  reported it to the  store  manager  he offered another  serving instead of  throwing out the pot  to protect others.  We had to demand the refund.  He didn't believe  us so I took the cabbage out the trash with the dead roach cooked on it and submitted it to the store.", "author": "Ziva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "It's a pretty narrow store inside but the amicable cashier knocked out the line quickly.\nGot the Beef, Chicken patties plus an oxtail roti, total to about $16 (patties are $2/each, $11 for the oxtail roti).\nThe patties were delicious, especially the chicken one with its curry sauce. The beef one was good too with a pleasant flavorful after taste. The crusts weren't too thick and the size was just right to hold. Plus a small amount of oil residue on the bag that held them, so they aren't overly greasy.\nDefinitely coming back to try out other dishes, specifically the jerk chicken because of the number of people ordering it on line.", "author": "Kenny L."}], "servesCuisine": "Caribbean", "priceRange": "Under $10", "name": "Patty Plus", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "324 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/L2JZEkSkM14IaNXJV-xkZQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185227565"}