{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "My First Time Trying Patty Plus \u0026 Very Pleased With Service That I Received Today ...Called In For Delivery ..Female On Phone Was Very Nice And Took My Order In A Timely Manner ... Was Delivered On Time As Promised \u0026 Warm.... Ordered The Oxtail And Enjoyed Each And Very Bite Of My Meal...Thank You Patty Plus ...For Sure Will Try More Items Off Menu In Future", "author": "Zoey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Their goat soup , is by far the best I've had from a Jamaican restaurant. All I can really say is you've gotta try it. Food is yummy", "author": "Karen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "This place! Where do I start?\n\nSo someone suggested I get lunch from here for the following reasons:\n1. I work in the area\n2. It's reasonably priced\n3. I'm Trini and I love West Indian food\n4. The food is really good\n\nSoooooooooo, yea. Two out of those four were (and still are) false. FYI I do work in the area and I am Trini -_-.\n\nFirst issue. They accept cards but the card machine has been down for over two weeks. Really guys? This is how your establishment runs? Secondly, the food is flavorless....and I am not exasperating here. I had the oxtail with veges and was upset the entire time I forced it down. (It was 5mins before a meeting and I needed something in my stomach for the gym later). Sigh. I have made oxtail many times, and even on my bad days I still thoroughly enjoy it. I'm not sure what happened in that kitchen, but somebody at this establishment needs to learn to cook ASAP!!!\n\nAside from the terrible food, non-functional credit card machine, and the slightly high prices, THE STAFF IS VERY NICE. That is indeed the only good thing about this place. \n\nFood: 1/5\nPrice: 2/5\nLocation: 2/5\nService: 5/5", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "The Host was a complete ditz. Completely forgot about my party of 4 which is hard to do because the whole restaurant only fits 30 people. The waitress came up to my party as we sat in the \"lounge\" area which is two benches behind another table in the back corner. Greeted us as if she was going to take our order and then said \"Hey guys hows everything Im going to go serve that other table over there\" and walkwd away. No one came over to let us after that to let us know when our table would be ready. I had to walk back to the front and ask the host if we were going to be seated. The bust boy gave the best customer service in the entire establishment he was warm enthusatic and showed a great sense of urgency. As I got started on mimosas I noticed the glasses werent cleaned. There had been maroon lipstick markings on two of my classes. The mac and cheese seemed like blue box macaroni.  The fish was mediocre. The service was horrible. I wouldnt go back or recommend this spot to anyone.", "author": "Dose D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-09", "description": "I've eaten here on several occasions and the food and service are always great. Tonight however both were subpar. I ordered medium jerk chicken with white rice and plantains, with oxtail gravy on the rice. When then order arrived I noticed vegetables in my meal. Apparently cabbage and mixed veges a comes with every meal. I said don't worry about I'll put it to the side. I specifically asked if the utensils were in the bag, the cashier said. I thanked get and left. When I reached my destination, not only did she not give me any utensils, I got rice and beans. I guess she has selective hearing.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "Good food but HORRIBLE, HORRIBLE, HORRIBLE customer service !!!\nPlus, they DO NOT know how to talk to their employees, which is SAD!!!!!\nThey just lost a few customers", "author": "Laura J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "When the place is called pattys plus you got to have a patty. \nOk cheap and grab and go food near LIU Brooklyn that's not dollar pizza.", "author": "Jandriod P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "When I discovered that Patty Plus existed a mere half mile from the office I was excited. When I discovered that it had not been reviewed yet on Yelp, I was doubly excited (2 first reviews in 1 week? wowzers!). When I got there and saw the dreadful \"Grade Pending\" on the window my excitement died down considerably.\n\nI went with the chicken curry roti, my Jamaican coworker decided on the BBQ chicken with rice and beans, and we each got a couple of desserts (potato pudding and currant roll). Meh x3. We both agreed that my curry chicken needed more spice and her BBQ chicken lacked any spice at all. I tasted it - it was smothered in a tangy, yet otherwise flavorless sauce.  The currant roll was \"OK\" - honestly, the best thing was the potato pudding. Reminded me of a weird looking pumpkin pie. \n\nThe people behind the counter were nice, but I really don't think I'll be back after having the food. I'll stick to the mile walk to Buff Patty on Myrtle, even if I weren't the first to review it.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "I got a Special stew chicken meal. It came with brown stew chicken, rice and peas, and cabbage. The chicken was super tender and juicy. Then, a few days later, I got a chicken patty. It was wonderful. A lot of places use frozen chicken patties, which look like the remnants of a baby's diaper in a fluorescent yellow shell. Theirs contains actual pieces of chicken in a slightly spicy curry sauce, and the crust is clearly homemade (restaurant-made??). I need to come here again.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "The little scotch bonnet.  To the naked, untrained eye he looks rather cute and harmless.  Yet, mess with him and you will be in tears.\n--------------------------------------------------------------------------------------------------------------\nThe curry goat and the oxtail here are very hearty with just the right amount of heat and nice gravy consistency that marries well with the rice and peas.  On a cold day these two dishes are a very good consideration.   \n\nThe beef patty, despite having better flavor than the standard pizzerias or \ndelis, (as it should esp. when it's part of the name of this place) needs to have more ground beef to truly have itself elevated. Otherwise, it is too watered down by the meat sauce.     \n\nThe jerk chicken, the West Indian staple dish, is ridiculously hot.  And yes, I am aware that jerk seasoning is supposed to be hot. Here, however, it reaches the level where the meat is overpowered  beyond reason. It does not help that the chicken is too dry either.  Any attempts to temper the heat by digging into the rice or steamed vegetables are futile because the spice from the chicken permeates through everything it comes into contact with. There is no escape.  I recall my friend was crying like a baby when he ate it and did not wind up finishing that small lunch special. Mind you, I love hot and spicy food.\n\nIronically, the stewed chicken and the BBQ chicken turned out to be under-seasoned.  \n\nThis place is hit or miss (mostly the latter) depending on what you are getting. Once in a while, especially on a brisk, chilly day,  it is worth a visit - just be wary of their jerk chicken and the little bomb that sets it off - the scotch bonnet.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "I don't know where it would EVER be considered okay to take nearly 3 hours to deliver food. Ive never witnessed anything like this in my entire life. I am so surprised by the complete lack of customer service. The indifference is so typical of this type of establishment. It's why they will never thrive in business. And the food was subpar on arrival. Perhaps, would've been a lot better had it not taken 3 hours. This place is dead to me.", "author": "Cassie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "The Good: I really like their fried whitening with plain crust. The combo is mmmm mmmm good and its less than $5. (Btw, this is the only thing that I order from here).\n\nThe Bad: The other food on the menu is a bit pricey for a bakery/restaurant.  Also, they need a bigger seating area.\n\nThe Ugly: None for this establishment.", "author": "Dolores O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-09", "description": "Came here cause i was at jury duty and in the mood for west Indian food. I decided to get the jerk chicken with rice and peas (comes with a plantain and cabbage) I thought the chicken tasted pretty good. my only complaint was the chicken was butchered alilttle to rough,so i needed to watch my bites for bones.", "author": "Olena P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "I was hesitant to place an order since 3 out of the 4 reviews were negative. However, my coworkers and I wanted to try them out since Golden Crust is the only other game downtown and GC doesn't deliver and Patty Plus does! Well 6 of us ordered and we all enjoyed our food and 3 of us are Jamaicans! We ordered stew chicken, jerk chicken (surprisingly spicy, not for the faint of heart), curry goat and escovitch snapper! Everything was delicious and the delivery was fast about 20-30 mins., which was great considering our proximity. We will definitely be ordering from here regularly. The other reviewers must work for the competitor!", "author": "Ann W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-03", "description": "Save your money! Go elsewhere (like the Golden Krust on Lawrence St)! Consider yourself warned. When I walked in the first thing than struck me was the dim lighting. The pastries in the foggy display case looked old and dried out. Guess, I won't be getting that sweet potato pudding, I thought to myself. I came here because a co-worker suggested I try it and let him know how it was.  We usually get some awesome patties from Jamaican Pride Bakery, but didn't want to make the trip there that day. The beef patty looked especially small and a little over baked judging from the crust. I should have turned around and walked away, but no, I handed over my money for a mild beef patty and a cheese roll (made from patty crust). In recent memory, this is the worst beef patty I've ever had. The crust was soft but still somewhat dry, like they had skimped on the butter in favor of more water, when making it (Yes, I know a thing or two about making a good beef patty!). The filling was, I kid you not, black and indistinguishable from a pile of muck. The taste was salty, and I'm still not sure what I ate because it shared no tangible or apparent likeness to beef. The cheese roll was worse. The yellow goop in the middle was also salty and reminded of cheese whizz. The only reason I'm giving this place two stars is because lunch meals looked decent and the staff was nice.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "Perhaps my favorite spot to grab some lunch in this neighborhood.  The curry chicken or goat with rice and peas is amazing, and the patties are fantastic... you'll never look at a pizza store patty the same way again.", "author": "Doug M."}], "servesCuisine": "Caribbean", "priceRange": "Under $10", "name": "Patty Plus", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "324 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/L2JZEkSkM14IaNXJV-xkZQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185227565"}