{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "One of the most lowkey dope vibe in Cobble Hill yet. I love the ambiance, the wait staff and most importantly, the food.\n\nESCARGOTS- Do it.\nMUSSELS with Thai Curry-Oooo La La LA\nFRENCH ONION SOUP- Meh, Can be too sweet\n\nMy fave yet is their RISSOTO. Ever changing, mushroom, aspargus, all so made perfectly.\nMy dude loves the steak frite and lemme tell you what's even more dope...the FRIES.\nADDICTIVE CRISPY THIN FRIES. MMMMMMMMMM\n\nPrice Range- Expected $$ but fair, not shabby\nDo it up and get a bottle of wine-worth it.\n\nFRIES FRIES FRIES FRIES\nGulp.", "author": "Davina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "We had a surprise 50th bday party for our friend there. There were about 20 of us. \n\nWhat a beautiful spot! It looks like a small cozy restaurant and a bar when u walk in but there is also a hidden magical speak easy. The ambience is beyond great! The cocktails are beautifully made. The glass wear is unbelievable and medieval. \nWe only had appetizers and they were delicious (smoked salmon, nuts, olives, foie gras). \nAnd lastly, the stuff was the most pleasant group of people. They were friendly, professional, attentive, polite and fast. \n\nIt is a perfect space for a date too! So so good!", "author": "Kate N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "This is for Boudoir the mixology bar behind the book shelf. The drinks there were well crafted and on a Saturday there was just enough people there to be comfortable but still interesting. \n\nI would go back for a chill drink with friends.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "We went there for our anniversary dinner and absolutely LOVED the food and the ambience. We had the skate with lemon butter and fava beans. The sour and the creamy flavors merged perfectly to create an exquisite dish. The drinks were great too - I had the bisou (bourbon based cocktail) and my husband had the Cote du Rhone, both of which were excellent. Perhaps the only thing I would say they could improve would be the bread. We will definitely be coming back!", "author": "Nilanjana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Dinner is great but I find the brunch to be so so. Service is always attentive and friendly. I really enjoy the muscles and the bar downstairs is fabulous.", "author": "Tara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "The person who makes Chez Moi such a special place is Cat who is a masterful bartender and all around amazing presence. She's positive and fun loving but also hyper focused on her customers. Give her a promotion.", "author": "charles p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-24", "description": "I wanted to love this place I really did. Super cute and cozy inside, my waiter was attentive and nice but food took forever to come out - definitely over an hour. When it did arrive it was bland. They also jacked up one of our orders but ended up giving it to us on the house which was cool. A couple next to me was going off on the owner because they to were waiting on their food. I don't think I'll be giving this place another chance sadly.", "author": "Camille W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "Cute little place. Adding bacon and egg to the burger was the way to go. Good fries too. Tuna tartare and beet salad were fine. Big cocktail selection.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Brunch here is great.\n\nThe mushroom/spinach/cheese crepes are good and comes with two large rolls and a bed of salad. I wasn't even able to finish the second crepe on the plate.\n\nThey also have a good looking cocktail menu with freshly juiced fruits instead of the store-bought stuff.\n\n+ good brunch food\n+ generous portions\n+ fresh squeezed/juiced fruit for juices and cocktails", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "Food was on point and I really wanted to give this place 4 stars but we had a couple of issues during our meal which made me knock off a star. \n1. We were 2 people and they sat us at a table that seemed to be halfway into the main walking area of the restaurant. In reality, this table shouldn't have existed in the restaurant's layout. \n2. No one ever came to ask us if we wanted another drink or check on us. When we finally got our waiter's attention, he took my wine glass without asking and it still had wine in it that I was drinking! \n3. It took an inappropriately long time for us to get our second round of drinks. \n\nOverall the food was very good so I'm hoping these issues are a one-off thing.  We had the beet and goat cheese salad (tasty), sardines app special (bones were too tedious), salmon with ratatouille (medium rare and delicious), and the fish of the day (a white fish with a name I can't recall, served with a fennel salad - both were excellent).  \n\nI would go back and hope the service is better.", "author": "Gati D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Minus 1 star for slow service, but 5 stars for food and beverage. Huge Quality beer list, with make your own flights. I had 3 amazing sours I had never heard of and wasn't disappointed. The entree sale I had was perfect and delicious, along with the toasted focaccia. Will definitely be back.", "author": "Terri M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Came here for an early dinner before heading to the city for a show. At the time we showed up was happy hour, they were only serving  $1 oysters  and drinks. So we ended up getting oysters ( tried all 3 kinds- the cupcake were the best). We also got french onion soup (so good), the frog legs (first time for both my boyfriend and myself) and were very pleasantly surprised. We both got different fish entrees and both were very flavorful. Will definitely be back", "author": "Dina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "I like Chez Moi a lot! Great Happy Hour with Buck Oysters, good cocktails, and cute ambiance. I also really like their Skate entree - not the best I've had but more than decent. A good steady option if you're craving French food in the area.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Great surprise when I discovered this little French restaurant. \nMe and my friend are real Parisian and very picky about food even more when it's French Food!! \nEverything was very good, food and cocktails were super tasty, the waitress was really nice and the manager even more. \nThe restaurant is very cosy with little candle light at night and great music.  \n\nSo if you want to have a great time you should definitely stop by \"Chez Moi\" ;)", "author": "Tatoo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "This is the cutest French restaurant! My family was visiting me South Brooklyn after a show and we popped in here for dinner. I got a 'soup of the day' which was a creamy cauliflower soup and my parents got the classic French onion soup, which was just perfect. My sister got the Thai mussels and we split it. So much flavor! The mussels were cooked perfectly! My parents had a smoked salmon and fennel salad. Absolutely refreshing. We ended with, of course, a creme brûlée which cracked ohperfectly:D Merci Chez Moi!", "author": "Paulita P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "We enjoy sitting at the bar at many places we go, and the short haired blonde bartender is warm and welcoming at chez moi. The cocktails are excellent and reasonable ($10-12) by NYC standards. She has a vast knowledge of different liquors and cocktails and is happy to accommodate your tastes. \n\nTonight we had the tuna tartare which was so fresh and delicious (on fresh avocados) and the steak frites. \n\nWe will definitely be back again and again, especially if that bartender is working!", "author": "Maura T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "This very serviceable bistro on Atlantic Avenue was our refuge on a cold night after a really awful trip to IKEA. We literally got on the first bus we saw and got off as soon as we hit the Cobble Hill dining district. Chez Moi looks relatively new and rather typical of the types of restaurants opening up between Park Slope and Brooklyn Heights these days, but that's usually a good thing.\n\nThe atmosphere was lively but contained on Friday night and our wait was about 5 minutes without reservations. They really make the most out of space here--our table was in a narrow back aisle, but it quickly got cozy the way these types of nooks often do. The drinks were good. I tried their signature cocktail  (vodka, fresh mint, \nlime, cassis, soda), which was pretty refreshing.\n\nFood-wise, we shared the grilled octopus with hummus and harissa, which was tasty but tiny for the $12 tab (hey, if you want a big chunk of squid, go Greek). The mussels, on the other hand, were a huge portion and delicious. Fries, mayo and ketchup, and I was a happy camper.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Amazing atmosphere! Loved the drinks and the food was also incredible. Friendly staff and reasonable prices", "author": "Joey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Wonderful evening! Mussels in white wine/shallot sauce; French onion soup; fried frog legs and purred mushroom soup! Topped off with Monday Jazz downstairs! A lovely way to end a holiday weekend", "author": "wendy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "One too many below average meals here.  You want to know what its like to eat in Los Angeles or Great Britain... have brunch here.  Completely ill prepared and tasteless food.", "author": "amir b."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}