{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-02", "description": "I stopped by around 4 and was told they wen't doing anything but Apps and mussels which kind of sucked. I went for a bowl of french onion soup and a charcuterie platter. The soup was in a decent sized bowl with large chunks of bread  and a good amount of cheese on top. The broth was very nice and rich and overall I enjoyed it. The charcuterie platter wasn't anything special. The portion size was very good and I couldn't finish it. The rillette was the highlight for me and normally I hate it. The sausage and pate were just ok. I'll probably try to go back and try an entree before I write it completely off but overall I thought the meal was just ok.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "This is our go-to brunch spot in the neighborhood, and because my boyfriend and I love the Eggs Benedict and Eggs Norwegian so much we'll only ever get them I haven't eaten very widely from the menu. The potatoes are perfectly crispy and seasoned -- though I always forget to ask for a side of ketchup! And the dressing on the side salad is very yummy. Love the bottomless La Colombe coffee (the best!) and the Bloody Marie (Mary :) is spot-on. Great atmosphere, always friendly and helpful staff and fairly reasonably priced -- love Chez Moi!", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "YUM! Friend had a hen party there and I got to try the steak. I actually cut it with a butter knife because I was sharing and it was that tender.  Also mussel!!! Get the Thai! All flavors are great but Thai is the most unique. Amazing, Fries, also a must.  Owners super nice too. Can't wait to go back.\n\nI went for dinner so I don't know if they're open for lunch or breakfast but I'm sure it'll be freakin' delicious if it is.", "author": "Y L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Fist of all i am not a lover of French cuisine so when my wife made reservation for 4 at Chez Moi I was leary . We arrived and were seated with one other couple and the night was exceptional .The service was exceptional .Everyone there was great .We had as appitizers the escargot and the beet salad and the octopus .Fantastic . The main courses the steak the duck and salmon were even better .The drinks and the desserts were also very good .The place truly deserves a 5.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Great food, great music, great service.\n\nWhat else do we want in a bistro?", "author": "John K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "Wonderful establishment! Service is phenomenal and the atmosphere is very nice. The food is also really good.\n\nI had a special risotto (bacon and something) and it was so tasty. For dinner I had the chicken dish and it was so juicy and had a nice outer crispy layer. You could taste a nice butter flavor and it went well with the bed of corn and broccoli. I cannot recall what my friend had but I believe it was steak and it was good as well. We had some chocolate mousse and creme brulee. The creme brulee was great and the mousse was alright.\n\nThe drinks were very tasty and strong enough.\n\nAgain the service was top notch and I will return in the future.", "author": "Diego R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "I love mussels it's unfortunate that I was not in the mood for mussels the day that we came. But, I felt like a burger and it was honestly the BEST that I have EVER had. Chez Moi, is a cute little restaurant which exudes a Parisian charm. The decor which is clean with a rustic flare lends for a welcoming and relaxing experience here. The cocktail menu here is something that is impressive. If you like crafted drinks and not your simple jack and coke then try the drinks here. Well made with a nice pour!\n\nIf you are looking for a charming spot that will not break your pocket Chez Moi is the place. The wine menu is also GOOD. I will be coming back for some mussels soon!!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "I just came back from brunch and I am so impressed. The waiters were lovely and attentive, the ambiance was romantic and chill (we got there just when it opened) and the food was delicious! I got the crepes with cheese and mushrooms and spinach and the grapefruit brulee. I definitely recommend the grapefruit! It had a layer of melted, crunchy sugar on the top. It was awesome! My boyfriend got the salmon club. I snuck a few bites, and even though I'm not a huge fan of smoked salmon, the sandwich and accompanying potatoes and salad were amazing. \n\nWe will be coming back!", "author": "Cassie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Quiet spot on a Sunday morning in September- we had a solid brunch. It was very kid friendly and the management was accommodating. The service was little slow, but otherwise excellent.", "author": "Banka S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Duck breast was top-notch and cooked perfectly--seared crispy fat on the outside, nice and medium rare on the inside. Very rich and flavorful. Get it!\n\nSteak tartare needs a minor adjustment--there was a sweet flavor in there...perhaps a sweet tomato gave it a ketchupy taste. Comes with fries that are vaguely reminiscent of McDonalds, but I actually mean that in a good way.\n\nI normally think house cocktails are a scam--usually a way for a resto to achieve some scale, but there's a reason the classics exist. Howe'er, in this case, they're quite solid, and reasonably priced. Kronenbourg is a nice simple lager, good and crisp on a hot night.\n\nBoston Bibb salad was good but slightly overdressed. Escargot were excellent.\nAtmosphere is pretty good--admittedly, the clientele are biased to stuffy white Brooklyn Heights people, but the music is good, and many of the other touches give it a decidedly authentic feel.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "I hadn't considered moving to Brooklyn before coming to this spot.\n\nIt's the cutest thing ever. Simple but cozy. \n\nMust try: beef carpaccio, tuna tartare, beet salad, and the mixed greens. \n\nMy brother's eyes rolled back with the french onion soup. \n\nMussels weren't great but the fries that came with them were... so you just broke even. \n\nLoved it.", "author": "Tone S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Stopped in for a Friday afternoon lunch -- started with the foie gras with red wine apple compote service with 8-grain toast points. It was rich and flavorful, though the plate should have been chilled a bit more to help it last (it started to soften in a few minutes from the heat). I bailed on the market fish (I think it was a filet of dorada) and went for steak frites (8oz NY strip, medium rare -- perfect lunch size). The steak was slightly overdone, but not objectionably. The fries were fine -- crisp and not greasy with good potato flavor, though they could have used some seasoning. For desert I had the sorbet -- three small scoops, one each of raspberry, pear and lemon. The last two were perfect, the pear was a bit muted compared to the others, but that's natural. Service was fine and he got a good tip from our threesome. Ambience was quiet and genial. I can imagine it might get noisy later as they have a very complete bar and it looks like a great place to meet up.\n\nRecommended.", "author": "Douglas P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "This place served up perfection...on every level.\nWe went on July 4th...the city is empty, it's actually my favorite holiday to spend in NYC. The weather was beautiful this year. Anyway, I digress. We wandered along Atlantic with no particular destination...we wanted brunch. After checking out the menus at a few different places, we backtracked to Chez Moi, and wow, what a treat.\n\nThe service was efficient, pleasant and unobtrusive. The food was soooo good. The crispy home potatoes...heaven. Perfectly herbed and salted, I couldn't stop myself from eating them off his plate. The brûlée grapefruit...so good! Bottomless cup of Colombian coffee for $2.50?! Yup. We ordered the \"grits of the day\" as an appetizer because, yeah, we needed a breakfast appetizer. It was cherry tomato, red pepper and parmesan grits...I cannot express how delicious this dish was. I told the waiter that they should recommend it to every table!\n\nCute decor, mellow vibe, good service, and fantastic food...I'm so happy we found this gem. We'll be back.", "author": "Day H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "My bf and I stopped by to grab a bite for lunch. It was a cute shop and not too busy for a weekend. The menu was diverse but since we were just caught out in the rain, I wanted to get something warm and comforting. I ended up with the risotto and ratatouille. Both were fantastic: rich and flavorful, served piping hot!", "author": "Jane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "This cute little place is fairly new and a welcome addition to the neighborhood. The staff is always friendly and welcoming. The atmosphere is lovely. The food is good. \n\nWe happened upon Chez Moi on their first day- they had a soft opening, so not everything was available, but they were apologetic and made it clear they wanted us to have a great experience. There was live music, which was a nice addition to the atmosphere. I liked my meal- I think I had scallops or a white fish of some kind- my dining partner had the chicken (since the burger was unavailable) and wasn't as impressed.  He agrees the food has improved a lot since our first visit. \n\nWe have also had delicious brunch here when we can't do the hour-long wait of Colonie, nearby. \n\nTheir Valentine's Day Prix Fixe was a good value and delicious. They were very busy that night, but we were able to get a reservation when we called the day before and they delivered the same great service despite the busy night. The food was also of the same quality as any other night, which is sometimes not the case with a Prix Fixe on a holiday.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Love the Chez Moi cocktail and the truffle mushroom croquettes. I've eaten her twice already and really enjoyed each meal. The service is great and the waiters are always very friendly. Would love to go back for the $1 oyster specials and brunch", "author": "Zvia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "I did not have this restaurant flagged before coming, but after such a wonderful dining experience I really question by bookmarking capabilities. Nestled in between a string of your typical Brooklyn bars along Atlantic Ave, the restaurant takes on a unnecessarily romantic ambiance, and I say that not only because of its exquisite french cuisine, but because the only source of lighting seemed to be the meager glass candles scattered across the tables. This is my only complaint. My friend felt particularly disturbed by the dimness of the environment to the point of impairment where she struggled to make sense of the words on the menu. Nonetheless, I am presenting quite an exaggerated critique, solely because I see no other flaws with Chez Moi. I think it is most important to stress the delicacy of the food. We began with the gazpacho and brussel sprouts. The service satisfied the eagerness of my yearning stomach by coming within 10 minutes after ordering. After diving into the appetizers and coming up with a smile, I was ready for more. I chose the chicken dish and there were no regrets here. The creamy garlicy sauce and the natural chicken juices provides a riptide of fresh flavors. I highly recommend this dish for someone in need of a large quantity of fulfillment. I cannot speak for the lamb couscous and onion soup that my friends ordered (somehow refrained from invading their food), but they seemed just as satisfied with their meals.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "The food ranges from pretty good to really great ... but the service .... takes away the entire experience. Servers seem to wish they were at home scrolling through Facebook rather than having to actually be present, have to speak or be bothered with customers. And when they're ready for you to leave, they'll be sure to drop the bill [hard] on your table to let you know you're done.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "Both by appetizer and main course were extremely salty.  I don't think I'll go back.", "author": "Donald C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "excellent atmosphere, great food and good service. the bonus was the speak easy on the lower level, the drinks were great and the vine was awesome. a great spot for relaxing with some good food and drink.", "author": "Timothy M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}