{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "Ya this place is great! Cute atmosphere reminiscent of a cafe in Paris with decent prices for what you get. \n\nMy sister and I both had the muscles. She had the tomato based sauce and I had the white wine sauce. The white wine sauce had huge sprigs of fresh herbs and lots of phenomenal flavors that complimented the muscles without overpowering them. The tomato sauce was the same success, with fresh tomatoes and just the right balance of acidity. \n\nNow to the actual muscles. Huge, plump, and perfectly cooked. I wish I could eat them everyday!! They were served with french fries which were good, but not my personal favorite. I like really skinny fries and these were not those, bummer. When I get this meal I expect delicate fries which are perfectly seasoned, but these were standard fast food fries. \n\nChange your fries and I'll be back!", "author": "Madison N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "went here the other night for a meal. we ordered the charcuterie as an appetizer. it was a very small portion. the pieces of meat they gave were ok. it came with 2 different types of pate. i didn't like either one and i love pate. it also came with some toasted bread that was just wheat bread from a grocery store loaf that tasted terrible. \ni ordered the steak for my meal with broccoli rabe. the steak was awful and the broccoli rabe was awful. \nmy friend had some mussels with fries. i tasted the fries which were really good. i didn't taste the mussels but my friend said they were ok. \n     the staff was really nice and they have a speakeasy in the basement. the speakeasy is cool and would be a great date place. \nall in all i would go back for drinks but not for food.", "author": "Boo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "My husband and I had a lovely experience here. He was craving escargot, which  was supreme! When we entered it was already packed, but the waiters were attentive and we were sat in a matter of seconds. The ambiance was fun, romantic and had a burlesque theme. In addition to the escargot we ordered grilled octopus, which was tasty and tender, salmon, frisée salad and ended the night with Creme brûlée! Everything was superb.", "author": "Tara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "brought out of towners here for Wednesday night dinner. No problem making rsvps for 4 at 7:30 the day of. Even though it was in the middle of the week, I'm glad I made a rsvp because every table was actually taken except for counter space. We ordered two apps: small round of tuna tartar and 6 truffle mushroom croquettes. The tartare was absolutely deliciously fresh and cooling, while the croquettes were crunchy and creamy. Seemed like everyone around us were having mussels so 2 of us ordered the provencale and basquaise mussels at $20 each (can replace fries for salad) and the skate fish. The amount of mussels were gigantic and is more than filling with bread to mop up the sauce. The skate fish was delicate with a creamy tangy sauce that I couldn't get enough of. May have finished the mashed potatoes just to taste more sauce (oh well... potatoes are vegetables right?) Service was attentive - waiter asking how everything was and replacing bowls of shells. Looking forward to trying their $1 oyster happy hour and live music on Mondays next.", "author": "Jamie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "It was my first stop on my foray into Brooklyn. Honestly, I didn't know what to expect. However, since I was with a Frenchman, we decided to do a French Saturday brunch. \n\nGlad we did! This place is inconspicuous from the outside and quite dark in the back, although still nice with some painted brick and old-world European charm. The coffee was great and constantly being refilled.\n\n1. Grapefruit brulee: I'm not sure I've had one of these before, but it was amazing. LIghtly carmelized sugar on an open half-face of the grapefruit. Simple yet amazing. Dessert before the meal.\n\n2. Grits with a side of bacon: Loved the corn grits. Creamy like polenta with a poached egg on top. When you break that egg, the yolk flows over the grits, making it just that much better. I added bacon to the top to perfect this dish.\n\n3. Egg white frittata: Incredibly flavorful and satisfying, this dish came with potatoes and a side salad. Fresh, simple, awesome.\n\n4. Profiteroles: The best I've ever had. Yes. Seriously. Three large pastries that are open and stuffed with large amounts of vanilla ice cream, drizzled in chocolate sauce, and finished with almond slices. Oh, and the whipped cream too. For those that have not had a profiterole, come here to have your first one. Orgasmic.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I go to grad school nearby and yesterday night, a Tuesday, was the second time I went into Chez Moi for a couple drinks with friends post-exams. The service and drinks were so good that I felt compelled to write this review. \n\nWe spent a couple hours at the bar downstairs. The place has a Parisian speakeasy vibe without the dumb wait and overrated bs of Manhattan spots that bill themselves that way. The seating in the back of the bar is mostly plush, velvet loveseats and the like. The front of the bar, where we were, was also nice; dainty stools, a marble bar top, and of course, a view of the super nice bartender. \n\nHe was very attentive throughout the evening. After letting me try a couple wines, I ordered a glass of the syrah/grenache, which was lovely. The rest of my party, however, was more adventurous with drinks. He mixed them up some well-made cocktails that everyone enjoyed. One of the guys in my party was bold enough to order a Prairie Oyster, which of course is not on the menu. The bartender took absolutely no issue with the order and made sure to make it just right. You could tell that the bartender really cares about making drinks that his guests are satisfied with; a very invaluable trait indeed. \n\nAnyways, lovely bartender, lovely space, lovely drinks! Only wish I wasn't such a broke grad student and could have spared to tip him more.", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "This review is long overdue. I had dinner on NYE with my fiancé here. It was a pre fixed menu and I booked a couple of days prior giving my credit card over the phone. We were seated in the downstairs area and the decor was fab, and the drinks were also good. Despite having so many awkward interactions with our less than patient server, everyone else was very courteous and pleasant. \nThe food was okay, I'm sure other items on the menu are better, but our options were limited. \nAlso, they don't accept Amex which is strange because they didn't say anything when I used it to secure the reservation. \nI would try this place again, I was mainly just disappointed with our server and how little interest she had.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "What a great surprise that my friend and I found this gem in Atlantic Ave! Is the best duck breast I've ever had, which I ordered medium rare,and it came out to be juice, tender and freshly sweet! The essential difference between the smoked duck breast and this one is that, the smoked one is too salty that it overrides the taste of freshness. The interior décor are gorgeous yet private, some details are enjoyable: such as the wicked hand soap in the lady's room ;) Since it was weekday night, so it wasn't packed at all, which is a bonus for private conversation. I look forward to their Monday Jazz night.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Finally had dinner at Chez Moi the other night and had a pretty nice time! \n\nEverything we tasted, with one exception, was delicious. We ordered the butternut squash risotto appetizer, escargot, skate entree, and duck breast.\n\nThe risotto was creamy and delicious with a hint of sweetness, and the escargot was garlicky and sizzling -- I could eat that stuff every day. But the skate was the real star of the night. I have never had fish this perfectly cooked and flavorful. The mashed potatoes it came with evened out the saltiness in the best way. Order this!\n\nThe dish that broke my heart was the duck breast, which was unfortunately overcooked and flavorless. We ordered it medium rare (as duck breast should be served) but it was instead done medium-well. And it had an overly gamey, unpleasant flavor that almost made me question the quality of the duck. I wasn't expecting this to be the best duck breast in the world (al di la in Park Slope holds that honor), but given the caliber of the other dishes, I was expecting more.  \n\nThe service was wonderful.\n\nOverall, this was a good meal and I hope to return and try more of the menu. But please, fix that poor duck breast recipe!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Great brunch, Great dinner. Amazing absinthe selection. Friendly French staff. What more could you want? Eggs Norwegian and mussels and fries are two of my favorites.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Had a great dining experience last night a Chez Moi. Beautiful decor, excellent food, management and service was accommodating and attentive.\nHighly recommended and look forward to returning. P.S. Really enjoyed the surprise downstairs.", "author": "Tom R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Loooveeeeee the cocktails! It's a cute date spot with good food options and a speak easy downstairs!", "author": "AR A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "I'm not sure why I waited so long to check out Chez Moi, but how was I supposed to know they've got it all? And by all, this is what I mean:\n\nAn EXCELLENT steak frites. \nA simple, perfect burger. So juicy it'll soak the bun right through.\nRich, luscious foie gras that'll transport you directly to Paris.\nA very nice country pâté.\nDelicious cocktails.\nA very decent, huge portion of tuna tartare. \nA new risotto special every day, one that always satisfies. \n$1 big, beautiful Bluepoint oysters until 7 pm on the weekdays.\nFive different types of mussels, all worth ordering. \nA molten onion soup gratinee you'll want to burn yourself on over and over again.\nFantastic service. Every employee will offer a smile, and they are all looking to please. For instance, one time we forgot our leftovers and our waiter chased us halfway down the block to make sure we got to enjoy every bite we paid for. \n\nAfter several visits, these are the only issues I've encountered:\n\n1. The butter they offer with their bread are the cold packets, rather than warm, convenient, spreadable butter. \n\n2. One time they told us the risotto was roasted tomato, and it turned out to be butternut squash. Still delicious.\n\n3. One time I got my Manhattan up, instead of on the rocks. Still delicious.\n\n4. My legs tend to fall asleep when I sit on their barstools. I'm assuming this is my own fault, and I just don't know how to sit properly. \n\nClearly, the pros outweigh the cons.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "We came here for my birthday dinner. The food was not FRENCH enough. A place that I categorize as \"visiting once and not coming back\".", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "There is no reason why Chez Moi isn't deserving of a 5 star rating, due to the atmosphere and quality of the food being some of the best I've experienced in Brooklyn. They have live music nights, a great liquor and wine selection (they have absinthe and japanese whiskies)! The foie gras is decadent and we've loved the soup of the day selection every visit.\n\nWhat kills the place, and personally I'd say it's an insult to such a great kitchen, is the lack of service. I've had 3 different servers on multiple occasions, each time was disappointing. I can never find a manager on duty, and the water glasses and bread baskets are left empty until towards the end of the meal. We've even stacked out empty plates to indicate a need for service and the server passed our table more than once without acknowledgement.\n\nSure, this may sound petty or harsh, but trust me that once you've had the food there, you expect a level of service that reflects the quality of what you're eating. I wish the tip would go directly to the kitchen. \n\nThat said, they accept credit cards, the atmosphere is laid-back, the restaurant isn't too loud even on a busy night, and the bar has a great set up. If you're in the area of visiting brooklyn bridge park, go for the food and lower the expectation of service- you're guaranteed to not be disappointed.", "author": "Candace F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "My mother and I were visiting New York for the weekend and we were looking for a nice and cozy place to enjoy our Saturday night dinner. Chez Moi was close to our hotel and we decided to try it and it was definitely a good choice. The place is very small but it is also very warm and cozy. We ordered croquettes, grilled octopus and cod. All orders had a great array of flavors and were beautifully presented. The service was nice and the atmosphere was very enjoyable. Chez Moi is definitely the kind of place I'd gladly visit again.", "author": "Rita L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Our first stop upon our arrival in Brooklyn. We came in for drinks and snacks and ended up getting great conversation with Leigh our bartender. The wine choices were spot on and perfectly paired with the fennel salad and charred octopus (best tasting dish like this that we've ever ate)!  Atmosphere is cozy and welcoming - definitely a must stop for any one in the area!", "author": "Kristie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "It's very rare that I begin my review of the restaurant with the service and staff, but that is exactly what I'm doing. Our waiter, Jeremy, was absolutely wonderful! He was polite, he was funny, he was attentive, the perfect waiter. We went there for a late dinner (very late, 10:30p) and we never felt rushed, which often happens when you eat late. Jeremy very nicely asked us if we wanted dessert, informing us that the kitchen closed at 11:45, which we didn't and then immediately said that if we wanted dessert drinks that was available for the rest of the night. The rest of the waitstaff was incredible as well!\n\nThe food... DIVINE. It was the first time that my boyfriend had eaten escargot and I could not have asked for a better place for him to have tried it. Boiling hot, cooked in a beautiful sauce and delicious. It wasn't at all chewy like escargot sometimes can be. And now he's hooked. For dinner, I ordered the Mussels Mariniere which was so good! The fresh thyme on top sealed the deal. And, honestly, I have never finished an entire bowl of mussels before but I am proud to say that I HAD to this time. My boyfriend ordered the NY Strip Steak Frites rare, and it absolutely was rare. Sometimes people don't get rare correct it's usually too blue or too done but this time it was beautifully red. And not to take away from how delicious the steak was, the sauce was TO DIE FOR. I think he could have drank it on its own. Also, the fries. As my boyfriend said, \"They're like McDonald's fries plus one thousand\" (and he loves their fries).\n\nOH and the drinks! If it was possible, I would hire the bartender, whose name I didn't catch, to make all the drinks for me for the rest of my life. My boyfriend ordered a Sazerac and, as both of us have spent lots of time in New Orleans, we agreed it was possibly the best Sazerac that we've ever tasted. I ordered the Chez Moi, which I actually liked EVEN MORE. It was perfectly balanced and I actually tried to not down it because I wanted it to last -- which is very unlike me. \n\nIt was a great late dining experience and I would be happy to go back any time -- especially to try their frog's legs!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Easily missed neighborhood spot with pretty authentic French bistro food and non-French portions. On price to taste ratio alone, you should add this to your repertoire.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "I came here the other day with a few friends to have a nice sit down meal a drink and to hang out.\n\nIt's a super cute french restaurant that is gives off the atmosphere of being cozy and intimate.  The food here is very tasty and the portion sizes are good, neither too much food nor not enough.  Just the right amount which is good and leaves room for desserts and dessert drinks.\n\nSo I got the special cod fish of the day - which came out moist and flaky with some veggies.  Thoroughly satisfying, and left me with wanting a dessert.\n\nI ended the night with the Chocolate Martini with the roasted marshmellow b/c it sounded delicious!  And damn it it was.\n\nDEFINITELY get that if you like chocolate.  For serious!", "author": "Richard L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}