{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "This place is a gem! Went there for brunch, had quiche and creme brûlée. Our server was so nice and friendly (i wish i remember his name). It is good to make reservations since they were packed!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "I have been to Chez Moi over a dozen times, for brunch and dinner. \n\nFor brunch, their Eggs Benedict and grits are real gems. \n\nAs for dinner, I love their mussels and risotto. And, you can't go wrong with any of their cocktails.\n\nI highly recommend Chez Moi for brunch or dinner.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "I really hate giving a place a bad review, but Chez Moi left me with no choice. The mussels in coconut broth gave me food poisoning. I literally woke up in the middle of the night with terrible stomach pains. They tasted okay at the time, but the broth was pretty strongly flavored so any off flavors must have been disguised. Needless to say I won't be returning.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "I cannot say enough about WONDERFUL this place is! \n\nWe just got married and had our reception here. Let me just say that the owners saved us from a near disaster: we had to plan a reception for 60+ guests in less than 2 weeks! To find a restaurant in Brooklyn that would close for a private event on a Saturday night(!) without charging an arm and a leg is near impossible...But the folks at Chez Moi did just this and more! They were so responsive to all our requests, helped us plan out the whole evening, and then executed everything perfectly:\n\nFood: \nWow. Our guests were all impressed by the quality and quantity of the food. The Hors d'oeuvres were beyond plentiful and delicious! Steak Tartare, Sea Bass, Shrimp! \nThen then a fabulous sit down dinner.. beautiful beet and goat cheese salads, tuna tartare, and then generous portions of mussels, salmon, steak.\n\nCocktails: \nGreat bartender (friendly, fast, super attentive!) and the drinks were so so good--made with things like fresh juiced melon purée, as well as thoughtfully selected wines and champagne, generous pours, and a waitstaff that kept a drink in every hand.\n\nService:\nHere is where Chez Moi really shined. It was like the owners were hosting the wedding reception of a close friend or family member. They worked out all the details for us, graciously dealt with all our guests who had dietary restrictions, kept all the young kids smiling, served the entire dining room and bar quickly and efficiently (no small task!), and just made sure that everything was taken care of! The maitre d' was there all day to help us when the flowers, cake, favors, and decorations were delivered and then made sure that everything looked perfect when we arrived.\n\nI worked in the wedding \u0026 event industry for many years, and I can honestly say that there are great many established \"venues\" that do not offer genuinely friendly service like this. Our guests were so impressed with the whole evening. Chez Moi helped us stay on budget while still throwing a party that felt festive and lux...This place is a real gem. \n\nThank you all so much for making our day so special!", "author": "L S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-01", "description": "We wanted to order the baby greens, grilled salmon and seared duck breast; however, they were out of the duck breast so the waitress suggested we instead order the duck confit (the day's special). The greens weren't too bad, very simple. We never got to try the salmon because the waitress got the order wrong and brought us 2 duck confits (minimal and insincere apology). The duck confit was covered with fatty, soggy skin and I'd have been a bit disappointed if something I made at home came out that way.  And I'm not very good in the kitchen.\n\nThe worst part was that at the end of it, the waitress never asked how we liked the duck. After seeing that we had eaten most of what was on our plate, she remarked, \"See? That wasn't so bad, was it?\"  She also mentioned that the chef was thinking of replacing the seared duck breast with the duck confit.  This was our first visit so we've never had the duck breast, but it's hard to imagine the confit being an improvement over much of anything.  Despite our lukewarm response to her attempt to sell the duck at the end of the meal and her mistake, she didn't offer to take anything off the bill.\n\nThe one cocktail we ordered was quite good, and the glass of wine a fairly generous pour.", "author": "LJ R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-31", "description": "I really wanted to like this place. It looks so cute from the outside and I love French bistro food. Unfortunately, I was really disappointed by my experience. \n\nI ordered the chicken, which was served undercooked -- still pink. I let them know, and they fixed it right away, but it took so long that my husband finished his entire meal before mine even came out. He had the steak and fries -- fries were okay, not great. He ordered the steak medium and it came out purple. \n\nThe hostess was really nice and apologetic about my chicken. She didn't charge us for it, which I appreciated. Maybe someday when I'm feeling more forgiving I'll give the mussels a try.", "author": "Caitlin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Excellent food and service.  I just grabbed a quick bite at the bar on Sunday afternoon I truly enjoyed it.  The quiche was light and fluffy.  The home fries were perfectly cooked.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "Quaint \u0026 sweet looking staff here. Its a nice quiet place to go for brunch. \n\nOrdered the curry mussels which came out perfect. Not too heavy with the curry, and a generous portions of mussels. They offered us bread and refills of it several times, it was perfect to dip in the curry sauce. \n\nThe grilled steak sandwich was AWESOME. It tasted like it really had been charred on an authentic grill. It was cooked to my specifications, and the sauce \u0026 onions \u0026 tomatoes complimented the steak perfectly. It was a large sandwich too, and came with shoestring fries. \n\nI watched the UEFA soccer game here as well after brunch, and they set up tables right in front of their flat screen which was above the bar. The drinks were okay, unfortunately no drink specials. Their sangria was so good, it was super sweet yet had a hint of wine. I would definetly come back here again.", "author": "Edna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "ok anyone who is complaining about food or service at this restaurant is either a whiner or maybe they came in on an off night.  I was here yesterday (so sat night) and had a fantastic dinner with my parents.  Now i want to preface this review by saying I've never been to \"Colonie\" which is a restaurant that everyone is comparing this one to, but standing on its own this place was great.  This is the rundown, our waitress was nice, prompt and unimposing.  Our wine was delicious and so were the apps, we had 1. beef salad - fantastic, 2. Duck sausage (special) - very good, 3. Foi gra (sorry dont know how to spell this) - i dont like duck liver but my dad who ordered it loved it so there, 4. tuna tare tare - very good.  Then we all had soup - me my husband and my mom had the french onion - great, my dad had the special - ok (not my fave but my mom tried it and liked it).  Finally we each had an entree - i had the fish - very good if a little oily, my mom the chicken paillard (special) very good with roasted potatoes and spinach, my dad had the duck - delicious and my husband the steak frittes - really good but a little salty for my husbands taste (he is sensitive to salt) id say if you like things less salty then more maybe ask that they take it easy on the salt in this dish. We didnt have room for desert (too stuffed) but for all that food the bill came to $218 (without the tip).  For a dinner for four with apps soup entree and wine, id say thats very reasonable! Now i want to try this colonie place to see what the hoopla is all about.  All in all this place is a solid 4 star, with great food good service and good atmosphere - will be back for sure.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "I can't understand what is going on with this place.\nA small menu with Bistro classics that should be executed flawlessly by any Chef with some NYC chops,\nDon't let the low prices fool you you get what you pay for.\nThe country pate was ice cold and definitely store bought\nThe torchon was past its prime and had a harsh metallic taste.\nRicotta \u0026 bibb salad???? weird\nEscargot were excellent and had plenty of garlic and not rubbery\n\nAVOID the mussels, gritty and poorly executed\nThe thai version was strange in flavor and some of the mussels were raw.\n\nThe steak was small but very tender but the peppercorn sauce was \"starchy\" it is the way I would describe it. Good fries as well\n\nThe burger was very very good and the best deal on the menu\nSlow cooked salmon was fine but the side were bland as was the dressing\nSkate was very good and well prepared", "author": "Will M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "A sweet little French restaurant with a well-curated wine list. If you're especially lucky, you'll have the gracious and knowledgable Steven as your server.", "author": "Lili A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Great combination of friendly atmosphere and good french food (go during the week for that because the brunch menu excludes most good French stuff).  They have $1 oysters during happy hour I think.", "author": "Marc F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "Had an absolutely lovely brunch here on a late Saturday afternoon. Salmon and eggs and probably the best apple martini that I've ever tasted.", "author": "Cheryl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "We had our after wedding dinner here and it was perfect. The owner helped us organize ahead of time and with oysters to start (taking advantage of the happy hour prices), followed by mussels, cheeses, charcuterie, croquettes and salmon small plates we were both filled and happy. The champagne was good, the wine was yummy and -- and this impressed me -- when two guests brought bottles they opened and served them without a corkage fee (this is NOT a BYOB place -- that we'd ordered MANY bottles already surely helped -- but it was a nice gesture). They even filtered and decanted a 25 year bottle someone brought. Profiteroles to finish. Generous on good bread and butter. Croquettes and oysters were the highlights for me. I have no complaints but I guess I'd say the cold salmon wasn't all that interesting.  Service warm and professional but sometimes had to flag people down. Atmosphere warm and romantic.", "author": "W A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "One of top restaurants (not just French Bistro) in the area, period.  This stretch of Atlantic Ave., has seen a bunch of high quality restaurants emerge over the past few years, hopefully that trend continues.", "author": "John K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "Wonderful place.  Great ambience. Delicious Moules Mariniere! Love it.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Small quaint French eatery with good options and reasonable pricing for the offerings. Also serve absinthe if you are into that.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Order the Basilic!  I can't get enough of this drink!  Food is pretty good and service is great.  I love the risotto!  Nice, standard neighborhood restaurant.", "author": "Melody M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "- Amazing cocktails. Really better than Dead Rabbit.\n\n- Risotto was pretty bad. Not disgusting just bad, actually the worst I've had. Just warm rice porridge. Rice did not look and did not feel like risotto rice - more like Uncle Ben's One Minute rice.\n\n- Snails with bone marrow were more or less snails with a bone. Not much marrow. It was not bad though.\n\n- Do not get desserts. Not worth it.\n\n- Service was questionable from various angles. Because the waitress was new. However, maitre d' fixed everything - I noticed that he saw and felt everything that was going on in the dining room\n\n- Well, we are planning to go to Chez Moi today. Probably. Appetizers and cocktails.", "author": "Alex O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "I've been watching the renovations at this place with interest.  It turns out they opened quietly two days.  Having given up getting a table at Colonie in a reasonable time, we decided to give Chez Moi a try. \n\nThe server said they had \"soft\" opened.  The menu is short and simple, not sure if they mean to expand it later.  \n\nWe had a cocktail, seasonal vegetable salad, the mussels and pan roasted chicken.  Our entrees were each under $20.  The salad was beautiful to look at and delicious.   Mussels were good though portion was small, and the \"fries\" were small cubes that came in the same pot as the mussels.  But this wasn't my order and my dining companion said he didn't mind and enjoyed these fries.  I was very disappointed though, as I was totally counting on stealing some french fries!\n\nBut luckily my chicken came in a hearty portion, with gravy, mashed potatoes and root vegetables.    The mussels and chicken were both very tasty, though both on the salty side.    We were too full for desserts.  \n\nAll in all I would say 3.5 stars, but rounded up to four since they just opened, and the staff were extremely friendly.   I think this will be a great neighbourhood restaurant. \n\nOh and the cocktail (gin, st germain and sour mix(?)) was delicious and the bar is cute and a good size, so this will be a good place for drinks.  There was also an extensive wine list that I didn't look at.", "author": "Kay P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}