{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Ate here a few nights ago and was so impressed! I have Celiac disease and their ability to modify dishes to make them gluten free for me was incredible. The $1 oysters were a huge plus. Definitely coming back!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Great place for oysters, and more!! \n\nKnown for $1 oysters from 4-7pm weekly, Chez Moi is beginning to attract a cult following. I am one of those cult members. \n\nThe appetizers are delicious, especially the pate platter and the croquettes. The latter is stuffed with mushrooms and minced truffles. They were perfectly fried; crispy on the outside and soft in the middle. \n\nAs for my entree I opted for the burger during this visit. I must admit, the meat was a bit over cooked but fortunately the melted foie gras made up for this uncommon mishap. \n\nMy advice: get there early for happy hour oysters and stay for a few drinks and appetizers. If you are still hungry opt for a burger l!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "I keep missing chances to have oyster happy hour and brunch here, but I have been to their downstairs speakeasy (The Boudoir) and had drinks at their main bar. They have a great cocktail program - the kind where at least one ingredient in each drink will make you go \"hmm\". They even have a drink featuring foie gras! I had the bacon infused rye whiskey drink because bacon. Equal parts yum and strong. Cocktails are reasonably priced at $12. Super cool bartenders as well! Great crowd, and go downstairs for some dancing afterward!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "PROS:\n- Crispy Chicken Sandwich - OMG this is amazing! You have to get this! Portions are big and the chicken was fried to perfection and it was juicy. 5 STARS\n\n- Mushrooms, Cheese, Spinach Crepe - very filling. Very delicious however it was slightly on the salty side. 4 STARS.\n\nCONS:\n- Chez Moi Cocktail (Vodka, Fresh Mint, Lime, Crème de Cassis, Seltzer)- was rec'd by the waitress to get this but I did not like it. I did not taste the Creme de Cassis at all in this drink. It was mostly vodka and fresh mint. \n\n- I had heartburn from drinking the cocktail with the fried chicken. I guess next time I am not going to mix alcohol with greasy and fried food. Lesson learned.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Great happy hour. The pamplemousse cocktail pairs well with the HH oysters, which are fresh. Th shucker needs a bit more practice as there was some grit and oysters not released. But who cares when you can get wellfleets. \n\nCome early,say 4:30 to enjoy a dozen or two before the kitchen opens at 5.  Friendly staff.", "author": "Dina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "I have been a lover of all things French for a long time. Having Chez Moi around the corner from where I live makes it a convenient choice for fine French dining in a cozy small setting typical of Brooklyn Heights. I stopped in for a late dinner last week around nine and was treated very warmly and immediately seated in a cozy banquette. I waited for a few minutes then the waiter arrived and took my drink order and brought bread. The bread was amazing and without question one of the best baguettes I've had in my neighborhood. I ordered the French onion soup and the fennel artichoke salad, keeping it somewhat light.  The French onion soup was full of flavor and absolutely delicious and piping hot. The salad was good with a nice flavor but could have used a bit more tanginess or brightness. or crunchy tidbit on the side. To end my dinner I ordered the cream Brulé. It was light yet creamy and rich with the perfectly toasted sugary top. It's worth every calorie, add an espresso and BOOM!  \n\nOverall my experience was very nice, and in the French style, chill and not rushed. My next visit I will get something a bit more hearty with the French onion soup again, and always finish with the cream Brulé and espresso. \n\nI highly recommend Chez Moi, it's a neighborhood gem, and don't forget to check out their sexy French jazz club downstairs - La Boudoir, a cozy place to get a fabulous craft cocktail. My favorite always is the French 75 with cognac. A good way to end the evening.", "author": "Sandy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "My wife and I are \"Regulars\" here and appreciate the fish dishes in particular. Sitting at the bar is a treat especially if Leigh or Shannon are tending bar. The rest of the staff is just as friendly but we especially enjoy the cocktails concocted by Leigh and Shannon.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "I was really, really excited to try this place - but I walked out with mixed feelings about it. \nFood was ok, but not memorable nor truly french. \nDecor is understated, but clean - that's all I can say about it.\n\nThere were so many hiccups in service, tho....\nWe really wanted to try their bacon-infused cocktail, but were told they just started infusing it and it will take couple hours. Seriously, don't you supposed to do all prep before restaurant opens? Ok, we got different drinks unread. \nThan oysters mixup happen - waitress did not seem to know which ones were which for reorder, which led to series of trips to the kitchen. When that was in progress, a guy walked by our table and dropped drink on the edge - not a word said. What? Did he leave it there to drink later??? All confused, we stare at it. Flagged that guy 5 min later - turned out, they did find that bacon infused drink. Ummm, ok.\n\nI really hope they get their service issues together - this has lots of potential.", "author": "Nadia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "My husband and I live in Brooklyn Heights and this is by far our favorite local restaurant- by leaps and bounds. The Steak Frites are consistently excellent along with the risotto and drinks that will not disappoint. I should also mention that my husband has Celiac's disease and has must eat gluten free for medical reasons. The servers and kitchen staff have always been able to communicate with him properly and accommodate him. The service is always friendly and warm. My highest compliments to this lovely, romantic French restaurant.", "author": "Nathalie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "Racial Discrimination!!! Yes you heard it right! \nWe were in the neighborhood walked around to check out restaurant options. This restaurant looks cozy and not busy so we decided to give it a try. It was Sat night around 6:30, the restaurant is more than half empty. We walked in and stood there for 5 mins without being greeted, 3 ladies ignored us and they weren't doing much, finally store manager came to us and asked if we had a reservation. We didn't and they took us to a table right outside of restroom. We glanced around and asked to be seated in the bigger table or the booth. The waitress said she had to ask and came to say, the table is only for more than two people and pointed to another side table just as small. Then we turned around and saw they immediately seated two white couple in the booth seat we asked for within minutes.\nSo if you are not white, be ready to be mistreated and the seats don't fit their price tag! We walked out as we lost appetite to anything they can offer.", "author": "Vivi l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Long story short: this restaurant has reignited my passion for French cuisine. \nMe and my bf came on a Saturday night which was a quite busy time, both the bar and the main part of the restaurant were basically full. We asked for the table at the entrance right next to an open window, and got seated right away. That table was perfectly romantic in its own uninterrupted corner, rarely even looked upon by people other than our waiter or the manager, thus I highly recommend for couples. \nThe bread served before meal was true French baguette, even though it wasn't right-out-of-the-oven fresh, it was still million times better than the dry and harsh Americanized baguette. We shared a French onion soup which amazed my bf by its layered flavors. I also liked that it was actually flavorful but not overly salty, but imo it still lacked that flaky on top but buttery underneath croissant \"lid\" to be a perfect French onion soup. For entrée, he got the fish of the day and I got the Seared Duck Breast. Even after it was repeated twice, I still couldn't remember all the ingredients in the daily special dish, but holy cow was it flavorful, we were both blown away upon the first taste. I could taste all the visible ingredients while feeling the smokiness of the crispy fish skin and the tenderness of the fish fillet. It was so well orchestrated, no one flavor was overwhelming or missing. My entrée was the same way. The meal was perfect in the way that it left us full to just the right extent but mentally longing for more. The dessert Tarte Tatin was good for finishing off the meal and in good portion for sharing. \nI would definitely come back and try more items from the menu. I love this place. \n\nP. S. Before you leave, remember to check out the cool pub in the basement!", "author": "Joy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "I came here for dollar oysters and cocktails. The oysters were delicious. My cocktail (the Juliette) was just wanted I needed - strong and not too sweet, light and refreshing. I added a side of shoestring french fries, which were addictive - so good. The bartender and staff were friendly and attentive. I'll be back.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I made a reservation for dinner for four people on a Sunday night, and we were immediately seated when we arrived. Our server was very attentive without hovering around. Great ambiance with very cozy-feeling lighting.\n\nI was expecting small portions, but I was pleasantly surprised to find the portions to be the perfect amount for me. Run-through of the food:\n\nEscargots - Oh. My. God. The garlic parsley butter. The snail itself was soft, buttery deliciousness. All I can say is, Mmmm...\n\nWild Skate Fish - The fish was a little too salty for my taste, but mixing it with the mashed potato balanced it out. I really enjoyed the fava beans and artichoke, and I'm usually not into beans of any kind.\n\nSeared Duck Breast - This is a must order. The meat is so tender and juicy, and the orange sauce paired really well with the duck flavor.\n\nTruffle Oil Risotto Special of the Day - This was good, but a couple of bites were enough for me. It was rich and creamy.\n\nCreme Brûlée - Smooth as silk with a nice burnt sugared top. \n\nÎle Flottante - One of the most amazing desserts I've ever had. It was like I had a cloud on my tongue, and the milky sauce was not overly sweet. This was perfection.", "author": "Mary Jane C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "If I could give zero stars to this place I would. Worst service ever -- populated by rude people. While the food is ok, there are many wonderful French restaurants in NY.  You  don't need to go to a place filled with staff who seem to think being welcoming to their guess is beneath them.", "author": "Jill E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "I can't believe I've lived in Brooklyn for a year and haven't stumbled across this place!  Came here on a Friday night with my husband and was really impressed.  First, they gave me a day-of Friday night, 8:30pm reservation...unheard of.  \n\nThe atmosphere is super cozy and great for a date night.  We started out with a gin/coconut milk/basil cocktail that was delicious.  I rarely drink gin, but when I do I want to mix it with coconut milk from now on. Then we shared truffle mushroom croquettes and then each had mussels (thai curry and basquaise).  The croquettes were heavenly and you got six!  The mussels were super fresh and delicious, served with fries.  The portions were all very large.  We finished the meal with port and an espresso martini, both delicious.  Nothing but love for this place.  Will definitely be back!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "My boyfriend and I used to order brunch from them every weekend through DoorDash. Unfortunately, the last 3 or 4 times we tried, they canceled our order. It's always a different excuse, too. Really unfortunate but we won't be giving them our business anymore. Ordering or stopping in.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Great steak and mussels are banging. Terrific bar and the staff accommodated is even though we were without a reservation (I'm from North Carolina). They have a secret lounge that I shouldn't probably talk about on social media. So. Shhhh.  You can see the Statue Of Liberty (from the sidewalk if you walk a couple of blocks towards the river).... and that's nice.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-10", "description": "Came here for Brunch on a Sunday around 12:30 and was seated immediately! Highly recommend the homemade blueberry scones they were super fresh and warm outta the oven! Everything we ordered was really good. Will come by again for dinner next time around!", "author": "Cherry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "Excellent food. Had the market fish, octopus and cream brûlée on a date out with my bf. Became my favorite spot in this neighborhood!!", "author": "Kerrie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "love this little french restaurant for both brunch and dinner. reasonably priced entrees and drinks. although the space can get crowded and the seating is a little squishy, the service is always friendly and is a nice local or romantic night out.\n\nthe mussels and fries is always a good option, as is the steak tartar entree (also comes with fries).  their croque monsier and madam are both great brunch options as well. if you're looking for simple straightforward french cuisine, without all the snobbery, you can't go wrong with this place.", "author": "Tina M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}