{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-19", "description": "Stopped in for dinner last night, space is nice and inviting.  Staff was polite but disorganized and a bit slow.  There was confusion over a few things.  The real bottom line is the food just wasn't very good.  I ordered the steak frites and the steak was overcooked and of poor quality.  I wasn't expecting Peter Lugar level steak but it was really actively bad.  My wife had the burger which was mediocre at best.  I was rooting for this place to be the nice bistro type restaurant the neighborhood could use but I cannot recommend.", "author": "Hungry Brooklyn Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-06", "description": "I had dinner with a friend the other night and it was a fantastic evening.  The space is quaint and cozy with a great ambiance.  The food and wine were all extremely good- I highly recommend the onion soup as well as the steak which was perfectly cooked and abundant in flavor. We had a very nice and extremely well priced bottle of Cote du Rhone which went perfectly with the steak. The creme brulee finished a delightful meal.  This is a perfect  and welcome addition to the neighborhood - i will be back very soon.", "author": "Paul R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "More like Chez Meh - this bistro tries, but not too hard. The ingredients are OK, but fall short of excellence. My steak was slightly overcooked; not enough to complain about, but enough to slightly disappoint. My companion's fish was free from any discernible flavor. Service is adequate, but neither attentive nor warm. The execution from the kitchen is likewise very average. This is basically decent diner-level cooking masquerading as a French bistro. If I had to sum it up in one word it would be \"tepid\". It's not awful, but there are many better choices in the neighborhood.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "It's an OK place, but overpriced for the quality of the food.  I had the steak tartare, which was pretty bad.  Instead of being real meat, it was a mixture of meat with a lot of unidentifiable vegetable.  Service was very good.  Wife's salmon was excellent.", "author": "werner c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Great place.  Extremely tasteful and simple decor.  Staff (mostly French) is relaxed and friendly.  Food is solid French bistro with good wines.  A very calm place where you can enjoy a nice dinner with friends or family for hours.  Good alternative to the more hectic Bar Tabac on Smith.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "My favorite neighborhood spot. Very good food, nice atmosphere, and very reasonable prices. I've had brunch and dinner here several times. The stroller set dominates brunch, however in all my experiences the kids were pretty well behaved - but that's just luck. Suggest a reservation for brunch if you don't want a wait. Lunch \u0026 Dinner don't have many veg options if you care about that sort of thing. I usually love their burger - really moist and flavorful, served on brioche bun. One time I was there during a busy dinner service and the burger was dried out - but usually very good and consistent quality. Mussels and French onion soup are my other favorites. I'm consistently pleasantly surprised by the reasonable bill at the end of the meal. Hope they can sustain the quality/price ratio. I used to frequent Henry Public, but their menu is so limited and quality so inconsistent that this is my new \"go to\" on the block.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Great addition to Atlantic Ave. A little disappointing in some of the food on the menu, curry mussels were a little bland. Smoke salmon and Tuna were great.. The decor and staff are great.. I really hope the food improves.. We will try for brunch soon..", "author": "Scorcher M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Great Brooklyn spot!  Charming, delicious food and lovely unpretentious service.  The menu is simple but everything is delicious.  I sent a friend there a few days after with his date and they loved it too.  Can't wait to get back there again.", "author": "Kat H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-23", "description": "Came here on Thursday night. The food was great. I had the octopus (very fresh) and Steak (cooked to perfection) Tried the St Germain cocktail - excellent. Food and Bev was on point. Service - Meh. Decor and noise level were OUT of CONTROL!! Could not hear anything my girlfriend was saying. But i could hear the entire conversation across the room! Not sure how that works out but the place definitely need some warmer elements to absorb sound. It also looks a little unfinished and kind of too \"broke hipster\" Im only complaining because of the acoustics and the sound. I seriously could NOT wait to leave this place. My head was pounding and it was a very uncomfortable experience. I would not return until they fixed this problem. SMH", "author": "Jake S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-14", "description": "We came across this place a few months ago when the wait as colonie was too long. The restaurant had just opened and looked really cute so we thought we would give it a try. The hostess was very welcoming and seated us right away. Our waitress was friendly but not very good- maybe she was nervous since she was obviously new since the restaurant had just opened. My husband and I had the French onion soup to start- it was OK, for a French restaurant we expected much better, they burnt the cheese and it was really salty. My in-laws had the escargot and said it was fantastic! For our entrees I had the burger- it was good, my husband and mother in-law had the skate fish and said it was good. My father in-law had the bouillabaisse special and had to send it back. He said it was inedible because it tasted rotten. The manager was very nice about it and didn't charge us for it. Unfortunately it made him loose his appetite and ruined the dinner. It was a shame because he enjoyed his appetizer so much he was truly disappointed with his meal. All in all even without taking my father in-laws dish into account the food was good.", "author": "Megan A."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}