{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Food was great! I came here for dinner with my wife and it was a great experience. I got the duck which was cooked a seasoned perfectly. Amazing duck, get the duck :)\nShe got the Skate fish which was also amazing. Great food and nice ambiance.", "author": "N. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "I have a weakness for French Food.  The buttery decadence and richness of French Cuisine makes me incredibly happy.  So when my APIC called one late afternoon suggesting we do mussels for dinner, I was all in.  When we arrived to Chez Moi at 6pm, the little restaurant already had quite a few patrons.  It was a lovely early fall day, so we opted for a seat by the window so we could watch the Brooklyn Heights passersby.  The staff was attentive and our waiter took our drink and meal orders in record time.  We chatted over wine while our meals - two orders of mussels, one Mariniere and one Provencale - were being prepared and watched as neighbors to the restaurant stopped out front while their pets drank from the complimentary (and communal) water bowl place to the right of the restaurant's front door. \n\nNow, those of you who read me regularly know that I'm not one to get caught up in atmosphere.  Really, I can be completely satisfied dining in a hole in the wall if the food is good.  However, since APIC chose the spot, and she's all about atmosphere, I'll let you know that Chez Moi has a wonderful energy about it.  It is calm, and low key and the staff is very pleasant.  Fellas this is a nice spot for a first date.\n\nThe wait for the food was routine, but the food was completely worth it.  My mussels in white wine sauce was prepared flawlessly.  It was so good, in fact, that once the mussels were done, I proceeded to sop up every last drop of the delicious sauce with bread from the bread basket!\n\nOnce finished, our plates were promptly removed and dessert inquiries were made.  We passed because we were stuffed, but opted to hang around for a second glass of wine because we were thoroughly enjoying ourselves.  The mussels were priced right at about $16 and our total bill including drinks and tip was just shy of $30 a person.  Good food, neighborly owners, and decent prices...how can one not love that?", "author": "Brandi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-23", "description": "A French restaurant without French crunchy bread? Gummy sourdough instead. \nPulp was very good, mussels...I woke up today with headache, vomits, etc. and I know positively it was the mussels. \nChocolate mousse, from a box. Tatin tartare, so so \nRock'roll music instead Edith Piaf or something else? \nNot coming back. \nThe personnel is great!", "author": "Masama S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "The mussels and fries are excellent. Our cocktails were strong and interesting. \n\nThe restaurant was pretty full on a Friday evening, but there were some open tables and not a line at the door. Our waitress really rushed us. Immediately she asked if we wanted a drink, we said we needed to look at the menu. She came by a minute later to take our order-we weren't ready yet. She came by again a few minutes later and we finally felt like we had to order. Her persistence to take our order got a little overwhelming.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "We went here on a pretty busy Saturday but the host was very nice to hold the table for us when though we only called an hour ahead. With a combination of friendly service, an efficient kitchen, and tasty food, definitely a place to try. \n\nWe started out with some drinks. The restaurant offers a selection of local beers and some clever mixed drinks. My wife got the Petit Cochon, a bacon-infused drink, and the Juliette was also a standout. \n\nFor food we started with mussels and escargot as appetizers. The mussels were small, but the sauce was very good. The escargot was tasty as well. \n\nWe also got several different dishes for dinner. I had the Steak Tartare which was cooked just as ordered and my wife's Seared Duck Breast was also tasty. Another in our dinner party got the Butternut Squash Risotto, which was a bit heavy, but quite flavorful. \n\nWe didn't get to try any desserts, as we were pretty full, but they have a selection of Chocolate Mousse and ice creams.", "author": "Peter V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Brunch experiences have been 5 stars each time we visited. Service has been very attentive (we have brought a baby several times) and so far all of the dishes have been good. Also nice coffee!", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Although it is loud, everything on the menu is a hit. Specials of the day never are a disappointment. Cocktails are some of my favorites.", "author": "Nickie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "One hundred percent lovely. A date? Come here. Decor, menu, music and perhaps most notably, the service: just right.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Delicious food, cozy atmosphere and great service~! The decor is quaint, warm and pleasant. (I LOVED the bathroom) Please stop by!! My friend and I took a chance on a Sunday early evening, and we made the RIGHT choice. I recommend getting the steak tartare! It comes with French fries and a salad. Delicious! Amazing drinks. Need to go back!", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Quiet, romantic little place that is wonderful for superb food and an ideal date. Perfect service. The waitress was absolutely delightful. I would've asked for her number if I didn't have a date with me :). \n\nAbsolutely delicious French food. Nothing was too rich or overdone. We ordered oysters for an appetizer, which you have to get if you go here. I ordered the Steak Frite. The girl ordered Duck. Both were wonderful - zero complaints. When I am in NYC, I will go back here without a doubt.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Oysters were delicious and the horse radish seems handmade, yum! The cocktails were good too. However my steak was very underwhelming which I was surprised about. They were also pretty slow in serving, not sure if they were backed up but we had to keep waiting for food and drinks. Nice atmosphere though and next time I'll probably just go back during 4-7 for $1 oysters and a strong drink.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Hands down, this is the best restaurant in the neighborhood. I have lived in the neighborhood (Boerum Hill, Cobble Hill, Carroll Gardens, Brooklyn Heights) since 2001. I am not sure when Chez Moi opened, but it has the most consistently great food. Their drinks are great. You will never have a bad meal. I never write such amazing reviews but I am very impressed.", "author": "Seth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "I used to live a couple of doors down from this place, it's definitely a neighborhood gem. As for the food all I can say is mussels mussels mussels! I love their mussels and the bartender is always approachable and great with pairing the mussels with the right glass of wine. If it's a beautiful day definitely sit by the bar in front of the window or grab a table outside, it has a very French Rivera feel in Brooklyn Heights - just the perfect combo.", "author": "Shereese M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Both our entrees were very good (steak and frites, and steak tartare) and we had the best tarte tatin in a while!", "author": "Ander Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Such an amazing place.  The food is delicious to say the least, and the atmosphere is very cool.  We were a party of four, and the bill was reasonable for the quality of food, service, and area.  My friend and I both ordered the Wild Skate Fish with Fava Beans, Artichoke, Lemon Butter.  It was so unbelievably delicious and moist that I would go there again just for that.  My other friend had the All Natural Chicken with Housemade Spaetzle, Wax Beans, Miner's Lettuce. She said that it was the moistest chicken that she ever had, and that was white meat.  Lastly, my boyfriend ordered the Hamburger with Foie Gras.  He said that it was one of the best burgers that he ever had.  We are definitely coming back!", "author": "Donna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "I love this small unassuming French restaurant.  It has a local casual atmosphere, which is what I always look out for.  And it's so great that they are child friendly because we have a 7yr old.\n\nMy faves are:\n- the wild skate fish - it's buttery, light, slightly crispy\n- fish \u0026 chips are the best in town for sure!\n- mussels \u0026 fries - my fave sauces: thai, basquaise, \u0026 mariniere\n- crispy goat cheese salad, love that there's bacon in there!\n\nThey have a delicious menu ;)", "author": "Cindy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Walking into Chez Moi feels like you've been transported from somewhat dingy Atlantic Ave to a cool, classy, calm place somewhere far away.  Its soothing interior and lazily spinning ceiling fans immediately make you feel like relaxing.  \n\nMy boyfriend and I opted for the $1 oyster deal--which is amazing because you actually get to choose which variety of oyster you get, even at that low price.  We went for 6 oysters, 2 of each variety so we could have a sampling.  The oysters were fresh and delicious, and we enjoyed the different toppings they provided.  \n\nAfter that auspicious start, my boyfriend took the waiter's advice and ordered the carrot and avocado soup.  Now, I was advocating for him to get a different appetizer so I could steal a few bites, because I was not really feeling carrot soup, but once it came and I took a spoonful, all my complaints went out the window.  This is a velvety, tangy, wonderful soup.  Seriously, who knew that avocado and carrot were such good friends?  \n\nFor entrees, I got the tilefish special, with roasted potatoes and roasted asparagus, and my boyfriend got the roasted half chicken with greens, mushrooms, and corn puree.  If you take nothing else from this review, just remember to GET THE CHICKEN.  The chicken skin was crispy, and the flesh was unbelievably tender and juicy.  The side accompaniments went perfectly with it as well, and as much as I enjoyed my dish, I couldn't help but be a little jealous--hey, it happens.  \n\nFor dessert, I got the tarte tatin, and he got the creme brulee.  The tarte tatin was pretty good, but again the standout was the creme brulee.  Maybe I should just let my boyfriend order for me, like they did in the good ole days...\n\nOverall, I had a wonderful experience dining at Chez Moi, and look forward to returning in order to eat that chicken dish and enjoy more $1 oysters.  I would recommend Chez Moi to anyone in the area looking for a fine-dining experience without the scary price tag.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Chez moi can only be described with one word amazing, from the delicious food to just being an clean amazing looking place. The service is great and the servers are so kind", "author": "Veronica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "we are big fans, and occasionally eat here, and would give it five stars again, BUT......\n\nThe \"rack of lamb\" special that I had last night was not a \"rack\" , it was two frenched lamb chops, cut double wide.  And small. \n\nHow small? Smaller than the Australian lamb chops that you get from Costco, in that package of six. I felt ripped off.\n\nIf you want decent sized meat, get the steak frites. As always though, service is always top notch here.  Mixed drinks are awesome.", "author": "Soumax .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Loved it!  I had dinner on a Tuesday night with co-workers, my boss, and my boss's boss (all from out of town). They loved it too!\n\nFirst Impression:  Stepped out of the chilly, windy November air into a warm (not too warm), cozy space. Work stress:  checked it at the door. \n\nCocktail:  Soleil (bright, fruity, fizzy, w/bitters). I had 2.\n\nEntree:  Duck breast, parsnip purée, cherry reduction:  WONDERFUL!  (It's been almost 5 minutes since I typed that. I've been sitting here, smiling, humming, tasting the food again. Hmmmmmmmm.)\n\nDessert:  My inner animal passed on the chocolate mousse--which my co-worker inhaled--for the tarte tartin. Yummy!\n\nService:  Our waiter enhanced the ordering experience better by commenting on our food choices as we ordered.  When he said \"great choice,\" The anticipation began to build. And he was right, I made great choices. \n\nWill I return in the next 3 months?  ABSOLUTELY,  I want to return tonight.", "author": "Rhea A."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}