{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "this place is a little gem with reasonable prices!!!\na simple and delicious menu,awesome drinks,great list of deserts.\ni love the atmosphere and always had good experiences and lovely evenings.\nThe owners always make you feel comfortable like you are in their home!!!\n\n.", "author": "franck s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "Came here on a Friday night with my boyfriend and we left very happy. Nice bar tender, good drinks, quick service, nice place, and good food! We had the beat goat cheese salad, salmon entree, and some veggie sides. Would definitely go back.", "author": "Jillian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "I love the concept at Chez Moi but we were a bit disappointed with the execution.  The place is beautiful; it's small and cozy, dimly lit and crowded--all things I love in a Brooklyn restaurant.  The staff was very sweet but they seemed a bit in over their heads.  The server didn't know much about the fairly small wine list and dinner came out before starters had been cleared.  They also forgot to bring back silverware.  I think with time and more training, they will be, fine though.  They all seemed excited about the place which made up for the mistakes.  \n\nThe food was also slightly off.  The seasonal vegetable salad was actually bad.  It had no flavor other than that of bitter frisee.  We ate it because it was obviously healthy, with no dressing to bring it together, but we did not enjoy it.  The cheese plate was nice but the grapes were overly ripe and sometimes brown.  For dinner we had the market fish, which was sea bass.  This was actually very good.  It was simple and very tasty.  My boyfriend had the steak frites, which was good, but I didn't love the fries--they had fried garlic on them which made them seem breaded.  Dessert was the biggest disappointment, maybe because it's my favorite part of any meal.  We had the chocolate cake with salted caramel and vanilla ice cream.  The cake was actually burnt on top, completely black, and we had to cut it off.  The rest was obviously overcooked and dry.  If it weren't for the ice cream, we couldn't have eaten it at all.  \n\nThe bottle of Langhe Rosso we had was good and priced well and the sparkling rose was especially delicious.  All in all, the place has some serious potential but it's not quite up to the standards of Colonie next door, which is almost perfect in both food and service every time.  I do think that with time, Chez Moi will work out the kinks and it will be a lovely and much need addition to the neighborhood.  I hope so anyway!  I will definitely try it again.", "author": "Ean O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "We've been back twice in one week due to exceptional food, friendly and personable atmosphere from owners and manager (as well as wait staff), and reasonable pricing.  First, I popped by when walking nearby and saw they have escargots on the menu.  Not a fan of them myself, but my 13YO son loves them (had them first on a Disney Cruise).  So, we took him and our 6YO autistic son to dinner there on a weeknight.  We got a comfy bench table in the back and my 6YO loved that he could order Ratatouille (though was disappointed it didn't look like it did in the Disney movie!).  Both kids said they were the best french fries they ever had and the younger loved the chocolate mousse dessert.  Yes, a kids menu would get me back there more often for sure (as another review mentioned).  I found it kid friendly (a baby was at another table), but menu could cater more to kids (think kids burger, kids steak frites, kids fish and chips maybe?  just a thought?).  Well, as for my husband and I we had the risotto and couldn't be more pleased, the steak frites, and mussels in white wine w/shallots.  Bill was reasonable, service fantastic and, when I left my sweater it was still there a week later when I went back.  Amazing!  The manager even remembered what my sons ordered.  Really feel welcome here and will be going back again and again.  BTW- Oyster specials mon,tues,wed 4-7 if they're still having them.  My husband's heading back for that.  Me, I won't be staying away long from the risotto.", "author": "Ann Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "Excellent food, good price. Nice restaurant, great music at the back (french, spanish..)", "author": "Julian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-17", "description": "Very disappointing. Incredibly rude staff and mediocre food. My husband and I Have been a few times and we always expect a better experience but We always leave disappointed. I won't be back.", "author": "Beth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "I was sorely disappointed with my latest trip to Chez Moi. Usually, their food and drinks are amazing and their service is acceptable. Food and drinks are usually fast and delicious. Unfortunately, my last visit was terrible. On this last occasion, my friends and I went to have a few drinks and some snacks and we were welcomed with THE WORST SERVICE I HAVE EVER EXPERIENCED AT ANY NEW YORK ESTABLISHMENT! Our server, Rachel, was rude to us as soon as we sat down. She rushed our initial orders and took them with a sour look on her face. Our water bottle was covered in dirt or coffee (who knows what it really was) and our water glasses were dirty. Our drinks took at least 15 minutes to be delivered to us and our food actually came before OUR drinks. She would come and take away our drinks and not even ask if we wanted a refill. She threw down our check without asking if we were finished and gave us an attitude when we asked to split the check. She said she couldn't (or rather that the computer doesn't do that) so we started doing the math for her. She then came back a minute or two later with split checks and threw them in our faces. She actually hit my friend's face in the process. We were appalled and I was very disappointed because I usually love this place. I fear I will not return knowing she works there.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "good if pricey food.  the burger au cheval (with an egg) is good, as is the escargot.  good selection of wines by the glass, and the knowledgable bartender will give you tastes of a few before you decide which one you want.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "This cute little french restaurant was highly recommended to me by some friends.  I took a couple of foody friends of mine and we were blown away.  Literally one of the best meals we had in a long time, start to finish.  We all agreed it would be a staple of ours every time we were in NYC!! Whatever you guys are doing keep doing it ;)", "author": "Angel G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-13", "description": "Food was decent. Nothing amazing, but good enough for brunch. Rating is for service. So many good places is this area for brunch, do yourself a favor and go somewhere else where the staff is actually friendly and baseline attentive.  And the $6 coffee? Come on... If you want a good brunch, Colonie is right next store.", "author": "Atlantic A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "I really enjoyed the experience with drinks and dessert.  I had an espresso martini and it was to die for in Brooklyn.  I also had the dessert mousse which was the best taste experience.  My last drink was the chocolate marshmallow martini that is shown in one of the pictures.  I went over the top on chocolate but they were all good.", "author": "Eileen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Place is cute Food and drinks are great.  Bar area a little large for space but eaten there many times since it opened and loved food everytime.", "author": "K A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-11", "description": "Love, Love, Love it.  The food was fantastic and beautifully plated;  Staff one of the most pleasant I have come across in a long time.  Prices great.  Can't wait until I go back - think I'll try brunch next.", "author": "Maureen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "Went for brunch and got a solid Croque Madame. A real one! Not a grilled ham and cheese sandwich that so many restaurants try to push on you. When I ordered an iced tea the waitress said \"really?\" So they loose a star for dissing my favorite beverage.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "A really nice addition to the neighborhood. The fish and chips were exceptional. Extremely nice stafff--who actually seemed glad you were there opposed to indifferent or worse. Looking forward to going back.", "author": "Sophie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Great place, just wandered in and had an amazing meal, from apps to entrees to wine. Three of us ate, had the tuna tartare with avocado, french onion soup, tomato soup, chicken, mussels, and white wine. Everything was great, they had no problem with the small substitutions we requested, and the staff was really friendly and helpful throughout, without being intrusive or overbearing. The atmosphere is simple but classy, relaxing, and not too loud. i'll definitely go back when i'm in the neighborhood!", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "solid brunch. food tasted great and i felt great after eating it.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "French?  How do you say are you kidding me en francaise? American food trying in a French bistro setting.  Not ebpven good american cusine  The only thing French was the service....slow and slow.  Honestly this place is so unmemorable.  I'm shocked by the rave reviews. Go at a time you have nothing to do but kill 2 hour lunch time for mediocre food.", "author": "mj b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "I used to really like this place but the quality is just too inconsistent and they don't do well when busy.  They used to really nail the Eggs Benedict.  I had it today and it was simply awful.  Way overcooked eggs, no hollandaise, a gross whole wheat english muffin, and overcooked mealy red potato home fries.  Also, they dont have half-and-half for the coffee so your stuck whole milk.  I've also had bad experiences with the oysters.  They are not shucked properly and often contain a lot of shell.  The steak dish is a chewy poor cut.  The place is just really poor quality and very inconsistent.  I have never seen this lack of consistency in their neighbor Colonie, or at places like Frankies 457.  I cannot fathom the four and five star reviews I see here.  If you look closely a lot of them changed their review after having a better experience the second time.  And others make excuses saying the kitchen had a bad night.  That's unacceptable.  There should be no bad nights.  Seriously, the place is just not good.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-25", "description": "What a sweet place!  And a great addition to our neighborhood.  I've been yearning for a nice but affordable local French place and  I'm thrilled.  \nThe feel of the place is charmingly simple and very classy -  whites and wood and a beautiful bar. \nThe food I had was delicious - my classic onion soup was the perfect comfort food, and i was coveting the frites of the people next to me. There is a pan roasted chicken that looks delicious and of course a classic bistrot burger, which must be tried sooner than later... I was also really impressed by the creative yet very fresh and pure cocktails.  I had one with aloe and gin - mmmmm.  \nEveryone I dealt with there was very nice and knowledgeable.  \n(Um, and can I just also say how cool the wallpaper in the bathroom is?  Haha!  But it's the little things sometimes.... We ladies - we appreciate these touches!)\nI just stopped by to check the place out on my own,  but will be returning with friends very soon.  Happy to have a new local haunt!", "author": "Gretchen M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}