{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Excellent French bistro with exactly what a bistro should have - onion soup, steak frites, mussels, croque monsieur/madame, Kronenbourg, nice looking wine list. Husband and wife owners who live locally. What's not to like?", "author": "Wade B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Had brunch today and the food was fantastic. Not sure why negative reviews. The staff was very friendly and accommodating. Looking forward to going back and trying foie gras burger.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "Had dinner here with a couple of friends last night. Great atmosphere, slightly cramped tables but not really, and excellent excellent food. I had the burger with mixed vegetables, and my friends had the french onion soup and mussels. Burger was excellent, with a delicious bun and good texture.\n\nVery good service and very reasonably priced compared to their direct competition (there are a number of excellent places in this neighborhood). I'll be back.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "Came here with my boyfriend's family (who are French might I add) and some friends. The food was delicious and even impressed the French natives ; ) I had the French onion soon which was exceptional, the branzino special was excellent, and the desserts didn't disappoint either. I loved the interior and atmosphere: warm lighting, mirrors, and friendly staff. Even though I am from Manhattan, I will def. be heading back to sample the rest of the dishes on the menu. Highly recommend.", "author": "Lucy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "A perfect addition to the neighborhood.  The bartenders give new meaning to customer service, the food is perfection (those fries...).  I'm a Chez Moi groupie.  Try it!", "author": "Anthea G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-19", "description": "The eggs Benedict was good, loved the potatoes as well. The service was also good. What really sucked was the Bloody Mary! It was more like tomato paste with vodka along with a limp piece of celery for $10. I will go back for brunch but will stick to coffee. Ever since the unfortunate demise of Robin Dubois on smith, we have been looking for a place that perfect eggs Benedict brunch.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "Amazing brunch! The food tastes as good as it looks. For drinks, try the fraise made with fresh strawberries and celery--really refreshing and delicious.", "author": "Nadia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I've been here three times so far.  The first was for dinner which was very tasty and I thought reasonably priced for the neighborhood (certainly priced below its neighbor Colonie).  The service was a bit slow but the place was brand new. \nI've been back twice for brunch and I couldn't be happier with it.   The service has since improved a good deal.  Eggs Benedict for $13 isn't too bad for Brooklyn Heights, and it comes with a yummy salad and skinny fries.  The hollandaise was perfect and flavorful; not too thick or custardy, just the right amount of lemon.  The eggs were also, well... perfect!    \nA Bloody Mary will run you $10 (at least a few bucks less than colonie) and is spicy and satisfying.\nI don't really understand how Colonie is still so much more popular than this place for Brunch: Chez Moi's (more generous) portion sizes and price, minus the wait time of its stuck up neighbor, make this a much better option for a relaxing brunch.\nIf you live close by, give her a try!", "author": "Carol F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "Nice upscale brunch alternative to Colonie on Atlantic. Excellent mussels ...", "author": "Tomas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Our go to brunch spot. I'm reviewing it strictly for brunch as I've never had dinner here, it gets pretty busy for dinner. The brunch has all the classics plus some excellent special dishes like their grits of the day. They are perfect!! Service is excellent. And they have freshly squeezed/pressed juices. Highly recommended.", "author": "Yuri E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "This place is my staple.  I enjoy the food and the service.  I'm so glad they are open for brunch earlier on the weekends.  They were a little rough around the edges when they first opened like any new restaurant and really worked out their kinks.  They are always accommodating when we come by (which is often!) even if we have a stroller.  All the food is tasty and well made.  Lucky to have them in the neighborhood!", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "This a sweet little French bistro that serves as yet a limited menu with delicious food.\n3 of us ate there on a Friday night before the official opening.\n Everything we ordered was very good - the charred octopus was generous and tasty, the bouillabaise had 2 of those yummy head-on shrimp. The mussels were excellent with tasty broth and the fries were good but not as good as Bacchus or Bar Tabac and they had fried garlic sprinkled on top which made them a tad more greasy. The roasted market fish with veg. was simple yet delicious. Wines were good and reasonably priced.\nThe service was attentive but flawed, untrained but willing and sweet. \nThe big downside was the noise - by the time we were wrapping up and it became crowded the noise levels were unpleasant and made conversation at our table of 3 very difficult. The white tile and brick and lack of wood and cushioning made the noise level crushing.  It was a relief to leave and people were clamoring to get in. \nThe lighting was low and hard to read the menu and our corner table could have used a hanging or sconce light.\nNext time I would sit at the bar near the door to  or go on a Tuesday or Wednesday.\nSo 4 out of 5 for food and 2 out of 5 for the noise.", "author": "Kate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "I'd only been here once before after work, sat at the bar and had a burger. The burger was SO good and the place charming, so I wanted to try it out for another meal. This weekend I had a lovely Sunday brunch here with my family. It was quiet when we got there (soon after they opened) but filled up while we were there, and the place had a very cheerful vibe. The staff was friendly and we never felt ignored or rushed, even when it got busy. Had the grits special and the frittata, which were delicious -- and saw the pancakes at another table, definitely ordering that next time! Bonus: the restaurant is super baby-friendly, which is necessary in this neighborhood! Can't wait to go back and try other dishes.", "author": "Elizabeth Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "This is a great place for brunch. The staff are friendly and attentive but mostly the food is delicious.  And you'd think that'd be enough but the prices are incredible too.  A group of us had brunch on Sunday and everything was just delicious.  Try the savory crepe with spinach and mushrooms or the French Toast - yummy.  The chicken sausage patties are tasty too. Definitely will go back.", "author": "Syddie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "Went in on a sunday night for dinner.  Was not too loud so elected to sit at the bar.  Good service and good food.  Had the mussels with fries and mushroom croquets.  The mussels seemed a bit dry but mussels and fries are always pretty good.  Was not impressed with the croquets, greasy and lacking in flavor.  Though I will say a lot of what I saw others get looked quite good, and the place was fairly crowded fo a sunday night so would give it another shot as it is right around the block from where I was visiting in Brooklyn.", "author": "Will D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "This place is fantastic - best escargot in Brooklyn, and the mussels are damn tasty too!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Chez Moi is a fine choice for brunch or dinner. The atmosphere is intimate and relaxing. The menu is simple, however it has enough options to satisfy a wide range of tastes. The service is consistently friendly and professional. A great choice for an evening out or a saturday afternoon cocktail.", "author": "Christopher P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "Really nice brunch here this past Sunday.\nHad my parents out to to the new neighborhood (New Yorkers all their lives, and discovering parts of the city they had never explored before thanks to me!) \nChez Moi was the perfect place to start our afternoon, actually the 3rd time I've been, but 1st for brunch.\nComfortable atmosphere, great food, great staff.\nWill be back for sure.", "author": "Lee K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-28", "description": "Really wanted to like, and will try again, but was disappointed.  The kitchen was really slow, and my medium-rare burger came out medium well, after waiting 30+minutes. fries cold, which is annoying. perhaps they need to get out the kinks, and the breakfast looked good, but would have sent back my food had I another hour to dedicate to lunch.", "author": "laura K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "Come here often for dinner. Food is always good as are the drinks and service. Decided to stop by for brunch last week and was pleasantly surprised. Had a salmon and bacon BLT that was absolutely incredible! Definitely recommend this place.", "author": "E. P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}