{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "The speak easy is so sensual and romantic, the cocktails perfectly crafted and the decor makes you feel like you stepped into a totally different time. The restaurant is dim lighting and romantic. I went on Valentine's Day and the menu was pre fix and the starter was an oyster with black caviar on top! So delish! The pomegranate salad was so tasty and the octopus was tender and tasty, the sea bass fillet was perfect also! They easily accommodated my nut allergy and the waiter was super friendly and professional and funny. The desert was ok the creme brûlée was creamy and tasty but the lemon cream pie if I recall is what it was correctly called tasted funny. But over all it was great and the Rose was nice and dry and the bathroom was tiny but the soap shaped out of a rose bud gave it a nice touch. Really nice Gem in Brooklyn!!", "author": "Ciara D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Nice place. Awesome croque-madame with great bechamelle sauce. \nFrench fries (included) were not ready so we asked for an appropriate replacement. They served us a \"breakfast potatoes\" side instead, that was perfectly cooked..... but they charged us for it, and without any warning... which was not really honest - disapointment.", "author": "Louise D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "What to say about Chez Moi? We have had brunch at this Atlantic Avenue French eatery at least four times and I'm always very pleased with the experience. \n\nMost recently we tried the Pancakes with Bananas and the Burger complete with Gruyere cheese, foie gras and a fried egg. I saved the bacon for the side. The burger was cooked to a perfect medium rare and the foie gras and egg really compliment the flavorful beef. The pancakes were equally well designed, with an adequate, if slightly sparse, covering of maple syrup (sorry IHOP fans), walnuts, bananas and sprinkled sugar. The pancakes are quite fluffy, tasty and the dish is sweet without being overpowering. From past trips I can also recommend the croque monsieur, and if you're looking for a side, you can't do wrong with the bacon which has a slightly sweet aroma to it.\n\nCocktails are nicely done, though the cocktail lounge downstairs is the place to go if you want a really good cocktail. The service is good, with the staff always helpful and on point. Prices are good too, Overall I am never disappointed when we choose Chez Moi for a meal. \n\nOne item of note, the restaurant is a little cramped, so don't expect a massive amount of space if you plan to eat here. Bon Appétit!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Love this place. The bodouir downstairs is one of those hidden New York gems, with a great weekly jazz night. Beautiful decor with solid cocktails. Will be back!", "author": "S. Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "I went there with my old lady on a Wednesday for a lil low key dinner date. We got a very nice corner seat and the host was super nice.\n\nDrinks- Ordered two very good cocktails, one with bourbon the other a French 75, both great. \n\nFood - we both got French onion soup to start it was solid. Ima big French onion guy and this was legit no joke. She got the duck entre... duck was dry and the sauce was a little off. I got mussels which were fine. The broth was pretty bland (tomato and garlic). I'd suggest one of the more exotic broth flavors.\n\nService - excellent. \n\nOverall - we'll def come back to get a drink at the bar and some soup, but most likely not for a full meal. Might have just ordered the wrong stuff that night though. But yeah, it's a good spot but maybe hide from the duck and get a lil adventurous with the mussels.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Chez moi is an unconditional address in Brooklyn Heights/Cobble hills area.\nI don't really know what grade to give them as sometimes I want to give them a 3 stars and sometimes I believe they can be above 5 stars... \nChez moi is a French vibe restaurant with some employees coming from Maghreb which I love. the menu has some French Speciality: Onion Soup, Mussels, and croque monsieur/ Madame... It can be a nice place to have a family dinner/ friends dinner or a date.\nThere is a boudoir downstairs with a nice cocktail menu. Last time my mussels were not that great ... something was missing ( maybe not salty enough?) but the service is professional, quick and efficient!", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "This place was delicious. Our server was Manolo and he was really nice to our table and helped us decide what to order and drink.\n\nFor appetizers, our table had the foie gras, the tartare, and the beets. You cannot go wrong with any of these appetizers, they're all just so good. I highly recommend the beets+apple with goat cheese though, it was really fresh and the combination of beets with tart apple and the subtle flavors of soft goat cheese were so delicious. \n\nFor the main course, I had the salmon (with ratatouille) cooked medium-rare and that was so good. It was flakey and tender and just pink enough on the inside. I have a sensitive stomach too and I did NOT get sick or food poisoning from the fish being cooked this way so you know they're doing it right. My boyfriend had the lamb and that was good too, not too gamey at all, and there was a LOT of risotto underneath it. My friend had the cod and that was really fantastic too, it was meatier than the salmon, but it was seasoned perfectly for me. It could be a little bland to some people though.\n\nOverall, I don't think you can go wrong with ordering anything from this place, it was so good. We went on a sunday evening around dinner time without reservations and they sat us immediatly too so that's a huge plus.", "author": "A Sofia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Follow the rules, Jules!\n\nChez Moi put me in my place and I kind of liked it. \n\n#1 - Do not attempt to open the bookcase painted door that leads to their speakeasy, Boudoir on your own. A man will tell you in a commanding tone that you mustn't without a manager letting you in. \n\n#2 - You cannot just sit anywhere once you are in the Boudoir. Another manager will come fetch you and lead you down a twisted staircase in candle light to your approved seating area. In our case, two stools by the wall. \n\n#3 - If you trip down the stairs, you must appear unfazed. Just as unfazed as the manager who tells you to watch your step. There are signs on the steps, but you cannot see them well in the candlelight. \n\n#4 - Do not try to order your own drinks at the bar even if no one approaches you to take an order. You must be a patient guest. The Intruder is a cocktail worth waiting for. \n\n#5 - Do not bring AMEX. That rule, we did not violate :-)\n\n#6 - If you attempt to molest the mini knight statue at the top of the twisted staircase the manager will crack a smile and do it too. \n\n#7 - Be decadent and order things your super FIT ass doesn't normally touch like the escargots swimming in minced garlic and butter or the NY Strip steak with peppercorn sauce to dip your pommes frites into. Dip the thick sourdough bread into everything!\n\n#8 - Don't (but do) get lost in conversation and be the last table to leave the restaurant. That's when the \"if you want desert the kitchen is literally closing in two mins\" warning will come on strong. Then, order desert!\n\n#9 - Do cab it home unless you think you can manage the twelve block walk to the train with a tummy at fill point and brain buzzing all kinds of happy chemicals.\n\nAnd finally...\n\n#10 - Do fast for two days in preparation for your next visit. I can't wait to be put in my place again...merci!!!!", "author": "Julia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "After having dined at Chez Moi twice now, and having wonderful service last night particularly, I felt obliged to write a review. My experience last night was actually very similar to Katie M.'s: My girlfriend and I arrived for late dinner at around 22:30 and were served by Jeremy. Often times on Yelp you see people trashing restaurants because of their qualms about waiters, but I feel like rarely do people truly acknowledge good service. Well, Jeremy, our server, was outstanding. He was helpful, witty, and polite. Just perfect!\n\nAnd of course, the food was delicious. The first time that I visited Chez Moi I had the Seared Duck Breast, which with the orange gastrique was absolutely divine. Last night I had the steak frites which was perfectly cooked to medium rare. It's also worth mentioning the delicious Swiss Chocolate Mousse and the great wine list. Next time that we visit, rest assured we will be going back, we want to try the cocktails and Oysters!", "author": "Telmo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "This review is for both dinner and cocktails at Chez Moi as well as the speakeasy downstairs. What an amazing place!!!\n\nMy favorite cocktail on the dinner menu is the BASILIC. It may even be one of the best cocktails I've ever had! I loved the combination of gin, basil, and coconut. \n\nMy colleagues and I got the fennel and artichoke salad as a starter. While I'm not usually a fan of fennel, the lemon dressing paired nicely with the fennel with a refreshing effect.\n\nI loved loved loved the skate! The fava beans were great, and the fish was perfectly cooked.\n\nThe desserts were okay, nothing great. I'd go for the creme brulee or profiteroles if you are really craving dessert. Or another cocktail! Their cocktail menu is expansive.\n\nService was really wonderful and our waiter directed us to a host who took us downstairs to the speakeasy after our meal.\n\nThe Marie Antoinette theme resonated, you felt like you were in the past! There was a jazz violinist on the night we went (which was a Monday!). They didn't have as many cocktails, just 5 or 6, and they can make you the classics. Our waitress wasn't the most knowledgeable but it was her first day.", "author": "Nisht G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "The curry mussels are absolutely amazing. They have just enough spice and are a great deal for how much they give you. \n\nThe atmosphere, hostess and servers were also great. This place is a must try!", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-25", "description": "Tried to get seated during Sunday brunch service, and while the waiter acknowledged us, the host completely ignored our presence.  Apparently his phone call was much more important.  Ten minutes is my personal limit, and my tummy needed immediate attention, so we left to find another brunch option.\n\nThis is one of my local go to restaurants, but I will be taking a break for a while. There are just too many excellent restaurants in the area competing for business and actually want my business.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "My boyfriend and I came to Le Boudoir  (the Marie Antoinette themed bar downstairs) last year on Valentine's day when they first opened. We loved it and decided to try the restaurant this weekend. We originally had a 7:15 reservation but were able to move it up to 8:00 with no issue.\n\nThe restaurant is cozy and romantic. Perfect date spot,   but also well suited to group dinners. The staff was incredibly attentive, and the manager (owner??) was floating around frequently, checking on diners, etc. Space is a LITTLE tight but nothing crazy. \n\nThe food and drinks were divine. I had the 'Menage a Trois' cocktail  (two of them in fact) and he had the 'Petit Cochon' followed by a drink I can't seem to find online (it was bourbon, melon puree, and citrus). All were delicious but mine was my favorite.\n\nWe definitely feasted for dinner and over ordered. We started with one french onion soup, one order of escargot, and one order of the truffle croquettes. Again everything was delicious. The escargot were our favorite of the appetizers, and easily some of the best I've ever had. \n\nFor entrees, I had the mussels with white wine and shallots, and he had the rissoto special (squid ink rice and lobster). We could have easily split one entree but wanted to try a variety. The rissoto was yummy but very heavy. The mussels, however, were the star of the show. They were so buttery and smooth we barely had to chew them. The fries they came with were crispy and perfect for dipping. The portion is HUGE and easily splittable as one entree for two or as an appetizer for a group. \n\nWe didn't have room for dessert but will definitely be back again. Chez Moi is our favorite new restaurant in the area.", "author": "Erica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "This review is for Chez Moi's Boudoir\n\nBrooklyn's newest speakeasy-esque place just opened and it is lovely! I already loved Chez Moi so chances were I was going to love whatever they open in their basement. The decor is theme appropriate (Marie Antoinette's boudoir) and felt very inviting, probably thanks to the courteous staff and cocktails served in well portioned goblets. Three French inspired, infused with delicious stuff cocktails later, I was in love.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "We were there for my wife's birthday and it was stunning experience. Food and atmosphere were awesome. Selection of wine is purely perfect. Stuff is double-twice friendly and keen to any whim. 5 stars for steak tartare. Many thanks for outstanding night!\n\nP.S. Don't forget to ask chilli sauce for your fries", "author": "Vado A. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "A new favorite! Our dinner was everything I wanted out of a French restaurant. The escargot was delicious and sizzling hot. The steak tartare is perfectly creamy and a generous amount. The fries are also spectacular - perfectly salted. My partner's salmon was absolutely cooked perfectly with a crust to die for. Mousse for dessert was heavenly. Service was great and would come  back again for sure!", "author": "Coupe Et C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Chez Moi knows how to do brunch! Brunch here is delicious- they really know how to make a delicious plate of Banana pancakes, Eggs Benedict, and a hamburger. The atmosphere is very lively and the service is friendly and attentive. It's fun to dine at the bar and watch the fresh drinks get made, including fresh juices. \nMy timing was really lucky, as my table of 9 got seated within 10 minutes on a Sunday. I was anxious to find the best brunch spot, since everyone had come in from far distances. This place did not disappoint and after the meal, everyone thanked me for choosing such a great place! I'll definitely visit Chez Moi again!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Came here for dinner with family and it was delicious.  The tuna tartare was light and tasty with avocado.  The special tonight was a  fish with muscles and clams and shrimp.  The chocolate moose was very rich and tasty.  The Cortes du Rhine was also very good.  Would recommend for the good food, classy yet comfortable atmosphere.  The service was good as well.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "One of the best French meals I've had in BK. The service was top notch. Our waiter was very knowledgeable and good humored. The food was excellent!!!!!!!!!!!!", "author": "Keith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Had a wonderful time here with a friend on a Sunday evening in this quieter neighborhood of Brooklyn.  \nI was glad we came early, for as the hours passed, the cozy little restaurant became fully packed.  But that's generally a good sign*\n\nWe shared the steak tartare and escargot. The tartare was made with high quality meat, and the accompanying salad complimented it well.  The fries weren't mindblowing, but they were fine. Think thin matchstick fast-food style, but obviously better.\nI love that they refilled our bread basket midway the meal--all the better to sop up the wonderful garlic butter leftover from the escargot, which were cooked perfectly tender by the way.   Not at all chewy.\n\nWe also ordered a chocolate mousse to end on, and it might be the best I've ever had.  Very airy and just MELTS in your mouth, without leaving any sort of glue-like residue on your palate.  Dessert cocktails are also nice--I got a \"Banana Split\" and enjoyed it.  My friend got a hot dessert cocktail, forget the name now but it was a coffee one.  Good, but very strong!\n\n*Something to note if you go at a peak time: it was very loud by the end of our dinner, so much it became a little difficult to converse, most probably due to how small the place is.  While the beginning of our dinner was quite intimate and cozy, take caution if crowded.", "author": "Suji K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}