{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-30", "description": "I wavered quite a bit between a 3 and 4 star review. I think I'll stick with 3 for now, and give it at least one more try before making a final decision. See--I'm clearly JUST like Michelin with my serious star-giving practices!\n\nAnyway, the husband and I popped in for dinner last night. Space is nicely done, and we had no problem getting a table. A little tight, but not a big deal. \n\nStaff was pleasant, and very prompt with bread, orders, clearing etc.\n\nThe food, however, was somewhere between OK and GOOD (hence the 3 stars). \n\nThe bread was rustic but a little dry, and the butter a tiny bit too cold to spread. We shared the duck salad--and that was great. Greens were crunchy and nicely dressed, and the duck was nicely cooked. If the rest of the meal had been as good, I think we'd be at a solid 4 stars. \n\nFor our main meals, we tried the burger (husband) and the mussels (me). I pointed out that a french bistro might not be the best place to try a cheeseburger, but the husband pointed out that: a) they put it on the menu and should thus be able to cook it nicely, and b) a chef is a chef (see point a, about cooking). Sadly, the burger was a bust. Cooked medium instead of rare, and the bread to meat ratio was wrong wrong wrong. Poor husband only ate half, and nibbled the fries. My mussels were much better, although not as rich tasting as those @ bar tabac. I'm sure that it was slightly healthier to have less butter in the sauce, but I missed the taste and thickening power. Plus, part of the fun of ordering mussels \u0026 fries is dipping the fries in the pan sauce. When the sauce is too thin and bland, the dipping isn't all that great. \n\nFor dessert we polished off a flourless chocolate cake. Only complaint about the cake was (again) a ratio issue! If you promise caramel sauce, a smear across the plate is not really sufficient. ESPECIALLY, when someone's husband steals almost all of the caramel in the first bite. Just saying. \n\nThey're new, and we'll be back to try it again...and then we'll see where my stars fall!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "I have enjoyed Chez Moi for several years.  However, my last dinner there in mid-September was disappointing.  The food was mediocre but more importantly, the staff (with 1 exception) was rude and inattentive.  And the noise level was way too loud.  I also recommended it to a friend who was here from Europe.  They went for brunch last week and had the exact same experience - mediocre food, rude staff and noise.  What happened????", "author": "Lynne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Great staff, and great food..\n\nMy girlfriend and I had just finished a bike ride around Governor's Island and were on our way to the Lincoln Centre to see Warhorse. As we walked by this place it was begging for consideration.\n\nWe got a table at the front of house looking out on the street. The waitress and staff were aware we were in a rush and were really efficient. I went for fish 'n chips whilst my girlfriend got the daily risotto (prawn). Both came out super fast. I'm a Brit and have to say this was the best battered fish I have ever had. It was fresh and flakey and the batter was very light. My girlfriend was enamoured with her risotto - also another 'best ever'.\n\nTo top it off, the chef then gave us the risotto on the house due to my girlfriend's compliments. What an unexpected treat to eat here (that, and seeing Jason Segal out front). Highly recommended!", "author": "Tom K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "I came here for Mother's Day brunch at 3:00 pm. The food is pretty solid and they can accommodate large groups.\n\nOur meal wasn't the most traditional French food but the vibe was nice and the prices were reasonable. You'll probably pay somewhere between $11 - $16 for a brunch entree.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "This place is just great. Friendly staff, delicious food, great atmosphere. Comfortable and easy.\n\nI have only been for brunch but every time has been consistently great.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "I'd been wanting to try this place since it opened, and when my birthday rolled around this year on a weeknight, I thought this would be the perfect place to go for a relaxed late-night birthday dinner with my boyfriend.\n\nI love French bistro food but can't stand the pretention that often comes with it at the U.S. restaurants that attempt it. What a relief that Chez Moi got it just right. This is no American restaurant putting on French airs. There are no cheesy Art Nouveau Parisian posters. Edith Piaf is not being piped in overhead. Save that for your college dorm room or other less-authentic French bistros you've been to. This is the real deal. The food was excellent. The service was prompt and friendly. The decor was casual but elegant shabby-chic. And the price point seems to be well-suited for the level of food, service, and decor. It's closer to the high end of my budget and so I'll have to save my visits for special occasions, but for many people these would be mid-range prices and you could easily drop twice as much for the same quality elsewhere.\n\nMy spicy Pamplemousse cocktail was the perfect start to a perfectly tasty meal. There were so many enticing options, I couldn't decide on an entree, so I settled on two appetizers (escargot and tuna tartar) and a side dish (gratin dauphinois). My boyfriend ordered onion soup and steak frites. Every dish was delicious and beautifully presented. And we finished the meal by splitting a glass of port and a creme brulee, which I'm usually hesitant to order because it is so often poorly prepared, but I was encouraged to give it a try based on the rest of our flawless meal.  I was not disappointed by the crackly custardy sweetness that greeted us at the end of our evening. I'll have to try the chocolate mousse next time!\n\nIf you're like me and you've been longing for an authentic French bistro on this side of the Atlantic, definitely check out Chez Moi.", "author": "Dale R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Great staff. Wonderful ambience. The grilled octopus is my favorite.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "A quaint french bistro is exactly what this neighborhood needed. Expectations were high and I was not disappointed. The decor and overall vibe was laid back while still adhering to the current trend of wood and antique lighting.\nThe steak fritte was juicy and tender and the french fries will be high on my daydream list. The fish special was delicate and fresh, both came with vegetables that had been prepared to perfection. (I was so happy to see spinach served without the requisite cream and garlic!)\nI will definitely be back. Just hoping it wont get as crowed at Colonie..", "author": "Lulu B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Yet another top notch place on Atlantic Avenue. Great to stop by for cocktails. Dinner is excellent. 5 types of mussels to try. Fish special entrees are excellent. Terrific salads. Don't miss it!", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Four stars does not do this place justice. The tuna tartare appetizer is excellent! And the duck is extremely flavorful with crisp skin with a nice medium rare center. Perfectly seasoned and well balanced.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Great atmosphere and service. Decent food.\n\nChez Moi is a really cute restaurant and fairly spacious. We stumbled upon this spot while we were trying to find a fairly quiet spot without a wait in the area on a Friday night. (We were actually at Bijan's first but it was so loud, we had to leave. My voice was gone and it was IMPOSSIBLE for me to hold a conversation in that atmosphere. Which was very unfortunate because Bijan's has some great food.) \n\nThe atmosphere here was exactly what we were looking for that night. We were seated almost immediately after we arrived. We didn't even have a complete party and they were still very understanding. The service was great and the environment was cozy.\n\nWe started with the country pate which was delicious. My main entree was the beet salad and sweet potato soup special for the day. I was incredibly disappointed. I wish someone had told me the beet salad wasn't really a salad but a full plate of ONLY beets. Don't get me wrong, I love beets but they served it extremely sweet and there was zero lettuce. The soup was okay, nothing too special. My friends' dishes all seemed better than mine but no one was really blown away. \n\nI think this spot might be worth coming back to for the atmosphere and drinks, but I wouldn't expect too much from the food. I may have to give this place another chance for brunch.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "I wanted for the longest time to check out this cozy spot on Atlantic Avenue .. \nSo finally I decided to make a reservation for my birthday .. Inspite of my party being late they held my reservation which I am very thankful :)  \n\nThe food was  great !Tuna tartare and risotto top of my list not to mention  the beets \u0026 goat cheese \nThe waitress was friendly as well as the host .\n\nWill be going back soon !\n\nA million thanks you made my night very special", "author": "Gina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Went for a quick beer and some pate. The bartenders were very friendly and on their game.\n\nOrdered the pate for a amuse-bouche. The quantity was quite hefty.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "Love the garlic and parmesan fries! Also, if you're into cocktails, I highly recommend the Basilic.", "author": "Annette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "One of the most exquisite, quaint,  beautiful dining experiences I have ever had was at this hidden little french gem. Paris in Brooklyn.\n  \n  I am a chef myself and decided to venture out on my one night off to enjoy a meal not cooked by myself. Let me tell you,,,,upon arriving in Cobble Hill and finding this place I was blown away. The wine is wonderful, atmosphere is extremely ambient, and food .....always a pleasant experience. I make it a point to visit as often as I can.\nYou cannot pass up the appetizers they are heavenly, always a wonderful risotto, oysters are so fresh and sexy( you cant stop eating them), tuna is so decadent, the lamb sausage and corn polenta will knock your socks off. Entrees I try something new most nights but have to say I'm partial to the duck.  The skate is unbelievable. Dessert ........WOW!!!\n\n From beginning to end this meal is an unforgettable experience. The prices are reasonable, service is very good, and its worth a splurge and a trip to the cozy beautiful Cobble Hill area.", "author": "Kerri D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "I love French bistro food and have had my fair share. Chez Moi was just OK. The pate was standard, but not as good as nearby Cafe Tabac, the risotto of the day was good, but the skate, and fish and chips (not standard French fare) was just ok. \n\nThe ambience was nice, with a bar area and the service was competent if a little casual. and the mixologist was very good. If the prices were a bit more of a bargain, maybe I wouldn't have felt so disappointed. \n\nMaybe it was just an off night.", "author": "Lenny K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "This is the second time I've dined here since they opened, and I'm really glad we decided to stop in.  Their escargot, paired with their simple salad to round off my meal, was delicious, and my boyfriend was very happy with the burger.  Although I wish it came with more fries for me to mooch.  For dessert, we enjoyed their profiteroles.   We sat at the bar and the bartenders were incredibly friendly, if not spread a little too thinly due to how packed the restaurant was.  It's great to see Chez Moi doing so well, and I look forward to coming back again and again.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "The French 75 and the lamb couscous were both fantastic. It's definitely worth another visit.", "author": "Sabine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "I hate to see that some people did not enjoy their experience at Chez Moi. My husband and I go here almost every Friday night. We love the food and the great social experience we always have when we sit at the bar. Of the probably 40 times we've been here, I can only think of maybe two occasions where our experience didn't match up to all the other times. I find that they are very accommodating with their guests needs including large groups, children, dietary restrictions (gluten free), etc....", "author": "Jillian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Love this place for brunch. Cute, romantic, great staff, great food, chill but pretty. Only drawback is the occasional table with noisy children (could something be done about the acoustics, I wonder?), but I guess that's unavoidable in B-Heights.", "author": "Barsista K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}