{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "A lovely, classy spot on wonderful Atlantic Ave. I would recommend coming here after a nice walk through Brooklyn Bridge Park. Lucky for me its one of the closest places for me to pop in to from home. The bartender was making some seriously delicious drinks. Maybe one of my favorites in recent memory. I'd give you the name, but the menu online doesn't have the second page of cocktails. It was a bourbon drink, and a fine one at that. We like to go grab a drink and enjoy the $1 happy hour oysters. You just can't beat it! The beef carpaccio was also delicious, and we looking forward to exploring the menu further.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "My girlfriends and I came here last week. We ordered appetizers and main course. escargot and octopus were my favorite. Food was great but the service was so so. The runner kept bringing food but no one cleaned empty plates so we got a pile by the end of the dinner. Will definitely come again", "author": "Vera D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "It truly is a great corner french bistro.  menu offering extensive with many french classics but not overwhelming. wait staff very friendly, and a special shout-out to the owner, who was so gracious when I had a bit much to drink.  \n\nit's our favorite french bistro in brooklyn.", "author": "Lindsey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "The service and the food were both awesome. Not a fan of the dark, crypt-like lighting (hence I shaved off a star). Some people think it's romantic, but I actually like to see my food and the person sitting across from me :)", "author": "Miklos P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "We came here for brunch on an early Saturday afternoon. The setting was intimate and very cozy-- dim lights and tables that are somewhat tucked away in their own spaces so that conversation can easily be kept within your group.\n \nI had ordered the egg white fritatta with grapefruit juice and my boyfriend had the eggs benedict. The egg white fritatta was tasty and had pieces of asparagus inside. It was a bit on the salty side, but I ate it with the arugula side salad which had a bit of acid to it so it was perfectly balanced out. It also came with a generous helping of homefries which were crispy, hot, and delicious. They had some sort of Italian-herb seasoning on it which made them even more pleasant to eat. The grapefruit juice was fizzy and tasted a bit blunted... errr not as \"grapefruity\" as I'm used to. They may have added some sugar, which is disappointing because I'm a lover of regular, bitter grapefruit. \nMy boyfriend's eggs benedict was delightful! The hollandaise sauce was flavorful and not too heavy; the whole dish worked well cohesively.\nI also heard the crispy chicken sandwich is delicious and popular, which one of our friends ordered.\n\nThe service was attentive and fairly quick throughout our whole meal.\n\nCute little place in BK to have brunch on a pretty spring day!", "author": "Justine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "This is beautiful little French restaurant along Atlantic Ave in Brooklyn Heights. They have a casual yet romantic vibe with dim lighting and superb service. Prices hover in the mid 20s for entrees so it's not cheap but it's affordable if you're looking for nice night out. \n\nTo start I got the French onion soup ($7), the broth was addictive and the abundance of perfectly caramelized onions was great. They skimped on the bread only having put a small slice of the same hearty bread provided at the table (which they continually refill), and there wasn't a ton of cheese either. Regardless it was a delicious soup. \n\nFor entrees me and my friend shared two of our top pics. The classic steak frites and the fish special of the day (striped bass fillet with fingerling potatoes and asparagus). \n\nThe steak was supposed to be a New York Strip cooked medium rare. I found the steak to be disappointingly thin (especially as other Yelp photos of the dish showed a much thicker cut of meat). It was also cooked medium, almost medium well. The fries were average at best, no seasoning or features or flavors that made them stick out. \n\nThe fish dish was very good. The fish portion was modest but it was cooked very well and had a night crispy skin on it. It was sitting in a buttery sauce which had great flavor but could have used a little more seasoning. Overall I was happy with the dish. \n\nAs mentioned before the service was amazing and the restaurant overall was nice, the food I'd say is 3.5 stars but this place definitely deserves a solid 4 stars with all things considered.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "This is a very classy restaurant with a hip crowd and vibe. It is a bit crowded and it gets noisy in here. I love the atmosphere and it feels like a restaurant that belongs in the east village. They have a solid menu with delicious sides. The entrees were flavorful and very filling for a guy who normally eats a lot! They have a full bar with many drinks to choose from. It's a great place to take a date. The wait could be a little long during peak hours, but from time to time they'll allow you to hang out downstairs and have a drink first.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Food was amazing and the service was great, everyone was super friendly and was on point, meaning they looked after all the tables, made sure everyone had everything they needed. I especially loved that the host kept an eye on everything cause he had noticed my dates plate getting full with empty mussel shells and mentioned to someone to change plates. It's attention to detail and the super chill atmosphere that easily makes this place one of my favorites.", "author": "Sammi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "THE PAN SEARED SALMON CHANGED MY LIFE. oysters, risotto, and duck breast were also amazing!! fries were like a fresh, less oily version of a prime batch of mcdonald's fries. cocktails were on point too. great service!\n\nTHE CREME BRULEE ALSO CHANGED MY LIFE. i honestly didn't know this level of smoothness and creaminess existed. my mind has been blown.", "author": "Lorrie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "The food is quite good and the service is very friendly and efficient.  They have a full bar and the prices for both the liquor and the food are very reasonable.  I tried the lamb shank with couscous. It was delicious and too much for me to eat.", "author": "R J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Well, my wife simply adored this spot. Me? I'm a fan. \n\nI'd think this could be a 5-star contender if the escargot came in their shells, as I love to remove them with the spoon/grabber/mini fork tools. The chicken was SO FREAKIN TENDER and my bourgeois burger w/ fried egg \u0026 fries was cooked to perfection.\n\nI'm not going to leave a very helpful review, just check this spot out if you are looking for a French spot w/ nice value.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Took a late evening stroll from manhattan across the Brooklyn bridge to Brooklyn heights. We walked around cobble hill and Carroll gardens for a bit and decided to look for a bite around 1030 on a Sunday. We walked back to the heights and right next to Floyd, one of my favorite Brooklyn dives, we came by a quaint French restaurant. \n\nAt the time, a lot of restaurants closed their kitchen or, upon entry, we received the \"your kidding right, I just want to go home\" attitude from the staff.  Not the case at chez, the food was great and the staff were friendly and inviting!\n\nWe started with a bottle of pellegrino, the soup du jour which was a cauliflower soup and my girlfriend ordered the French onion. Both were exceptional.  The cauliflower soup was perfectly balanced with just the right amount of black pepper. The French onion was great, not as salty or greasy as what you typically find. \n\nWe ordered a bunch of apps to share; we order tuna tartar, grilled octopus salad, and mushroom croquettes.  All were great!\n\nWe split a order of muscles with white wine and shallots.  Also awesome!\n\nThe food was all great, the service was very friendly and there wasn't a hint of that \"please get out because I just want to close\" Sunday night attitude.  We really enjoyed our meal which made a great day better!  Thanks!", "author": "Lou L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-28", "description": "Had one of the most disappointing meals in a long time tonight.  Gave this place a rest after some bad tuna tartar in August.  Went back tonight and had the cod special.  Could not eat it.  Nice bar, go for drinks, eat someplace else", "author": "Bart W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Dinner with my hubby for our night in Brooklyn. This place is classy and quaint, service is on point, and the food is very well prepared! We had the frog legs as an app, and for meals I had the pan roasted salmon and my husband had the beef tartar. All were very good!", "author": "Tori C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Awesome brunch! And yes, the most impressive part: Chez Moi Has SAZERAC! \n\nI was Ubering down Atlantic when I spotted this almost hidden restaurant! I mean, it doesn't even have a sign on it! \nI quickly checked and it was a 4-Star. I went in and was tended by this cute, punk Asian bar tender (didn't catch the name, sorry). I ordered a burger and spotted Sazerac on the drink menu. Not your usual brunch drink but. I had it. It was great!", "author": "Yannick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Amazing all around. Had the duck w/ orange sauce and boyfriend had the chicken. We had the mixed greens and they give you a lot, unlike other places. :) after we went to speakeasy part and the drinks were great too!", "author": "LeAnne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Coming here for brunch on a Sunday morning was the BEST decision I could have made. My friend and I ordered the Eggs Norwegian and Eggs Benedict. The Eggs Benedict was presented very nicely with mixed greens, roasted potatos, and two cute eggs sitting on top of ham and biscuits ($13) Definitely a bang for your buck. The Eggs Norwegian was the same except the ham was substituted with smoked salmon. The restaurant is very quaint and a wonderful setting for dates.", "author": "Chloe W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "For some reason, Chez Moi is never our first choice when eating on Atlantic Ave., maybe because we go there so often and we want to try something new. But we seem to always end up there! The ambience is warm and inviting, the bar serves interesting cocktails, and the food is consistently on the mark.\n\nI always think of Angelina Jolie when ordering the Jolie cocktail at the bar. It has gin, Lillet Blanc, absinthe and lemon. Mmm, sounds like her! \n\nIt's hard to choose an appetizer when everything on the menu looks delicious, but as a sucker for Escargot de Bourgogne, I usually end up with that. The garlic parsley butter is so tasty for dipping bread. Their Foie Gras Torchon is also good. Yum, I could have a heart attack just thinking about the appetizers LOL. As a duck lover, their seared duck breast entree is excellent. The last few times I've had their market fish of the day. The fish is always cooked just as I requested, and I always say I want it moist. My most recent fish was a fresh whole trout, boned. It's always cool to try a special menu item that the chef is excited about. You know they put extra care into that meal.\n\nThe wines are good, and the wait staff is always warm, accepting and intent on making sure you are having a great time throughout the meal. No wonder we keep going back!", "author": "Jerry C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-06", "description": "I really wanted to like this place.  I've been on a mussels kick lately, eating them a few times a week.  After researching and reading reviews I decided to try Chez Moi's mussels to see how they would compare.  Ordered the Mussels mariniere.  A generous portion arrived at the table and the fresh bouquet of thyme sitting atop the mussels seemed like a good sign, alas the broth was underwhelming, the mussels were bland, tiny and we had quite a few unopened (dead) ones included in our bowl.    Service was very good, our waiter was attentive. Atmosphere on a non busy night I'm sure would be charming.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "An update - I have to say, last Sat night I finally made it back for another try and had a complete opposite experience from last time. Honestly, I think the kitchen was just hit hard last time and they sent some food out they probably shouldn't have, but tonight was just flawless. \n\nThe beet and goat cheese salad is a must! Such a delicate creamy goat cheese that sits atop a beautiful cake of richly colored and incredibly fresh/sweet beets - easily one of my favorites. My husband enjoyed the French onion soup and foie gras immensely and I did something I never do - eat red meat. I went for the steak frites and loved it! Perfectly cooked, tender juicy steak (I swear I usually don't even like steak), and exquisite fries - I will crave them for days, I'm sure. The other couple we went with enjoyed the duck and cheeseburger and the kale we ordered as a side was amazing. The Ile Flottante I had again for dessert was the perfect ending.\n\nWhat really impressed me was the service - Mary was lovely and so attentive, and the tall French guy (sorry I don't know the name!) was so pleasant and genuine. \n\nWhile we certainly weren't going to order what we had last time, what we did have really impressed all of us and we will definitely be back for more! \n\nThank you again for the generous certificates and for wowing us the second time around - our first experience here was certainly an anomaly.", "author": "Rachelle R."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}