{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Great food, amazing service, lovely atmosphere. One of the best French restaurants in NY I've tried so far... Highly recommend!", "author": "Gina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "A 3 is average right?  It wasn't great, it wasn't terrible, it was fine.  That is how I would describe my meal at Chez Moi.\n\nI ordered the steak and frites and my partner order the skate.  What made each dish fine and not delicious?  Everything was one noted, I guess you could say.  The one note was salt and luckily it wasn't over salted but a second note of herbs or fat or something to make it more than a boring piece of steak would have really made this a 4+ star dining experience.  My partners dish was more or less a piece of fish and potatoes.  There was no magic on the plate.  No wonderful layers of acid and fat and fun dancing together, just fish and mashed potatoes.\n\nI think simple dishes run the risk of being uncared for because they don't take much concentration to prepare, unfortunately,  doing that, you end up with boring, uninspired food.", "author": "Rian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-22", "description": "A lovely Bistro in the heart of Brooklyn heights with delish food and good Service. We shared several appetizers which were all yummy my favorite was Smoked Salmon with Creme Fraîche, Capers. The smoke salmon as this gal from Brooklyn would call lox was excellent cultivated perfectly with a nice soft oily texture. The oysters where my second favorite starter very creamy just awesome. \n\nMy main dish Skate fish over purée lima Beans, with veggies. The fish tender flaky and the veggies medley was flavored perfectly. My favorite phrase To describe my feeing I had a fun party in my mouth.  \n\nMy dessert was incredible, cream Brulé  perfecto yes another grand party in my mouth. \n\nI will for sure go back to restaurant bravo my friends. Oui oui.", "author": "Heather R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "I was pleasantly surprised by this local French restaurant. My boyfriend really wanted to find a place to have a meal in tribute to Notre Dame after the fire and this was a perfect spot for that. \n\nAt the start the service was a little iffy (we opted to sit at the bar), but after a little bit as the crowd slowed down, we were happy to find the staff accommodating and charming to talk to. \n\nAs a vegetarian, there's not always a lot of options for me in French cuisine, but they were willing to make a veg option of the risotto special. It was surprisingly scrumptious. My boyfriend got classic oysters (they have several flavor options) and fries - if you do anything at all, definitely get the fries. They were incredible! \n\nOverall we had a lovely date night and will return again soon.", "author": "Crissy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-05", "description": "Pretty good French food. We were able to get seated on a Monday night at 8PM without a reservation. \n\nWe ordered escargot ($13) and pate ($11) to start. For entree, I got the duck breast ($28). The escargot doesn't come with shell but was very tender. Ask for some house bread to soak up the tasty oil and brine. I also really like the duck breast - a texture that almost melts in your mouth. \n\nDocked a star for the pate (which was subpar; I wouldn't recommend) and the pricing. It's pretty standard for the area, but entrees are in the mid-$20s and are pretty small.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Always a go to for this neighborhood. Fantastic service for one. The food is always top notch. The escargot is fantastic, always a treat, just so, so good. I usually go with the skate, comes with some nice veggies and mashed potatoes. This time I was enticed by the fish special which was some fish, shrimp, mussels, fingerling potato and zucchini in a kind of light curry sauce. All delicious, just beautifully cooked. My buddy always goes for the salmon or chicken, with the salmon being his favorite. Good wine and a really nice chocolate mousse for dessert!", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "French food without the pretentiously tiny portion size or brouhaha in presentation and design - what more could I ask for? \n\nChez Moi is immediately inviting and warm on a winter's night, illuminated by dim and intimate lighting, and featuring a small but comfy space for you to enjoy your food. My friend and I got here around 7:30 on a Saturday night so we ended up sitting at the bar, which was perfectly fine because for once, this was a bar with seating that was adequately spaced out so you weren't elbowing the people next to you every five seconds. \n\nI ordered the Jolie (absolutely delicious, a little sip of heaven) and the burger, which was excellently prepared and paired with a humongous pile of fries and a well-seasoned salad. The service was a little slow but it was a busy night and the bartender was doing His Best.\n\nThe food here is really, really excellent and I'm excited to have found another gem in this excellent neighborhood.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Right on the edge of Brooklyn Heights, this french like restaurant really delivers. Very friendly, seats you quickly (with reservations), and works to deliver what you desire.\n\nWe really enjoyed the oysters, especially during happy hour prices. The escargot is absolutely amazing. The \"steak and frites\" were our hosts favorites, and ordering them once, we agreed. During our three weeks visit, we went here at least four times - and they recognized us quickly.\n\nGreat place, great food.", "author": "Dan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "We need to go back and try the full menu, but for now, I'm going to recommend the place for happy hour, particularly if accompanied by a sampler of oysters ($1/each), or their grilled octopus with peas. Yes, peas. Crunchy ones. (Though the sauce was a bit too creamy, but hey, it's a French place, what do you expect?)", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "First I got a water glass with a lipstick stain on it, then when I asked if they served oysters on the weekend (not particularly wanting brunch at that moment), learned that they ONLY serve them during the week days, and apparently only when they have the $1 offer. I suspect I'd have a totally different experience if I came for brunch.\n\nI opted for a cocktail instead and got the Chez Moi, which was excellent. But opted to venture elsewhere to cure my seafood craving.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Overall ****\n\nDecor/ambiance *****\nSmall cute french restaurant, nice decor and cozy place with full bar. \nEspecial $1 oysters\n\nFood *****\nHad the seared duck breast with farro and orange sauce. It was absolutely delicious. Duck was perfect medium rare with crispy skin and not too fat. Laying in a bed of farro perfectly cooked, soaked in a delicious and fragant sauce, the orange gastrique was amazing.\nMarket fish of the night was cod. A bed od cod with potatos combined with a white sauce and top with crispy crambles. Very unique dish. Totally recommended. \nGarlic and parmesan french fries. These were ok the garlic sauce made them too oily. You can survive without these.\n\nDessert **\nCreme brulee was disappointing. It was very creamy, which in most cases is good but this creaminess was weird. It tastes like butter, greasy and unpleasant. It definitely didn't tasted like classic creme brulee. The sugar on top was perfect though. A bit burned but not too much. \n\nDrinks***\nThese were kind of disappointing too.  I had order the chez moi especial before checking the review. When someone said do not recommend. Please listen to them!\n\nService****\nService was good. Our waitress was very courteous and attentive.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "I have been here many times and everytime I leave I have a great big smile on my face. The staff are very nice as well which is a good plus. I had the seared duck breast and the moment I started chewing I almost started to tear up, the fatty part of the meat was actually delicious and not greasy as I expected it to be. I'm in love with their escargot and always get it when I can! You simply must try this place out !", "author": "Pierce H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Want to feel like you are in France somewhere? Go and have wonderful time in Chez Moi. The place is very charming, they also have downstairs vintage bar where you can have interesting cocktails while waiting for your table. Wine list has interesting wines for any taste, the food was superb. I personally liked escargot (even it is a staple dish in French cuisine but I ate not great ones, but not here). Waiter personal is very attentive. I will definitely come back. And look at wallpaper while waiting for the bathroom, very French :)", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Great place to get delicious French cuisine.  \nI try to come in at least once a month. \n\nThe mussels are always huge and filling. My favorite are the Thai. \n\nThe steak is a nice cute with a basket of fries. \n\nRecently, I tried the branzino. Very delicious. Was told this was the Chef speciality (seafood). \n\nThe classic cocktails are well done! \n\nStaff is super friendly. \n\nWeekends can get busy - make sure to call ahead to make a reservation.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Just a lovely Mother's Day brunch venue. My daughter had lobster eggs Benedict, which had lots of rich flavor, and a beautiful presentation. I loved my Croque Monsieur, a lovely, crunchy grilled cheese with bechamel and gruyere. \n\nWe saw in a window, enjoying the fresh upbeat ambiance with a view through white lace cafe curtains, and had fine service, even on this very busy day. \n\nA new favorite!", "author": "Ciel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Very nice restaurant.  Great oyster happy hour. The mussels, frog legs and tartare were wonderful.", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "The crispy chicken sandwhich was delightful and the cocktails were perfectly crafted! Was greeted right away. The service was exceptional. My boyfriend and I came here for the first time and it will definitly will not be our last.", "author": "Alicia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "I keep coming back here-because the food is so good : ).  My husband and I have tried a lot of the menu and have thoroughly enjoyed every meal.  Great place for a date night or a cozy reunion with a friend or two.  Not sure about very large groups, especially without a reservation, as the place is a little small.  Which brings me to why I took off a star.  It can be very loud and tight here, waiters are crawling over the chairs and each other to take and deliver orders and I just don't enjoy that aspect as much. Also, maybe because of this?, wait service tends to be a bit insincere and even rude at times.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Wouldn't be a choice for brunch ever again. \n\nChez Moi is simply a mediocre spot - their staff is careless and act as if they're the ones being served. Inattentive and like to take leisurely walks around the restaurant after being asked for simple things.. a straw.. more water... then lastly, as you could guess, asked for the manager who was also inconsiderate and rude after we waited over 45 minutes for our food. \n\nThree more tables were seated around us and were eating before our food ever even came out. This is the second time this has happened while eating here for brunch, yet the manager showed no concern. \n\nIf you're hungry or even on a hangry level, please avoid this restaurant at all costs - there are SO many other brunch spots in the area that would be a much better option and are actually enjoyable.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-05", "description": "I'd like to share what happened afterwards. I was checking my CC bill and was surprised to see a credit from Chez Moi. I didn't understand what it was for- did they make an error on the bill and I didn't notice.  I checked Yelp just in case and sure enough, Sam who is one of the managers, sent me a private note.  He apologized for the poor service and credited me the steak tartar and salad. I have to say that I was shocked. I didn't expect that and it says a lot about the integrity of the management of this restaurant. It didn't change my experience of that evening and our disappointment. \n\nBut it says that they care about the customer experience and are willing to put their commitment behind it. So I applaud Sam and Chez Moi. Even more so for doing this privately.  Businesses are built and sustained one customer at a time and Sam and Chez Moi clearly understand this.  I would give them another try.   But I wouldn't want to be served by that server again.  \n\nThank you Sam and Chez Moi.", "author": "Deborah N."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}