{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Took a while but we have arrived. So many times my friends and I strolled past this charming spot en-route to other locales. Today, my friend and I wanted Sunday brunch at a new spot!! It does get crowded but the table turnover was pretty consistent thanks to the extra staff on hand.\n\nAppetizer Pastry: the Almond Brioche w/ homemade whipped cream and thinly sliced strawberries. Came out sliced into four pieces, warm and oh so buttery w/ a flaky, crispy, lightly caramelized almond slivered top. The crispy top layer kept up thru the entire 3 hr brunch!!! Loooooved the homemade whip, kept on dipping my fork until my friend said \"Go for it, it's all yours!\"\n\nEntrees: Crispy Chicken Sandwich w/ avocado, tomato, jalapeño aioli on brioche bun. Comes with skinny fries and small mixed greens. Oh, and it's chicken thigh - no dry, bland breast here. The breading wasn't too heavy, just enough crisp and spices. I enjoyed it immensely. My friend had the buttermilk pancakes w/ bananas and side of bacon. Pancakes were ok, nothing spectacular and she would not order it again. (The best pancakes in the area including lower Manhattan still belongs to Cafe Luluc.) However, the bacon was pretty darn good.\n\nLibations: the Pomme (green apple cocktail using their pressed juice), the Juliette (bourbon? Iced tea cocktail) and the vodka w/ lemon sorbet cocktail - can't remember the name. The first two were ok - dunno if there was any alcohol because I couldn't taste anything and my face didn't even turn red. Maybe I chose the more demure cocktails?! My friend enjoyed her cocktail so much she had two and they were definitely boozy.\n\nAlso had the bottomless Colombe coffee - had it iced and it was quickly watered down w/ the melting ice. So sad that the coffee wasn't as good as it would be if served hot - wonder if they would consider making a cold brew version if customers want iced?! Or at least don't overfill the pint glass w/ ice?", "author": "janet l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "The hidden bar downstairs was a nice surprise with an air of exclusivity. The food was amazingly seasoned. The duck and steak were my fave entrees.", "author": "Leesa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "This is our go-to spot around the neighborhood.  The mussels are a must, we've tried them every way (they have 5 different preparation methods - all very good our favorites are the white wine and the thai style methods).  They are always very generous in their serving sizes, it's a meal and a half!\n\nThe wait staff is always pleasant and attentive, they change out your shell bowls numerous times throughout your stay.  The cocktails are amazing and the food is so incredibly worth it.  Can't miss!", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "My boyfriend and I wanted something low-key, no-frills, local but still romantic for our valentine's day dinner.  Chez Moi was a good fit.\n\nIt wasn't a huge pain to make reservations a week before, which is the biggest plus.\n\nRestaurant is cozy and has a lot of charm. Perfect for an intimate dinner.  It sits maybe about 40 people.  I didn't feel too cramped even though it was a full house.\n\nI loved our waitress.  Even though she had a lot of tables to tend to, she remained calm, polite, and friendly.\n\nThere was a prix-fixe menu option, but you can order from their regular menu as well.\n\nThe prix-fixe was $49 and it came with: complimentary champagne, appetizer, entrée and dessert. I ordered:\n1) Foie gras - delicious! I would recommend this for sure. Bread was perfectly toasty too\n2) Scallops - fell short.  They came out undercooked the first them and had to send them back.\n3) Cheesecake Crepe - this is a crepe layered cake.  The cheesecake/crepe combo didn't work for me.\n\nMy boyfriend wanted some other dishes to diversify, but truth be told the prix-fixe menu had 75% of the things on their regular menu.  Anyway, he ordered (these were not on the prix-fixe menu):\n1) Escargot - very meaty.\n2) Lobster Bisque - came out lukewarm which was disappointing, but flavor was decent.\n3) Mussels - some were sandy, but most were pretty good.\n\nMy favorite part was that everyone received a rose when the check came.  That was a really nice touch for Valentine's Day.\n\nOverall, there were some hits and misses.  I think I would still recommend this place for a date, maybe not a special occasion.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "This is one of my favorite brunch places. It has warm service and delicious food and drink. They have sweet and savory options that are a good size and reasonable price.", "author": "Carrie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Unfortunately I didn't have a good experience here which is surprising given the decent reviews and the full restaurant when I was there. First off, it's very warm...it's winter so I had a light sweater on and I wanted to rip it off it was so stuffy inside. Foodwise, everything we had was a miss. My friend had the grilled octopus and lobster risotto. The octopus was overdone and the risotto was rather fishy and lukewarm at best. I had the tuna tartare and duck breast. The tartare was a large portion of avocado with a little chopped tuna on top. I don't mind paying money for good food, but I'd like to have tuna as part of the tuna tartare. And the duck breast was very fatty compared to what I've had elsewhere.\n\nThe restaurant is adorable and I wanted to love it, but it was just one miss after another.", "author": "B B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "Great food, nice atmosphere, and good drinks. \n\nBurger is phenomenal (sub for parm fries). Risotto is usually REALLY good!! Soups and chicken are outstanding. Everything (besides steak tartare) is very tasty! \n\nStaff is very friendly!", "author": "Beth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Chez Moi is Chez Awesome! Had a friend in from out of town and decided to trek up from South Brooklyn (we're in dire need of good brunch spots) after reading reviews and they SO lived up to them!\n\nFirst off - I was expecting a long wait but there were only 2 other parties there fairly early in the AM! No wait FTW!\n\nSecondly - the staff from the host to our waitress were amazingly nice and fun. Especially patiently listening to my rambling raves about their Almond Brioche. \n\nMost Important - THE FOOD IS DELICIOUS! The brioche I wrote about a sentence ago is to DIE for. It's not on the menu (it was the pastry of the day) and came with sea salted caramel (REAL caramel - not some faux crap) and fresh whipped cream. MMM HMM, that's right, your mouth is totally drooling right now, isn't it? I had the Croque Madame while my friend had the Quiche Lorraine; both have rosemary crispy potatoes and a little salad and were perfection. Top off with a mimosa or bellini (and great coffee) - you have yourself a pretty perfect brunch.", "author": "Shar M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Good French food. \nWe had the duck and strip steak, which were excellent. Cocktails and wine were fine. \n\nThe salad was pretty basic and  service was French. So room for improvement there. \n\nWould definitely go back, though.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I went here for brunch and had a great time. We received wonderful service, and my food was delicious!\n\nI got the eggs Norwegian, and it was so good! It was a really nice size portion with these delicious breakfast potatoes and a salad on the side.\n\nJust thinking about it I'm ready to go back again! Yum! I definitely recommend it for a lovely weekend brunch!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I love this place! Wonderful service and delicious food! I've had the mussels, snails, the octopus and the skate fish and all were amazing. Also good wine at reasonable prices. One of my favorite places in Brooklyn heights. Also la boudoir is just downstairs :) the chocolate mousse is also delicious!", "author": "pamela b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "My wife and I went to Chez Moi the first night we were in Brooklyn. The menu reminded us of newer Minneapolis spots with a distinctly New York vibe. We showed up around 5:30 (admittedly early) and we could tell the place was just getting ready for the night. By the time we left around 7 it was much more lively.\n\nI started with a glass of wine and my wife had the Chez Moi cocktail. Both were excellent, but I would have to say the cocktail definitely had us talking afterword (very sweet, but subtle flavors; kept us wanting more).\n\nFor food, we began with the croquettes. Many previous Yelp reviewers led us toward them and we obliged. They were tasty, but not the showstopper we expected. However, if you order them expecting a solid appetizer you won't be disappointed.\n\nThe main course for my wife was the chicken. It was well cooked, full of flavor, and extremely moist. It was easily one of the best chicken dishes I've tasted, especially when every restaurant has a chicken dish on the menu.\n\nI had the duck breast, which WAS the best duck I've had. I am usually hesitant of duck at most places because of the gamey flavor it leaves and the poor texture it exhibits. However, the Chez Moi duck breast was much more like a solidly cooked medium rare steak with more complexity. I cannot recommend it enough.\n\nIn all, I would recommend Chez Moi for a no-fuss, solid, bistro dining experience in a very nice neighborhood of Brooklyn.", "author": "Tom N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Lovely little boutique bistro in Brooklyn Heights/Cobble Hill! Friendly staff, cool bar area, and delicious food. \n\nBeware: as many other Yelpers noted, the Brooklyn parents come out in force with their kids on Saturday and Sunday...not the most appealing ambiance.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "After trekking around Brooklyn in the sunshine all day we were ready to sit down somewhere and eat something delicious. Not just anything would do.\n\nChez Moi hit the spot in so many ways.\nWe started with the escargot, which, while they weren't served in shells (what was I expecting, honestly?) were extremely fragrant and we sopped up the garlicky oil with some spongey and flavorful sourdough bread.\n\nI has the Bisous cocktail: bourbon, melon puree, ginger. Delicious. Served on the rocks. \n\nI ordered the roast chicken, hoping I wouldn't be bored by it, and oh...my....god! I didn't know chicken could be so tender and rich. Maybe makes my top 10 favorites list. It was that good! And it was JUST CHICKEN! Was it covered in butter? Maybe. Probably. Who cares.", "author": "Aviva B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "We just had lunch here, we were in a hurry but really wanted something good instead of something quick in a to go box.\n\nThe server was so accommodating and nice. Everything we ate was absolutely wonderful! Tuna tartare, escargot, Caesar salad with salmon, and mussels in white wine broth were all so outstanding. Prices were really reasonable for that type of food and quality of food. \n\nI would recommend this place to anyone! They are only open for lunch on Fridays though, but I'm sure dinner is equally good or better. I wish we lived nearby so we could come here more.", "author": "Vic S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Four of us had dinner at Chez Moi last week.  It's a great little place with a bar at the front and tables at the back.  We'd booked a table and ended up having to call to request they hold our table as the traffic was terrible.\n\nWarm reception when we entered, we were greeted by the hostess and a fellow who looked to be the manager.    We were seated and our server Ashley came by to tell us the specials and take our cocktail order.   I had a Basilic which had to be one of the best cocktails that I've ever had.  It was gin based maybe? It had the freshness of basil (and was garnished with a leaf of basil) with a bit of sweetness but not at all fruity.  An absolutely perfect summer drink.   My friend prefers tequila, and on Ashley's suggestion she had a drink made with smoky mezcal?  It was good and tasted like a truly well put together drink, but mine was more delicious.   Top marks for the bar.  Our husbands shared a bottle of wine which was around the $40 mark but I can't remember the name.  They both have good wine palates and they said the wine was perfectly serviceable which is a funny way to describe it. \n\nWe shared a dozen oysters and a tuna tartare to start.  On Ashley's suggestion we had three types of oysters and they were all very fresh, firm and plump.   The oysters were served on crushed ice with cocktail sauce and a shallot vinegar sauce.  I loved the shallot vinegar but my table mates all decided to mix the two. That's too much flavor for me.\n\nFor dinner three out of four of us ordered Steak au Poivre, served with fries and a small green salad.   My friend ordered the roast duck breast after first talking to Ashely to let her know that she wanted to make sure that she could have the duck cooked through - as in no pink.   She would only order if it could be prepared in this way, otherwise she'd order something else.  She was assured that the duck could be prepared \"well\".    She even commented that she loves duck, but never orders it because it's never cooked to her liking, as the chefs always insist on preparing it THEIR way, not to the guests request.   You can guess what happened, of course.   The duck was brought, it was very pink and the texture was indicative of medium rare at the best.   She called over the server and requested that the duck be taken back to be cooked more, as she'd specified that she wanted it cooked well.   It was taken away, brought back five minutes later with very little change.  We've all watched enough shows to assume what conversation went on in the kitchen.  The chef has every right to prepare the dish as he sees fit, but does not have the right to accept an order outside of the norm, and then not prepare it as requested.  Simply say no - the duck is prepared like this, order something else that can be cooked more to your liking.    If it had been me I'd ask for it to be taken back again and a new plate prepared but my friend is far nicer, and decided she'd eat the outside pieces and leave the more rarer parts on her plate.  Ashely came by to check on all of our meals, and my friend said that despite returning her plate it was still not great, but she was goiing to keep it.   To me that would be the opening for the server to either offer to correct things or else call the manager to let them know that despite the food being returned it was still not to the guests satisfaction.  She ate two small pieces, one from each end of the breast.   The same server/food runner saw the majority of duck on her plate and nobody said anything.   \n\nOur steaks were perfectly cooked, amazing french fries and a delicious vinegarette on the salads.  I'd definitely go back again, but I am a bit disappointed that the wonderful service didn't extend to ensuring that my friends meal was properly executed, and that the manager didn't at least come and offer an explanation or a comment of some kind.   We were there early and it did fill up very quickly, and so this is the only small critique on an otherwise very good meal and evening.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Still love this place. Came here for dinner with two friends and the waitress was amazing. She did her job with efficiency and care. She also had lots of compliments for our food choices which just made us feel good about ourselves. For dessert she suggested the proliferitoles which were amazing and was no where close to the most expensive dish. She also didn't pressure us to get individual dessert and even suggested that we share since she could see how full we were. The food was great as always.", "author": "Helen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Great atmosphere and ambiance, I really liked that the bar is pretty spacious and they have those great big window/doors right in the of the restaurant by the bar, very airy, love that. \n\nI had to give them 4 starts because of their limited menu and they are not very vegetarian friendly and do not have many food options. They do have a great wine selection which I can appreciate. If you are looking for a great place to just chill with a friend with a great glass of wine and some starters they are awesome.", "author": "Mariana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-02", "description": "Worst salad ever! Bibb lettuce with meyer lemon dressing should have been delicious but instead was inedible\nThe waiter should have noticed and asked why I left immediately\nThe chef should have tasted it before serving it\nI would have happier if I dropped 20 dollars on the ground because then the at least the person finding my money would be happy", "author": "Tamra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "I had dinner last night at Chez Moi which has become my family's go to French spot in Carroll Gardens/Brooklyn Heights.  A comfy rustic setup in Brooklyn offering solid bistro fare at affordable prices.  There is added value of the associates \"speakeasy\" lounge downstairs (Le Boudoir) with VERY strong bespoke cocktails and small plates.  The number of mains at Chez Moi are varied but not too numerous ... focusing on quality not quantity.  We usually order the roasted salmon, roasted duck, steak frites, or mussels.  Go appetizer the escargot dripping in oil and garlic, served piping hot in the clay dish fresh out the oven.  Finish with can't miss desserts: profiteroles, creme brûlée, or chocolate mousse, among others, along with a kickass creme de menthe dessert cocktail \"the Grasshopper.\"  Attentive service, ensuring your water carafe is always refilled and plate service is timely and fresh.", "author": "Michael N."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}