{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Delicious, courteous staff, cozy atmosphere. My go-to French spot in Brooklyn!", "author": "Deena K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "I love this place so much. Wonderful staff, perfect menu, high quality produce and most importantly not a pretentious type of place. My favorite is the skate fish. I just wish they had oysters every day, not just certain days.", "author": "Ingrid C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-02", "description": "We really wanted to like this place, but it fell short in so many ways. The atmosphere was great, as was the decor, however after being seated everything started to go downhill. The bottle of wine we ordered was perhaps the only highlight of the evening. Aside from that the food was mediocre (I've had better moules frites at hole in the wall places in France and Belgium) and the service deplorable in that we were rushed to the point where I feel I should have just grabbed dinner at some fast food drive thru and called it a night. \n\nWe had a reservation, which to me means: I have at least an hour and a half, if not a bit longer, to enjoy my meal. That wasn't the case at Chez Moi where we barely had enough time to finish our starters before the mains were upon us. The mussels were decent though some were undercooked and others too rubbery, and though I made my dairy allergy clear I'm still quite sure butter had been added to the broth. The fries served with the mains were an over salted and limp let down, and the steak tartare was less about the perfect combination of ingredients and more about the over abundance of some mayo type sauce. Our bottle of wine - the sole highlight of the evening - had to be chugged down thanks to the server's heavy hand and the generous glasses she poured in a bid to get us to finish off the bottle as quickly as possible. Our unpleasant evening ended when we were presented with the bill (though we each had more than half a glass of wine left to drink). When the server came around to collect the bill and realized we hadn't signed it just yet we were told rather rudely: \"Just so you know I'm going to need the table in a couple of minutes.\" It was the final insult after an already disappointing evening. Mind you our biggest regret was bothering to leave a tip (though trying this restaurant in the first place could possibly trump that error in judgement).", "author": "JoAnna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Went for a date night and was blown away by the Chez Moi cocktail and tuna tartare. Will go back for both! The steak frites was so-so but my Boston salad was killer.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "It was kind of pricey for the quality of the food, but I still enjoyed it. Mushroom crepe, yogurt with honey, and unlimited coffee can get me any time, and Chez Moi's was fairly good.", "author": "Manda H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-12", "description": "I have read several reviews from other customers of chez moi and I am hoping that I just caught them on a really bad night.  I had the escargot, risotto, croquettes, butternut squash soup and foi gras.  The most consistent thing about the quality of the meal was that it was very overdone and temperature hot.  Who would have thought it is possible to mess up truffle croquettes but they were unfortunately similar to cardboard stuffed with glue. The only passable dish was the foi gras.  I am thinking that maybe since it was after 10 that maybe the chef had left and remainders were being heated up in a microwave, but who knows.  It was a truly unfortunate meal as it would be great to have more goto restaurants in the area.  On the plus side, our server was attentive.", "author": "Thomas Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "This place is special. From drinks to appetizer, and then from the main course to dessert, every piece is well prepared and all the ingredients are perfectly matched. It's delightful to eat here. Some of my favorites include the duck, fish and profiteroles. Their cocktails are lovely for the summer. Go French!", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Great cute ambiance! The food is decent, the vibe is great, and the little speakeasy downstairs was a real treat!", "author": "B U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "Friendly french speaking staff, delicious fish dishes, good ambiance, yum cocktails. Overall a good impression.. but it doesn't have 'it'. A sense of 'trying to hard'.\n\nThey would benefit from putting some real love and effort into their dishes. That would tweak the experience into a 4 star rating and make you feel like they genuinely love what they do.", "author": "Miss P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "Was here for brunch last weekend. I enjoyed the visit, but not so much that I'd run back there for another midday meal next weekend....That said, the $1 oysters on Mondays, Tuesdays and Wednesdays has already piqued my interest.\n\nThe good: Wonderful, welcoming decor and atmosphere; polite and attentive service (bread refills, yes!); succinct menu with a range of options; excellent Bloody Mary's (made with the thicker tomato juice, spicy but not insanely so, etc). \n\nThe less good: For my entree, I ordered a goat cheese salad...expecting pretty much what it sounded like (salad greens, goat cheese, ideally some additional veggies), and expecting a generous portion for the price (somewhere in the mid-teens). \n\n...Turns out, the goat cheese was breaded and fried, which doesn't sit well with my delicate, gallbladder-free digestive system. I guess I should have asked, but ugh. Can't they call it \"crispy goat cheese salad\" or something? \n\nMy date went with French toast, scrambled eggs and bacon. He was satisfied, but not blown away. We could have made the french toast using basic white bread at home and thrown some bacon in the microwave -- nothing standout about the dish, especially given the price.\n\nIn hindsight, I think the free bread was my favorite part.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "Came here for dinner with a good friend who works nearby and recently discovered this place. Staff was lovely - attentive and friendly, the food was delicious (paté for starters, Montauk sea bass with marbled potatoes, wild skate with haricots verts, crème brûlée, and profiteroles), and the ambience was nice - dim but nicely so, and a great place to relax and chat. We arrived around 7:15 on a Wednesday and by 8 all the empty tables around us had filled. Probably best for couples or very small groups. I'd definitely recommend and come back!", "author": "Ella R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "Lovely and cozy restaurant with great food. The Foie Gras appetizer is so delicious.", "author": "Ester L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "I write this review as a warning to those considering eating at Chez Mois. I have been to Chez Moi 15+ times and it has always been a hit or miss experience. The food is generally decent but the staff can be rude. I have tolerated the rude staff until last night when I decided I will not give them another penny again. I met my wife and a friend there for dinner. The place was packed but we got a table right away which was a pleasant surprise. After we were seated we ordered appetizers and a bottle of wine to start. After we ordered the waitress comes back and says that they can not serve my friend alcohol because he is intoxicated and they asked us to leave. My friend was not intoxicated what so ever and when we asked her why she thinks so, she said she didn't know and said we should ask the owner. For clarification up to this point I don't think we said a word to each other except to agree on a bottle of malbec and an appetizer. There was no boisterous scene that one would expect an accusation like this arising from. It must have been a misunderstanding. We got up to ask the owner why he thinks my friend is intoxicated and to smooth things over and chalk it up to a misunderstanding. The owner didn't have an answer and refused to speak with us. We said we would write about this and he flippantly said we should tell as many people as we want. What motivated this? Did he not like the way my friend looked? Did he remind him of someone he hates? This was starting to get surreal... why did the owner single out my friend? \n\nThen it occurred to me that they just wanted to give our table to someone else. \n\nThe host at the front of the house made a mistake and seated us ahead of the line -that's why we where seated so quickly. In the grand scheme of injustices this one is insignificant but it still stings. If this was an isolated instance I wouldn't bother writing this but it is the straw that broke the camel's back. There are many wonderful restaurants within blocks of Chez Mois and you really can't go wrong anywhere else. We ended up across the street at Henry Public with some delicious burgers and ended the night on high note.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Went for a Saturday night dinner.  The atmosphere was pretty and lively - lit with little candles and lanterns, mostly French staff who were very attentive.  The food was very good.  Truffle croquettes and french onion soup were amazing.  This place is the real deal and I will be back!", "author": "Brenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "All around great place!  \n\nMy husband and I have been going here for some time now and it's become our favorite restaurant.  The atmosphere is classic French bistro, the service is very friendly and inviting, and the food is consistently good.  \n\nThe dishes are mostly really well done versions of traditional bistro food.  Their risottos are flavorful and fresh tasting.  The crepes are light and tasty.  A recent cod special was well cooked and delicious.  The mussels are really good and they make one of the best burgers I have ever had!  And to top it off, the pricing is very good. \n\nOne of the owners is usually on hand to welcome you and make you feel at home.  The rest of the staff is attentive and warm (a special shout out to Fardosa and Eddie).  \n\nI'd love to keep this place as my little secret, but I want it thrive as an oasis among so many mediocre \"hip\" places in Brooklyn.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Exceptional experience.  Friendly and helpful staff, great food (had chestnut praline crêpes and aptly-named roasted bliss potatoes), and well-made drinks.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Went here for my birthday with my wife and two daughters. So glad we did! The escargot was lovely. Of the four different choices of mussels, I chose the white wine sauce. I almost consumed the remaining broth with a spoon. One daughter had the skate and ate every last bit of both the fish and the sides. My wife had the salmon. She said it was good but not spectacular. My other daughter is a vegetarian. There are not many choices for her. But she had a green salad which she enjoyed, but really raved about the beet salad. She normally leaves a little something on her plate, but there wasn't a beet left this time. I was not a huge fan of he fries. They were definitely crunchy, and well, I'm not going to complain about not being able to finish my fries. We did not have any desserts since we had a cake at home from Baked. I hope to return and do a full dinner.", "author": "Randi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "Chez Moi is a fantastic find -- an excellent, but reasonably priced french restaurant, with no pretense.  The food at dinner varies from excellent to unbelievably excellent and the service is always impeccable.\n\nWhile the menu choices are sparse, everything on it is delicious, and the often-changing daily catch is always superb.  If you like shellfish, they have a $1 oyster deal before 7pm most nights and they have mussels prepared several different ways.  It's small and they seem to do a good bit of walk-in traffic, so it can fill up quickly, but they take reservations by phone or email, and you can often get a reasonable reservation for the same day.", "author": "Josiah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "I come here once a week for my oyster fill and each time I fall in love with this place just a little more.  The staff is incredibly friendly and accommodating and the atmosphere here makes you want to linger forever (how I judge a good place).  There is always nice music on and I can't help but feel like I am in a quaint Parisian bistro.  Chez Moi - you won my heart.  Oh and how can I forget their sourdough bread - to die for!", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "Went here for brunch and got the Eggs Benedict. The service was slow and they overcooked my egg. The Bloody Mary was good and the bacon servings were very generous.", "author": "Daniel C."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}