{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Had a lovely brunch here with family yesterday! This tiny, yet lovely \u0026 sweet place has delicious food \u0026 great service. Decor is clean \u0026 quaint ... Gives a warm vibe.", "author": "Laura A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "The drinks and the service were good but the food was just bad. My duck was bland and way undercooked and the sauce had a bitter taste to it. My girlfriend also had some risoto that tasted like hospital food.", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Omg !!!! Went their a couple days ago and I've heard that they have a gay night every first Sunday of the month in their speakeasy bellow the restaurant ! Finally something fun in the neighborhood ! I can't wait to go", "author": "By M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Duck (medium rare breast) has disappeared from so many places, but here it's on the regular menu with the most delicious farro. Also good steak frites, mussels and a terrific charred octopus appetizer. Brunch menu is great too.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "Found this place on Yelp but we weren't too sure about it until we walked by and so how cute it was.  Tried the burger and the salmon club.  Both came with fries and greens.  The burger was one of the best I've had.  So juicy and flavorful.  BUT the bun was store bought and cold - not cool.  The burger was so good we ignored the bun, but a brioche or other fresh bread would have made it better.  The salmon club was really good too but had too many red onions for my taste.  The fries were awesome.\n\nThe service was lacking and our waitress forgot our drinks.  She didn't apologize and the place wasn't that full.  We flagged down someone else to ask for our drinks since we had seen them sitting at the bar and they were kind enough to bring them over.\n\nVerdict: food 4 stars, service 2 stars", "author": "Marina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-17", "description": "They are not baby/stroller friendly.  I won't go back.  I guess they don't want my family's business, telling us to go elsewhere nearby when they were empty for late lunch.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "This place is great! Their fries are so good, I haven't stopped thinking about them since I've had them here. \n\nWe came during an extended happy hour on a weekend, apparently they had too many oysters for the week and needed to serve them before they went bad. Not complaining at all.\n\nWe also had the seviche which was also great, you could tell the ingredients were very fresh.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Service here was fantastic. Ambiance was quiet and calm with great decor. Food was excellent!", "author": "Oleg D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "I love Chez Moi!! Super consistent fresh food and great drinks. It has a chill local environment that has really grown to be my favorite spot. Jesse is basically the best and most fun bartender in Brooklyn!", "author": "Simone S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Great food at reasonable price. Go for Onion soup and mussels. Very nice ambience. Bar downstairs is a nice hideaway place", "author": "Feliks K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "The brunch at Chez Moi is on point. I had the eggs benedict which was delish - the eggs were perfectly runny, the ham was grilled with a nice rosemary flavor and the English muffin tasted very fresh and was a little doughy to contrast with the typical flat English muffin I'm used to for brunch. The place is really cute and my friends enjoyed their food (a quiche and crepe) as well. I've been to the popular, next door brunch spot (Colonie) and definitely was more impressed with the food at Chez Moi. Colonie has a bit more of a vibe-y atmosphere to it but Chez Moi is a nice go to when you want good food and don't want to deal with a crowd. The service was also great and our food came within 15m or so of ordering.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Such a cute French spot with a great atmosphere. We took full advantage of their $1/oyster happy hour special. The cheese plate was also a delight. Great bartender and lovely spot overall.", "author": "Tara F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-11", "description": "Small little French place we happened to walk by on a Saturday for brunch. Good service, decent food (my blueberry pancake was almost like a muffin in consistency which I didn't really enjoy), and cute interior. Being that it was a holiday weekend, the place was not super packed and we didn't have to wait for a table. There were perhaps 5 other groups of people and EVERY SINGLE ONE included at least 1 child, most had 2! I'm not a kids person so when there are kids yelling or running around, I am disgruntled. Will probably come back if I'm in the area for dinner.... everyone was having brunch mussels which seemed to be the thing to have! Will prob not miss it if I never came back... lots of similar French cafes in the hood", "author": "Michelle Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "I have been here a few times for dinner and it has become one of my favorite restaurants in the area. The waitstaff is fantastic. Every server that I have had here has been incredibly nice as well as knowledgeable about the menu and different wines. I have also really enjoyed the food. My first time here, I had the risotto of the day which was fantastic. My friend tried the mussels and loved them. I have also tried the steak tartare and the steak frites; both were delicious. \nI have tried to go to brunch here a couple of times but unfortunately the wait was about 45 minutes every time. I believe they take reservations for brunch so I may have to try to do that some weekend.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "What can I say..the food was great,I got the duck that was reccomend by other viewers...the only downside is my cocktail wasnt all the way fill...btw make reservation,you get seated right away,even on holidays..", "author": "Lillian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Nice French bistro with exceptional service and great food at reasonable prices. Had the steak frites with peppercorn sauce. Very nice. The drink menu is outstanding and the wine was good too. Would go there again anytime.", "author": "Stephan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "nice place--soft lighting, quiet and relaxing but they lost me at the $5 per person charge for the cupcakes we brought for my daughter's birthday celebration--they were willing to cut it in half to $15....on a nearly $300 bill?  I was there to relax and eat, not haggle...waiter totally taciturn about the whole matter, and manager not available...In the end, the unsmiling waiter took off the fee....", "author": "Cheryl M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "I wanted to try everything on this menu! They have a large variety of mussels on their menu and the portion is huge! I would recommend sharing with another person. I got the duck as an entree. Delicious! I thought the portion was a little small when they first placed it infront of me. but then i couldn't finish! For appetizers i had the french onion soup and pâté.", "author": "Betty C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-13", "description": "Chez Moi opened a few months ago on Atlantic Avenue and as big French food aficionados, my wife and I were eager to try the new place in town.  We were disappointed.\n\nThe seating is far to close, with two booths for four people approaching ridiculous in terms of the space they offer (or actually, don't offer).  We found the service to be borderline rude, as they would not seat us at the table of our preference, despite the fact that there was plenty of space available.  The food is good but expensive for what it is, and same goes for the wine list.  The red wine was served way too warm and we had to ask them to refrigerate it for 15 minutes before it was drinkable.\n\nAll in all, considering the other dining options available in this part of Brooklyn, whether on Atlantic Avenue or Smith Street, Chez Moi does not deliver good value.", "author": "Michel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "I'm SO SO SO happy that I live around the block from Chez Moi. I have been here numerous times since moving to Brooklyn Heights in August. Our visits have ranged from drinks with mussels to full dinners to brunch... and we have never been disappointed. The ambiance is lovely and the cocktails are tasty. I'm excited to go back in the near future to sample more offerings on their menu!", "author": "Allison J."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}