{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Tio and Pio in Brooklyn New York, it's great place to go to eat as a family. Friendly staff and clean", "author": "Oliya C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "We lucked out by finding this restaurant after a long walk in the Cobble Hill and nearby areas. It's on a street with several nice restaurants near the river. We didn't have a reservation but they were very kind about it,  perhaps especially because it was only 6 o'clock. Soon the restaurant became quite full and had a variety of middle-aged and thirties couples there. The restaurant was very reasonably priced, as was the wine list, and yet the quality was extremely high. We had mussels and steak tartare. The former were in a Dijon broth which was just right and the steak tartare was not full of mayonnaise. We felt right at home and would love to have the restaurant in our neighborhood in Manhattan!", "author": "John V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Went there for brunch and it was delicious! All of the portions were big and the fresh squeezed juices are to die for! The staff was so kind as well... Definitely returning.", "author": "Hannah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "These 3 stars go to the hostess, blonde girl that made us move ( not even asked) because a party of three wanted to sit at the bar... We come here to hang out at their bar, great music, great cocktails and great bartender... Hostess, you suck, need some hospitality skills here.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "A solid little restaurant on Atlantic Ave. brunch menu was fun and inexpensive. I had the croque; super tasty. The brunch prices were very reasonable for the area and service was quick. Def will go again and try the dinner menu.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Stumbled in here on the way to an open mic with a few friends. Everyone loved the food! (Even the pickiest of my friends who hates everything we choose, was happy and smiling!! That was quite an accomplishment in my eyes!!) Please try the octopus appetizer and any of the cocktails!!\n\nCannot wait to go back! Staff was very friendly and attentive!", "author": "J Mase I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "A lovely spot for a date (especially a first). The staff was so impressively attentive, and friendly. I really enjoyed every detail, morsel, and my company. I would definitely return here, and recommend this spot to anyone. If you are looking for a romantic date night location this is it. xo", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Very nice ambience and high quality dining experience. One minor detail: they should use cloth napkin instead of paper napkin....", "author": "Frank B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "This place is a super-cute small bar/restaurant that reminds me of the kind of neighborhood restaurant you'd find on many corners in Spain or France. Long, full bar with hardwood, small seating area and a few sidewalk tables as well. I came here with a friend after work after seeing their sign for oyster happy hour. Now if you follow my reviews, you know how much I love oysters! I could eat my weight in them if I only had the cash :-). \n\nTheir bar selection is excellent, with refreshing Kronenberg beer on tap that pairs well with seafood. As far as cocktails go, I'd recommend their Jolie - it's a gin drink with vermouth that is crisp, light, and perfect for a hot summer day. I very much enjoyed the oysters (from WA State and Long Island). The kitchen did get a bit backed up, resulting in a 45 minute lag time between placing our order and the oysters arriving. However given the quality of their menu and the great atmosphere, I can easily overlook this. Looking forward to my next visit!", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "The Charred Octopus is a good! The first time I had it, it was made perfectly. The 2nd time I had it, the texture/flavor/crunch was somewhat off. (From the first experience) On the initial bite, the octopus was perfectly crispy with a pinch of salty taste. As you bite into it, it becomes so soft and tender that it melts in your mouth. \n\nI had the Wild Skate fish, and it is more on the sour side. It was delicious and the potato foam was a great complement. \n\nHad the chocolate mousse and ended dinner there. Portions are small. Service was great!!! The waitress did not mind at all taking her time to answer all our curious questions about the food.", "author": "S L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "I really, really wanted this place to give Colonie a run for it's money...but alas this was not the case for me and my husband. Walking into the restaurant gave me an excited feeling....oh la la everything had a very French feel to it (even our hostess who sat us down had a French accent) and they were playing 'French Café' music.....the ambiance is definitely a 5-star! The food on the other hand was comme ci comme ça ... which is why my rating feel down to a three (sigh). At this moment I want you to google the image of a \"croque monsieur\"...you can see the meat right? Well, I ordered the croque monsieur and my husband ordered the croque madame (it just has a poached egg on top) ...both sandwiches only had a slice of meat and honestly tasted like a grilled cheese sandwich. The crispy french fries saved the meal because they were delicious!", "author": "Amina-Louise J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Checked this place out on a double date. Great food, with a classy, low-key ambiance. The specials of the night were the best dishes, though everything was thoughtfully prepared and tasty! Great for a date or for a small group.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Service is always great. Drinks are always strong but well concocted. Have never had a bad meal. It's the go to spot if you don't know what you want but you know you want to do something.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "Sometimes with high expectations come low results...but the menu sounds good and the service was great, so a second visit will be planned in the future for an updated/revised (and hopefully more starry) review \n\nWe got there at 4 (when it says it opens for oyster happy hour), were seated, and then learned it actually opens at 5 for the kitchen...so oyster happy hour for an hour it was! They had 2  choices of oysters, both were tasty, well chucked, and with yummy horseradish on the side. This (and the great service - granted there were only 2 other tables) earned them 4 stars if the rest of our meal wasnt ordered.\n\nFrom here things went south. We ordered the tuna tartar and garlic fries...simple staples that you really cant mess up...or so we thought...fries were hot but flavorless (all the garlic collected at the bottom) and tuna was oversalted with a poor ratio of tuna to avocado. Such a shame because it looks delicious...\n\nAs i said, we plan on returning with hopes this time was just a rushed fluke", "author": "Donna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "Croque Monsieur: it is simply not ok to make one using rye bread. I mean, would you bake a cake with rye bread? What about rye bread donuts? Rye cookies? Rye flour anyone?\n\nOn the bright side, probably one of the best bloody marys around.", "author": "Will N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Amazing cocktails and great food. Awesome Brooklyn Heights joint! The bacon old fashioned (not its actual name) was so smokey and good - if you like bacon and bourbon, you have to try it. There were several other cocktails we wanted to try so we will definitely be back. As for the food, everything was delicious but special shout out to the perfect creme broulet we had for dessert.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "Nice  neighborhood french bistro which offers your typical standard bistro selections. \n\nWe kicked off with the Escargot and they were very buttery and garlic-y,  I would have like a pinch of salt and otherwise they were good spread on bread. French onion was nice. Friend had the beet salad and I thought it was very good.  The tuna tartare was also done well.\n\nMoving on to the entrees.\n\nSteak Frites was good but I agree they need to do better with the fries.  \nSkate special looked very nice with the haricot vert and mashed potatoes.\nBoulabaise I thought was a little to creamy.\n\nThey have great cocktails and the service was good.\n\nI have also been there for brunch and thoroughly enjoyed it.\n\nGood value but I think Petite Aubelle and Tartine edge it out as far as French bistros go.", "author": "ghost g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-05", "description": "Ill only come here if im feeling snobby. \n\nThe food is ok \nBut the atmosphere is uck \nWhat is happening to brooklyn!", "author": "Qatherine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "I've been back no less than 10 times for drinks, snacks and dinner so it's about time that I update my review!\n\nChez Moi is our favorite neighborhood joint. The drinks are delicious - my favorite is the Bisous and my husband loves the Sazarec. Oftentimes we will just come for drinks and fries\n\nBut don't 'miss dinner. All of the mussels are great though my favorite is the Thai.  Chez Moi's French Onion soup is consistently good as is the escargot \n\nFor entrees we particularly love the duck and the chicks", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "The place is nice. We've been greated by people knowing how to make you comfortable.\nOrdered french onion soupe and a hamburger. Both were good, even the meat was a bit cold (i asked for it to be cooked rare, but i'd have liked to get it hot as well).\nThen ordered a tarte tatin and profiteroles. The tarte tasted more than a \"chausson aux pommes\" with apple puree on a flaky paste. Was pretty good, but definitly not a tarte tatin. Profiteroles were good, but the chocolate was too cold and wasn't liquid anymore when it came too us. The hot chocolate must be served on the choux once the plate is in front of the customer, otherwise that's what happens, cold and \"hard\" chocolate. Thae taste was here anyway. The choux were good, as the vanilla ice cream.\n\nThe 2 people who served us were delighful.", "author": "Arnaud W."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}