{"aggregateRating": {"reviewCount": 350, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "I'm chiming with all of the positive Yelp reviews here because I'm always glad to have something nice to say.  \n\nThe food was tasty, the portions fair for the price, and the service was pitched just right -- not overly solicitous or obsequious and not phony.  Just friendly and well-informed. The whole atmosphere felt quite warm and relaxed, especially on a rainy Monday day.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "I probably had the best meal I've ever had here. I came here for a simple brunch with my SO on a Sunday. \n\nAt first I was kind of disappointed that there was no brioche on the menu and I may have mentioned that out loud, (I don't quite remember), but soon afterwards our waitress came up to us to suggest their brioche! Their almond brioche was off the menu and of course, we ordered it. We also got the Eggs Benedict and Croque Monsieur(?) which was essentially a grilled cheese, but is possibly the best grilled cheese we've ever had. \n\nEach order came with a side of potatoes and salad. Each were seasoned to perfection. Usually I am reluctant to finish any of the sides because they are either too bland or the potatoes are too starchy, but I felt like I couldn't get enough. The Eggs Benedict was also amazing and perfectly cooked and my SO enjoyed his dish as well. \n\nThe almond brioche we had was heavenly. It was so soft and the top was slightly crunchy which provided great texture. It came with whipped cream and a perfectly cut strawberry. Even those were perfect. \n\nThe main meal was so great that we even opted for dessert, which we usually do not do. We ordered the creme brûlée. Needless to say, it was very well done. The sugar was melted well and the cream was delicious. \n\nThe service was spot on as there wasn't too much attention, but we definitely did not feel ignored or unnoticed. The decor and music were also great. Furthermore, the prices for brunch are great! We will definitely be back for brunch, lunch, and dinner.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "New find that turned out to be a pleasant experience.  There was some waiting that did not seem to be necessary (our first drink took about 20 minutes to arrive); however, the rest of the experience was nice.  Our waitress was quite pleasant and helpful in making suggestions.  I loved my cocktail - Menage trois, cool and refreshing, not overly sweet.  The food was quite good - butternut squash soup was tasty and had just enough sweetness.  The grilled octopus was quite good - not chewy and great flavor. The steak was fine - we have had better but there wasn't really anything wrong with it.  One thing I would say - as much as I enjoy escargot, the one I had at Chez Moi wasn't all that great - a bit too chewy, a bit too greasy, and a bit too garlicy.  Overall, we definitely enjoyed our dinner and would recommend this restaurant to friends.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "I had brunch here last month and loved it!\n\nI went on a Sunday and the place wasn't packed which I was happy about. I started off with a glass of peach prosecco and had french toast with bacon. Everything was nice and light and the service was good.\n\nThe design/decor was simple/clean and the bathroom was very clean - I look out for this......\n\nI definitely plan to visit this place again.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Very cute intimate restaurant but not overly crowded.  Very good risotto, so please try and maybe it will convert you if you are not a risotto fan (as it did for me).  All fish dishes are good.  Very hot waitresses.  Very good music.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Have walked by this place many times, and for some reason couldn't pull the trigger. Last night it was cold so we didn't want too walk far so we finally decided to give it a go. Happy we did!\n\nStarted out with a perfectly prepared dirty martini and perhaps the best meat and cheese plate I have ever had...and I have had plenty. The mussels and natural chicken entrees were tremendous as was the chocolate mousse for desert.\n\nAll of this with a really cool interior and vibe, plus impeccable service. We are big fans and will be back!", "author": "Darolyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "To be honest, I haven't made it past the bar. I generally meet friends and co-workers here for a glass of their tasty rose (hey it's summer!). The bar tenders are super nice and pretty funny. It's definitely a good seat in the house.\n\nAs for the food, they have a good oyster happy hour (however I forget when that is - maybe 5-7pm?). The two I had were tasty. The mussels and frites - yum! They have a lot of varieties, so I'm sure you'll find one you like. I went with the garlic/white wine.\n\nOn a return visit I had another glass of Rose, but this time got their spinach risotto appetizer. It is delicious and can pretty much satisfy you as a meal (especially in this heat).\n\nDefinitely a local hang out for me.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Absolutely delicious !!!!! I've tried so many meals there and the specials and I'm never disappointed. I've been going there with my family since the beginning and it seems never enough. The food and the stuff is always Sooo on point....always naturally pleasant and wiling never fake... Can't wait to go there again just went there 2 days in a row. Love it!!", "author": "Jemma M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "This morning we had brunch with an out-of-town guest. She'd read about the tunnel underground and wanted to see it. I didn't expect the food to be so amazing! Everything was absolutely delicious. The warm scones beforehand were so good- one of us said, \"This might be the best scone I've ever had in my life.\" She also had the Basilic and gave us a sip- absolutely amazing!  The Eggs Benedict, Eggs Norwegian and Quiche Lorraine were all really, really tasty dishes....  and even though the secret bar behind the bookcase wasn't opening until after my guest's plane left, the General Manager agreed to gave us a short private tour!", "author": "Kerry B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "a cute french brunch spot in cobble hill. we had reservations at 11:30 but the place wasn't packed till 12:30.\n\nwe had generations portions of \n1. smoked salmon benedict with crisp potatoes, a light salad\n2. croque madame with gruyere, ham, on multigrain toast and an egg on top\n3. bloody mary (it was strong, and spicy! love)\n4. americano (double shot, their espresso wasn't too acidic. good!)\n5. side order of BACON. crisp, fat, and yum\n\ngreat attentive and friendly service\n\na promiscuous bathroom. you're essentially giving the soap a handjob to get any soap on your hands. conveniently shaped and points out like a penis. also boobs on the wall. yay!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Great for a group brunch. Creative touches on the classics. Everything tastes like they put a little extra care picking out their ingredients. Daintier portions that this fatty usually likes, but overall worth the (high but average for the area) prices.", "author": "Reena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "My favorite spot in Brooklyn heights. I like seating at the bar, very friendly bartenders.\nFavorite cocktail, the 'Chez Moi'. Favorite plates to share (or not :) : cheese plate and the pate. V\nVery cute place.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "What a great addition to the neighborhood.  Beautifully decorated, simple (and affordably priced) wine list and terrific french leaning cuisine.\n\nThe Mussels are one of the best that I have had in the city.  It's tough to find a place that actually makes mussels right but Chez Moi can pull it off.  I would recommend sharing the mussels as an entree and enjoying a few of the appetizers or soups between every two people.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-18", "description": "As far as French bistros go, this is not one of my favorites. I ordered the Chicken Chez Moi, which was drowning in a butter sauce. Too much for my liking. It came with fries that were pretty low grade - kind of flavorless, kind of scrawny, kind of homogeneous.\n\nThe food wasn't necessarily bad, it was just kind of mediocre. I would rather spend my $17 on an entree somewhere else.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "I first stumbled upon this place while wandering the area. It was a really welcoming experience. The bartender was really helpful and kind. I sat down on a Saturday afternoon for brunch, and decided on a bellini, a chicken patty, and a nice benedict with spinach. Everything was delicious and arrived quickly. The chicken patty was different, and not something I'm used to seeing on any menu. The bartender admitted that it was a new item, and for me it was one that should stick around.\n\nThe following week, I came back and the bartender remembered me. It was really nice to have a relaxing meal, and not feel rushed. I saw quite a few locals come in, and everyone had a nice rapport with the staff. I don't know how long this place has been around but it seems like they've been building great relationships with their patrons.\n\nI took a friend here for dinner, and had the seared duck breast. It was really tender, flavorful, and came with a delicious side salad. The potatoes gratin were a little bland, but otherwise it was a really great dish. \n\nThe profiteroles that followed for dessert were also delicious. The pastry was a little harder than I expected, but still, great dessert.\n\nChez Moi is a little off the beaten path, but I think it's worth making a stop for brunch or dinner.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "We like this place.  Of course, we always get the same thing (the avocado tuna tartare appetizer, the steak frites and a cocktail), but they do it well.  Nice bourbon list too.", "author": "Bernardo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "I had their mussels in garlic sauce and potato croquets !! Very good", "author": "Bella B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "I'm a sucker for small, cozy, romantic but yet not too overboard restaurants like this.\n\nMy boyfriend brought me here for an early birthday dinner and I really enjoyed it. The waitress was very friendly. I love how she gave us enough privacy and didn't come over every 5 minutes. I also like how they were considerate as to when to clear the table. They waited to make sure we were really done with our foods before coming over to remove it.\n\nNow for the food, I was really impress. My steak was made just right - medium rare and I loved the peppercorn sauce that accompanied it. My boyfriend had the seared duck breast and he said that it's the second best duck breast he's had. We both really liked the potato gratin and the cherry reduction sauce that came with the dish. It was superb and complimented the dish very well.\n\nOverall, my experience at Chez Moi will have me coming back again whenever I'm in the area.", "author": "Vivian Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-05", "description": "Went for brunch at 11:30 on a Saturday. Service was fairly good, drinks were quite delicious, food was great! Especially good bacon, and I quite enjoyed the quiche lorraine.\n\nHOWEVER. If you are not a parent, don't expect to find any kind of \"ambience\" here. I've heard of the Brooklyn Baby Boom, but never have I seen it so explicitly on display. My girlfriend and I were trapped in the corner SURROUNDED by children. I mean, seriously, this place felt like a daycare with booze and better food. There were at least 8-10 children at any given moment, ranging from infant to 4 or 5 years old, and there were another three kids with their parents waiting to be seated as we left. The ones who happened to be there were relatively well-behaved, except for the two next to me who kept dropping their crayons and tapping on my leg.\n\nFrom the reviews I read, dinner sounds like a much more pleasant - and even romantic - time to go. But for single and/or childless twenty-somethings, the brunch will just annoy the hell out of you (despite the great food!).", "author": "Graham J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "They have the incredible bar below called le boudoir. Great gay night first Sunday of the month. Pretty rare and fun venue in Brooklyn", "author": "fabienne g."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Chez Moi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "135 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UObIvpFYpJjYG8cTU_91gQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472278337"}