{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "Wiki Wiki is one of the OG DeKalb Market vendors. They started with poke and spam musubi, but have also branched out to ramen and bimbimbap. Personally, I think their poke is good but tends to be overdressed (ask them to go easy on the sauce!) The ramen is fair, but if you're looking for a great bowl, Menya Jiro is a few blocks away. The bimbimbap is good and tastes great, but it isn't classic picture perfect bimbimbap where each ingredient is cooked separately. Given the dearth of Korean food in the area,  I consider it a pretty decent substitute for K-town. \n\nStaff are good. Prices are fair considering how much food you get, but it's not a cheap lunch.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-26", "description": "So what's your opinion of Hawaiian food?  Well, I hope the first thing that comes out of your piehole does not start with the word \"poke\".  Poke has turned into this food fad in the past 5 years, rivaling cupcakes, froyo-on-tap, avocado toast and ice cream rolls.  The poke vendors can feed you lines like how it's a traditional Hawaiian food, but the oldschool poke is made with reef fish, sea salt, limu (the local seaweeds) and crushed candlenuts.  The modern poke as we know it...is invented in the 1970s by Hawaiian chefs like Sam Choi, using sushi-grade tuna caught far from the islands, with ingredients like sesame oil, shoyu and nori.  It's one of those \"fusion\" things that the largest ethnicity in Hawaii (the Japanese) contribute back into their local food narrative.  Note that poke served here is not the same poke as the ones back in Hawaii.  \n\nEveryday poke in Hawaii is not made at home as it is cheaper buying it from local supermarket like Foodland.  Their pokes are pre-marinated, previously frozen and cut small so the flavors penetrate.  Hit their poke counter, buy it by the pound ($12-15), ask for a bowl, 2 scoops on top of some rice ($6-7 for a large bowl).  In the touristy areas like Waikiki you get tourists who thinks it's beneath them to get supermarket poke, so they go into places where they get theirs made \"fresh\".  Because it's fresh, it doesn't have that depth of flavor and texture of the supermarket tub marinated stuff.  I don't order poke outside of Hawaii, simply because it just doesn't taste the same.  There is also the sneaking suspicion that the poke vendors themselves didn't as much as spent a few weeks in Honolulu researching the menu or getting local culture right - a bunch of Chinese vendors jumping on the culinary bandwagon.  Every Chinese-run poke joint in NYC want to pretend that they are straight-outta-Kalihi, but quick inspection will tell you that they are wannabes. \n\nThe very soul and essence of modern popular Hawaiian cuisine is not Poke - it is the plate lunch.  Plate lunch is the Hawaiian version of protein-and-two served to plantation workers back in the day with stuff like kalua pork, spam, fried chicken or fish, 2 scoops of rice and macaroni salad - and the macaroni salad is usually salty without much in terms of vegetables.  Why?  Ever paid $4 for a head of lettuce, or $3 for cabbage?  Produce are flown in from mainland, or grown in hot houses on the big island, and therefore expensive.  \n\nIs the food good at Wiki-Wiki?  Eh, let me put it this way...it's not as Hawaiian as you might think.  Wiki wiki is the Hawaiian for \"speedy\" - if you have been to Honolulu airport, the shuttle bus carrying passengers to the various terminals is called...the wiki wiki shuttle.  This restaurant isn't exactly a fast takeout, so the name chosen is already odd.  There is the question of all the missing hallmarks of Hawaiian plate lunch joints...where's the Loco Moco?  (Loco moco is a hamburger patty with rice covered with gravy, mac salad and an egg on top)  What about an attempt at Kuhuku Garlic Shrimp (arguably the most popular item on the north shore of Oahu)?  Long rice?  Saimin (a uniquely Hawaiian noodle soup that is not-quite ramen)?  Why are there cabbage on the tangy mac salad?  Eh, never mind.  Of course, authenticity doesn't guarantee success.   L\u0026L Barbecue (Honolulu's local chain) ran a few stores in NYC back in the early 2010s, and they got their asses handed to them.  Why?  they tried to serve up their low-rent plate lunches but without distinguishing marks versus fares offered at the local Chinese takeout joints.\n\nThe spicy pork plate lunch at Wiki Wiki isn't bad...per-se.  The plate lunch is served on a takeout bowl with rice underneath, your protein on the side and garnished with Mac and slaw, which is a nice touch.  The protein is well marinated and comes with little bits of caramelized garlic that gives off the right flavors.  It's good eats but don't mistake this for being \"Hawaiian\".  I understand that the Albee square food hall is an expensive place overrun with overcompensated Millenials who have a generally shallow understanding of foodways.  Given that, charging $15 for something that is typically $9 back in Hawaii...isn't ridiculous.  Just don't tell your friends that this is authentically Hawaiian...because it isn't.  That's not entirely a bad thing, but you are also missing out on a bunch of other good eats not offered here.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "This is my favorite poke place and my favorite food vendor in the Dekalb Market. I love it so much it makes it hard for me to try the other food vendors in the market because I'm always craving Wiki Wiki.\n\nThe tuna is always fresh, the flavors are well balanced. Just a perfect bowl of poke.", "author": "Martha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "While I know this is ostensibly a poke spot, I dare to be different (also I've been a little poke'd out lately):\n\nI rocked the grilled chicken plate. \n\nI find it slightly strange that grilled chicken comes in at $1 more than spicy pork or bulgogi bibimbap, but all I know is that it was delicious. Just a pretty simple plate of grilled chicken with seriously excellent flavor, mac salad, and slaw over rice (brown upon request). It's kind of like a Hawaiian garbage plate, for my Western New York brethren, but decently healthy overall and not disgusting in the least.*\n\nThey've also got poke, obviously, and ramen for those of you in need of some noods, but personally, I liked my plate so much that I'm not sure if I want to go with anything else just yet. \n\nEither way, an excellent choice in Dekalb Market Hall.\n______________\n\n*Hey. I love garbage plates, but they are definitely kind of disgusting.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-19", "description": "Recently had the new chicken ramen special it was not great at all. I went back to let them know I didn't like the food. I requested a refund or possibly something new. The manger was completely dismissive and not helpful to try to have the best costumer service practices.  It sad with the tone and attitude stance taken by the staff and I calmly explained my concerns.  \n\nUnfortunately,  I won't be coming back.", "author": "Tatiana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "The spicy pork is very good.  They seems to know how to cook rice the proper way. Highly recommend it.", "author": "Sung A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Conveniently located downtown Brooklyn, minutes away from Manhattan. Awesome service!!! Fast food in the truest sense. Great options, but not overwhelming. They take Apple Pay and they have speedy WiFi.", "author": "Brent L."}], "servesCuisine": "Hawaiian", "priceRange": null, "name": "Wiki Wiki", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/uCOYFUvt4uNMXis0Y1h-sA/ls.jpg", "@type": "Restaurant", "telephone": ""}