{"aggregateRating": {"reviewCount": 26, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "This place is awesome the workers are extremely respectful the food is cooked fresh right in front of you and there is a variety of food to choose from. I recommend this place to many people.", "author": "Hayes C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-15", "description": "Overpriced mediocre pizza; sometimes added \"tax\" on top and sometimes doesn't. Very stingy with the tissues will only give you one piece and keep all the tissues behind the counter. Avoid this place because it's not much better quality than the dollar pizza slices in the neighborhood.", "author": "Touhid C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "This review is for upstairs not the pizza downstairs. I ordered  ribs ,rice, corn the ribs have a good taste but looks like the took one rib and cut it in 3 very small  pieces.  The rice and corn there is have nothing to say but avoid it. $ 14.00 with a can soda. Horrible", "author": "Manuel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "This is going to be a very very short review. \n- decor is awful \n- pizzeria section isn't terrible. \n- hot food section is overpriced and very underwhelming in both taste and quality. \n- beef patty is $2.00. If you want a sprinkle of cheese on it, it's an additional $2.00. So for the price of another beef patty or an actual slice of pizza ($2.25), you can be the idiot and get cheese on your beef patty. \n- I should've dealt with the lunch line at Golden Krust", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "I've passed by Metro Star Cafe a numerous amount of times since I go to school and work around the neighborhood. One day, I had no clue about where to go for lunch so I decided to try out Metro Star Cafe.\n\nThe interior looks very old and run-down. There's an upstairs, main floor (entrance/pizzeria section) and bottom floor (not sure what they do). The hot foods didn't look very appealing to me so I decided to order lunch from the pizzeria section. \n\nI ordered the chicken roll for lunch which wasn't actually very tasty. Mediocre is the word that better describes it. There wasn't enough chicken and it seems there was more cheese than the chicken and half of my roll was slightly burnt.\n\nI don't think I would be returning here for food for a while since the quality of the restaurant and food didn't seem to impress me one bit.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Metro Star is a solid spot for an affordable, sit-down lunch in the area. Especially if you have a big group of people who all want different things; there is an enormous variety available, and it's all pretty decent. And they actually have a deceptively large amount of seating, with two levels in the back. \n\nIf you want pizza, the counter is right in front. There are pepperoni and sausage and chicken and all kinds of slices ready to go. Nothing is going to blow your mind, but it'll hit the spot.\n\nIf you want hot food, walk up the stairs in the back. They've got a nice buffet of a lot of Italian options, parms and pizzaiolos and marsalas and loins and such. There are sides like mashed potatoes and some veggies that don't look as green as I might like, but you can get a hearty plate of food for a decent price.\n\nIf you want a sandwich, they can make you one. It will be fresh-sliced and made to order, and the deli guys assemble it with surprising care. However, if all you want is a sandwich and you're not looking for a place to sit, I'd go somewhere else. \n\nThere are cheaper options nearby* that won't charge you an extra $.50 if you want your sandwich to go. Also, the sandwich counter is also the hot food counter and it moves pretty slow. You might end up waiting behind a woman who insists her tuna salad is made in front of her eyes, and then you'll miss a conference call and get fired and then you won't even be able to afford your next sandwich. \n\nYou should really have saved better.\n___________\n\n*Hero Shop, or Side Street Deli.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Best lasagna....and the pizza its delicious..... You will feel like like home. the people upstairs are so nice they try to please you in any way.", "author": "Norma B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "They always have a great selection of entrees.  My co-workers and I nicknamed this place \"the lasagna as big as your head place.\"  Cause it literally is.  Huge portions for a decent price.  Lower level is pizza and upper is where the good stuff is.  Average price for lunch is 11-15 bucks.  Good deal for good food", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "I was in the mood for pizza for lunch and decided to stop here.  The place was kind of dumpy and the pizza was meh.  When I asked for some grated cheese to put on my pizza, they told me that they didn't have any.  Now what kind of a pizza spot does not have grated cheese?  I don't think I can recommend this one.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-07", "description": "If I could give 0 stars I would.  My coworkers and I ordered 7 pies and paid approx $150 and they were terrible most of the pizza was not eaten because it was so bad.  There was almost no sauce on them and for the toppings they charge over $20 a pie there was hardly any pepperoni on the pizza and on the Hawaiian the pineapple was definitely canned and \n disgustingly dry.  I called to let the manager know and he offered me two free margherita pies for my dissatisfaction and I said ok.  When I ordered the pies a few days later he told me he's only giving me one pie and will charge for the second, completely going back on his word.  Bottom line, very expensive and poorly made pizza and stupidly bad customer service.", "author": "Tiffany Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "I went here for  breakfast the other morning and I was pleasantly surprised. I had an omelette and it was really good and was made really fast. Sometimes in the morning you want fast service and this place definitely met that expectations. While waiting I saw a few of the lunch items and they looked pretty good as well. I would definitely go back and try it for lunch.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-03", "description": "I ordered breakfast I place my order and the cook I assume didn't hear my order correctly so I proceed to get his attention and when I do he throws my bagel at his worker to put in the toaster and takes my bacon off my bagel and places it on the cutting board where they have just made numerous sandwiches. I was so upset, and when my bagel is done he takes the bacon and places it back on my bagel. I kindly ask him to put new bacon on my bagel and ask me \"Why?\" Like are you kidding me...this will prob be my last time coming here .", "author": "Beverly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "This is only for their pizza, but their veggie one is pretty damn good with lots of broccoli and spinach! The whole pie is pricey, though.", "author": "Juju J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Good pizza and very helpful people at the counter. The Sicilian is good and get it crispy. And a fountain coke as it tastes just right unlike most places where it is watery.", "author": "Yuvaraaj J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "From the outside, Metro Star Cafe looks like any other pizza shop. If you walk inside and go up to their second floor there is a diner complete with short order cooks that make your breakfast when you order it. For $6 I got 2 slices of french toast, 3 pieces of sausage, 2 eggs, a coffee and an orange juice. My bf ordered a different meal with bacon, toast, home fries, 2 eggs, coffee and orange juice for $4.50. Two complete hearty breakfasts for a little over $10! No frills, great breakfast deals and right by the subway - this place is great! I'm glad I decided to drop by and give this place a chance because I'll definitely be back.\n\nFYI: $10 minimum for credit cards and (random fact) this place is a cop hangout", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "I lived out of the Marriott for two weeks during a business trip last year. I must have bought breakfast at Metro Star Cafe half a dozen times - it's quick, tasty, and cheap. Eggs and toast were $3.25, only a buck or two more if I wanted spinach in my omelette, a bagel instead of toast, or some other upgrade.\n\nI'm writing this review now because I've been traveling a lot lately and I've realized most cities don't have a place like Metro Star. So if you're away from home and really just want a fast, hot breakfast -  this is your place.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "Good pizza in the front, and good hot food upstairs. Closest thing to Italian home cooking in this area. Shrimp parm hero is the bomb! Too bad they are not open at night", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "LOVEE THIS PLACE. I feel like im at home. Great cuetomer service. Love their beef pasty", "author": "Jani S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-03", "description": "Best breakfast in the area. Prices vary. Cashier is very nice.  You can watch your food being prepared. Nothing fancy. My only gripe is they charge extra for wheat toast and if your having the order to go. I think that being given the option of wheat bread vs white bread should be standard not .50 extra, or deciding to eat in or out is a personal preference. Not everyone has the time to sit and eat, maybe it's a grab and dash day. I shouldn't have to pay .50 extra to take my food with me. All in all breakfast is good cant speak for anything else.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-19", "description": "During my break from jury duty I headed over to Metro Star Cafe. Why? Because it was the closest place to grab lunch and I am lazy.\n\nThe two slices of pepperoni and sausage pizza were good...not great. They were both insanely greasy, but edible and cost $3 each. \n\nThere is plenty of seating, however you will more than likely wind up sharing a table with strangers if you go here weekdays between noon and 2pm. \n\nThis is an extremely busy part of downtown Brooklyn with the aforementioned courthouse and Long Island University nearby, it is one of the more popular places to grab a cheap lunch.", "author": "Andy K."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Metro Star Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "369 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/CvveR_PJ00_KeqfgR7u58Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188525894"}