{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "LEGIT. I really like this spot. Their empanadas are crispy and flaky and excellent I like the beef. Their tacos are FULLY LOADED and the most wonderful thing ever. I like their green hot sauce but everyone else seems to like the red. There's a line every time I go. It's cheap on the go grub. \n\nI really do feel for the other guy who reviewed after getting sick that sucks but I've been a couple times now and I've been fine after.", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "We picked up a cheese empanada while food hopping in Williamsburg. The empanada was flaky but had an oily taste to it. Not too much cheese filling too. Service was super quick and friendly.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "This is the same Cesar's Empanadas that is in front of Atlantic Terminal! \n\nTheir empanadas seriously gave me diarrhea for 2 days!!!! It smelled like their food... After not eating anything the whole day, I stopped by this food truck in order to get a quick empanada, which turned out to be A HUGE MISTAKE. IT'S FOOD TRUCK FOOD! FOOD THAT SITS IN THE TRUCK THAT STARTS TO DEVELOP BACTERIA. Their empanada was the only thing that I ate, and I developed stomach pains and ache, which also made me lose appetite for the 2 days! \n\nThe next morning, I was still feeling the effects of this Mexican food. The bowel movement and the vomiting. How could 1 empanadas do this to me? I don't understand. What was in their ingredients for it to cause food poisoning. Their ingredients must not be fresh. \n\nI love Mexican food. I eat Mexican food from a restaurant all the time. From now on I will avoid this food truck. They are nasty! I truly regret eating this food. My stomach is still recovering. Overall I have been drinking lots of water to recover and to stay hydrated from the excessive vomiting and diarrhea.\n\nI need to report this to the Department of Health!", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "I had the empanadas here and they were delicious. I'm not a fan of empanadas in general but these were good. They were lightly fried and the filling was tasty. I got the vegetarian empanadas, spinach and mushroom and liked them both. They have a lot of meat and vegetarian options.", "author": "Vicki G."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Cesar’s Empanadas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "", "postalCode": "11243", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9BtUlJs1Qe3NnlexPKRkkA/ls.jpg", "@type": "Restaurant", "telephone": ""}