{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Loveddd the food!.. excellent portions, delicious taste and friendly vendor!.. would definitely recommend to everyone", "author": "Fariyal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "Really good halal food, the meat was very tasty and overall better than average. There isn't that much rice which is just typical and the salad was nothing special.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "This is the best halal cart in the Downton Brooklyn / Brooklyn Heights area... trust me! The food is tasty and grilled up really quickly while you wait, and the staff is very pleasant.\n\nIf you're not familiar with halal carts in NYC, they are street carts serving meats cooked up made-to-order on a flat-top grill--usually served over rice w/ a variety of sauces. (I'm fairly sure it's a Muslim tradition.) Anyway, at this particular cart, my favorites include the chicken over rice platter and combo platter (lamb and chicken). I've also tried the hot dogs, which are yummy, too.\n\nThere is sometimes a line at this cart because there aren't too many food carts around the area, but it's worth the wait. So, if you're ever in the area and want a quick, delicious meal, check out Kazi! Nom nom nom!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Might be my favorite lamb over rice in all of NYC and I have tried at least 30 different carts. Better than Halal guys who have succumbed to the hype. Kazi's version is so flavorful and has a great blend of spices in it. So good!", "author": "Michael H."}], "servesCuisine": "Halal", "priceRange": null, "name": "Kazi Halal", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "47-65 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dK7cmnp-V19Sz8lYfZuwcw/ls.jpg", "@type": "Restaurant", "telephone": ""}