{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "You know how whenever you see videos (or animes) of Japanese girls dressed in Lolita outfits and they're eating these crazy cute (yeah, I called it cute. NO JUDGMENT.) and delicious looking crepes that , it makes you just want to eat one too?!\n\nWell, Eight turn crepes are the closest thing to that if you don't live in Japan. Not like I've had them in Japan, but you know, one can only dream that this is what it will taste like haha. \n\nI got the Azuki Berry: red bean, custard, green tea chocolate (I think, whatever it was I could have eaten it plain out of a jar), strawberries and green tea ice cream. Such Asian flavors, much good.\n\nThe only thing that set me back a bit with this crepe was the green tea ice cream :-(  it wasn't creamy or smooth when the girl squeezed it out of the bag it came out icy and hard and unlike ice cream, kind of like a Popsicle. \nBut I'll be sure to go back and order the same thing to see if the ice cream improved.", "author": "Marlecka M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "This place is going to be a must go point every time I go to NYC. I had to spend at least 10 minutes trying to decide what I want because they all looked so good!! (They have a fake food display at the window) I got the Harujuku cocktail with green tea ice cream although I thought the ice cream was too much, I assumed by the way they asked if I wanted green tea or vanilla, that it was included.  But it was actually extra so keep that in mind.  They did hand off my order to someone else so I ended up waiting longer (20 mins almost).  But it was DELICIOUS. Japanese style crepe has been checked off my foodie bucket list. I SHALL RETURN....Hopefully it'll still be there when I visit NYC again.", "author": "T U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "I like these Japanese crepes! It's like a desert pastry in a cone, except it's not a cone, it's a crepe. The place is very small, the service is very pleasant, and the crepes are delicious. The only suggestion I would make is that there should be more stuffing. The last one I bought had yogurt in it but it was so scarce that I barely noticed it and when I did, it was all on the bottom. I would've liked it even more if there was more yogurt that was evenly distributed throughout the crepe. Other then that, it's a delicious treat to have!", "author": "Sandy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Had a craving for crepes and yelped a few other spots, but none of them were gluten-free. Disappointed yet determined, we kept searching. Then we passed by Eight Turn Crêpe, saw the gluten-free sign and I was sold. I had the Harajuku Fruit Cocktail with a Caramel Latte, it was simply amazing. Definitely coming back to try the other flavors!\n\nI wish they would expand to CT. Crossing my fingers!", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "Who could give this place any fewer than 4 stars? This place is relatively new and the crepes, while unconventional, are absolutely delicious. They wrap it in such a way as it almost, JUST almost, make it completely mess-free. I applaud them for their efforts and I also very much applaud the way they tirelessly serve the customers who stroll in looking for a quick bite. In the 3-4 times I've been there, the servers are always beaming and look happy to be there...and that to me makes the food even more wonderful. \n\nThis new addition is a true delight, and I highlight recommend it to someone who wants to try crepes with a more Asian flair.", "author": "Henry Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Highly recommend the Harajuku crepe with the Macha Ice cream. Bomb.com", "author": "Mark L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "So, I had asked a friend if she could recommend some good places for me to eat around New York while I visited. Eight Turn Crepe was one of those places! Yes I know that she had given them 5 Stars. However I did want to give my own personal verdict:\n\nThe staff was super sweet, and patient with helping us decide what we wanted to eat, my boyfriend wanted something savory so I had then in turn decided to get something savory as well. He had gotten one of the special ones on the menu, and I had gotten the chicken teriyaki. I was unfortunately unhappy with the amount of meat the I had gotten in my crepe.\n\nWe had also ordered a desert crepe as well, and I was disappointed in the amount of fruit they had put into it. All I had was my crepe shell and the creme, I wish they had filled my crepes up more will either meat or fruit for my savory and dessert crepe. Maybe I'm just biased to my crepe joint here in Boston. But it's probably not a place I'd jump to go to when visiting again, I also wouldn't deny going if another pal wanted to take a spin at it.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "The lychee valentine crepe ($9) and matcha chocolate crepe ($7) were both rly good! The crepe itself is light and fluffy and rolled up so that It can be handheld. much different from the ones I've had in Houston where the crepes are generally served on plates and are thicker in consistency.", "author": "Mai N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "I always have the harajuku fruit cocktail. The fruit is always fresh and the custard is so good. Best crepes ever!", "author": "Yomaira C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Always come here for something savory but I've yet to try their sweet crepe. Their savory crepes are absolutely delicious. Fresh ingredients and smart design to hold the crepe. Great on the go snack. Best smoked salmon (eight turn lox) crepe I've tried. The Viva la crepe next door has nothing on them. The shrimp with avocado was well seasoned and grilled perfectly. My favorite one is the famous blt crepe so far. That thing will leave you craving for more. Store is really tiny and hardly any room to stand when it's packed. Staff are extremely nice and have amazing attitudes. Really easy to find place since it's right by the train station. Bit more pricey than other places but it's well worth it because you're paying for fresh and good quality ingredients. I've got a bunch of my friends hooked on this place. Eight turn never disappoints that's why I'm raving all about it.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Come back here every year because it is soooo worth the trip! This year we tried the mixed berries with granola...so delish....see you next year!", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "I am a crepe-lover who usually eats crepe with nutella, strawberry and banana. \nThis crepe was made with rice flour, and filled with homemade fillings like chocolate mousse, yoghurt with flavours, truffles etc. My friend bought a crepe inspired by green tea. It was a amazing and not too sweet. Great if you are sick of the traditional crepe experience and want something different which is a little bit \"healthier\".", "author": "Dina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Really interesting combinations of flavors for their menu! I got the Harajuku Cocktail which had a buncha berries and mango and banana. All of the crepes are large and for the price and flavors, definitely worth the money. I'll come back next time to try all the different flavors~", "author": "Pratishta Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "I never knew that crepes could get all crazy weird and tasty! I am kinda obsessed with trying to taste every single crepe on the menu! \n\nCustomer service is nice and you can watch them elegantly make your crepe in front of you. The place is kinda small with a bar seating at the window for 2 or 3. \n\nThey also have a really cool window display. Which you really don't see very often when it comes to the food industry.", "author": "Kimberly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "The crepes are delicious. They are cooked perfectly, and they are nice and crispy. We got two crepes, the savory and a sweet. BLT(delicious... the bacon bits are large crunchy bits) and the strawberry, banana with yogurt. \n\nBoth of these were a great meal / snack. I will definitely come back when I'm in the area to try out more of the different flavors.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "A few week ago I came here with my friend because she was craving crepes. When I think crepes I think of dessert but i was so wrong! This place also have very savory crepe choices. I got one of their savory salad crepes but I forget the name of it, I think it might be new or either one of there specials. But anyways, the crepe was very flavorful and it had tomatoes, avocado, basil leaves, spicy mayo sauce and pork. I think the pork might have been bacon but they didn't use a frying pan to make it crispy,  I think instead they just sauteed it and the pieces of pork were very fatty.\n\nI thought the prices were kinda high for what your getting because mine was a little over 10 dollars and it can't even compare to the size and the similar price of a burrito from Chipotle. \n\nNever the less it was a wonderful find and next time i'm going to try one of their sweet crepes :)", "author": "Shuwen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Intimate space, friendly staff, fresh ingredients, many options. I ordered the strawberry banana crepe with green team ice-cream on top. Yummy yummy! It is only $10. Compared with the crepe I had in midtown. The price is cheaper and the quality of food is the same. I recommend everyone to go. :) they have the options of sweet or savory. I would like to try the other options next time. I would definitely go again. :))))", "author": "Jessy Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "This isn't \"real\" crepe.. Highly Americanized version \nThe crepe is thick/soggy, they add yogurt and cream cheese in there which is pretty nasty... Atleast for my taste :/ never coming back", "author": "Ziqi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Beware, these crepes are really filling! My friend and I came here after dinner in a mood for a light dessert to finish our night. The exterior is just such an attractive view! A lot of the different crepes were put on display which makes it easy for customers to decide what they want. Mark, our server helped us decide which crepes to get. I chose the matcha stripe chocolate and my friend got the banana nut chocolate crepe. Instead of strawberries I asked to switch it with bananas which Mark gladly did. ( thank you mark!) both our crepes were delicious and extremely filling! The only complaint is the area itself is very small and can probably fit less than 10 customers.", "author": "Patty C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "As I was rushing to a subway entrance, I HAPPENED to look up and see this super warm and inviting crepe shop! It literally looked like someone took it out of Tokyo and plopped in into Nolita - and it tasted like it was straight out of Asia too :) Fresh ingredients, great service speed (for how crafty and loaded these delicious things are), and awesome staff. Space isn't huge, but the crepes are very well put together and easy to eat on the go. I'm going to try my best to restrain myself from making this a weekly treat, but that's going to be difficult, for SURE.", "author": "Sarah Y."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}