{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "ordered eight turn lox, about 11 bucks.\n\nsoft crepe,\ncreamy cheese blended very well with egg white,\nlight smoke salmon,\nfresh spinach, cherry tomato, shallot.\n\na balance light weight snack.\n\n**\ngluten free\n\n**\nwill retutn for the sweet", "author": "Grace N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "These are Japanese crepes. \n\nI wasn't sure what that meant, but evidently they use rice flour instead of wheat flour, which keeps that dastardly gluten away from those of us who view it as the downfall of modern society.\n\nPerhaps my palate isn't as sensitive as it could be, but I couldn't tell the difference between this and a wheat crepe. \n\nI ordered a ham and cheese special they had going on. The French name of this Japanese crepe made it sound exotic to my plebeian ears, but my dreams of a fancy feast were slightly dashed when I watched him pull out a squeeze bottle of French's dijon mustard (hence the French name?) as he made it.\n\nOverall, Eight Turn is solid though. The dude who took my order and made my crepe was nice enough, and my meal was fast, affordable, and solid. They even threw in some seaweed snacks as part of the lunch special. \n\nI'd do it again, although I'd spring for the famous BLT next time. It must be famous for a reason.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Excellent service! Very polite staff. \n\nI also liked seeing the open kitchen setup in the midst of the awesome food hall in which this restaurant is located.", "author": "Milo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "Looking for a yummy japanese style crepe dessert. Look no further Eight Turn Crepe is a small shop that has the yummiest crepes. Their crepes are packed with fresh fruit and homemade custards! We tried the sweet Matcha Stripe Chocolate - strawberries, chocolate sauce, matcha custard cream, crushed hazelnuts and we had added a scoop of Vanilla ice cream. These crepes are shaped into cones, so you can eat on the go without the need of spoons or forks! They do offer both sweet and savoury crepes. We highly recommend you visiting this shop!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Consistently delicious, consistently great service! This place is located in Dekalb food hall in the basement of City Point. I highly recommend trying the savory crepes, especially the BLT crepe. They also have a punch card for frequent customers. This is just a super solid place to get a snack or a light meal. And the workers are always so friendly!", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "Great crepes, worth the eight minute wait. If they offer a plate take it because they can get a little messy, but totally worth it.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "I liked the Crêpe I got there so much. They made it so fast, even though it was a lot of people waiting before us. It's amazing how 3 people can work in that little space. But, team work is obviously there. I got a banana- Nutella- almond crepe. If you are a matcha lover try the one has it. Never seen this option before.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Having eaten dinner at other stalls, my husband and I decided to hit up Eight Turn Crepe for a dessert crepe to finish off our evening on a high note. The bright stall featuring Japanese style crepes with both savory and sweet varieties called to us as we hunted for a dessert we could share. For $9 we got the Matcha Stripe Chocolate option which contained chocolate truffles, chocolate sauce, strawberries, whipped yogurt, Matcha custard cream and crushed hazelnuts. \n\nWe didn't have to wait long to put in our order and our warm crepe was given to us in a little bit less than 5 minutes by one of the friendly guys working there. The crepe was absolutely perfect. It was filled with all the delicious ingredients that perfectly complimented each other without being overly sweet. Next time I visit the market I definitely will be back to try another one!", "author": "Denay W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "I got the #2 on the savory crepes menu, which is egg white omelette with spinach, truffled mushroom, and cheddar cheese. $9 and with a student discount, $8.3-sh.\n\nBecause it was Saturday lunch time, the wait was about 10 mins. So by the time the crepe was given to my hand, it was already cooled off. The crepe was buttery and thicker than some other places. Only 3 or 4 mushroom slices and you really need to bite deeper to find them. But the truffle oil was very aromatic, adding extra flavor.\n\nIt was good, but not worth $9.", "author": "Jingqiao H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Absolutely loved their crepes! I prefer savory crepes over sweet crepes so I ordered the shrimp avocado and it was delicious. The ratio of spinach, avocado, and shrimp to crepe was also perfect. Prices are reasonable in comparison to the general prices at Dekalb Market Hall and very well worth it. Service was fast and presentation was good as well. It was also very comfortable to eat and not messy at all which is always a huge plus.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-26", "description": "A nice, refreshing twist on the concept of the crepe, 8 turn was good but unfortunately didn't wow me. Perhaps it was the pricing, but we are in BK in a fancy dining district, so that may have factored into the experience. I got the strawberry Nutella, which happens to be the most popular option. It is a good size to share, especially after finishing a big meal at one of the other food stalls. Overall, it was just ok. I did appreciate the friendliness of the employees", "author": "Tommy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "I love Nutella crapes. One of my favorite spots is eataly in Manhattan. This place reminded me a little of t-swirl crepe however the quality of ingredients here is much better. I ordered the almond banana Nutella crepe and it is definitely one of the top crepes I had. \n\nThe crepe itself is very very soft and moist which I love - just like a perfect French crepe. They give you an option of adding a scoop of ice cream or skipping which is also very cool.\n\nFor sure will be back. Open up more spots please!", "author": "Marta D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Great taste, great service. I come here nearly every week sometimes everyday. Highly recommend Matcha Crepe with cookie dough ice cream. 10 purchase = 1 free which is really good deal.", "author": "Jiayi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "The guy who took my order was so thoughtful  and meticulous about my order. I had the lychee crepe, asked for all lychee.. no raspberries.... it came with some edible flowers on top. You can also choose to have sauces to be drizzled on top. I had the caramel. Very good dessert! It was a bit soft though, so be careful when you eat it because it kept flopping to the side. Love the booth artwork. 10% off if you have student ID!", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Every day in the afternoon I have to eat something sweet . Thank God I found this Crêpe in my way and I have to say Mama Mia it was fucking good. Nice dough, ice cream and chocolate chocolate , the perfect combination. It s service as good as the crepe. \n@manudominguezm", "author": "Manuel Alejandro D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "When I think of crepes, I always think of sweet crepes and that just doesn't excite me, so when I began wandering the floor looking for a good snack option, I was surprised that I even looked at eight turn crepe, but enter.....the savory crepe. \n\nI ordered the shrimp avocado crepe. It was delicious. Takes a few minutes to prepare but well worth it. I loved it as soon as I took my first bite. My only disappointment was that there was significantly more sauce and less shrimps towards the bottom of the crepe, whereas the initial bites were a bit drier and compacted with shrimp. It was tasty nonetheless. \n\nThough I came in the evening, I thought it was really cool that if you order a savory crepe between 12 and 3, it comes with a free water.  Who doesn't love a good lunch special? \n\nI'll definitely check this spot out again when next in Albee Square/ dekalb mall/ citypoint- whatever it's called. (It'll always be Albee Square Mall to me:-)", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Excellent service! Very polite staff. \n\nI also liked seeing the open kitchen setup in the midst of the awesome food hall in which this restaurant is located. \n\nI ordered a Thai chicken crepe (mild spice) via AllSet in advance, but then things looked so great that I also ordered a Shrimp avocado crepe. If we'd had more time, there's no question we would have gotten a dessert crepe with Nutella. \n\nWe thoroughly enjoyed the two crepes that we had and will definitely be returning in the near future.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "With a variety of sweet and savory options, each created from eclectic mixes of fruits and flavors, Eight Turn Crepe remains one of my go-to's whenever I visit Citypoint. Here, you'll taste creative combos you'll hardly find in other crepe stores and experience the vibrancy of Dekalb Market Hall / Downtown Brooklyn. Bring a camera and friends. Top it off with a scoop of ice cream. Show your student ID to receive a 10% discount. Get 1 free crepe for 8 purchases (just have the cashier stamp it off on a card!); it's worth it each time.", "author": "Jennie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Delicious Japanese-style rice crepes made right in front of your eyes. Great service and plenty of savory \u0026 sweet options to choose from, whether you want a dessert or something more filling as a meal - the Eight Turn Lox is a crowd fav. The savory crepe I got (eight turn famous BLT with shrimp) could've come with more filling. Will come back to try the sweet crepes. Also, flash your student ID for 10% off!", "author": "Yang Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "This place is pretty good if you're looking for breakfast or lunch, but I can't imagine it being enough food for dinner. It's been very delicious every time I've gone, my one complaint is that there hasn't been more of it. Crepes by nature are pretty light and I got mine filled with eggs, avocado, goat cheese and sriracha, so it wasn't too filling. My other complaint (so I guess I have two) is that it's slightly expensive, but most things in Dekalb Market are, it's just a bummer to pay $11 for lunch and still be hungry afterwards. \nThey have a punch card which is nice, but you have to buy ten crepes to get one free, which means spending over $100 there to get one free item. Meh.", "author": "Liz F."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}