{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "They consider their crepe presentation as an art! Very cute asian style crepe located near little Italy and Chinatown. Green tea ice cream with sweet red bean is a must!!", "author": "Ja C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "Ah, Eight Turn Crepe aka Right Said Crepe\n\nDouble ah, 8TC, yeah you know me.\n\nBeat the PayPal rep here to redeem their $18 offer*, so the unflaggingly friendly and unnecessarily, repeatedly apologetic woman working confirmed it was OK with the manager before whipping up my order and ringing it up herself. This - one person running the show almost flawlessly (she had to toss the first crepe and redo it) - was just the start of 8TC putting VLC 2 doors down to shame. The tofu edameme salad crepe and lychee valentine dessert crepe were both phenomenally light on the crepe (thanks to rice flour) and generous with the fillings. This is, even more importantly, in stark contrast to the similarly priced, far less inventive creperie 'next door'. That said, it's a small storefront with barely enough space to enjoy your purchase(s) on the stools near the window (lot of different displays too), so just ate a few yards away Petrosino Square amid Christmas trees on an unseasonably warm day**. They one-up Vive La Crepe!*** here too by providing a perforated crepe-serving vessel AND a tearable plastic carrying bag. I'm almost tempted to retroactively dock VLC after seeing what crepes can be, but that ain't right (especially since PayPal's fascination with crepes means I've spent almost nothing there for quite a few crepes and loyalty points).\n\n*Oddly not their normal $20 - but the 8 is a clever touch.\n**Must be what the holidays feel like in regions without seasons.\n***Obnoxious punctuation theirs.\n\nPayPal transaction:\n12/3/2013  Tofu Edamame  1 $8.75 $8.75\n12/3/2013  Lychee Valentine  1 $9.00 $9.00\nTotal $19.33 USD\n\nPayPal in the house this time for my second $18 redemption:\n12/13/2013  Seaweed Sesame (perfectly balanced) 1 $8.00 $8.00\n12/13/2013  Azuki Berries (a sublime indulgence with the ice cream hitting the spot even on a sub-freezing day) 1 $9.50 $9.50\nTotal $19.05 USD\n\n12/18/2013  Truffled Eggwhite Omelet  (They triple-bagged this bad boy, clearly keen on the fact that it's a messy and still delicious creation - I'd dare to say thrice as messy as my previous purchases. Ate there on the hard red stool next to the counter, which has no space to actually place anything down.) 1 $8.50 $8.50\nTotal $9.25 USD\n\nPS mad props for 14 Useful votes on a truly insubstantial review http://www.yelp.com/biz/eight-turn-cr%C3%AApe-new-york#hrid:rttWzmtPWsmXwnJO0g9RCg\n\nV-day and only one couple, c'mon now\nPrince's Crepe (briny and wonderful) - Item #INV2-M52V-TT4T-EJYU-HE67\n$9.00\nFuji Apple Pie (magnificently indulgent yet virtuous) - Item #INV2-J7DZ-B23A-NZV4-J33Y\n$7.50\n-$17.97\n\nMixed Berry Parfait (tasty as always, but Perka app down) - Item #INV2-L3YC-YXTQ-HYQN-P8YA\n$0.17 total after PayPal $8\n\nThere has been a misstep: on one visit, the cold-style crepe was served in a new vessel that meant paper cuts to the lips and a longer eating experience. BTW impressed that the URL has the crepe indicator\nThere's also an eery overlap between PayPal businesses, as their paper receipt mentions crepe diem, a la but also a la Carpe Donut.\n\nTuna Nicoise (nice and briny, one of their more substantial offerings) - Item #INV2-CSCB-QHKV-D88M-D96B\nSpecial Offer\n-$8.00\n$1.53\n\nDbl the Eggs Dbl the Fun - their cheapest item and just as filling and flavorful\n$6.00\n-$5.00\nTotal\n$1.53\n\nRedeemed 100 Perka Points for a very tasty Chocolate Nut Party (TWSS)\n\nThey also offer a Birthday crepe, as well as time-sensitive specials like $2 miso soup and free coffee during certain windows.\n\nBlack Sesame Shake\n-$5.00\nTotal\n$1.53", "author": "George C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Pretty good crepes! The pieces of art were delious treats and  would recomend the sweet banana strawberry one.", "author": "Theresa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "I'm a big fan of crepe and this place is perfect for me. Wish I'm living in the neighbor so that I can eat everyday. I had the truffle egg white savory crepe and I love it. Full of healthy energy and flavors. They made the egg white and sautéed mushroom from raw right in front of you, no hidden ingredients. Even though I waited for about 7-10 minutes, but it's totally worth it because I enjoyed watching them making my crepe. I have decided on my next try, mocha chocolate crepe!", "author": "Melodylu H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-08", "description": "I've always been a huge fan of crepes and was pretty excited to stumble upon this place. The place is cute, though seating is sparse (a bench and two or three seats). There was a large variety of options, ranging from sweet to savory. While I had a tough time deciding, I ultimately settled for the Eight Turn Lox: a savory crepe with lox, cream cheese, capers, onions, and spinach. To top it off, I ordered the yuzu soda.\n\nThe crepe as a whole was not terrible but I was definitely expecting more crunch and a bit more ingredients in the crepe. I do understand that lox is a more pricey ingredient but the amount I got for something that's priced at $9.50 was just an utter disappointment.", "author": "Judy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "First time here today, I had the lychee valentine, and it didn't come with rose petals; yes I was looking forward to trying edible rose petals. The crepe overall wasn't bad, but wasn't good either. It was small compared to other crepe I've had, and it felt overpriced.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Awesome!! I come here every time I'm in the city. Super original and extremely tasty!", "author": "Lindsey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Amazing crepes. Both salty and sweet. Try everything! My favorite is 18 harajuku fruit cocktail with bunch of berries, banana and mango!", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Eight Turn Crepe has the best Japanese style crepes!  The Harajuku fruit cocktail is to die for! It includes delicious fruits such as strawberries, blueberries, raspberries, mangos, bananas, with yogurt. AMAZING!! Definitely a must-try if you like crepes and sweets! They're open till 10:30pm so come here for dessert after dinner like I did!", "author": "Jhomalys M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "The crepes are very tasty and tasty. The menu is very diverse. \nThe prices aren't very cheap though.", "author": "Max J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "I tried the Matcha Stripe Choclate crepe and it was simply delicious! The quantity was enormous. Loved it! I also have tried the Vive La Crepe once which is adjacent to it.. And it was bland and didn't fill my tummy at all. Eight turn crepe is far better choice than Vive La Crepe!", "author": "Monica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "Came here to redeem $18 worth of crepe courtesy of paypal (mobile check-in app). Happy to discover their crepes are gluten-free and made with rice flour.  The server was very attentive. Not much room or seating. I got the 'double the eggs, double the fun' crepe. It wasn't a problem (or an extra cost) to switch the chedder cheese to avocado. Great taste - maybe a little too sweet. I also got the 'eight turn lox'. That was good too. \n\nMore than once I had turned up because they looked open or were supposed to be open, only to be told they were still closed and would open at 11am. This inconsistency is annoying and is at odds with some online sources. Plus why not open earlier, crepes make a good breakfast.", "author": "Jill B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "I have fond memories of the savory Chicken Teriyaki crepe with avocado.  It didn't really taste like typical chicken teriyaki but it satisfied my hunger.  The avocado was a nice touch, however it cost extra making the meal less than economical.  The next time I tried the sweet Harajuku Fruit Cocktail and I found it to be a lackluster experience, skimpy and borderline bland. Perhaps I was hungry the first time or maybe their savory crepes are just better than their sweet ones.", "author": "Chrystina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Mmmm.. dare I say I might have enjoyed this Japanese crepe in NYC more than the Japanese crepes I had in Japan?  So delicious!  And gluten-free to boot.  I only had a chance to try the Azuki Berries crepe, but it satisfied my craving x100.  Strawberries, azuki (aka red) beans, whipped yogurt, green tea matcha custard, almonds, pocky sticks, and Il Laboratoria del Gelato matcha green tea gelato--layered together inside a delicious crepe!  At first, looked like it would be hard to eat, but the paper cone it comes in makes it easy (it's perforated so it rips easily).  Service comes with a smile.  The place is very small though--can probably only seat 5 or so people inside.", "author": "Mandy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "How much more stretch can my skimpy black dresses endure! After an arduous Sunday work day, did I make my dinner a protein building, vitamin filled, super energizing meal?After a promise to detox from a Labor Day weekend spent eating fried foods and ice cream by Chesapeake Bay did I stick to my goals? Well...err...all good intentions were busted when I read Max S.'s review of the day for Eight Turn Crepe. Then visions of conical crepes danced in my head. So much for brain food. This was tummy love food all the way.\n\nEight Turn Crepe is a tiny eatery with two small tables and about 5 guys squeezed behind the counter...with one taking orders, and 3-4 all making those conical culinary delights. One guy was spreading the crepe batter with the zen beauty of a Tibetan monk tending to his sand painting. My matcha crepe chef was swirling spirals and custard and fruit and chocolate and nuts with the artistry of a true pastry chef in the making. I disagree with Yelper Taylor about the poor service. The gentlemen I spoke to were very  friendly, especially the one closest to the counter. Poor fellow, I think I made him nervous snapping their photos and he did make some holey crepes, which went promptly into the dumpster. You mean they don't have a Sumo in the back eating the irregulars? But if these guys are indeed a little less zealous, remember how little space they have to maneuver. You might be put off too with your elbows knocking those of your neighbor chef. These superheroes of the creperie work in tight spaces and one guy, an Asian fellow, kept doing his zen thing with the batter, despite all the distractions. Mr. Friendly, the guy closest to the counter, even said goodbye and said he hoped I'd be back. You betcha, with my crepe gobbling friends and family, for sure.\n\nThe Japanese have a knack for improving on inventions. They were clever enough to put this giant crepe, stuffing and all, into a paper cone that you can peel as you eat away. Sweet crepes are $6.50 to $9.50 with $1 for additions, and savories $6 to $9.50. Then there are salad crepes...hmmmm...they all sound good...brings to mind moo shu pancakes Japanese style. Well, I debated between Max's S's Chocolate Nut Party and Matcha and the latter won this round. I chomped and chomped on my Matcha Stripe Chocolate crepe which had ripe strawberries, chocolate sauce, homemade truffles, whipped yogurt, matcha custard, crushed pistachios. Dinner? Protein...err...voila Crepe!  Ah, life is indeed good.\n\nOn little thing..I have to agree with Agustin K. I would have preferred my crepe warmer, but maybe it doesn't roll well when it does.I would have detracted 1/2 a star but hey, let's not split hairs. Let's enjoy 8 Turn Crepes instead.", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Oh. My. God. The crepes here are to die for!! It was definitely worth the wait.  I came here around 7pm and the line was out the door! I guess to be fair the place this kind of small so there isn't a lot of standing room. Anyways,  they have both savory and sweet crepes. Most of them range from 8 to 10 dollars.  I opted for the sweet crepes because they sound pretty appetizing.  I ended up picking the lychee valentine crepe.  It has lychee (obviously),  raspberries,  whipped cream,  flower petals and almonds on top and I also chose to have matcha green tea included. I have to say that the green tea ice cream was delicious!! One of the best I've tasted actually.  The crepe itself was not soggy and has a good texture to it,  they definitely know what they're doing with that batter formula! It definitely got me full after I was finished,  so I got what I paid for. I highly recommend this place if you're in for a sweet treat!! I will definitely come back and try their savory crepes one day! Oh and and they have a loyalty card too so don't forget to snatch one from them and rack up your crepes!", "author": "Fiona D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "There is a nice selection the types of crepes, savory or sweet. I feel like the crepes were alittle pricey for its size.\nI disliked how its a pretty small place so i had to stand outside to eat. When I was eating I swore I got like 10 billion stares.\nI had no clue what to get, so I got the basic strawberry and banana with the green tea ice cream. Honestly if it wasnt because of the ice cream I don't think it would have tasted that good. I felt like some of the banana tasted werid?\nMy friend got the azuki berries, I thought that tasted pretty good but thats probably why its more pricey.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "After dinner, we walked around Soho and decided to yelp a dessert spot. We decided to come to Eight Turn Crepe. Omg what a find, a hidden gem. This place is great. I decided to go for the NY blueberry cheesecake crepe. It was so delicious. A nice scoop of ice cream plus fresh blueberries all around, custard cream and whip cream. Utterly delicious. They also have savory crepes. It was delish so I am definitely trying a savory crepe next time I stop by. The spot is a lil small but they do have seating. The staff was friendly and I loved the decor. If your in Soho and have a sweet tooth, go to Eight Turn Crepe!!!!", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Great food for breakfast or lunch even dessert. Big portion not like place next door reasonable priced for crepes. I would highly recommend this place.", "author": "Sani A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Excellent quality! I ordered a lychee valentine and it was really delicious and good looking! We also ordered crepes from the shop next door and this is easily 10x better.", "author": "Junzhe G."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}