{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Eight turn crepe has really unique crepes to choose from (you'll be satisfied whether you're having a sweet tooth or craving something flavorful). The crepe itself is really good and has won the four stars it deserves. I got the teriyaki chicken and I thought it was good (I do wish that the chicken itself was more flavorful but the whole thing still came together well). They are very generous with their ingredients and the presentation is very nice. I recommend checking this place out!!", "author": "Hannah I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "The first time I came here, I was super excited to try it because everyone had posted about it on Instagram and it looked amazing! I came here with my friends and it was such a small space, there wasn't a place for us to sit, which was fine. I got a matcha stripe, because sweet crepes are my favorite. It tasted so good, I told myself I would come back to try the savory flavor. \n\nSo I did. I came back during my regents week and I was in a dilemma. What should I choose? Salmon or shrimp? Despite the reviews on the eight turn lox, it wasn't that good to me. It was chewy and super salty. That lost a star. I should've went for another sweet flavor.", "author": "Andrey T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "both chicken terriyaki and azuki berries were tasty.\nthe matcha gelato had a very rich taste, delicious.\nAn incident happed which made me feel reluctant to go back. One client dropped something from his crepe on the floor, one staff picked it up and he only cleaned his hand with a paper towel. Shouldn't he at least wash his hand?\nother than this, I think it is a little pricy.", "author": "Ziqiu Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "This place prides itself as Japanese crepes, which makes me wonder how it differs from American crepes so I decided to give it a try.\nI had just come from vive la crepe close by and wanted some sweet crepes.  \n\nThe prices were about the same so we decided to go.\n\nMaybe not the best idea ever because the crepes weren't really up to par to vive la crepe.  We ordered the blueberry cheesecake and the green tea with strawberry.  It looked so wonderful not only because of the pretty crepes in the window but also it had a nice dollop of Ice cream in the middle.  \n\nBut the ice cream was probably the best part.  The crepe was too doughy and eggy.  I prefer thin crepes, not soggy ones, which is what happened after the fruit and things soaked in.  Also, the paper cone... Hm, I think I prefer the cardboard one from vive la crepe next door.\n\nAnyway- they have a pretty unique menu- with seaweed and teriyaki chicken crepes.  Haven't tried it but I probably won't be back if the crepes as as eggy and thick as they are.\n\nThe store itself is also pretty small good for four people and maybe two outside.  It's a cute place with a unique idea but I don't think I would come here unless vive la crepe was closed.", "author": "Janice F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Love the crepes here! Only store in New York! Very small location with limited seating bench and a bench outside. I had the strawberry/banana crepe and the green tea crepe. Amazing!", "author": "Candy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Eight turn crepe provides a good selection of savoury and sweet crepe. With the stuffing it actually not expensive for a crepe since it can definitely fill you up. We ordered the lychee Valentine with green tea ice cream and azuki berries. The lychee valentine looks very pretty with rose petals and the slight citrusy lychee balance out the sweetness of the cream and ice cream and make this a very refreshing dessert. The azuki berries crepe is nice and sweet but I found it a little on the heavy side. Will definitely come back!", "author": "Christine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Delicious, simply just delicious!\nWe got Matcha stripe, it wasn't too sweet or heavy, big enough portion for two", "author": "May L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "I was brought in by the PayPal offer and have now been back 3 times! These crepes are DELICIOUS. My favorite is the crepe dog, which is \"japanese style\" with grilled hot dog pieces, corn, daikon, and yummy japanese mayo and tonkatsu sauce. The crepes are rolled up like big cones (instead of being laid flat). I've also had the shrimp and avocado salad crepe, which I didn't think was nearly as good as the crepe dog. I know it was a salad crepe, but for some reason it didn't occur to me that it would be served COLD!\n\nHubby also tried one of their smoothies, which he was a big fan of. They're very friendly and professional. It's a small space with only a small bench and a few stools at the counter - better for a quick bite or to-go.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "I walked all the way from Brooklyn Bridge after a very tiring day involving lots of walking and I wasn't disappointed. The store is extremely small, almost cramped of more than three people get inside. I'd suggest just order your stuff and get the hell out. \n\nThey have several crepes to choose from. The service can take a while (like 5-10 minutes) but its worth the wait. I tasted two different savory crepes and didn't get any sweet crepes as I'm watching my weight. I'd suggest get the sweet crepes.", "author": "Venkata M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "The crepes here remind me of when the first iPhone was unveiled. It was the perfect case of form combined with function. Simple, amazing and unlike anything we've seen before.\nEight Turn Crepe takes that formula, plus a DJ, some promoters, a really good sound system, and throws a party in your mouth.  \n\nThe form is quite simple. It's a cone, which is kind of perfect for New York. It's convenient, understanding the on-the-go lifestyle, and quite frankly, as far as a fork and knife go in consuming my dessert - ain't nobody got time for that.  The cone comes in a wrapper that you unwrap diagonally as you make your way down the crepe goodness. I'm proud to say I didn't get an ounce of it on my clothes. \n\nAs far as the party in my mouth, my crepe was literally a party - the Chocolate Nut Party \n- 4 types of nuts (almonds, hazelnuts, walnuts, and pistachios)\n- 3 chocolate elements (chocolate sauce, chocolate custard cream, chocolate Pocky Sticks)\nAdd some vanilla ice cream, homemade whipped yogurt (amazing), and wrap it in a gluten-free rice flour crepe, and drop the beat. \"Oh snap, is that Tiesto spinning in my mouth?\" you ask. Why, yes. Yes, it is.\n\nThat was just one of the 10 sweet crepes on the menu. I intend to try the other 9 that have fruit, yogurt, cheesecake, matcha, and other great combinations. \n\nNeed to wash that party down with something? You will be pleased to know that La Colombe, one of the top roasters in the world, is used to brew the coffee and espresso drinks. \n\nNeed something sweet in a cup? Try one of the shakes. I had a sip of the Matcha Shake. Green Tea + Ice Cream shake = refreshing, unexpected, revolutionary. \n\nSweet tooth satisfied? or in the mood for something on the entree? These guys have a savory category on their menu that includes eggs (not your diner eggs, Flo - truffled egg white omelet), lox, and turkey. \n\nTheir salad crepes highlight the Japanese origins of this crepe-in-a-cone business, with an ever-so-slight French accent - Tofu Edamame, Seaweed Sesame, Tuna Nicoise and others will act as a perfect on-the-go lunch.  Add some truffled shrooms to that crepe for a greater French accent, or other additions that will satisfy that hunger of yours. \n\nThis place is going to revolutionize the way you see, eat, and walk with crepes. Ever walk with a crepe? Didn't think so. \n\nPrep your guest list and get your permits straight because there is about to be a party in your mouth.", "author": "Max S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Great treat for summer or if your on the go. They make the crepes right in front of you! There might be a bit of a wait for the crepes to be done tho. There isn't much space inside the store so when it's busy it gets a bit hectic. But besides that everything is great", "author": "Angela J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Really good. Better than the crepes I've had near the house that gives a whole lot less than Eight Turn Crepe. I got the popular Matcha Strip Chocolate crepe. Should've gotten it with ice cream... And didn't realize it until afterwards. Get it with ice cream!! It's better that way. \n\nThis place is SMALL. Hole in the wall small. But so good. They have displays in the front of the crepes but not labeled. *fail* anyway, you can just see the menu from the outside if it's too crowded inside. Because it's so small, you can see the three/four people making the crepes. \n\nTaste. It was delicious but I kinda of devoured the whole thing and wasn't paying too much attention to the taste. It may be a little on the bland side in terms of the crepe dough itself and the custard. But there's a lot of things going on. You have chocolates and strawberries with chocolate drizzle. \n\nI like the way it is packaged. It's like a paper ice cream cone. So you pull the crepe up and eat then peel the paper so you don't have to keep pulling your crepe upwards.\n\nAnyway, i would come back if I'm in the area. :)", "author": "Elaine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "Love this place!!!! The variety they have in crepes is amazing and every single one of them had my mouth watering. I had the chicken thai and it was huge and delicious. Perfectly seasoned and a great blend of flavors. I can't wait to go by and try some of the other options which my friends also enjoyed. So glad this place opened up in the states!", "author": "Erum R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "Keep hearing about this place so decided to check it out and see what it is all about. This place is perfectly located, right next to the 6 train on spring street. Can drop by for a snack while shopping in soho (at least that's what I did). We ordered the Crepe dog (hotdog, cheese, ketchup, savory selection) it was ok. Not as good as I expect it to be. And was quite small. They all look delicious though. But maybe cus I came from an asian background I've had better ones back in Taiwan and Japan so when I compare it, it was only ok. But not bad for nyc crepe standard. Give it a shot. Service and atmosphere is great. Don't really have seatings inside", "author": "Shijia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "This place was amazing. Stopped here with my girlfriend and had our minds collectively blown  by the crepes. \n\nGo here if you love your mouth.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "First thing first: Crepe should be eaten on a plate. It's so much easier that way. I mean this is all trendy and what not, but there is a level of frustration that one must tackle while eating crepe from a cone.\n\nSecond: I think it's a bit overpriced, and a bit dry; It lacked 'yumminess'. I have had crepes in many places, and this was my least favorite.", "author": "Rezaul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "i cant breathe. \nthis place is too good for its existence.\n\nomg. \n\nthe egg white savory and harajuku fruit -- what an amazing sweet and savory combo!!! \n\ngluten free as well? heck yes.\n\neveryone- come", "author": "Ami P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "Had the mixed berries parfait $7.50 plus one scoop of green tea ice cream $2. \nIt's on the pricier side but I did enjoy my crepe. I have a sweet tooth so I thought the savory options were quite odd.\n \nBerries were pretty fresh but there weren't a lot of them. The ice cream was really good, unlike the green tea icecream from Haagen Daz, it wasn't overly sweet and had that bitter matcha taste to it.\n\nPlace is kinda tiny, but it's whatever since you could eat it on your way shopping in soho :)", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Amazinggggggg. I had the mixed berries parfait and !! The crepe itself was really yummy, and layered with cream and crunchy oats, and then loaded with all sorts of berries. Fave crepe place.", "author": "R L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "The nice looking crepes on the window attracted us to go in for a try. Ordered the Azuki Berries but substituted the almonds for crushed pistachios. \n\nIf you're ordering your crepe to go, they have these cute crepe bags to hold them! The crepe tasted like pancake, was kinda soggy but that can be dealt with. Overall it was pretty good. The Azuki beans kinda tasted like red beans? \n\nWould come back to try the Savory Crepes.", "author": "Cin D."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}