{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "I speak for sweet crepes!\n\nFor beginner, start with Strawberry Banana! If you like it, next time you can try Match Stripe Chocolate (My absolute favorite) or Azuki Berries! Honestly, they are all very good. Ingredients are mixed and matched very well. \n\nEight Turns crepes are different from American style crepes. The wrap is very thick and more eggy. Toppings are skillfully layered into wrap. A crepe is very filling! Don't take it lightly as small dessert or something you eat before dinner. It's a meal of its own!", "author": "Annie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "\"Lychee Valentine\" must have been the most romantic crepe I've ever tasted. With edible rose petals and rose custard cream, it could easily be a Valentine's Day snack destination.\n\nThe bacon in the \"Eight Turn Crepe\" was likewise memorable; not your typical bacon. \n\nThough the crepes did not look as plentiful as the pictures show, with ingredients spilling out, service was pleasant and smiles were abundant. Only wish the place was bigger so I could always depend on sitting and enthusiastically devouring my crepe then and there.", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "I've tried several crepes from Eight Turn and I can't help but always choose this place when I'm craving a crepe (despite it being 1/2 mile farther than the closest crepe place to my apartment).\n\nI prefer the sweet crepes over the savory, but have had them both. My first was the BLT crepe - it was a little difficult to eat with the cherry tomatoes and the bacon was a little stretchy, but overall the taste was spot on. I probably wouldn't order this one again, but it was still delicious.\n\nMy latest (and favorite!) is the Harajuku Fruit Cocktail. It's a good blend of tropical fruit, yogurt and almonds. It is so delicious and I always crave this crepe after eating a spicy meal! I've also had a bite of the Berry Parfait and it's very similar to the Harajuku, but has a nice crunch of granola.\n\nThe only downside to this place is that there is very minimal seating and it's small. Overall, very delicious. Don't miss out on trying these crepes!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Cute lovely Japanese crepe place on Sprint Street! Definitely try \"Lychee Valentine\" which is made of lychee, cranberries, cream, almond chips and rose petals. Very girlish and cute dessert but not too sweet. The cream is very fresh and light, it reminds me of the cream that Lady M is using for its famous mille crepe. \n\nI would like to try savory crepes next time, the lox crepe looks very appealing.", "author": "Ariel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "Amazing crepes with a ton of flavor and all the ingredients are put together fresh, on the spot. Everything goes together perfect with no overpowering flavors. My favorite is the Chicken Teriyaki crepe.\n\nTry to save some room for the banana nut chocolate crepe, which comes with fresh truffles. So good.\n\nThis place is a must go when in SoHo.", "author": "Dmitriy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-28", "description": "Best crepes in this city!\nI had the Lychee valentine which was so decadent and delicious. I was drooling the whole time.\n\nThis is a very unique place and not many stores serve japanese style crepes so it might come as a weird factor to some people. \n\nMy love for this place is magnified because I love Asian style food and tropical choices, such as lychee or macha and seaweed.", "author": "Lizzi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "I love Japanese crepes and I knew I had to try it when I was in New York. I got a matcha red bean crepe and my boyfriend had the chicken teriyaki crepe. I enjoyed mine more because I find savory crepes kind of weird...Anyway, they were both AMAZING! The crepe itself was very thin and soft, and we were given lots of fillings. If you're a fan of crepes, you should definitely give this place a try!", "author": "Emi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "This place is tiny, and can only seat 4 people inside, FYI!\n\nI really liked their crepes, though!  They were unique and tasty.  I had the matcha stripe chocolate which had some chocolate, strawberries, matcha etc in it.  I also had the turkey delight which sounds boring, but the sesame dressing and tofu sauce really made it taste even better!  Lastly, the egg (added mushrooms) crepe was tasty as well!\n\nReally friendly workers here, we chatted with them for a good while.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "i ordered the strawberry banana crepe with chocolate syrup. the crumbled pistachios tasted and felt odd against the sweet, soft texture of the rest of the crepe. and the crepe itself as a whole mostly just tasted like the chocolate syrup. i thought that this place would be comparable to mojilla fresh in flushing, queens, but it fell flat for me. it was beautifully made, and the staff were so friendly and kind, but the experience was lackluster.\n\nhowever, my friend got the BLT crepe and it was THE BOMB DOT COM. the sweet crepes were disappointing, but i'll definitely visit again to try some of the savory crepes-- hopefully then i can write a new review and give them a higher rating.", "author": "Joyce C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I needed to try out these crepes my co-worker kept speaking to me about near my job, so I finally went. I chose to try out the blueberry cheese cake as recommended by a very friendly and funny employee named Crystal, and it was awesome as she said it would be! I would definitely come back again also the staff and place it self was very welcoming.", "author": "Samantha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "I was going to the friends' 20th anniversary coffee shop, but there are too many people. So I find this shop. The yummy smell fill within the shop and spread around the street. It's special. The only thing is it's cold but good. I order eight turn lox it's A little salty....", "author": "晴"}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "I had an Azuki Berries. It was good and had a large green tea ice cream on the top with strawberries and whipped yogurt. I love the chocolate sticky on that and the crepe was so soft and crisp. but.. I thought the taste was not that impressive. From the reviews and pictures on yelp, the crepe was so good and different and I had to try it. Maybe next time I will try something different, like salad crepe :)", "author": "Xin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "in continuing my search for awesome and authentic Japanese food, I found this place via a google search. One thing I had yet to find in NYC, was an establishment that create the yumminess of Japanese style crepes, so famously sold in Harajuku/takeshita street., until I found this place.  \n\nThough they did not have as many options as those trucks on Takeshita street (doesn't matter, I'm a dessert crepe fan anyhow), the options that were available all seemed yummy. I ordered the Harajuku fruit cocktail, received it about 5 minutes later, hopped on the uptown 6 train (which is less than 10 feet from the store front) and devoured it by the time I'd gotten to Astor place (two stops away). LOVED it! I have to say that it wasn't as sweet as the ones eaten in japan, but it damn sure came close the deliciousness I'vd been craving since my last night in japan (it was the 2nd to last thing I ate while in japan). Loved it, and will be back!", "author": "Janeria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "So good! You can adjust the fillings in the crepe if there is something you don't like. I always get the matcha azuki bean crepe but I take out the azuki beans and replace it with something else. The girl at the counter is super friendly and very accommodating.", "author": "Yuna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Absolutely the best crepe place hands down. You will not be disappointed here! It's a small shop and not a few seats but it's worth it. They have both savory and sweet crepes and a lot of variety. I personally recommend the strawberry banana. So gooooood!", "author": "Jane L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Had the chicken teriyaki savory crepe and really enjoyed it. It was crispy and maintained its variety of ingredients and balance to the last bite. Awesome.", "author": "Hillary Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Wow...\n\nI haven't heard about this Japanese crepe before.  To my knowledge only the french and Russian were known to make crepes.  Boy was I wrong.  These crepes are fantastic, like an explosion of happiness and goodness in your mouth.  I've been there three times since they opened because I can't get enough!\n\nI'm no expert of lox by any means, but their lox crepe is heavenly and to die for, you MUST have one, your taste buds will thank you!  Also save room for dessert!  The chocolate and other confections are home made in house daily and are delicious! I recommend the chocolate bananna.\n\nTo wash it all down have one of their yoozoo lemonade drinks (I may have spelled that wrong) but nonetheless it's extremely refreshing!!!!\n\nI'll be back here MANY MANY times!", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "Delicious, cheap, and exactly what I (originally) had spontaneously wanted to try.\n\nSome friends and I were walking through Little Italy after checking out the World Trader Center memorial, and we happened to walk past someone holding an unbelievably enticing hand crepe.  I should have known better than to not first check Yelp, but less than half a block down the road we ran into Viva la Creperie, went inside, and immediately placed an order.\n\nGo to check-in, and to my immediate dismay, I find out that Eight Turn Crepe is right next door and far outshines Viva in reviews.  So, we did the only logical thing to do...  we ate our crepes at Viva, and immediately went over to Eight Turn to order the same exact ones!\n\nEight Turn's crepes blew Viva's out of the water.  Fresher ingredients, better preparation, and a much friendlier staff.  We got a lox and cream and it honestly was the best savory crepe I've ever tried.\n\nLesson of the day...  don't jump to the first logical source of crepes...  do your homework!", "author": "Shawn O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Absolutely delicious light melt in the mouth Gluten free crepes ! the flavor combinations and presentation are a delight to the senses and both Orett and Crystal were very friendly and  helpful in helping me decide what to get.\n\nI got the Harajuku Fruit cocktail this time and loved the abundance of fresh strawberries,raspberries, blueberries ,mango and banana with the whipped yogurt cream and custard cream ! i savored every bite!\ni have got the strawberry banana and Matcha stripe chocolate too and both are delicious as is the Chicken Teriyaki.\n\ncan't wait to go back !", "author": "Monisha R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "ETC...please load your crepes with more filling like you used to :T I've been a customer since the first day you opened, and your crepes are getting smaller and smaller everytime. I really love your matcha chocolate crepe and it used to always hit the spot but I don't find it as satisfying anymore. Please make them bigger like you used to.", "author": "Wenky W."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}