{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "I don't know how I feel about savory crepes but I went the safe route and ordered something sweet.\n\nI ordered the Strawberry Banana and my friend ordered the Matcha Stripe Chocolate. The ice cream was good but I didn't enjoy my crepe the way I thought I was going to. I've had many crepes and this one just didn't satisfy me. My friend liked hers a lot and said it was one of the best crepes she's had. I'll probably come again to try the Lychee Valentine, which looks really good to me and maybe I'll step out of my comfort zone and try a savory crepe!", "author": "Joyce Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "I like the savory crepes more here. I got the azuki berry crepe. That was good but I got thirsty really fast. So, I'll definitely recommend getting a drink. I also tried the lox crepe. That was ok since I wasn't a fan of too much cream cheese. Would come back to try the other crepes", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "These Japanese style crepes are really delicious!! The outside of the store reminds me of a Harajuku store front in Japan. Inside is a very small space but neat and clean looking. The crepes I've tried are the BLT, Avocado Shrimp, Azuki berries \u0026 Yuzu Soda.\n\nAfter eating them, I felt like it was a gourmet meal instead of a normal crepe. From the beautiful presentation, you can see mostly all of the ingredients from the top view. very well designed cone holder/togo bag. For the price, you get fresh \u0026 high quality ingredients. Like the bacon in the BLT is thick/juicy, the shrimps are plump and have nice texture to them. Tofu sauce \u0026 yogurt whip is light \u0026 tasty (feels healthy:)) and the homemade chocolate truffles is to die for in the real matcha green tea icecream! They even use rice flour to make their crepes wheat free. I'm craving to go back and try out the rest of these guilt free crepes on their menu!", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "The place is tiny. Seating limited to a bench inside \u0026 another outside. Two stools with some table space lining the display window.\n\nThat aside, the decor is fun and bright. The servers friendly. Everything is under $10.\n\nI ordered the Nutty Chocolate crepe (ice cream included) while my friend ordered the blueberry cheesecake crepe, which also comes with ice cream. They both come with two skinny pocky sticks skewered to the crepes. I think it's cute; eight turn a fun creates way to display and eat a crepe.\nI think I valued the experience of eating there more than the taste itself. The crepe dough is a bit more eggy tasting than I'm used to, but it's still light.\n\nI'd love to come back and try the savory crepes and see if they resemble the fake crepes on display.", "author": "Hee Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "They have most amazing both savory and sweet crepes I've ever tasted in my life. Bravo Eight Turn!", "author": "Hiro N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "The fruit cocktail crepe is so delicious! Not that sweet at all, which I like. I did not add icecream Cuz according the other review the crepe itself is very filling. Definitely a come-back place", "author": "Jojo K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-16", "description": "We were looking for a place to grab lunch when we finally got out of Central Perk. This place caught our eye. It had great reviews and one dollar sign. There wasn't much seating: two bar seats and a bench that seats 2-3. \n\nI ordered the truffle egg white omelet crepe. It was dripping all over the place, so thank god for my Central Perk coffee cup. It also wasn't very satisfying. The portion wasn't enough to be filling. I'd recommend ordering two if you want a filling meal, or going to Vive La Crepe next door for their savory crepes. It was also pretty pricey for such a small portion.\n\nMy friends got the Chicken Teriyaki and Shrimp Avocado. The Chicken Teriyaki apparently wasn't that great either. I had a bite and it tasted healthy but bland with not a lot of chicken inside. My friend really liked her Shrimp Avocado though. Maybe that's the best bet! \n\nFor such an a-ok place, I'm surprised by how many people come here. I probably won't come back again, unless for dessert crepe. (Note that the dessert crepe is just as expensive if not more so than the savory crepe. Weird isn't it?)", "author": "Judy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Stopped by NYE to try out a new dessert since I was around the area. Very delicate and irresistible - it looked artfully well-made. I ordered the Azuki berries for take-out and was impressed w/the packaging. Random strangers on the subway kept staring at my crepe. One girl asked me where I got this and if she could take a photo of the crepe. I happily obliged. When I got home, I noticed how the crepe remained intact after 30 mins. Every bite, I took the cream layers literally melted in my mouth leaving a subtle taste of the green tea icecream. I would definitely go back to try the other flavors though I think $9.50 ($10.34 including taxes) is a tab much for a crepe...", "author": "Vivian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "So I came here excited to try some fancy crepes. I tried the matcha stripe chocolate crepe and the black sesame milkshake on the recommendation of my fellow Yelpers. The crepe was delicious. It was light and crispy. There were homemade truffles on it! All the ingredients in the crepe worked together super well. It came in the shape of a cone, so it was easy to eat. It was messy though. I dripped chocolate sauce all over my pants...\n\nI've never had Vive Le Crepe, but compared to Eight Turn Crepe, their crepes look a little too plain. I'd definitely come back to try another flavor!", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Here it is, the mother of all Creperies. I have been waiting my whole life for an awesome Matcha Green Tea Crepe, and they have a delicious one right here! \"Would you like a scoop of ice cream with that?\" UM. YES PLEASE. I haven't tried any of the savory crepes yet (Sometimes, you give people an option of savory and sweet and they panick, okay? It's totally normal) \nBut I would be open to trying them. Perhaps I will on a day where I am not craving a matcha crepe with a scoop of green tea ice cream. Oh wait, that's no days. Everyday I crave matcha crepe with a scoop of green tea ice cream.", "author": "Josephine Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "I'm basing this off of my first and maybe last experience here. I haven't got to try one of the crepes yet, which look pretty good. However, due to my recent experience with the staff it's hard to think so positively about this spot. My friend and I were hoping to get some crepes tonight so we walked over to this place. There is a sign on the door that clearly says open from 11am to 11pm so since it was only 9:40 we thought we could go inside, but they were closed. Just found out that they close at 9:30 instead. We tried to get the staff's, who was inside, attention, but instead of saying anything one of the guys ended up just waving goodbye as if he were dismissing us. We were trying to point to the misinformed sign, but they clearly were not trying to listen to us it was pretty rude. We ended up getting crepes from the place right next door. It's unfortunate that the staff working tonight handled the situation rather unprofessionally because I was hoping to try one of those crepes, but it's going to be a while before I decide to go back there. I hope that sign gets updated soon.", "author": "Cree P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "I ordered the Azuki berry, and my sister got the lychee valentine. Both of these options were delicious! The crepe is made fresh to order, and they have really quick service. I would def come back!", "author": "Nada H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "I came here with my friends and it's a small place but they offer a lot of variety. My friend had ordered first and she ordered the Chicken Thai which smelled so delicious I opted for the Chicken Teriyaki and that tasted good. It's essentially Chicken Teriyaki in a crepe versus the actual meal which might cost around the same. \n\nThe Chicken Teriyaki came out to be $9.80 but it was really filling so I think its worth it. It can get a bit messy to eat though so make sure you take some tissue with you, and a fork if you need!", "author": "Wendy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "I can't speak for their savory crepes, but their dessert crepes are awesome!!  The last time I had crepes like this was in Tokyo years ago.  The crepe pancake itself is sweet and chewy.  The fruit and sweet sauces you can get are fresh and really good.  \n\nTIP: Get ice-cream with your dessert crepe!  It's totally worth the $2.  The green tea ice cream is strong, so if you're not a fan of that taste go with vanilla.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Instagramable? Yes. Made with precision and delicacy? Yes. Worth paying over $10 for? Sadly no. \n\nEight Turn Crepe gets an extra star for challenging the typical crepe by offering asian flavored crepes. Even the crepe batter is different as it's lighter, thus making it airy. We ordered the famous Azuki Berries, which consists of strawberries, matcha green tea ice cream, azuki beans, whipped yogurt, matcha custard cream, chocolate Pocky sticks, and almonds. With all of these ingredients, it sounded really flavorful. However, the flavor was lacking. You could barely taste any of the ingredients except for the whipped cream and the azuki beans, which are red beans. Due to this and its relatively high price, we won't be back.", "author": "Boris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "This place makes craving a late night snack good. I like how you can watch the magic happen right in front of you. The shrimp and avocado crepe is a great combination of sweet and sour flavors. The space is small with a few chairs to sit and eat but definitely worth a try.", "author": "Chanel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Great fan of the Japanese crepes in general. I hate super super sweet desserts, but these are just the right amount of sweetness for me. The price range is between $8-$11ish and it's worth every bite. The store is really tiny and there's really only enough space for maybe 5 people to stand in comfortably, any more and it'd be suffocating. But this isn't a dine in type place, but more of a grab your crepe and GO GO GO! So it's perfect for those days you want to grab a quick dessert on the go. I ordered the #20. Matcha Chocolate Stripe and that was awesome. The chocolate syrup they added was a perfect touch to a matcha, strawberry blend. Careful in the summer because lines can be long! But it's worth the wait!", "author": "Rosy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "The smell... once you walk in, you wont be able to walk out!\n\nI have yet to discover what eight turn means... i mean... logically, if you make 8 turns, youd surround a block twice then come to the same place.  Not enough for biblical reference, too much for repetitiveness...  What does it mean!  Must go back to find out and order that matcha green tea berry crepe again!  .....  Only because its my civic duty....\n\n\nAnyways, enough brain farting... \nThis place is novel, cute, the food is delicious and the interior smell ...  if yelp rated droolworthiness, I would give it five out of five glops;    buttery, warm and enriching.  \nThe store is easy to pass by but you can recognize it by the amazing display of crepes covered by glass domes.. making the whole store appear somewhat like a other worldly, japanese, mystical science project.  \n\nIts fun to eat, novel (even though its just crepes) and delicious.  I dont know where exactly to fit  it into my eating schedule.  Its kind of light... so its great for lunch, or after dinner dessert!", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Tasty, fun, versatile! \n\nYou can order savory crepes with meat, veggie, or shrimp fillings or have a bountiful dessert crepe with ice cream, chocolate, fruit, candy, syrup, etc.. I wish the portions were bigger, as when I began enjoying my shrimp \u0026 avocado savory crepe (HIGHLY recommend), I got not as many bites out of it as I thought I would. For $11+tax, you can get a filling lunch option somewhere else, so if you're hungry, you won't be full from one crepe portion. \n\nThe shop space is TINY so prepare to eat your crepe outside because a waitline of 4 barely fits into the space. If you're with a group, be prepared to look for somewhere to stand/sit on the street.\n\nOverall, recommend for anyone who likes to try new \u0026 tasty foods that can be enjoyed and devoured quickly! Be prepared to be tempted for a second portion :D", "author": "Kseniya K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Varieties of choices and good taste! Will def come again. \n\nI got the 18, mixed berries, banana and whipped cream. The crepe is crispy. Just...yummy!! \n\nIf you love crepes, don't miss it out!! I also bring a friend to here, she said she would take a subway to soho only for this!!", "author": "Yi W."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}