{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This is my all time favorite crepe place. I always come here whenever I want to get a crepe. The crepes here are a bit pricey, ranging from $8-12 depending on what you get. But, it is all worth it. The crepes are filling and extremely good. Also, they have both savory and sweet crepes. But, of course, I normally just get sweet crepes. \n\nI usually get the matcha stripe crepe since it has chocolate, matcha, and strawberries. This crepe never fails to disappoint! \n\nI've also tried azuki berries, but I was not a big fan of the scoop of red bean on it. But, other than that it was good as well. \n\nThe most important thing about their crepes that sets this place apart from other crepe places is the texture of the crepe itself. The crepe is soft and fluffy, unlike some other places that have a more crunchy/harder texture. Also, the crepes are filled to the brim and not just measly filled. \n\nAlso, buy 9 crepes and get the 10th free with as many toppings as you like!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "Hands down my most favorite dessert spot ever (as of today). Never had a crepe before, don't know why, but this was so so soooooo good! I had the banana nut chocolate crepe with berries, they make them right in front of you so they're fresh and warm when you get them. The only downside is that there's no space inside the restaurant so expect to eat outside. There were 4 other customers inside and we literally could not move. Aside from the small space, I absolutely loved this spot. Definitely a great place in SoHo to stop in when the weather is nice and you're in the mood for something sweet.", "author": "Sarita P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Really good crepes at this place. Got the turkey with avocado instead of asparagus. Delicious. I've also tried chicken teriyaki, which isn't on their menu anymore. That was very good as well.", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "All I have to say is yum! Eight turn crepe is a Japanese style crepe, and I loved it! Got to try the asuki berry and the Valentine crepe. My preference is the asuki berry. The crepe skin was light and crispy, with a different texture than French crepes. I'm assuming because the the crepes are gluten free, the crepe batter is probably tapioca or rice based as opposed to wheat based.", "author": "Krystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "This place was crazy packed when I came and let me tell ya it was most definitely worth the wait! Great variety of selection to choose from; they have options for a light and quick lunch kind of crepe and then there's the usual popular Japanese dessert kind of style crepe~\n\nSo glad I came across this place! Have seriously been searching far and wide for a Japanese crepe style store to satisfy my cravings and I have finally found the place! And one of the best parts about it is it isn't all that pricey as I would have expected. Very reasonably priced which makes it ideal for a great place to grab a small, quick and light bite with some friends while roaming the streets of New York!", "author": "Teresa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "So happy to have finally tried this place after having it bookmarked for so long. A friend and I ventured here during a hot day because we both wanted crepes and I remembered it was near soho. \n\nWe both got the azuki berries crepe. The crepe itself is huge and could definitely be shared between 2 people. It came with pocky sticks, strawberries, whipped cream, green tea ice cream and azuki (red bean) paste. I enjoyed every part of the crepe as did my friend. We both couldn't finish it but nonetheless, it was really good. The only minor complaint I have is that the ice cream had a bit of freezer burnt but other than that, I would definitely come back to try their other crepes.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "ALERT: If you are walking to Little Italy and you see this cute display, you CANNOT RESIST coming inside for a Japanese crepe!!\n\nThe space is so small. There are just 4 seats inside and an outdoor bench so most people have to line up outside. Anything on the menu is so good, from sweet crepes with ice cream and fruits to crepes with salmon and salad. 2 crepes from Eight Turn can be an excellent brunch for me. Take my money and give me the crepes!", "author": "Min T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "JAPANESE STYLE CREPES!! glad this opened up in Manhattan because i enjoy the japanese style more than the french style\n\nonly 3 stools, one bench inside \u0026 one bench outside BUT good thing these HANDHELD babies are easy to eat on the go\n\nthe crepe isn't as crisp as places i've tried in LA but much more crisp than the french style\n---banana chocolate crepe (with strawberries substituted for the bananas): yummy chocolate truffles inside! i like the chocolate custard best of the 3 custard flavors (they let me sample!)\n---harajuku crepe: come's w/ original custard \u0026 no chocolate truffles.. so i'll stick to the banana chocolate crepe!\n\nlove that all the fruits they used were fresh! they also have savory crepes if you're not into sweets\n\nThanks Paypal for the freebies!", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Eight Turn Crepe catered a lunch for my office and was a hit! We got to try a variety of popular savory crepes and they even accommodated our request for smaller samples of the sweet crepes for dessert. They were delicious and the wrap they come in makes it easy to eat and unwrap. The customer service and presentation were excellent and I wouldn't hesitate to use them again!", "author": "Shawna L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "Meh. \n\nAfter having crepes in Tokyo, I was really craving some \"Japanese\" crepes. My coworker and I made our way over during our lunch hour to grab some crepes from 8 Turn, since they're advertised as Japanese crepes. \n\nWe both opted for a sweet crepe - she had the strawberry banana and I had the NY Blueberry Cheesecake crepe. Both were very pretty and tasted quite good. But halfway through, we kind of wanted to take it back. By the midway point, it was getting uncomfortably sweet. By almost the end, we both couldn't do it. There was just so much cream and frosting and whatever else was inside. Too much!! \n\nI don't recall crepes in Tokyo ever being this sweet. In fact, I don't remember them being this big either! \n\nI might come back to try a savory crepe but I won't be running back anytime soon.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Best crepes ever. \n\nWhy?\n\n1) they're in a cone.\n2) there are pocky sticks in #9. \n3) matcha ice cream!!!!!!!!!\n4) FLUFFY and TASTY with custard in between layers... omggggggg \n5) just really great combos \n\nI saw the lady actually throw out a whole crepe because it was already cooked on both sides. That's how you know they won't give you a product unless it's PERFECT!!!!!!! \n\nThe only cons:\n1) Cash only unless you have the paypal app. \n2) Tiny space with 2 stools and a tiny bench, grab-and-go\n3) Yuzulade tastes like the Korean citron tea that I make at home.", "author": "Elsie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "I visited this place around early January 2015. I read reviews about it and the crepes looked so unique and delicious!\n\nThere are a variety of crepes to choose from, ranging from savory to sweet. I chose the Matcha Stripe Chocolate. It was so difficult for me to choose out of all the flavors they had, but I was satisfied with it in the end! There was also the option to add any toppings such as ice cream or Pocky for an additional cost. \n\nThe service was pretty good, it wasn't a crazy wait or anything. The place was cramped and packed, which made the experience less comfortable for me. There were only about 4 stools to sit on and it was hard to move around, which is why I'm giving it 4 stars. I got to watch them make the crepes, which was a bonus and very enjoyable for me! Hopefully I'll go back in the summer.", "author": "Crystal N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "I came here about 4 months ago so I don't remember all the details. But what I do remember is that I really enjoyed the custard that was smeared on the inner layer of the Azuki berries crepe. It was amazing.\n\nIt was the prettiest crepe I've ever seen. Like eating an ice cream cone. The crepe is filled with green tea ice cream and has azuki berries on top and pocky sticks. Highly recommend getting that one!", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Went to an event that was catered by Eight Turn Crepe and all I can say is Wow am I impressed! What a cool and creative concept! Everyone at the party loved it and was raving about it. It was so cool to have freshly made crepes done right in front of you and served hot to order, def something different. The staff was attentive , they worked fast and the wait time was not long at all. The crepes tasted delicious. I tried the shrimp avocado and strawberry banana Nutella. It was soooooo good.  I am having a baby shower in a few weeks and have already booked them, can't wait!", "author": "Angelica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Nomnomnomnomnom. I like crepes. Eight Turn makes some great, fancy-looking crepes. You can get sweet or savory, depending if you're up for a lunch/dinner, or a dessert. \n\nI hadn't heard of this place prior to walking right by it and having the window display catch my eye. It wasn't really fair - they looked so good I had to try! I got the banana chocolate crepe, my usual go to. I don't know what else to say - it was delicious!", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Great place to get delicious crepes! Slightly pricey (definitely $10+), but I guess I don't come here too often anyways, so I don't mind it as much.\n\nIt's a pretty small space, so it'd probably be best to take it to-go. They have a small bench that fits about 3 people, and 2 more stools near the window. It's sometimes confusing where the line is since there are a lot of people waiting around for their crepes too.\n\nMy favorite is the eight turn lox, which has sliced lox (smoked salmon), cream cheese, capers sliced red onions, and spinach. Great option if you are grabbing brunch on the go! I've also tried the azuki berries one which includes strawberries, Il Laboratoria del Gelato Matcha green tea gelato (!!!), azuki beans (red beans), whipped yogurt, green tea custard cream, slivered almonds, and pocky sticks - the matcha gelato is enough of a reason to get it!!!\n\nI always ask the staff to leave the crepe on the hot plate a little longer than usual since I like it crispy, the way they make crepes in Asia (at least where I'm from, Taipei). It always comes out a little crispier than usual, but never to the crispyness I would want haha. At least it ensures that the crepe is hot when I get it!!! :) Love how crepe batter is the perfect sweetness, and they always fill the ingredients to the brim.\n\nWait is a little long since they're all made to order, so be prepared!", "author": "Patricia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "This place is so worth the wait. So much flavor in each crepe. We ordered the matcha striped chocolate crepe, strawberry and banana crepe with a matcha smoothie. Each of the crepes were crunchy on the outside and soft on the inside. They don't skimp you on fruit, chocolate or the matcha. Theres plenty full and it seems as though the chefs tried to stuff as much as they could into these things. Matcha smoothie was creamy with the strong matcha flavor. Place is small maybe 6-8 people max waiting room. Wait is a bit long about 30-45 minutes, but its so worth it. Price of around $7 for each crepe is reasonable considering how much food they give you. I'll be back for the Azuki berries crepe and lychee Valentine!", "author": "Khoi N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "I was really excited to try this place, because I had tried another Japanese style crepe place and it was soo good that I was craving for more crepes. Well this establishment was a disappointment. \n\nI had ordered the Matcha Stripe crepe and asked for it to be topped with matcha icecream and was charged an extra 2 dollars. After I was already charged, they told me they ran out of chocolate truffles and could give me a substitute.  the substitute waschocolate sauce- which is probably worth like 50 cents- what a ripoff!\n\nFirst strike-- they should have told me first before they charged me so I could change my order or they could have given me the ice cream for free. \n\nStrike 2-- I saw a crepe that was already made and was sitting out for a while. I wasn't sure if they were going to give me that same crepe or make a fresh new one.   Well they didn't give me a fresh one,  because when I bit into my crepe, it was cold and soggy. \n\nStrike 3- when I compare this place to it's competition, the portions are definitely smaller here, the crepe is bland and soggy, and the store is so small you barely have space to eat.\n\nEight turn crepe you have failed me.", "author": "Arlene Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "One of the best crepes I've ever had. I ordered the harajuku sweet crepe, which had strawberries, blueberries, and mango. Crepe had a magnificently soft yet crunchy texture, generous amount of fruits that were very fresh, and the cream was light and complemented the flavors deliciously. \n\nOnly complaint was that the crepe was messy to eat. But so worth it!!!", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "I love Eight Turn Crepe! They have such a great selection of sweet and savory crepes, all with a great variety of ingredients. It is a very small place with three bar stools and a bench fit for two, so I usually would not linger around. It is a little tight and makes it kind of awkward to order. I would order and eat as I walk. I love hand held crepes! I don't like staying in one place for long, so being able to walk and indulge at the same time is a plus! Their packaging makes it easy to eat on the go too! You peel the wrapper on your way down the crepe. I tend to always come by after a shopping day at Soho because it's pretty conveniently located. \n\nI really love the Matcha Stripe Chocolate with a scoop of green tea ice cream. I almost always get this one when I visit! I think it is one of their bestsellers, because who doesn't love matcha, right? With the green tea ice cream, it tastes ahh-mazing. I love the matcha custard, chocolate truffles, and chocolate sauce in it too and it is so well balanced with the tartness of the strawberry. \n\nI have also tried the Azuki Berry crepe. It is so delicious with the bean paste, almonds, and green tea ice cream is already included! The crepe is really soft and chewy and crispy on the edges and one is pretty filling for one person because they are pretty big in size. They are usually pretty quick with preparing the crepes too and they're made right in front of you. \n\nI cannot wait to return and try their savory crepes. I would love to try the Eight Turn lox! And I also want to try the Lychee Valentine, hopefully they still have it the next time I return!", "author": "Lorraine C."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}