{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Cons\n* can be pricey esp with add ons\n* Place is small so entrance can get crowded; if you're in a group please wait outside!\n\nPro's\n* gluten free if you need that (rice crepe)\n* awesome to-go holder (rips to let you keep eating / bag custom made for the shape too)\n* Filling but not heavy (like a competitor a few doors down...). \n* Get points with Perka.", "author": "S V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Went in and it was crowded but that did not bother me at all. Decor was nice and cashiers were even nicer! Crêpe tasted amazing. Would come again and again!", "author": "James L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Super light and delicious crepes that are carefully wrapped like an art. The shrimp avocado crepe was very refreshing and tasted like summer. The chicken teriyaki hits the spot perfectly. This will be on our go to list for light lunch/snack", "author": "Mark L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "As a lover of crepes, I was drawn to try this little small,seat less dessert café based on the glowing Yelp reviews....which, once again, led me in the right direction.\n\nRice flour crepes?  From Japan?   \n\nIn the past, I have had terrible experiences eating crepes served out of a paper cone............dry, thick, crunchy....just gross.\n\n  But not at Eight Turn Crepe.  The crepe was delicate, thin and just delicious.   The filling of my salmon crepe was brimming with thinly sliced smoked fish, fresh baby spinach and capers.  Wonderful!   My son inhaled his strawberry/banana/chocolate crepe.  \n\n   I cannot wait to return!", "author": "Linda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "This is a solid place for your Japanese crepes. \n\nThe place is small with maybe only a couple of stools near the window to sit. The place gets really crowded so I would just take it to go and not try to stand around for a seat. \n\nI tried the Azuki Berries and it reminded me of my favorite crepe in Tokyo. I personally love the red bean and green tea taste together. The green tea custard was also a nice compliment (not too sweet) to the green tea ice cream.\n\nThe presentation of the crepes is pretty and the window display in the store is nice (just like Japan!).", "author": "Katherine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Japanese crepes outside of japan! Had the matcha chocolate crepe which came with more toppings than any place in Harajuku in Tokyo, but I felt like the chocolate overpowered the matcha which was very very good.", "author": "Barbara Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "This place is great for a quick bite! These crêpes are amazingly delicious and pretty. We have tried the Strawberry Banana, TwinkleBerry Parfait, Azuki Berries and Harajuku Fruit Cocktail. If you plan to eat in, there isn't really a place to sit except for a small bench inside and outside of the store. Overall, I would definitely recommend this place for anyone who wants a quick bite or a even delicious dessert!", "author": "Justin And Michelle W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-21", "description": "Definitely not the best. Friendly and helpful staff though.  I should've known better than to stop at a place so close to soho with all the tourists everywhere. \nBeen consistently disappointed in crepes lately. . This one was not good at all. Toppings only on the top of the crepe and the crepe itself was not enjoyable. I dug in right away and it was definitely very crunchy and overdone. I wish it was better", "author": "Tracie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "TLDR: cute shop, mediocre crêpes\n\nHole-in-the-wall place, but with a couple window seats and a bench on which to enjoy your crêpe. A bit of a too-cool-for-school vibe with street art-inspired wall art and classic rock (60s-00s) rock on the soundtrack. The staff seemed friendly and efficient, but they forgot my order and I had to remind them of it after at least 20 minutes sitting in the shop.\n\nI had the fuji apple pie crêpe and was distinctly underwhelmed, which is surprising considering I love apple pie. The crêpe itself was bland,  the filings not flavorful enough to compensate. That being said, I'd be interested to try one of their savory varieties, but I'm not hopeful for the sweet ones.\n\nBonus for those of the gluten free persuasion: all \ncrepes are made with 100% rice flour.", "author": "Erika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I will continue to enjoy French-style savory crêpes, but I can now also say that Japanese-style dessert crêpes are awesome. The first time here, we got the Harajuku Fruit Cocktail, which was enough for two to share and had fruit and cream layered in every bite. This was a major point for me since I have often felt gypped on how little filling there is in other crêpes I've had. Not so here! Fresh and delicious fruit complemented by subtly sweet crunch from first bite to last. Plus they wrap the bottom nicely to avoid that awkwardly-sticky-final-few-bites moment inherent in other street crêpes.\n\nAlso enjoyed the yuzu slush. Yuzu seems to be a rare and underrated flavor option among other restaurants in the city. A refreshing change here.\n\nSecond time here we got a savory crêpe with shrimp, avocado, and a really tasty sauce. Just the right amount of spice, and I was pleasantly surprised since I usually go right for the sweets...which we then did moments afterward.\n\nVery small place with minimal seating, but all the employees are super friendly. Great for a quick stop to refuel after a lot of walking.", "author": "Lindsey T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-17", "description": "I got the lychee valentine. It was a bit refreshing, a bit sweet, a bit weird. It is definitely different. Not sure if I would order the same thing again. Oh and it didn't come out looking like the picture. Not even close. My crepe was almost flat. They're pretty cheap with the fillings. I've had much better crepes with a much lower price tag. Hopefully my next visit would be better.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "Tried this place since I was pretty intrigued by the idea of eating a crepe with anything but fruit in it. It's a very trendy take on lunch or dinner, but I wasn't blown away.\n\nI had the shrimp and avocado crepe, and there just wasn't enough inside the crepe to warrant the price. Also, when they were making my crepe, I saw 1/4 of the avocado fell out and instead of replacing it, they just handed me the food. The flavor was good, but I think I will stick to crepes for breakfast/dessert.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "From the moment I entered this small yet inviting little shop, I was sold. First off, the crepe: yummy, lots of options, thoughtful and practical presentation. Second: the staff seemed like a nice bunch. The order taker was very warm and professional. Third, and perhaps most impactful and memorable, was the ambience of this tiny space. Although the square footage between the front door and the kitchen counter couldn't possibly have been any larger than a full-size mattress, there is an open-airy feel, even a breeze created, via the open doorway and glass store front. Vibrant colors and large moving picture screens decorated the walls. They even had an upright i-pad for a modern day register (tech-savvy).  As I waited on a little bench inside the store for my crepe order to come up, I had already had my fill of a beautiful, memorable experience.\n\nP.S.: I added a scoop of green tea ice-cream to the top of my crepe (not a fan of that, but I'm glad I tried it).", "author": "Myra J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "After having a heavy dinner nearby with a friend, dessert is always a must ! I walk by several dessert places and saw the beautiful crepe presented outside of the store. I was eager to try it! I was outside looking at the menu and knew what I wanted. I walked in and there was one employee working on the crepe. He didn't enknowledge me at all. Not even a hi or good evening. I stood there with my wallet out waiting for him to take my order.  Then this other women  came out and went right to the frying station. Did not enknowledge me at all too. I stood there almost 15 mins. There was only one person waiting for their crepe. It wasn't even crowded. Horrible costumers service. I walked out. Never coming to this place again. Thanks for saving me 10 bucks on a crepe.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "Their large-folded crepe is good, but the crepe itself without any toppings and creme they should improve the flavor. Other than that is huge, variery of selection and the store is cute and clean.\nI will probably come back and try out more", "author": "Jen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "This place threw me off a bit since there's a more 'authentic' looking crepes eatery a couple of stores down on the same block. However, this one had much higher Yelp rating, so I decided to check it out.\n\nOther reviewers are absolutely correct when it comes to waiting - I had to wait quite a while (about 20 minutes, starting from outside the eatery, to ordering, and another 5-10 minutes before I actually got my food). It wore my patience a bit thin, but I decided to wait it out.\n\nI had a Chicken Thai Crepe, and it was absolutely amazing. I was tempted to try one of their dessert crepes, but I was too hungry to do so.\n\nI'll definitely come back to try one of their dessert crepes. I had my eyes on Match Chocolate, so I'll try that next time I'm back :-)", "author": "Chan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Mmmm, crepes!\n\nThis was one of many stops on my food tour of New York.\n\nFirst impressions.  The place is tiny.  Like extremely tiny. Seating for 2 at the window facing the street, but once people start coming in, there's no room for elbows, and claustrophobia definitely becomes a thing.  The service is quick and easy.  Ordering is a breeze.  The only difficult thing to do is to choose which delicious crepe you want to try.\n\nThe crepes are delicious.  All the flavors were delicious, and after devouring one crepe, I honestly wanted another, but decided against it as my stomach was telling me it had reached it's food consumption limit of the day.\n\nIt's a bit pricey for dessert.  $6.50+.  However, it's a crepe, and a darn good crepe, so I will not complain, and instead treat it as a special treat each time I go.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I came here on a PayPal run (can't you tell I'm just as obsessed with PayPal runs as egg creams and empanadas? I'm a passionate woman). \n\nI picked up 3 crepes that came to about $30. I thought it was a little steep, but I won't splurge like this without PayPal. \n\nI ordered a Turkey Delight, shrimp and avocado, and as per Yelp's advice, the Lychee Valentine. \n\nAll three of those were very delicious and highly recommended. My favorite was the first 5 bites of the shrimp and avocado, the last 5 bites of Turkey Delight, and the entire Lychee Valentine. \n\nThe first 5 of shrimp avocado because the latter part was too sweet. And the last 5 bites of Turkey Delight because I needed to clean my palette after the really sweet shrimp avocado. \n\nBut the Lychee valentine was indeed a delightful and romantic feast. \n\nI'd totally come back here again, because I'm obsessed with crepes.\n\nService was meh, I should dock a star, but she wasn't terribly rude.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Chocolate nutty pocky stick crepe (I forget exact name) was so delicious! Really good balancing of favors! Will be back for sure!", "author": "Sayma P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "This is my second time here today. I've been here last month and it was amazing! I tried a sweet crepe last month and got Harajuku Fruit Cocktail and it was soooo good!! It wasn't too sweet where my teeth would hurt but it was sweet enough. \n\nToday I decided to go with savory and got the Teriyaki Chicken and it was just as amazing! It was so flavorful and I got full from it. I am definitely looking forward to try every single crepe!!!\n\n\u0026\u0026 a plus!! The staff were super friendly and nice. They chatted with us while we waited and was very sweet. AMAZING EXPERIENCE!:)", "author": "Lily L."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}