{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Awesome delicious Japanese style savory and sweet crêpes! and great polite staff! What more can you ask for? love this place!\n\nMy fav is the shrimp avocado adding on kurobuta sausage and egg! #yummy\n\nand quench your thirst with a yuzu soda or slush!", "author": "Luan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Decided to try the Eight Turn Crepe while I was waiting online at the summer streets to go rock climbing. \n\nI ordered the Eight Turn Lox because the name sounded interesting and it seemed to be named after the store.\nI loved the idea of salmon and spinach and cream cheese together. Taste was alright but it was definitely filling and unique. However their crepes are little pricey $10.25 or so after tax. I would like to try their sweet crepes though.\n\nPROS:\n- unique crepe creations and options\n\nCONS:\n- crepes are little pricey\n- store is a little small and has only 2 chairs for seating.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "I absolutely love this Crepe place! Though the crepe may look small in the photo, it definitely hits the spot haha. I wouldn't suggest eating a heavy meal before coming here though. Its pretty filling. The store is pretty small, so I would suggest going in the warmer weather so you wouldn't be freezing standing outside :)", "author": "Jenn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Small shop, cute crepe place with an asian fusion twist to it. Satisfied my sweet tooth after a savory dinner. I got the azuki beans and green tea ice cream crepe, topped off with a few pocky sticks- would recommend if you're into those oriental flavors.", "author": "Dawn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "I don't know what makes Japanese crepes different from regular French crepes, but whatever it is...it's delicious. I loved the soft, chewy, mochi-like texture and eggy light flavor of the crepe itself. the whipped yogurt was perfectly light and creamy (and hopefully healthy?). strawberries were sort of sour, but that's unavoidable. they're also fairly small for the price. other pictures on yelp look to be larger than the crepe I received, so perhaps they decreased the sizes since they first opened? \n\nall in all, a nice addition to the dessert scene. the city could use more crepe places! quite daring of them to open two doors down from another crepe chain, but I think (and hope) they'll last!", "author": "Leslie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Taste good, yo. \n\nWe walked in after a date night at Gyu-kaku one chilly night. It's a small spot, but I wasn't staying in to eat my crepe. I tried the azuki berry crepe because I couldn't figure out what I wanted. The choices there were too overwhelming for me, so I chose the first thing I saw  on the menu. Once I took my first bite, I was not disappointed. It was delicious. The light custard and fruit complemented each other well, though the base of the crepe was a bit cold. \n\nOverall, the crepes are great and I would definitely come back to try the different various flavors that they offer. \n\n\n**The crepes are gluten free and the staff was kind enough to explain to me what gluten free**", "author": "Carmen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "This place was a real discovery for me: it's a non-banal way to have a delicious breakfast \nEspecially I recommend basil/mozzarella creppe, if you add some bacon there.\nSmoked salmon is also wow \nAs for sweet ones, everything is great. White chocolate is my favorite.\n\nThe place itself is very relaxing and calm. Light French music and so responsive staff: they cook your sweet creppe a little later for you to be able to eat just made ones.\n\nI am in love with this small restaurant.\n\nFairly,  the only possible drawback is that the place is small.", "author": "Kirill N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "This. place. is. everything.\n\n\nI always make it a point to stop by Rice to Riches when I am in NYC.  My coworker told me about Eight Turn Crepe.  I finally had a chance to stop by as I was shopping in SoHo. I am glad I did. I tried the Banana  Peanut Butter. It was soooooo good, and it didnt even have ice cream in it! Sometimes I think the crepes are good because of the ice cream.  In this case, it was just simple ingredients and pure bliss.\n\nI will be back... every time I am in NYC.", "author": "Paola A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "This is a small creperie. They have two stools by the window and a bench that can fit two people. Only four people can eat in. It was pretty crowded as I entered the place. The stools and bench was occupied plus there were more people waiting for their order. \n\nIt's pretty cool that you can see them making the crepes. I decided on the harajuku fruit cocktail ($7.50) plus tax. It had strawberries, blueberries, raspberries, mangos, bananas, whipped yogurt, custard cream, almonds. \n\nFor some reason I just didn't like the combination on a crepe. I would like it better with just yogurt and fruits. I thought it tasted a little weird. The crepe was thin and it was nicely wrap so you can easily eat it.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "Got the basic strawberry and banana crepe. Waited a good 20 minute for it which was fine since I wasn't in a rush or anything. Maybe its because I don't really have a sweet tooth, but the crepe was way too sweet. It was loaded with chocolate and chocolate chunks. Most people are probably okay with this and maybe even love this but I don't. The sweetness was so overwhelming that I couldn't finish it. I'm sure there are other items on their menu that I would like. I look forward to trying out more items from here.", "author": "Ellie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "To paraphrase an earlier review, I have always felt Japan knows how to make everything better from packaging to crepes to tea and noodles, the list is endless. So no lack of choice: between savory or sweet, fruits or chocolate, with or without ice cream? Did I tell you that they use Il Laboratorio Gelato's gelato?? If I was a betting person I would bet you are convinced now. Wait gets better, it's also GLUTEN FREE! \n\nI had:\n\nMATCHA STRIPE CHOCOLATE\n* Ripe strawberries\n* Eight Turn chocolate sauce\n* Eight Turn chocolate truffles\n* Eight Turn matcha custard cream\n* Eight Turn whipped yogurt\n* Crushed pistachios", "author": "Lucie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Love it!!!! For sure going back ;) my boyfriend and I got the strawberry and banana crepe, it was so good! I love the fact that it wasn't so sweet! Also, they added some nuts on top of the crepe which was yummy! \n\nWe also got drinks from here too but I forgot the name. It was really good! The drink had orange peel in it, I would totally recommend the drink if I remember the name of the drink \nVery cute interior deco, however, the seating is limited! There are like three seats in the inside and few on the outside. No parking around the neighborhood, recommend everyone to take the train! It's by the 6 train on spring st.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Taste and quality of crepe: great\nI love the taste of the whipped yogurt with the chocolate sauce (though I am still partial to places that use Nutella...)\n\nGot the yuzulade free because of the grand opening stuff going on - it was decent. It's like a semi-sweet orange zest tea.\n\nCon: The wait time to get food was a bit much. Took ~25 minutes to get the crepes after ordering. The place has no sitting room, so you absolutely expect a wait of less than 5 minutes from the time you order. They seemed to be taking their time with the assembly to make sure it looked perfect, but I think they just have to get faster. Glad I had the free yuzulade while waiting!", "author": "Namir S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "So many options, but a bit on the expensive side for the size. I had the sweet crepe with banana, chocolate, custard, and almonds, and it was incredible. A little over 7 bucks.", "author": "Riley C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-04", "description": "I went there to check out the new and exciting store and I have to say it was a horrible experience. I am surprised to see positive reviews here, very shocking...!!! Makes me wonder...\n\n It took minimum of 30 min to get the crepe, even though there were 6 or 7 people working in the kitchen. What in a world was happening? It would've made it slightly better if someone acknowledged all the customers waiting around for their crepe, by saying \"sorry for the wait\" or something...  But no such luck. There was no service at all. \n\nThe main woman who was taking orders and giving the crepes, made no effort to make the customers feel better in any way. Instead, she was more interested in chatting with her husband and daughter who were hanging around in the tiny shop space, and take pictures with them instead of getting the orders out to the customers. \nAlso, her friends got their crepes very fast, while the rest of us were waiting and waiting waiting...\n\nThe girls in ridiculous costumes outside whose job was to bring in the customers didn't seem very motivated, all they did was sit around and eat their crepes. They came inside the shop to get their crepes few times, and there was no \"hello\" or \"thank you for coming\" or even \"excuse me\" while pushing customers away to get to the counter (it really is a small space). I thought they were really rude in every way. \n\nIf the crepe was an amazing crepe, it might be forgiven, but it wasn't great either. \n\nOverall, I will NOT recommend this place to anyone, and will never return there for anything. Luckily, there is Vive la Crepe few stores down, if I want a crepe, I will go there instead.", "author": "June S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "One of the best i've tried in NYC. Their style and taste are more Japanese, I prefer their savory crepes since i'm not a big fan of the sweetness of Japanese crepes. I believe they are the first Japanese style crepes in town, many imitators afterward.", "author": "Akira N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "YES YES YES YES!!!\n\ngot the matcha stripe chocolate with a scoop of matcha ice cream. everything about it was PERFECT. the best part was the whipped yogurt! i have never had that in any crepe and now i will demand it in every future crepe i will eat. added a surprising tartness to my sweet, sweet lover!", "author": "Jennie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "The staff were nice. The crepe was ok - I don't see how they can market themselves as a Japanese crepe place when their crepe isn't like that of in Japan. The crepe is just too crispy. But overall it's ok for a grab and go dessert.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "THE BEST CREPES IN NYC!\n\nI really, really love crepes but many of the ones I've tried in NYC are just not memorable. I heard that this place was pretty good, so decided to give it a shot. INSERT LIFE CHANGING MOMENT. I got the harajuku fruit cocktail crepe and I was literally floating in a cloud of happiness! So so yummy! It had ripe mango, strawberry, sliced almonds, vanilla yogurt, and custard. I am drooling as I write this ...\n\nI've also tried the eight turn lox \u0026 the shrimp avocado crepe. Delicious!!! That's all you need to know. Go get yourself a crepe right now!", "author": "Fatima K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "This review is for SERVICE. TL;DR, they RARELY open at 11:00, their posted opening hours. Best to come at NOON or after. \nThis business has posted hours of opening at 11am, but that almost NEVER happens. It's right by my work and the crepes are so yummy, so I swing by often. For a while I got told \"we open at 11:30\" (if that's the case, CHANGE THE HOURS ON THE DOOR) but today I stopped in at 11:30, only to be told, \"we're not open yet, it'll be about 5 minutes.\" So i asked if I could wait, about 10 minutes go by, and another girl comes in, and she's told the same thing. She sits to wait. \nThen a party of three people come in, and THEY are told, \"we'll be opening at NOON.\" So i'm starving and decide not to wait another 15 minutes, and tell the guy, \"this seems to happen a lot, you not opening on time.\" and he says, \"yeah, the closing crew don't do all the tasks they're supposed to so we have to do the work in the morning.\"\nI say, \"can't you tell your manager?\" \nHe says, \"We do, but he handles it 'in his own way.'\" Which sounds like nothing happens. \nSo, delicious crepes, but go after noon, and get ready for it to be slow. \nGeez bakc when I was a teenager (insert geezer sounds here) and I worked food service, you either did the tasks/chores of your shift, or you got fired. Apparently that doesn't happen anymore.", "author": "Charlene J."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}