{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Stopped by Eight Turn Crepe for a bite with the kids last weekend.  What a great place!! I've never seen My 5yr old \u0026 8yr old eat with such pleasure.  The Crepes are piping hot \u0026 presented in a cone shaped which make it easy to hold.  My kids loved the ice cream, fruit \u0026 chocolate filled crepes, while I thoroughly enjoyed the Seaweed Sesame crepes.  Will definitely be back to sample some of the other unique crepes, especially the Pork Belly crepe!  \n\nWith a selection of savory \u0026 dessert crepes on the menu  as well as Trader Joe's located directly across , I've found Food Paradise!", "author": "Ed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Happy to say they have a new location open downtown Brooklyn n dekalb market. Go get your Japanese style crepes", "author": "Tatiana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "We hired Eight Turn Crepe to cater our party (30 people) and they far surpassed all expectations. Not only was the food absolutely delectable, but the entire experience was super professional and polished. Our two staff members were lovely and hardworking. I had several guests mention they noticed the caterers went above and beyond. They worked REALLY hard and were so affable , they even kept their cool despite a stressful situation that arose (lack of counter space for their set up). \n\nSuch a fun thing to do, and I'd hire them again in a heartbeat. Several of my friends have already vowed to hire them for their next event.", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "This was our first time trying ice cream with a crepe wrapped around it like a cone and it is a great summertime treat. The location was easy to find by SoHo and it is conveniently located right across from the 6 subway stop. The staff was extremely welcoming and friendly and even complimented my eye makeup :P\n\nI love the creative array of flavors; I tried the \"Lychee Valentine\" and it was scrumptious. The decor was brilliant especially with their implementation of flower petals (that are edible). They are made quickly and the wait time was only less than 5 minutes (for two)!\n\nThey do not have too many seats; only about 6 inside and a couple spots outside. One of the seats on the bench against the wall is close to the trash can flip door so avoid sitting there, so you won't be in people's way. Other than that, great flavors and a one-of-a-kind treat for the summer heat!\n\nP.S. We are addicted to their Yuzu soda... Such a citrusy and refreshing delight!", "author": "Kay Ashley M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Based on my one experience here, I would give this place 2.5 stars. The major drawback is that the crêpe they served had been pre-made, sitting there for who knows how long, and was not even warmed up. \n\nConsidering that it was already made, the crêpe still took a long time to make.\n\nI would give this place another try because aside from the cold crêpe that essentially ruined the experience, the ingredients were decent quality.\n\nAside from that though, it was still edible and satisfied a sweet tooth craving! \n\nPerhaps it would be better if you go when there's more turnout so you can get a fresh, hot crêpe.", "author": "Angela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Place is small, but in front of the uptown 6 train entrance, very convenient.\n\nThey have many unique names for their crepes and creations.  You can make you own topping and filling, but I went with the Harajuku cocktail ( Strawberries, almonds, blueberries, raspberries, and some cream).  The crepe was pretty crispy.  It needed a bit more cream, it was a little on the drier side.\n\nSmall seating area infront of the windows and a bench on the wall.  This place is tiny, but I liked their packaging when you take it to go. Almost like eating a burrito, and you peel the wrapper as you go down chopping on the crepe.\n\nThey accept all major credit cards, you swipe sign your name on their ipads.  I would prefer them having some hand sanitizer next to their counter because everyone probably touched that ipad with their dirty fingers..then you have to eat your awesome crepe with a fork...I sometimes prefer my fingers for those crucial moments when needed.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "I happened to pass by on my way to Balthazar and then realizing this place has been on my bookmarks for a while now, heres my chance to come try the place out. Got plans with my girls tonight and needed something for my 4 year old when I have to tell her the heartbreaking news of leaving her home with her dad tonight, this would be perfect.\n\nStore so small you can actually see the crepes made right next to you. I was literally watching the man spread the batter on the griddle with his little T-shaped tool, counting to see if it was 8 turns wondering maybe thats how they got their name, LOL. \n\nAnyways, Kaylen loves berries so I just went for the Mixed Berries Parfait. Raspberries, sliced strawberries, blueberries, yogurt and cream were rolled up in the crepe like a flower, how cute? Oh and topped off with granola just like an actual parfait, they even have to-go bags that their crepes fits right into, just tear the sides and take 'em back out when you're ready to eat.", "author": "Amy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Pricey but you get what you pay for.\nVery large in size I could not finish one.\nVery similar to the ones you would get in Japan. I got the blueberry cheesecake", "author": "Anna Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "First time here today with my sibling. The wait wasn't too long to have your crepe ready. The store was very tight spaced. The service was friendly and you get to watch them make your very crepe. \n\nThere are displays in the store window letting people to see how the crepe looks. However, the actual crepe is a lot smaller than those displays. There is a bench on the inside of the store and on the outside. It's not much of a seating area but considering the size of the store, it's no big deal. On the inside of the store there is a menu above the cash register. It has a large variety of crepes to choose from. They carry savory flavors and sweet flavors which is very considerate. For those who like savory, they can order from that section and same goes for the sweet crepe. \n\nI had the matcha stripe chocolate and it was delicious. It was made fresh, packed with fresh slices of strawberries, and layered with matcha and chocolate on the inside crepe. You can actually taste every individual element contained within the crepe. The crepe itself was very delicious. It was crunchy, fresh, and the form was held nicely. The fillings were delicious. It's not over powered by sugar. The combination worked really well together. It was definitely a hit for me. I highly recommend getting the matcha stripe chocolate crepe.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "After Tokyo's Marion Crepes and Angels Heart, I've been looking forward to tasting the Japanese style crepes here, but I am slightly disappointed. While there were no major flaws in the crepe itself, it didn't bring me back to Shibuya. \n\nMy wait time for a simple strawberry and Nutella crepe was about 15 minutes with only a few orders in front of mine. The crepe itself was made a few minutes in advance so it wasn't as warm and fragrant as I would have liked it. Their homemade nutella was really nothing to boast about, I would have preferred the Nutella brand itself because I found their version to be on the sticky (not smooth) side. Their saving grace was the nice boy who worked the register and i'll call him \"head chef\" because you can clearly tell it was his kitchen as he managed the 2 workers there. \n\nCheck out is easy with a few finger pokes on the iPad.\n\nBottom line: I am willing to try their savory crepe next time but depending on the outcome, I may stick with Vive La Crepe next door.", "author": "Sui B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "One of the most delicious crepes I've ever had!\nFrom savory to sweet crepe options, this place has a multitude of variations to satisfy your snacking needs. You can also add toppings/extras for $1-$3 such as cheese, mushrooms, etc. (on savory crepes) or Pocky, ice cream, nuts, etc. (on sweet crepes).\n\nI ordered the Matcha Stripe Chocolate: a sweet crepe filled with yogurt, matcha sauce, chocolate bits, crushed hazelnuts, and strawberries...I added green tea ice cream. BOOM-- HEAVENLY. The green tea ice cream tasted amazing and the crepe and its components worked so well together.\n\nThey also serve shakes, tea, and La Colombe coffee.\nVery small shop with limited seating- just stop and go.\nI will definitely be back for more!", "author": "Justine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Very small store front but amazing crepes!\nWe waited a while before grabbing a seat along the window. There's also a cute wall that you can have as a background for your pics. \n\nI got the strawberry and banana crepe and I subbed rose petals for the almonds. We didn't have to wait long to get our orders. The crepes were definitely picture worthy. It was also really delicious! The custard was amazing and the fruits were really fresh. The edible rose petals didn't really taste like anything but were a nice touch. \n\nIf I'm ever in that area of NYC in the future, I'll definitely stop by to get a crepe again!", "author": "Jacqueline L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Can't get enough of the crepe's layers, 8 turns! The crepe is freshly made to order so the line can get very long from time to time since it is in the shopping area. The displays of crepes in the front definitely put out a good advertisement for passbyers looking for afternoon sweets or small, savory snacks. Focusing on the sweet crepes, there are many varieties to choose from. My favorite is Harajuku Fruit Cocktail. Most of the crepes include fresh fruits such as mango, strawberries, banana, blueberries (basically just named all the fruits in Harajuku), etc. It makes you feel like you are getting your fruit intake of the day while enjoying sweets. The cream in the crepe accompanies so well with the ice cream and fruits. Overall, 8-turn crepes are fantastic for a grab and go while shopping.", "author": "Diane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Nothing can go wrong if you add green tea ice cream on top! I got the Azuki Berry so it already came with it. Cute shop but it's REALLY small, so you basically have to come get it and go with this place. \n\nThey had an array of flavors that sounded really good- sweet and savoury! When I come back I'd definitely want to try a savoury crepe, but that may be hard considering how good my crepe was. I hate how soggy it gets though.", "author": "Vivian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I was in the area and was waiting for my boyfriend to pick me up since it was pouring outside. I happened to remember there was a crepe place around the area and decided to stop by to wait for my boyfriend. This time around, I ordered the Harajuku Fruit Cocktail. YUMMS! It had strawberries, blueberries, raspberries, mango, bananas, whipped yogurt, custard cream, and almonds. They had all the fruits I liked in one crepe! How awesome :D \n\nAs I expected, the crepe was amazing! When I took my fruit bite, the crepe was still crunchy! Although it did get softer as I was eating the crepe.. that did not bother me because the crepe was so great. I couldn't finish the entire crepe so I saved the rest for my boyfriend. I will definitely come back again and try the other choices ;)", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "3.5 stars.\n\nCame here with my friend for dessert after going to Sushi Yasaka (no they are nowhere near each other but we are 2 crazy people who are willing to travel long distances for food we're craving lol). This place is a hole in the wall! There's only a bench for 2 and 2 stools inside. Luckily, 2 people just left when we got there so we were able to snag seats at the bench. Service was friendly and efficient.\n\nMatcha stripe chocolate- I believe this is their most popular crepe so I knew I had to try it out. I thought it was ok. I got mine with green tea ice cream, which I thought tasted great and went very well along with the strawberry and banana pieces. The custard cream was good but it was the yogurt that really appealed to my taste buds! The crushed pistachios added a nice crunch to the crepe. The chocolate truffles and chocolate sauce added a fair amount of sweetness to the crepe.\n\nThe crepe, with the addition of the ice cream scoop, ended up being ~$10, which I would say is standard at famous crepe places like these. I was definitely more than full after eating one whole crepe! Maybe it's just a matter of preference, since I'm not a big fan of crepes or chocolate desserts in general, that I only gave Eight Turn Crepe 3.5 stars. But please note that it is not bad at all. If you like crepes, definitely give this place a try if you're in the area!", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "First time visiting this little joint and I haven't had such a fun crepe in so long!\nThe store itself is very small and barely fits around 6 people standing, and maybe few people sitting. They have a bunch of crepes displayed in their window which was very useful because they are pretty close to the real thing.\n\nI was debating over lox crepe or the shrimp avocado. The guy was very friendly and helpful although they were very very busy! I ended up picking the shrimp avocado because he told me that if its my first time I should go for that!\n\nThe crepe was crispy and very refreshing! The shrimps were crunchy and the sweet and slightly sour with a nice tang. My boyfriend who who was in a bad mood couldn't resist it either. Definitely recommend stopping by for crepe togo when the area!", "author": "Emily Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Came here for a quick bite while my friends and I were waiting for a table to open up at Ippudo. I didn't have breakfast, so I was really craving some food. We originally tried to go to Central Perks, but it turns out that it was closed or it moved or something because there was no sign of a Central Perks nearby. We ended up yelping a cafe because none of us knew the area well. Up popped Ceci-Cela. Onwards we go! We were almost headed inside when we saw people with these delicious looking crepes right outside the door. The guy could totally tell we were staring at his crepe and he told us to give Eight Turn Crepe a try. That's how we ended up at this place.\n\nAutomatic downside, it's a small place. Barely any sitting room. It's more of a grab and go place. Plus, the lights were flickering on and off the entire time we were there, which doesn't really add to the ambiance. Anyway, since we were headed to lunch soon, we didn't want to fill up on crepes, so my friend and I split one. We ordered the Strawberry Banana crepe. It was ready within a couple of minutes, but we had to step outside to eat it. The place was getting really crowded. \n\nThe crepe was delicious and fresh. There was cream or yogurt, but it wasn't too overwhelming. Usually when I have cream in my crepes, I feel heavy afterwards. But this cream was very light and I didn't get that feeling afterwards. I was okay with the packaging. It reminded me of hot pockets. You had to rip off the paper as you were eating.\n\nOverall, had a great experience and I'll definitely be back soon!", "author": "May C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Small cozy hole in the wall. Do not expect to sit in here and eat your crepe. Take that shit outside and walk because there is not enough room.\nI got the banana nut chocolate crepe and added in strawberries. It was pretty darn amazing. The crepe was thin and all the ingredients were fresh. I would love to go back and try one of the savory crepes or another sweet crepe!", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "These crepes were the bomb! Crispy, thin, crunchy edges with soft delicious insides. Fruit filling on the lychee valentine was on point- edible rose petals and all. Just the right amount of exotic and familiar and delicious all rolled into one fantastic crepe.", "author": "Sharon S."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}