{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Good? Yes. Great? Not really. I thought this place was just A-OK. I tried one of their savory crepes as opposed to their sweet ones, so maybe that's why I wasn't blown away. Didn't help that whatever was inside my crepe was really runny and got all over my coat and pants. Perhaps my opinion will change during my next visit?", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "My goodness. Came here on a whim because needed to kill some time. Small place and has the potential to get packed fast because there are only 3 seats by the window. But was absolutely delicious. The variety of crepes, the quality of the food and the freshness was really something that makes me want to go back soon.\n\nTry the crepe dog. Highly recommend it! They make it easy to eat while you're there or take it on the go. Great presentation.", "author": "Nelvin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Watching your meal being created in front of you was like watching art come to life. Very friendly and was willing to offer suggestions. We had the Truffled Egg white crepe and added bacon, and the Banana Nut crepe. Wonderful! \n\nThere's no place to sit except a single stool or a short bench. Eating on the run or taking with you is going to be the trick. Don't miss this if you're in Soho though.", "author": "Wes M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Really good crepes. They make the best crepes i've ever tasted.\nI love all their sweet crepes, especially the Lychee Valentine and Matcha Stirpe (less sweet). \n\nI can't wait to come back for more crepes after my afternoon of shopping in Soho.\nIt's a very small space, so try not to linger around in the store and in front of it. Just order, get your food, and get out!", "author": "Michelle X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "I've been here three times and I have to admit, they taste differently every time I go. Don't get me wrong, everything on their menu are arguably delicious, but I wish they were consistent with the way they make their crepes. I ordered the Azuki dessert crepe the first time I went and I loved how the cone came out flakey and thin. On my second visit, the batter was a bit burnt, and on my third it came out like a pancake. Not happy. But other than the crepe itself, the dessert crepes overall are worth trying. They stuff the heck out of the crepes with icecream and toppings.", "author": "Donna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Yumyum! So incredibly satisfying. \nThe place itself is rather small, and when I went, it was crowded to the point where at least one person would be hit by the door when it opened. Definitely designed for takeout.  \nI ordered the shrimp and avocado, described in the menu as \"the minimalist's summertime/anytime favorite\". Thank you, accurate menu, for guiding me toward a savory treat that was light and fresh and indeed very suited for summer. I look forward to heading back and trying something new!", "author": "Zara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-30", "description": "I do feel bad for the Viva le Crepe not far from this place.  But they serve different types of crepe.  This one is the more Japanese-style crepe with a good selection of both savory and sweet crepes.  It can be a 5-10min wait depending on how busy it gets, but usually the crepe is good.  Besides being a bit slow, it's a pretty good spot to grab a crepe for a snack or a very small meal.\n\nI do recommend the truffle egg white omelet for savory and pretty much any of the sweets since I have a sweet tooth.  But I'm usually tempted to get the Lychee Valentine or the Chocolate Nut Party.", "author": "Jackie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-26", "description": "This isn't what it claims to be (japanese crepes). However, it is a failed attempt. I am very picky with crepes and will say that just 3 doors down -- hehe, yes 3 doors down like the band -- you can eat in vive le crepe and it would do more justice. \n\nThe crepes here are overpriced, which is understandable, as it is soho noho etc. However, the crepes are too oily and not super thing and flexy as authentic japanese crepes. They are pretty small in size and you can notice they don't even spread the batter to fill the crepe machine plate. \n\nThere were customers seeming displeased with their order missing items that should come with and we're told it does not. That was my first and last experience here, but I will continue to search for the ultimate crepe place.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "This place is average at best. I was expecting a lot since I saw all the pretty Instagram pictures on their Facebook. I was fooled... \n\nTheir crepes are like pretty bouquets that don't taste that great. I wanted to like this place so badly since I love crepes as desserts. I saw the lady make my crepe and she put about 1/4 of the ingredients I expected her to. The crepe was hard to eat and not filling. They're nothing outstanding for $12.", "author": "Lianne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "These crepes are so amazing.  The crepe is crispy and slightly chewy with just the right the thickness, and the toppings are fresh and just amazing. They have both sweet and savory crepes, but I of course got on of the sweet crepes. I got the Azuki Berries, which came with cream, matcha cream, sliced strawberries, a scoop of green tea ice cream, and two chocolate Pocky sticks, with a crown of adzuki beans. The whole thing was so beautiful to look at, but even tastier to eat. The crepes and creams were perfectly sweet, not too much but not too little.  My friend had the Chicken Teriyaki crepe, and she said hers was amazing too. \n\nNext time I want to get the Matcha Stripe Chocolate, Chocolate Nut Party, Lychee Valentine, oh who am I kidding I really just want to try them all. This place is really small, so it can get crowded. It's worth it though, I swear!", "author": "Melanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "This store provides a variety choices of crepes with plenty of combinations. Crepe sizes are big and taste delicious. However, the ice cream is not as good as you can get from an ice cream store.", "author": "Vivian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "I've been here twice, once the weekend they opened, and once the following week. I plan to be going back whenever I get the chance.\n\nI'm in love with the Eight Turn Lox Crepe; it has spinach, lox, cream cheese, onions, and capers, and it's delicious. I'm one of those folks who kind of insists that lox is for bagels, and putting it in a crepe just seemed wrong, but it's unbelievably delicious. The crepe itself is part of what makes it so good: some crepes taste kind of doughy, like a thin, disappointing pancake, but whatever they do to make them here, they're light, fresh, and maybe just a little bit sweet.\n\nA friend of mine had one of the desserty crepes, which he says was good, but I think I'll be looking into the more salady ones in the future. Only it's better than salad. Much better.\n\nAlso had the yuzuade, or yuzulade, or whatever they call it. It was decent tasting, but the taste is a bit too mild for an ade-style drink, and the pieces of rind clog the straw. I'll have to see what else they offer to see if any other drinks are worth it.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "PERFECT\nDelicious and incredibly fast and friendly service \nThe crepes are made with rice flour so naturally gluten free!\nAwesome find", "author": "Sheida K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "The best crepe ever! I got matcha and chocolate crepe. It had a lot of stuff wrapped by crepe layers and taste awesome. I ll try savory taste next time. The only shortage is that the place is very small. Might be hard to find a seat since there are only 4 seats inside....", "author": "Yuqing L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "It was really great to have a Japanese style KOMEKO (rice flour) Crepe in the city!\nThe store itself is very very small but the staff is very very nice.\nPrice is bit too high but it worth to try it.\n\nI did try \"Green-tea berry\" and iced milk tea togo.\nOnce we received milk tea and waited for a crepe will come at the outside of the store, one of the staff came out and gave us the another milk tea.\nMe and my husband had no-idea why she made a new milk tea for us but she explain for us the she put the green tea powder in the milk tea we already had by mistake but we didn't even recognized.\nShe politely apologized and gave us another one.\nIt was really nice!\n\nCrepe itself was really really good!!!\nflesh made crepe, taste just fresh as it should be.\nI'd love to come back to have another tasty crepes!!!", "author": "Seiko F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Is it the best crepe I have had in the city most probably it's Asian style crepe. My problem with most crepe places is that it's usually wayyyy too sweet esp when it comes to flavors like Nutella or dulce de leche. I have tried a sweet (Matcha one) and savory (shrimp) crepe here so far and I like both are pretty good. I rmb the savory one to be a little more saucy than would I prefer but still pretty good. Not super pricey considering it's quality and location at soho.", "author": "Riyao Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Eight Turn Crepe transports you to Harajuku, Japan with their Japanese rice crepes. The crepes are golden, airy light, sweet, and have layers filled with deliciousness! You can choose sweet or savory, both are the way to go! I really like that the ingredients are evenly distributed in the crepe and they package the crepe in a wrapper that allows you to unwrap as you nom your way down. Sometimes I wish they would provide more ingredients in their crepes which tempts me to buy another one! Yes, it's that good! \n\nIf you are in the mood for savory, try the eight turn lox with avocado! If you want sweet, definitely get azuki berries (match icecream and pocky sticks included)!\n\nI just found out they deliver. I would totally abuse that if I lived in the city!!", "author": "Hanna P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "So , I was so excited to come and taste their crêpes because I heard so many times about this spot .\nThe guy that was making the crepes was looking not clean at all and his pants were saggy .A lil bit too much for your work place .. \n\nAnd as far as how the crepes were I was very dissapointed .A real crepe,despite the fruits you can add to it or nuts it has to have a cream,jelly,sauce ,etc . This one had custard cream which I didnt feel,not one bit . So without cream the crepe feels dry \nThe crepe had no flavour at all ,just dough \"flavour\", no lemon scent or something ,and it wasnt fluffy ..I couldnt finish it of how dry it felt and tasteless.All I could taste were the strawberries and a bunch of almonds....", "author": "Anelisse W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "the crepes are fantastic and nicely displayed! I got the berry bean one with green tea ice cream. so yummy! the only downfall about this place is that it's so cramped and tiny, so if you're expecting a sit down eat in, this will not be the place.", "author": "Sharena C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Stumbled upon this place while walking around with my girlfriend one day and finally got around to trying it! It's a small place, but you can't miss the AWESOME display of the crepes. That's what caught my attention at first and I was like OMGGG, I WANTTTT! Get the fuck in my tummy. \n\nI have a sweet tooth so I got the azuki berries and it was soooo good. It was gone in no time...it was just THAT good. OR maybe I was hungry (; the green tea ice cream was amazing though. One of the best green tea ice cream I've tasted. I could actually taste the green tea and it wasn't sweet like most green tea ice cream. THAT STRONGNESS.\n\nMy girlfriend chose the savory shrimp avocado with truffle mushrooms and boy, did she enjoy it. I had a bite of it and it was like a food orgasm in my mouth. I can't imagine how it felt for my girlfriend when she tried it..probably just exploded in her mouth. I never really had a savory crepe so it was something new for me. \n\nThe only thing that disappointed me was that the person working there forgot/missed my order hence the 4 stars. Everyone else who ordered after me got theirs before me. I had to wait like 30 minutes and my girlfriend was basically done eating her crepe by the time I got mine. They apologized and offered  me a drink, but I just wanted my crepe. I know it happens, but the guy who was in charge of my order didn't even apologize. The other two people had to apologize for him. \n \nANYWAY, we're definitely going to come back here some time. I think I'll go for a savory crepe next time and I just hope they don't forget my order!!! DEFINITELY TRY THIS PLACE!", "author": "Yuki B."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}