{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "Best savory crepe I have ever had in the US.. so so so so so so so good!  I got the truffle egg white, spinach mushroom, cheddar crepe, and it was to die for.  Service was great too.  I will probably be back at least 3x a week.. incredible.", "author": "Nikki D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "The crepes here are so freaking DELICIOUS,and there gluten free so good and smells AWESOME IN HERE,haven't tried the dessert ones yet,but I will next time.", "author": "Jackie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Hands down The Most Delicious crepe ever. I had the Chicken Teriyaki and it was to die for!!  Everything looked delicious and I wish I could have tasted all of them!!", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Great little spot. Staff was very friendly and had me in and out in no time. Great selection and the banana crepe was amazing. Would recommend it if you're in the area. Will have to stop back in and try some of the other crepes on the menu.", "author": "Tana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Lychee Valentine was great. Nice and light didn't leave us feeling like we overindulged on sweets. Only reason why I gave it one less start was because of the cost. Although it was delicious, it was also pricey. Everything good comes at a price.", "author": "D C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "This place is really adorable! I got the shrimp and avocado crepe and it was really cute. A wee bit difficult to eat but definitely tasty. It had this yummy wasabi tofu mayo in it which had a real kick. Id like to go back and try a dessert crepe soon!", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "One of the best creperies in all of NYC already, and they just opened up recently!\n\nThey have something for everybody! If you love savory crepes, they have them! If you have more of a sweet tooth, don't worry, you guys are covered as well!\n\nMany choices, great quality, and a friendly and helpful staff!!\n\nA big win for residents of the greater New York area!", "author": "Ari G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "The best Japanese crepe I have ever had in the city. Their toppings are very rich and juicy enough to full you up. Don't suggest to add the ice-cream scoop unless you eat it fast enough, otherwise when it melts you will make a big mess and destroy the crispiness of the shell. That is a very small spot and they only have a few chairs, therefore don't suggest you to go there during the winter time unless you can sit in your car.", "author": "Raven K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "This place was spectacular. All of these crepes are made with rice flour which means they are gluten free! (though you'd never guess from the light and fluffy taste). According to the nice woman behind the counter all of the sweet crepes are gluten free. The savory crepes may have a soy sauce dressing so be sure to ask about that. As I understood it, if you are gluten intolerant like me, you are in the clear here as long as you get something with no sauce involved. She said they are working on getting a good tasting gluten free sauce substitute so double check with you server.\n\nThe only down side is that it is super tiny. There's a few benches outside but when it started to rain I had to hurry off. Also, if you get them to-go you get cute little crepe shaped bags.", "author": "Gabe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "My gluten free friend was very happy that she could finally eat crepes. Never had rice flour crepes until now and it was delicious. Would love to go back to try their sweet crepes - they looked rather scrumptious!", "author": "Cody L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Awesome place...different kinds of creperies ..each and everyone is best....oneof the best food in New York which nobody should miss....it doesn't have a dining place...its small too in size bit the taste wins everything...amazing style and taste and price", "author": "Ankita V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Cute little place! I've been there twice and both were good experiences for me. The Matcha Stripes Chocolate was great, but would have been even better with ice cream (which seemed too expensive to me). I would go again a few times, but to me, it's too heavy and filling as a dessert.", "author": "Luo Qi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "The crepe that i ordered was delicious but the half hour wait was not. Also, the service forgot to mention that the addition of ice-cream costs another four dollars. The service asked me \"what flavor would you like,\" instead of \"would you like ice-cream? its an additional 4 dollars.\" overall it more hyped up than it is worth.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Lychee Valentine is very good, although the crepe is a little soggy than what you'd have in Japan, i am still very happy with it!!", "author": "cy c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Reminds me of the famous creperie in famous harajuku! We came here after a huge meal at Robata-ya but couldn't resist sharing a banana Nutella crepe with a big scoop of vanilla ice cream from il laboratorio de gelato (sp??). This place boasted using rice flour with a unique way of folding the crepe, and I felt like it really made a difference! The outside of the crepe itself was crispier than usual and there was filling in each layer of the crepe instead of all bunched in the middle. The banana Nutella was delicious with some chocolate truffle and nuts mixed inside for texture and added richness. This place is a great snack/dessert spot!", "author": "Joyce H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "get the lychee valentine!  we've been here a couple of times and my girlfriend enjoys that sweet crepe.  i got a savory one which was pretty decent too.", "author": "Chau N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Always good, no matter the crepe. They did sort of forget my order so I had to wait even longer. But they were really apologetic and seriously busy. Store is a bit tiny but definitely feel it was better than viva crepe next door.", "author": "Sue K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "very nice service! The girl recommend me the mocha stripe chocolate plus green tea ice cream. It tastes so delicious! I like so so so that green tea. On balance I think it is a bit expensive.", "author": "Lingling D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "I told T there was a new crepe place by Cece Cela and T was like that crepe place been there for years.\n\nI said, no they have competition now, since another one just opened two doors down from them.\n\nThis one has an Asian flair and so I peaked A's interest and we went for lunch just to prove to T that there is another crepe place.\n\nA got the Chicken Teriyaki - A said it was good.\n\nI got the Azuki Berry - although I haven't ate lunch yet, I wanted to try a sweet than a savory or salad version.\nI really love my Azuki Berry - you can tell the azuki are made fresh and not a paste or is it from a can. It has green tea ice cream and it was really good.\nI also got two sticks of Pocky that came with my choice.\n\nI seriously, love the packaging here - too cute. Perfectly perforated wrapping and cute little baggies to travel when you're on the go.\n\nThey entice people with their faux crepes out in the storefront - cute idea.\n\nMatcha Latte - good\n\nYuzulade - I was super excited about this drink, since I am a total Yuzu fan. However, I think the bits of rind they put inside the drink makes it on the bitter side. I think they need to recalculate the yuzu with the rind.\n\nRoyal Milk Tea - this was decent\n\nI would definitely come back for their crepes, perhaps a savory one next time.\n\nHowever, the drinks needs some work and not to mention their system, since they need to work out their kinks. It took forever to get my Yuzulade, seriously FOREVER and all they needed to do was scoop it out of the plastic container.\n\nEveryone was nice and friendly though.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "My girlfriend and I went on a day trip to NYC recently and went completely out of our way to come here, and wow are we glad we did! The crepes were very unique and flavorful. The building is extremely cramped, so don't go in if you're claustrophobic or looking for seating, but it's totally worth it for the deliciousness you're bound to experience.", "author": "Riley B."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}