{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-06", "description": "My friend was raving about this place so we stopped by after a few drinks. \n\nUnfortunately I won't be returning. I just got a regular banana and nutella crepe. The crepe itself was weird, had a taste I didn't like and the texture was not my thing. I also found it weird that it was right next to another crepe spot which I need to try as well.\n\nBtw this place is pretty small but they have a small bench outside to eat on and i believe like 1 tiny table inside?", "author": "Francine Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "Eight words for Eight Turn Crepe: SO. MELT. IN. YOUR. MOUTH. AH. MA. ZING. Great to warm up on a cold day with a matcha latte, which pairs well with the Harajuku fruit cocktail. Note to the wise though - if you get the fruit cocktail crepe, add some chocolate drizzle on top! I wish I'd done it, and I'm sure it would have completed the whole experience. \n\nOther notes to amount for preferences:\n1) The crepe skin is on the thicker side.\n2) Matcha latte is not as sweet as you would expect.", "author": "Joyce C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "This place was awesome. They have a wide variety of toppings and everything taste fresh. Going here totally added to my first New York experience. Definitely worth your time to stop by. Don't let the long line full you because these people shoot these suckers out assembly line style. Loooooved it!!!", "author": "Angelica E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "I like this place! Drawn in from the displays on the outside, I had to try it! I got the green tea azuka berries. The presentation was very nice, but I wish that there was a little more ingredients in it, after eating the Icecream part, there wasn't much left to go with the crepe. The flavors though were all there and quite delicious. \n\nLike some other people mentioned, it may be a little hard to eat because of the cone shape. Definitely will be some mess, so take some napkins! And look for the paypal deal online.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "I came here for a quick bite before heading to catch a movie for the Tribeca film festival. One of my friends love this place so I figured I'd give it a try. \n\nThis place is super tiny. Definitely not a sit down kind of place. Luckily we went when it was completely empty and that means all 4 seats that they have were open. \n\nI ordered the azuki berries crepe and my friend had the chicken teriyaki. I have to admit the presentation looks very appetizing and appealing. I ordered my crepe cuz I really wanted some ice cream. The parts that I had with the ice cream was quite delicious but by the time I had finished all the ice cream, it was just crepe left. I wasn't really amazed with the leftovers. I mean it was fine cuz the crepe was quite fluffy but really dry. I think i'll have my crepes on a plate with a knife and fork in the future. The cone shape makes it kind of difficult to eat. \n\nI'm glad I got to try it just to say I've been but I don't know if I'd return.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Delicious crepa ever I recommend everybody to go and experience this delicious food, especially if you want to feel happy, this will make you smile.", "author": "Norma B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "Do they still even exist anymore? :( The store appears to be shut down every single time I go.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Had the Eight Turn Lox and it was delicious. The lox was perfectly flavored and fresh, and it was complimented by a nice amount of spinach and cream cheese. The crepe was excellent and I loved the concept. Will come here again.", "author": "Katherine Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Tasty, fun, really friendly staff that makes you feel good just coming in. The crepe is really well presented. I have tried the lox crepe and the shrimp. \n\nCould use a little more food in the crepe, was a bit light and not filling enough.", "author": "Keith A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Stopped by on a random rainy Thursday night to pick up a little crepe snack! The storefront is quite small but welcoming and there were a healthy amount of people in the store waiting to order.\n\nThe girl in the front is super sweet and knowledgeable - willing and ready to share her love for Eight Turn Crepe with any and everyone! I ordered a Turkey crepe because I was looking for something a bit more savory. Apparently the shrimp/avocado crepe is quite popular.\n\nThe open kitchen allows you to see your own crepe being made from start to finish. I probably only waited ~3minutes for my crepe. The to-go plastic packaging is adorbzz.. it comes with its own little handle! \n\nMy turkey crepe was nicely sized for a small dinner. You can distinctly tell the difference with the rice flour they use; makes for a slightly chewier crepe. The innards were full with turkey, cranberry, and asparagus. Nice and hearty, and the price hovered around $9.50. A little pricey but not too bad. Looking forward to trying out their sweet crepes!", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "I heard about a new crepe place by work, and had to go and try it out. I checked out their menu online prior and was instantly in love. According to their website, they are originally from Tokyo-Japan and that they use rice flours which are healthier for the body than regular flour. \n\nI went with a co-worker after work, and I got the Harajuku Fruit Cocktail Crepe, and it was so pretty and yummy. What I like the most about the crepe was the custard cream that was used with the crepe. The person who was making my crepe was very generous and also detailed orientated. The crepe looked almost exactly like the picture and with every bite; I was able to taste the different layers of stuffings inside. LOVE!\n\nThe cashier is a little weird, but a nice guy, I wanted to know where the store was in Tokyo, and he told me he dunno...(In my head- I was like WTF? Don't you work here? ) Then the lady behind him yelled out quickly and said it was in Ginza, and I was like oh...\n\nAnywho..i would love to try all the other crepes on the menu, they all look yummy!\n\nNote: Depending on who is making your crepe, your crepe may taste and look differently..the second time that i went, the crepe wasnt done as well as the first time..hopefully i will get the same detailed oriented person to make mine again..", "author": "Ginny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "My favorite crepe place in NYC.\n\nGood sized portions and lots of flavours to choose from. The crepe is thin and crispy, and they stuff it full of ingredients. Only negative is that there's a bit of a wait if the store is busy (which it usually is). Service was good too, the people there are friendly :)", "author": "Louise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Absolutely amazing! Extremely friendly staff, very small space but big flavors!\n\nI got the Chicken Thai, amazing! Definitely will be going back for more.", "author": "Connie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Due to the fact that I has never previously eaten a crepe before, I was fairly excited about this place when visiting SoHo.  It's on a quiet street with no seating except for two lucky people who snatch the stools inside, but they wrap your crepe up like an ice cream cone so it works out as a portable (and delicious) meal as you sightsee!\n     The only reason I give this place four stars instead of five is because of the prices, as it is this way at most New York City eateries.  10.75 for my crepe, which was indeed delicious, but also pretty small. It did not fully satisfy my hunger, and I certainly had no plans of spending another 10.75 to fill my stomach.  Think of this place as more of a snack, not a full meal as I was expecting!", "author": "Mikayla R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "I passed this place while visiting the city over the summer. I was with friends and didn't have a chance to stop, but I made it a point to on my second trip! The shop itself is super tiny, only enough room to grab and go pretty much. There is a bench and a counter with 2 or 3 chairs. It's really not a problem because these crepes are super easy to carry with you! \n\nI decided to go with the sweet flavor this time. It was so good! Bananas, chocolate, nuts, yogurt, and ice cream on top! There were also two little pocky sticks inside. \n\nI will definitely be back. I can't wait to try the savory kind!", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "I went the first time when they had a paypal promotion and got the thai chicken salad crepe. It was out of this world. Seriously. It was one of the best things I had had in a long time (and I don't even like salad)! I loved it so much that I went back 2 weeks later to get another one. \n\n:(\n\nI don't know what happened. Maybe they were on their A game the first time I went because of the promotion, or maybe the second time I went was just an anomaly, but something was up. I ordered the exact same thing (the thai chicken salad crepe) but it was really lackluster this time. The chicken wasn't as flavorful, the truffle sauce was almost nonexistent, and it was just all around disappointing. Not so bad that I couldn't eat it, but just disappointing after the excellence that was my first crepe. I haven't been back since. My first crepe was worth the $9. The second wasn't. \n\nI've been thinking about going back to try some of their dessert crepes, because I feel like those will be good no matter what. I just wish my thai chicken salad crepe had been more consistent.", "author": "Arielle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I love this spot! Very different way of crepe presentation! \n\nI ordered the Azuku Berry crepe which had berries, chocolate, green tea ice cream and pocky! Very tasty and not too sweet which I enjoyed til the end. \n\nMy experience with crepes get messy, but the way these crepes are made- in a cone like presentation was actually really easy to eat. \n\nDefinitely will come back!", "author": "Kristol M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Legit crepes. Despite knowing the high reviews this place has gotten, I was still thoroughly impressed with it. I spontaneously decided to drop by for a dessert crepe since I was passing by and I've been wanting to go for a pretty long time. \n\nMy friend and I shared the Matcha Striped Chocolate crepe, and we both could not get enough. They seriously stuff it with toppings so you're definitely getting your money's worth. The matcha and chocolate was an amazing combination that just blended luxuriously with each bite. The amount of fruits balanced out the chocolate, and even though there were blocks of chocolate in the crepe, I was surprised that the crepe was not too sweet at all. Usually with desserts, you can get nauseated quickly with the amount of sugar just coating the inside of your mouth, but with this crepe, you don't reach that point. With each bite, I was astounded at how delicious it was. There are crushed peanuts to give the dessert it's crunch factor. There's also whipped cream to balance out the chocolate. The point is, this crepe is just filled with every possible great topping a good crepe should have. The crepe itself is made with 100% rice flour so the texture isn't like that of your typical soft crepe. It's between soft and crunchy. It's perfect. \n\nThe place is very small. There's probably seats for about four people, so if you're choosing a busy time to go, most likely you'll be eating your crepe outside of taking it to go.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Pretty good for a growing business. Decided to see what the hype was all about and gave it a try. Everything is freshly made to order. I had the harujuku crepe with green tea ice cream.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Me and a friend went here for lunch a couple months ago. I was drawn to the fact that their crepes are gluten-free, and their crepe menu looked inventive and original.\n\nWe shared the Chicken Thai and a Lychee Valentine crepe.\n\nAbsolutely amazing. Couldn't tell the crepes were gluten free, and the combination of flavor and texture was brilliant. I can't wait to go again next time I'm nearby!", "author": "Bryn C."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}