{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Recommend Harajuku Fruit Cocktail, won't be too sweet. So many girls wait and matcha strip is very popular, too.", "author": "Yikai L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "While working in Soho and only having 30 minutes to grab something to eat, I went to Eight turn crepe. I ordered the Chicken Thai which was good in flavor but as it was very saucy it became messy, very quickly. It also took 15 minutes to prepare (that's half my break! AND I was the only one there!) As the crepe is round in a cone and not flat by tradition, it was kind of difficult to eat. Each time I squeezed, the sauce escaped from the bottom. By the time I reached the end the dough was soaked and not enjoyable to eat. I haven't gone back as I've tried other places and favor them best.\n\nAlso, I don't believe you get your money's worth here. I spent $15 for a long wait time and soaked dough. This should definitely be changed to '$$' and not be displayed as '$'.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "I love their crépes, but the one time I came here, I waited for my crépe for about 30 minutes. The guy didn't even ask me why I was standing there for so long. It turns out that some other customer took my order while his sat there for the longest time.", "author": "Iana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "This is a little taste of Tokyo in New York. Absolutely amazing. If you have ever been to the lovely city of Tokyo and picked up a crepe in Harajuku then you know exactly what to expect. \n\nEnjoy.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Always great to be here. I like the sweet crepes. Got the banana chocolate crepe with ice-cream. Too large for me to finish so my husband finished the work for me.", "author": "Shirin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "The display really drags you in like an unsuspecting insect taken in by a venus fly trap. In either case, lots of good eating is happening.\n\nFor $9 - Chicken Thai Salad Crepe. Solid cone shape holding in a variety of ingredients, with good chunks of chicken, lettuce, and cucumbers. I was worried the whole thing might be too dry without enough dressing, but somehow it all balanced out very well. \n\nThankfully it was a nice day outside because there is NO room to eat in there (even if you find a seat the crowd waiting to get the food makes it too cramped to move). \n\nThis might get five stars if the dessert crepes are out of this world when I come back.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Hope the place size can be bigger, but the crepe is awesome and it's definitely cool enough for couples to hang out!", "author": "Sijia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Cute little spot located in Nolita.  I love that this location is right next to the subway... as soon as I get off the 6 train, I'm right there in front of Eight Turn Crepe on Spring St. \n\nA little crisp, golden, chewy crepe is filled with your choice of ingredients. Whether you want a dessert crepe or a meal crepe, they have such a great variety of crepes!   Whats great about these Japanese crepes is that you're able to hold them like an ice cream cone... so its easy to take to go. I especially love their simple banana and strawberry crepe. I have yet to try one of their savory crepes, they all look amazing!\n\nIt's hard to turn this place away, their display window showcases many of their sample crepes. Its temptation you won't regret!", "author": "Jen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "Amazing crepes!!! Thankfully not too oily because I'm not ready to have a heart attack, lol.  Their crepes are fluffier \u0026 slightly thicker than the usual French version. Their crepes may look small when you get it but trust me, it's the perfect size to hit the spot. Regardless of what what kind you get, I guarantee you'll enjoy it.\n\nI met up with a friend here and she ordered the chicken teriyaki while I ordered the truffle egg whites with avocado. She lived the crepe do much, she came back the next day to buy one for her mom, haha. Mine was so friggen good. I'm so glad I was introduced to Eight Turn Crepe at a Yelp Elite event. The truffle egg whites were fluffy \u0026 soft like perfect little clouds ready to burst in your mouth. The avocado I added in there gave it the right amount of creaminess. It was also perfectly ripe and not too hard. The truffle oil added just the right amount of flavor \u0026 seasoning that I needed. Another great thing is that they wrap their crepes in this paper funnel that you can tear as you continue eating. Saves you a lot of hassle!\n\nThis place is a walk-in with very little seats so just be ready to grab \u0026 go. They take credit cards so another +1!", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "I'm confused by this place. The crepes seem to be made to order but mine was served ICE cold, as though it had just come out of a refrigerator. I had the smoked salmon savory crepe. The flavors were delicious, but I really would have preferred if the crepe was hot and crispy. It also took more than 10 minutes to make 2 crepes and there was no one else waiting. This place could be SO much better.", "author": "Shana O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "I had the strawberry and banana crepe and also a bite of the one with lychee. I liked the former much better and also added a scoop of green tea ice cream to it. The crepes are made to order in front of you.\n\nIt did take awhile to get our order and they didn't have a very good system for a place that gets pretty packed. They almost gave my order to someone else with a similar order. \n\nOther than that I definitely recommend trying it. It's one of the better hand held crepe places I have been to and they offer savory crepes as well!", "author": "Hai Yen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "I like this place. They have a lot of different varieties of sweet or savory crepes! So far my favorite is the Strawberry \u0026 Banana, but I'm still getting around all of the different varieties!lol If your ever in Soho/Noho you should definitely stop by. Only con is that it's a very tiny spot!", "author": "Winiffer D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "I was pretty excited to visit Eight Turn Crepe after seeing so many great reviews about this place. My experience wasn't great, but it wasn't bad either. \n\nI ordered the Chicken Thai crepe. It was quite different than the crepes I had in Harajuku Street in Japan. \n\nWhat's great about the crepe is that it's thin and cone shaped. What I dislike about the crepe is that it didn't deliver the crispiness I was expecting out of a Japanese crepe. I would hear the crunch from every bite from the crepes in Japan. The crepes from Eight Turn Crepe are far from crispy. The crepes in Japan had a lot of sauce. As for this Chicken Thai crepe, instead of it having a lot of sauce, it had a light drizzle of sauce, making the crepe a lot drier than expected. \n\nAside from the Japanese comparison, the crepe was a little on the spicy side. The sauce was delicious, but I wish they gave more sauce. White meat chicken is dry, so I wish they would add more sauce to make up the dryness. \n\nI also ordered the royal milk tea. It tasted great.\n\nWould I recommend this place? Yes, if you haven't eaten the crepes in Japan. Because if you can't compare these crepes to something better, you will think these crepes are awesome. Would I go back? Maybe not. I'm not sure if spending a total of about $15 on a crepe and drink is worth it, especially after paying only about $4 for a crepe in Japan (compared to spending $8-9 on a crepe from Eight Turn Crepe).", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "I got the lychee valentine crepe. The name of this crepe was interesting but the crepe itself did not lead up to the expectation of the name. The presentation of the crepe was not done well, and looked nothing like the display picture. The menu states there will be edible rose petals in the crepe, and as you can see from my picture there isn't a sight of any. The crepe was too soft so it tasted a bit soggy to me. It did not taste like anything special, it just tasted like canned lychee, so the crepe is not worth it for the price. I recommend the strawberry and banana crepe.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "These crepes are magical...UGH just writing this review is giving me a craving. Eight Turn Crepe, what have you done to me..? I'm pretty sure my standard for crepes has increased eight-fold (get it, like the name of the place? Har har, I think my craving is getting to my brain, sorry) after eating here. :9\n\nConveniently located via subway, Eight Turn Crepe is kinda like a hole-in-the wall. There's one bench outside and one inside, but pretty much only enough space to order at the counter and gawk at the realistic crepe molds that decorate the window. The elderly lady at the counter is lovely, patient, and happy to take your order, and seemed willing to point you in the right direction if you've having trouble deciding. Which is highly likely, given that every option seemed delectable.\n\nI ordered the savory eight turn lox (salmon, cream cheese, spinach, red onion slices, capers), my bf got the chicken teriyaki (I think, it was definitely something chicken-based), and my friend got a sweet crepe with strawberries and lots of cream. All our crepes were prepared really quickly - you can see the staff make them using their fancy crepe pan right behind the counter. I really, really enjoyed mine - it was a great way to start the day. Crepe is light and chewy but also pretty crispy on the outside, and you get a hearty portion of filling! Each bite of my crepe had all the ingredients it came with, which was awesome. Too often when I eat crepes, you end up with too much crepe and not enough substance. Not the case here! My bf was also very satisfied, and my friend loved the sweet cream and fresh strawberries in her's. The crepe itself is also very large, so it was great for brunch/lunch.\n\nEight Turn Crepe, you have won me over. Do you do delivery to Baltimore, MD? q__q", "author": "Sherry F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Absolutely delicious, inventive and visually stunning!  I love Eight Turn Crepe.  I love crepes in general, but these Japanese style crepes are... different. Unique! Gourmet!  Unlike the typical flat crepes you'll see at say, Vive Le Crepe, these don't feel too heavy.  They're also really crispy, and the savory ones especially have really gourmet ingredients. I stopped in for lunch on Friday around noon and had the famous BLT, which was with really nice Applewood Smoked Bacon, lots of Spinach, Crispy Shallots (yummy!), cherry tomato... you can or can not add an egg. \n\nI have also had the banana nutella with whipped cream option, which was a really nice, filling dessert.  Plus, to-go packaging is super cute (it's like a flower bouquet! especially designed for Eight Turn).  It's nice they have a to go option since it's a little tiny in there so there are not many places to sit.\n\n Lastly, their yuzu soda is really refreshing..lots of yuzu and citrus goodness.  \n\n$10-12 per person ish. Go!", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "Returned once more with my dad this time. He had never had crepes before so he was thrilled to something new. I ordered him the chicken teriyaki and I went with Harajuku fruit cocktail for myself. Both crepes were amazing this time. The chicken teriyaki was full of flavor and loaded with veggies/eggs/perfect amount of dressing. My crepe was warm, light + perfect amount of sweetness. My dad kept asking me if there's a store like this back at home (DC/Maryland) because he can't wait to take my mom. Can't wait to sample the rest of the menu!", "author": "Wing C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "Would rate this 5 stars if the wait was shorter. Besides this, the crepe itself was amazing. We got the azuki berries which was really good.", "author": "Martin I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "We loved this place. Delicious crepes for a totally affordable price. Even the sweet crêpes are filling! \n\nWe ordered a sweet crepe and a savory breakfast one, and both were ridiculously delicious. There isn't much seating in the store, but it's a perfect grab-and-go. Definitely recommend for it's super friendly staff and delicious crepe combinations! \n\np.s. they also do take-out!", "author": "Isabelle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-13", "description": "We ordered our crepes, after we paid they tell us theres no more mushroom, no more cucumber. They prepare my friend's crepe, there's no avocado in it, which she paid extra for. Then I get my crepe, no avocado either. I was just so pissed about their careless service that I went back and returned mine. \nJulio and Nadine were the rudest, the most careless people I've dealt with. They didn't even apologize. So so rude!!! I shouldn't have dragged 5 friends here. Disappointed.", "author": "Shab A."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}