{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "These crepes are AMAZING. Absolutely loved them. I've been to this place many times and tried many different options, and they are all delicious. My personal favorite is the Fuji Apple crepe. Most of the sweet crepes are filled with delicious custard in addition to the toppings, which are also delicious. Plus all of their crepes are gluten-free! Highly recommend this place.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "This place is tiny but the crepe was quite delicious. I gave it 4 stars because of the price. One crepe will cost you up to $9, savory or sweet. The sweet crepe is filling for dessert but the savory crepe might not completely satisfy your tummy for lunch/dinner.    When I get the sweet crepe, I had to share it with a friend and we were both satisfy. So if you're tight on money, split one with another dessert advocate. The green tea ice cream was the perfect amount of sweet with a subtle taste of tea bitterness. As for the crepe skin, it was steaming hot and soft. I like soft over crispy skin. Check this place out but like I said, if you're tight on cash, split one or if you're ballin' enjoy one all for yourself.", "author": "Kuen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Amazing!  The ingredients are very fresh and high quality.  I had the apple pie crepe which was incredible.  I also tried the shrimp avocado salad crepe for lunch which was a filling and delicious lunch choice!  I crepe was so light and not greasy at all.", "author": "MichaelSarah O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Visited this new addition to the neighborhood and am impressed. Tried a few of their crepes with a mix of both the salad crepes and sweet crepes. All excellent tasting, light (made with rice flour), and easy to eat (thanks to the innovative cone like structure).\n\nWould and will highly recommend this place to everyone I know including the yelp community. A \"must try\".\n\nA++++++", "author": "Eddie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "Very good crepes! They make one of the really good selection of crepes!! My favorite is the shrimp but I think they re cheap.. They put 2 or 3 shrimps ( same with the desert crepes) ... I would give it a 5 if it weren't for the limited quantity of the goodies they put in your crepe!", "author": "Amina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "not a sweet lover, but look cute and creative.", "author": "Erain L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "I don't consider myself a crepe connoisseur, but this has to be the best crepe I ever had in 24 years of my life. My friend and I finally made it to this place last night after our 21894038403 failed attempts at wanting to go here. You can tell right away that Eight Turn stands out from other crepe places based on its interior design and options offered on the menu. The store window has bunch of hanging crepes displays that resembles the rose case you see in Beauty and the Beast movie. As I was being lured into the store by the  smell that reminds me of freshly baked goods out of the oven, you'll see a huge mural on your left with the store name and two cute cartoon crepes. Yes, the store is literally a hole in the wall with only a small bench on the left and two stools, but I didn't come here for wine and dine. The menu wasn't too big where you are overwhelmed by numerous of choices so my friend and I decided to order the Eight Turn Lox as savory and Azuki Berries as sweet to share. We each could have ate 2 crepes, but we would be PAINFULLY full. One might ask \"How do people share a crepe that is served in a cone shaped?\" Well we decided to just take turns biting the crepe because we obviously have no shame when it comes to anything that involves food :) The taste and texture was nothing I ever experienced before with other crepes. The fact that Eight Turn took a unique approach by making their crepes GLUTEN-FREE. but able to maintain the characteristic of a crepe at the same time is truly amazing. The texture wasn't too thick like some crepes I've tried before, but t's not too thin to the point where it breaks apart after you take one bite. It is a Japanese-Style crepe so the taste is slightly different from crepes that most people are used to. It has that bit of a sweet buttery taste that pairs perfectly with any fillings that you get. Overall, my friend and I really enjoyed our taking turns biting a crepe experience, but I will come back greedy next time and order TWO for my own.", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "new spot in soho that has fantastic crepes. i got the twinkleberry parfait (yes, the really manly one). the yogurt and cream they put in it are what really make the crepe. not super sweet, just perfect and the granola sprinkled throughout give a great crunchy texture which is a great touch.", "author": "Eric C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "Had the savory turkey crepe and the miso soup.  Perfect for a cold winter day!  I would love to come back and try a sweet one.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Note that there is no seating, and the wait can often be pretty long. That said, it's a very different (certainly non-traditional) approach to crepes, but it is very good.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Strawberry banana one is so good! Def recommend!", "author": "Abby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I tried the Fuji Apple Pie at Eight Turn Crepe. It had caramelized apples, walnuts, raisins, whipped cream and custard cream. I'm sure it had other things but these key ingredients stood out the most. What really impressed me by the crepe was how light and flavorful it was. The crepe itself had this light sweet flavor. Not at all greasy. Both the whipped and custard cream were made in house and were rich with flavor. All of the ingredients complimented each other greatly. I can't way to go back and try the other delicious flavors they have on their menu. They also offer coffee, tea and fruit smoothies. I had a mixed berry smoothie. Very good as well. I'd definitely recommend this place to anyone who wants to try something new and good.", "author": "I G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "awesome authentic delicious crepes. nothing on the menu disappoints! we've had the egg truffle and added the kurobuta sausage. delicious!", "author": "Christie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "This place is AWESOME!!! I have been to other places either they weren't as good or as friendly. This place has it all great staff, great ice coffee, and the best crepes in the city. I got the mixed berry crepe and my co-worker got the blue berry cheesecake both of us thought they were delicious. New regular place for me.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "We had two different savory crepes (with organic eggs) and they were delicious! Crepes were just the right consistency. My son didn't like the tofu sauce as much as I did, and the crepe in a cone was a bit of a challenge to eat. But overall we enjoyed our experience here. And the prices seemed a bit cheaper than the other crepe place two doors down. Next time, we will try the sweet crepes!", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Amazing! Banana nut chocolate was my favorite. So much better then any I have ever had. Seriously can't stop think about how good it was, I can not wait to go back to NYC just to get more crepes! We also got the harajuku fruit cocktail and the twinkle berry, they were great too. They actually look like the pictures, unlike a lot of other place I've eaten. Go here now.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "You should definitely try the Shrimp Avocado crepe! The place is very small and a bit expensive, but it's worth it.  Plus, since it's near my school, I will be coming back to try out more flavors. :D", "author": "A L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "Happened to walk by this spot this past weekend and was quite happy for this new find.  This place is really small, standing room only. The two crepes that I tried were excellent.  Shared/tasted/ate/demolished the Azuki bean and the shrimp and avocado crepes which were made on the spot.  Both were excellent and would highly recommend these.  I look forward to trying other items on their menu.  The only downside is that the prices for these are quite high.  Does crepe excellency come at a price?", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "Hopefully one of many more to come as the food is healthy and delicious, the presentation is appetizing and the staff is friendly and welcoming.  Can't help but pop in and grab one any time I am in the area!", "author": "Roman V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "such good crepes- probably the best I have had in NYC. I wish they had a bigger seating area and better drink options. They don't have water? However, the crepes are great", "author": "Maria R."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}