{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Absolutely great food and very friendly service. Order the crepe with salmon, avocado and cream cheese, it's delicious!", "author": "Dirk S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "very tiny place only seating for two-three people. crepes are tasty and creative. atop by grab and go is great place.", "author": "Sasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "I had the BLT crepe... Omg!! It was surprising delicious! The bacon is thick, sweet and salty. And the aioli is on point.  Def coming back here to try the sweet crepes.", "author": "Tiffany Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "I saw positive reviews on the strawberry, banana, chocolate and nutella crepe so I decided to get that (plus, it's my fav.) But the experience was underwhelming. Maybe the fruits were not as riped as they could be. It just felt like someone just chopped some fruits and wrapped it up. It's something anyone could have made in their own kitchen. \n\nThe taste could have been enhanced if they had nutella involved in the situation. They substituted nutella with chocolate which did not hit the spot for me. Nutella makes everything good..(even the food you hate the most!!! LOL jp. I don't think nutella could ever make me love durian.) Maybe it's my love of sauce that makes me think something creamy or saucy would have had me at \"hello\" but it had me at \"goodbye\". Well it's not set in stone. Who knows..I might visit them again for a crepe with meat in it.\n\nI was expecting something that blew my mind because it's supposedly a place that serves Japanese crepes but it was \"aiite\". I do think they make it a lot better in Japan. \n\nI enjoyed the old school rock/pop music from the 90's. I do like the high tech aspect of the place. We get to finish our order off on the cashier's Ipad.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "This was an amazing crepe, probably the best I've had in the city. I had the harajuku fruit cup and all of the fruit was sweet and fresh. I love the cream that they put inside too. The milk tea, which was free for national crepe day, was also very good. The only thing keeping this from five stars really was the price. Nine dollars for a crepe was a bit much, though it did have a lot of filling.", "author": "Alezander W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Just a head's up: portions are definitely dinner-sized (even the dessert ones)! They take awhile to make the crepes but the cashier was super nice and offered me a free drink while I waited. \n\nI heard they're running a La Colombe offer- 1 free La Colombe coffee with any crepe order, for breakfast only (if I'm not wrong). \n\nI had the Matcha Stripe Chocolate and WOW. The homemade chocolate truffles were absolutely divine. Good lord. I triple-checked the menu to make sure that you couldn't just order their chocolate truffles alone. The ingredients in my crepe were evenly layered/ mixed throughout so you get a little bit of everything with each bite. Also, they have a cute little clear cone-shaped plastic 'carrier' for crepes, which makes it very convenient to hold on your walk home (if you can wait that long, that is!). The paper cone that holds the crepe has diagonal perforations, so those who love to eat while they shop don't have to worry about making a mess. \n\nI should be writing a paper right now but I'm here raving about this place. This in itself pretty much sums up how amazing their crepes are.", "author": "Wen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Went here after dinner one night, and the place was packed with lines out the door. There were a few stools and probably would fit 2 groups the most. We tried the Azuki berries with GreenTea icream. The crepe was a little dry as well, had to really bite into it. But its Gulten-free though. Will probably come back and try the savory items on the menu.", "author": "Raymond L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Love it!  Happened on the place, and I love crepes but it is impossible to get gluten-free ones.  Not only are these gluten-free, the fillings are delicious.  I happen to hate the typical crepes since the savory ones are always too \"saucy\" and the sweet one are almost always too sweet.  These were perfect.\n\nAnd to the naysayers who say this place takes too long, while this is true, the fact is that good food takes time to prepare.  If you don't want to wait, go to McDonald's.", "author": "A L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Place is tight-knit and service was quite fast. I asked for recommendations, and the staff member did a great job understanding my appetite. I opted for the Azuki Berries which combined jam, fresh cut strawberries, matcha tea sauce and topped with green tea ice cream. Perhaps what makes this Japanese-se is their attention to detail down to how they package your food. I would come back here again, perhaps to try their more savory offerings. Why 4/5? I'm looking to see if they can wow me with something else in the near future visit.", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "Food (5/5)   Decor (4/5)   Service (4/5)   Value (4/5)\n\nThe crepes here are amazing.  I had the matcha stripe chocolate crepe and the strawberry plus chocolate chunks plus thin wrapper worked together harmoniously.  The wrapping of the crepe is also very innovative.  They fold it up into a cone shape and wrap paper around it so you can hold it and eat it like an ice cream cone almost.  The paper is perforated so that as you eat, you can keep peeling the paper away in a neat and orderly fashion.  The yuzu lemonade, which was being offered as a free promotion when I went, was also really tasty and reminded me of a normal lemonade with an extra citrus burst.\n\nThe service here was only so so though.  The person taking our orders was a little brusque and rough around the edges.  Also, they were doing a buy one crepe get one yuzu lemonade free promotion, and when they forgot to give us our lemonades, I asked for mine only to be greeted with a look and tone of suspicion.  Thoroughly off putting.  Also, if you plan on coming with a group for brunch, you might have to take it to the park across the street to eat as the place does not have any place to sit.\n\nI would certainly come back to this place for the crepes as I feel the taste alone has merited that.  Just don't expect to stellar service.\n\n\n**UPDATED 8/18/2014** \n\nSince I last wrote my review, I found myself coming back to this place over and over again. Now that it has become my hands-down favorite creperie in NYC, I feel it's time to increase the rating to 5 stars. Service every time (other than the first time) has been just fine. I highly recommend the BLT crepe, though be prepared to wait about 5-10 minutes as I think they prepare the bacon fresh upon ordering.", "author": "Taylor Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Sooooooooo good!!! Chicken teriyaki.. Shrimp avocado... and obviously all the deserts are good.", "author": "Ruthie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Gluten free, delicious, and everyone that works here is great.  I count myself lucky to live within walking distance of this place", "author": "Koushi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Loved my experience at eight turn crepe! Staff was so friendly and the store was really cute and well decorated with Japanese influence. Pretty popular among the young crowd. I got the lychee valentine and my friend got the double the eggs, double the fun. Can add ice cream to the lychee and sausage to breakfast crepe. Also comes as gluten free! They are also really attentive to any dairy or food allergies. We both really enjoyed how quick and attentive they were and how many layers of deliciousness was wrapped up in our crepe cone so all the layers came together cohesively in one bite. One bite you get all the ingredients all the way to the bottom of the cone. This place definitely deserves more attention. There are a lot of crepe places in NYC but this one was really unique with the Japanese influence and easy to eat with the entire crepe wrapped into a cone. We also got free water and it's neat their trash receptacle is even hidden from view. My friend liked the chocolate pocky sticks in the crepes displayed in front of the store. Went again and got free slushie sample while I waited for a friend to arrive. What's not to love!", "author": "Shana J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Fabulous Crêpes! They have very creative choices making it difficult to pick just one. We got the Lychee Valentine which has rose petals! It was SO delicious!! Staff was very friendly.  Convenient location near the 6 stop.  Vert small. Not a sit-dwon location.  They have a few benches inside. This is  a must stop on any trip to NYC!", "author": "Becca G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "We had the lox crepe and the shrimp \u0026 avocado. Wonderful! Fresh ingredients and friendly service. Clean establishment. Can't wait to go back to try the sweet dessert crepes!", "author": "Great W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "I understand it takes time to make a crepe and whatever it's fillings are--especially if it involves cooking scrambled eggs--but the wait was a bit too long. I didn't even get my order in for a good 5 minutes, and then probably another 7-9 minutes waiting for mine. Watching them make the crepes kind of infuriated me at how slow they were... I dunno, you'd figure if the one thing that a place does is makes crepes you'd think they'd be faster at it. They only had two people behind the counter and clearly it wasn't enough.\n\nObjectively, the crepes were good--as in just okay, not anywhere close to exceptional. I had the Fuji Apple pie with ice cream. I wouldn't say it was worth 10.50 plus tax--maybe like 8. But I used the paypal app and got $8 off so no regrets.\n\nI'm a bit regretful I didn't try the savory sandwich or salad ones, because somehow I think those would be worth the price.\n\nAlso I'm not sure if it's because they take so damn long with the crepes but by the time it gets to you the crepe is pretty cold. So while some may say I'm just impatient, I think speed is pretty important. Also I saw a customer complain about the crepe being cold.", "author": "Reina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Love this place!!! Totally addicted to the Lychee Valentine light and sweet with extra rose custard... delicious :)", "author": "Tammy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "these crepes are absurdly good. like, if only my ex boyfriend made crepes like this I wouldn't have left his ass crepes.", "author": "Elana O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "The staffs are very friendly, especially this lady that helped us. It was our first time there. Asked if we wanted savory or sweets. Gave us some recommendations. I ended up choosing: Chocolate Nut Party - almonds, crushed hazelnuts, crushed walnuts, crushed pistachios, vanilla ice cream, chocolate sauce, whipped yogurt, chocolate custard cream, chocolate pocky sticks ($9.50), It was good but it was kinda saggy. Not sure if it was suppose to be like this. Or maybe my ice cream melted too fast. My crepe wasn't hard enough, too soft. Maybe I'm just not a fan. I had this in the summer and I have never craved to eat it again, therefore my review will be 3 stars.", "author": "Tillie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "This place is too close to my job to not become an addiction!\nHad the tofu edamame. Watched the guys take the time to properly make it. Looked heavenly and tasted even better.\nI plan on eating my way through most of the menu in a short period of time.\n\nYum!", "author": "Meredith e."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}