{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "I crave crepes from here all the time!!! The Asian girl at the counter was super nice, friendly, \u0026 helpful. The crepe itself is delicious because they have so many different types of fillings. However, the crepe flour(?) was a bit cakey. I wish the store was bigger because it can get very crowded.", "author": "Jenny K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Been there twice and I'm loving this place! Definitely try their matcha strip chocolate and lychee valentine crepe. Also, their yuzu soda and matcha shake are very nice as well!!! There's very little space in the place but it is decorated very nicely with the room it's given. Haven't tried any of their savory crepes but I'm sure it's amazing too!", "author": "Sabrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Not sure what the big deal is. I ordered delivery using Uber Eats from this place since it had good reviews. The crepe arrived a bit dry with lots of nuts. I asked for berries but there were no berries. Anyway, I was very disappointed. I usually get Japanese crepes from T-Swirl, and this one just doesn't compare. This one is dry, thicker, and just doesn't have the same \"oomph\". A bit disappointing. Not sure why the reviews are so positive. These days almost every place has 5 star ratings on Yelp.", "author": "Pearl M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Best crepes I've tasted! It has more toppings and flavors to it than the other crepe store Vive la Crepe on the same block.  My favorite is the Harajuku Fruit Cocktail or the Twinkleberry Parfait! Simply Delicious.", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "I have had way better ones with more ice cream and a better mix of ingredients throughout the crepe.", "author": "Tae K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "Get the Banana Nut Chocolate crepe with strawberries and vanilla ice cream. GOOD LORD.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "Very good , so yummy! it is my famous miller crepe in New York City, I always bring my friends to eight turn crepe to eat. They all like so much.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "The crepes were pre-made and not as fresh as it could be.\n\nIt was average pricing and the store decorations were cute but that's all", "author": "Becky W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "With so many interesting combos and a mouthwatering window display, Eight Turn Crepe has been on my must-try list for a while now. Too bad it didn't live up to expectations. I got the Truffled Egg White crepe ($9.25 with tax), with truffled mushrooms, egg whites, truffle oil, spinach, and special tofu sauce. It was a perfectly good crepe--stuffed with fillings, slightly chewy and even a bit sweet-- but there was no truffle taste whatsoever. The egg whites were pretty bland, and the tofu sauce just tasted like mayonnaise, which I strongly dislike. Plus the paper cone in which it came was hard to tear, so eating the crepe was a challenge in itself. \n\nStill, the sweet crepes sound tasty enough for me to come back. I definitely want to try the Matcha Stripe and NY Cheesecake! Seating is limited, but staff are very friendly and don't attempt to rush you out. Make sure you ask for a plastic wrap around the paper cone, as the crepe started to drip all over me halfway through my lunch.", "author": "Cat K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Soo good and gluten free. Whaaa?! Winning!\n\nI've only had their sweet crepes. \n\nHave you ever had rose petals in your crepes? Well I have.\n\nDiscovered this place thank to paypal and this is now my go to crepe place.", "author": "Trace M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Just watching the staff create these crepes is amazing, it was like watching an artist create a masterpiece.  I love eating these crepes because they taste so fresh.  I usually get the rose custard and strawberries...soooo good!  If you need these crepes to go, they will pack them in a plastic bag divider, how inventive!", "author": "John K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Best portable crepes I've had in NYC. Fresh, savory and not sugary at all. My favorites are the berry ones. With mocha ice cream on top they taste like dreams. Prices are generally fair, so I won't hesitate to grab one when in the neighborhood. Strongly recommend!", "author": "Dex Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Really good! I miss this place already! The green tea crepe with Berries was so good! The crepe is nice and crispy. I will come back! Most certainly...", "author": "Davidson H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "First time trying crepes and its so good! (; i had the banana strawberry. My friend had the fruit cocktail. We will be back to try other flavors! The place is small but they do have a few seatings. Staffs are super friendly.", "author": "Gloria W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Delicious! Crêpes aren't overly sweet, and the flavors I've had so far have been on point. Lychee valentine was a good balance of fruity and floral. Matcha stripe chocolate was also yummy especially with the chocolate truffle bites. Love the tart yogurt sauce they use in the sweet crêpes -- makes it seem healthier! Maybe it's a psychological thing. \n\nFriends got savory crêpes and also had good things to say about them.\n\nThe only thing I wish they had is more seating room. Tiny place, gets crowded and about 5 people can sit total. Ideal for takeout.", "author": "Jean S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Best crêpe I've ever had, I had the banana nut chocolate crêpe, ask for extra chocolate. .delicious!!!", "author": "Joann B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Delicious!!  This place had been on my list of places to go to for desert for a long time. Finally made it there this week. I was not disappointed!  I had the matcha stripe sweet crepe with an added scoop of green tea ice cream recommended by the dude at the counter. Great advice to add it. It was awesome!  The crepes are perfect texture with great taste. All the ingredients inside of the crepe were delicious.  The combination of everything together plus the cone shape was perfect!  Easy to eat; I ate it like a panini.  It wasn't sloppy, stayed together throughout. I will be back for sure to explore more of the menu.", "author": "Juan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "So good!  ALMOST too beautiful to eat!  Vive La Crepe may have Nutella, dim lighting and more than 3 seats, but 8TC tastes better, looks better, and has more interesting options.  Nicer employees, too!\n\nAll are rice crepes, wheat-free.  Handy cone-shaped cellophane bags available for to go orders.\n\nThere's often a PayPal mobile app promo, so you can get one for FREE or nearly free if you Save Offer, Check In, and use.  Also download Perka to get a free crepe on your birthday!  (Must show ID, valid on actual b-day only.)  You can use Perka even when you're paying w/ PayPal.  Aaaand earn a free $10 credit once you accumulate 100 Perka points ($1/pt).  Sweeeeet.  \n\nRanked below with (+) and (-) :\n\n/////////////////////////////////////////////////////////////////////////////////////\n\nSALAD CREPES:\n\n(+++) Tuna Nicoise ($10.03): Absolutely satisfying and scrumptious.  \n\n/////////////////////////////////////////////////////////////////////////////////////\n\nSWEET CREPES: Most are only good w/ ice cream.  From best to worst:\n\n(+++) Azuzi Berries ($10.34): My favorite so far.  Needs more Azuki beans though.\n(+++) Chocolate Nut Party ($10.34)  \n(+++) Banana Nut Chocolate ($7.08): Strong dark chocolate (Belgian) that's better than Nutella.\n(+++) NY Blueberry Cheesecake + Chocolate Truffles + Strawberries: Yum!  Didn't taste like cheesecake, but still good.  I chose this as my free b-day crepe through Perka.  The staff threw in the extra toppings for free, took extra care when constructing my crepe, and were so sweet about wishing me a happy b-day.  Awww! :)  \n(+) Lychee Valentine ($9.80): Fruity, creamy.  Rose flavor present, but not cloyingly floral or artificial-tasting.  Not a fave though.\n(-) Matcha Stripe Chocolate + Green Tea Ice Cream ($9.81): Only good with ice cream.  I wouldn't order this again.\n\n/////////////////////////////////////////////////////////////////////////////////////\n\nBEVERAGES: Gross, gross, gross.  All bitter and watery:\n\n(---) Iced Matcha Latte ($5.17): Yuck.  Took a few sips, asked to throw it away, and they kindly offered me another drink!  So I got the...\n(---) Iced Caramel Latte: Also threw this away after a few sips.  At least they were able to make it w/ skim milk upon request.", "author": "Cece Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "So my food adventure in New York continues. This was actually suggested by someone when I was looking for new places to eat before my trip.\n\nEight Turn Crepe is in the same block as Rice to Riches and Lombardi's Pizza. So even if I didn't hear about it, I would've easily spotted it since it's right by the 6 train and on the way to Rice Riches.\n\nSo the dilemma was, how do we fit all that food that these three places are all in the same block? That's what your second stomach is for... for desserts.\n\nWHAT WE ORDERED:\n*Azuki Berries Crepe: The main reason why we picked this: it came with matcha gelato! If there's anything green tea on the menu, that's most likely what I would be ordering 99% of the time. The crepe came with strawberries, azuki beans, whipped yogurt, matcha custard creme, slivered almonds, and pocky sticks. The presentation is obviously super kawaii. It's a little bit more compact compared to the crepes that I get at Harajuku crepes in LA. The texture of the crepe also kinda threw me off a little though since it wasn't the usual smooth crepe texture since it's a rice crepe. Nonetheless, it was delicious! I liked the matcha custard creme with the azuki beans. They also neatly roll the crepe and put it in a paper pouch, so eating it on the go is not such a hot mess. I think ice cream cones are overrated and ice cream or gelato should really be eaten in a crepe cone :D.\n\nThe restaurant is super tiny. Like two bar seats, tiny. The place was empty when we went, so we were able to enjoy our crepes inside the store and people watch since you're facing Spring St. It's cute how they have \"crepes\" inside a cloche displayed in their store-front window. It kinda reminded me of Beauty and the Beast... you know when Beast had his precious rose? \n\nAnother go-to dessert spot for me in New York!", "author": "Anne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "My second favorite crepe place so far.  Best hand-crepe place though.  It's pretty and delicious! The crepe is actually very filling also.  I'll come back again.", "author": "Jennifer W."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}