{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Delicious, stylist and wonder crepes of good vibe. Excellent customer service and the staffs are super friendly. Love them! Love the food! Love the service! Thank you.\n\nMy favorites on the sweet side is Harajuku Crepes. On the salad side is the shrimp avocado Crepes.  Also love the bacon on the BLT crepes, they are so thick and juicy :)", "author": "Omega C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Came to Eight Turn Crepe with a bunch of my friends. There were so many selections I couldn't decide! But I finally decided to go with #9 on their sweet crepes menu.\n\nIt was such an exotic tastes of flavors. And oh so good. I would definitely go back for more! Great prices too for such a huge crepe!!", "author": "Maricar V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "My bf and I love this place. The crepes are made fresh when you order. Usually when we go, we would get three crepes and save one for later. I have tried the matcha stripe, harajuku fruit cocktail, lychee valentine and shrimp avocado. My bf tried the strawberry banana which is similar to the harajuku fruit cocktail but with less fruits. I wish they would expand to a bigger place. The store is so tiny with barely anywhere to sit. The staff are nice and always comment back on my instagram pics.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "Went here yesterday service was quick and easy. I don't usually eat Crepes but I had a pay pal offer so I went out and gave it a shot.\nI had the chocolate nut party and it was really good ! I also had a vanilla shake and that was ok.\n\nIt's really small in here though it's a stop order and eat on the go type of thing because there's only space for 2 ppl to sit in.\n\nStaff was very friendly btw", "author": "Vee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "Yuuumm! I finally came here after having bookmarked this spot for so long!\nCame here after a delicious brunching at Gyu-Kaku in St. Marks. My friends and I, though very stuffed, walked all the way to this location to try their crepes. I would like to say that their sweet crepes are so cute looking, and are definitely more Japanese-style, which is appealing! I tried the Azuki Berry crepe, and it tasted delicious even though it is costly! The crepe flour part had a crisp taste to it before it slowly became soggy from the yogurt and whipped cream they put it. It wasn't too big of a problem of course, just yum and a filling dessert! It is a small spot, and can get crowded, but it's a grab-and-go kinda place, so yeh, don't expect to stay too long.\nAll in all, I would like to say that the Azuki Berry crepe was pretty delicious. It is definitely really filling, so it is possible you won't be able to finish all the content. It is also a bit pricey, but if you are up to trying it, go for it! I will very likely be returning to try some of their other crepes! Very interested, in fact!", "author": "Nanciee N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Got the adzuki berry crepe. It was delicious; the filling went well with the ice cream. But then again ice cream makes everything taste better. Which is why I didn't opt for the ones without ice cream as my first crepe here. I plan on coming back to try all the flavors!", "author": "Lita W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "This place sells really unique and delicious crepes! They're an excellent spin on the traditional ones with their rice based wrap, and they have a large variety of flavors with both savory and sweet. After a long day of walking, my friends and I stopped by this place late in the evening. I ordered a banana chocolate truffle crepe while my two friends went for the azuki berry crepe and matcha crepe. There's very little seating and even at that hour, there were many people waiting for their crepes. There appeared to be two people who work in the store at a time, with two crepes firing at a time while the other staff person works on assembling the crepe. It took a while to get our crepes (10 minutes in line, 10 minutes waiting to get our crepes). I would say their only problem is that they need to expand! :) so perhaps you can go help them out.", "author": "Charlene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Such a quaint whole in the wall place. Its tiny, and gets crowded whenever I have been around, but it is so worth it. And it is placed in a wrapper that lets you take it with you anyways. \n\nI tried the Matcha Stripe Chocolate Crepe, but didn't realize that it didn't automatically come with ice cream, and I really wish I had added some to complete it. The crepe was amazing regardless of this fact. I loved it, and I didn't seem to be the only one. This flavor was selling pretty well when I was there: at least 3-4 other orders. \n\nI really love the display with all of the crepe versions. It really lets you see what you might want and helps in the decision making process. And believe me, it can be very difficult. So many interesting sounding ones. Plus, they don't just do sweet crepes. They have some fantastic looking savory crepes. I just happen to go when I want the sweet ones, but I definitely plan on trying out the savory ones some time.\n\nI highly suggest this place. It is worth the possible wait and the cost.", "author": "Ariel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "I'm a fan!! This place is so unique and great! I had the lychee crepe with raspberries and added green tea ice cream. I was so satisfied and I left wanting to come back for more. The crepe was a perfect texture and the lychee and the cream worked perfectly together. I'm definitely coming here every time I'm in soho.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "I have very fond memories of eating giant crepes at Marion Crepe Harajuku so I was really excited when I heard this place opened up.\nI opted for a savory crepe, Shrimp Avocado Crepe. It was good but had a little too much French dressing inside.\nBut I would love to try one of there sweet crepes!", "author": "Mary Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "Great crepes, long waits. Waited 30 minutes for a crepe. Yes there good and the prices are good, but this is something that is suppose to be quick.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Delish! I always get the fruit filled crepes for lunch. It' s one of my fave spots in the city and very reasonably priced.", "author": "Mckenzie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Glad I came here during my visit to NYC. I ordered the New York Blueberry Cheesecake w/gelato. Once I had a bite I was on Cloud 9. It tasted like a combo of fluffy clouds, rainbows, \u0026 unicorns.", "author": "Resi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "The matcha chocolate stripe is amazing. For some reason, the yogurt really contrasts well with the matcha, chocolate, strawberries and hazelnuts. Perfection!", "author": "Mariko A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "I've been dying to try their crepes for the longest times after I saw some of my friends post pictures of what they got. I went not to long ago with my sisters and we all got something different but they all tasted amazing! There's so much to choose from on the menu that I literally couldn't decide. Will definitely be coming back and showing my bf this place too!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "The crepes are really good here. They have a lot of combinations you can choose from \u0026 then you can add any other toppings you'd like such as ice cream, chocolate truffles, etc. Next time I'll try the lychee crepe !", "author": "Maria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Another crepe spot. Good, nothing makes it spectacular but what do you expect? The crepes are very very good. I've never tried a savory crepe but the sweet crepes (strawberry, banana) is usually what I go for. But they have a lot of interesting options on the menu. What's different about the crepes here is that are folded and turned into a cone shape. A new experience if you are used to crepes on a plate!\n\nThey take credit cards. Small place though! (Like most other crepe shops)", "author": "Danny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "I saved this on my yelp bookmark for the longest time but never found enough reason to go there.  I happened to walk by it after visiting the Friends 20th anniversary set with a friend, and decided what better snack than crepe?  This place is extremely small, with two stools by the window.  We ordered the Lychee Valentine crepe to share and it was honestly PERFECT.  It's the crepe for those without a sweet tooth!  Lychee Valentine has raspberries, lychee, whipped yogurt, almonds, ROSE PETALS, and cream.  Doesn't it just have a certain charisma to it?  The crepe itself is pretty standard to me; not out of the world.  But they nailed the combination of ingredients.  I wouldn't mind it again if I'm in the neighborhood and hungry.", "author": "Carrie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "If decadent, colorful and fancy crepes are your thing, then Eight Turn Crepe is your place. \n\nMany menu items have additions like ice cream, nuts, fruit, azuki beans. One crepe can be shared by 2-3 people, so grab a spoon and dig in. Downside is that the shop is very small with little seating room (3 chairs).", "author": "Sooz A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "I came into the shop with a few friends and ordered 4 crepes altogether. They did not have azuki beans in stock for the Azuki Berries crepe and told us before we ordered and we were okay with it. When the cashier handed my friend the crepe however, it was missing ice cream and pocky sticks. After we notified the cashier, she denied that it had ice cream and pocky sticks until another employee stepped in and added the missing ingredients. \n\nThe next two crepes were both Banana Nut Chocolate and were messily put together. The crepes were so thin on the edges that they had small holes. A piece of banana was on the outside of the wrap because it was messily put together.\n\nI had ordered a NY Blueberry Cheesecake and after waiting 10 minutes they told me they did not have blueberry jam. I switched it to a Lychee Valentine and they had it promptly made for me. It was missing the rose petals and custard. All 4 crepes we ordered were wrong.\n\nClearly the staff that was manning the store were not experienced in both the menu and the technique in crepe making. What bothers me the most is that there was not an experienced member of the staff supervising them. This reflects poor management of the store, as all the problems I had with my crepes could have been fixed or caught by an experienced staff member before being sent out to the customer. \n\nI am disappointed.", "author": "Norman W."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}