{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "I have tried alot of crepe places and been looking for a Japanese crepe place for a long time... then I found eight crepe! Its delicious and looks exactly like how its pictured.", "author": "Emily Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Great dessert crepes made from rice flour so they are completely gluten free. Very fresh fruit and cute (but small) store front. Try the mixed berry parfait. Good edition to the neighborhood!", "author": "Hilary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Travel all the way from California and every time I stop for a savory and dessert crepe! Best and it's gluten free!", "author": "Devo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Very few places induce cravings like Eight Turn... Seriously. This place is the bees knees. I've only had one crepe off the menu - the Eight Turn Lox (pay the extra $1 for avocado), but I've had it a million times.  The cone shape crepes are easy for when on the go. Super friendly staff. Hands down one of my favorite places in the city. Writing this review makes me want to hop on the subway to Spring and Lafayette now actually...", "author": "Frank B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "The crepes here are delicious! Especially the azuki berries, the size of the crepe is also pretty big, and you will have a hard time to finish it! So far I have only tried the sweet crepes, I will definitely try a savory one next time!", "author": "Lexy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "best gluten free crepe place! all the crepes are quite good but my favorite is the matcha stripe", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "The first two times when I tried the crepes it was the best crepes I ever had and now the workers are changed and they have no clue how to make a crepe I don't feel okay paying 9$ for a crepe when it's not even made properly , there are other crepes shop around the place, management should give proper training  how to fill the crepes up otherwise it will just lose business", "author": "Ahsan U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "What's all the fuss about this crepe place, hmmm ....... I would say is worth the hype to gave a try. Refresh tasting on my lychee valentine crepe. So,Conclusion: it wasn't bad, all I can say is  \"I've been there and try that\"  yeaaahhhh", "author": "Lnd L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "My girlfriend and I decided to check out the place after heard good things about this place.\n\nWe ordered 3 crepes in total; Lychee valentine, Crepe dog and Azuki green tea.\nI would recommend the Azuki since the rest aren't really impress me at all.\n\nThe crepes somehow come different in standards, the Azuki green tea that is made by the Asian lady who assumed to be an owner impressed us right away.  On the other hand, the other two crepes that made by the employees come out much smaller in size as well as the crepes weren't cook well at all. \n\nOverall, it is a good place if you have a chance to visit Soho and want to grab something while hanging around.  \n\nPS It would be better if they could train the employee to make the crepe at the same standards.", "author": "Peter P. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Everything about this place is genius. We had a hard time deciding what to get because there were so many great options. The chocolate peanut butter banana was delicious and I was surprised that my favorite was the berry parfait. DELICIOUS! Best crepe in new york.", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "This is a Japanese-style crepe place (not sure if it's actually Japanese-owned) and that's really rare in NYC. You find these all over Japan - it's a common street dessert/snack, especially in summer, like ice cream here. You have to go in with that in mind - I've seen a lot of people complain that the crepes are cold, but that's just how it's done there. It's totally different than a French crepe, but so good when done right.\n\nThat said, I think there are some things this place could improve. First, the crepes should be softer. Mine was kind of crispy, which doesn't really work when the crepes are cold. Real Japanese crepes are not brown at all - they are extremely light, just barely done. They melt in your mouth even though they're cold. Maybe just cook the crepes for a shorter time?\n\nThe crepes should also be a little taller and stick out more from the paper that holds them, so you can eat them like an ice cream cone. I think this is just a question of rolling them up a little differently (which would also help the crepe to filling ratio) - not sure what the correct technique is but there are YouTube videos that show it.\n\nOtherwise, though, the crepe fillings tasted very good/fresh.\n\nIf I owned this place, I'd go all in on the Japanese ambience *and* the crepe style. Right now it's all kind of half Japanese, half New York, with kind of a dark atmosphere and hip hop playing on the stereo, but then a bunch of kanji writing on the walls and explanations of what Japanese crepes are everywhere. It's probably all an intentional mashup, but I think it's a little confusing and you see that in some of the harsher reviews. I'd really make it like a real Japanese creperie if I owned this place. I think it'd improve the crepes *and* make for kind of a novel experience.", "author": "Jeff W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "Yummy crepes.  Buttery, crispy edges AND they do gluten-free.  I got the Banana Chocolate Nut crepe.  Wasn't a huge fan of the custard.  Not bad exactly, but I didn't think the flavors quite melded together.  I'd try it again.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Maybe i'm not a crepe expert but this place was wonderful.\n\nCan I say, best crepe I've ever had? Probably.\n\nI had the Fuji Apple crepe which was absolutely delicious. It tasted like an apple pie but you know with a crepe.\n\nI'm going to come back here to try the best of tastey other options!", "author": "Peter L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Not bad at all. There are a good amount of options, sweets and savory, and they give you a LOT. There's a lot of food they give you and they stuff a lot into those crepes. It's so great. It's a nice dessert, both filling and the perfect amount of sweet. Would recommend.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great little dessert to split with someone. Came with my boyfriend and we absolutely enjoyed our sweet Harajuku crepe with ice cream. It's a nice portion so I don't think there's a way anyone can finish it by themself. Fruit was sweet and the crepe is freshly made in front of you. Only complaint is that the ice cream had frozen with little pieces of ice.", "author": "Ani Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "I've had crepes in Paris and these crepes were mind blowing. One crepe is a meal in itself. Great staff! Tons of choices for every tastebud.", "author": "Tuan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "All I can ask is \"Why is there not an *Eight turn crêpe* in every shopping mall in America and in every single town?  This little place was the highlight of an already great day. Stopping in at Eight turn crêpe is now on my list of things that I absolutely have to do every time I come into the city and I have a feeling that I may come in just to get another crêpe and no other reason very soon. The staff was exceptional, very friendly and very cheerful, although they could have been miserable and nasty and I still would have given this place five stars... That's how good the crêpes are!! So if you live in New York City and you haven't been here... you need to go As soon as possible and if you live close enough to New York City to drive there for a day trip.. I'm sure you'll agree after you take your first bite it was well worth the trip", "author": "Jen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "My cousin is crazy about crepes. So, I set out on a mission to find a place for us to get our foodie on. I found this place (here on yelp) looked up the menu and it looked perfect. We set out on our adventure. Once we get there we find this cute little place. The menu is interesting and intriguing. I ordered the shrimp avocado as recommended by one of the staff. It was very tasty. I liked how the flavors came together well without them getting tangled with each other. What i didn't like was how expensive they are. After eating the one crepe I was still hungry. Thats not something I still want to feel after eating. I was debating order seconds but i passed. The establishment is tiny, almost no seating inside and outside they have  couple of benches on the side walk. I'd come back, but only because I really want to try Azuki Berries crepe.", "author": "Elana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "Rice flour made crapes so good! \nI ate green tea crape,next time I'll add more toppings :)", "author": "Mary K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Went here today with my sister and ordered #9 and it was the best crepe I had ever had. It had strawberries, a scoop of green tea ice cream, match green tea swirl, almonds, chocolate pocky, and just had an amazing taste in every bite I took. The crepe itself was very soft and easy to bite into. Finished the crepe with my sister at a very satisfying level and it left no mess at all! Just use a spoon to eat about half the ice cream, settle down to eat rather than walk and eat simultaneously, and it will be mess-free!", "author": "Sharon L."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}