{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "This is a cute little place situated close to another crepe place. I'm glad I decided to go here. I ordered the matcha chocolate stripe crepe. It was so delicious. Next time I'm in the area I want to come back and try more. I don't think you can go wrong with any of the crepe flavors they have.", "author": "Tatyana N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Went here and got the Fuji Apple Pie crepe with Ice Cream. Was good and the apples were suprisingly crunchy but taking off a star because of the random raisins in it that kind of ruined it a bit.", "author": "Brandon Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "I didn't know Japanese crepes were a thing.. just happened to go with some coworkers one morning. They were offering a cup of coffee on the house that morning. Yay!\n\nNot surprised by the good reviews!\nSuper delicious crepes, different varieties.. I've had a sweet crepe with strawberries, bananas and cream, and the Thai chicken crepe. Ughhhh, so so good!!\nService is super fast and very friendly.\n\nI wish I were in town for longer and could devour the whole menu.", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Came to 8 turn crepe with my friend.  It is a cute little store and we noticed that it is opened right next to Vive la crepe.  Even so, eight turn crepe is different.  Eight turn crepe is crepes with asian influences.  They have savory crepes like thai chicken or sweet crepes like azuki berries.  \n\nAnother difference is that their crepe batter is made of rice flour, so the crepe is chewy and soft.  Many of the crepes are gluten-free (be sure to ask the cashier about them) They have a wide selection of savory and sweet crepes.  My friend and I were craving sweet ones.  We both ordered the azuki berries with green tea ice cream.  \n\nEach crepe is made fresh, and you can watch them make it fresh behind the county.  This place is definitely a great place to visit in the summer and the fall.  You can seat right outside, enjoying your crepe and people watch.  It is a bit expensive (each crepe is about 8 to 10 dollars depending on which) but I think it is worth it.  \n\nThe azuki berries were filled with fresh strawberries, pocky sticks, red beans, almond slices, a green tea custard, their house made whipped yogurt, and of course a big scoop of green tea ice cream on top!.  It was a beautiful piece of artwork!  The crepe was spongy and soft.  The whipped yogurt was tart but went harmoniously with all the sweet toppings.  The green tea ice cream was not overly sweet and still retained the green tea taste, just the way I like my green tea ice cream!  \n\nYou can also have add ons if you want to add ice cream onto your sweet crepe.  They are also known for their yuzu lemonade.  Didn't have the chance to try, but will definitely be back to try!!\n\nIt was a gut busting crepe, so if you plan to visit, make sure you have not eaten for the last 18 hours or something because I had to carry my belly out after I finished!", "author": "Maggie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "I've lived on this block for three years, right above the Vive le Crepe place, and was disappointed to see another creperie open two doors down, as it replaced a portuguese cafe i loved.\n\nHowever, this creperie is head and shoulders above the one right next door! Delicious, fantastic, fresh ingredients. Flavorful. Priced similarly to the other creperie but on another level, taste, testure and flavor-wise. Already been twice in one week, where the other I've been thrice in threer years (and disappointed each time). Welcome to the 'hood!", "author": "Laura S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "My favorite crepe place in the city. Instead of the sweet types, I usually go for the salty ones. I love the one with the shrimp. They're pretty generous with their ingredients. The few times that I've been here, I never had issues with the taste or freshness. Definitely receommend for people to come here!", "author": "P L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "The interior design is really nice but employees are pretty low tempo they seem tired or careless no warm welcome or I can say customer service is not as good as expected. The crepe skin isn't as tasty as villa la crepe, the skin is dry and cold when they serve. I think they can do better. Kind of disappointed because I hope this crepe can taste the same as the ones in China.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "I had the pleasure to try these delicious crepes at the Intel Popup back in January. The Matcha Stripe Chocolate crepe had ripe strawberries, chocolate sauce, housemade chocolate truffles, whipped yogurt, matcha custard cream and crushed pistachios. It tasted light, without feeling overly sweet. The finished masterpiece was definitely too pretty to eat; this crepe was $7. If let's say you were allergic to nuts, they would be more than happy to leave it out for you. I would definitely go again for the Matcha Stripe Chocolate or to try any of their other sweet or savory crepes, which include a cheesecake crepe as well!", "author": "Terresa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I always want to try anything and everything Japanese in New York City, so Eight Turn Crepe was a necessary stop-- and I was not disappointed at all! The staff was helpful and very friendly, and my crepe could not have been more delicious. I tried the one with lychee, raspberries, rose pastry cream, and edible rose petals-- kind of an unconventional choice for me-- and it was *absolutely delicious*. Normally when I come to New York I try different places every time, but this place will definitely get a return visit from me. \n\nRe: seating: all there is for seating is a single bench inside, so expect to walk around. However, the Evolution Store is just down the street, so you can hit two fabulous stops in no time at all!", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Best blt of my life. Period. Get the scrambled egg andbcheddar melted too...I actually order another one to eat while I walked home", "author": "Shibs K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Had the matcha green latte, iced. It's customizable milk. Overall really good, but kind of expensive. You add sugar yourself if you want it sweet. I had some of my friends lychee crepe which was good too. I will definitely come back to try a crepe myself!", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "Reasonably priced and delicious. I had the shrimp avocado and my friend had the chicken teriyaki. The crepes are made to order, so it'll take a few minutes. We really enjoyed the savory crepes! Will have to go back for one of the sweet ones!", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "What a great addition to the area! A little fierce opening up 2 doors down from vive le crepe, but very happy they are so conveniently located from the Spring St 6 train stop.\n\nThe cone shaped bundles of joy are made of rice, so the crepe isn't extremely heavy. Crepes are no overcooked and do not get soggy or bogged down by the amount of food stuffed into them. I got the azuki berries and don't let the name fool you. its got more matcha sauce and a scoop of green tea ice cream than azuki or strawberries... which is kinda the way I wanted it. the poki sticks are a nice way to top the crepe... very fun and takes you back for the times you ate these japanese treats! I didn't try a savory crepe but my friend did mention the edamame and tofu was pretty good.\n\nThere are only 2 stools in the tiny spot and 2 benches outside but we were fortunate to get a seat. I'm guessing these crepes are meant to take on the go, but I am one to not be coordinated enough to eat and walk at the same time. Find a spot and take your time to enjoy these great creations!!!", "author": "Donna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "Had a bad day? Well Eight Turn Crepe is the perfect place to eat with your emotions. Here's what I do...\n\n1. Take the 6 train down to Spring St., get out, cross the street and walk in to Eight Turn Crepe\n2. Order one of the sweet crepes, the fattier the better. Personal favorite is the strawberry \u0026 banana\n3. Sit on one of the two high chairs. If there are people sitting on the chairs, give them the death stare until they move\n4. After you get your soft, spongy, cream filled crepe, shove it down as fast as you can while cursing the world and savoring that sweet, tangy goodness\n5. Wipe your face so no one will know\n6. Walk like 10 feet to the Spring St. station going uptown\n\nTrust me -- you'll feel a lot better afterwards.\n\nOnly reason this place is not 5 stars is bc the crepes are cold. I think warm crepes would assuage my sense of injustice even better.", "author": "Evelyn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "I happened to stumble upon this place on a quick trip to pick something up in the area at lunch time. On my way to the Uptown 6 train Spring Street entrance to head back to work I saw a sign for crepes. Who could pass up an opportunity to pick up crepes?? It's a small place and there were only a few people inside so I figured it wouldn't take long. I was wrong. There were even people waiting outside. I ordered the Fuji Apple Pie crepe and waited and waited. During that time the cashier was nice enough to give us all small cups of green tea and offered us 2 Chicken Thai crepes that were made in error. I took her up on the offer and the crepe was really good. I had enough time to eat the entire Chicken Thai crepe slowly and watch them meticulously make crepes before my actual order was complete. The Fuji Apple Crepe was ok, but the Chicken Thai was way better. \n\nThis place is worth checking out if you're in the area and have the time to wait.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "The Hokaido Fruit Crepe is just GEM. Lovely little place and highly recommend.", "author": "Alice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "I've never been a big crepe fan but I was super hungry after work one day and I knew it would be fast.  I got the #1 which was an egg and cheese combo with truffle oil.  I must say it was beyond delicious!  I've decided that I do like crepes... But that was the first time I've had a good one.  Wow!  I totally recommend this place!  Also, I'll be back to try a sweet crepe soon.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "The service was amazing. It took a while, but that's understandable: 2 persons manning the entire place and 15 customers is no joke. We waited around 20 minutes for our crepe, which was fine, because the barista (he is a barista, right?) informed us of this before we made our order.\n\nCrepe-wise, not too impressed. Got the Matcha stripe, it was yummy, but no five-star. Your average crepe fare.\n\nNote: the shop is extremely cramped. Prepare to squeeze.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I read about eight turn crepe on a blog, when I saw the pictures I knew I had to try it. This place is literally a hole in the wall. There are only two stools and can fit no more than 6 people comfortably. But besides that, everything is great. There's like a matrix of sample crepes enclosed in glass domes by the window, very eye catching. I applaud eight turn crepe for its creativity on putting a unique spin on something as simple as crepes. The crepes are beautifully presented in a way that is visually pleasing. \n\nMy favorite is the Harajuku Fruit Cocktail. The strawberry, blueberry, mango, banana, cream gives it a nice sweet tart flavor and the almonds add a change in texture. It's quite nice. Maybe I'm biased because I love fruits. \nMy next favorite is Azuki Berries.  What an interesting mix of ingredients. Strawberries, green tea custard, azuki beans, topped with a scoop of green tea gelato and sprinkled with almonds. It also comes with pocky sticks. I'm confused about why the pocky sticks are there, am I supposed to use it as chopsticks?? It just doesn't belong in my opinion. The gelato had to be eaten first because I was afraid it was going to melt. After biting into the crepe I was surprised to find that the crepe was a bit crunchy, which only made the experience better. The azuki berries were soft and sweet. \n\nI'm usually a generous guy and wouldn't mind sharing, but this is one of those cases wherever I'd have to tell someone to get their own because I want to eat it all. Eight turn crepe has turned me into a crepe snob.  \nI've also tried the twinkleberry parfait and fuji apple pie. My friends seem to enjoy it, but it's not for me.", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "3.5 stars really, nothing too spectacular although \"cool\" in the sense that it's in a to-go cone/cup.  I had #9 which is the crepe with strawberries, green tea ice cream, a pocky stick.  The green tea itself was yum! Definitely the highlight of the crepe, otherwise it was just a crepe.\n\nThe #7 with the strawberries and green tea creme, and chocolate chunks was.. kinda boring tbh.  \n\nOverall it's a bit heavy for a after dinner dessert, perhaps more of a on the go brunch treat.", "author": "Christy L."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}