{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Had the Matcha Stripe Chocolate and it was amazing i will definitely be back o try the other delicious crepes.", "author": "Paul G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Given the reputation and the hype, I was so excited to try this place... but I left a tad disappointed. \n\nI was in the mood for savory crepes and BAM, what could go wrong with Thai Chicken, right?! No. The most important part was wrong...  the crepe itself tasted overly 'floury.' But the ingredients used inside were good, but it was missing an element to be great. I've had better savory crepes elsewhere. \n\nMy experience was made a lot better thanks to their super cool interior, because I got to snap a nice picture of my crepe :)", "author": "Samantha Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "This place is wonderful! It isn't somewhere you should go expecting to sit down, but you can expect a filling meal at a reasonable price. I went on a Friday evening and found no line, surprisingly. I got the Double the Egg crepe (egg, cheese, and sauce) for $7 and it was outstanding. I have to agree with another review that described the tofu sauce as being somewhat mayo-like, but a milder taste with more salt. If that's not your thing--and it wasn't mine--just ask for a small amount or omit it completely. \n\nMy favorite part of this place, aside from the delicious crepe, was the friendliness of the staff. My friend ordered a matcha shake and one of the employees must have overheard me telling her I wanted to try it because he poured a good amount extra in a cup for me. Gotta love free stuff. Especially when it's delicious (which you can bet it was).", "author": "Laura C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Loved the banana chocolate crepe + Green tea ice cream here ($9.25). I think there could have been a couple more chocolate bits in the crepe (i think there were about four small chunks?), but overall it was a great dessert choice around the area.\n\nThey were very quick to make the order and i was in and out within 5 minutes. \n\nI have not tried their savory crepes yet but my coworkers tell me they're pretty good.", "author": "Erin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "We were walking around after having Lombardi's and came across this place. I thought the sample crepes on their window looked very good so I yelped it real quick and saw that many people liked this. We decided to go into this tiny shop and give it a try. They make the crepe right then and there and the other worker places the toppings very evenly into the crepe. I thought it was a very cool concept, generous size (good for sharing) with a very evenly filled crepe and delicious combinations! We had the harajuku fruit cocktail one and I really enjoyed the cream \u0026 yogurt in there. It kept the crepe moist and the almonds added a nice crisp touch. Although we only tried one, I wish we could've had another one with ice cream! Next time, hopefully! It was very satisfying though, a great ending after eating a heavy dinner because it was light and sweet but not tooo sweet.", "author": "Angel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "My husband and I were in the mood for something light and hence or decision to get crepes. The reviews were positive so we were inspired to try out this eatery. \n\nThe server was friendly and helpful even though I felt that there was a bit of up selling that was occurring. The crepes were made to order and one could see them being made.  \n\nWhile tasty we found that the ingredients were not consistently spread out through the crepe. So while there was avocado in my first few bits by the time I was six bits in there was none. The same was true for the NY cheesecake with fresh blueberries. I doubt that there were ten fresh blueberries in the whole thing and the ice cream was limited to the top of the crepe.\n\nThere isn't much of a sitting area but being that the weather was nice we were happy to go to the park and eat. We were not wowed.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Was craving desserts and happened to come across this place. Super small place with only a few seats inside... I prefer the fruit flavored crepes, so I decided to order the matcha crepe with green tea ice cream in it...my favorite. I was pleasantly surprised...didn't expect much but it was pretty good, a bit pricey though. Definately a good late night snack! Would come again and try other flavors.", "author": "Sylvia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "I had been really looking forward to trying Eight Turn Crepe. Maybe my expectations were set too high, but I was a little disappointed.\n\nThey are located on a cool part of Spring St about a block away from Rice to Riches. I visited on a cold night right after a show in the the Theater District. I had not realized there was almost no space inside, or I would have picked a different alternative. It was too cold to stand outside so we crammed into the standing room only, tiny space inside. The quarters were too cramped to really enjoy.\n\nThe staff were very friendly, their window display is very cool, but the sweet crepes we ordered were sorta average, with too much crepe, and not enough of the interesting filing.\n\nSo I can only rate this a 3. This review is based off the crepes tried, and the experience of visiting on a cold winter night when eating outside was not possible.", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Crepes were delicious.  The class for the kids was really outstanding.  Highly recommended for parties!", "author": "Ella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Plenty of vegetarian options, and they're perfectly willing to replace the chicken with tofu in the non-veg options. The people working behind the counter were perfectly friendly and the food came out quickly. \n\nThis small spot can get crowded with more than 4 people inside, but luckily these crepes work well as a hand-food that you can eat while walking. Perfect for a summer day!", "author": "E D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "I love Japanese style crêpes and I was not happy when the sole Japanese crêperie in the village closed shop. So I was very excited when this place opened. \n\nMy bf and I tried them out on a recent night out. I couldn't decide whether to have a savory crêpe or a sweet one but in the end I had the NY blueberry cheesecake one. Delicious! Just like I remember them to be. The crêpe is lighter as it is made with rice flour and they roll them up like a cone and perfect when topped with a scoop of ice cream. The signature custard filling was so good! My bf had a banana dark chocolate one which was rich and delicious as well. \n\nAlso, if you are taking it to go they put them in these really neat little bags that won't crush the crêpe. We'll definitely be back to try other things in the menu!", "author": "Ryna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Very cute place for a quick lunch. You'd have to eat somewhere else because they have only about two seats inside but they're fast, friendly, and affordable. Most importantly the crepes are really good!!", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Pork belly goes with everything and Japanese crepes are no exception. I loved the pork belly crepe and would go back again and again for that one. They also have a pretty good variety of crepes to choose from so I have my eye on a few others I want to try when I go back. My kids loved the Nutella crepe so two big thumbs up for the Nutella crepes as well.", "author": "Albert A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Spontaneously chose this place for dessert after a wonderful dinner at Ed's.  I've never been so satisfied by a crepe in my life!  \nShared the Matcha Stripe Chocolate crepe with green tea ice cream.  AMAZING! \nWe killed it within a few minutes and I had to resist wanting to order another one.  \n\nMonth's later, same friend and I had dinner in SoHo yet again, and the restaurant's dessert menu was lacking.  So where do we go?!  Yep!  We come back here again!  Truth be told, there are 2 crepe joints almost next to each other (separated by a bar) on this block.  This one and some other one.  We walked back and forth (twice) checking out both menus before saying...eff it... ETC wins! \n\nWe went for their winter special, S'Mores crepe.  Didn't get ice cream with it because we thought chocolate ice cream would've made it too chocolatey.  Still really good, but I would've put something else in it like a topping or would've just settled for the chocolate ice cream.  Now that I think about it, we could have gone crazy and gotten the Matcha ice cream!\n\nSo why the loss of the star?  2 reason:\n1. The space is super small.  Maybe not a problem in warmer weather but when it's arctic out, the space issue is a problem. You feel awkwardly in the way when it's packed and people are trying to order or eat these heavenly crepes against the wall because it's too damn cold to go outside.  \n\n2.  Their only ice cream choices are chocolate or green tea.  And these sweet crepes are SOOOOOOOOO MUCH MORE FANTASTIC WITH ICE CREAM!  Maybe add a red bean or vanilla or sweet cream option to the menu?  Pretty please?", "author": "Marthy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "For some reason, Japan knows how to make everything better. How would you be able to resist a mess-free treat that has options of your favorite combinations? Choose between savory or sweet, fruits or chocolate, with or without ice cream? Did I tell you that they use Il Laboratorio Gelato's gelato?? I'm sure I have you convinced now. \n\nI would give this a full 5 stars if there was an option to allow you to create your own crepe. Also, these crepes are a bit pricey so I would consider this as an occasional treat. This spot is best for spring, summer, and fall due to the lack of seating area. I guess their plan of selling one-handed crepes allows you to eat on-the-go even in the brisk NYC winter weather. \n\nIf you like ice cream and fruits, I would definitely recommend the Azuki Berries. You have an array of berries, chocolate pocky sticks, green tea gelato, and azuki beans (or red beans). Next, I'll be back for the chocolate truffles with ice cream and other stuff!", "author": "Yimei M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "I haven't had a crepe that I haven't made myself in YEARS. So when my boyfriend and I passed this place the other night I made sure to drag him inside. I didn't care that we'd just finished eating a gigantic meal ten minutes before, I needed my sugar fix. Plus the storefront looked so inviting, with rows and rows of crepes on display I had no choice but to go inside. \n\nThey have savory and sweet crepe options, but I was definitely in more of a sweet mood. I couldn't decide between the blueberry cheesecake, lychee valentine, or matcha stripe chocolate. They all sounded SO good, so I let my boyfriend decide. Since he doesn't have much of a sweet tooth he decided to go for the matcha stripe with a scoop of green tea ice cream on top. There were a few people ahead of us when we ordered so we wound up waiting for around five to ten minutes for our crepe, but we didn't really mind. They have a couple of chairs and I was having a grand old time staring at the display cases. \n\nWhen we finally got our crepe we nearly started fighting over it. Chocolate sauce, chocolate truffles, strawberries, green tea ice cream, matcha custard rolled into a beautiful cone of crepe-ness. It was divine. We both loved it so much that we wanted to order another one, but knew our stomachs would explode if we tried. We're going to come back again later this week and try some other options. The lox crepe sounds interesting, although the one my heart yearns for the most is definitely the blueberry cheesecake.\n\nThis is the perfect spot for a dessert after a dinner date. Split a lychee valentine, I'm sure whoever you're with will love you for bringing them here.", "author": "Tessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "How can you really go wrong with fruit and custard? I've only tried their sweet crepes so I can't review on the savory or salad ones they offer but I've seen others order it and they do smell pretty good. I've tried basically every crepe on the sweet menu and my favorite has to be the Harajuku fruit cocktail which is a mix of strawberries, blueberries, raspberries, mango, bananas, whipped yogurt, custard cream, almonds. I usually get it without the bananas because I feel like it overpowers the whole crepe and all I taste are bananas, but the staff are really nice to substitute the bananas for more of the other fruits. They always have fresh ingredients, I've never ate a crepe from here where the fruits were dry or anything wasn't freshly cut.\n\nThe pricing is decent, it averages from $6-$9.50 which honestly is the standard compared to other creperies. Additional items (like extra nuts, pocky, fruit, etc) are $1 extra and extra ice cream is $2 more. You can also pay with PayPal which is really convenient and occasionally there are discounts on PayPal (as I'm writing this review theres a $3 off offer on PayPal)!\n\nThe place in general is super small with minimal seating (2 stools and a tiny bench that can fit 2 at most), but in the summer they have a bench outside for additional seating. It gets crowded between the people waiting for their crepes and waiting in line to order, there really isn't much space to wait but the crepes are a one hand job so you can honestly just take them to go and eat on the way. They have a nice little condiment section with forks, spoons, napkins, fructose (for their drinks), etc. \n\nAs many times I've been here the service has always been great. Never once did someone not greet me or said thank you. Their staff is really polite and patient and when you leave there's always a have a good night ot come back next time.", "author": "Alice Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "*review not based on food.\n\nCame here at about 9:10pm. They were closed already even though their website says 9:30pm closing and it looked like they closed up shop even before 9 because they had seats up, tables cleaned and were packing up food items in their kitchen. #1 website says they close at 9:30. #2 they have a sign on the door that SPECIFICALLY says \"open daily 11 am - 11 pm\". They obviously close at their discretion which is terrible for business and a huge let down to a new customer who is unaware of this weird policy. Tip: come before 8pm and you may be in luck. \n\nI, however, won't be wasting my time twice.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-25", "description": "$18 credit here via PayPal - enough for 2 crepes.\n\nLet's start off by saying this is NOT a place where you take a date and think you're going to have a cute little dinner over candlelight.  This place is most definitely a take-out place, as there is 1 bench and 2 seats at the counter by the window.  I think it's a little weird they don't have seating, as crepes are best served fresh... I was lucky enough to be able to find seating.  You also end up smelling like oil/food because the ventilation doesn't seem too great in the tiny store.\n\nI opted for 1 salad crepe and 1 sweet crepe:\n\nShrimp avocado crepe $9.50 - Shrimp was large and fresh!  Abundance of avocado present.  My only gripe is there was a little too much sauce (asian sweet chili sauce and wasabi sauce) and there was a little too much going on in terms of flavors.  The bottom of the crepe became very soggy and I had to throw it out.  Decently filling, if you're looking for a small dinner.\n\nLychee valentine - I'm not sure if rose and lychee and raspberry goes together very well.  The rose custard wasn't rosy enough and I wish there was more lychee.  But, again, the different fruits and flavors were strange together.\n\nHonestly, I don't ever crave crepes so I probably wouldn't return anyways, but when theres PayPal credit, why not?  Next time I'll try a chocolate crepe.", "author": "Allene T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "I went on a one-day trip to NYC from Boston with my boyfriend and this place was on our bookmarks. After drooling so much over the pictures on yelp, it was only necessary to stop by before our day ended. \n\nMy first impression was how small the place was. For some reason, I was picturing an average sized cafe where you can just relax and enjoy your crepe but nope. There was about 3 chairs and a tiny bench. BUT DON'T BE UPSET. The front of the shop has such a cute presentation of the crepes they offer, much like in Harajuku, Japan. Their front window reminded me so much of when I was visiting Tokyo and I seriously miss it. \n\nThe service was very friendly and the employee right away acknowledged us and showed us their menu.\n\nI ordered Azuki Berries which has 2 pocky sticks, matcha cream, whipped yogurt, almonds, strawberries, Azuki beans, some chocolate cream and green tea ice cream! The wait wasn't bad at all either! \n\nNot only was it the prettiest thing I ever ate in a while, but it was also delicious. The whole crepe was overwhelming to eat even with a spoon but I gladly finished it with no regrets. \n\nThe funniest thing to happen on my trip was posting a picture of their crepe on my Instagram and they used my photo for their Instagram. Happiest day ever.", "author": "Dedania M."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}