{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Located inside the Dekalb Market amongst the different variety of foods. Very friendly service and super fast! After having a not so good or filing lunch I needed something sweet. Ordered a Harajuku Fruit Cocktail Crepe. This comes with strawberries, blueberries, raspberries, mango, bananas, whipped yogurt, custard cream and almonds. Yes all that in 1 crepe! They have a whole variety of crepes and even savory crepes with eggs, cheese, shrimp and even pork belly. This was nuts! I never imagined so many varieties and especially savory ones. Oh and they have a lunch special on savory crepes Mon-Fri 12-3pm. Now I've had crepes but the cool thing about this one is they wrap it up and you can eat it on the go. Sorta like a ice cream cone on the go. Very smart for people that are always on the go.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-14", "description": "Absolutely bs******* ordered two shrimp Avocado and it was just horrible, there were no avocados at all and found only one shrimp and rest is just spinach and red peppers. Avoid this place.", "author": "Sam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "This is bar far the best crepe place I've been to.  I really love Nutella crepes and this place has some of the best I've ever had.  They're light and flavorful and delicious (with bananas!).  Service is pretty friendly and the crepes come up fast.  Highly recommended place!", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Delicious Japanese style crepes. My favorite to order is the Azuki berries crepe, which includes strawberries, Matcha green tea ice cream, azuki beans, whipped yogurt, matcha custard cream, chocolate Pocky sticks, and almonds. \n\nI completely love this crepe because it's not too sweet. I also love all the texture and flavors combined. \n\nAnother popular favorite is the Lychee Valentine crepe that comes with edible roses. I'm not a fan of floral foods and couldn't appreciate this dessert. \n\nI haven't had a chance to try the savory crepes, but they sound delicious.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I couldn't decide what to eat and ended up seeing the savory crepes on my third time around all the other food options. There were so many good options I couldn't decide which one I wanted but the worker was so friendly and patient with me, even giving recommendations. Really enjoyed Michel and he did great making my crepe. \n\nThere also is a lunch special from 1-3 where with a savory crepe purchase you get a free bottle of water and seaweed snack so that was a bonus. Will return :)", "author": "Rachelle K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Good not great.\n\nSeeing all the great reviews and delicious pics, I was excited to try this place out. Employees are friendly and helpful. There is some counter seating inside and a small bench outside. It's a small space, a grab and go type joint. I like the decor of this place, very colorful and fun. The strawberries, bananas, Nutella, sliced almonds, and whipped cream in our crepe was delicious. The crepe itself was OK. It had good flavor but was on the thicker side, almost pancake-like. If it was slightly thinner, this place would be a solid 4 stars. I appreciate that their crepes are wrapped up in a cone-like fashion, so you can enjoy your crepe while walking around. \n\nOverall, I'm glad we tried this place out but I can't say this is my favorite creperie in NY.", "author": "Kimberly J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "After shopping in the mall, the urge of a sweet tooth just kicked in. The displays of the crepes really captured my attention. Customers were sitting in the eating area happily indulging in the thin crispy sweet crepes. There were two types of crepes, savory and sweet. I ordered a Harajuku Fruit Cocktail sweet crepe. My daughter ordered the same one. The cashier gave me a card and said every visit show my card and 10th visit I can get a free one. I have to say it was really good and filling. I was full from just eating half. I was truly satisfied and I will return when ever I'm shopping in the mall.", "author": "Ria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Going to echo everyone else on this page and recommend the matcha stripe crepe. I'm always down for strawberries and this one had plenty. I will say that it tasted a bit bland without ice cream though so highly suggest shelling out the additional bucks to add it in! \n\nAlso gluten free which is a plus for those with allergies.", "author": "Anny Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "I greatly enjoyed this place, it had a nice feel and the crepes were delicious and in a cone form.  \nI've had crepes before and they were awesome, came here and wasn't disappointed.  \nWorth the trip.", "author": "Harold M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Eight turn crepe is heaven on earth, wrapped up and made into a hand held treat for your taste bud pleasure. \n\nI had the berry crepe with ice cream. The berries were super fresh, the crepe was made before my eyes. Go here and try their creative treats. NYC comfort food! \n\nCome hungry. The portions are huge. I couldn't finish mine. I can't wait to traipse to Chinatown and have another one.", "author": "Gabriela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "It was delicious and very filling! I shared mine with one friend and I was still STUFFED. The quality of crepe is delicious too, I had the matcha strip w/ matcha ice cream. The chocolate drizzle made it quite intense and it was 10$. It is quite sweet but similiar taste to T-swirl\n\nThe space is quite small but it's good for like 3-4 people to sit and chat for a bit.\n\nThe service is nice they're friendly and gets ur order done in like 5-8minutes.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "DO NOT EAT HERE.\n\nI bought my girlfriend a savory crepe and she got food poisoning! \n\nI forget the menu number/name of the crepe, but it included egg white, spinach, and truffled mushroom. Yes, the people who work here are very friendly, but the quality of the food is obviously terrible and they most likely don't store their food products properly. Based on the other reviews it looks like some people actually had good experiences here, but do yourself a favor and don't risk it! This place seems to be a hit or miss, you can either leave with a delicious crepe or, a recipe for food poisoning, it's a gamble that's not worth the risk.", "author": "Aly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "This place has been on my radar for some years now and I finally paid a visit. Now I can't stop thinking about the crepe I had this afternoon.\n\nI ordered the strawberry banana, which comes with strawberries, bananas, whipped yogurt, custard cream, and sliced almonds. I added a scoop of vanilla cream, although for $2.50, that was a frivolous addition. I only have good things to say about the crepe: it was light, fresh, and yummy. You can see every step of the process from the hot plate and into the cone. I recommend coming hungry because the portion size is hefty and I was close to not being able to finish mine. \n\nBe prepared to have to take your crepe to go because the store is tiny and has enough seating for about six people. When I went in at 3:30pm on a Wednesday afternoon, it was full, but I was able to grab a seat just as a couple was leaving. People will rotate in and out about every 15 minutes or so. \n\nEight Turn Crepe offers both savory and sweet crepe varieties. The BLT seems to be a popular option, so I know what I'll be trying next.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "I usually have a great food experience there. But today, it was bad. I went there for lunch. At first, there was one guy making wonderful Crêpes during the busy hour. But then, a girl walked in and removed the (not fully cooked) Crêpe and set it to cool. She tried to help the guy worker to make order but had a hard time. Guys tried to help her out. I saw her put too much sauce and too little fruits so that it was hard for her to swirl the up. I think she might be a new worker? The crepe taste too soggy. I thought I might be too picky to her so I let my friend try the crepe too. Unfortunately none of them like it this time. I hope they can train new worker before they serve.", "author": "Eva Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Excellent, very fast and absolutely delicious, did not expected. Plus they are the last ones to close and customer service is very good.", "author": "Mei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "This place used to be in SOHO, and I made sure to stop by each time that I was in New York.  When I saw that they were no longer there I thought that they were closed for good.  Thank goodness for Yelp!  Now I know to hop on the subway and get over to Brooklyn for the best crepes in the States.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "We used Eight Turn Crepe to cater a faculty luncheon at our high school in Long Island City. They did a fantastic job. Everyone loved the concept and food. They were on time, professional and were very accommodating to our needs and wants. Food was delicious! We look forward to using Eight Turn Crepe in the future for our other parties.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "I feel sad when people compare their crepes to how the typical japanese crepes should be. In my honest opinion, the sweet crepes sold in Tokyo are 1000000% way better, and the batter they use to make the crepe are of better quality than the ones sold here at Eight Turn. I have tried the Azuki berries crepe here once, and it was a big let down. It did not compare to the ones sold in Japan. The quality of the crepe itself was a bit mediocre, and combined w/ the strawberries, azuki beans \u0026 green tea ice cream - made the taste even worse. \n\nShop is small, but staff was nice.\n\nI still to this day have not found a sweet crepe place that is identical to the ones sold in Tokyo.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "Tried Chicken Thai this time. It doesn't taste very Thai. It's ok. My gf's harajiku taste better even though they ran out of mango this time.\nChicken marinated in red-orangish sauce which is very salty. Lack of refreshing taste like lemon or cilantro. Maybe some coconut would work.\nBlack sesame shake was good too.", "author": "Nathan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "We stopped by late night and there were ppl waiting around it. There are no seats inside but it's a nice area to grab a crepe and take a walk around. We got the Azuki crepe which was pretty yummy. It was a little smaller than I thought it was going to be. It was also a little pricey. $9.25. But I would recommend it and would maybe come back.", "author": "Tanya Z."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}