{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "These crepes are phenomenal! I had a fruit crepe with ice cream and it was perfect and so easy and convenient to eat. The fruit was fresh and the wrap was very delicate and golden. I need to go back ASAP.", "author": "Kathleen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "I love this place!! My new favorite crepe place! The owner of this place came by where I work and noticed we had his fliers displayed at our store. He was so nice and gave me a free crepe card to get any one order of any crepe we wanted for free! I went in the following week and I got the Avocado Shrimp crepe and my boyfriend got the Fuji Apple crepe. They were the biggest crepes I've ever had. They were stuffed with so much stuff and they were very delicious as well! I can't wait to go back and try more. I want to try the Lychee flavored one next time! I think for the price it is really worth it. Especially compared to viva la crepe which is pretty pricey.\n\nThe only thing I would improve is maybe the staff. The only reason I say this is because everyone seemed quite friendly and smiled accept for who I think was the manager. He didn't seem very friendly and just seemed bored. Otherwise all the other employees seemed friendly! \n\nI also love the Japanese theme. They even have fake crepes displayed at their window just like typical Japanese restaurants in Japan.", "author": "Chloe H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-27", "description": "I was here with my friend on a cold January afternoon. The shop was warm and cramped with few seats. Seating area was a bit messy as there were bits of sauce and napkins on the table. But we were lucky to score two seats as once we were sat, flocks of people came in. But anyway, the crepe I had was good, but not memorable. Good thing was a rather short waiting time.", "author": "Liza D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "The crepes are pretty good, when you get them.  But, man, this place is slow.  The place has been crowded just about every time we go but a twenty minute wait to get something you eat on the street is too long.  And we all received our crepes at different times, if we order within a minute of each other a ten minute spread on crepe receipt time is too long.\n\nIf there are people in the place keep walking, it's not worth your wait.  \n\nThe woman who seems to run the place is a little odd too.  If I was to guess I'd think it was an episode of New Jersey housewives where they all have to pretend to get jobs.  She used to be pretty abrasive but it was better the last visit.", "author": "Timont H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Delicious gluten free Crêpes. I had the BLT and really loved the flavor, it even had a little spice to it. This is a small establishment, not really a good place to try to sit down and eat, but a fun place to stop by for a on the go meal.", "author": "Hunter B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-22", "description": "This is one of the greatest places for crepes!! The crepe dog was very tasty! However, staffs were rude to customers :/", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "I thought this was awesome food for the cost. I had the seaweed/asian crepe which is more of a lunch/salad crepe. I thought it was great and super fun, and a fun way to eat lunch. My partner had a breakfast crepe which was also very good. Only downside is there are only two little places to sit, otherwise, you have to do takeout. The service was super friendly. If I lived nearby I would go here all the time.", "author": "Christine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "Walked in already full with zero intention of buying a crepe. I was just going because my friends heard good things about this new, charming spot. I got the banana nut chocolate to-go for a friend and I ate the whole thing myself =X. It was fresh and yummy. The crepes is stuffed to perfection with fresh whole berries, house made truffles, fillings and gelato. The staff is efficient and happy! The owner was there keeping tabs and was sweet, lovely and happy to give her recommendations. Best of all, the coffee they serve is La Columbe!\n\namazing crepes, nice variety\nhappy, helpful staff and owner\ngreat location\nclean space\nLa Columbe coffee\n= YAY", "author": "susanna m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "A neat concept, but nothing outstanding, for a $12 crepe.  I got the smoked salmon crepe and added scrambled egg.  It was good-- not bad-- but it brought nothing special to the table.  I've had much more tastebud-awakening experimental takes on the lox bagel at Wafels \u0026 Dinges and Mile End.  There is a counter here with two barstools and just a couple seats for while you wait, so this really is take, eat and walk spot.  It's good but I disagree with the sentiment that backs all the nearly 5 star reviews, as I would only come here if I was hungry and passing by at mealtime.  I would not make a special trip.", "author": "Jason N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "I loved this place the first time I tried it one year ago. I don't know why it's getting worse and worse. Today I just felt really uncomfortable after having the matcha stripe crepe.", "author": "Wenyi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Delectable if you enjoy crepes!!! This is a new place, and you should try this place of awesomeness!!!", "author": "Andre D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "OMG!  That's all I can say!  All the crepes we ordered were interesting, original, and delicious. I'd say the favorite savory crepe was the BLT, but the Thai chicken was excellent as well (albeit spicy). The dessert crepes, however, were amazing. We tried the matcha stripe chocolate with homemade chocolate truffles which was so yummy. But the lychee Valentine with edible rose petals was also amazing. Highly recommend!", "author": "Jonelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-30", "description": "They make their crepes really pretty but they lack in their ingredients. They don't put a lot of the chicken or fruits. I don't think it is worth it but it is definately worth trying.", "author": "Daryl T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I don't usually eat crepes.. I prefer waffles and pancakes. So judge my review as you will...\n\nI love the crepes here, especially the sweet ones. I've been here twice and tried the Matcha Stripe Chocolate and the Fuji Apple Pie. GET THE FUJI APPLE PIE! Even if you don't like raisins or walnuts, keep 'em in the crepe (unless you're allergic.. of course) and feel that delicious chewiness and surprise crunchiness as you eat the crepe. I appreciate when there are different textures in food, so I loved the Fuji Apple Pie. The crepe itself isn't too heavy and has a lightness that doesn't settle like rocks in your stomach.\n\nI went here with a friend who has tried a savory crepe and a sweet crepe, and she loved both. You can order a custom crepe, but I don't know how much the standard pricing is for the crepe, only the pricing for the topping. She got a crepe with strawberries, chocolate sauce, and whipped cream, and it came out to $6.50. I think the most inexpensive crepe here is Double the Eggs, Double the Fun, which is $6. I hope they come up with a custom ordering menu... cause that would be fun to play around with (and also.. NUTELLA please? :))\n\nOne thing--don't bother with the Yuzulade. That was just iced water with some candied Yuzu peel and pulp. Not that refreshing. At $3.25 a cup, I expect it to at least quench my thirst... nope. \n\nThis place is small with room for 2 seats and a small bench outside the store.. so if you want to eat here, I would go at a quiet hour or go eat it in a park. I love the wrapping it comes it as well--very simple yet smart and convenient.", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "Great Japanese styled crepes. I prefer the japs one over American ones. I always order my crepe with green tea ice cream on top.", "author": "Ying Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "Why do people review more often when have a bad experience? I don't know but I can't resist, I've been here many times and I can definitely say it's inconsistent. Some times there's a couple of guys there totally passionate about making good crepes, there also a young lady who's super professional and chipper you can't help but to smile.  Unfortunately I really wanted a crepe on the wrong day. yesterday Saturday April 30th. if the store opens on time usualy nothing is ready on time so don't stop here if your in a rush.  The woman charges me then turns on the stove and tells me ill have to wait five minutes for the stove to heat up. I'm annoyed why aren't things ready 25 minutes after they open. I get that it's soho and things are more laid back but why open doors if they are not ready to go.  So I wait 10 minutes and she starts making the crepe while she's talking to someone on the store phone about who is coming in or not and what time she's going to leave. She's setting things up while she's on the phone and making a crepe which was definitely not turned 8 times but who could blame her for not counting she's busy on the phone right? Then she starts with the eggs and pulls out her personal cell phone and makes some more phone calls. Now she's busy trying not to drop her phone while she's breaking the crepe. Then she apologies to me. Now ive been waiting forever, and I was hoping this would be quick what joke. There's also now another guy waiting. I asked for my money back. She apologies and looks at me as if I'm going to say it's okay, it's not okay, I wasted so much time and now I'm late and still didn't get to eat.  I walked over to viva la crepe next door.  They were ready they took my order and quickly made me a crepe with full attention, never picked up a phone in the very few minutes it took to make the crepe, I was able to leave at an appropriate time with no hassle. Other than these problems today I like this place the menu is great but I never know if I will have a good or bad experience, ive had bad ones before here and good ones too.", "author": "Kay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "My bf insisted on getting the Crepe Dog, the one w/ the Japanese sausage! Sooooooo good! Consists of daikon, corn, ketchup, and I think some japanese mayo.  If you're an Asian girl, then you understand how everything needs to be cutely presented. This place is a cute little spot in Soho, good place to grab a snack to-go, but crepes are large enough for a meal. Will be back to try the dessert crepes w/ the green tea ice cream. Yum.", "author": "Janine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Super awesome crepe! We got the Azuki crepe, and it was totally awesome! Will come back for more!", "author": "Panuruj K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Can here with a group friends and everything was extremely good! \n\nWarning - there's not really a place to sit or eat inside. The whole place only has standing room for about six people total.", "author": "A G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "After trying Japanese style crepes in San Francisco, I came back to NYC and found this little gem. It's a little pricey, and could use more fruit, but it's very yum, nonetheless. It's a little out of my way, but I would definitely come back to try the other crepes if I'm ever in the area!", "author": "Helen L."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}