{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "LOVE this place!  It's a new go to for me and my coworkers.  While the food speaks for itself, the staff is incredible and so sweet! If you're looking for a hip new lunch spot, GO HERE!!", "author": "Candice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Amazing crepes! You gotta try matcha and fuji apple pie. I never had such good crepes. I will come back here again for sure.", "author": "Kenny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Excellent crepes. Went there with my gfs and daughter tonight. It was the best crepe that I have ever had. My 3 y/o daughter could finished a crepe herself. It was absolutely delicious. One of my gfs had shrimp avocado crepe and she said it was very good. I will try that next time.", "author": "Alicia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "I'm not usually a big fan of savory crepes but the \"double the egg, double the fun\" crepe is the perfect breakfast crepe. The coffee, too, is quite excellent. The sweet crepes are also good - I've had strawberry banana and twinkleberry parfait here - though the big portion is a little overkill of sweetness for me I'm happy to share it. The small shop location has the ambiance of a Japanese sweet shop, appropriate of its Japanese origin, with the politeness of the staff to match plus the friendliness of a hip American sweet shop.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "It's very rare that I take the time to write a review about a recent meal; but Eight Turn left such an indelible impression on my taste buds that I felt inclined to share. The crepe was delicious and the woman taking my orders was very accommodating towards my desire to customize the crepe. Everything in this establishment is very well-conceived. The crepe is handed to customers in a paper wrap with perforations which allow you to tear the wrapping as you make progress on the meal. The facility was extremely clean and the employees are inordinately friendly. It's not common to see someone with such a positive disposition in NYC. I strongly recommend everyone try this place for dessert or a quick meal.", "author": "Simon S."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}