{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "It's a nice place.when you have dinner around this area,after dinner,you still feel a little bit hungry,the food would be your best choice.", "author": "Edie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-04", "description": "Based on the reviews, I'm guessing you should stick to their sweet options. I had the shrimp and avocado crepe, and it was definitely not worth $10. It had maybe two pieces of shrimp and three slices of avocado and I was not full at all, although it did taste pretty good. I will have to try their dessert crepes if I come back.", "author": "Olga R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "The chicken teriyaki is a great meal upon on it's self.  Sweetness of chicken and the sweet thai chilli sauce with the melody of feild greens and corn. Topped off with a quarter of a hard boiled eggs. Clearly its a must try.", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "When you see how little things actually are put on your crepe for your 7.5 plus bucks. You know you are probably just paying for their rent and fancy look.  First time and last time for me.", "author": "Lulu X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Interesting crepe shop with some traditional combined with Asian inspired flavors on the menu.  Another distinguishing factor is that their crepes are served in a hand-rolled cone shape, which has its merits...and flaws.  \n\nBy rolling up the crepe, you get a nice wide, cross-sectional view of what's inside, and every creation looks delicious.  It's also handier to eat, because you can hold it in your hands and walk around taking bites without making too much of a mess...there are also no tables in the shop for you to fork and knife it.  \n\nThere are some negatives to this, however.   Because the pancake wrap is made first, then laid out to put the toppings on, by the time it gets to your hands, it is already cold.   Which is a shame, because they truly do look beautiful, and a clear effort is made.  Another minor problem is gravity.  Any crepe you order with sauce, ice cream, chocolate, or anything liquid (basically all of them), will have a disproportional concentration of it end up in your final three bites because it all drips to the bottom.  \n\nThe ingredients used here are general of solid quality, and very fresh.  The menu is well thought out, and the toppings and flavors in each crepe is well-balanced and tasty.  However good, I just can't enjoy a cold crepe that much.  Unfortunately the feature sets  Eight Turn Crepe apart also is the cause of its biggest flaw.", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-02", "description": "This place just opened, and it was pretty crowded when I went today around 5:30pm. It's a small space and there's not much room inside so most people were waiting for their crepes outside. I got the azuki crepe with matcha custard, azuki beans, strawberries, and green tea gelato from il lab. They made my crepe pretty quickly and you can smell the scents of vanilla from the crepe batter wafting around while you wait. While the concept of hand-held crepes isn't that groundbreaking, the best part about these crepes are the whipped yogurt cream. It's light and tangy and goes perfectly with the fruit! The crepe itself is soft and chewy though because it's all wrapped up, so it might be different from the regular crispy crepes that you are used to.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "This place has an awesome selection of crêpes, all very creative and different from you would see in a normal crêpe. Its also delicious here and not just for show.  There's a lot to choose from, savory or sweet. I recommend anyone to try at least once. Limited seating however.", "author": "Gilbert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "Try the shrimp avocado its absolutely delicious!", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Yummy! Good for breakfast, lunch, a snack or dessert. Fast and yummy!", "author": "Crystal W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-19", "description": "This place is not for everyone, the majority of crepes are from Asian menu. I got teriyaki chicken, and it didn't taste well. Had to throw half of it. Also they don't serve you well. I asked for no onion, and still got a few pieces in my crepe. There are better placed to go for crepes.", "author": "Nataly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Delicious ingredients, solid variety on the menu. Perfect for dessert after having a light meal", "author": "Luke L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I ordered the Chicken Teriyaki crepe and it was even BETTER than it sounded online (which rarely happens)!! It was truly delicious. A bit difficult to eat (I definitely wouldn't recommend attempting to eat it on the go), but well worth the messiness. I can't wait to go back and try one of the dessert crepes (I would've gotten one this time, but I didn't think I could down it all on my own and my friend was too full to split one). Hands down the best food experience I've had in the city in quite a while.", "author": "Amanda O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "It's overpriced for what you can get. I've only tried the mixed berries and I expected more berries inside the crepe :(", "author": "Iris Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Tried their strawberry and banana crepe with vanilla ice cream. \npretty good. \ncoming back for salad and others :D\n\nnice workers.", "author": "Jody L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Best crepe Ive had in NYC. I had the harajuku fruit cocktail. Light and not stingy with the filling ingredients like some othe crepe places. Easy to eat and ingredients are well distributed till the bottom. However it takes a while to make one. I went by at lunch time around 1 pm. A girl in front of me ordered 4 to go. It took almost 15-20 mins of wait which was a bit frustrating.. my lunch break was ending !", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "Im not a huge crepe guy..but this place is exceptional. The menu is well crafted and thought out. They have creative crepes like the matcha chocolate crepe..that we had.  It was delicious!  The attention that is put into crafting these crepes is so much fun to watch..it truly is an artform. I cant wait to come back and try another one.", "author": "Chad R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "OMG one of the best crepe i've ever had!!!! Their berries are fresh and green tea ice cream has a bitter strong taste. Love it! Slightly expensive for dessert but its huge so all worth it.", "author": "Jenn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "I was going from broadway to rice to riches, but then i walked to this and couldn't resist!! So worth it and I will remember this place forever!!!", "author": "Enni K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "Delicious crepes! Tried the eight lox, BLT and Azuki berries crepes. Soooo good! The BLT crepe is an interesting concept and you would think that they use the usual thin cut bacon, but they use thick juicy bacon and it is amazing with the avocado in it. Try it for something different and savory!", "author": "Flo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "This place is tiny but their crepe display window is quiet an eye grabber, you cant pass by it without taking a look . I got there around 6ish , it was cold and getting dark so I didn't have to  wait long for my crepe. I ordered a turkey delight , originally wanted to try the strawberry with match ice cream and red bean crepe , but i was cold and hungry from all the walking and shopping around the area . You know how you get all excited and your mouth gets all watery from watching them make the crepe but when you take the first bite and it didn't live up to your expectation ? Well, that was me . My face went from :) to :( . The crepe was cold ... I was like huh ? I never had a cold savory crepe anywhere , I was so disappointed. I would come back again to give the sweet crepe a try , because i cant resist their cute looks. Hope next time wont disappoint me.", "author": "Anna Y."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}