{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "Came here today after meeting some friends for a quick happy hour at Gatsby's next door. The place itself is a super tiny hole in the wall, with a bench and just 2 stools. Luckily when we got there, the people sitting were just leaving. If not, I think we would have passed since it was rather chilly and windy out and standing outside eating would not have been an option tonight. Anyways, I decided on a savory crepe -- their famous BLT. Kevin ordered the Azuki berries and Jeanne had the Matcha Stripe Chocolate. \n\nThe BLT crepe comes with applewood smoked bacon, shallots, avocado, lettuce, cherry tomatoes and chipotle aioli. I found the crepe to be just okay. It is definitely visually appealing and appetizing -- served cone style and overflowing with all the colorful ingredients..but that was about it! I expected the crepe to be warm but it was cold! The bacon was thick cut, which I usually love, but all the pieces in my crepe were mostly the fatty stringy bits. It did not come with shallots as stated on the menu. I really liked the chipotle aioli but my crepe was so drenched in it that it was just overpowering after a few bites. There was a pool of it in the bottom of the paper cone, too. \n\nI tried some of Kevin and Jeanne's crepes and didn't find them to be memorable either. Like mine, their crepes were not warm, soft or chewy enough. I also found the chocolate truffles in the Matcha Stripe Chocolate to be an odd textural component to include. The bites with the truffles would be super rich, creamy and chewy while the bites without were then underwhelming? I don't know..it seemed too \"thrown together\". I would have enjoyed them just on their own. Ultimately, it didn't work for me. \n\nHoping for a better experience at Creperie.", "author": "Joanna N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "I was pretty excited to try this place as I've always walked past it many times. Each time I was enticed in by their delicious display of goodies but I was either too full or not hungry enough for a crepe. \n\nDuring my final days in NYC I decided to take up my last chance of trying this place. As a matcha fan I obviously went for the matcha chocolate. It turned out to be a disappoint because of the crepe. It wasn't thin or crispy. It was more like a soggy pancake. The texture was way off. \n\nThere's not much seating here either, it's mostly for grabbing and going.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "A tiny and great place to grab some lunch, dinner, or dessert crepes. You're best to take your crepe on the go because there's 3 stools and one little bench. Although a tiny place, it is a cute place and you get to see your crepe being made. \n\nI was looking for something savory, so I ordered a Shrimp Avocado Salad crepe. The crepe had shrimp, spinach, avocado, carrots, wasabi tofu sauce, and Thai chili sauce. It was so pretty, I almost didn't want to eat it. Took a bite anyway and it was delicious. The shrimp avocado was sweet, light, fresh, not greasy, and filling. \n\n$9.50 for a delicious crepe is so worth it. The staff makes the crepe really quick once you have made your order. I have to come back and try the sweet crepes.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "The crepes here are good but not great. I still love the crepes at T-swirl crepes. Its the way they infuse the flavors that got me hooked on T-swirl. \n\nAt Eight turn crepes, I ordered #18 Harajuku Fruit crepe. It was the only one I tried so far. My friend ordered the savory Lox crepe. She said it was good. Price wise this place is more expensive then T-swirl in Flushing which is a turn off especially since the crepes are expensive already. I recommend T-Swirl if you are ever around Flushing Queens.", "author": "Jenny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "I love this place!  It is a tiny store and the wait can be long, but its totally worth it.  I can see why some people may not like this type of crepe because it's Japanese style and not the usual French style.  I had Harajuku Fruit Cocktail and it was amazing.  The fruits were all fresh, cut in perfect size and placed evenly.  The crispy almonds definitely added a different texture to the whole soft crepe and made it heavenly.  The edges of the crepe were crispy and the inside was soft.  I am definitely coming back for other flavors.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "This cute place is super tiny but the crepes are AMAZING. Recommend Harajuku Fruit Cocktail Crepe for a perfect snack on the go; it's so good!!! For a perfect light and refreshing meal on the go, recommend Shrimp Avocado Crepe. Also love the Japanese bacon on the BLT crepe, it's sooo juicy!! The staff are super friendly and attentive.", "author": "Cynthia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "I got the mango crepe and its has real mango pieces with yummy custard cream inside with a crunchy granola topping for added texture. Yumm!!", "author": "Bhavi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "I only tried a savory crepe this time, but it was yummy and I am itching to go back.\nThe smoked salmon crepe is missing another layer of flavor to call it complete, but the  crepe itself was awesome! Crunchy edges with a soft center... yumm! Ingredients were fresh as well. Will be back!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Eight Turn Crepe is a great place to go to when you are done with your shopping in the nearby Soho. It is a tiny place that can be easily missed if you have not seen the crepe displays on the outside! They advertise their usage of rice flour crepes instead of the normal flour. The menu has extensive options of both savory and sweet dessert crepes. The crepes come in cone-shaped and all you have to do is bite it! This is a great place for anyone who loves sweet but don't want to feel guilty over your dessert! This is the best healthy alternative for you!\n\nI ordered the Harajuku Fruit Cocktail Crepe - it was the fruitiest crepe of all! It has fruits like strawberries, raspberries, blue berries, bananas, mango, almond, and some cream. It was a a delightful and light treat I must taste! The cream was very light and not overwhelming. The fruits were evenly spread out throughout the crepe and the flavor was very well blended together creating the fruitiest crepe of all! I would recommend this to starters. The crepe part of it was warm, soft, and a little crispy at the corners. The crepe flour itself was very light and delicious!\n\nI have also tried the Lychee Valentine which has lychees, rose petals, raspberries, rose flavored cream, and almonds. The name of this crepe sounds so romantic and the look of the crepe is just so beautiful! However, I did think that this crepe was very bland tasting. I was tasting the can lychee here and then the edible rose petals here... and then raspberries over there. I feel like the flavor of this crepe was not well put together. I can understand since can lychees aren't fresh and it's typically really hard to bring out the lychee flavor.\n\nMy friends tried the Azuki Berries which has strawberries, matcha green tea ice cream, and chocolate pocky sticks. I took one bite, it was very tasty too!\n\nThe crepes can be a mess to eat especially you're walking in the street. They do provide utensils like spoons or forks! The line goes out the door and around sometimes during lunch and dessert hours so try to avoid those times. \n\nI would have given this spot a 5 stars despite the fact that I did not enjoy 1 item out of everything on the menu. I had to knock out 1 star for customer service of one younger employee at the counter. I didn't appreciate the fact that very few times I have been there and with different guests are quickly brushed off just so she can get back to her conversation with coworkers as well as given that dead look to all her other customers.", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-29", "description": "So glad I was finally able to try this place after hearing so much about it. \n\nI'm not a big fan of creamy things so I went with the I went with the truffled egg white omelette crepe minus the cheddar cheese. The egg whites, mushrooms, truffle oil, and spinach make a good combination. Very light and fragrant though wish the insides were piping hot instead of lukewarm.\n\nThe actual crepes taste delicious. According to their menu, the crepes are rice crepes which makes in my opinion makes it lighter and fluffier but still retain some crispy parts. I guess it's also *cough* healthier *cough*. \n\nIn terms of presentation, the crepes look as good as they taste. Of course food doesn't have to look good to taste good but a nice appearance does amp up the flavor. Call it the placebo effect.\n\nThe way they wrapped up the crepe in the form of a cone was both convenient and annoying at the same time. Convenient to hold, but hard to eat. Thankfully, the paper cone has a dotted line indicates where you should rip the paper to eat the crepe because my first inclination was to stick my face into the top. Unfortunately, the paper cones are not water-proof as the tofu sauce that came with my crepe was dripping the entire time through the hole at the pointy end.\n\nTo pair with my savory crepe I also got the Yuzulade. Very sweet, but refreshing. Got a blast of flavor from the orange rinds.\n\nEven though I hate creamy things I would like to try one of their sweet crepes next time. My friend who ordered one said the yogurt was a lot lighter and fluffier than she expected. Looking forward to exploring the menu more.", "author": "Jocelyn K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "HUGE (not the ad agency, but the size) CREPES. I ordered the harajuku fruit cocktail, and it was filled with fruits and berries! Definitely, big enough for 2 to share. \n\nCool place to grab dessert right after a meal, or if you're just feeling peckish. \n\n8 / 8 stars for a store you should not TURN away from! Let the nomming commence!", "author": "Eric T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "I don't care how full I am - there is always room for eight turn crêpe. The perfect dessert after Lombardi's just steps away. \n\nIt's pretty tiny and there is limited seating inside so expect to take your crêpe out for a walk with you. Even if there are seats available, they are chairs lined against the wall - not too comfortable with other customers waiting in line or for their crepe in front of you. \n\nTry the banana nut chocolate + vanilla ice cream. Sooo yummy!", "author": "Sofia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "The Shrimp and avocado crepe is absolutely delicious. The girl at the counter was also very friendly.", "author": "Candice K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Even better than anticipated!!\nJust off Broadway we found this little crepe` French-Asian fusion kitchen. It's a sliver of a place just big enough to step in, order your food, grab it then go. We were on the go so it was perfect for us. They have desert and savory crepe` wraps. I had the Chicken Teriyaki wrap, OMG! It has cut hard boiled egg, chicken, spinach and other wonderful flavors and textures. They wrap the wraps in a cone like paper so we were walking down the street eating them like ice cream cones. As we walked by everyone was asking us where we got them and commenting on how amazing they looked. They hit the spot!  Two thumbs up", "author": "Tanisha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "Had a quick (small) bite to eat from here. You eat with your eyes first, and they looked delicious! We went with one savory: the egg white, mushroom, truffle, spinach, and cheddar cheese crepe was good but got very drippy and wet quickly. The other was sweet lychee Valentine I would come back for this. Raspberry, lychee, silvered almonds, whipped yogurt strawberry rose custard and edible rose petals. Yum yum! The insides were so tiny, we were lucky we got the counter seats, definitely more of take out place. \n\nThey could bring stand to bring down the prices though $9+ for maybe 7 bites is steep even for NYC.", "author": "Cibi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "Something was missing from this crepe and I don't know what. It looked good at first. The pictures were really pretty....but...\n\nMy taste buds were not that impressed. I got the matcha crepe one without ice cream. \n\nThe truffles were good on top but that was the only thing that impressed me about it. the chocolate sauce and other ingredients taste like something someone can whip out at home. I didn't think the whole thing held together well. Won't come back to try anything else.", "author": "Shushu C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "All the dessert crepes look over-the-top delicious but it actuality it was just okay tasting. It may have been that the crepe was a bit soggy and not crispy like other crepes I've had (namely Crepes Canaveral from Brittany in EV which is sadly closed). They have a mix of savory and sweet crepes - we had the green tea ice cream crepe with fresh strawberries. I liked the green tea ice cream and little additions like the Pocky sticks and red bean on top, but sadly presentation didn't makeup for taste. Cute place to try though. Very little eat-in seating, but plenty of people were enjoying theirs outside the shop.", "author": "Queena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "I read about Eight Turn Crepe on Tasting Table and, since I happened to be nearby yesterday, decided to try it for dinner (after browsing their online menu and drooling over it). Turns out it happened to be their grand opening day!\n\nThe menu is a great mix of savory and sweet crepes, most of them in the $6-9 range. They also have coffee, tea, and milkshakes. I decided to go with the tofu edamame salad crepe, which came stuffed with tofu, spinach leaves, edamame, carrots, hard-boiled egg, green beans, and pistachio bits. I loved how there were plenty of tofu cubes and hard-boiled egg chunks - the \"meat\" of the salad. I also really liked how the pistachios added some crunchiness. One thing I didn't like, though, was the dressing/sauce. The menu description says \"Eight Turn sesame dressing\" and \"Eight Turn tofu sauce,\" but I didn't pick up any hint of sesame, and the sauce tasted too mayonnaise-y for me.\n\nThe place itself is super tiny - there's the counter where you order, and then a very small counter in front of the window where there's standing room for about 2 people. It'd be nice if they added a stool or two.\n\nAlso, be warned: if you're taking your crepe to eat on the go (which you probably will be, given the lack of seating), take plenty of napkins. Your crepe will get messy towards the end.\n\nConclusion: Lots of cool crepe toppings, both savory and sweet. The savory crepes make a good lunch or light dinner. I definitely want to come back to try their sweet crepes!", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Came in with the boyfriend today after running some errands around soho. Was walking by and suddenly came to a stop which shocked my boyfriend and he immediately knew I wanted a crepe. I wanted one of the savory crepes only because the mushroom Caesar salad sounded good but we opted for the Fuji Apple pie. Listen here, I don't like apples. Or apples pie for that matter. But this wasn't Apple pie. We added a scoop of vanilla ice cream and bam, I was hooked. What the hell was in it? Crack? Honey? Caramel? Walnuts? I don't know but I couldn't stop eating it. I need to come back.", "author": "Song L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "I love this tiny establishment. I love each and every crepe they have here. The best crepe I've ever tasted. So delicious!! \nI will always come here when I'm in the area", "author": "Yannie H."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}