{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "I was on set break for lunch, so I needed to get something quick and closeby. I stumbled upon this place after walking a few blocks. There were a lot of selections. My crepe had a nice blend of mushrooms, egg whites, and spinach drizzled with truffle oil. Also, the cashier was extremely friendly. I will add that the crepe was surprisingly filling, and well-priced.", "author": "Spring Ines P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "Today was our first time here and we absolutely love it! My girlfriend and I decided to try their Matcha Stripe Chocolate and all I have to say is, it's amazing. The employees were very friendly. I would recommend people to come here even though there are little seatings but will definitely come back! Maybe will try the NY Blueberry Cheesecake for my next visit.", "author": "Bill Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "It doesn't seem like good business strategy to open a crepe shop 3 doors away from another crepe shop. However the folks at 8 turn crepe were so confident that they just went forward.  It is paying off. The place is jammed on the weekends so I usually stop in on my way to work for the harajuku crepe. Its awesome. Accompany that with a hot milk tea , and youre set up for a thoroughly delicious Tokyo morning. Price is also reasonable for NYC.", "author": "Elle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "My first Yelp review ever goes to Eight Turn Crepe! I've been in love with crepes for a long time and have tasted great crepes in NYC and Paris. It's so amazing that this place infuses Japanese accents into French crepe and the flavor turns out to be magical. The rice flour enriches the taste with a soft and crispy touch. The yogurt whip cream is just genius, lighter and tastier than regular whip cream. I got #7 which includes the matcha sauce (i love matcha everything), strawberry, chocolate fudge, pistachio, chocolate sauce, and yogurt whip cream. It was so delicious but at the same time i didn't feel the sugar was overwhelming, which is awesome. I love how delicately they make and serve the crepe, which makes the whole thing more delightful. Also i thought the paper container they use is very smart, with solid bottom that won't let the sauce leaks out and an easy-to-peel spiral neck. Next time I would love to try one of the salad crepes or the #9 with matcha ice cream or a pocky stick :)", "author": "Eva S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Gosh, waited so long for a Japanese-style crepe shop to open and my wish finally came true!! You can take a look at their crepes displayed at the window and I guarantee that the crepe you order will look exactly the same. I love how Japanese food places are so credible and consistent in that aspect. They want customers to see what their food will look like and provide you with the same quality as they show it. Oh and of course, their crepes are loaded with fresh ingredients and are absolutely scrumptious! I highly recommend the Matcha.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "i just love it. i had #9 and they make it just how i envision a perfect crepe to be. they arrange stuffing inside carefully so it doesn't spill, which usually happens with crepe. would go again anytime.", "author": "Jesse L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-14", "description": "Good crepes, not the best, not the worst. It seems to depend on the day of the week because sometimes, the crepes are really soggy. Who likes soggy crepes? And no, I did not order the ice cream or savory crepes. At least their ingredients are fresh. \n\nWhile the staff is generally nice, tonight must have been an off night. The guy at the register was confused by actual cash, especially coins. I had to give him a math lesson. First pen and paper, then the calculator function on the iPhone. Confusion still persists. I should have used the calculator first. But seriously, any guy working the register should know basic math. \n\nIf you want possibly soggy crepes with fresh ingredients, go here. But bring a credit card unless you, too, want to give a math lesson and walk out frustrated.", "author": "Maddie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "My first crêpe here was so good. It wasnt too sweet and just hit the spot. It was so easy to eat without being messy and I love it. It was so crispy and the fruits were amazing. I loved it.", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "I tried the berry mix crepe and it was pretty good, the pricing was very reasonable for Manhattan ( beats going to IHOP in the East Village ).  You can add ice cream for extra , I declined to but it was still a good meal.  They have dessert and meal options,  I will try them for lunch next.  Not too much room to sit and can get a little tight when busy but still 5 stars because for $8 in SoHo I have no complaints.", "author": "Jared D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "I did not have high expectations but the shrimp avocado crepe surprised me! Batter - light, fluffy and was able to hold the savory   toppings very well. Filling - very fresh! From the shrimp to the sauce. Small detail - the to go bag. The crepe perfectly fit in the bag and was able to hold the crepe in place until I got to my destination. Overall, good place!", "author": "R D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "I have been craving Japanese style crepes since the shop near St. Mark's closed a few months ago.  I can't remember the name of the place at St. Mark's but there was an old man that ran the shop.\n\nAnyway, I loved Eight Turn Crepe's crepe.  I had the one with strawberries and bananas and I was quite pleased.  I scarfed it down my face.  I can't wait to go again and try a different one after that.  They have savory crepes as well that I'll try next time.\n\nThere's two seats in the shop so you might end up standing and eating.  It's definitely a hole in the wall kind of place.", "author": "R K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Won me over..........they are a great place and great original concept.  Will be back!!!!", "author": "Paul T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Wow, super duper impressed both by the food AND the customer service. I'm a big fan of crepes and had never tasted a GF one... what a pleasant surprise! First off, the menu was quite extensive and it was nice to see a wide selection of both sweet and savory options. I ended up going with the egg white one that had truffled mushrooms and added avocado. I'm a really picky person and hate when people slapdash food together (like the lovely folks at Chipotle) and don't care about what they're doing... it drives me BONKERS!!! So of course I watched my crepe being made by the sweetest worker, Alex. She spread out the avocado, eggs and mushrooms evenly across the crepe and took so much pride in what she was doing... such a rarity to see nowadays! And then this other worker, Jesi, appeared and he was also beyond friendly and helpful -- even offered me a stamp card and was just such a nice guy to chat with while I was chowing down! Tasty \"fast\" food doesn't get much better than this!", "author": "kate t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "I found this place by chance walking around with a friend, and the moment we saw they made Japanese style crêpes we were hooked! The icing on the cake was when I read they are gluten free, made with rice flour. I've recently discovered I have gluten intolerance and saying goodbye to many favorite desserts and sweets hasn't been easy, so Eight Turn Crêpe felt like a gift from heaven! I had the Banana Chocolate Nut crêpe and it was delicious. I can't wait to try their savory crêpes (not all gluten-free, but some are), and the ice cream ones when the weather gets warmer.\nThe place is tiny, so expect to wait for a bit if there's a lot of people, although they don't take too long to make the crêpes.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "I had the same crepes several time there but they weren't very consistent, I think probably depends who makes the crepes. I like the crepes that's more crispy than soggy. The cream inside is pretty light which make the crepes more refreshing with fresh fruits.", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Their sweet crepes taste better than the savory ones. They were giving out complimentary lemonade like drinks. The pros - yummy crepes, fast service, wonderful food presentation. The cons - their drinks contained orange peel!, no seating, not great for large groups.", "author": "R Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "Tried Eight Turn Crepe for the first time this week and it was awesome! It's a small place, but that's how most crepe shops are back in Japan. Walking by, you notice the decorative crepes encased in glass on the window. The crepe itself is very soft and chewy like the ones I've tried in Japan. I had the twinkleberry parfait and it was refreshing, perfect for the summer. It was filled with berries, yogurt and granola; not to mention it came out looking like a flower bouquet! I'm definitely going back to try the other crepes on the menu!", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-04", "description": "small little crepe store, serve pretty quick and great selection to choose from! really love their valentine crepe!", "author": "Josephine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "LOVE this place.  Super friendly, fast service and the crepes are consistently delicious.  My favorite is the truffled egg white with spinach crepe - great for breakfast, lunch or snack on-the-go, and it tastes even better than it looks (which is great!)!  I also kind of love how it seems super healthy - I believe the crepes themselves are made of tofu/soy rather than white flour... but I could be wrong.  Consistently made well, and the packaging is so convenient!  Can't wait to try the other menu items.", "author": "Skylar H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "Vibe is great (sometimes they have a live DJ). Unlike any other creperie in NYC.  This is in the tradition of Japanese perfection - it is all in the presentation.  \nMy favorite is the Tuna Nicoise for lunch/dinner. Ingredients are very refreshing.  \nFor breakfast Eight Turn Lox or Double the Eggs, Double the Fun\n\nOnly downside - place is very small - in rainy weather you can't use the benches outside.", "author": "JP R."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}