{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-25", "description": "You might just completely miss this place if you don't look out. This is a tiny hole in the wall that is best for take out since there is little to no seating. \n\nWhen you walk in, it looks like just a crowd of people made up of people waiting in line to order and people waiting to receive their crepes. The only seating consists of two stools by the window, a bench by the cashier, and a bench outside. If you don't jump on a seat that opens up, you might as well grab your food and go. All crepes are made to order, and the back preparation area is open, so everyone (that can fit in the shop) can watch the crepes being made.\n\nThe menu consists of both sweet and savory options. They have a partnership with Il Laboratoria del Gelato, so a few sweet crepes feature their gelato. I opted for the azuki berries (strawberries, il laboratoria del gelato matcha green tea gelato, azuki beans, whipped yogurt, matcha custard cream, slivered almonds, chocolate pocky).\n\nThe presentation is bright and vibrant, and each crepe is served in a handy cone that can be peeled as you make your way down the crepe. The fruit was fresh, and the gelato was refreshing with everything else going on in the crepe, but the whipped cream tasted a little weird -- almost salty. Also, the way they assemble the crepe puts all the ingredients on the top (to make it look full when it's all wrapped up), but as you get down to the bottom, there's nothing there. I ended up throwing out the bottom because it was just the crepe -- no fruit, ice cream, or anything.\n\nEight Turn Crepe is a nice treat with a variety of options every now and then. All of the crepes are under $10, but you don't really get much bang for your buck.", "author": "Erica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "I literally crave these crepes sometimes and can't wait to get back to Dekalb Market Hall just for them. My favorites are the chicken teriyaki, the sauce that they use is just delicious. I also really love the pork belly crepe , it literally melts in your mouth. And the BLT crepe is awesome too. Thick cut crispy bacon mmmmmm. The goat cheese and truffles egg is yummy too, I've had it for breakfast. For the sweet ones, I am a chocolate fanatic so my favorite is the strawberry Nutella, matcha stripe chocolate and I also love the Fuji apple crepe. It tasted like a caramel apple pie.", "author": "Andrea J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "The preparation time took forever.-around 15 minutes standing around. The crepe was not good neither fresh. I had a terrible stomachache after. The salmon looked sad as well as the mushrooms. Be careful eating there!", "author": "Alina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "My business partner and I had the chance to visit Dekalb Market a few weeks ago and tried 8 Turn Crepe for lunch.  I had the pork belly crepe which was fantastic, both in flavor, texture of the crepes and visual presentation.  Quite a creative menu both on the savory and the sweet side.  Loved the delicious crepes themselves that have the extra bonus of being GF (rice flour i believe).  Can't wait to bring my kids here for lunch as i am sure they will LOVE it!  Highly recommend the place!", "author": "Bella K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Eight turn crepe is one of my favorite place to eat at the  food market. I love the fact that there is a crepe for every craving. If I'm super hungry and I want something savory, I go for their teriyaki crepe. If I want something sweet, I love their Nutella crepes. My kids also loooove their crepes. I have been to the food hall 5 times since it has opened and I had one of their crepes every single time!", "author": "Aleks A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "What captured me into this tiny little place was their storefront--freaking adorable. Even though it was 20 degrees outside, I spent 10 minutes standing by the edge of the sidewalk snapping a bunch of photos to add to my food adventure media compilation. Was it worth practically freezing my fingers off? Yes, yes it was because when I stepped into their (crowded) shop, I was greeted by their large variety of crepes (oh and wall art that i spent another 5 mins taking pictures of lol)...Hmm so much for my simple definition of a crepe now is it? Their menu has a selection from savory to sweet crepe creations as well as beverages such as coffee, tea and shakes. So far, I've tried (among several visits and stealing bites from my food buddies of course!) the Azuki Berries, Strawberry Banana, Chicken Thai and Crepe Dog. \n\n-Azuki Berries--it's like me in a crepe. All my favs wrapped in one: strawberries, matcha green tea ice cream, red bean, whipped cream, matcha custard, chocolate Pocky and almonds. IF YOU'RE A MATCHA GREEN TEA FANATIC LIKE ME GET THIS ONE^^^\n\n-Strawberry Banana: pretty standard crepe; nothing special about it really. It's exactly what the name says it is along with some whipped cream and some almonds. My friend got this with a scoop of green tea ice cream (extra charge 2.50).\n\n-Chicken Thai: It had mixed greens, cucumbers, carrots, several slices of chicken, cilantro, some sort of sweet/sour sauce, sesame, and a mild wasabi sauce. The sauce has a very strong sour smell to it (minty gum afterwards indeed) but it def tasted better than it smelled! \n\n-Crepe Dog: My daring food buddy got this because of it's unique description--kurobuta sausage, daikon, carrots, corn, cheddar cheese, ichimi toragashi (red pepper flakes), tofu sauce and banana ketchup. He liked it a lot but it was too salty for my liking. This one is def most flavor-packed. \n\nThe store is really tiny; only has two window seats and a small bench on the side. You can have our orders to go; they place it in a clear plastic bag shaped specifically for the crepe cone--very cute and convenient. \nI'm leaning more towards their their sweet crepes. Based on the photos and reviews here, I already know that I have to try their Chocolate Nut Party and Matcha Stripe Chocolate (green tea and chocolate mmmm) if I'm in the area again.", "author": "Cece H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Attended a friends birthday party at a children's play gym this past weekend. They had the event catered by Eight Turn Crepe. They set up a crepe stand at the site and all the guests crowded around in awe of the beautifully crafted crepes and the aroma lured us in. The crepes were made fresh to order, served warm in a cone. Tasted delicious and were easy to carry, and a perfect addition to complete the event. All of the guests including myself really enjoyed the crepes. Lots of variety and flavor to choose from. It was really cool to have the crepes being made at the event. All the guests were raving about them. Will definitely be using them in the future.", "author": "Lawrence Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "It was a very warm, beautiful day.  My friend and I stopped by spontaneously, and although I am generally not a fan of crepes, I thought Eight Turn Crepe lived up to its stars.  I personally got the Azuki Berries and I enjoyed every bite.  I realized it can't be eaten while walking, so make sure you're standing or sitting still when you eat it.  It is a small place with pretty much no seating, so make sure you're okay with eating outside.  Also, the crepes do take a while to be made, so when you go, make sure you're patient.  The wait will hopefully be worth it.  Definitely try this place out if you're around the area.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Visited Eight Turn inside Dekalb Market Hall this weekend and was impressed by their crepes and customer service. The sweet employee recommended some crepes for me and my friend  to enjoy and we were in love. We tried a pork belly crepe and a fuji apple pie crepe and can't wait to come back to try some more flavors.", "author": "Shohruh H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Visited: 02/23/2016\n\nWe braved the rain and cold for this delicious treat! We ordered the #22. Azuki Berries and loved it! They had such a large menu but I had to get one with ice cream :) I certainly didn't regret it. It did take some time since there was only two employees doing everything, but the taste was great!! If we ever get a chance, we'd certainly visit again :D", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Fulfills your sweet tooth cravings and so filling! Have tried the Matcha Stripe Chocolate and Chocolate Nut Party. It's a little bit extra for a scoop of ice cream but it really makes the crepe come together. It's a small place but in soho, so you can walk around outside with it and the outside paper is easily ripable so you won't make a mess.", "author": "Pallabi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "This spot is little more than a take away counter, but they make some tasty crepes!\n\nMet a couple friends here for lunch. There's not really anywhere to sit, so I would probably just go by myself next time. Luckily it was nice outside and we were able to grab one of the benches.\n\n I ordered the truffled egg white omelet crepe. Delicious! It came with egg whites, mushrooms, truffle oil, spinach, tofu sauce, and cheddar cheese. The truffle oil made the crepe extremely fragrant but not overpowering. I love how the crepes are super light and thin and crispy. Definitely less doughy than other crepes I've had. The ingredients are arranged precisely and the crepe is folded beautifully so that nothing falls or drips out. It almost looks like a bouquet of flowers! \n\nDefinitely want to come back to try the sweet crepes.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "The best crepes you'll ever have!!! Oh my god. The chicken teriyaki crepe was one of a kind. I also had a sweet crepe but nothing compares to the savory crepes!!!", "author": "Pamela A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Ordered chocolate nut party crepe. I thought the entire thing would have ice cream rolled up in it, but it was only the top portion. Still, really good.", "author": "Thomas Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Taste very gd, chewy and crispy unlike the others\nI had been try many diff kinda crepe.  Japanese style,  english style... and many more \nI got the harajuku cocktail.  Fresh cut fruit .. yummy", "author": "Annie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Cute crepe joint imported from Japan.  This is the second location they opened.\n\nQuite an extensive menu with savory and sweet options.  Very reasonably priced.  Some of the sweet crepes were just $7.  Get the one with chocolate truffles!  As log as you like either chocolate or berries,you really can't go wrong with any choice I think.  \n\nIt's a pretty good size and they have the special crepe cone holder with ridges so you can peel as you eat.  \n\nMy only wish is that they can make the crepe warmer somehow.  I know... Being to picky.  Maybe for the savory versions they will be able to keep it warm longer.  They only have two stools inside so it's more of a pickup and go kind of place.", "author": "Agustin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Black Sesame Shake. Enough said. \n\nJust do yourself a favor and order the Black Sesame Shake. \n\nI loved it so much I came back here twice just to get the shake. \n\nIt's amaZing. It has enough black sesame taste. Most places don't have enough black sesame taste. Here... It is perfect!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "I ordered Harajuku Fruit Cocktail, SOSOSO Good.\nLots of fruits. Mango, berries.... Really TASTY!\n\nAlso had Iced green tea latte. Taste more like tea than latte.", "author": "Bo Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "I was so excited to try this place as crepes are my absolute favorite!! Not to mention these are gluten free, pinch me. Unfortunately the crepe was just fine. With every bite I contemplated whether or not I wanted finish it. \n\nI got a crepe with nutella (their own homemade version), a simple classic. The crepe itself was really large, the homemade nutella was delicious but the actual crepe did not have the soft stretchy texture that melts in your mouth. Instead, it was on the harder side and crispy....yes, CRISPY! Not to mention, it had no taste. There are plenty of other crepe places in the city that are ridiculously delicious, you aren't missing anything if you've haven't been here yet.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "I've been meaning to try this crepe place in soho, and I finally got the chance! In one month I came here about three times! I know a good crepe when I have tasted one! I first brought my out of town little sis here! We were both ravished from not having anything to eat for the day yet, so we both ordered two savory crepes! I got the lox on crepe and she ordered the egg, ham and cheese on a crepe! Both crepes were delicious and we both thought we wouldn't be full after the crepe, but boy were we stuffed! \n\nThe crepes blew my mind so much I had to come back! The second time I came here I opted for a savory crepe again! I ordered the shrimp and avocado crepe, which was amazing ! Came with spinach leaves and Thai sauce! I love the crepes that much more after the shrimp and avocado crepe that I actually came back the very next day for more crepes! And that time I ordered the chicken terriyaki crepe and it was so filling that I didn't get to try the sweet crepes here! I will make it my mission to try all the crepes !", "author": "Sandra C."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}