{"aggregateRating": {"reviewCount": 567, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-29", "description": "I would not go back again here even if someone took me for free nor would recommend it to anyone. \n\nIn NYC, there are tons of places to which this place is no match :with its rice flour,twisted,coned creeps with ice cream on top leaves heavy soaked fruit paste at the bottom. \n\nSmall place,no where to sit but like a homeless on the street and over priced. \n\nNot worth even a try,AVOID!", "author": "K Lo .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "RUN...don't walk...to Eight Turn Crepe.  Taken in tonight by a friend for the best desert I have had in years.  Delicious light crepe (rice flour) filled with fruit and whipped yogurt.  Yummy!! Can hardly wait to work my way thru the menu.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-14", "description": "Tried this place a few weeks ago and was so blown away (had the Fuji apple crepe) that I drove all the way back from Connecticut on my birthday just to have another one. So disappointed - the beautify of the crepes is how delicately all the flavors intertwine together, and this time that beauty was nowhere to be tasted. My Fuji Apple crepe was overflowing with crazy sweet caramel and barley had any of the delicious whipped yogurt - tasted like a piece of vulgar store-bought pre packaged junk food. When the employees make these properly, it's stupid good - but when they're off, they're really off.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Yay for gluten free crepes! \nWould love to see more cheese options...they only have cheddar, and in a place like soho you know there are some cheese snobs out there. Would love to see more of a variety.\nLove the friendly service :)", "author": "Alba N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "i LOVE this place. It is a small hole that has one of the best crepes :) I love the wall decorations and I'm definitely introducing this place to my friends :)", "author": "Lesley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Love Japanese crepes, this place is great. Feel free to open one in Austin or Houston.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-13", "description": "If I am going to break my diet to have some crepes it should be slamming. It was just meh. MEH!!  I expected more with 4.5\nyelp rating. I should have jizzed in my pants then and there with a 4.5. I think a lot of people with mediocre taste buds rated it 4.5 stars. Really wanted to give it three stars. Cute place tho!", "author": "Kenisha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-14", "description": "Hmmm.... It's just too sweet for me. Japanese sweets are not usually too sweet but I guess it has to be converted to American way :(", "author": "Sohin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Lychee valentine is my favorite but matcha stripe chocolate is a good option too. I tried a savory crepe once and didn't like it but that's probably just my preference for sweet crepes. The store is really small (with just a few small benches) but the crepes are easily packaged for your convenience to eat on the go. Definitely recommend for a quick snack after shopping in soho!", "author": "Lily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Best crepes ever is pretty accurate. Randomly spotted this place on Instagram a while back and actually made it out on my weekend trip to NYC. We had the Eight turn lox and the BLT one. The yummiest BLT of all BLTs I've had!! Crepe was soft and a little sweet, bacon had just the right crispiness, and the sauce went perfectly with everything else. I also really wanted to try the azuki berries but decided to skip on the dessert..  So regretting now. Should have just pigged out while I could. Must go back.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Ugh Yelp you led me wrong! Got a \"savory\" crepe, truffled egg white...First of the customer service was atrocious! I asked if the particular crêpe was good, and the guy working said \"I don't know I've never tried it.\" Then I asked him what the yuzu soda is and he literally turned around to his coworker and said \"can you explain it to her\", weirdo. Then to top it all off the crêpe wasn't even good and was really hard to eat. Will never ever be coming here again", "author": "Ellie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Great place to go for crepes! My friends and I have been looking for a good crepe place. We tried the strawberry banana and the azuki crepes. All of them were very good and not too sweet either. The azuki crepe came with green tea ice cream which was delicious. It was our second time coming here in the past week since we recently found it. I haven't tried their savory crepes but they sound and look delicious also! It's worth a shot to try It out here.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "By far the best hand held crepes I've had in NYC! And trust me, I've had a lot!", "author": "Sanna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Highly recommend S'mores crepe (adding extra ice-cream)..... what an amazing crepe! :)", "author": "Thom H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-14", "description": "Am I the odd (wo)man out here?? I stumbled upon Eight Turn hungry for something warm, yet light to escape the terrible weather outside, but I was a bit disappointed.\n\nFrom all the Yelp reviews, it looked like the shrimp and avocado crepe was a good choice so I ordered that. While they certainly craft their creations with much finesse and artistry*, I have to say I didn't quite like the taste. The fresh avocado and baby spinach were wins, but the Thai chilli sauce was overly sweet and I really wished the shrimp had been grilled and/or marinated in something. \n\nI also ordered their popular Lychee Valentine crepe, hoping that would be better. It was, but only marginally so. There was a little bit too much of the rose custard cream, but the edible rose petals were an interesting addition. \n\nI do have to say though that even though this place is TINY (literally only a couple of barstools and a small bench) and gets crowded, the two people working the day I was there were SUPER nice and friendly. The cashier even pointed out to me that the paper bag I was carrying was ripping from the rain and offered me another plastic bag before I even noticed the tear myself.\n\nI came armed with an $18 PayPal offer, but without the deal, the prices are a bit steep, with the average crepe being $9. \n\nTIP: I noticed this too late, but the paper they wrap the crepe in is specially designed for you to eat gracefully. Look for the perforations so you don't end up looking like a cave(wo)man like I did.\n\n---------------------------------\n\n*You can actually see them make the order given the open kitchen style of the place.", "author": "Nameeta K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "A Japanese chain's first US store. More of a small meal than a snack. Try the lox one.", "author": "Jerome Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "Japanese-style cone crepes, I've been waiting for you to arrive for sooooooooooooooooooooo long. Why haven't you come to NYC sooner? As much as I love the established creperies here, they don't usually serve sugar with something called restraint.\n\nI had the Matcha Stripe even though I initially had reservations about it. I cringed to imagine how rich a crepe loaded with custard, truffle, chocolate sauce and yogurt would taste, even if it was balanced with berries and pistachios, but I ultimately succumbed to my love for green-tea-flavored anything.\n\nYou ever had that type of dessert that feels heavenly from the second you take your first nip to the moment you feel it sliding down your throat? Then, when you've regretfully finished the thing, you feel this god-awful oily/sugary residual film in your mouth and at the back of your throat that makes you truly regret eating it in the first place? Well, you definitely won't feel the latter with these.\n\nTrue to their vision, ETC made an amazingly comforting, but delicate dessert with just the right balance of flavors and, most importantly (for me), sugar. I didn't think any single ingredient in the Matcha Stripe, not even the choco sauce or truffles, were overly sweet. And no, it wasn't the custard and yogurt masking the sugar, which brings another point: no component was overpowering the others.\n\nWish I stopped by when they gave complimentary yuzulade. Incidentally, I did try that and the yuzu soda and they are both pretty awesome too! Nice way to wash it all down.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Had the best crepe ever! Their service was not bad at all. They recommended me to get Ny blueberry cheesecake. It was the best! Loved it!! Even though, my shirt ended up dirty:(", "author": "Luolin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Such a yummy crepe place to stop by. The price was fair and the quality was awesome. I recommend coming here for dessert and bringing friends along to enjoy.", "author": "Christine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "I love this one more than Vive La, the reason is that the crepe here is thinner and smell nicer. Not to mention the fruit-flavor cream in between. They make the\"theme\" of each crepe so consistent. My favorite one is Lycée Valentine, very very good for girls. Not too sweet but with the fragrance of Lycée!BTW, it has rose petals! Matcha stripe is also great, my second favorite. Gonna try salty one next time", "author": "Alexandra Z."}], "servesCuisine": "Creperies", "priceRange": "$11-30", "name": "Eight Turn Crêpe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/c5nstSgbtXjXt-TYmM6-1A/ls.jpg", "@type": "Restaurant", "telephone": "+19293587988"}