{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "Wow! The bread here is amazing! I had a Brie and Apple sandwich that was perfect. When I saw the cookbooks and talked to the server I realized I was in one of the best bakeries in NYC. Hand made, fresh ingredients, loads of care and consideration to detail. Thanks for coming to Brooklyn Amy!", "author": "Suzanne J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "$3.90 for a stale croissant, bought not long after shop opened this morning ( Saturday), hmmmmm...????\nAlso girl that sold the croissant and 2 coffees needs to work on her attitude.  This looks like a small local business, surely people will take their custom elsewhere if she keeps speaking with her mouth full, and is unintelligible when she does speak", "author": "Nik W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Lovely new bakery in the old Tazza space. I was pretty bummed when Tazza closed, having spent many hours there with a stroller parked next to me. The newly reopened space is reconfigured but also welcoming and will hopefully have outdoor seating during warm weather. Most importantly the breads are fantastic. I've stopped by a few times and have tried a variety of baked goods at this point and none have disappointed.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Really excited to have a new bakery and bagel source in this corner of Brooklyn Heights.\n\nStopped in today for a coffee, and I picked up a loaf of sourdough and a flatbread snack. All delicious, and the price was entirely (and surprisingly!) reasonable. Hoping to make this a regular spot in the future!", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "Delicious delicious!! Finally a real bakery in this neighbourhood! I visited the first time today around 5:30 and took advantage of their buy 1 get 1 free deal. Also picked up a slice of red velvet and german chocolate cake, both really moist and not overly sweet.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Super miss the West Village location but I checked out this one while visiting a friend in Brooklyn...I have to say, it's even more quaint and beautiful than the WV one! Good selections of pastries, cakes, and breads. Tried their new goat cheese sandwich -- omg, so delicious. Staff was sweet and service was fast. I so wish I lived in BK so I can be closer, guess I'll have to visit more often!", "author": "Allie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "I should have saved the croissant, sans two bites,  and sent it back to the baker, but I was so unpleasantly surprised and the trash bin was co close...\n\nI bought the croissant right after the shop opened at 8:00.  When I got home and took it out of the bag, before 8:30, I found the crust dry and hard ... to the point that it could be torn away in big pieces, stiff and sturdy.  The crumb was not much better.\n\nIsn't the crust supposed to be flaky and the crumb moist?\n\nAnd where's the butter?\n\nOh, it's bitterly salty.\n\nI obtained a second opinion, just in case my senses were on strike today. The experienced baker broke a piece, felt it, and said she wouldn't bother...", "author": "F L."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Amy’s Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "311 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DzlHQfUiY6s7uFxBSufkGQ/ls.jpg", "@type": "Restaurant", "telephone": "+19292763108"}