{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Customers BEWARE!  If you intend on reserving this bar's second floor lounge for a private event, please ... please ... please ... make sure that EVERYTHING is stated on your contract and updated as necessary!  I was duped and found out the hard way that any agreements made via email and/or text with the manager are not enough to ensure that your event is carried out the way you planned.  Have all addendums included in your contract and then have it resigned by both parties so that if something is not met on the day of the event, then you have the evidence to pursue legal action.  Otherwise, you'll end up footing the bill for thousands of dollars unexpectedly at the end of your event when your guests have already gone because the manager \"forgot\" to advise her staff that the event was supposed to be a \"cash only bar\".  Let me tell you ... the tears brought on by this unfortunate experience dampened my otherwise perfect wedding day because we did not budget for this expense!  The only retribution offered by the manager was a free brunch for my family of 4 the next day which I know didn't cost them too much or impose a major inconvenience since we were the only customers there anyway.  I found their response to this mistake unacceptable and unprofessional!  I will NEVER patronize this establishment ever again nor will I recommend it to any one else.  They will take your money however they can without any remorse!", "author": "Angela P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-15", "description": "Rude service this Sunday. The waiter she was bad and didn't provide a good average service. Food was nasty. So disappointed after my first visit two weeks ago. \nWill never come back to this place again", "author": "Rafael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-14", "description": "I went here with my uncle who was visiting from out of town. We ordered a few appetizers and burgers for lunch. The appetizers were okay. We ordered the \"atomic wings\" and we can tell they literally just warmed it up in the microwave and it wasn't as good as going to an actual atomic wings restaurant. \nThe nachos were decent. We ordered the Hennessey burger which was horrible and tasteless. I ahad the Irish carbomb, which isn't hard to mess up but the glass was half full so that was annoying. It's a cute spot, but that's about it.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "The breakfast sliders were tasty little morsels. Scrambled eggs, cheddar and bacon on brioche buns x3 with some pretty tasty fried red potatoes, peppers and onions. Good value. I came back for beers in the afternoon and enjoyed the outdoor seating. A little slow but good, friendly service. A nice little bonus when staying at Hotel Indigo- attached.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "I really can't right much or base a good strong opinion on good or bad so I am going right in the middle.  See I only ate breakfast here this morning since I was staying at Hotel Indigo.  The breakfast I ate since I am trying to watch my girlish figure was a bowl of mixed fruit and a crossaint.  Those 2 items are not that hard to prepare abs serve so I can't be like all man Breakfast was the greatest.  Coffee was good.  Service was good but not to busy first thing in the morning", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "When you are traveling alone, it's hit or miss how your experience will be...so I walk in and ask for a beer.  Instead of pressure to decide quickly and without emotion, I get a consultation! \"What beers do you like?\" \"What haven't you tried?\" \"What do you think about this one, etc?\" You will love Imrul the bartender.  He makes you feel like a regular when it's really your first time there. He even inspired my speech for the bridal shower I was attending over the weekend and helped supply me with the drinks I would need to write it ;) The girl at the door was also down to earth, really sweet, and welcoming. Overall, the place has a great feeling, good drinks, a good mix of music and a laid back vibe.", "author": "d z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-09", "description": "It's a good looking place. The problem is I went in for happy hour under the impression that the sign was accurate. It said $5 draft for happy hour. After ordering a founders day time IPA, totally flat, I was told happy hour only covered Shock Top, Bud Light, and Heineken. The bartender told me it cost $7. I gave him 2 fives. He came back with $2 change. So I asked him how much the beer cost again and he told me $8. I know how much 1/2 barrels of founders cost and $8 for happy hour is outrageous. This place is way too expensive for the neighbourhood.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "A wonderful addition to the Indigo Hotel! Very friendly staff and an incredibly kind owner. I stayed at the hotel for business and found myself going downstairs for a beer and a bite of food every night of my stay. Inviting atmosphere at all times of the day and attracts a fun crowd. Come in to watch a game and have a beer or order room service and prepare for a great night. I was told they will be opening for breakfast and weekend brunch soon...I will definitely be back on my next trip to Brooklyn! If you are used to metropolitan bar prices, this place will meet your every need. Stop by and enjoy!!", "author": "Erin D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-20", "description": "The reviews on Yelp warned me that at best this is a three star establishment and they were dead on. It's not bad... it's just not very good. Decent tap selection... but weak for a \"brew house\". The food was mediocre at best. Lobster Claw Sliders were a waste of three lobster claws. Overly battered and lost on too much bread... dry, dry, dry! Adequate fries. Commercial processed cheese on an over dressed Caesar salad. Service was decent and faux friendly. It's near the hotels and that makes it easy. But it could be much better and should be for the trendy money!", "author": "Robert B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-11", "description": "the service was great, the food was great ... now if they can get the  manager to be great, she was just  rude, not attentive at all,  if I'm correct her name is Martha,  customers services is a must when you work at restaurant, that's how you keep your guests coming back.", "author": "Mary W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-24", "description": "Had the roast half chicken.  Dry and gamey.  Honestly pretty bad overall. \n\nOn a brighter note,  the asparagus salad was good, although pricey.\n\nbreakfast was fine.\n\nService in general is eh.  need to send servers to get training.\n\nif the chicken had been better, i'd give 3.5 stars", "author": "H K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-25", "description": "Had breakfast here only because of the breakfast discount I got for staying at the Hotel Indigo.  I ordered the pork belly croissant and my partner had the Brooklyn Omlette.  About five minutes after placing our order, we were told that they were out of croissants.  We arrived fifteen minutes after opening and no one else was in the place and they were out of croissants!  I changed my order to the American Breakfast and asked the eggs be over easy.  My partner's breakfast came and he ate it while I still waited for mine.  He had been finished about five minutes when my came.  Someone needs to tell the chef what over easy is.  The yolks had the consistency of a hard boiled egg and the whites looked like toast.  I took a few bites but couldn't eat it.  I do not recommend this place for breakfast.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "In the neighborhood. Good Happy Hour Specials. Decent food. Friendly Bartenders. Can't complain.", "author": "Missy E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "Stopped in here on a rainy day for a drink and food. The space is very inviting and warm. There was lots of action at the front bar but it was nice and chill towards the back. I had the pinot noir - very nice! and the veggie quesadilla with phantom vegetables. I will definitely come back here. Much better vibe and food here than Brooklyn Terrace.", "author": "Ola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "This brewhouse is amazing!  The thin crust pizza is to die for!  The staff is very nice and the service is quick.  Even know the food comes very quickly that does not take away the amazing taste.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "I came in with low expectations of this hotel restaurant and I was still incredibly disappointed. I think this was the worst service I have ever received at any restaurant. The food was fine but the server completely forgot about us after taking our order. She hung around chatting with the bartender instead of waiting on tables. The restaurant wasn't even busy - less than half full - so there was no excuse for service so slow.", "author": "Molly R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Terrible service the food was not bad unless you want something added to your meal or taken off of your meal, they won't and when you ask for it to be right the manager will tell you \"that's just how it comes\".  if you want anything after the first contact with the staff they will not be inconvenienced to ask if you need another beer or anything else. So the food is good service killed this place for me!", "author": "Derek M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "I hadn't been to this party of Brooklyn in many years so I was surprised at how the area had changed. It used to be full of smaller mom and pop stores with unique merchandise, but it seems the Barclays Center and gentrification have taken over this neighborhood like many across America. I tried this place because it was directly across from my hotel, and it seemed like a popular place among locals. The place wasn't that busy, but it seemed like the waiter was having a really hard time of it. Our salad order was wrong at least twice, and they forgot our wing order. The drinks took a really long time to come out as well. However once the food was there it was excellent.The burger was cooked perfectly, and the Sweet Thai chili garlic wings were to die for. I got a second order to go they were so good. They are also open pretty late for food, almost until two in the morning, and even later for drinks.", "author": "Marcus M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "I experienced the brewhouse while attending a wedding that had most of the out of town guests staying right across the street, at Sheraton and Aloft hotels. We spent both afterparties at the brewhouse (après rehearsal dinner and wedding) and the food, drink and service did not disappoint. Our party of a dozen or more enjoyed getting to choose from a nice range of tap beers and 40 bottled varieties. We took up the entire back area of the restaurant, and on Friday and Saturday night the place was not packed at all, so it served our needs perfectly.\n\nOur group decided to nix a previous plan to have Sunday breakfast at the hotel, so we could try brunch at the brewhouse. We figured we had such a great time there, why not finish our wedding weekend experience by coming back for a third time. I left word with the bartender that we'd like tables for 20 to 30 people for brunch the next day. The next day, our party of 20 started to pile into the restaurant, which was empty at 9:30am. The staff unfortunately didn't have prior knowledge of our party coming in but tried their best to meet our needs. Patrons started to arrive from other weddings and it was clear the servers and kitchen were running behind and lacking organization (e.g. servers not knowing where to place some of the orders, pork belly \u0026 egg croissants missing the pork belly). The server and floor manager assisting her seemed genuinely concerned about accommodating us. They brought the pork belly out as a side dish (it was very, very tasty). When we paid the bill, the manager comped all of our coffees, knowing what we had endured and that we chose them over the hotel.  \n\nAll in all I think it was a fine experience for what we wanted, a place where our party could just relax \u0026 spread out, take our time and just fill our bellies with typical breakfast dishes offered at decent prices. Had they had more advance notice of our large party they probably would have planned more servers and kitchen help to smooth all the bumps we experienced.", "author": "Cat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "I am staying with a medium sized group of co-workers at a hotel across the street.  This place is right across the street- uber convenient for tired walks across the street after long days in the office.  The staff is pleasant and accommodating(we're talking about you Keith!!!) and the happy hour drink specials can't be beat!", "author": "Sara G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}