{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Went to Brooklyn Brewhouse after a very bad day; arrived at 12:30am and food was still coming off of their (comprehensive) Late Night Menu. The offerings are good! Pizza, salad, burgers, tacos, and wings. Not bad for a late night menu. All served until 2am!\n\nI had the wings with the \"abusive\" sauce. They were good. The wings were lightly breaded and then fried. The cook was good and the breading was crispy in parts, parts where it hadn't saturated with sauce. The breading plus the sauce was a winning combination. I found the \"abusive\" sauce delicious! Not too spicy to prevent pleasure. Just with the whole mouth burn and a rounded flavor. Next time I will order the \"nuclear\" sauce, the second hottest. The wings were hot (temp and spice) and crispy and well done. As a fan of wings I'll defiantly have these again. They are good, not the absolute best, but decently solid and reliable. \n\nMy partner had the steak tacos. She said they were good, it's just that the tortilla had a store-bought taste to them. Otherwise they tasted OK, and she pleasantly ate both! Also these tacos appear to be gluten free (she didn't get sick), so probably safe for those without the most severe allergies. \n\nWould we be back, side! I'm going to have the wings again, I really enjoyed them, and I'd like to see their dinner menu and breakfast menus as well. \n\n4 stars because we enjoyed the food and beer, and liked the location and the atmosphere. Not 5 stars due to service: server was a little slow as we food coming and drinks from the bar, but this is 1:30 am on a Tuesday, and we got everything ordered, cooked/and eaten, and paid in about 70 minutes so really it's a minor complaint, it just wasn't very busy is all and seemed a little slow.  Not stopping us from going back!", "author": "Brad M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-24", "description": "The service is usually bad but the staff on Friday took the cake. Our drink orders were wrong a few times and when our server left a new woman took over at the end and changed the bill to her name so all the tips would go to her. The mother-daughter bartending duo won't get your order right unless you look like you have money and they'll call the cops on you and say you're throwing glass if you piss them off. I witnessed an entire exchange when this happened on Friday to a nearby table and I realized this place caters to cops so they keep them on speed dial.", "author": "Tee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Awesome ambiance and bar food. This place was right across from our hotel. It opens until 2am which was convenient since coming back from the city worked up quite an appetite.\nI will definitely repeatedly this trip. Lodging was convenient and this place is right next to it. Perfect combination", "author": "Jan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-24", "description": "Our food took over 40 minutes to come out and the chicken wings were under cooked and pink.  I am shocked I didn't get sick from this place.  The sign says Atomic wings, which makes you think they are Adam's Atomic wings which are wonderful.  But no, they are just using the name to get people in for a far less good product.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "My wife and I came to the bar not to hungry but after taking a bite from one of the best wings we ever had, we became famished. The wing was crispy and juicy. We had gotten the sweet and tangy aside, and that was out of the world.  \n\nBesides the wings the ribs are something that is a must try. The ribs were succlent and fell of the bone, it was served with a good amount of bbq sauce that could only be described as out of this world.  \n\nFinally came dessert,my wife is normally not a big fan of it, but she had to fight me over the tiramsu\n\nWe left the resturant planning our return,since we lived in Chicago", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "Food is amazballs! Service could be better. Brewhouse burger is simply awesome. Have it topped with chili on the pretzel bun and it makes you feel like you ordered everything at the ball game.", "author": "Jonthan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "A nice spot on a little hotel lined street with great service and pub food that's better than most. \n\nThe meatball appetizer is a tasty treat and the salads were fresh and far better than you'd expect from \"a hole in the wall\" connected to a hotel.\n\nWe will visit again.", "author": "Doc M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "We were really hungry and it was cold outside so we thought we'd give this place a try. I'm glad that we did. We were tired so the music helped to wake us up. It's pretty dim in there for a good ambience but if you want to have conversations I wouldn't suggest this place at night.\n\nI was disappointed because the paper menu they had at the front of the store didn't match their menu at the table. They were out of lobster mashed potatoes! Wasn't happy about that which is why I'm giving them 4 stars instead of 5. I ordered the salmon wrap and fries which ended up being about $25 with tax. The food was really good! The salad my friend has was good but my other friend ordered the chicken strips and only took one bite. She said they were really crispy and fish fry battered and not traditional. \n\nOverall, it was pretty good.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Wow! The Guinness Burger was in my top five burgers of all time. Perfectly prepared. The pretzel bun was outstanding. And the fries - a-maz-zing! Crispy on the outside and yummy on the inside. \n\nService was timely and attentive. \n\nBeer selection could be beefed up a little (draft options). My mule was fair - not bad, but not the best I've had. \n\nOverall loved this place. Great atmosphere. Well done!", "author": "Elise B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "I came here for breakfast last Tuesday since I was staying at loft hotel they recommended this place. I order a breakfast quesadilla it was delicious but I have to say I met the supervisor Marina she was absolutely amazing \u0026 very attentive. We love the service so much that we came back Wednesday for breakfast \u0026 lunch !!! \nI totally recommend this place if you are looking for an affordable meal \u0026 a friendly supervisor/staff. \n\nWe will definitely come back on our next stay at Brooklyn", "author": "Lucile T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "I was here Saturday. I had attended homecoming events during the day Saturday at Brooklyn Technical HS and wanted a post- celebration drink. I was looking fi\nOr an old-fashioned regular type bar but found this instead on the way to the subway.\n\nVery modern bar. They have outlets to charge your devices underneath the bar itself and at some booths.\n\nI ordered Brooklyn Seasonal draft. Summer I believe it was. Tasted crisp not too heavy.  The bartender was having issues with getting Cowan glasses so I said he could use the same glass to give me a refill when it was time.\n\nI had asked him out outlets for customer use and he said therr were some right underneath the bar. I felt around and sure enough I had my phone charging in a minute.", "author": "Suresh D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "The food is pretty awful, the diet Coke was the most disgusting diet Coke, it that's what it actually was... And they charge $3 for a glass of soda water (in addition to the undrinkable $3 \"diet Coke\"). Do yourself a favor and go elsewhere... Literally anywhere else.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-27", "description": "I used to think that pizza was a food that was pretty much impossible to mess up. However, that thought was immediately discarded after I laid eyes on the pizza from this restaurant. The crust of the pizza is literally paper thin, the veggies on top are pretty much uncooked, and the marinara sauce is for some reason a pale orange color. I would not recommend this restaurant if you are looking for some decent pizza.", "author": "Shirley C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-26", "description": "I am staying across the street in a hotel so I got my food to go.  Especially since I was in the middle of a movie.\n\nAnyway, I got the pulled pork sandwich with a side salad, boneless wings with the abusive sauce, and a side of coleslaw.\n\nThe pulled pork was delicious, but the bread it came on was skimpy.  The side salad was almost better than the sandwich and that's sad.  The dressing was yum.  The wings were also wimpy.  It tasted like they were just microwaved.  The coleslaw was also lacking in the flavor department.\n\nNext time I'll have to try one of their burgers.", "author": "Mikey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Good pick for pub food and beer. I realized I was in the wrong ordering cocktails at a place called \"Brewhouse\" so my mojito and hubby's old fashioned left more to be desired. However, nachos were truly epic and loaded with toppings until the very last bite! The ambience is very cozy and intimate, definitely a great place to just relax over drinks.", "author": "Anna M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-12", "description": "extremely ratchet place.. came here for the atomic wings.. next thing i saw was 2 girls fighting at the bar.. one girl was kicked out but the other one stayed.. the one who stayed got into another fight.. she was running in the streets.. she was later wheeled on a luggage cart into the lobby of the hotel next door all drunk.. cant wait to leave! gross out on the indecency", "author": "Lola S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Hello all,\nI would have to give this 5 stars for the food and hospitality of Ms Evelyn. Fabulous bartender and she's attentive to your food and drinks. I will be visiting The Brewhouse because of her work ethics. \n\nThank you for the great service.", "author": "Oscar S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "For a Random Walk in This Place was Pretty Awesome! \nJea Was the best waitress We have had in a Long time . \nFast service \u0026 Great Food!\nGreat Happy Hour Prices! \nWill bring more of my peoples Here to Experience the good times :)", "author": "Kai L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-18", "description": "Convenient, there's a place to sit, the waitstaff is friendly. There's nothing too remarkable about this place but it's quaint and serves booze. I watched the 2016 presidential election results here since i was staying in the hotel for work.\n\nThe crowd this place draws is pretty diverse and interesting. I met a college basketball recruiter from upstate, a nomad mad in the mining industry, an irish woman and an electrician that really wanted Mexicans deported.", "author": "Bianca V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Nice bar, girl behind the bar does great drinks, what a bar! Deffo come back!  This sentence is just fill out text to be able to post..", "author": "Jonas B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}