{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Really nice bar restaurant. The staff is friendly and quick. You never have to wait long for service. I and 2 of my friends have celebrated our birthdays here. They have a DJ on Thursday who spins great tunes. The Friday DJ is good too. Veronica the manager is super sweet. And she makes a point of introducing regulars to each other, which is a nice touch. The ambiance is very soothing. The music isn't too loud. The Thai chili chicken wings are the best. This is my go to spot.", "author": "Beverly D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-07", "description": "Learn from my mistakes, read the reviews. Stay as far away as you can. There are far better restaurants a few blocks north. Was staying at aloft, a hotel across the street, so went more out of convenience than by recommendation. \n\nThe food was greasy typical bar fare so can't dock them for that but the terrible music blasting in our ears extinguished any hope of having good conversation. The Manager was rude. The pizza is the worst that I've had in nyc. The servers were nice which is the only reason they didn't receive a 1 star.", "author": "Ben J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "The Thai wings were the best I've ever had. Absolutely delicious. My friend had a burger that he loved. Drinks were good and the service was spot-on. Now, this pace is on my regular list.", "author": "Doug H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Very friendly staff and excellent thin crust pizza. The manager Kevin couldn't have been nicer and spent time making sure our Brooklyn experience was superb. Anyone looking for great food and excellent craft beer needs to come here.", "author": "Bob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Although I was VERY sad to see the historic buildings on Duffield St knocked down, I am happy with the positive addition that Brooklyn Brewhouse is working to be. I wish there were more selections on tap (right now there are 14) but they make up for it with a decent selection of bottles. Interestingly, the food \u0026 service are actually what brings me back each time. BB offers food thats a step above traditional bar food, which I really like. The service is always attentive, relaxed, and friendly. And everything seems neat \u0026 tidy. Without knowning them, I'd say the management/owners are doing a great job!", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "The food and drinks are amazing. The location is great and perfect for a night out with friends or to sit cozy with boyfriend.  Love it", "author": "Mia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "Good that the bar was literally in the hotel... But way over priced for crappy food. $25 for a microwave food tower is kinda crap and the pizza had a \"not fresh\" smell to it.. Not to mention it was pouring out grease, for a flat bread that's crap.", "author": "Matthew B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-12", "description": "I ate here twice when I stayed at Hotel Indigo. It was fine, but I wouldn't go back. I had the pizza for dinner that came with our room package and it was fine, pizza in NYC has a lot to live up to and this wasn't as good as a lot of other places I have been. The next morning we had breakfast and the service was pretty slow even though we were the only people there and the orange juice wasn't good. The breakfast sandwich I had was tasty but it definitely isn't a place I would go back to.", "author": "Joie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Ate here one night while I stayed at the Hotel Indigo. Loved that this place was connected to the hotel and I was able to get dinner so late into the night. \n\nThis place has a full array of draft and bottled beers, as well as a wide variety of menu items. The service was prompt, food was tasty, and the help (particularly Veronica) was gorgeous. Three great things... and I'll be back!", "author": "Mike H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Despite it's unassuming exterior under the Hotel Indigo, this place is a home run!  Excellent service and even better food!  The nachos, steak tacos and sliders are insane.  Because of the wide variety of food it's an easy crowd pleaser when you have a group of picky eaters.  Good selection of beers too.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "Took forever to get two beers for two people. There were four people at the bar and three servers. I watched the servers chatting and checking things out on their phones instead of serving and making drinks. Bought my one beer and left.", "author": "Cassandra L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-25", "description": "A nice menu with good but somewhat average food, very friendly staff, and (almost) a great place to watch a football game.  That is, until you realize the on-tap beers you're drinking are $9 bucks a glass...and it's a small glass at that.  That's not just absurd, it's insulting. \n\nTo the management, I'll hope you'll reconsider your beer pricing.\n\n***And to her reply....no, that is most certainly not \"right in line\" with the rest of NYC.  Normal bars might typically charge $6-7 per beer, and I'll gladly drink to that.", "author": "Jim H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Although I haven't tried the food I did have drinks here on a Friday night. This place had a good crowd and the music selection was fun. I tried a frozen mojito because I haven't seen this on a menu since I was in Puerto Rico so I felt I had to give it a try. I know there is no comparison but Shockingly their frozen mojito was similar to the one I had in Puerto Rico. I really enjoyed it. I think went to the opposite end of the spectrum and tried a pumpkin beer. That was also really good. I would definitely go back here for drinks. I am tempted to try the food but haven't made it around to do that yet.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "I have no words.\n\nI gave this place TWO tries because it is right downstairs from the hotel I am staying at.  First try: Nachos and truffle/parm fries.  First of all, the nachos had pretty sparse coverings.  The guac was really pretty awful, the rest of the flavors were like \"meh\".  The fries?  I don't even know what they were thinking.  They were NINE DOLLARS for a side of fries that had NO truffle oil and NO parm - rather, it had huge clumps of blue cheese and spatterings of like, that chopped garlic you get from a jar?  Ugh.  I was starving so I ate some of it, but the entire situation was really piss poor.\n\nSo my next night, I want a salad, so I think how bad can they screw up a salad, right?  Wrong.  Every item in the 14 dollar cobb salad was ground up like it was in a blender.  The chicken was literally like SPECKS of chicken.  Flecks of egg (whites on one side, yolks on the other, again all ground up).  The blue cheese however?  You guessed it - huge unmanageable clumps.  The super thick dressing was a flavor I didn't recognize and had very little flavor even though it globbed all over the salad.  \n\nOh and if you order for carry out, which you have to at the hotel because they don't have room service, be prepared for a \"admin fee\" of a dollar.  Really dudes, a dollar?  I don't even care that much except that your food is super overpriced and bad, and how much difference is a dollar going to make to YOU, when to your customer it looks like total bullshit?  Yeah, bad move.\n\nAlso I think the bartender lady was annoyed at me the 2nd time in, and I wondered if it was because I didn't tip her the first night?  IDK, I know everyone feels like we need to tip for everything these days, but if your establishment can't even have someone walk literally 10 steps into an elevator to bring me food, I don't really see why I should tip anyone for the astoundingly small amount of effort it took to put my food IN A BAG.  Whatevs, just don't eat here.  Go to the dumpling place down the road, I got like 5 pounds of food for 9 dollars.", "author": "Brynn C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-05", "description": "Nice little spot but the food is mediocre and the service isn't very good. The waitresses are very attentive when the place is empty but as soon as it gets a little busy, they can't keep up. Good luck finding a waitress to assist you when it's crowded. No assigned tables per waitress.", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "Would give this zero stars if I could. Don't ever come here. \n\nWent here for a company sponsored event on 10/27 with 15 ppl, spent around $500 in less than hour's time - pretty solid profit for the restaurant I might add given how quickly we came and went - and mistakenly left the receipt on the table, which we obviously need to close out our books.  No problem, I think, I'll just call the next day and get it sorted, but when I do am told \"I found your receipt but the person who sends these out isn't here today, check back Monday.\" Fine, that's reasonable, albeit kind of dumb. But whatever. Call Monday, told \"check back Tuesday,\" call Tuesday, told \"check back Wednesday.\" this continues until Friday when I FINALLY GET A CALL BACK telling me they have the magical receipt (yay!), and will be sending it via email or text shortly. So while I'm annoyed that they proceeded to bullshit me for five days, I'm at least content knowing that I will end my week being able to close out my October books. Whole day goes by, and I hear nothing. Call back one more time and given lip service by the waitress (admittedly it's not her fault) so I ask to speak to the manager, who then tells me \"Monica didn't find your receipt and we're really busy right now so I can't help you.\" I tell him to go fuck himself.  \n\nFlagrantly unprofessional. I am astonished at the entire outfit's collective rudeness. For the record, I NEVER leave bad reviews - I worked in the service industry at one point in my life - and I literally made this account to leave this review and nothing else.  I would never ordinarily do this, but their treatment of me, disrespect for my time, and mostly just the massive headache that it's caused as I can't close out my books until I have that receipt warrants this response. \n\nDon't eat here. Don't patron here. Don't even have a cigarette outside the establishment on the off-chance that others will see you and go \"there's a cool guy with a dope jacket having a smoke outside that bar, maybe I'll check it out.\" Stay far, far away.  \n\nalso the drinks were mediocre at best.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-21", "description": "The food was good but here's the bad (1) they forgot to add dressing to my salad and (2) they charge an extra $1.00 for taking withing notice. In my case, my cajun chicken wrap cost $13.00 plus tip if you stay but if you choose take-out the cost is $14.00. The reason I chose take-out was to save money! They are basically saying \"we'll still get you!\". I think it is sneaky and I don't like it!", "author": "G R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-17", "description": "I'm still burping up Pesto.\n\nMy friend and I decided to try this place on our lunch hour at work.  We waited for about ten minutes for a server to take our order.  The food took a long time and was not very good, regardless of the price - which is a bit on the high side. \n\nThe food took so long to come out that one of the staff stopped by our table, bereft of food, to ask us if we'd like anything else (coffee, dessert), to which we responded \"we're still waiting for our food.\"  We must have caught her off guard with our response because she seemed to have no response of her own for us. \n\nFinally the food came out with one of the two orders having the wrong side.  My friend had the Guinness Burger which is pretty small and wasn't cooked to the temperature she requested. I had the B.A.C. Flatbread. The bread was over-toasted to the point where I didn't eat it. The Chicken was a bit overdone and everything was soaked in oil but all I could taste (and still taste) is the Pesto.  \n\nThis wasn't the worst restaurant experience I've ever had but it was enough to prompt me to start a Yelp account to warn others.", "author": "J E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Dark. very dark. burger was good. salad was good. didn't care for the ambiance. lot of people from hotel. won't be back.", "author": "Deb A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "$8.00 for a pint of Guiness?  Really? That brew left a sour taste in my mouth for sure. (Glad I didn't order the Grey Goose Martini)", "author": "L A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}