{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Found this spot in the cut of Downtown Brooklyn, upon looking for places to dine \u0026 drink Thursday late. (about 12/1a). So many new places within the past year! This place is fairly new and connected to a hotel next door as well as a few nearby as well.\n\nI have seen this chain here in Astoria, so figured we would give it a try. Minus one star for the tacky font and decor. Ambiance is great but the logo is unappealing and makes me not take it seriously!\n\nHowever the beer list is quite serious! I was highly impressed as a fellow beer snob to see such a wide variety. I love entering a bar where I see a beer I have (not) tried before! Great selection on tap of American \u0026 German while bottled has a pretty extensive list as well.\n\nFood was mediocre, kitchen closes late (2a) we ordered a margeria pizza and a side salad.\nFood was a 3/5\n\nPrices were a bit expensive for Brooklyn, but then again the vicinity of the hotels attests for the price. Side salad was $7 and in a small soup bowl and just greens. (Not salad) Pizza was $12 okay. Beer is moderately priced, cocktails I saw were ($14?!)\n\nOur waitress was okay, no complaints but nothing to rave about. \n\nUpon arrival the bar was full so we sat at a table, but I would honestly recommend the bar. \nIf I happened to be in the area I might pop in again, but if it's earlier there are so many other gems a few blocks apart :)\n\nOverall I would come just for drinks not food. Beer!!!!!", "author": "Alexis V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "$40+ for two shots of tequila and two dive bar quality margaritas. Terrible atmosphere, overpriced, and you're not missing anything when there's a slew of decent bars just a stop or two away.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Ordered the pulled pork sandwich and it was pretty good.\nThis is more pub than restaurant but food's good especially so for restaurant catering primarily to the hotel.", "author": "Jive O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Great atmosphere. The side room where random people sit on velour couches is a nice touch. Very spacious.", "author": "Justin J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "Nice bar setting, service was friendly but some serious shortcomings.  Food was ok, had eggs Benny off the brunch menu, eggs were good but home fries were clearly reheated and some were still cold.  Missed a drinks order and as they only checked on us three times in over 2hrs I went without for a period.  Overcharged on the bill too, which I had corrected. Didn't mention no free refills on sodas so be careful of that. Finally, found the choice of music bizarre....as the Hotel Indigo bar the music was a surprise as exclusive rap with profane language, n-words galore and lots of sexual language \"I like my bitches in pairs, like the nuts in my ballsack\" went one such charmer. I was watching soccer - they wouldn't put the sound on either because of the music.  I'm nothing like a prude, but really inappropriate music for a hotel bar at noon on a Saturday. Suffice to say, not at all kid friendly and by and large I'd just recommended you avoid.", "author": "Alan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "First time here I enjoyed my food for lunch I had the salmon and vegetable with salad,we ate at the bar,the bartender Alan was very nice,drinks was very stiff and strong,I would definitely  recommend  this place and I will be going again", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "My damn plane was really late leaving LAX - due to \"maintenance issues\". So I landed an hour and a half late which put me at my hotel about 1am and starving. This place was open and went in. The first person I met was my server Annie, what a sweetheart. The kitchen closed at 1am - right I was ten mins late. She said she would get me food and went and made the kitchen cook me some shrimp. It was amazing - but then again I have was starving. She was friendly and very good at her job!\nThen Veronica the bartender came over and we chatted for awhile. They even let me stay when they locked the doors at 2am so I could finish while they closed down. Great experience and they won my loyalty! I will certainly make it a regular stop when in Brooklyn!", "author": "Frank S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "Ew ew eeww!!\n\nThis place is gross we ordered a plain cheese pizza - its the worst pizza ive had in new york! It puts shame on itself for even existing and calling itself a pizza in New York City. The dough was flat and the cheese was oily and rubbery!\nWe also got pulled pork sandwich with fries the Sandwich was good, the bread was a little burnt and the fries were just whatever, no life, no salt, no crisp!\nAnd the worst part of all is that we waited 40 minutes for it to be made AND the place was empty ( we see why). \nJust no.\n\nBut they did have a duvel beer! That was nice, but still didnt get us drunk enough to enjoy the food.", "author": "Caitlin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "When one's in Brooklyn, particularly downtown, there are quite a few options to get your favorite libation. But, a place that stands head and shoulders above the rest is Brooklyn Brewhouse. So, what makes this such a compelling place you ask?  For starters, the service is outstanding. People behind the bar, e.g., Veronica, not only make an outstanding cocktail, but are also conversationalists beyond par!  For those with a  penchant to compare all things to the City, trust me, you won't be disappointed,!", "author": "Rene S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "False advertising, website says 6 dollar craft beer specials, yet each beer was 9 bucks each and only coors/Budweiser shit on special, not craft beer!", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "Checked into hotel late last night around 1am...used yelp to find a bar..found this place walked in at 1:30a...bartender said I already made last call a minute ago...wouldn't serve us...probably lost $70 of our service....will never go their again...and 100 of us are here for a week..\nYour loss.....girlfriend.", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "Woah just horrid service .. I had to get multiple servers attention to: get a second glass of wine, silverware for my salad and my bill?!?!", "author": "Claudia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "In town visiting some friends for a wedding. Staying at Hotel Indigo and decided for a little pregame meal. \n\nThe steak tacos were fantastic and the sweet potato fries were good as well (the normal fried fries but good).\n\nI was a little disappointed the my put flour in their wings but that is a personal preference. \n\nWe would definitely come back and eat here again.", "author": "Le Roy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "The love elixir is a great drink. They have a late night menu, the music is good, big screen tv's to watch the games!  The drinks are average NYC prices, and they have great burgers (mini).", "author": "Leanora H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Since I'm frequently in the area I've visited the Brooklyn Brewhouse a few times for a quick bite and drink. The food was good, with a hit or miss every now and then, but overall I've been pleased. My last visit was the first time that I chose to sit at the bar for my bite and drink. The female bartender on duty was the deciding factor for my four stars. I ordered a pizza and asked Marina, the bartender for a suggestion. Sometimes it's easy to just leave the decision making to a bartender. We discussed my alcohol preferences and she decided on an old fashioned. Great choice! Well made and balanced, which of course made me order a second one. While enjoying my drink and making small talk with Marina, I noticed how well she commanded her bar. She was professional, active  and an interesting conversationalist. I believe that my future visits there I can be found at the bar having an old fashioned with Marina.", "author": "Keith H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "I stayed at the hotel indigo for nearly a week, and came to the Brooklyn Brewhouse quite a few times along with ordering room service once. \n\nOnce entering the brewhouse it reminded me more of a nightclub, it looks nothing like a brewhouse and I didn't think any of the beers were the highlight of the menu.\n\nThe first night we stopped in we tried the buffalo chicken pizza and cheese burger. The buffalo chicken pizza had way too many toppings, after a couple of minutes the pizza became so soggy that you needed to use utensils to eat it. The burger was a little rare even though we ordered it medium, but was still pretty good. \n\nThe next time we ordered room service from the brewhouse, we ordered the cobb salad and some french fries. The Cobb salad should not have been listed as a Cobb salad, it was mostly just toppings and the smallest amount of lettuce they could've put on the plate. One great thing about the restaurant though, is the sweet potato fries. They definitely rock.\n\nThe next visit we ordered the Goat cheese salad and more sweet potato fries. Finally we had found something on the menu we love. The salad was still on the smaller size, I wouldn't consider this a dinner portion, but it was delicious.\n\nOverall this restaurant is average but in a very convenient location if you're staying in downtown Brooklyn. The staff were all very friendly and helpful. I thought everything was a bit overpriced, but I found that might just be in New York. Make sure to try the sweet potato fries.", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Quite a few items from the menu were missing the night we went - chicken tenders, burger buns etc. But the waitress was great, we had a big group and she took care of us well. Would recommend the sliders, fries, tacos and pizza. Music and football was on and we had a good time", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "I loved the atmosphere in here. The DJ was pretty dope, there was some dancing going on, but just as much sipping and conversing. The food is actually pretty delicious. I had a BLT Lobster Taco. I have NEVER heard of anything like it and I wish it was a norm in all taco joints! \n\nThe drinks were pretty strong and still remained tasty. Shout out to Cassandra (I think that's her name) she was pretty great server!\n\nThis place surpassed my expectations, since it's attached to Hotel Indigo, I'm not sure why I'm surprised. Great spot!", "author": "Alicia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Great bartender, very friendly and attentive. Drinks were good. Tasty food and good portion for the price. They prepare takeout orders very fast which I especially likes. I would definitely recommend dining or drinking here especially if you are staying in one of the hotels on the street.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "I LOVE JANET!!!  She's AMAZING! She's the reason my friends and I were there 3 times last week and we plan on going again tonight!", "author": "Quanna H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}