{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Nice local place. The people were nice and the bartenders were very cool. \nI had the suicidal wings and I loved them because I'm a hothead:) They were not the hottest I've ever had though. But still good. I will go here when ever I'm in the area to try other food.", "author": "Jai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Updated 10/8/15.\n\nThe Guinness burger is where it's at here! This is not a typical bar/pub. The food is always really good, the service is great and the ambiance is relaxing. Usually only go here when my boss is paying though. lol. She gets to expense it so it's all good. The beer selection changes often it seems which is a good thing. They always have a decent selection. The fries are not the style I like. I prefer the thicker steak fries. They taste good and co-workers love them. \n\nThe menu has  a lot to choose from and you can customize what you order to feed yourself just right. There used to be outdoor seating in the front. Not sure why they took that away. It was nice to eat out there being that the area is shaded pretty well. Overall the times I have been here I have not been disappointed at all.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I love coming here after work. The vibe is always upbeat even when it's not packed. The music is great and thirds days there is a live dj in the evening. The food is always hot and taste great. My goal goals to try everything. Starting with the burgers. So far the brewhouse burger add bacon is the best. Sirloin with chilli cheese then add the bacon. Also the Cajun chicken wrap is tasty. Try it on one pretzel bun. These are some of the best pretzel buns I've had. \n\nThe name is brewhouse. They have a great selection of beer on tap and bottled. They offer a range from domestic to foreign craft beer. My fave here is delirium tremens on tap. It gets me every time. They are working on dogfish 90 min so that would be even better.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "Great pub menu. Wings are hot.\n\nExcellent service at the bar.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "No expectations. I actually avoided it last night. They need a better store front. But service was great. Food was good. Drinks where great. Atomosph better. Not too loud but looks enough. I'll be back for sure.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "Unacceptable prices and poor communication of said prices. I ordered a quesadilla with a side of fries. I ordered the quesadilla with no vegetables and guacamole on the side. I was told I would not be charged for the guacamole, but when I got the check they charged $5. The quesadilla was $12 and was only three small pieces (hardly a full quesadilla). The small side of fries was $7 dollars. We also came for kareoke which the sign said they would have but it was inexplicably canceled. There are plenty of affordable and entertaining bars in Brooklyn. Choose one of them instead of this place. It will only disappoint you and your wallet.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-25", "description": "There are not many bars around the Downtown Brooklyn area. The Brooklyn Brewhouse has recently opened up, giving an option for people working in the area to catch a drink after work and a place to watch the game for those living close by. \n\nI was not overly impressed by the Brewhouse. I did feel the bar looked nice and sleek. Had tons of televisions but wasn't blown away by the food or drink. Lots of great beers on tap but the specials weren't special. $5 dollars for a coors draft? I'm sorry I asked for the specials. The food items were hit or miss. The good was the ribs, the scotch egg and the nachos. The bad was the lobster spring roll, chicken fingers and mozzarella sticks. \n\nOne thing I can say though the staff was great. Cool waitresses and bartenders. If you're looking for a place to catch a game in the area, this isn't a bad option.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "Wow I just arrived in Brooklyn and I must say way to go Brooklyn Brewhouse you just screwed the pooch representing NY Pizza . I don't think I have ever ordered rubber on a pie but yours taste like good ole Michelin Tires. It's absolutely the WORST PIZZA I HAVE EVER HAD !! I might be sick", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "This is a great pub-like restaurant.  Good drinks. Good food.  Burgers, fries, fish and chips it was all good. Waitstaff was nice, friendly and helpful.  Though our waitress did need to go back and ask some questions about the menu that she didn't seem to understand well enough.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "I might not be the best reviewer as I don't drink alcohol so no comments on the bar tender's skills.  We ordered some finger foods - wings,  sliders,  French fries.   The first round of wings was too spicy per my colleagues so for the second round we got the garlic and mild spicy wings.   The sliders came in 3 different flavors,  I got to try the meatball but the bread was a bit soggy.   The fries were good.   The bathroom was located in the hotel next door so u had to go outside which was interesting, at least it was clean.   The service was a bit slow though.  The waitress was nice but she didn't come back frequently and I had to ask her to refill my glass with water.   We also had to call her to give us the check.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "Took a long time for anyone to acknowledge us. In fact I had to go get a waitress to serve us. She apologized and said she didn't realize anyone was sitting there. I don't know how you can miss that, but ok, whatever! The Santa'Fe Shrimp salad was delish. It's literally the only thing I order each and every time I come here. I would advise staying away from the Mojito's here because they honestly don't know how to make it well, but their Long Island Ice Tea is great! Last night I decided to try a new drink, and I tried the Cadillac Margarita. That drink was so delicious and not watered down, I ended up asking for another one. Next time you're Downtown Brooklyn make sure you pop in and try the Cadillac Margarita!", "author": "Paris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Good food \u0026 plenty of beer options. Lots of space put back and the locals at the bar seem to have some fun. The waitress on was very sweet and kept a great friendly feeling around the bar. Opposite the Sheraton \u0026 Aloft hotels so great option for cheaper \u0026 better food \u0026 atmosphere if you're staying there.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-12", "description": "*Take-out Order*\n\nI got bored of the same places I would go to for lunch, so I decided to research on other restaurants around my office and  found Brooklyn Brewhouse. I placed my order and went to pick it up in 5-10 minutes. The restaurant/bar is situated next to/inside a hotel. Very laid back and chic decor.\n\nWhen I arrived at the restaurant, there was no one to greet me or standing awaiting for customers. I walked towards the center of the restaurant and I was finally  greeted by someone who took my payment and gave me my order.\n\nI ordered the mini cheeseburger with fries. The mini cheeseburger weren't so \"mini\" which I was glad to see. The buns sure was bigger than the beef patty. I didn't really like the texture of the beef patty because it was overcooked and felt dry. The fries were mediocre, not the best and not the worse.\n\nI definitely will come back to Brooklyn Brewhouse to try out their other menu items and also I found out it's also a sports bar so I think this will be a possible place for me to check out when the NETS are playing again.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Visiting from Maryland. Great food/drink and most importantly the people! \nHighly recommend!!\nCts", "author": "Clifford S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-25", "description": "Cute little spot on the ground floor of a hotel.  $5 happy hour, though the beers are limited to things like Blue Moon and Coors Light (sadface).  I've only been in the area a few times for work, but it seems like there isn't a whole lot to do around the Fulton Mall area, so I'm sure the Brooklyn Brewhouse was a nice addition.\n\nService was indifferent and slow, even though I got there around 4:30 and there were only a couple of other patrons at the bar.  Hotel bathrooms are nice, much nicer than a normal bar!!", "author": "Dione D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Excellent place to wind up your day for happy hour. Great beer selection.  I had the burger and it was just as you would want it to be.  The staff was extremely friendly and accommodating.  Absolutely worth a visit.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Great atmosphere, music and food' no complaints. Great staff  I ordered the shrimp salad , tilapia entree and my husband ordered the steak fajitas. Tasty", "author": "Kali S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "Don't ever go here it's a waste of time and money. I live a few blocks away and have been looking for a go-to wing spot for occasional sports watching. I gave tbhi a place a shot and now wish I hadn't. \n\nThe wings were not very good and the overall bill was a bit steep. The clientele was less than desirable to say the least. The guy next to me had a coughing fit and I thought he was going to die right there. I was actually kind of banking it as it would have probably let me slip out without paying for the overpriced food. \n\nEven if your staying at the hotel your better off heading down the street for something else. If this review can save just one person out there from the same mistake I made it will have been worth writing.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "DJ was great. Had the flat bread pizza and it tasted awesome. Plus they have my favorite beer on Tap...", "author": "Johnathan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "Because we were staying at the Sheraton across the street, we went here because it was conviently located.  We ordered the margarheta pizza.  Delicious, with a thin, crisp crust, tomatoes and cheese.  The basil was little oven dried shreds; I would have put fresh basil leaves on top after baking.  My husband ordered two beers which he didn't care for but drank anyway.  Our server was prompt and friendly, so, all in all, it was a good experience.\nOn Saturday, we went back late at night because we were hungry after spending time at a bar in the meat packing district.  We ordered nachos without the meat.  Now, seeing that we opted out of the meat, the nachos should have been generously covered with cheese and vegetables.  Pitiful toppings and stale chips.  Yuck.  Wish that I had ordered their pizza again.", "author": "Robin C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}