{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "You don't come here for food. You come here for sports watching, beers and bar bites. Good fries. Guinness burger was mediocre.", "author": "Gary C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "A cozy little place. Mostly generic bar food and drinks. Good place to decompress, relax and watch the game. Bathrooms are next door in the hotel.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "I have to admit, when i heard that Downtown Brooklyn was getting a brewhouse, I was skeptical. But, after spending a few after work sessions there I'm definitely a fan. They have a good selection of beers, and food (though I haven't had any of that yet). The staff is friendly and attentive...and they mix a nice strong cocktail, too. \n\nI like that it seems to be a good mix of locals, hotel guests and office folk...which makes for a lively but civilized scene. The interior is nice...and goes on and on and on.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-10", "description": "Stopped in to meet with friends.  By the time I arrived, they were paying the bill and really wanted to go elsewhere.  My boyfriend said that for the price and quality, he wouldn't come back, though I understand why people do frequent BB as it's right across the street from several hotels.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Food was fine. Service was slow as molasses. Getting order to us, clearing, getting a second cup of coffee, getting the check. All took ridiculously long.", "author": "Hilary R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "Okay, after having had a fuller and well-rounded sampling of the food, drink, and service at this new bar; I am ready to give a more in-depth review.\n\nI still appreciate its advent on Duffield Street; but I am somewhat less thrilled than I initially was. \n\nFor one thing its much more narrower and confined than I remembered. Its definitely not a large space and during the 'happy hour' part of the evening you will find yourself crowded in pretty intimately with C++ programmers recently arrived from India; working in the nearby Metrotech government complex; and living in New Jersey.\n\nNext: there's not a lot of space to put your coats, umbrellas, or bags. These become littered on the floor where everyone stands; jostling against our feet. The bar does have hooks underneath the rail --which is good!--but apparently no one realized this but me.\n\nNext: bar service is competent and energized enough to get the job done. There's experience there. But there's also blandness and homogeneity: the staff are no different than that found in any other bar. What I expect from any bar styling itself a 'brewhouse' is pizazz, pride, and originality. This is not found on the tap list, either. Its just the usual assortment of beers that any area bar would likely have. Little longer list than most --probably 25 bottle choices and 7 tap choices--but still no original brew craft. The most interesting beer available was a Captain Lawrence.\n\nInteresting feature: the bar adjoins a quite nice, upscale hotel next door and when you want to use the lav; its the hotel lavs you are sent to. But you can also just hang out in that hotel lobby! Fascinating potential. Say you were chatting up a girl in the bar and need to take her aside for a moment of more secluded quiet, intimacy. The lobby next door! Perfect.\n\nFood: too pricey for the rather standard variety of bar foods. Frustrating; because it all looked decent, acceptably plated and portioned. We sampled two items and found them capably handled.\n\nNow, a really dire complaint: don't ever order club soda here. Its three dollars for a glass of seltzer water! Always ask for regular plain water. Outrageous.\n\nOverall: I'd come back but with much more reserve and caution than when the place first opened. Its got some quirks you have to learn the hard way.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "This place has the most amazing staff I have come across! Not only that the food is wonderful!! Keith the floor manager cared so deeply about our experience and was extremely friendly as well! Will return many times!!!", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "Meh. Came here for an atomic wings fix. They must have a new cook because these are NOT the real atomic wings. They barely have any sauce on them. When I asked for more sauce, I got a cup of watered down chemical-tasting hot sauce. Let's not even mention the fake blue cheese sauce that tasted like it came from a squeeze bottle.Go to down the hatch for the real deal.", "author": "tanichea b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "The ambiance is great! A nice place to go out with your honey, food is phenomenal and decor trendy. Loved the music, great area for shopping after. Parking lots nearby.", "author": "Adriana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "My girlfriends and I stayed across the street at Aloft and were happy to find a place to eat and drink that was so close by.  We literally went there 3 times in a 24 hour period - lunch, late night drinks, brunch.  Everything we individually had was delicious and the prices were affordable. The staff was exceptionally pleasant and accommodating, especially our waiter, Rene and the manager, Keith who came to our table a few times to make sure everything was ok.  Had a great time and will definitely go back next time I'm in the area!", "author": "Demetra L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "So I'm visiting from California and I'm staying at the Hotel on top of this place.\nCame in on my 1st night to get something to eat my boyfriend and me waited for 20 minutes at table and the waitress didn't even pay any attention to us i had to get up and go to the bar so they can take our order.  \nGave it a second try for some drinks its my boyfriends birthday and we wanted to get a lil tipsy , the bartender by the name of Stephanie was serving us that night was not very knowledgable on any of the drinks I wanted , I'm not sure if the drinks are different here in Brooklyn then in California but she did not know how to make anything I asked for . Very disappointed", "author": "Teresa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Stopped by for a few drinks during happy hour (4-7pm). \n\nSpecials were $5 drafts of Blue Moon (with orange!) and Coors Light, $5 Heineken light bottle and some other bottle, $6 wells, and $7 house wines/cosmo. Nothing out of this world, but good enough for the after work fix. \n\nThe food looked pretty good (the nachos we split at our table were good) for a bar though was a tad on the pricier side... I guess that's what you get for a bar attached to a hotel. Regardless, it was an unexpected delight on the construction-ridden area and worth a drop-in if you're nearby and in need of a drink or game to watch!", "author": "Sam A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "This place was extremely accommodating. Fast service and very friendly staff. Good food and good times. Highly recommend and ask for Cassandra. Great things come in small packages.", "author": "Norm W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Great service from our waiter Rene, very attentive. Checked on us several times and we never had to look for him. Will is a great bartender, he never ignores us or fails to check on us.", "author": "Keisha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Solid bar, but 5 stars really go out for Will, the bartender! He serves a great cocktail--and brings hysterical conversation. Really enjoyed hanging with him at the bar while I waited for my friend to meet me. Definitely plan to go back soon!", "author": "Natalie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-13", "description": "Cozy atmosphere..great bartenders...they keep your glass filled no matter whose paying..", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "This is a cool little spot in Downtown Brooklyn. The staff is great and the burgers are even better !! Stop in and have fun, I did !!!! Thanks Brooklyn Brewhouse.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Wonderful environment !! Exquisite staff super friendly and cordial! Keith the floor manager was so pleasant and personable and genuinely cared about our experience! Great prices and also will come back many many times!", "author": "Christae M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-26", "description": "Awful service. They told us to sit anywhere then promptly told us to leave after we sat down because a table had a reservation 2.5 hours from when we sat down. Incredible", "author": "Steve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-05", "description": "Went in on a Thursday night to be told the upstairs bar is quiet. I'm not mad old and was with a colleague from work. Took the suggestion and waited 10 mins. only to have to flag down the bartender for drinks. Ordered a Warsteiner and the casually late and very rude bartender had to go to the bar downstairs to bring my beer. I could have had it imported from Germany faster than I was served.", "author": "Dorothy A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}