{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "I was staying at the Aloft Hotel across the street. I had just run the New York City Marathon, so I wanted to eat something that was as close to the hotel as possible with minimal walking. The restaurant was somewhat narrow and long. There were several TV screens at the bar and a couple of big ones all around the restaurant. It was a decent place to catch the World Series game. I started things off with a bottle of Brooklyn Oktoberfest beer. I got the Guinness Burger for my meal. Service was decent, although it wasn't crowded when I was there.\n\n*Guinness Burger*\nThe taste was good, but I was a little disappointed with the size of the burger. It could've been that I was really really hungry, but I could've easily eaten 3 of those. I got the burger with a side of mixed greens salad.\n\nOverall, it was not too bad considering how conveniently close it was to my hotel. However if my legs were working better, I'd probably walk to some place better.", "author": "Emil C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Was staying at the hotel and wandered in to the Brooklyn Brewhouse at 8:00 on a Thursday. Immediately a waitress seated me and asked if I'd like something to drink. Place was about half full but the service was super fast. My drink showed up in under 3min. Even mix of after work people and young couples. Lot of good music that came close to drowning out conversation but somehow\nIt just made it more comfortable. Ordered a steak salad that showed up about 15 min later. It was good. Not amazing but good and I would easily order it again. This place is solid choice.", "author": "Ralph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "Came here for food on the recommendation that they have really good burgers.\n\nI got the Guinness Burger with Sweet Potato Fries. The fries costed an extra $3 but I thought they were definitely worth it over the regular fries or salad. The taste of the burger was fantastic as it has this unique flavor I had never tasted in a burger before. The fries were also amazing and they gave a lot for a side.\n\nNo comment on the drinks because I didn't have any, but great burgers!", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Where do I even start..... If I could give this place 0 stars I definitely would. As soon as we walked in the vibe was just off. The staff was a bit rude and did not look pleased to be assisting me or any of my friends. I ordered the Brewhouse burger, since I was starving and cup of henny on the rocks with cranberry. As soon as I got the drink it immediately tasted like gasoline (fake liquor). Because of this I just decided to get a sprite. You can't go wrong with soda. Anyways when I got my burger and began to eat it I noticed a STRAND OF HAIR on my burger meat. I was shocked being that I heard so many good things about this restaurant. It was definitely not my hair because I have light brown hair and the hair in the burger was black dark hair. When I asked the waitress to speak to a manager a woman by the name Veronica came by and asked me what was my problem. When I told her she said that there is no way she would serve me a burger with hair and even if the hair was from the Restaurant I would still have to pay for it because I took a bite. Are you JOKING?! as she walked away she rolled her eyes and sucked her teeth. Being that I'm not problematic I just decided to pay for something I DID NOT EAT and leave peacefully. I do not recommend this to anyone. This place sucks. Hopefully they can get their health requirements up to par as well as management.", "author": "Charlene P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "Meh. Wack service. Fries are decent. So not impressed. Poor waiter was also the bartender upstairs. Upstairs is very cute but the food service is horrible. Not impressed whatsoever.", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "A temple of culinary sadness where gloopy green mud is called guacamole; the nachos look like dog food, and the prison-style flatware cut into my hands as I ate a salty salad. Fajitas were despicable. Pizza was so bad even kids refused to eat it.  No reason to go here unless you are looking to watch sports in utter solitude, without having to deal with any sort of camaraderie or good cheer. I hope they close soon so the staff can move on with their lives.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "food here is horrible. however when you tell will you want a giant plate of bacon and he brings you 4 strips.... you yell a bit and you get your giant plate of bacon. of course I shared with the wait staff and some new friends I made.\n\nDelirium is on tap (OMG!) and they have quite a few craft beers as well. \n\n\ndon't come for the food, come for the drinks and the people you'll have a blast.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-25", "description": "Wings weren't the best I had. \n\nService was a bit slow but it's a big place with only 2 waitresses. Sweet and polite though. \n\nThe Cobb salad was like hamster food. The chicken was diced up the size of tic tacs. It did not taste very good. \n\nI can see this place being a decent spot for drinks. Other than that... Pass", "author": "Brian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "Terrible customer service. Bartender had poor communication about prices and was cheap on the pours. Management was completely inflexible and lacked a human response to our complaint. Oh, and the place was hot and uncomfortable. Even for DT Brooklyn. Only plus is that the bartender was friendly. Just couldn't pull her weight with management. Skip it and find another spot for happy hour. \n\nPS - this is my first bad review ever on yelp.", "author": "Ben T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I've mostly been here during the week for a few drinks after work. The bartenders treat you like regulars and I have to say, they have the best wings in NYC. Its consistently great all the time, all flavors. I havent had a bad meal there. Glad its near my job.", "author": "Medicia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "BLT Lobster Taco - OMG I never thought to put the combination together but was certainly impressed by both the quality and presentation of this dish. Definitely satisfying, which at $14 for two it should be in my opinion. I also got to taste the wings (cooked perfectly), shrimp cocktail (leaving much to be desired providing about 5-6 shrimp per serving) and the Steak Taco which was awesome too. The drinks are strong and reasonably priced. We did not have any of their specialty cocktails.\n\nService was plesant and quick. We had Cassandra as our waitress both nights we visited from across the street where we stayed in the Sheration Downtown Brookly. \n\nLocation - Couldn't ask for better you are near both the Jay Metro Tech and Hoyt Street subway lines. It's downstairs inside the Indigo Hotel for those lucky enough to just catch the elevator to your room. Duffield in a one-way street with lots of construction, however I found it easily never visiting that location before.\n\nAmbiance - Friday it was sort of slow, but I blame that on my tiredness. The music was decent. Saturday, the music was a bit more lively and there was a larger crowd - thankfully that didn't stop the great service. The DJ danced with the crowd - made up of mostly young professionals 25 - 35 along with guests of the hotel which ranged in age. \n\nWe would definitely go back - its very convenient and I really enjoyed the service most of all.", "author": "Hsia F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "Had a really nice breakfast and late night nosh here as we were staying in the Indigo recently as we had to travel to the BK for a wedding.\n\nLate night, after the wedding when we made it back to the hotel, we heard the DJ and still in party mood, we stopped for a light nosh and final drink and listened to the tunes.  (All reggaeton, lol)  The tacos, street style, were decent - good flavor, and the corn tortillas were pretty good and presented well in a taco holder.  Fiancee had a burg (Forever eating burgs) - and it had a great char grill on it, smokey, and he wound up almost finishing it.  Fries were let down, limp,not crispy.\n\nDrinks were poured stiff, and we enjoyed the atmosphere and felt comfortable that the joint was attached to our hotel, so after we finally decided to call it a night we were able to safely retreat through a side door into the hotel and up to our room.\n\nFiance got a package deal with the hotel for 2 free breakfast ($35 worth) for the next morning.  What a great deal, as we ordered food to our content, plus morning beverage - great to sop up the prior evenings shenanigans.  The omelets were fluffy, french toast tasty but the breakfast potatoes weren't that great.  Too much oil and paprika....way too much that the oil ran all over the plate.\n\nService was good each time, friendly and just attentive enough.\nThe music level though, was through the roof - but thankfully when we got into our room we couldn't hear it/blended into the backdrop of city noise.  \n\nI'd eat here again if staying at the Indigo out of convenience.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Pleasantly surprised by this place - it was delicious. Service was great. Wings are awesome! Burger was fantastic- I did the Guinness burger and added bacon and avocado. Very, very good! Also, side salad was ample and vinaigrette was nice. Beer was nice - tried two, local seasonal IPAs. \n\nThe hotel across the street (ALoft) recommended it and so glad we came. Reviews don't make sense to us. \n\nThanks guys! Great job!", "author": "B W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Great ambiance. The Owner and her staff is very friendly and welcoming. They serve the best Guinness burgers  and delicious wings. Whenever I am in town I stop in Veronica and staff.", "author": "Valerie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Love this spot, and the hotel it's located inside of. My wife and I love coming here on date nights. The drinks are awesome, food is great and the staff top notch. Love their appetizers and their burgers. Never disappointed whenever we come to the Brewhouse. TV, the ambience of the place, fantastic.", "author": "J A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "The Brewhouse was located opposite my Aloft Hotel (Sheraton \u0026 Indigo almost adjacent also). This place is open 0630-0400 I believe and we visited it twice a day during our visit to Brooklyn. Their breakfast was huge, extremely tasty, and reasonable $. But oh the staff. Marina, in the mornings, was so professional, friendly \u0026 warm. How fortunate we met her on our visit. Outstanding! The evenings there are equally as fun and good value. Cocktails were generous and crafted well. Beer reasonable with lots of choices. And again - the staff! We had the pleasure of meeting Jeanet. Just wow! She handled us with care, smiles, remember our preferred drink order, very efficiently and just a joy to talk to. I have traveled extensively for 30 years and I can saw my multiple visits to Brewhouse during our visit were a highlight of my Brooklyn experience. Yay, Marina \u0026 Jeanet!\n\nhttps://www.tripadvisor.com/ShowUserReviews-g60827-d4890693-r536664310-Brooklyn_Brewhouse-Brooklyn_New_York.html#", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Been here a couple times, music is great, drinks \u0026 food are great, suitable for an after work hangout, needless to say one of the best Brewhouses in Brooklyn.", "author": "Frankie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I love this bar the food is amazing But what really makes this place live is the supervisor Marina \u0026 The Bartender Jeanet They Both Bring Live To this Bar Great customer service.", "author": "Diego B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "I had \" Guinness burger \" , it was excellent , very well prepared and served . You probably can get some idea from pic i posted .\nYuengling on tap was the 2nd star of the night , definitely going back .", "author": "Alı B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "This is a nice spot to go in my opinion if you just want to sit at the bar and catch a game while having a nice meal and something to drink. It never seems overly crowded so it's not the live scene some may be looking for, but serves my purposes when I just want relax for a few before heading somewhere else or home. The food is better than most pubs and bars, although it is a bit on the pricier side in my opinion. The service and ambience always seems great to me. BTW, I haven't had it in a while, but to me the pizza they served was excellent when I've tried it.", "author": "Peter R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}