{"aggregateRating": {"reviewCount": 163, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "BOMB WINGS! Honestly, their wings are so good. These Thai chili wings are delicious and makes me want more and more. Shout out to Jeremy the bartender for introducing me to greatness and other suggestions! I'm so impressed with their food and Jeremy's service is amazing! He's attentive and sweet and nice ! I highly recommend their wings and hanging out with Jeremy for a drink! Worth it!", "author": "Giselle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-14", "description": "Stopped in after a later check-in to the hotel. Nothing extremely memorable on the menu and prices were a bit more than expected for the portion sizes. With that being said, their cocktails were pretty good. \n\nOverall, the restaurant was clean and the staff was attentive. I probably wouldn't recommend this for someone who wasn't already staying at the hotel.", "author": "Alexa T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-14", "description": "First time we came here on a whim and it was a great night. We were seated, we had chicken tacos and they were decent. The mojito was strong and good. The service was good as well.\n\nThe second time we came here and sat at the bar. It was downhill from. I noticed bar service is usually subpar but this was ridiculous. The bartender who may have been new was honed in at our section and even tried to insert herself into our conversations, when we asked for an adjustment to a drink as it was a bit too sweet for the person in my party - she was not accommodating even though he only took a sip, she then proceeded to hover over us and beg for a tip before we left. We ended up leaving earlier than wanted because it was that uncomfortable.", "author": "Alexus P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "This place doesn't have great beer for a \"brewhouse.\" \n\nMore importantly however, I and several colleagues have had multiple issues with our credit cards on different occasions here. Last summer my school had a Christmas party here. When I cashed out they gave me the booklet back without the credit card in it. I asked, and they insisted they gave it back. I end up having to cancel it after seeing thousands of dollars or charges at an Apple store in Bridgewater New Jersey.\n\nCame back here again about a month later,  bought one round and cashed out. Again they did not give me my card back but this time  I was more forceful asking for it and the bartender \"found\" it.\n\nFast forward to this year. My friend and my colleague both had their credit card disappear. My friend got it back, colleague never did. This place is a total scam. If you need to go, pay cash.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "This is probably my FAVORITE place to get wings downtown. I have them about once a week. The Thai chili wings are to die for! Honorable mention to the garlic parm wings (although not pictured here). And the bartender, Jeremy is amazing! 100% would come back for him alone. If you're looking for a fun spot to drink with friends, any day of the week, this is it.", "author": "Imani G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-23", "description": "Sat at the bar, Ordered the grilled chicken wrap and 2 beers. It takes a bit to make me complain, but at $15 for a chicken wrap they really need to educate the cook on how to cook chicken. Rubber chicken end to end... completely inedible. Samantha was attentive as a bartender, though didn't seem to care much when I sent back the whole order with one bite out of each half of my wrap. Not sure if management wasn't present or just didn't care, no one came out to hear my concerns, I guess cash is king. I paid the whole bill, but I highly recommend against eating here. I won't be back. The only reason I give 2 stars was that the place was clean and I could recommend stopping in for drinks.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-09", "description": "They are not open till 3pm\nGiving a higher rating because the earlier people are nice.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Love the atmosphere the service and food is good as well. Jermey the bartender can mix up quite some refreshing drinks. I recommend this place to anyone visiting the Brooklyn area.", "author": "April L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Cool spot. Popped in a Saturday night around 2 am and kitchen and bar still open. Not a crazy loud crowd but pretty nice and chill for a Saturday night. \n\nSunday am popped in for breakfast and it was great! Pricing, service and atmosphere was perfect for a Sunday am. Surprised it was so quiet. I guess 9 am was too early for a Sunday am.", "author": "Virginia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "I went here on November 1, 2017 to celebrate a friend getting a new job. The burger was delicious and so was everyone's food that I sampled. The drinks are also good. This place is not cheap, but considering the rent in the area and the fact that they are attached to a hotel I can empathize.  If you go during lunch they have some specials. This place may also be a good option for lunch if you do not want to be in a crowded space in Downtown Brooklyn that has simple American style food. I've walked past it so many times until a friend of mine reminded me they have food as well as an extensive bar. \nI have been here for a few farewell parties and they are stellar with their customer service! I will definitely come back to try the lunch special and of course to drink in general.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-07", "description": "Came here for breakfast with a friend. The staff was rude and seemed bothered that we were there so early in the morning. We were the first customers but we were hungry. Even though we were the only customers the service was so slow. The waiter didn't come check on us for over 20 minutes and we did order, he didn't even talk. Just stood there and looked at us with a scowl on his face and roll his eyes even though we were friendly with.\n\nThe food was greasy, and it seemed not to be freshly made.\n\nSkip this place.", "author": "J N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "If I can give less than one star I would, first when I get there the server and all over me to order asked me a few times what I need but had told her that I was waiting for someone. That wasn't acceptable, had close my menu because she couldn't understand. After order a lunch burger, 2 mini burgers come out. Doesn't say that on the menu, for 12 and change it isn't worth it. After we eat we don't the server for the next 30 minutes. But no one was there, so can't use business as an excuse. Then after I complained the so called owner got a attitude with us, nasty and rude, last time I ever go there and recommend this same for others. This wasn't the first time we had bad service, but now we get the attitude behind it.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "Decent food and great drink specials are happening at this joint!", "author": "Samuel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Fast delivery of my tasty grilled chicken wrap. My wife had the Cobb salad with the bacon held. I joked that I would take her bacon and it was delivered to me with my sandwich. Lots of TVs, too, but I don't follow college football.", "author": "Alvin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "This is strictly a review about the atmosphere and their drinks, especially on a Friday night. The DJ is really good. The music is usually a mix of hip hop and a little r\u0026b. The bartender, Veronica, makes an amazing side car.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Great place to have a beer and conversation \n\nVery efficient, friendly staff.\n\nGood beer and food selections.\n\nA nice place to chill!!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "Um What ?! Came in on a Friday with two co workers and got seated by the hostess and nobody came up to us for 30 minutes . We were constantly asking to get served because we were hungry and wanted some wings. We ended up just leaving because it looked like nobody was going to serve us. This is just disrespectful and unprofessional and never will I come back here.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-17", "description": "The boneless buffalo wings look like intestines. I can't believe anyone would think to shape chicken like that and that someone would want to eat it. I did, though-I ate some. The chicken was barely real meat. I would highly recommend against this menu item. I can't speak to any other food as that is all I got. The atmosphere isn't too bad, though, and the service was responsive and attentive.", "author": "Jenn D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-17", "description": "I'll start off by saying that the service here sucked I was waiting at least 45 mins until I was even noticed and when I asked to speak to the owner or manger I was told The owner/manager wasn't available to speak to idk what type of Shit show they are running but I DO NOT recommend this place at all!!!", "author": "Manuel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-05", "description": "We stopped in to get dinner and a couple of drinks and to watch the Sunday night football game while we were in New York. We were excited to see a \"brewhouse\" right across the street from our hotel. The place was empty but the service was soooo slow. We had to ask several times to get new drinks, our food came out wrong but once they finally get our orders correct the food was good. We got burgers and sandwiches with fries so nothing complicated. Needless to say we did not stay to watch football, we found another sports bar for that.", "author": "Holly C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Brewhouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "229 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/c4FfQreOkkwLyBQ7NZk2fA/ls.jpg", "@type": "Restaurant", "telephone": "+17182547813"}