{"aggregateRating": {"reviewCount": 22, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "What a shame.  I was really liking this place until I guess they decided to start completing ripping their customers off.  \n\nI came here about four times before, and ordered two different kinds of Banh Mi: the pork and the chicken sausage kinds.  They were both pretty good.  I mean, I love a good banh mi, and I was pleased to have an option in the neighborhood.  I thought their prices were a bit steep, $14.50 for the sandwich.   But I generally accepted it because each time I received a large, thoroughly packed sandwich, cut in two halves.  The size of the sandwich, and the plentifulness of the contents, made it a fine deal.  And so I became a repeat customer. \n\nTonight, however, I ordered the chicken sausage banh mi again, paid the $14.50, and waited the usual ten minutes.  Then I was handed a MUCH smaller, thinly packed sandwich.  It was truly the size of one of the halves of the four previous sandwiches I had gotten.  When I asked if this was the correct order, they confirmed it was indeed the chicken sausage.  I said this was significantly smaller than what I had received in the past.  That was what I expected to get this time and why I was willing to pay that price.  The lame excuse they gave me was that that was the size of the bread they have.  The woman in the kitchenette offered me another but said, of course, that I would have to pay for it.  So, in other words, I could pay another $14.50 to get the other half of the sandwich I was expecting to receive.  Absolutely not.  I really should have gotten my money back, but I was so hungry and at that point I had to get to an appointment.\n\nShame on this place.  Total rip-off, and dismissive customer service to boot.  I definitely will not be buying from them again.  There are many other excellent options at Dekalb Market.", "author": "Jaydan M."}], "servesCuisine": "Vietnamese", "priceRange": null, "name": "Bunker Vietnamese", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/kbjU6bNnMGacWl7kbEbcLQ/ls.jpg", "@type": "Restaurant", "telephone": ""}