{"aggregateRating": {"reviewCount": 22, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-09", "description": "$18 for a small bowl of Pho when you can drive 20 minutes and get a bowl x3 times the size for 11. The soup was watery and the beef gnawing. I do not see myself coming here in the future for the food. The only thing acceptable and even worth the money is the desserts.", "author": "Asia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Went here on a Wednesday evening and they had no line so that enticed me. Ordered a summer roll which was full like the sample they have on display yet it wasn't as architecturally sound. It was falling apart before I could really enjoy it. It had a nice flavor and the sauce that comes with it brings it out even more. \nI wish that you got more than one for the price they charge, but I know here in NY summer roll is not as common as pizza so you can't expect to get rock bottom prices... as one would in California. \nI would only come back here to try something a bit more substantive based on the fact that they use hormone free meats and the seafood is wild caught.  For Vietnamese food, this place isn't the cheapest around, but I don't think most can tout that they're hormone free so it all depends on your health choices.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-12", "description": "The pho ga, not only it was tiny, there were less than 1/5 of a chicken breast if I round up. The soup was watery and lacks all the necessary veggie and condiments that make up a pho ga. For the price of $20 something (w/ tax), I would expected to be treated with something decent, not some watery empty garbage you throw in together at some neglected soup kitchen. \n\nA real waste of time and money. Ruin your appetite", "author": "Minh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "I've been to Bunker Vietnamese twice and each visit the Bahn Mi Sammy has been on point.\n\nWalking through the market, there are so many choices. When I'm craving a simple sandwich and there is a Bahn Mi within reach, I'm going to order the Vietnamese delicacy.\n\nBunker Vietnamese is one of the vendors that offers counter seating. There's lots of offerings beside Bahn Mi like Pho (Which I have not had yet) Bunker Vietnamese is also serving spring rolls and cold beer. What impressed me most about Bunker Hill, they use vegetables and meats from local farms and no MSG. I could tell the taste of the sandwich, all ingredients were fresh.\n\nIf your walking about DeKalb Market and want some righteous Vietnamese food, stop by Bunker Vietnamese.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "Located inside Dekalb Market Hall\n\nTried their pho ga. Smallest bowl of pho, and cost? $16. Gasp.\n\nSoup was... ok. Very mild in taste, and quite clear. Limited chicken in the soup. Could have added more noodles as well.\n\nHonestly, there are so many other cheap options with better taste pizzaz at dekalb market.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "How dare you charge me $14 for a non authentic banhmi?! Instead of the flavored roasted pork fillings that a banhmi usually serves with, they give you HAM!! \n\nI would have gone to subway for a better ham sandwich at half of the price.", "author": "Peggy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "I despise regretting my lunch choice. ESPECIALLY when I have to pay more than $10. It literally ruins my day. \n\nI was lured into the $14 turmeric fish banh mi, mostly because I was reminiscing on the grilled turmeric fish banh mi at Violet's Bake Shoppe in Forest Hills, Queens (which is only $7.25). The Bunker banh mi literally tasted exactly like a McDonald's Filet-o-Fish. TRY and tell me otherwise. The bread was meh, the fish was bland and way too fried and the toppings were not on point. Very little cilantro, way too much carrot, not enough of the spices and flavor. WAY too expensive for what you get. WAY. Just walk past it. \n\nMy favorite banh mi joint in NYC is Banh Mi Saigon in Chinatown. I especially loved that spot when it was on Mott St. Violet's had become my go to when I was working in Queens. I haven't yet found anything in Brooklyn. \n\nI REALLY hope that Bunker is not a foray into Vietnamese food for folks. It probably will be though since it's in DMH. \n\nThis is so frustrating. I want to pull the food out and ask for a refund. I SO regret not just getting the seekh kabob w/ paratha roll from BK Jani.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "Food is fine. Service is so slow you question every decision you've ever made in your life.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "Food: 6/10\nService: 6/10\nAtmosphere: 5/10\n\nBunker is located in the Dekalb Market Hall food court, and is situated close to the entrance for Trader Joe's.  I've attempted to give it a try on a couple of occasions, but only successfully ordered once - I had issues with not really knowing where to try to place more order from, which was compounded by the folks working the stall rarely looking up from whatever else they were doing.  When I did manage to place an order, I went with the chicken pho (no other options).  \n\nOn the pros side, I really like that they package the vermicelli in a large container, the broth separately in its own soup container, and the sprouts, basil, etc. wrapped up in a tin foil pouch, but not crunched up.  The portioning all seemed about right, and the broth was still piping hot after taking a walk of a couple blocks before trying to assemble and eat.  They also provide a set up of chop sticks, and disposable soup spoons with a wide and deep head like you'd typically see in an Asian sit down spot.\n\nAs for the cons, the broth really lacks any depth, and there were no condiments like hoisin sauce to help with that.  The chicken is also pretty flavorless and probably could have benefited from a quick sear to get some color and flavor, but seemed to have just been boiled and added to the broth.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-16", "description": "Worst food I've ever had in New York. Horrible. Bun was stale. Half the pork was cold. I got the Saigon. 0 stars if I could give it. Go anywhere else if you can. Thought it would be good. It was horrible. $14 you got to be kidding me. I wouldn't pay $1.", "author": "Samuel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "If you're Vietnamese, DO NOT DO IT. I repeat, DO NOT. If you're craving for some Vietnamese, call an Uber Pool to Chinatown for $5 and get $8 Pho over there. DO NOT PAY $15+tax for this place! \n\nI tried their Banh Xeo. Disappointed even though my expectations were already low. Decided to give another chance and ordered Pho Ga, I couldn't eat half of it. My boyfriend thinks this place is \"whatever,\" and that's not what you want to hear when it comes to Vietnamese food.", "author": "Hoa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "Worst tasting Pho I've ever had and the most expensive at $18.11 it should have been outstanding. The broth was flavorless and the beef dry and chalky, felt ripped off.", "author": "Candice C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Nothing trendy about serving over priced food to make yourself cool and situated in an industrial area across from a scrap yard. If you want to be trendy and hip and charge silly prices you better make sure your food is authentic and great. The fact that Guy Fieri came to your place does not make it cool. It offends me when the food does not live up to the hype because a celebrity says your off the chart. I went there because someone said the food was great-no other reason and you did not deliver what was expected. That was disappointing and the review must me written to set it straight.\nIrwin Z", "author": "Irwin Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-19", "description": "When I think of bad pho, this place is close to taking the top spot. I ordered the chicken noodle soup pho. First off, I felt very ripped off- the bowl was almost all broth with little noodles and chicken. I was shocked that the bowl cost $15. Second, the taste was terrible. The broth was incredibly flavorless and a huge disappointment. Overall, this place overcharges for low quality.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-25", "description": "Do not recommend at all.\nEverything is over priced...and food is...so bad...\nI really really regret having lunch here with my dad.\nWaste of money......", "author": "June S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "Yeah, I didn't get around to reading he previous review until I'd already ordered my pho. Relatively tiny, about twice as expensive as it should have been, and not terribly flavorful. No hoisin sauce, so I loaded up on sriracha and hot peppers to season it. Decent amount of white meat chicken for the size of the bowl. The menu describes a ginger ale that sounds like they're making it fresh, as I think they do at the main restaurant, but here it's Bruce Coast out of the fridge--luckily I saw that before I ordered it. Definitely won't be getting the pho here again, it's just not worth the cost for an absolutely average bowl of soup. There are so many options in the market for like 25 percent less, so I'd do something else.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-16", "description": "Well below my expectations.  I spend a fair amount of time eating Vietnamese food and have for the past several years. I found this place overpriced and the quality of the food inferior to most of the Vietnamese restaurants that I eat in.  I started my dinner with a Vietnamese crêpe which was overpriced at $14, it was the twice the usual price I pay in Philadelphia and not nearly as good: it was smaller,  overcooked and tasteless.  For my entrée I got their traditional Vietnamese soup with rice noodles, chicken and shrimp, The entrée included two small shrimp and over cooked chicken which was inedible. Overall my experience was very negative. The only High Point was the fact it was happy hour and I was able to get beers for three dollars each.  The music was also too loud and mostly hip-hop which is hard to dine to.  I left hungry and I will not return.", "author": "Seymour M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "More expensive than original restaurant. Portion much smaller. Pho is quite tasteless and bland.", "author": "N C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "Ok, nothing special. Unfortunately this is becoming a reoccurring theme at 445 Albee Square AKA DeKalb Market. Add Bunker Vietnamese to that list. Everything I've tried here is missing something. The flavors that make Vietnamese food special are not coming through here. I've had bahn mi and pho here and I've had better at other places.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "The chicken pho is terrible... I can get $6 authentic pho at Chinatown or 8th Ave in Brooklyn. I'm not sure why would sell pho that's not authentic or tasty. It tasted like water and hard chicken. This place is overpriced and not worth your time or money at all.", "author": "Nana Y."}], "servesCuisine": "Vietnamese", "priceRange": null, "name": "Bunker Vietnamese", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/kbjU6bNnMGacWl7kbEbcLQ/ls.jpg", "@type": "Restaurant", "telephone": ""}