{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "We visited here as part of Scott's Pizza tour of Brooklyn. It's a cute place located on the lower level of a building on Atlantic Ave (near Smith St). It's got a cozy inside dining area as well as a back greenhouse space that extends out towards the backyard. Pizza is the main attraction here---and for a good reason! \n\nWe got a behind the scenes tour of the beautiful pizza oven as well as the process that goes into making this delicious goodness. 90 seconds later, our margarita pizza was ready! Everything was very fresh and good quality. The only reason for 4 instead of 5 stars is that the margarita seemed to lack a little something---next time I will try with some toppings (and maybe save some room for their Nutella pizza!!) and hope to raise my rating!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "We went around 6pm today and the place wasn't yet crowded, with plenty of space in the backyard's greenhouse (highly recommend if it's nice weather out). We went with the Laura and Tartufata pizzas, both were great, filling, delicate textures, a mix of flavors, and altogether satisfying and homey. The Laura pizza was particularly impressive, especially the liquid-y part where tomatoes are mixed with the savory flavor from the speck and a touch of rosemary. Service was great and both pizzas came out within 10 minutes of ordering.", "author": "Chanoot S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Sì! Sì! Sì! Mille volte sì!\n\nThere's a lot of pizza in NYC. A LOT! And the competition is very fierce. \n\nLuckily, Sottocasa Pizzeria stands out on its own. It's by far the best Neapolitan pizza that I've had in NYC.\n\nI walked in and was promptly greeted by a friendly Italian woman. I sat at the bar and looked over the menu. The first thing I noticed was decent prices. Thank God! Pizza is pizza. It's not steak. It shouldn't break the bank. \n\nI ordered a beer on tap ($6) and asked the waitress/hostess/owner what she recommended. She asked me what I liked. I told her I wanted something different. She pointed me to the Valdostana which is a standard pizza with prosciutto, fontina cheese and sage. It sounded delicious so I got it. \n\nNot even 12 minutes later, I was presented with a beautiful aromatic pizza. The smell from the sage was intoxicating. Usually pizza gets basil but the sage took it to a whole different dimension. \n\nI went to work eating and savoring every bite. It was perfect. Salty prosciutto and cheese, a hint of sweetness from the tomatoes and the profumo from the sage. Wow! The crust was charred beautifully and had the perfect balance of chewy and crispy. It was a tad bit \"wet\" but that's how Neapolitan pizzas are supposed to be. \n\nNote that the pizzas are individual (10\") but can be shared if you get more than one. \n\nUn'esperienza perfetta! Grazie!", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Went to their original location in Brooklyn and loved the place! Fantastic pizza, good wine list and one of the best espresso in town.", "author": "Katie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "First time to Brooklyn and had a craving for pizza, Sottocasa fit the bill, great atmosphere, good selection of never tried before beers and great tasting pizza.", "author": "Tim J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "Forget cheap, $1 slices* and let's get classy people. Sottocasa brings that elegance and refined take on brick oven authentic Neapolitan pizza that we're all looking for. It's a cozy, inviting and rustic little establishment. My friend and I were looking for someplace with a great atmosphere and reasonably priced dinner. And we found just that.\n\nSottocasa sources their flour and tomatoes from Italy as well as their wood fired oven was built and shipped directly from Naples! How's that for ya? When I walked inside I was immediately enticed by their simplistic decorations and wooden picnic tables. We were asked if we'd like to sit in the closed-off greenhouse. UMMM... YES PLEASE! Just my kind of seating. They have stringed lights from the ceiling and heat lamps for when it gets cold. Practical and pretty.\n\nNow let's talk food. For the antipasti we ordered the Prosciutto, Mozzarella and a side of Arugula salad. It was all extremely fresh -- a nice beginning to our meal. As for the main course we weren't too hungry and decided on splitting a pizza. We chose the Salsiccia: tomatoes, mozz, hot italian sausage and basil. *Sigh* The dough was perfectly crispy and held all those ingredients fairly well. Brick oven just has that home-y taste that you can't get anywhere else. That crispy, slight (in a good way) charred crust. Brings me back to when I visited Italy when I studied abroad.\n\nOur service was great... the waiter was friendly and helpful when deciding on what to choose. As well as we didn't feel rushed since we had a lot to catch up on that night. Hey, we're talkative people! \n\nOverall, I'm really impressed with this place. I can't wait to come back and try their other items on the menu. *Eyes immediately drift towards the Burrata pizza*. Next time it is! \n\n______________________________\n*I mean don't get me wrong... we all have those $1 pizza night cravings. You know what I'm talking about.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "This place is super cute! The decor is very warm and intimate. The pizza was so freakin good I finished a pizza and order a calzone the dough is so light! Highly recommend if your a wood oven pizza lover!! Place is a hit! Great work!!!", "author": "Martin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "Five stars for the pizza, four stars for the appetizer. We had the beet salad and arugula salad to start -- not very memorable. For pizza, we ordered the burata, usually only available on weekends, but they had it on a Tuesday ? Love the super thin crust. The outdoor seating area in the back is super cute and cozy too.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "Sottocasa is a sweet, little restaurant with fantastic pizza. We arrived on a hot summer night and found it empty...until we realized that there was a lovely outdoor area in back full of customers. We joined them and dined on tagliere, barbabietole (beet salad), and valdostana pizza.\n\nTagliere, an appetizer of three cheeses and three cured meats, was delicious. The cheeses were particularly memorable - especially two balls of fresh, soft ricotta that were sublime. It was served with a pizza-sized flat focaccia. This was a huge amount of food and well worth $16.\n\nBecause we had the appetizer, we were already well on out way to \"full\" so two of us split one pizza. Although the waiter described the pizza as personal sized, it was large. The valdostana was classic tomato and mozzarella with fontina, prosciutto, and sage. The sage actually added fantastic flavor. We both loved this pizza - the crust is soft and chewy and as my boyfriend noted, \"I could have closed my eyes and been in Naples.\" Absolutely.\n\nFriendly Italian staff, good service, great atmosphere. Also a very interesting beer selection.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Talk about a cozy pizza place on the lovely Atlantic Ave strip! Although you may walk down some steps to enter, nothing in this place is low level at all! The authenticity can really be felt from the minute you speak with your server. Strong Italian accent followed by amazing Italian recommendations. My buddy and I split two pies and the charcuterie board. The board was one of the BEST I've had. I want to go back just for the choice meats and cheeses. But don't get me wrong, the pizzas are damn near perfect. Nice char(we even asked for EXTRA CHAR) and they delivered. \n\nI can't pronounce the name everytime I tell my friends about it, but that doesn't stop us from going and enjoying Sottocasa!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Good pizza, simple and elegant. Really nice tiramisu and cafe Maria, would highly recommend!", "author": "Vie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "I enjoyed the food the few times i was there but their fucking disheartening with their delivery service. Ive never encountered a business that refused to deliver food more than a 5 block radius. I gave two different addresses and none of them worked. The second address couldn't of been more than 10 blocks or less. Keep your clientele you wont see my face again, food is not good to the point where i accept bad business.smh", "author": "Shaunette W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Loved, loved, loved this pizza!\n\nMy bf and I stopped in here randomly and I'm so glad we did!  We had pizza- margarita and with spicy sausage! If I wasn't a lady I would have been licking my finger and the plate clean!  The crust was perfect and the flavors were wonderful!  I agree the pizza (and the restaurant) was smaller than expected but I wanted more and more!", "author": "Linda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "The pizza wasn't bad, but it wasn't memorable either. Ordered the Verdure and the vegetables were cold and kind of raw. The crust was ok but fell too soggy underneath all the veggies. I don't mind a wet crust on a good Neapolitan style pie but this was too wet for my taste. It was also rather bland, so I had to turn to my best friend, red pepper flakes, to kick in some flavor. \n\nOk for the neighborhood but not even close to the best pizza in Brooklyn. That honor goes to Juliana's, just one train stop away.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "This place was designed after the definition of wood fired pizza.  Fresh, delicious ingredients.  Lovely wine list with intelligent staff that give great wine references.  \n\nYou have to try the TARTUFO in hazelnut.  Divine.", "author": "Heather J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Ok so to start off the service was good but you have to be a millionaire to buy a pizza. The pizza was soggy and as soon as you picked it up all of the condiments fall off. The drinks were lukewarm. Then it was time for the bill, when my father saw the bill he almost passed out lol. The bill was a 100 dollars for three small freaking pies. As soon as the dessert menu came my father wanted to get the hell out of there. To top it off my mother and aunt orders an extra pizza and wanted to know if the wine was dry. Your better off going to papa Johns then this crap. Lol", "author": "Jaden C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "We've been to Sottocasa twice and both times been underwhelmed. The IDEA of the pizzas on the menu are (is? - ah, noun agreement, you fail me) great, but in actual practice, they were pretty darn disappointing, both in sheer similarity and sad flaccidity. Mascarpone on a pie is always genius...wet, soppy, soggy crusts are not. From the margherita to the laura to whatever it was that I had with the sage and the prosciutto were all equally watery, floppy messes. The cheese skid off the pies and they were near impossible to enjoy, much less eat.\n\nCall me lame but I also like to have a non-pizza option that appeals at a pizza place. An appetizer, a side...something that piques my interest and tantalizes the appetite. The options here were sad. A basic mesclun and other humdrum salads. No specials. Even the servers looked bored.\n\nAlas, 2x not a charm means we aren't going to go back. Sottocasa is indeed the bottom of the house in our house.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Great Italian microbrew selection and delicious woodfired pizza", "author": "Carissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Great gluten free pizza! (you do have to pay extra for it) I always order to go, but the place looks nice and cozy.", "author": "Kristeli Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "I was actually the first customer here... I watched them as they were building it because my bus stop is right out front. They're from a region very near my family in Italy and so I was thrilled to learn an authentic Napolitano place was opening. It never disappoints. The salads are my favorite (Tonno e ceci!) and the pizza is the best the best the best. Chewy and so full of flavor because of the simple fresh ingredients. The staff is friendly and kids feel at home. \nNow! 5 years later... I can honestly say it has only gotten better! \nI  sottocasa.", "author": "monte b."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}