{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Excellent service...fresh ingredients used for all their brick oven pizza offerings...appetizers...desserts.  Highly recommend if you're looking for a wonderful dinner/lunch solo or with friends or family.  5 stars.", "author": "justin s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Came here for a friend's birthday. We ordered 4 pizzas and a prosciutto salad.\n\nThe overall feel of the restaurant is pretty rustic. There is seating both indoors and outdoors. It feels very homey and I really enjoyed the ambiance.\n\nTo the food! The prosciutto salad was really good. It came with prosciutto, arugula, and fresh mozzarella. Sometimes I am a bit cautious about prosciutto because it can be too fat, too salty, or have a weird smell/taste, but this one had none of those so it was really good! The pizzas for the most part was pretty good. We ordered one of the calzone-esque pizzas, eggplant pizza, one with tomatoes and cheese, and another that eludes my mind... From a taste perspective, it was pretty good, except a few of them got really droopy. I'm not sure if it was from the toppings or perhaps the dough was undercooked? So I would say that was one of the detractors. We also ordered dessert. The tiramisu was really good! Very moist and creamy, but not too sweet. My friends also raved about the Nutella pizza, but I passed since I was carbed out at this point...\n\nLast thing to add is service was kind of slow...I think we sat down for a full 20 minutes or so before someone came around to take our order. However they were pretty attentive once we got our order in and food started coming out. I would come here again.", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Glad to see the pizza is still excellent.  Tried the Salcissia in addition to the Daviolo.  The sausage on the Salcissia was seasoned with fresh fennel and black pepper.  We regretted not doubling our order.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "This is probably the best pizza I've had in NY, ever. The sauce is incredible, but the crust is where it's at. It's SO GOOD. Perfect serving size for one person!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "This has become my new go-to pizza place for dinner.\n\nIt's a slightly different style of pizza. The pies are a little watery, which the menu notes is intentional because it's Neapolitan, and I actually like it more than traditional pizza. The ingredients are very fresh, and it's always cooked just the perfect amount to bring out the flavors.\n\nI recommend the spinaci salad as an appetizer and the radicchio or boscaiola pizzas. \n\nIt's also a little cheaper than some of the other sit down pizza places nearby, and the Italian beers they serve are excellent.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Place is a cool lil spot. Sat down and ordered a quick pie before an islanders game. Pizza came out quick and it was good.overall though it is not a game changer. Nothing fancy just good pizza.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "My favorite \"up-market\" pizza place in Brooklyn.  Their white pizzas are especially good (because it's a thin crust, the tomato sauce based pizzas feel a little more soggy).  The service is amazing.  Love to come here with family and out of town friends for the environment.", "author": "Anonymous S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Had a great experience here, the food, the service, and the atmosphere were amazing (my company of course made the meal unforgettable).  Definitely a place to go in a group, if everyone orders something different (sharing is caring)it makes the meal and the place feel like home.", "author": "Natalia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "REALLY good pizza spot.  The vibe was very chill and psuedo romantic.  They had a great menu with lots of fun Italian IPA beers and specials.  We were here for the PIZZA though.  The dough was nice and light and fluffy, their cheeses were all great, the ingredients were high quality.  The staff was nice, never made you feel rushed but also were speedy.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "The two delicious pizzas that we had delivered to our hotel came so quickly that the oven must have been just down the hall.  Whoever is running the kitchen at Sottocasa should be appointed Postmaster General.  Anyway, both selections -- Salsiccia and 4 Fromagio -- were very tasty.  The crust was relatively thin, with fine texture and just the right amount of char.  The red sauce on the Salsciccia pizza was tangy and the sausage was great.  The cheese pizza was generously covered in an array of cheeses and also garnered favorable reviews.  I don't think I'd walk a mile in a blizzard for this pizza, but maybe a half-mile.  Delivery was unparalleled.", "author": "Mark W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-09", "description": "My server Francesco was less than thrilled to help me this evening, my date and I ordered 2 pizzas and 2 beers and were given attitude throughout the whole interaction. Our thin crust pizzas were cooked in a wood burning oven, but only our crust were crispy, the food was filling none the less. When we were handed dessert menus I just didn't have space, everything sounded appetizing but I couldn't fit another thing. When Francesco asked if we would be ordering my date politely said no, at which point we were met with more attitude and eye rolls. On my way I out I said thank you and goodnight, at which point Francesco ignored me the bartender politely said bye. Would not recommend for any reason.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Great pizzeria in Brooklyn offering a wide selection of appetizers, pizze rosse and pizza blanche.\n\nFor the appetizer course, I had Barbabietole. The roasted beets were pleasantly sweet and could have been better balanced by more goat cheese in the whipped cheese mix. \n\nThe Taleggio pizza (mozzarella, taleggio, prosciutto di parma, parmigiano reggiano, basil) was a clear winner as it was of the right thickness and was topped with a generous helping of prosciutto, making it well worth its price tag.  A few more basil leaves would have really helped to kick it up another notch!\n\nHoping that this place will soon be open for lunch as well!", "author": "Shulin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Truly the best pizza I've had in a long time. It was the almost 5* rating that brought us in and we weren't disappointed. Fantastic pizza base (very important!) and delicious toppings and options. Pizza connoisseurs will be happy. There's something for everyone. Great selection of sides and drinks, too.", "author": "Tops M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Excellent pizza in boerum hill.  I tried the burrata and taleggio pies. The burrata was delicious and slightly creamy, with cherry tomatoes taking place of tomato sauce. The taleggio is a white pie with mozzarella and taleggio, as well as prosciutto. Both pies were delicious. The crust was especially good. Try the hot oil on the pizza, it's awesome!", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "If you're ever in the Brooklyn area. I want you to stop whatever you're doing, and go check this spot out! Right when you walk in you're smacked right in the face with the aroma of delicious pizza and it's wonderful ingredients! The atmosphere In this joint is something I can vibe to on a daily basis. If only this place was located on the west coast. The service was nothing shy of impressive. Quick, and memorable. The food was perfect! If you love pizza. You'll surely love this place! When ever I'm back in town I'll be stopping in for another round!", "author": "Corey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "First time being here , I ordered a pie, it tasted great. I just didn't think it was going to be so small for the price I paid. Great customer service", "author": "Eileen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "Great pizza in Brooklyn not too far from the Barclay's center. The vibe inside is cute and rustic and the staff was very nice there and authentically Italian. I was there on the early side of a Saturday evening in advance of s concert, so it wasn't too crowded. There were families with kids there getting an early dinner and it seems like a great choice for a weekend meal. \n\nOne thing to note: this is not a slice place. You need to order a whole pie and they make it for you upon order.", "author": "Persia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Consistently excellent, hidden gem. I am a lover of speck, so the Laura is my pizza of choice. Great service and more importantly great pizza. Wife had the burrata pizza and loved it. Glad our friends turned us on to this place.", "author": "Angelo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Curated wine list with fresh gourmet ingredients in a relaxed and romantic setting. You'll feel like your in Naples with a glass of Rosé and a fresh pie", "author": "Geena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "Don't you wish a lovely, rustic little joint serving near-perfect Neopolitan pizza would open a couple blocks from your place?\n\nI always knew you wanted to be me.*\n\nSottocasa's space is simple (a few tables line the narrow space, with little decoration besides the oven), and the backyard unadorned (picnic tables atop gravel). At first glance, it doesn't look like much. But make no mistake: this is not your average slice joint.\n\nThere is little on the menu besides pizza, with options ranging from $9-$19. There are two lists of pies: one that you can feel free to add toppings to, and Le Speciali di Sottocasa, which they ask you to eat as they have been designed. We opted to share one of each... A simple margherita ($11), and the Laura: fresh-crushed Italian plum tomatoes, fresh mozzarella, speck, mascarpone and rosemary ($18). \n\nBoth pies arrived lightning quick, and I honestly couldn't say which I preferred because they were both perfectly executed and conceived, but so very different. The mascarpone and speck certainly gave the specialty pie a richness the classic margherita lacked, but both offered that slightly charred, chewy Napoli crust and a freshness that reflects impeccable ingredients. I would happily order either again, but I have a feeling I'll slowly make my way through the entire list, because this is a place I plan on eating often.\n\nIf Neapolitan is your preferred pizza, do yourself a favor and stop by Sottocasa. \n__________\n\n*I can't blame you. I mean, look at me, with my below average intelligence/height and vaguely doughy physique.", "author": "Peter D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}