{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Top notch pizza and great staff.  The owner comes out to ask about our meal. What more can you want?\n\nWe ordered the parmigiana and the luca.  I thought both were excellent but I'm partial to red sauce so parmigiana gets my vote.\n\nIndoor and outdoor seating available.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "Was visiting NY and my friend took me out to dinner here for my birthday. The wine is very good here. The waiters were having a bad night though I think as they almost spilled food all over me but it didn't get me. The owner seemed really stressed honestly, but she was trying her best. The food was pretty good. Very Italian like pizza. The calzone was probably what I liked better though.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Great pizza. Very authentic. Relaxed environment. Young and very good looking owners. Salads are also good. \nThey have a table soccer (biliardino) in the back, like in Italy!", "author": "Alessandro G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "The pizza here is amazing. Chewy dough and fresh toppings, can't go wrong with pizza here. I usually split a salad and pizza, which is filling enough for two. \n\nThe place itself has a lovely rustic look. \n\nService, however, is a bit slow. Like hey dudes, I'm not checking you out. I'm looking at you to get your attention and to get the check.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "Not the best pizza in New York. There are better options in Brooklyn. Went here after trying Lucali (3hr wait). The staff was friendly, good decor but the food was not great. We got the diavola and Regina. The diavola was flavorful but a bit burnt. The Regina was good but parts of my pizza were just soggy and tasteless. Both pizzas were nothing memorAble, a bit tasteless and soggy.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "We were craving some good pizza, since we came back from Italy about two years ago we just cant seem to find anything the comes close to what we had in Rome or Florence. \nSo after so many good reviews, we decided to try Sotto out. \nThe place is not big so if you going to come on busy hour be prepared to wait even though they do seem to turn around quickly. We took space at the bar, I do like the decor and the feel of the place its very cozy and kind of brought back some memories of places we ate at in Florence.\nNow on to the food, pizza was not terrible by all means but it was not great either. It's thin crust but sauce lacked any flavor, desert says home made by not sure by whom because its very tasteless. I love the ambiance but food was just average.", "author": "Regina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "Great option. \n\nThey have a greenhouse out back that is really great - cozy but still refined. \n\nThe food is pretty good - the pizza list is impressive and the dough is really tasy. The pizza didnt 'wow' us, but it was really good. I got a white truffle on with proscuitto, which was very tasty. \n\nService was alright - but slightly creepy fellow kept ragging on us for not drinking.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "I did a pizza tour with a friend last year and tried almost every neapolitan pizza in the city, this one was the best hands down.  Although we only ever ordered the margherita, their pizza is completely balanced with the perfect dough, sauce, and ratio.  They also have a nice enclosed backyard dining area. It can get a little loud depending on when you go but the atmosphere is nice and warm.  Don't hesitate to come here!", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-04", "description": "Sigh. Paul H and I have been dreading to write this review because we were so torn.\n\nWe had high hopes for this place based on all the outstanding reviews on yelp. Sad to say, we left very disappointed...maybe it acquires a very specific pizza taste:\n\nWe ordered the Margherita. The pizza was very very bland - there was little flavor in the sauce. Crust was not crispy nor fluffy. All in all, it was not special.\n\nPaul was honest when they asked how our pizza was... And the waiter was nice enough to apologize and offered us a different pie... But we were pretty stuffed by that point so we declined. The chef came over and apologized as well and said the pizza was on him. Even though they didn't give us the check, we paid the same amount in tip anyway... It just didn't feel right!\n\nSo sad, but don't think I'll be back.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Comparable to some other \"fine\" pizza establishments in Brooklyn. The pizzas are \"personal sizes\"; 11 inches. We ordered 3. One for my dad and 2 was filling for my mom, sister, and I. My dad had the salsiccia which he thought was okay because the dough was a little wet (soggy) in the middle which I would agree with our pizzas. Not sure how and why that happens but I've experienced that when making pizza at home. We ordered the verdure and burrata. My mom thought the verdure was too much, too many different flavors going on but loved the burrata. My sister and I really liked both. I've been wanting to try burrata cheese in general and this was a great setting and way (on pizza) to taste it. Note, the burrata pizza is only made on Fri-Sun. \n\nThe service is great. The dining room is really quaint and nicely decorated. It looked like there was an outdoor patio out back but we chose to sit at the very front, at the window, which was just as nice.", "author": "Ashlyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "I'm not a pizza fan but I really enjoy the pizza here.  Last night was my second time here. We had the Aglio, Olio which has mozzarella, ricotta, garlic and hot chili flakes. We added hot soppressata to it. Absolutely delicious.", "author": "Nel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Delicious pizza, fast service. Bright, airy space. Welcoming to families and kids of all ages especially in the first hours of dinner service. Focaccia bread is the size of a whole pizza!", "author": "Dori K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "This place was highly recommended to me, and it lived up to the hype. Really authentic (I used to live in Italy).", "author": "Ben B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "We stumbled on this place on a Saturday afternoon, and it was really wonderful. the pizza is very good - maybe not the best ever, but still very very good. The Italian microbrew beers were also nice. \n\nMost of all, it was just a lovely experience. The staff are great - so friendly and helpful. We brought our 8 month old in, and they were so accommodating, and even came over to talk and play with him. Our waiter even offered to clean a toy that had fallen on the ground! All in all, a nice, laid back and delicious meal!", "author": "Abby N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "Tried this out due to the fantastic reviews on yelp.  Have to say, didn't really live up to the hype.  Maybe I went into the experience with high hopes.\n\nWe ordered the Boscaiola and the Aglio, Olio.  The idea was good, but under-delivered.  The dough itself was completely soaked through and flimsy making it very difficult to eat.  The ingredients were mediocre - could have used a little salt or something to spruce up the unique flavors.  \n\nCompared to Roberta's or Saraghina, this joint - in my opinion - is under par.\n\nI'd go back, but with lower expectations.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "This was a delicious alternative when we couldn't fathom waiting 2 hours for seats at Lucali's. It's very family friendly, and the people are upbeat. The margherita was awesome. 2 pizzas for 2 people were just enough to fill us up for the rest of the day. \n\nI went again another time; 2 pizzas and a salad were still good enough for 3 not-so-big-eaters. We sat in the covered patio, where it can get stuffy if it's hot and humid.", "author": "Eva G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "I've had this place bookmarked for months now. WHAT TOOK ME SO LONG?  Good Lord, this pizza is amazing.  Huge selection of white or red pizzas.  I had the radicchio (the white version), with hot italian sausage.  Delicious and I want it again NOW.   Had a glass of the special wine, a Pecorino, that was perfect.   We sat at the bar because the table were just too close for my taste, but the staff was very attentive.  Will return for more pizza and to try the greenhouse area in the back.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "EDIT RESPONSE TO OWNER: im not sure what footage you saw but I KNOW what happened. my husband and friends wouldn't lie about the staff not checking up. neither would I! also, does your footage have sound?? were we mic'd? is this a reality show? lol no one asked us about the baby or our needs at all. the only check ins we're to order food and get the check. I wouldn't make this stuff up and I can't believe I'm having to defend my review. ridiculous. we liked the food! we would've loved to go back! but the servers did not give us the attention we really needed. the people who came with us have been to your establishment before with rave reviews and even they said the staff was noticeably rude and inattentive. your response proves what I thought abt your joint: You don't care abt your customers! \n\nORIGINAL REVIEW: I was at sottocasa today with 2 friends my husband and my 13 month old son.  I'm giving them 1 star not for the food. the food was great. we got 4 pies, I had the Quattro formagi and the Buratta. this is prob the most yummy crust since the ones we had in Rome and Florence. \n\nthey get 1 star because of the treatment of their customers by their horrible staff. we ordered coffees. the waiter came and put a hot cup of coffee right in front of my 13 month old. we brunch a lot. no one does this. no one puts hot food in front of a baby. you know why? because babies grab everything. so what does my son do? he immediately shoves his little chubby hand into a hot cup of coffee before I can move it away from him and spills hot coffee all over him. obviously hysterically crying right away at this point so I pick him right up and run to the bathroom and quickly remove his coffee soaked clothes and run cold water on his hands arms legs and feet. it's March. it's cold. so my husband has to now go to the gap on Fulton and get my son a change of clothes. that takes up about 20 mins. while we waited for him to return, no one, not the waitress or waiter or host or anyone, no one comes to say are u ok? is your baby ok? can we do anything? do u need anything? nope. nothing. instead they AVOID US! they literally walk around and past our table for 30 mins. when we finally waved them down they put our order in and the pizzas came out right away. we ate and chatted and tried to put the horrible hour behind us. people with kids know it takes much longer to finish ur food when u have a needy kid. well before i could finish my pizza the waiter came and took my plate away. I was tending to my sweet baby who had a pretty rough morning! they basically rushed us out the door and wanted to pretend like nothing happened. \n\nso first your poor wait staff foolishly puts a cup of hot coffee in front of a toddler. then ignores me. doesn't offer anything to a hysterical customer. then quickly rushes me out the door. maybe I wanted tiramisu? nope. didn't ask. nothing. they literally pretended like all that didn't happen. you could've at least said sorry or checked up on us or let us finish our food! it was so bizarre. I unfortunately will not be going back because even though the food was good the service left a disgusting taste in our mouth.", "author": "Noor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This place is beautiful, the waitstaff are crazy friendly, and the food is delicious. Me and a friend had the Laura, with glasses of the house white. It was a perfect amount of food, and it was an amazing pizza as pizzas go. We also split a divine tiramisu between the two of us and left feeling stuffed. 10/10", "author": "Alice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "BEST REAL FREAKING ITALIAN PIZZA in Brooklyn!  This is a family owned business and the owners (husband and wife) know how to run this business like a well oiled machine.  From a friendly greeting to paying the check...my experience was phenomenal!  The owner explained the menu to me, did not pressure me and was EXTREMELY attentive.  A glass of water was poured right away and they left the entire bottle for me incase I needed to refill it.  I ordered a pizza and a local beer from a microbrewery and it came out w/in 3 minutes..i kid you not.  Their oven was already hot and the food quality is very high.  The price is high, but I can see why they're 5 stars.  This is TRULY a memorable spot and I will definitely be back!", "author": "A D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}