{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "We were in search of two things: an outdoor patio and pizza. Check and check!\n\nI got the gluten free pizza with veggies--caramelized onions (YUM), eggplant and mushrooms I believe. Opted for no cheese because you know...#summerbodygoals AKA body by #pizza and #icecream.\n\nThe GF crust was CHEWY (all those gluten intolerant folk give me an AMEN) and was toasted perfectly in the wood fire. Just enough of the char to give the smoky flavor and a crispy crust to make you believe you were eating gluten. Personally loved the veggies too! Pizza was $16 + $4 for the GF crust. It was also normal sized (hallelujah!). \n\nWe also shared a beet salad that had apples and whipped goat cheese on it. To be honest, I did not like this dish. Beet to apple ratio was way off (needed more apple mixed in, not just as a garnish) and the flavor of the beets resembled a beet straight from a tin can. It lacked flavor as a whole that made it difficult to stomach.\n\nHighly recommend this place for GF peeps looking for a good pizza. Also, the patio is supes cute for a date! Would come again to enjoy the pizza...and maybe a bring a cute date next time :)", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "I had the   arugula  salad and diavola pizza; both were exceptional. Service was fast.", "author": "Bill P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Went here on a double date. First of all the pizzas came out in 7 minutes. 7 minutes on a crowded Saturday night.\n\nCan't complain about that. Something about the crusts on these pizzas is unlike everything I ever had. Delicious, fresh pies. One the best in NYC", "author": "Alex Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "The pizza is fantastic!  If they seat you in the back patio you may have to wait a while since this place is small and they may cater to people in the front first. Had to go to the front to ask for our bill and very little service after meal served.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "The restaurant is a lot larger in the inside then it appears when you walk in with outdoor/covered seating in the back.\n\nThe servers here are super friendly and it's a great environment to come relax and have a pizza with a drink.\n\nHowever I found the pizza was a bit soggy. Im use to a little crunch when I bite into my pizza. The pizzas here definitely don't skimp on toppings which is plus but perhaps just a little longer in the oven for a dryer bottom. It was hard to eat and after a while it all just tasted like toppings.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I love pizza. It's not hard to really. Of course it would be a bit difficult if you're on one of those no gluten diets. Or you have an aversion to carbohydrates. Thankfully none of those apply to me. \n\nI'm also fortunate enough that there are a plethora of excellent pizza places within spitting distance from my home. When you think of pizza you know the basics. There's the crust. There's the sauce. There's the cheese. That's pretty much all but there are so many variations that you can come across with pizza you'd be amazed. \n\nSotocasa is definitely the kind of pie that you leave no crust behind. They lean toward a Napoli style and you get an individual size pie when you pick. I always use the classic margharita as the base judge. You will not be disappointed at all. The cheese is embedded across it and holds the sauce down. The crust has a slight pop and light crunch to it that doesn't weigh you down. If you want a meat version give the Salsiccia (spicy sausage) a go. \n\nYou'll enjoy the cozy ambiance and friendly service throughout the meal. Stick around for a taste of Italy with an amazing tiramisu and a cappuccino.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "What a find! I'm pretty sure few tourists venture into Sottocasa because even though it's on a main thoroughfare, Atlantic Avenue, it's off the beaten path - literally. I walked by it a couple times looking for it because it's a few steps down from street level. It is worth finding. The dining room is small, room for two dozen, maybe 30 tops. It's a neighborhood place with a warm and comfortable vibe. And the pizzas are sublime. I ordered the Sassicia (sausage, basil and mozzarella with freshly made tomato sauce). Simply heavenly! The ingredients are in perfect harmony and each bite is wonderful! And the crust! Maybe the best part. Your server puts a bottle of olive oil on your table; use it for your crust. Yum!!! I concluded my dinner with a delightful biscotti plate and cappuccino. The next night I had the Diavola pizza - spicier sausage, same conclusion: delicious. Something I didn't order but wished I had was the arugula salad; the couple next to me did, and when the server brought it I could smell the dressing: like lemon and olive oil. Service was excellent: friendly and efficient. A young owner, Luca, who has created a special dining experience.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Sottocasa was another very good Neapolitan style pizza you can get in NYC. Similar to Kestè, you are served your own personal sized pizza that is easy to finish if you're really hungry and the toppings are all very good. I tried the special they had which was buffalo mozzarella, sausage and peppers and it was a great combination of flavors, and the crust was really chewy and slightly burnt from the ovens which I like.\n\nOverall it's very good pizza, Neapolitan is just not my favorite style because I like a little bite to the crust and the toppings seem to dampen the crust sometimes, but that's just personal preference. I'd definitely rate this place a bit better than Kestè solely based on the fact that you pay less for more and achieve the same high quality", "author": "Stefan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Above average wood-oven Neapolitan pizza. Somewhat disappointed by the viscosity of its dough and the slightly bitter sauce (I had a Napoli; that may certainly contribute but not fully explain the bitterness).  The Margherita had a soft dough.  None of us had an appetizer.  \n\nOverall, the ambiance is great.  Good crowd.  \n\nA good, but short (overpriced on a glass basis) winelist from Italy.  Many IPAs, mostly from Italy; clearly there's a demand. \n\nUnforgettable service.  Expensive, unattractive, and limited dessert menu.  \n\nIs it worth a bib Gourmand?   It's certainly worth the visit, and the price points are surprisingly attractive; but it is not a memorable experience ...", "author": "Peter W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "I'm a Brooklyn girl-aka I love pizza!\nI've never had a bad meal here!  The ingredients are extremely fresh and delicious and they have a decent selection of wine-for me, you can't go wrong with that combo.\nNot a huge place, but I've never had to wait or needed a reservation. (I imagine that if you have a big party you might want to call ahead and the setup can feel a little cramped so don't go with someone you really want to be alone with ; )\nI would say don't miss the burrata-as in order anything that comes with barrata on/in it, at least that's what I tend to do-and the tiramisu is fantastic!!  It's homemade and so creamy and delicious, I'm not even into tiramisu and I loved it.\nPIIZZAA : )", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Cute, authentic cozy pizza joint tucked away on Atlantic Avenue. Have been here twice now and enjoyed four pizzas total - diavola, salsiccia, parmigiana, and valdostana. I'm normally a prosciutto / spicy soppressata kind of girl, but the salsiccia is so amazing. It's really simple (which I like and the taste of the sausage is out of this world). My rec (if you have two people total) is to split two pizzas. You may have one or two slices leftover, but can always take home. One note on the focaccia app - it's HUGE which isn't a bad thing, but just good to know. Also, it's very warm in the restaurant itself on hot days so be conscious of that. Generally just an awesome place full of friendly people.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "The key thing here is that the pizza is great and comes out quick. Quaint brooklyn pizzeria feel that meshes well with the neighbored it is in. The service was ok. \n\nMy biggest caveat was that I wasn't seated in the backyard space when there was clearly enough tables for my party (a four-top). The reason was because they were very busy earlier. Better luck next time?", "author": "Derek S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "There are obviously as many opinions about New York-style pizza as there are New Yorkers, but this place serves up some damn fine pies in a cozy character-rich environment.  If you're in town briefly and overwhelmed by options, let Sottocasa be your pizza postcard.   \n\nThe wood-fired crust is chewy without being overly charred (as can happen with coal-fired).  They use high quality cheeses for their toppings, and vegetarians are spoiled for choice with options like (my favorite) the Verdure pizza, with heaps of mushrooms, caramelized onions, and roasted eggplant.  Also, set aside your carb inhibitions and try the nutella dessert pizza.  This was a surprise hit among our table, yielding a warm, English muffin-type textured crust, with a nicely portioned spread of melty chocolate hazelnut in between.  \n\nThe ceiling in the interior restaurant is a bit low, so especially for summer dining, the back patio is my preference.  Given how quickly the restaurant landscape is evolving in this part of Brooklyn, I hope that this place can stick it out for many moons to come.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "My husband and I came here on our pizza tour of NYC and I am so glad we did. The decor inside is fitting of an upscale pizza place in Brooklyn: kind of low lighting, lots brick. There is also a patio in the back outside that is covered. I would have loved if it wasn't covered but I'm sure that's used to keep the noise lower for neighbors. \n\nWe got there pretty early and there were only a few tables filled. I ordered a Margherita pizza and my husband ordered a pizza with olives and pepperoni. The pizzas came out really fast, which was amazing! I didn't even realize how hungry I was until we sat down. The pizzas were absolutely incredible. The dough was light and chewy and tasted great, the sauce was delicious (could have used more garlic but I am  a FAN of garlic), the mozzarella was incredibly fresh. I would have loved a little more basil on the pizza, but it didn't make this meal bad for me at all. The pizza was just amazing. my husband loved his as well. Definitely coming back here!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "So due to all the hype on Yelp I decided to come here with 2 others. We all voted in on this and all agreed it was a 3 star. I will say before going into detail I will say we did walk in at 9:45pm when the restaurant closes at 10:30pm so maybe going within the hour of closing had an effect on the service and cooking but either way here we go...\n\nThe restaurant was nicely decorated. Plain, simple, modern. No problems there\n\nThe service was eh. Granted they were extremely quick (not many other customers in there at that time). However our waiter seemed more angry than anything that we came a little close to closing (even though we were out by 10:10.\n\nOn to the food, which was the basis behind the 3 star. The ingredients were extremely tasteful and the crust was nicely textured but the dough on the rest of the pizza came out almost soupy like. Like soggy and wet. Kind of a buzzkill for the pizza as a whole. I gave it a 3 cause I have high hopes that perhaps the cooking staff was mad someone came in within a hour of closing on a Thursday and cooked it too quick or something and maybe it was just a random occurrence because I see great potential with the crust and ingredients. Plus they have outdoor seating, which I'm always a fan of. I might give it another shot later down the road but not sure honestly.\n\nPs: this is a restaurant not a $1-2 slice pizza shop so the prices do reflect that.", "author": "Ian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "I love the fact they cook the pizza with wood on the break oven, love the flavor is very unique plus the service the give u is just amazin super fast and good prices for quality food. You have to try it!!!", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-29", "description": "I guess when I saw the reviews and I was expecting a lot more from this place. I've been wanting to try it for a while. We got there after work around 5ish pm. The place was pretty much empty but the host was very rude and told us we couldn't be seated until our whole party arrived. Even though 3 out 5 of us where there and ready to order food and drink. Minutes later, I found out my friends were already there and seated in the back. The outdoor space is really nice, arranged with plants on both side and a small walkway of stones. Long running drapes as curtains and canopy made the place looks elegant and comfy. We ordered 3 pizzas. They were all good. Pretty thin and tasty. The center was a bit soggy because of the sauce but the dough was nice and chewy. The tiramisu was a nice to end with. Creamy and not too sweet. Just a bit disappointed with the service.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "I would love to understand the high reviews by my fellow yelpers but this place wasn't worthy of five starts. The pizza is good and fresh but almost subpar. They make it insanely fast and you'll have your pizza within 15 minutes of placing your order, I guess they don't need much time to perfect it. I'm glad I gave it a try but I'm doubtful that I'll return. It wasn't anything special in my book..", "author": "Lexy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Definitely a win in my book!! Came here with some friends after some happy hour drinks and I was really impressed! My boyfriend had been bragging about this spot for the longest so I was excited to see what all the fuss was about. \nFor a Friday night we got pretty lucky being able to be seated as a table of seven. We were greeted and seated right away in a nice spot in the back where we shared some house red wines, an appetizer and two pies. The appetizer consisted of this really nicely made focaccia bread with a pretty sweet spread of Italian cheeses, \u0026 cured meats. Once I tried that bread, I knew it was on like Donkey Kong. Those 2 pies had no chance!!! \nI really enjoyed how light the pizza was - I didn't feel heavy after eating a few slices. We ordered the Boscaiola and the Salsiccia (which was my fave!!). All of the ingredients were very fresh - how pizza should be!!\nIt was a nice spot to enjoy dinner with friends and I can even see myself coming back for date night with my hunny.\n\nMy only issue with this place? We didn't get another pie!!! :)", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Can't go wrong with a neighborhood pizza place! Nice variety of pizzas on the menu with an option to create your own and/or add extra toppings. Like other reviewers stated, the crust is also really good. Esp with some olive oil.", "author": "Janice T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}