{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Just came into town from Houston.  Looked for a place close to the hotel.  This was a 4 minute walk.  Was soooo very pleased with the service and quality of food.  It felt like i was back in Italy. Quaint and a European feel.  Will definitely be back before i leave.   And the wine was great and reasonable, pizza superb .", "author": "Melody P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Amazing pizza and such a cozy place! We stepped in without a reservation so the only available seating was at the bar. It worked out just fine with our waitress being on top of everything with water/wine refills, menu suggestions, small talk etc. I had a white truffle pizza with carpaccio- very good choice. The pizzas are pretty big for just one person. \nGreat place!", "author": "I P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "All the Yelp reviews for Sottocasa probably raised my expectations a little too high. My experience was just OK, nothing outstanding. \n\nMy friend and I arrived for dinner without any reservations on a Sunday night at 7pm. The restaurant was full, but we only had to wait about 20 minutes for a table. We were seated at a two-top near the back by the wood burning oven/kitchen. The space is surprisingly modern and starkly decorated with lots of blonde wood. I was hoping for a more cozy experience. And the tables are very close together, so it's not a very intimate setting, either. \n\nOur server was fine, but not overly friendly. He didn't do anything to make our meal special...I don't even think he ever smiled at us. But he was professional. \n\nWe ordered two glasses of prosecco and spilt the 4 Fromaggi white pizza (which neither of us really enjoyed) and the Reginelli red pizza (which we both loved). The pizzas were very fresh, and the dough/crust was authentic...you really need the knife and fork at your setting in order to eat the pizzas.\n\nOverall, it was a fine and I'm glad I tried it, but I won't be back anytime soon.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "This was a great little stop. Very quaint. I would definitely go back. Really cool neighborhood. Great service. Tasty bites. Great drinks.beat pizza had in a long long time. Wood fired. Great vibe as well", "author": "Burton M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Best REAL italian pizza in NYC. As simple as that. Great selection of cold cuts and cheeses. Cute basement spot for a greeeeeeat dinner. \n\nThank you!", "author": "Miguel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Hands down the best pizza you will find in New York.\n\nThe service was very friendly and accommodating, and every pizza we tried was amazing. Definitely worth a visit!", "author": "Michael H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Such an adorable place! Although I would've normally just walked right by it since it doesn't exactly stand out, after finding it on Yelp and seeing all of the great reviews, I'm so glad that I gave it a try. \n\nA friend and I had dinner here the other night and we definitely weren't disappointed. Upon first walking in, you see a cute dining area with a wood burning oven where all of the pizzas are made, but it's even better because the outside is the perfect place to dine before the summer's over. \n\nThe food is also pretty darn good! While I would pass on the salad next time (we got the Insalatina) since it was fairly small and nothing spectacular, I would definitely return for the pizza. We tried both a red pizza, the Reginella (tomatoes, cherry tomatoes, buffalo mozzarella, basil) and a white pizza, the 4 Formaggi (mozzarella, smoked mozzarella, parmigiano, gorgonzola, basil) and I was equally satisfied with both. The crusts, aka the best part, were nicely charred in all the right spots and before I knew it I had almost finished the whole thing! \n\nThroughout our dinner, we were also continuously checked on to make sure that we had everything that we needed, which is always a bonus and when leaving almost everyone working there said goodbye, making it feel like a friendly, neighborhood Italian restaurant. Overall, I was pleased and would recommend for pizza if you're nearby.", "author": "Justine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Three stars because the service was great and the pizza was light. The pizza wasn't anything special though and overpriced.", "author": "Hien L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Stay away from the Breakfast Club, Brat Pack crowd for brunch, and come here.\n\nI did today, and loved the outdoor greenhouse seating, that was sun filled and full of great selections of pizza.\n\nWe settled on the marinara, without cheese, for 9 bucks.  Big enough for 2 nice slices each, and so very good.\nTraditional smokey, brick oven taste.  The marinara and garlic were just excellent.\n\nMost pies are around 15 with cheese, and the service is excellent and friendly.  Just a really nice vibe going on here.  Small bar at the front.\n\nThe place on a Sunday afternoon was sparsely populate, but I would consider this any day or night of the week.   Really excellent.  (see pics)", "author": "Jim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Over 200 reviews can't be wrong.  There isn't much for me to add in praise of Sottocasa, so I won't waste anyone's time.   The pizza here is simply amazing and the staff is incredible and friendly ..... 'nuff said!\n\nHighly recommend the Boscaiola pie which consists of tomatoes, mozzarella, hot italian sausage, gorgonzola, mushrooms, basil.     Its sure to be a crowd pleaser.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Damn.\nWe've walked past this place for quite a while and only recently tried it. A solid pizza joint and welcomed addition to our little universe of neighborhood restaurants.\nGreat chewy crust on these pizzas. Flavorful ingredients. Friendly folks running the place. I've forgotten all about that Lucali place now.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "i came here on a Thursday night and was quickly seated. My table ordered 2 pizzas, which was enough to feed about 3 people (or 2 very hungry people). We got the cheeseless marinara and the 4 stagioni pizzas. \nThe marinara pizza was really good and had a delicious crust to it. \nThe 4 stagioni had great toppings; however, the crust was soggy and it was hard to eat without using silverware. (If you try folding the slice to eat by hand, the toppings may fall off.)   \n\nOverall, I liked the service and pizzas here and since it's a quick walk from my place, I will be visiting this place again.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "The very best pizza in NYC, I promise!\n\nService is a tiny bit stiff but still good and the place is so quaint that the atmosphere totally feels warm and wonderful.  But who even cares about any of this?  The pizza is heaven on earth!!!!", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "NO ONE can beat their airy, UBER fresh crust but that's it. Diavola, 4 Formaggi \u0026 Margherita were JUST ok. Didn't like the smoked mozzarella on the 4-cheese. Diavola had very little flavor, no salty, smokiness. Margherita was the most flavorful, which shouldn't be. There should've been a progression. \nWon't return. Too many other good ones nearby.", "author": "JL K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Just awesome, can't say enough about this place.  Pizza was outstanding and so was the service.  Great neighborhood gem!!", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Best pizza in NYC. Neapolitan style pizza cooked in a wood oven. Service is great and atmosphere keeps us coming back. The Laura is my favorite pizza on the menu.", "author": "Mon Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Best Neopolitan pizzaria in new york city! More people need to know about this place. The pizzas come out fast and taste like a million bucks. Nice cooked and round pies always, never get tired of it....", "author": "Ant G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "If you're craving gourmet style pizza, this is the place to go.  The pizza is great and the environment is cool and cozy.", "author": "Melinda O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Absolutely wonderful dinner!!! Love when we walk into a place with our family- the restaurant is adorable AND almost every table had small kids!! Great atmosphere in a cozy restaurant- that was welcoming to families!! THANK YOU!!!my kind of place!! Pizza (and focaccia) was delicious!!", "author": "Catherine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Hard to find, but very cozy. One of the best people-watching places in NYC. I hear staff and Ingredients aren't from Italy. Mamma Mia! Pizza came very quick. The cheese did slide off. But tasted great. Ate 4 slices. I would recommend this place to anyone.", "author": "Kerry K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}