{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Had an ok meal here. We were seated quickly and served quickly, but the pizza was so-so. The crust was soggy under the toppings and some toppings were undercooked (e.g. mushrooms still raw). It was fine pizza, I appreciated the fresh tasting dough, but I won't be going out of my way to come back. Also it was cold in the restaurant, so I was a little uncomfortable.", "author": "Marguerite S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Love this place, it's one of my favorite spot in Brooklyn. A wonderfully cozy place, great atmosphere, the food comes quick and the staff is attentive, considerate and really friendly. Everything on the menu is amazing and the pizza is great and tasty. Calzone is my favorite!", "author": "Ester L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "We were looking for somewhere kids friendly w/ quick service at 8:30PM and found the perfect place! The reviews on yelp helped make our decision fast but it's true. The pizzas were amazing, we had Popeye and margherita. Very friendly staff as well as environment. We loved every bit of it.", "author": "Yumi I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Sotto Casa translates from Italian into English as \"The House,\" which is appropriate because I live above it. Lucky me. What can be said about the place that hasn't been already? It's an excellent establishment with excellent food, excellent service and excellent atmosphere, all delivered with impeccable Napoli style (the slim man in spectacles who heads the bar is probably one of the best dressed people I've ever seen). \n\nI ate here in the summer with a huge party of about 16 in their backyard. We were a rowdy group with many demands and they served us with perfection. It was one of those rare dining experiences where the service is so seamless, the food is so delicious, the wine so tasty, and the atmosphere so comfortable that you forget where you are, you forget you are in public, that there is in fact a waiter serving you, and you begin to think you're at home in a country kitchen in southern Italy. That's magic and worth every penny (though their prices, for this kind of food, is on the low side compared to similar but not as good spots in Manhattan.)\n\nI suppose my only complaint is that they don't operate a full kitchen which means there are so many tasty things they aren't making. Maybe they simply need another location?", "author": "Jeremy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "The pizza here is exceptionally wonderful and my latest *favorite* neighborhood restaurant. My picky 2 year old will not eat any other pizza except for here (and one another artisan pizzeria restaurant that I won't name here). It's so awesome to have the pizza chef come over to our table from behind the kitchen to ask if everything is ok.\n\nI've already been here several times and the pizza is consistently great no matter what I've ordered. Save room for the Nutella Pizza for dessert! The service is right on as well. Definitely Recommended!", "author": "Giselle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "Fun and engaging staff who are passionate about good food.   The pizza was a standout but everything was great.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Stopped by here for the first time for lunch and everything sounded so delicious! It's a cute truly Italian pizza joint. Beautiful outside eating area. Staff was very friendly and attentive! I got the traditional margherita pizza and it did not disappoint!! So delicious! I wish the sauce was a tad bit sweeter for my tastes but I definitely see myself coming back to try the other pizzas. The pizza is enough for 1 person and not too much there's about 4 pieces for each pie.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Wonderful wood-fired pizza place in Brooklyn.  Dough is classic Neapolitan recipe, baked in 90 sec.  Quality of ingredients is outstanding.  We were in NY for 1 week and had to come here twice because the first time was so good.  Calzones were amazing, best we have had from a wood fired oven, which requires real skill. The pizzaiolo was kind enough to give me some tips after to try in my own wood fired oven.  Great service and the patio was just lovely!", "author": "Pedro P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Travel to Brookly to see my brother, he took me this place and now I'm officially addicted to there taste. I will be back next month for a visit, will be sure stop by here again.", "author": "Dan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "We stumbled upon this place after leaving Krescendo when they said our stroller was a \"tripping hazard,\" so we couldn't bring it into the dining area with us, despite the fact that (1) the restaurant wasn't even half full, (2) there was plenty of room for the stroller, and (3) we couldn't ditch the stroller because our kid was sleeping in it.\n\nSottocasa was a very pleasant surprise.  The waiter was super accommodating and made us feel totally welcome (which we don't always feel with two kids).  He seated us at a great table that was a perfect fit for us and our stroller.\n\nHe was also very in tune with the kids thing...he brought our 2 year old a plastic cup, only filled it half full with water, and then asked if we wanted him to hold the basil on our pizza.  Overall, we were extremely happy with the service AND the pizza. \n\nWe had 2 salads and 3 pies.  The salads were great...very flavorful with a lot going on.  The pizzas were solid.  Tons of options.  Great cheese.\n\nI wish we lived closer, because we would be there weekly.  Regardless, it's worth the walk from where we live in DUMBO.  A $7 white wine by the glass doesn't hurt either.  :)", "author": "Alexa E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Sottocasa is tucked away on Atlantic Avenue and easy to miss, but worth checking out.  The pizza is some of the best I have had in NYC/ Brooklyn.  It is Italian style and there is a wide variety of options to choose from.  We enjoyed the Rughetta salad to start which was $8 and definitely big enough to split between two people to start the meal.  The salad was a simple bowl of fresh arugula tossed with lemon juice and olive oil, and garnished with cheese, artichoke, and cherry tomatoes.  We chose the Diavola pizza ($13) and Popeye pizza ($14) and were more than satisfied with both.  The Diavola is great for meat lovers, and the Popeye is ideal for a veggie option.", "author": "Sheila S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Some of the best pizza I've had in my 4 years in NYC!!! I will definitely be making a trip back here soon. The margarita pizza was perfect. We also ordered the Popeye and Verdure. Flavor wise, i liked the verdure more but the veggies made the pizza difficult to hold up and eat. My only complaint is that the restaurant was a bit hot and stuffy for a summer day.", "author": "Pallavi Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "This place is simply delightful.  Great service, amazing wine and delicious, hand-crafted pizza made fresh when you order it.  The outdoor garden is a great place to have dinner; I'll be back soon!", "author": "Utaukwa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "Slight\nChar with\nFresh toppings\nOn bigger than\nMost Neapolitan. So delicious.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "Had a fantastic dinner here on Saturday night. This place is cute and quaint located right off Atlantic ave. The pizza was definitely not the best I've ever had but it was tasty and boy was it made quick. The staff was friendly and our waiter gave us a really good recommendation for dessert which we all loved (chocolate ice cream with nuttlea spread, topped with espresso YUM!!!)", "author": "Nisha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "Really enjoyed Sottocasa the several times I've been. There's rarely a long wait -- maybe that's because its a bit hidden (right below street level). Pizza, appetizers were delicious (high quality crust, ingredients) and they had excellent wines.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "As authentic of a Neapolitan pizza as you can find outside of Naples. Amazing high-quality ingredients, nice cozy atmosphere, and a friendly, upbeat (Italian) staff. This is the perfect pizza place.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "Wow!  Yummy! And relief that we don't have to travel to other neighborhoods anymore to get a great Neopolitan pie.  We met Antonio, the owner, who is lovely.  We found out that the pizzaiolo formerly crafted pies at Keste, another delicious pizza place in Village.  We had the foccacia, which is delightful -salt and rosemary on a tasty crust.  Its not the thick bready kind...  The Spinach salad, with fine touches, slivered almonds, raisins.   The Salsisicca (sausage) pie was fantastic.  I love that slightly charred, chewy crust.  The tomato sauce was so good, the fresh mozzarella was generous, the sausage was perfection.   We wanted to try the Nutella pizza but too full for dessert...this time.   The owner was gracious to share some tiramisu that the pizzaiolo's mother from Italy had made (!)   Seriously.   You had me at Margarita.  \n\nSottocasa will do well and I believe will have a devoted following.  It is a great spot for fine ingredients, simple, cool room, people who respect the art of Neopolitan pizza making and a great neighborhood gem!   We will be back often.", "author": "Lena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Was looking for a good local place for pizza and I found it.  The back garden area is quaint and the beer is good.  The pizza is delicious.  My nieces were in town and they enjoyed every bite.  We ordered three different pizzas and finished them all off.  the crust is tasty and the toppings were fresh.  It seems like a nice family/neighborhood place.  I will definitely go back again.", "author": "Deb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "Fantastic pizza, focaccia, and salads. And great service, too. I called to place a delivery order, but the wait would've been an hour and a half (Friday night, after all). Since I lived close by, I offered to pick up instead. The guy told me it'd be around 20 minutes, and he'd even take my number and call when the order got close to ready. A nice thing to do on a busy night. \n\nThe place is a bit pricy, but you certainly get what you pay for. \n\nPizza was crisp and delicious - perfectly salty. Can't wait to go back and eat in the backyard patio.", "author": "David C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}