{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-24", "description": "We live around the corner and were waiting with high expectations for this place, and it has exceeded them.  The space is cute and modern, the staff is attentive and very welcoming- we really felt like guests.  The chef came to check on the pizza, they refilled an espresso we had let cool (amazing- who does that) and when asked, really gave great food advice.\n\nThat brings us to the pizza: it is great.  We are total pizza snobs, and my wife is a jedi-level pizza appraiser- having scoured New York, Rome, Chicago and Naples for the best.  She (and of course I) were really impressed.  The ingredients are so fresh and high quality that these delicious wood-burned oven cooked pizzas really stand out.  We'veg one twice, each time in groups, so we've tried a lot of pizzas: the Marinara, which was really good (and the sauce on the pizza smelled intoxicatingly rich), the Quatro Stagioni (excellent), the Parmigiana (my favorite of the bunch) and Laura (my wife's favorite) the Sfiziosa (anchovy lovers will be well pleased) and the nuttella pizza desert (also very good, made good leftovers in the morning with coffee).  \n\nThis place is an instant favorite.", "author": "Dave C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "The pizza is excellently made and with ingredients as fresh as you can ask for.  This is authentic naples style pizza and made just about as well as I've ever had it.  The oven is wood burning and was shipped directly from Italy.\n\nInterior is nice and chill with exposed brick \u0026 dark polished woods.  It's simple and elegant.  Staff is very nice and attentive.  \n\nThe backyard area is really cool having a little biergarten feel with big wooden picnic style tables on gravel.  Nice idea.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "Came here late one night with my dad. The waiter was pretty pushy into the fact that the pizzas were individual.   We definitely didn't need two pizzas, maybe one and a salad.  The food came out really fast. Pizza was pretty good very similar crust/ taste to Motorino.   Didn't taste like anything special, maybe caught them on an off night.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "I get so freaking excited when something good in the restaurant world happens in the neighborhood.  I'm not sure why we waited so long, but we had dinner last night and I was so happy.  Awesome pizza in the neighborhood?  We thought we had it good but we hadn't a CLUE.  \n\nStarted off with the tonne e checci (?) a ginormous bowl with a spoon. And you need a spoon to get every bite.   Tart capers, beautiful olive oil.  Yum and yum. \n\nShared a special pizza with italian sausage and rucola and some other stuff.  So little salt which normally would have me cranky as I love salt-- but so tasty and fresh.  I could live in that crust.  Live. In. There. \n\nAlso some delish funky sardinian red in a sweet and simple atmosphere. They even had italian pop-- which I hate, but I loved it last night.  Made me dream of italy.  And Andrea Bocceli.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "I came here on a Friday night, the moment you walk in, you can't help but notice the warm and inviting ambiance. The servers were just as warm and friendly as the environment. \n\nWe each ordered a personal pizza, I got the Capricciosa. The flavours blended together nicely, but it was a little more subtle than I would have preferred. The pizzas are thin crust and as much as I love thin crust pizza, I thought the crust might have been a little too thin to my liking (at least at the centre of the pizza). I'd come back if I were in neighbourhood, but I don't know if I'd make a special trip to come here. Though the outdoor patio that people speak of makes it more tempting to do so.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "My prayers have been answered by Sottocasa. This neighborhood was STARVING for some good Neapolitan pizza and this place really hits the spot. It's cozy with a great, simple vibe and the pizza is excellent. The backyard looks lovely and I'm sure I'll be back there a lot on sunny days, especially when they get their beer license. \n\nI'll definitely be back soon!", "author": "Scott W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Soooo good. It made me definitively decide that I prefer Neopolitan pizza above all others. The place is great, the service is great and most importantly the pizza is out of this world. Don't be afraid of ordering a whole pizza for yourself because you will finish it all and look longingly at your neighbor's.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Took the in-laws here last night and we happily DEVOURED our pizzas. Also added salads to the mix (spinach for us, green for them) and found them a perfect way to start the meal. \n\nBusiness is definitely picking up \u0026 can mean a wait for a table, which just means that I'm even more thrilled that they deliver to our (shamefully) close by apartment.", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "amazing service, friendly and courteous staff and food that is out of this world. staff is very kind and aware of your needs. they move fast to deliver your food but slow down and take the time to listen and cater to you. cute ambiance and great crowd. the space is quaint, clean and cutely decorated. recommended for a great place for family, friends or a date night. this place will deliver.", "author": "Ms B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-24", "description": "Oh, man does this place suck so much it's unbelievable.\n\nMy poor date...I took a girl here today for lunch and we ordered a pizza margherita. About 2 minutes later the waiter came back with a pizza. 'Yeah, it only takes 90 seconds,' he said. I'm assuming it's a crust that is somehow pre-baked, upon which they have dumped some of the nastiest, wateriest tomato sauce I have ever seen. It looked like someone had dribbled melted red Popsicle all over the dough. Sick, dude! Then to achieve the 'artisan' pizza look you see in the photos, lumps of cheese are sporadically thrown across the pie. I'm just glad I only wasted $11 on this pizza. Both my date and I were on the verge of sending it back and getting something else, but since the problem was the sauce, we guessed anything else on the menu would be lacking in that department, as well.\n\nAnd I see below that the proprietor of this place has been responding to negative reviews on the sauce from the last month or so...if you read, this, I'm sorry, but the sauce is awful.", "author": "Pedro S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "Amazing pizza, very delicious, and the service is quite friendly and efficient.\n\nHowever, if you are looking for an adult dining experience after 8 pm, might want to stick to take out or delivery until they get their liquor license or start a BYOB.  Recently went in @ 8:30 pm on a Saturday and it was like a Chuck E Cheese, with bright lighting and tons of kids.  Figured it could be a one-of situation but walking by on another recent evening, again @ 8:30 and the lights were still quite bright.  Never thought I would \"complain\" about something like that but it does make a difference, at least in my opinion.\n\nBut again, truly delicious and well-made pizzas, a definite plus for the neighborhood.", "author": "Jim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "best pizza ever. It's Neapolitan style. If you want real Italian pizza, this is the place. The atmosphere is chill and the staff is really nice.", "author": "Shelley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "What more can I say about this place. I love pizza and I LOVE their pizza. I divide my pizzas into two categories: Fancy pizza and non-fancy pizza. I have to say that this pizza is in the fancy category (more expensive but better ingredients) but it's the best fancy pizza I ever had. So tasty and not greasy at all. It's the perfect fancy pizza. I took my parents to Sottocasa (also native New Yorkers) and they called me the next day just to tell me how good this pizza. \n\nAlso, the service is nothing more than spectacular. Super friendly and it seems like they all enjoy working with each other. \n\nIf I ever have to move from this neighborhood then losing this place will make me the most upset!", "author": "Adam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Authentic pizza napoletana, fresh ingredients. Great selection of wines and beers.\nTry tiramisu!", "author": "Carlotta M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "The tomato, mozzarella, Italian sausage and basil pizza was quite superb.\n\nVery very friendly service and quite quick. Not sure about the reviews of soggy crust on here, our pizza was perfect and toasty!\n\nThe pizza here is definitely special and should be on any New Yorker's pizza list!", "author": "Randy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Subpar food and OK service.\nOur waitress said that it was her 2nd day.  I guess it's an excuse for bad service.  \n2 group of guests who arrived after us got their food before us.  \nThey also sent our food to wrong table.\n\nPizza was just OK. And over priced for what it is even though they use \"fresh ingredients\".\n\nWe had beets appetizer which was so off and felt like chewing flavorless pickled beets.\n\nPizza was soggy. they use ceramic plate to serve pizza and it collects condensation and makes pizza wet and miserable. And it was missing salt. Just OK pizza. Not worth paying $18. \n\nYou can walk down to Brooklyn Bridge park for way better pizza from FORNINO. It's cheaper and the view is unbeatable.", "author": "K H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Wonderful fresh ingredients help to put out the best Neapolitan pizza in the neighborhood.  While the downtown Brooklyn area has become littered with pizza establishments, many fail to standout in some way.  Sottocasa does achieve wonderful pizza, salad, and wine ... what else could you ask for.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Best or only brick oven pizza in the neighborhood. Their different style pizzas are delicious and make it hard to choose from. They deliver, very convenient.", "author": "Leonard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "Mmm... tasty neopolitan pizza made in a wood-burning oven.  Not going to say its anywhere near the best in nyc, but a solid choice.  \n\nSpace is small, with a bar in the front, long tables running on both sides.  Looks like it would be good for groups or two-somes on a date, although the night we went the lights were very very bright - dim them please.  Bottles seems a little overpriced and the most affordable offerings were in the mid-high $30 range.  Pizzas range from $9-20, averaging around $15.\n\nPizza arrived very quickly - like chinese food take out quick - and had nicely charred crusts with bubbling cheese.  Toppings were a bit sparse, (yes yes even for authentic quality ingredients on neopolitan) but overall authentic, like the staff who all speak Italian.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-22", "description": "Maybe it was just an off day for their oven, but I've definitely had better pizza elsewhere.  Both the tomatoes/sauce and the crust were lacking flavor.  Pizza was also very soggy as other reviews have mentioned, which overwhelmed the thin crust. The mozzarella cheese was the best part, very tasty.  We also ordered mushrooms as an added topping but they seemed to be added to the pizza as an afterthought, rather than integrated into the pie.  Overall a disappointment given the strength of the reviews.  \n\nService and atmosphere were good though.  If this was just a bad example of their pizza this place is worth going to.", "author": "Tom Z."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}