{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Went here with our son last night on a referral from one of his friends. \nWe just returned from a cruise, hitting several cities in Italy, having tried pizza in several cities. \nI have to say that the quality here is comparable with great dough, ingredients and just the right finish and chew to the dough. Their menus indicates their pies are a little wetter. True, however it does not detract. \nIt was a good experience. I highly recommend this place for a nice meal.", "author": "Norman O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "Came here on a pizza tour - this was stop 1 out of 3. I wish we could've just stayed here the entire time.\n\nThis over gets hot. And when I say hot, I mean, surface of the sun hot. The oven is between 900-1000 degrees, which means the amount of time it takes to cook a pie is about 1 minute 30 seconds. The outer layer of the crust is lightly crispy, which the inside is the perfect amount of chewy. I wouldn't consider it \"thin\" crust, nor \"thick\", just \"perfect\".\n\nWe were given the margarita pizza - the cheese. Oh my gosh that mozzarella. It was fresh, so it sustained some water, and that made the pizza so... tasty. They maybe put 3 or 4 pieces of basil on the pie and you could taste it in every bite.\n\nAnd the tomato sauce. I'm not sure how fresh it is, or if it's canned, but damn do they do a good job of making it seem fresh (if it's not). The place we went to after - it was very obvious that they were using canned tomatoes. But this place? Nah. Tasted fresh as could be - with the perfect amount of saltiness that combined well with the watery mozz and chewy crust. \n\nI can't give any of these stars to the service - as we were in a tour group, although the guy making pizzas was super smiley and friendly (easy on the eyes, too!). But I would hope they are on the same level of their pizza. HEAVEN.", "author": "Priti R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Cute and cozy neighborhood pizza joint. Stopped by early on Sunday night for a quick dinner and there were plenty of seats open. The Laura pizza was delicious - the speck was so good and it was really simplicity at its best. The quality of the ingredients really shone. The Verdure pizza was a miss unfortunately. The vegetables are piled too high in the center, and they're too soggy for the thin crust to hold up to. I wish the veg topping was cooked out longer before adding to the pizza, it would've been a better concentrated flavor and less watery. \n\nStaff was friendly, food came out super fast, small-ish portions (for a perpetually hungry person like myself, it's the size of a personal pizza). Recommend if you're in the area looking for a quick bite to eat.", "author": "Lillian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Came here last minute on a Saturday night around 9pm, they had seating for 6 of us without a wait which was nice. We ordered the Margherita, Reginella, and the Salsiccia. The Salsiccia was probably our favorite, the sausage was spicy but was the perfect amount of spice. The food came out super quick as well, less than 10 minutes after ordering. The pizza felt light, or maybe we were just starving because 4 of us killed 4 pizzas! There didn't seem to be as many options with meat, and I didn't notice any pizzas with chicken. Overall it was very fresh and tasty, I wouldn't mind coming back here.", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Truly authentic New York pizza with incredibly delicious Italian ingredients. I really appreciate how meticulous they are with their ingredients. This flawlessly executed pizza will give you a genuine exposure to Italian flavors and real brooklyn pizza! Definitely check out their website and read the rules before you order.\n\nI strongly recommend the Salsiccia with that delicious spicy Italian sausage perfect mozzarella and basil. If you are more of a rosemary fan go for the Laura which is also really good. It's true the speck on the Laura tastes like bacon. If you are staying at the NU hotel they deliver via phone order.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Great pizzas. Really enjoyed the hotn sausage and mushrooms etc. get the Nutella pizza for dessert (even tho they don't have a dessert menu, ask about desserts!)", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "The pizza was good, but I didn't find anything too unique or special about it. I might come back, but there are so many other pizza places to try in New York, that I don't see myself craving to come back here.\n\nThe dough of the pizza was a bit more chewy at the bottom. It was hard to cut, and I think I prefer more crunchy crusts. Maybe it's a preference thing though.\n\nPortion-wise, the pizza's are \"personal pizzas\". But they are huge! I don't know how people would eat one by themselves. I guess if I was super hungry, I might try to. \n\nWe tried the Nutella pie for dessert and that was interesting .. something I've never had before. It was a dessert pie that was the same size as the regular pizza pie. The Nutella taste was a bit strong, but being a lover of Nutella, it was pretty good. I probably couldn't eat more than one slice of the pizza though. The dough seemed to be made out of the same dough as the savory pizzas ... so that was interesting and added a good balance to the pie.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Great pizza and service. The back area is quite charming as well. \nI will definately return.", "author": "Ellen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Came here recently with my wife and her friends.  The majority of my group is from Italy so it was nice to find an authentic Italian place that everyone was happy with.  \n\nThe pizza is served in real Italian style (not by the slice).  I ordered the 4 stagioni which was excellent.  The restaurant is a small intimate setting and the waitress was very attentive.  Prices are good as well!  This is authentic Italian food by real Italians.  Check it out!", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "If you are in the hood grab some pizza here. I had the sisillan with spicy sausage and it was the best. Great atmosphere and cool little bar with homemade drinks and Italian beer. Can't miss!", "author": "Bill U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Breathtaking pizza - one of the finest executions of Naples style crust I have ever come across, toppings were of the finest quality and freshness.  Also had a pretty cool Italian microbrew list; enjoyed the Italian IPA I had - almost a sweet and sour hop to it.\n\nSmall spot with very European style service (somewhat aloof), but the reason I will be coming back to this spot is simply for the stupid delicious pizza.", "author": "Dylan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "This pizza place was cute, quaint, and clean. The server was friendly and attentive. We ordered two pizzas and they came out very quickly. They were very delicious! The crust was cooked perfectly and the pizzas were a great size for sharing.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Nice pizza place. I went here a year ago. The environment inside and the outdoor seating area is cool. Good service. I thought the pizza was okay and that there are better pizza places in Brooklyn but definitely can't go wrong with going here if you're in the area", "author": "Anup R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "OK I have not given a five-star review in a while.  Nothing has really impressed me enough to give one...until our lunch at Sottocasa today.  My son and I went before a Brooklyn Nets game on the recommendation of a friend of a friend.  I am so glad we did.\n\nFirst, the service was warm, personal and spot on.  We started with a terrific antipasto platter of mortadella, prosciutto, salami, wonderfully creamy and flavorful ricotta cheese, and two other cheeses, one of which was a really strong (but good) taleggio and the other more like a provolone, both of which were served as little batons rather than chunks or slices.   So good!  The mortadella was the best by far I have ever had.  The focaccia that accompanied it was a really good folk for the meats and cheeses, and a very generous portion, too.\n\nAnd oh, the pizza!  We ordered the Laura, which has tomatoes, mozzarella, mascarpone cheese, speck and rosemary.  WOW.  This pie blew us away.  The crust was chewy and smoky in the best way.  It held up well to the toppings, which were all first rate on their own and worked beautifully together.  We devoured this pizza happily.  Very artisanal, impressive product!\n\nA great experience all in all.  Cannot wait to return to try another of their pizzas!", "author": "Steven H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Just had my first visit here - limited wine by the glass, but great pizza.\n\nWas looking for a quiet place for a meal-for-one and decided to try out Sottocasa.  It's a great little spot, sunken in from the street entrance.  \"Bar\" at the front and a handful of tables with the kitchen towards the back.  I think there might be more seating in the back; the sandwich board in the front mentioned seating in the garden.\n\nWalked in, was warmly welcomed by the hostess/proprietor and sat at the bar.  Had a nice glass of red while looking over the menu.  +1: Italian wines! -1: Only two reds out of a dozen or so available by the glass.  I would assume this is a product of being a small business - gotta keep the wine-by-the-glass (which leads to tired, spoiled wine after it's been open too long) to a minimum.  The table set-up seems geared towards two-tops so splitting a bottle doesn't seem outrageous.  The bottle price was very reasonable, from the quick glance I gave at the list.\n\nThe woman who had sat me gave me a good run-down of the differences between the two reds by the glass.  I took her suggestion and was not disappointed.  I also ended up taking her advice on pizzas (I had narrowed it down to three, plus the calzone) and it was delicious.  And FAST.  I was very surprised when it showed up at the bar.  Perhaps I caught the kitchen at an opportune moment.  I ordered the Romana (tomatoes, mozzarella, ricotta, capers, oregano) and added anchovies (I had been considering the Napoli as well) and it was delicious.  As a previous reviewer mentioned, it was a slightly \"soggy\" pizza - but I'd much prefer the toppings to soak through the crust and create a \"soggy\" thing than have such a chewy overbearing crust that it ruins the pizza.  SO, in conclusion: tasty pizza.\n\nFor dessert, I had a delicious espresso.  I've been slowly strangling myself on Starbucks espresso and this was such a wonderful breath of fresh, Italian air.  Great espresso.  I also allowed myself to try their homemade tiramisu and enjoyed it thoroughly.  Layered in a large water glass, it's (I think) a perfect size for one, or a good size to share.\n\nSilly side note: nearly everyone who works here speaks Italian to each other.  I mean, it shouldn't mean that the food is better or worse than anyplace else...but it's nice.  Ya know?", "author": "Alex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "What a cozy spot that is easily missed ! \nMy friend introduced me to this resturant and it was a must try.  Being from an Italian family I am judgmental of Italian food. As well as cooking pizza and pasta from scratch I am quick to judge the pizza.  It wad very flavorful and the sause was perfect, only downside I like my pizza not to be soggy or wet on the  bottom , I prefer the crisper thin crust.  I still really enjoyed the pizza! I do recommend coming here with a small group due to the size. It's super cute and the staff is welcoming and caring !", "author": "Graziella O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Really good pizza. Blistered crust, quality ingredients. Staff is friendly, setting is nice - dig the photos on the white-brick walls.\n\nOnly quibble is with the drink offerings -- aside from a couple \"house selections,\" the beers are wildly expensive, generally close to $15 for a normal bottle of Italian microbrew. Wines, on the other hand, are very reasonably priced, but there are only two by-the-glass selections, one of which is a (presumably boxed) Chianti also offered by the carafe. \n\nSmall booze issues aside, would stop by in a heartbeat next time we're in the neighborhood.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "The best pizza in greater NYC. The margherita style has such fresh, bright flavors and it is cooked just like in Naples, with a nice slightly charred crust and a slightly soggy, delicious center. Just perfect. The radicchio pizza is also fantastic. Sausage is so often overpowering in a pizza but this was perfectly balanced by the bitter radicchio and sweet balsamic. Nice service, smiles from everyone, and a lovely atmosphere in which to share a meal.", "author": "Sidra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Now THIS is some good pizza!! Born and raised in Italy, so I've had some good pizza in my life. It's not easy here to find other corners-away-from-home but this place is so good. And for once it's actually affordable, so yay Sottocasa thank you for all the yumminess. \nThe vibe is chill, this location is quaint and has a neighborhood feel.\nThe ingredients are top notch, and I can tell there's been so much care in choosing them.\nDefinitely worth giving it a shot if you never had it, I will for sure become a regular.", "author": "Ilaria T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Go to wood fired pizza in the neighborhood. Good wine and beer selection.  Nutella pizza for dessert is also super decadent.", "author": "Alison J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}