{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Yes the pizza -- no matter which you select -- are delicious. But the starters and desserts are first rate too. And you can get a decent bottle of wine for under $40. What's not to love?", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Very quaint, amazing atmosphere for a late afternoon lunch, and the pizza is absolutely incredible. Must try if you're in Brooklyn!", "author": "Nancy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-02", "description": "One of the best pizza places I've been to in NYC. They have a big selection of flatbread pizzas. My friend and I weren't sure how many pizzas to order for the two of us, so we ordered two. (One is enough for two people, though; we had an entire pie leftover, which was great for dinner the next day). We got the prosciutto and  margherita pies, both of which were good.", "author": "Alex F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "In my opinion one of the top-5 pizza in NYC. Just to be clear: this is NOT the kind of place where you'll find the typical old-fashioned, gas oven, domestic mozzarella, cheap slice. Sottocasa's pizza is a distinct Neapolitan experience: smaller, puffier, tastier ingredients in a no nonsense environment that constantly delivers what I expect. \n\nI just wish they were open a bit later but given the level of artisanship we find there I'll forgive them :)", "author": "High L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "Sottocasa is my favourite place anytime I want to eat a VERY good, well done \u0026 never \"heavy\" Italian pizza! I don't know what's their secret but their pizza is so easy to digest that I could have a dinner there every night (I'm not joking).\nThe Menu is so varied and the ingredients are always fresh - very good wines and beers. Pizza \"Laura\" is my favourite since the first time I went there :) and the delicious Tiramisu is simply something that you have to try! \nEveryone is working there is very friendly, professional and pays attention to the customer. It's a good place for a date but for having dinner out with friends as well.", "author": "Serena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "I'm so happy to be reunited with my favorite pizza in the entire world! The restaurant is nice and cozy, and the guys here are great!", "author": "Yoori S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-20", "description": "Umm... did I go to the same Sottocasa as everyone else? \n\nI wanted to like this place more... because it's cute and everyone speaks Italian (must be legit, right?).  Wellll the pizza is just okay.  Maybe my expectations were too high?  Maybe my taste buds were not functioning?  \n\nI got the Reginella and it was, well, fine.  The Rughetta salad was good.  I actually enjoyed the salad more than the pizza, which is absurd (at least for me).", "author": "Lindsay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "High praise for Luca and the team at Sottocasa Pizzeria, Boerum Hill. My now husband and I wanted to have a great rehearsal/welcome party for all of our close family and out of town guests that were attending our wedding the next day.  I am from Massachusetts and my husband is from Brooklyn.  We thought it would be a great idea to have a pizza party.  I mean it is the \"Brooklyn Way\"!  Luca and his team were beyond accommodating.  They helped us pick the menu with a variety of options.  I wasn't looking for a stuffy sit down dinner but more of a mix and mingle.  Sottacasa was top notch.  The food was absolutely delicious.  All the pizza came out hot and fresh.  Our guests couldn't stop raving about how delicious the food was.  The team at Sottocasa never missed a beat.  Anytime someone's wine glass was empty or beer was low, they filled it without anyone noticing.  For me, the silent service was perfect.  The restaurant was clean and very accommodating to the 65+ people that we were entertaining.  I would recommend the restaurant to anyone.  Whether it is a first date, gathering of friends or a celebration, Sottocasa is the place to go!\n\nThank you, Lauren and Mike D'Alora", "author": "Lauren D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "I never thought a pizza joint could be romantic, but this one is!!\n\nThe ambiance is great in here, very inviting and cozy.  The staff here is marvellous; everyone from the servers to the cooks/chef who will come out to quality check your meal.  \n\nThe food is also really nice; the pizza's are inventive, and delicious.  They are different in the sense that you feel they might be quite authentic - some of them don't even have sauce, because authentic pizza doesn't.  I'm a sauce fan and I didn't miss the sauce on my pizza.  You can tell the ingredients are fresh and well selected.  Definitely high quality ingredients here.  We had some salads to start followed by an exquisite pie.  We accompanied our meal with a bottle of Rose; best new food pairing - Rose and pizza!  and ended the meal with a tiramisu which was also really lovely.  All in all a great place to eat... also a great place to get engaged.\n\nA huge thanks to the lovely staff!!", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "Sottocasa rocks!  \n\nIts a simple, classy, down to earth pizza joint that makes freshly homemade pizza in their coal brick ovens.  As you walk into the restaurant.  You notice with wooden communal tables, seating designed for two and rustic ceiling fan (nice touch).  The atmosphere here is great for talking, having a simple glass of wine and of course having wonderfully made fresh pizza.  The music in the background which is not overpowering, so that way you can have a full length conversation without wounding your vocal cords or hurting your ears. \n\nOur waiter was prompt and knowledgeable about the dinner menu and wine list. After hearing all the specials and reviewing the menus, we decided to order the  Reginella pizza: tomatoes, basil, mozzarella.  I want to say it was about 10 inch pizza.  Dude it was delish!  The tomatoes were ripe the mozzarella was fresh only complaint was a bit soggy in the middle.  IT had an understated but refreshing.  The salt content of the pizza was minimal. You don't get that bloated effect that you normally get if you have pizza from chain pizza places.  It was so good we had to have another.  \n\nIt is great for dates, one-on-one rendezvous, or bring a group of friends!  Enjoy their beers, lovely selection of wine and most of all the kick-a$$ pizzas.  What are you waiting for!!! make reservation and enjoy yourself a an awesome slice of pizza pie.", "author": "Eric Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Came here with some friends recently for the first time and was not disappointed. I had the Margherita and it was so good. The pizza is really greasy and messy, so don't wear anything new. The place itself was really cute but a bit loud. I didn't get a chance to sit outside, though it looked really nice, so maybe next time. Definitely will be coming back.", "author": "Xiomara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "Best Neopolitan pizza in the 5 Boroughs.  Yes, after having frequented Sottocasa for about a year now, I can safely say that.  I hold pizza, in particular, to the highest Yelp standard.  That means, the pizza needs to be good, as well as the vibe, service, outdoor space, length of wait, proximity to my apartment, etc.  And for that, Sottocasa just edges out other Neopolitan favorites, like Luna Rossa (which is excellent and under-frequented), Keste, and Don Antonio.\n\nThe patio is great.  Wine and beer selection are good and not overwhelming.  And I love the salsiccia pizza.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "It's been almost three years since Sotto Casa opened, and we continue to order from here every week.  The pizza is consistently good, we get Margherita for the kids and cycle through the others for the adults.  My favorites are the Autunno, Tartufata and Aglio Olio.  The crust is perfect and the ingredients are always fresh.  Wish we could eat there more often (with delivery sometimes bottom center of the pizza gets a little soggy) but hard with two kids.", "author": "HanNa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "Solid Neapolitan-style pizza. Prices are reasonable, food is good.\n\nI tried the most basic versions of their pie that I could: the focaccia (basically a pizza bianca), margherita and the aglio e olio.\n\nThe Focaccia was a promising start - it revealed that they do the bread right, but the item as a whole was sometimes too salty and the rosemary had cooked up in an occasionaly crunchy way, rather than integrating into the pizza. Still good, and a $4 well spent if you're looking to get some extra pre-pizza carbs (and who isn't?)!\n\nThe Margherita - the basic staple by which I try to judge most pizza joints - was, sadly, a bit lacking in flavor. The pizza was not super wet as far as Neapolitans go, and the crust had decent integrity to it, but the tomato base was absolutely flavorless. I don't know if this was a defect in seasoning or in the particular ingredients that went onto my pizza, but I remember kicking up the spice a notch. I thought the addition of chili flakes, for instance, did wonders to the pizza.\n\nThe Aglio e Olio - what is typically a spaghetti recipe was, actually, a revelation of a pizza. Wonderful - flavorful, garlicky, cheesy - truly much better than I could have expected from past experiences with white Neapolitan pizza. Highly recommended.\n\nAs to how this place stacks up compared to others? Well for one thing, it depends how much you like this style of pizza. I'm not as devoted to it as others, so on a typical night, I'd rather have the more hybrid style that NY has to offer in places like Emily, Juliana's, etc., but in this category, it's a solid pizza. \n\nIt's probably about as good as Motorino, but a notch below Roberta's. BUT - it's easy to get to, has good service, and isn't an overhyped zoo. So on those counts, It's easy to recommend.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "This place rocks- great people, pizza, \u0026 wine; even by the glass. Small, but cute \u0026 quaint; family-friendly so you may hear a few kids acting up early dinner hours, but hey- that's their job! Note: I've only had the Parmigiana pizza (so far) w/ hot Soppressata.", "author": "Ed S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "Solid, authentic, great atmosphere, price was right, service was quick and attentive without hovering. Would recommend it for a simple night out with someone special. And if you speak Italian so does most of the staff.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-20", "description": "I just don't understand what all the hype is about. \n\nGranted, being a resident of New York, I have just as strong of a pizza thesis as anyone else who can or has ever called themselves a \"New Yorker.\" But, that being said, the pizza here is rather antithetical to what I would define as \"good pizza.\"\n\nMy dining partner and I sampled the \"Reginella\" and the \"Verdure.\" The toppings were good. The cherry tomatoes on the \"Reginella\" sung with a lovely condensed sweetness rendered via oven roasting. The vegetables on the \"Verdure\" were quite good as well.  The main topic where I found the pizza lacking was: the crust. Other reviewers really enjoy the smoky-ness that only a wood fired oven renders. But despite this, the crust did not really have a strong flavor. It was just lacking. And to make matters worse, as other reviewers have noted, it was just plain soggy. I didn't eat the crusts off my pie either, they were just tasteless. \n\nThat being said, the restaurant has a lovely atmosphere and the staff help to make the experience a transporting one. Sit in the outdoor tables in the back. Look up at the stars, and pretend you're in a backyard pizza garden in Napoli. It's not my kind of pizza, but it may be yours.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Delicious pizza. We like to eat at the quaint restaurant, and also carry out on occasion. I like the margarita and anything with burrata. You can't go wrong, assuming you work out once in a while!", "author": "Jayne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "very solid, nice wait staff - gave us a free pizza that someone ordered but didn't pick up!", "author": "Matt C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-09", "description": "I was excited to finally come for dinner, because I heard the pizza was good.The smell of dough hits you as soon as you enter, which is so inviting.\n\nVery cute space and attentive service.We ordered the four cheese pizza and the reginella, which had fresh cherry tomatoes, mozzarella and basil. Both pizzas arrived watery. You would take a slice and find either tomatoey water, or cheesy water on the serving dish. The crust was thin. Also, the choice of gorgonzola in the 4 cheese pizza didn't work for me taste-wise.\n\nPlace was packed with families and kids at 8pm. It's just a mediocre pizza joint and not a very cool vibe for diners.", "author": "Serena B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}