{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Wow. This may have been the best pizza I've ever had.  Quality ingredients and an amazing crust.  I don't go to Brooklyn much, but I'd go just for this pizza.  They also have a pretty cute garden type area in the back, and they do their best to hide the fact that it's enclosed by buildings.  Great service as well. Highly recommend.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "One of my favorite pizzerias in NY! Delicious, light, flavorful pizza on a perfect crust. Just perfect pizza. And the salads are delectable. The desserts wonderful too. Come here for birthdays. No reservations taken, however were always quickly accommodated. Very kind service", "author": "Laila D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Love this place... that is all!", "author": "Mari C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "What a lovely little place.  Unique beer list, romantic lighting, a little hard to find (Down a small staircase and slightly set back)\nWhen the customers are speaking Italian with the staff, you know it's going to be good.", "author": "Kate D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "I'm a bit of a pizza dork and have a list of pizzerias at least 10 deep for my visits to NYC. Sottocasa was a late addition to my list but considering the proximity to my friends' apartment, it was the perfect way to start my NYC eating adventures.\n\nWe ordered the Diavola (tomatoes, mozzarella, hot soppressata, black olives and basil) and really enjoyed it. The crust was puffy and charred but not burnt and the ingredients really came together nicely. And at $13 the pie seemed like a bargain.\n\nAt the time of our visit they didn't have their liquor license yet so no wine or beer to go along with our pizza which was a slight disappointment. But with pizza this good, the disappointment didn't last long.", "author": "phil h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "This place reminds me of Brooklyn central in park slope but slightly more affordable. I didn't feel bad ordering two pies when the plain was $12. \n\nThe pizza was awesome, felt right at home as soon as I walked in, and in a great spot with parking and transportation nearby for a quick meal or take home dinner. \n\nI would definitely make the trip back to get pizza from here!", "author": "Roy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I highly recommend Sottococasa for the people who are looking for REAL DELICIOUS PIZZA, on bricks Owen, that's really the place to go! You can right away tell that ingredients are fresh and flavour is so good! Atmosphere is relaxing with soft music, our waiter was Luis, very nice waiter taking care of us and making sure all was perfect. Guys, thanks for making the Best Pizza from Brooklyn! Definitely will keep coming back!", "author": "Patrice B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Can't wait to come back here. Stopped in with my boyfriend and his parents for a Saturday night dinner. We were seated in the back area, under a tent but still with the outdoor vibe. We split a salad and three pies, which was just about the perfect amount. \n\nAll ingredients were clearly super fresh, and the pies were just perfection. The ricotta on our white pizza (I believe it was the Aglio, Olio or something like that) was so creamy and perfect. I am still thinking about it, two days later. \n\nPlotting a return trip so that I can try even more that this delicious place has to offer!", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Delicious pizza and swanky workers. We had the vedure pizza . The right amount of food. Light and yet filling.  Server was very attentive. Great treat after movie.", "author": "Sheila K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Amazeballs on service and food. Especially the food. Best pizza I've had since I was in Rome.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "We actually fell into this place by accident. We were originally headed to another popular hotspot for a prime pizza lunch, but we're disappointed to find it is only open after five o'clock. Everything about Sottocasa was perfect. I ordered a pizza with eggplant, basil, mozzarella, and  caramelized onions. The crust was perfection and I learned that many people pour olive oil on the crust to enhance it further. I would definitely give this little gem a try when in Brooklyn.", "author": "Carol F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "We where in Brooklyn Friday night after a long train ride from Boston took a walk around downtown found this place had some good reviews at first I was um maybe not !  by first look not a lot of customers . but the host met us walked us out back to a cool green house set up lights very cool ordered a salad very good ! had to have beer with pizza they only have Italian beers ordered 1 that was recommended and 1 of the many pizzas came out fast hot and was so gooood ! beer was so good ! It was only last weekend We went to pizzeria Regina in Bostons north end a fantastic place ! this place was better !!!!  just great !", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Mi piace!!!  Authentic Neapolitan pizza!  Sure, you can find a lot of places that claim to be authentic Neapolitan, but how many of these places are staffed by Neapolitan people?  The service is quick...  Our pizzas were out in less then 10 minutes from the moment we ordered.  I ordered the \"Laura\" which was topped with tomatoes, mozzarella, mascarpone,  speck, and rosemary.  Definitely the best Neapolitan pizza I've had.\n\nThe place is nicely decorated and they have outdoor eating space in the back.  My only complaint is that there was a large group with several small children, and the a**hole parents allowed the kids to run loose like wild animals, screaming and what not, disturbing everyone around.  So other than that group a**holes it was a great experience.  I'll definitely return, but will ask to be seated as far away as possible from small children.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Amazing quaint pizzeria.  Friendly staff, great ambiance and fresh, delicious ingrediants.  Can't wait to go back!", "author": "Shawn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-08", "description": "Margarita pizza was good ($11). Salsiccia is a magarita with sausage ($14) and it enjoyed greatly by my sisters boyfriend.  Tiramisu not slap your mama good ($8).  $15 corking fee is cray cray.\n\nPizza came out fast and we enjoyed it with a bottle of Lambrusco ($35).\n\nThe space is nice and intimate.\n\nService was snobby and that ruined my experience.  They didn't refill wine glasses or check up on us.", "author": "Sha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Awesome pizza. Have tried many of them and they are all fantastic. Fast delivery and the pizza is always hot and every bit as good as the dining room. Definitely one of the stars on atlantic avenue and would love to see a few more places with food this tasty open soon.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-04", "description": "This place has great service, nice atmosphere, affordable prices and fresh ingredients. I came here with two of my friends and between the three of us, we ordered two pizzas. The portion size was perfect for us.  However, the pizza was a bit soggy for my liking. \n\nWe ordered the verdue which has caramelized onions, eggplant mushroom and basil. The flavoring was phenomenal but it was less phenomenal when it fell all over the place. And yes I know the ingredients to the pizza leads you to believe it would naturally be a wet pizza but if you can't make it while maintaining the integrity of the crust, maybe you shouldn't offer this combo. \n\nWe also ordered the aglio olio which is a white pizza and simply delightful. The ingredients were fresh and just melted together really well. But we had the same problem with the sogginess. There was actually so much liquid that it started dripping into my hand 0_o. \n\nGood flavor but the soggy pizza needs to change. I'm hoping that this was a fluke considering all the wonderful reviews. I'm hoping this will be the first place I update and change my review after another try.", "author": "Shirley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "The best pizza Napoletana I have ever had in 3.5 years of staying in New York. And I have tried lots of such places, being Italian native. \n\nTheir pizza is amazing, perfect dough and ingredients. Let's not omit the antipasti here: super fresh ricotta (a mirage in New York), cute pottery with all sort of great Italian mixes (like tonno and ceci or arugula salad with artichokes), and number 1 taglieri (Prosciutto di Parma was authentic and the fontina cheese so so good). \n\nService is great and SUPER FAST. They also have a cute outdoor space with lights and plants, heated during winter time. You must try Sottocasa.", "author": "Angelo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "This is the real Italian Pizzeria experience you're looking for. Soft and light dough with amazing high quality topping. Simple and cozy ambient. \nWe got a pizza Bianca with prosciutto and Taleggio and a red Pizza with sausage. Both hit the spot. Recommended from an Italian", "author": "Andy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "Three of us shared 2 white pies and 1 pink pie, and they were all delicious.  The pizzas all arrived within minutes but perfectly made.  They have very nice wine selection, and our waiter made the perfect bottle recommendation.  The place is very cute and extra homey!  The only mistake was we sat by the kitchen, and brick oven was baking my brother and husband while baking our pizzas.", "author": "Juan J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}