{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "Came here because of high reviews on yelp. So glad to have found this place close to where I work. The pizza was delicious (ordered the Popeye) and the service was perfect. The waiter and runners always seemed to show up at the exact right time. My girlfriend has been a food and beverage manager and she was extremely impressed. \n\nWe ordered the tagliere for the appetizer. Generous portions of Italian meat and cheese and it came with a huge slap of rosemary bread. May get something lighter next time as I barely finished the pizza. \n\nWe will be back. :)", "author": "Tyler R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Fantastic pizza! \n\nWe literally stumbled onto, and into, this place during a an overnight in Brooklyn and were overwhelmed!\n\nGreat pizza and great experience.", "author": "David D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Excellently flavored food the real deal if you like true Italian made pizza. Awesome atmosphere laid back my new favorite pizza place in NY!!", "author": "Tamara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "One of the best pizzas in Nyc ..fresh ingredients ,located in the heart of Brooklyn .very homey ,service is great and owners are really friendly ..", "author": "Tooba M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-20", "description": "**Before VEGAN pledge**\n\nEver since this place opened, I have been curious about their pizza and well you know what they say. Curiosity killed the cat. Ahem. Cats also have nine lives. \n\nWe came here for dinner on a Saturday night at 8pm. It was pretty empty when I met my friend here, but it quickly filled up. By 8:30pm, they had to turn away a party of 8. \n\nIt is in the basement of the building and the interior is rustic and feels relaxed. Communal wood tables and candles make it a nice romantic spot. \n\nWe took a quick glance at the wine list but we weren't interested in any of the wines by the glass. Instead, we opted for a bottle of Sardinian Cannonau ($40). It was dry, light with a slight bitter aftertaste. It went well with our meal. \n\nWe started off with a very simple salad.  The INSALATINA ($7) cleansed the palate and was refreshing starter. Fresh and what you would expect. \n\nWe shared a REGGINELLA ($15) which consisted of cherry tomatoes, fresh buffalo mozzarella, and basil. I did not like this pizza one bit. The pizza arrived and from the looks of it, I could tell it was going to be a SOGGY affair. And indeed it was. It was so wet in the center, that I had no choice but to use my fork and knife to eat the pizza. Also, the crust was just plain bland. Nothing unique, nothing exciting. I'm sorry, but this place just doesn't cut it. I have yet been to a place that can make a pizza quite like Paulie Gee's. \n\nAlso, the desserts are overpriced. I am just not going to pay $8.50 for a slice of tiramisu (which I despise). \n\nFunny thing is that we spent more money on alcohol than we did on food, but probably in a place like this, rightfully so. It does have a nice ambience and they let us sip our wine and take our time with it, so that's a PLUS. \n\nWon't be coming back, but glad to have tried it...", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "I went here with my girlfriend and her dad for dinner. It's a small little place off of Smith Street and Atlantic Avenue. You walk down the stairs, watch your step as you walk into the restaurant. The place is nice, and basic. A little modern look, with the oven burning in the back, and there is a yard that looks pretty nice. But we didn't sit outside, since it was boiling hot. \n\n  These guys claim they're similar in nature to the Pizzeria \"Keste\" on Bleecker Street in Manhattan. I love Keste, so I was very excited for to eat here.\n\n   We all ordered our own individual pizzas. I ordered a Pizza Diavlo, Mozzerella, Hot Sopressata, and Black olives. My girlfriend ordered an Aglio Olio, which is a pizza with mozzerella, ricotta, garlic, hot chili flakes, and basil. And my girlfriend's dad ordered a \"popeye\", which comes with  tomatoes, mozzarella, ricotta, and baby spinach. We didn't drink any wine, but they do have an extensive wine list, and all looked very appetizing. My pizza was absolutely delicious! The crust was tasty, the cheese and sauce was great, and the hot sopressata was just the finish I needed for the cherry on top. Everyone seemed to love their own pizzas, and the check wasn't bad either. It totaled $52. Not bad for three personal pies, and sodas. I'd imagine that if we did drink wine, the check would be more, but I personally don't mind paying when the food is excellent. \n\n  These guys match up with Keste, and is on par with that kind of excellence. Go here if you live in Brooklyn and wish to not make the trip out to the city. Delicious and satisfying.", "author": "Frank B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Wish I could say more than they have nice service and atmosphere, but I cannot.  Went there based on reviews.  There pizza is so thin and soggy that you have to use a fork or spoon. The \"chard\" topping was not appealing anymore than the ground tasteless Italian sausage reminiscent of Dominoes. Do yourself a favor and take a pass.", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Absolutely delicious, with great service. I really enjoyed biting into my Neapolitan pizza. It was as if I were back in Naples. My friend from Pennsylvannia said it best, \"you know this is good pizza when you are looking forward to devouring the crust.\" It was like a little cloud of heaven. And the prosciutto arugula mozzarella was definitely enough for two, as it could feed four easily. You can tell they use quality ingredients in everything they make.", "author": "Louis V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "This is a fantastic pizza place with excellent selections and also family-friendly. I had the  Popeye and my wife had the Crudo, our son had the margarita. The pizzas had a little bit of char, but not so much that it ruined the experience. Service was excellent, if we came on very quickly, and we would probably come back here next time we're passing by. Great place!", "author": "Ross C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Excellent pizza, great service, great ambience. The perfect place for lunch or a good eat", "author": "Erika F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "This place is really fantastic. As someone who has to eat gluten free, it's all too often that I get a gluten free pizza and go into deep depression after because it is so bad.\n\nSottocasa has a great gf crust!!!!!!! I think they even make it in house, which is rare! Great sauce, perfectly cooked, delicious toppings. Super cute atmosphere, and reasonable wine.\nAmazing find.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "I am a picky eater. Was wandering around Brooklyn looking for a pizza spot. Fresh food...no awesome food! Dough is soft and chewy, ingredients are wonderful, and service is quick. Will def be back!", "author": "Mika A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "1st time dining here. Excellent pizza, quality ingredients. Just wish they could make the dough a little less soggy. We order the prosciutto and fresh mozzarella appetizer. Huge portion, enough for 2, then ordered a Margherita pizza to share. The service was increibly fast, both items arrived a few minutes after ordering. Only advice to mgmt: make dough crisper and a little more basil on the Margherita, our entire pie had 3 leaves. Just minor feedback that doesn't prevent me from leaving 5 stars.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "I had the Boscaiola with a friend while roaming aroung Boerum Hill, great stuff. The waitress informed us that their oven is heated a 960 degrees! Not sure what it means but our pizza came out great. And the price, $15 for a pizza?  Price so good, we ordered another one ASAP. They have a good selection of beers as well, wish they didn't cost as much as the pizza lol.", "author": "Richard J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "My husband and I went to Sottocasa today for lunch. Best pizza we have had! Burrata pizza only served on the weekends and so worth it. The Ripieno was excellent and spicy with the hot soppresata and sausage. Great bottle of wine and fabulous service. We will be back! Gracie", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-18", "description": "High expectations for this place because of all the great reviews..ending up getting spongey wet pizza. All the toppings slid off and the crust was drenched with sauce.", "author": "Lianne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Delicious. Italian micros run a little steep. \nReally enjoyed the beer salad and the spicy sausage with Gorgonzola pie.", "author": "Stephen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Do you like quality pizza but are overwhelmed by all the pizza options NY has to offer? Take it from a native, go here. \n\nIt is that simple. The service is impeccable, atmosphere is fun and inviting, and the food is fantastic. I went this past weekend with my family for my birthday and just loved seeing the staff speak to my parents in Spanish, accommodate my sister-to-be-vegan, and well, just give us all around quality good service. Everything is imported from Italy and you can taste the difference. \n\nMy favorite pizza was the Diavola! Enjoy!", "author": "Patty I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "This is awesome. Truly Italian Pizza. Italian Italian, not American Italian. Typical Brooklyn style brick wall place with a backyard (covered). Fast and efficient. Nice people.\nWe shared yesterday: Tartufata (Pizza Bianca with Truffles and Prosciutto di Parma) and Parmigiana (Sopressata, eggplants) and it was excellent. Great homemade Tiramisu and you're good to go. Love it.", "author": "Damiano D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "Now that I've been back in NYC for 2 years, I am slowly but surely letting go of my aversion to pizza. While it's not normally a first choice for me, I'll happily accompany friends if that's what they'd like to check out a place that serves Neapolitan pies.  \n\nSottocasa is a relatively new addition to this neighborhood and is located central to a few trains, hence it making a great meeting point for a quick NYE dinner before heading separate ways.  We were seated once our party was complete and the service was super speedy for the rest of the evening.  \n\nOur order consisted of: \n- Salsiccia: tomato, mozzarella, hot Italian sausage, basil\n- Daily Special: white pizza with mushroom, truffle, mozzarella, and prosciutto\n- Bottle of Prosecco\nBoth pizzas were awesome, though I'd recommend one with tomato sauce as it's killer. It was definitely too much food for two people. Next time I'd share a pie and place an order for a salad or something to start.  For too much food and too much sparkling beverage, our bill came in at $75...Not terrible considering the excess we ordered could have fed 3 or even 4 people.  \n\nWhat makes Sottocasa special is the quality of the ingredients...high quality, incredibly fresh mozzarella, tomatoes, vegetables, and meats. And I'd pay plenty of extra money for the incremental goodness of the food any day.", "author": "Meghan M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}