{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Great pizza, great service! Brought some family from out of town right after Christmas, and everyone was thrilled with the choice. Our server was very attentive and friendly - he offered recommendations on food and talked us through the different styles of Italian beer. The pizza is fantastic and comes out super fast. Everyone thanked us and wished us a good night on the way out, including the guys manning the pizza oven.", "author": "S. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Every time I visit Sottocasa (3 times now) I love it a little bit more. It's not a flashy place, simple, modern and very, very good. The food is consistently fantastic. There are beers and wines to go with everything. And, the service is really top notch. I also love the versatility of the space. It's cozy in the winter, inside with the pizza oven blazing. The few steps down from Atlantic Avenue make it seem like a warm little cave where you can huddle with friends and hang out for hours. But, in the summer, the amazing garden in the back is the place to be, a little vacation right in the heart of Brooklyn.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "Italian style pizza with a twist - slightly thicker, chewier, but still really tasty crust. The price might be a bit high for the location, but the garden out back is a must and the experience was great. Fast service too!", "author": "Josh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "I really like this place. I've been a few times and usually get one of the same three pizzas with soppresata, sausage, or veggies and each is equally tasty. Also, I've had VERY good service experiences here...once I arrived early to meet a friend for dinner, and even though my dining-mate was still 20-minutes away the host let me sit at a table, served me water, and was courteous about the entire exchange,. I was very impressed since it was a fairly busy night in the restaurant. I will definitely give this place my business again.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "From the friendly wait staff to the quality of the food, I felt like I was back in Italy. I've only lived in New York for 3 years, but this is by far the best pizza I've had. Can't wait to go back!", "author": "Julian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "Just moved down the street and this is my favorite neighborhood spot by far!  Good atmosphere and great pizza . . . also enjoy the spinach salad.  Only wish that it would stay warm for longer so I could still enjoy the great outdoor seating.", "author": "Jennie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "We went here mainly because we were staying at a hotel nearby and Sottocasa got great reviews, which I can now say it deserves! It's a cute little restaurant with an adorable greenhouse in the back where you can sit outdoors without being totally out in the elements. We were there in November so it was nice to sit outside, but be careful because the greenhouse can get hot! It was still great to be in the sunlight though and to enjoy a nice relaxing lunch. The service was great - all the servers were incredibly personable and very friendly. They were also constantly watching our table to make sure we had everything we needed, but they didn't intrude and kept their space so that they weren't hovering. \n\nThe food was the best part though - we didn't get much because we weren't that hungry, but our table split the insalatina, which was actually a pretty large portion. We split it between 3 people, which was a bit of a stretch, but there's definitely plenty for 2 people to each have a good size salad. Although simple, the salad was done really well and all the ingredients were fresh, so it was a great refreshing appetizer. We then split the reginella pizza, which is simple as well, but was also impeccably prepared. The crust was a perfect Neapolitan crust, but I liked that Sottocasa didn't skimp on the tomatoes. There was enough tomato \"juice\" to make for a good sauce, which I sometimes miss in Neapolitan pizza. The buffalo mozzarella was very good, as would be expected, and the basil was the perfect touch of flavor. All in all, we thoroughly enjoyed our meal - it was a great late lunch option on a beautiful November afternoon in Brooklyn! The people and the food made for a great experience.", "author": "Jess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Wonderful pizza. Delicate and subtle. No huge globs of cheese here. The place is not pretentious ( unlike the next restaurant i am about to review....)  Warm and helpful waiters ready with their recommendations. Very fresh salads and ricotta, almost as good as in Italy.", "author": "Patale M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-30", "description": "Three pies, 2 glasses of wine and one imported beer: $100. Anyone else see something wrong here? This is good designer pizza, but I am not hauling ass back here anytime soon.  Granted,  the crust is really good, but so is Grimaldi's.  Give me John's any day.  Even Sosta up the block is better. Had the prosciutto pie which was very poorly executed. The uncut, cold prosciutto slices were draped over the cut pie making eating the individual slices impossible. The Regina was good but mad salty.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Sottocasa is a lovely restaurant, mostly because of the friendly, welcoming staff. Seems like a family-owned place. The atmosphere is comfortable \u0026 clean, and I've never had to wait for a table. \n\nAnd the food here is good. You can tell the ingredients are fresh and high-quality. My only complaint, and this happened on both times I've visited, is that the pizza is often undercooked (crust/dough isn't quite done enough) and sometimes a little wet. Like the innards of the fresh tomato topping have seeped out onto the pizza, or like the fresh mozzarella wasn't drained/pressed enough. And I don't want to disparage too much because this does indicate quality \u0026 freshness and the pizza always TASTES great (trust me, it's never stopped me from eating it), just the texture could use a little work in this area. Maybe just give it a few more minutes in the oven? Press all wetness from ingredients before topping?? Personally I do like my pizza to be crispy so maybe this is just a preference of mine, but if they nailed that then I'd add this to my list of pizza faves along with Lucali and Roberta's (aaand if they added liquor/cocktails).\n\nBUT other pluses include a good wine list, and a lovely back garden!", "author": "Alison G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Fantastic pizza!\n\nI haven't been home to NY in a couple years and this was just what I needed! A friend and I split a margarita (of course) and a Radicchio which is drizzled with a balsamic reduction. We devoured them both and our bill was super cheap. So glad we decided to check this place out!", "author": "M G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "Good pizza and nice atmosphere (at least on a Sunday night) . . . I didn't see swarms of kids so I may have just been there on a good night, but the ambiance was actually very inviting and, as others have noted, the service was great.  \n\nBut anyway, the most important part is the food, which was very good across the board.  The spinach salad with super-fresh ricotta cheese, toasted almonds and rasins was great.  The pizza was very good - very fresh ingredients, very good crust.  The dessert (we had the tiramisu) was a perfect top off.  \n\nI'm sure it will be even better once they get their liquor license.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Great staff, great food, great atmosphere! The waiters are authentically Italian and even commented to the table to our right that they had ordered \"a lot of food\"! Poured the wine in a decanter before service which was a nice touch to a great meal!", "author": "Helene W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "This is my favorite restaurant in the neighborhood. Great service, awesome food, and an easy $100 dinner for two with a bottle of wine. This is where I always go when I decide at the last minute to go out, even on a Friday night. The Valdostana is a good choice.", "author": "L S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-14", "description": "I had really high expectations for this place, based on so many positive recommendations from friends.  Unfortunately, the experience fell flat for me.  The pizza was only ok- doughy crust that wasn't fully cooked through, and lackluster flavor.  The backyard garden is charming, so points for ambiance.", "author": "Mimi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Best pizza on Atlantic Ave! The pizza is very similiar to Keste, except the decour is nicer, the wait is shorter (if any at all) and the staff is friendlier. I've heard one of the chefs used to work at Keste, so no wonder everything is delicious without the crazy overcrowded village feel. The wine list is great and they have some cool Italian Beers. I've had their margherita pie which is wonderful. I've also had their Verdure and Quattro Stagioni (without the Italian Ham) and both were mouth watering and delicious. The staff is mostly from Italy and thus treats you as such. They let you sit and linger over wine and never make you feel rushed or like you have to pay and get out asap. One of my favorite Boerum Hill spots.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-12", "description": "This place is overrated. Great ambiance, but pizza is just ok.....I'm from Philly \u0026 always complaining I can't get good pizza \u0026 wish I lived in NYC. Had very high hopes for this Brooklyn pizza, but i can do just as good in Philly \u0026 that's sad....won't be back; much better pizza elsewhere in NY.", "author": "Keith L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "From California. Best Neapolitan pizza I've ever had.", "author": "Keith G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-16", "description": "So good.  I work in the area, but never noticed it because they don't open until dinner.  We happen to be here late Sunday and ordered the Pizza, awesome!  I also had the tuna and caper/chick pea app.  Very very good.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Grabbed a quick Diavola pizza an a glass of Lambrusco a fee nights ago. This is a great spot for a casual dinner with friends. Can't wait to go again next time I am in the neighborhood.", "author": "Ginny B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}