{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Wow! Gluten-free pizza that tasted like pizza! I was very impressed!  \n\nI really wish I could have had some of the other pizzas there too...not enough time. The place gives the feeling that you wandered into someone's Italian house and just sat down for dinner or drinks. Not fancy, but cozy, and they have an outdoor patio. Definitely a place to go for fantastic pizza. And did I mention GLUTEN-FREE CRUST that actually tastes like pizza??? Miracle.", "author": "laura p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "It's about time I've reviewed Sottocasa as I've been coming here a few times a month since they opened. This is a classic NEOPOLITAN pie and one of the best I've had-- the crust is delicious with a slight char adding a nice layer of texture to the pizza, with a perfect balance of crust, cheese, and sauce. \n\nThey serve one whole pie which is maybe 12 inches-- I'd suggest ordering 1 pizza per person. Don't try to split it or you might end up going home hungry. Many reviewers complain of soggy/wet but that is typical neopolitan (I'm not sure if it's the heat from the wood oven that causes the sauce and cheese to pool in the center of the pizza, but I've never had neopolitan done any other way).  I personally really enjoy the liquidy/molten center where there's the perfect mix of mozzarella and tomatoes blended into one that leads to a divine flavor explosion-- mm, delish!! \nAt this point, I've eaten my way through the entire menu-- with my favorites being the Classic Margherita, the Laura and the Calzone. \n\nThey offer delivery, which I was at first skeptical and afraid that the with the heat in a closed box, it would cause the crust to lose its crunch- but it didn't! It also might be due to the fact that I live so close and they only had to walk two blocks to my place but they always deliver within 15-30 minutes? I'm sure if it took longer for delivery, the crust could potentially be compromised. \n\nIt's not my absolute favorite pizza (Lucalis still holds the #1 spot for me) however it does deserve 5 stars for convenience(you won't have to wait 2+ hours to eat here), close proximity to my apartment, option for delivery, amazing waitstaff, good wine and imported italian beer and lastly, they have a great outdoor space which is perfect for warmer days.", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "Sottocasa has a great atmosphere, a great staff, and most importantly, really great pizza. \n\nI've been here three or four times now, in both small and big groups, and the food was consistently fabulous. The warm focaccia is fragrant and addictive but if you fill up on it you can't eat other delicious antipasti. I've had the the prosciutto, mozzarella, and arugula salad, and the spinach, ricotta, and almond salad, and both were great: fresh and simple and perfect portion sizes.\n\nAs for pizzas, I've tried the Diavola (hot soppressata), Salsiccia (Italian sausage), and Verdure (vegetarian), which were all fabulous. One person can eat a while pizza if they're really hungry; I've found that two pizzas were perfect for three people, as long as we also get a couple of shared appetizers. \n\nThe staff is super-friendly and warm. They remember you if you go back even just a few times. All in all, a solid pizza pick in Boerum Hill.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "My favorite spot to visit when I'm staying at the NU Hotel. The pizzas and Italian microbrews have me hooked. The Laura and the Pink IPA are a delightful match, but truthfully it's all quite delicious.", "author": "Duane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Really delicious pizza and salads. A bit on the pricey side for the area but the thing that drives me crazy is how stingy they are with their wine pours.  The wine is 11+ a glass and they consistently pour very small amounts- it's honestly the thing that keeps me from coming back more often.", "author": "Janna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Delicious salads and pizzas; the best of all the pizza options in the downtown Brooklyn/Brooklyn Heights/Carroll Gardens area.  Very cozy atmosphere for a casual date.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "This place gets amazing reviews however I did not see what the hype was about. Their Pizza was decent salad was small. Nothing amazing.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Nice beer and semi decent food. If you don 't have a refined palette, or your life experience just started in the mid to high 1990,s, or you need to eat with your kids. It's a quick kill of a meal. Not bad not great. Just there. So, what else is new? Mediocrity in food will always rise to any level. Welcome home and enjoy, your stomach won't know any better.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "One of the best pizza experiences of my life. Really cool feel, fast service, and some of the best pizza I've ever had.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "I'm a huge pizza snob and have frequented many spots in nyc and am constantly on the hunt for top-quality pies.\nYes there are endless amounts of neopolitan pie places to choose from.\nSottocasa is my number one go-to right now...for neopolitan style.\n(Don't get me wrong, i still prefer Di Fara's new york style pizza above all).\nMy favorite pie is the boscaiola since i prefer meat as a topping. The pies are substantially sized compared to other neopolitan joints and the taste is impressive.\nIt's authentic italian from the owners to the customers which is always a plus.\nNice cozy environment too as it is situated in the basement of a brownstone very fitting to what sottocasa means in italian.", "author": "J W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Yummy, authentic pizza!  I would suggest starting with the focaccia (pizza bread, coarse sea salt, EVOO, rosemary) and prosciutto and mozzarella (comes with a large portion of arugula).  For the pizza, I stuck with the Margherita pizza (tomatoes, mozzarella, basil).  Some may call this boring, but I call it classic!  \n\nWhat I really want to call attention to in this review is the service.  It is obvious that everyone working there has a lot of pride in the food they put out.  Two of the girls in our party were running late, so I ordered two pizzas for them before they arrived.  Unfortunately, getting to the restaurant took them longer than expected, and the pizzas were ready before they arrived.  The pizzas had only been sitting on the table for about 3 minutes when the server came over and said if the girls weren't there in a few minutes, he would make them fresh pizzas.  And he did!  So totally above and beyond, and very much appreciated - Thank you!!", "author": "Katie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "We have been woefully late in visiting this place.  It's terrific.\n\nIt opened up in 2011 and, in our defense,  we were getting our pizza fix at the spectacular Freddy's in Long Branch, New Jersey.  (And yes, it's worth a 50 mile drive.  It's that good.)  But there is wonderful pizza to be had in Brooklyn and Sottocasa is a fine example.\n\nThe décor is bare bones.  Servicable.  I thought that bench seat was going to be a literal pain in the ass but I got over it.  As in most Brooklyn restaurants at 7:00PM on a Friday night, children are included with the price of a meal.  Luckily, they were all well behaved during our visit.\n\nhttps://farm1.staticflickr.com/761/20062999494_2b33ae6348.jpg\n\nhttps://farm1.staticflickr.com/688/20497578230_6520424093.jpg\n\nWe started with the meat and cheese platter which was just wonderful.  Three different cheeses, three different meats, a giant disk of foccacia, and some arugula as camouflage.  It was reminiscent of the salumi platter at Otto but the foccacia was the trump card.  \n\nThis was the Italian equivalent of the everlasting gobstopper.  Between the two of us we managed to finish it off but it took awhile.  We probably shouldn't have eaten the foccacia but it was hard to resist taking bites and using it as a platform for the meats and cheeses.  It was terrific but filling.  At $16 this is a great deal.\n\nhttps://farm6.staticflickr.com/5654/20692324721_43bce1188b_z.jpg\n\nhttps://farm6.staticflickr.com/5625/20497577870_1825aa018c_z.jpg\n\nOn to the pizzas.  These are \"personal\"  4 slice pies - the type that one person could eat if they were reasonably hungry.  We ordered two, not counting on the effect of the meat and cheese platter which really cut into our appetites.  On our next visit we'll just order a single pizza.\n\nDiavola - tomatoes, mozzarella, hot soppressata, olives, basil\n\nhttps://farm1.staticflickr.com/606/20685560795_7f16a700c8_z.jpg\n\nI've had diavola pizzas before but this was among the best.  The ingredients were very good but the crust was excellent.  A balance of crispy and bready with a nice amount of chewiness.\n\nSalsiccia - tomatoes, mozzarella, hot Italian sausage, basil\n\nhttps://farm1.staticflickr.com/781/20497550818_be461a7b05_z.jpg\n\nThat same great crust with crumbled spicy sausage and some bonus mushrooms.  Again, an excellent pizza with a great crust.\n\nThese are by the book Neapolitan style pies, and Sottocasa has what amounts to a mission statement on their website -\n\n\"Sottocasa is Pizza\nState of the art, flavorful, authentic Neapolitan Pizza. Which means a century old technique and the freshest ingredients, with an eye always open toward the environment. We source the best flour and tomatoes from Italy, and most of our fresh cheeses are from the US, so they travel less and they are always as fresh as possible. And we cook everything in a 2 tons, 1000F wood fired oven, built and shipped from Naples... check our flying oven!\n\nOur Product\nWe do Neapolitan Pizza for the simple reason that we think is the best of all the different kinds of pizza that came after that. We liked something better, we would do that. The main parts of our pizza are: dough, tomatoes, mozzarella and oil. Our dough is only made of Italian 00 flour, fresh yeast, salt and water. And time. In fact, before becoming your pizza, the dough sits, in different stages, for at least 48 hours, but usually it is never used before 60. This process grants a very light, digestible and flavorful dough.\n\nWe use only Italian Organic Tomatoes for our sauce, freshly crashed and with just a little salt added. We love to taste tomatoes in a tomato sauce. Fior di Latte Mozzarella from Wisconsin is our choice for the cheese. A beautiful white, clean and fresh cheese that we break by hand everyday to insure the right texture. And we gently sprinkle our pizza with a unique, delicious Extra Virgin Olive Oil from Sicily, labeled directly for Sottocasa. And you can be sure that all the other ingredients that will make your pizza a unique experience are carefully sourced to meet our standards!\"\n\nAs a rule, I don't like mission statements.  They tend to focus on process and authenticity, but all too often the results are only good, not great.  Sottocasa is an exception.  This is excellent pizza.  \n\nOne of the criticisms of authentic Neapolitan pies is that the crust sometimes is soggy in the center.  Sure enough, on this thread I've read occasional posts with that same critique.   That wasn't the case with the two pies we had last Friday.  The edges were crispy and at the center the crust turned a touch more bready.  But soggy?  Not one bit.\n\nService was attentive and the place was jumping.  The place was packed by 8:00PM.  Go early or be prepared to wait.\n\nWe really liked this place.  It's going on our regular rotation.\n\nETA -  I was incorrect in my earlier version of my review.  The rosse pies are available at all times. My apologies to the restaurant.", "author": "Lex X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Used to love this place. Have been going here for years as my go to nabe pizza place. I have to say, as per my last few couple of visits, that the quality of the pizza has decreased somewhat. It's still pretty good pizza but not quite the achievement in pizza making it used to be. Other thing I have to say I've noticed is that especially from the male staff service has gotten a bit snobby and entitled, which is something service should never be. It's all about the customer, remember that!", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "My wife and I hosted our rehearsal dinner here with 30 of our guests over Labor Day weekend, renting out the back patio.  We are long-time customers, and just wanted to thank Luca and his team for giving us such a great night.  Every single guest thought it was up there with the best pizza they had ever had.  We were so happy that they could be a part.  We are always impressed with our meal and their desire to use fresh ingredients.  Their pizza is on par with the highest rated places in the country, and we've been to most of them.\n\nIf you're looking for pizza packed with sodium and preservatives and thick nasty tomato paste for it to taste good (like some recent reviewers seem to be), then maybe stick to 30 minute or less delivery and your coupons.   But for those of you who understand Neapolitan pizza, along with fresh simplicity, you will love this place!", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Superb place! Love the atmosphere, service, food! I really liked the guy with Italian accent who was taking care of us :) we got our pizza 10 mins late, but we received several apologies and free wine :)", "author": "Fatima N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "I am impressed with this place and I thought I wouldn't be. I'm very picky about my Neapolitan pizzas and this one I can only say is really good. \n\nWe went on a Saturday afternoon around 1:30ish. Only a few tables were taken. We sat in the front room, which is decent sized, but not large, but there is apparently also a back room/covered porch area. It was a rainy day, so maybe this had to do with a smaller crowd, or maybe it's always like that, I'm not sure.\n\nOur server was nice enough and had no complaints there.\n\nFirst, let me talk about the two most important qualities of a Neapolitan pizza because they apply to both of the ones we ordered. \n\n1. Dough/Crust - their dough was fresh, handmade, and mild tasting, making it a great vehicle to feature the rest of the ingredients. The crust was properly done (we asked for it lightly done, otherwise would've probably been a bit too charred), and the shape was executed well. The outside crust was thick and dough and the inside crust was thin, although I will say still thicker than most Neapolitan pizzas.\n\n2. Marinara sauce - this is such an integral part of a great Neapolitan pizza and theirs is a keeper. It's fresh, clean, smooth, and rich. Delicious.\n\nMarinara - marinara sauce, basil, oregano, and garlic. Given that this is a no cheese pizza, the sauce is the make or break. This sauce makes it. And they put a fantastic amount. I have gotten Marinara pizzas at other places with insufficient amounts of sauce and you're basically just eating bread that is dry as the sauce keeps it moist and flavorful. Good amount of basil and oregano. Lacking on the garlic and also the minimal garlic on there was oddly chopped. Overall great.\n\nVerdure - marinara sauce, mozzarella, eggplant, caramelized onions, mushrooms, basil. We got it with no mushrooms. This is a very hearty pizza and a fantastic option for vegetarians. Toppings are ample, so they aren't skimping. Overall really good, but the biggest problem is that the quality of their mozzarella is not the best. It's slightly rubbery and the taste/texture are not among the best. Nonetheless, pretty good.\n\nWould definitely come back to this place, but perhaps try a pizza that features a cheese other than mozzarella. Good find - I'd encourage you to try it.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "Been wanting to go here for a while and had a chance a few months back.  I know, what a backdated review but he's what I Ordered \n\nValdostana\ntomatoes,mozzarella, fontina, prosciutto di parma, sage\n\nAutunno\nmozzarella, smoked mozzarella, ricotta, brussel sprouts, speck, sage, truffle oil \n\nBoth were ok when I ate it in house because I found it underseasoned mainly because the ingredients are so fresh that it comes out a bit watery which gives it a diluted taste.  However, I had it the next day and the flavors had a chance to meld....wow, perfectly flavored and great surprise.", "author": "Ricky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-31", "description": "Went on a quiet Saturday afternoon, and it looked promising at first entering. We looked over the menu and two waitresses came over at two separate times (we took a few extra minutes perusing the menu to decide...horrors) to take our order. We decided on a margarita pizza with hot soppressata and a white Quattro formaggio pie, plus a salad. Within minutes the pizza arrived at the table, but no salad. Hungrily, we started devouring the 11' inch pizzas (definitely on the small side for the price, thank goodness we ordered two!) thinking the salad was on its way, but it wasn't.\nAfter about 10 mins of waiting for the salad, we flagged down one of the waitress (who both disappeared after taking our order) and she seemed surprised that we didn't get our salad. Whoops. It's a pretty small place and half the staff seemed to be sitting at the front bar area eating. Eventually, both waitresses put on their coats and left, and that was the end of having anyone check on our table until we had to request our check from a guy who was stationed at the bar. Terrible service.\nThe pizzas themselves were okay, nothing at all mind blowing. The Quattro formaggio was good, with a nice balance of smokiness, creaminess and a good crust. We were disappointed by the Margarita though, and the addition of hot soppressata was an unfortunate choice for us. It added extra liquid (and gaminess) to the pie, and I felt it should have been left in the oven an extra minute or two to cook it off. As far as the spinach salad we ordered, it looked like the someone put it together in a hurry in a tiny bowl. Luckily, the quality of the ingredients (and olive oil) redeemed its late and hastily made appearance. \nThe coup de grâce was when the bill came and we were charged $4.00 for half a glass of unsweetened iced tea. $4.00. (Didn't notice price on menu) My husband's tiny Coke bottle was $3.50, but at least it was a bottle of coke. How the hell could they charge that much for unsweetened iced tea?\nWon't be returning.", "author": "Arlene A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-05", "description": "As you would expect, the pizza is good. Fast and efficient service. Beer menu is a bit odd. Lots of extremely expensive Italian microbrews. Perhaps a reasonably priced beer would be a good addition.", "author": "Philip S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Those who spent time in Naples will recognize something familiar at Sottocasa. Their pizza is outstanding and faithful to the original Neapolitan margherita.\nThe personnel is friendly and knowledgeable. This is an authentic Italian restaurant.\n\nIf you complain about soggy crusts, and the lack of topping options, remember that the burnt quiche with processed cheese that Newyorkers usually venerate as the best pizza in the world is not a pizza.", "author": "Clément G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}