{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Thank God, finally a great pizza place close to my apartment AND it has a sick backyard for warmer weather!  I've never had a pizza as tasty and delicious as the Neopolitan pie with capers...it was so good I wanted to order a second one, but was stuffed.  Great artisenal Italian beers on the menu in this place too - love it!", "author": "Macy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "My favorite pizza in New York City. Seriously. Pizza is phenomenal. My personal favorite is the Diavola, but I have tried and enjoyed them all. The service is friendly and attentive. The place is comfortable and sparkling clean - love the decor. Looking forward to eating out back this summer. I only wish I lived closer!!", "author": "Cara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Thoroughly enjoyed our evening...the atmosphere is most welcoming and the pizza, cooked with its fresh ingredients in a wood fire pizza \noven...delizioso!\nLoved the seating in the backyard. It  brought back so many fond memories of family gatherings at my grandparents' home.\nAppreciated the warmth and attentiveness of the staff as they visited with all of their guests.\nThis is a wonderfu culinary addition to the neighborhood and look forward to many return visits.\nGrazie mille!", "author": "Stefano C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "I've lived in Boerum Hill for almost 6 years and have waited for the arrival of a really good pizza joint. I lived in Italy as a kid so I'm picky about pizza. Theirs is top notch and you don't have to wait for an hour like Lucalia. My only critique is I would like the tomato sauce to be a little thicker and more defined but apart from that, great food, nice people and reasonable prices - the trifecta for a successful restaurant that lasts in NYC", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Went here for the first time last night. Though we waited 70-75 minutes for a table after being quoted a 20-25 minute wait, I think it was worth it. (it was Saturday night!) We were sent some complimentary apps and washed them down with one of their many Italian beers. They have many pizza choices and the four we sampled were all delicious. The decor is simple with a nice bit of charm. They have a back patio for the warmer months, which I can't wait to enjoy. This place is a nice option to Lucali, albeit a slightly different style. I'll be back soon to try the other anchovy pie!", "author": "Samuel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-04", "description": "Truly one of the finest examples of Neapolitan pizza in the whole city. The outdoor area is a serene hangout away from noisy Atlantic ave. The Romana pizza is a promise of all that is good at Sottocasa.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "Delicious pizza. Average price: 15 dollars for a personal pizza, big enough for two people. Excellent service.", "author": "Sergio M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "Watch out, here comes a rising star in the New York pizza scene. Sottocasa -- which is run by real Italians -- specializes in rustic Neopolitan pizza. Brand spanking new on the ever-changing drag of Atlantic Avenue. The space is spartan and comfortable; think: open light-filled street-level space, white brick walls, simple wooden fixtures, few decorations, and one big brick oven that is both the stylistic and functional focus of the establishment. The menu: filled with pizza. Maybe 20 of them, with creative and fresh ingredients. Sampled the sausage and raddichio pizza while my wife/dining companion went for the tomato, fresh mozzarella, basil and capers. The former was a little on the dry side, although the sausage had quality meat and the raddichio added an interesting bite. The latter was superlative: crushed fresh tomatoes, fresh bubbling mozzarella, leaves of basil and prickly capers. The crowning achievement was the crust -- well executed, with a little air, a little char, a little chew, and a little crackle. You can't manufacture crust like this; Sottocasa may be a new kid on the block but they don't mess around. Could Sottocasa be the next Roberta's or Motorino? Perhaps. Getting a liquor license may help (it's supposed to come in a few weeks). I'd also parse down the pizza menu options (less is more) and add some non-pizza specials. Will keep an eye on these guys.", "author": "Ravi J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-22", "description": "greasy flavorless pizza...it is food though. go to franny's if you want to get good Neapolitan style pizza.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-20", "description": "I would have been so happy if this place lived up to our expectations, because the staff is terrific and the location is convenient, but our disappointment essentially came down to this: how in the world can pizzas made in a 1000-degree, wood-burning oven manage to come out soggy?  It's counter-intuitive, but both of our pizzas came that way.  Add that to a disastrous eggplant appetizer (wet, undercooked eggplant topped with our first soggy crust of the night) and you have an experience that, sadly, left us thoroughly unsatisfied.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "The one time I was here I unfortunately was in a rush, but what I can say is that the Pizza with Prosciutto was excellent. They have a selection of italian craft beers including some larger format Baladins and others, which is great. They have an exposed hot water pipe in the bathroom with a clear sign warning that the pipe is hot. Upon not heeding that warning I was underwhelmed by the temperature of the pipe - minus .5 stars.", "author": "Sean T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-11", "description": "I liked it. The reason why I didn't love it is because I feel like if I cooked I'd be able to whip this up at home. Basically get pita bread and some fresh veggies and you're all set. I have to say though that any place that toots its own horn by having it written on the menu that they use the absolute freshest of the fresh ingredients gets on my nerves. So you grow your own tomatoes who cares. P.S. the chef was cute.  P.S.S. when you don't have candle holders handy just use a wine glass.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "I am so excited this place moved into my neighborhood!  The environment is warm, the staff is friendly, the food comes really quickly, and it's great.  The pizzas are really fresh and delicious and the salads are really good sized. I will definitely be coming back here again and again.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "Disappointing. Was expected to eat some neapolitan-like pizza. Well, I can see there were intensions to make it like neapolitan pizza, but the result isn't very successful unfortunately. Also the combinations of ingredients in pizzas represent a weird idea of good taste. Overall - it just isn't worth it. Not coming back...", "author": "Natasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Delicious and authentic Neapolitan pizza and very friendly staff. Well worth the trip from Manhattan.", "author": "Christopher V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "really nice people, great pizza, crust was a little too wet in the middle and dry on the edges", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "A taste of Italy with friendly atmosphere.Great place to go with a group and wonderful service. Loved the nutella desert!", "author": "China D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I went here with a rather large group and had a great time. The candle-lit atmosphere and rustic decor is charming. The true Neopolitan-style pizzas, cooked in a mere \"90 seconds,\" were fragrant and delicious. The dough is flavorful and quite pillowy (like biting into a cloud) but also has a nice char on the outside. The mozzarella was definitely high quality and the sauce was quite zesty (definitely of the San Marzano varietal). With that said, if I went there again I might ask for the pizzas to be cooked another 15-20 seconds (to get the cheese to bubble and get more char in that crust), but that is splitting hairs. Their oven may just need some time to break in-haha.  We also had the cheese/salumni plate (great-even comes with rosemary pizza bread) tiramisu (superb!) and even their espresso was remarkably good. Wines also outstanding. Only thing that did nothing for me was the tuna/chickpea appetizer, which  was kind of \"meh\". \n\nI'm not sure if their pizzas beat neighboring-ish Lucali (can't beat the quality of their cheese!) but it is really great and a wonderful addition to the neighborhood.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "The pizza was great. The staff was very nice but not super attentive. In all fairness I  came here with a large group on a busy night. Everything was great except we did have to keep stopping the waiter to ask for things. They could have definitely benefited from having another waiter working. They forgot to bring us the second to bottle of wine we ordered. It wasn't a big issue just something to note. I had a great meal and enjoyable evening otherwise. If you aren't going to be a high maintenance group I think you wouldn't have any problems.", "author": "Rebecca G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "Perfect pizza napoletana! Save room for the nutella 'pizza' you will be happy you did.", "author": "Lina C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}