{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-19", "description": "They have a beautiful out back glassed in dining room and attentive service. The beer offering is one extreme or the other \"artisan\" at $15! or the nondescript at $6. The salads are nice. The stone oven must be very hot and hard  to drive. I wish someone including myself had looked at the bottom of my pizza before I started eating it. It was burnt. It looked good, but wasn't. I don't think they should try and pass that on to their customer. Inspect before you eat. Have a nice beer before you come.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Let me start by saying my parents were born in Italy so I am very critical of Italian restaurants and rarely will go out for pizza, however this is a really cozy place with a very warm atmosphere. Pizza is enough for one so get a few and share some different flavors. The salsiccia (hot Italian sausage) was very good but the tartufata was by far the best pizza on the menu and probably one of the best I have ever had. Please do not forget the Nutella pizza! Very delicious!! Thumbs up for sure!", "author": "Tania C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "The ambiance was pleasant enough and the service was speedy and friendly. The appetizer salads -spinaci and rughetta - were tasty and clearly made with fresh ingredients - the ricotta was creamy and tasted homemade. However, the pizzas themselves - the white autunno and the red verdure - were somewhat of a disappointment for an establishment that purports to be an authentic italian pizzeria. The crust was quite doughy and the combination of toppings was not particularly complementary. Not like eating in Naples, that's for sure!", "author": "Nick T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "Just a few words to say that if you want to come and taste the REAL pizza napoletana this is the place for you: all fresh ingredients with no exception. The Burrata is the best one and not forget to taste the homemade tiramisù!\n\nTo sit there makes you feel at home and the service is excellent - you will never wait for your pizza even if the restaurant is crowded, everyone is really home welcoming!!", "author": "Lorenza S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "Perhaps the bar for \"artisanal\" pizza has been raised so high in Bklyn, USA that I've gotten spoiled rotten?  But Franny's, Dellaroccos, Sam's, Lucalis and many other nearby spots are superior.  With that being the case, why choose 2nd tier?", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "Both of our pizzas were soaking wet, top and crust. Could and did, to extent possible, ring them out like a wet towel. Sound appetizing? Waiter never checked in, or asked how it was. Sad to have a restaurant when you just don't care about the food you serve.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-02", "description": "I am shaking my head wondering how this place rates 5 stars or anywhere near it. Went there today with my daughter and it was a terrible experience.\n\n1. The place wasn't terribly crowded when we got there but it quickly filled up after we were seated. We ordered focaccia as an appetizer. Focaccia is usually a soft, pillowy specially seasoned bread that one sinks one's teeth into. Instead we were served a flat, partially burnt slab of thin bread that TASTED like focaccia but was hard and crunchy. Hmmm.\n\n2. As the room filled up, we began to see that tables to both the right and left of us had been served while our order was nowhere in sight. FINALLY, the waiter came over and said something like, \"It will be just a few more minutes\"... but didn't seem particularly apologetic about it.  After SEVERAL minutes, my daughter's pizza came but mine did not.  It took several MORE minutes before my order came out. Mind you, we ordered off of the menu, nothing particularly complicated or specially ordered.\n\n3. The pizza had a nice flavor but the top was burnt just like the focaccia was. I ordered a spinach ricotta pizza which was a disaster. They had scattered some raw spinach leaves on the top which obviously got burned under the flames of their oven. All I smelled was burnt spinach when the pizza came and that's exactly what it tasted like. My daughter had a pizza with fresh cherry tomatoes on it; it was tasty but the sauce was drippy and the crust eventually became pretty soggy.\n\n4. Other than a variety of wines, they serve soft drinks (from very SMALL bottles) but no iced tea. Hello?  There are people who don't care for carbonated beverages and it might be a bit early in the day for alcoholic beverages. Please think about adding iced tea or lemonade to the menu.\n\nI noticed that the pizza ordered by the woman at the next table was also burnt on top. It seems to me that Sotto's oven is either too hot or they are cooking the pizzas incorrectly. They are obviously way too close to the flame and should be moved downward by at least an inch, I'd say.\n\nThe atmosphere is fairly cozy (although noisy, lots of hard surfaces) and well decorated but a hipster vibe is not nearly enough to make up for such shoddy service and lousy food. If you're going to charge $15 for a pizza, it ought to be GREAT.  Will not likely visit this restaurant again nor would I recommend it.  This is Brooklyn; there are tons of places in the borough that make better Neapolitan pizza for a lot less money.", "author": "Lee W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "Decor:  4/5\n-Diana C and I came on a rainy day, luckily there was no wait and a few empty tables\n-There is a bar with a few seats\n-Ambiance is slightly dim\n\nService: 5/5\n-friendly and patient\n-we told our server the pizza was bland and not tasty. He offered us to try another pizza but we were full\n-the chef came over to apologize about the pizza and said it was on the house. Completely unnecessary as I would have paid for the pizza but we ended up tipping the full amount of the pizza\n\nFood: 1/5\n-Ordered the margherita expecting it to be crispy and flavorful but turns out the dough was soggy, the toppings tasted bland and the sauce was watered down. \n-Each slice just made us more depressed as this pizza didn't meet the 4.5 star rating. Would I go back? probably not.", "author": "P H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "I would give it 4.5 if there was an option, but  short of heading to Bushwick or Carroll Gardens, this is tip top pie.  They have also added an atrium out back for an al fresco experience and probably to service the demand.  The staff is really accommodating with little cheese lovers, just go early or we might beat you to a table.", "author": "Elias S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "We've ordered delivery from here a few times.  Best brick oven pizza that delivers to our area.  It's a bit pricy, but worth it for better ingredients.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "3.5 \n\nThis pizza was pretty good I guess. Nothing special about it. Crispy crust. Had a pepperoni and something that I can't remember. If in the area I think I would try something else. If I lived here I'd probably come here a lot and eat in. We had it to go.", "author": "J A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "Great pizza place! This place has a very warm and romantic ambiance.The tables are set up in a way where everyone is kind of sitting together as all the tables are side by side. There's even a real live oven with a fire in the back! \n\nStarted with the Spinaci, which was very fresh, then we each got a personal pizza. I got the Margherita and had a taste of the Diavola. It was so fresh and soft, yummy! The pizzas are quite large (I ate half and took the rest to go). The orange sorbet was served in a frozen orange! Very cute and delicious place.", "author": "Yuliya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "For ambience, service, and overall quality, Sottocasa rates top marks. Salads, dessert, and wine selection were excellent, as was the quality of the pizza ingredients. The only reason I'm not rating it 5-star was slightly soggy pizza crust, which is the opposite of what I'm looking for in Brooklyn. I'd definitely give them a second chance if I'm ever back in the neighborhood.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "Got it to go and I waited no longer than 5 minutes. The pizza was delicious!!! I had the bvurrata that they only do on the week end with extra prosciutto.\nI highly recommend this place (at least for take away :))", "author": "Lady C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "This is the place to go for great pizza Napoletana.  Being a NY area native that lived for a bit in Italy, I don't say that lightly!  The calzones are also delicious.  We were able to split one large pie and one calzone between three people for an early dinner. You can tell the ingredients are fresh and the service was attentive and prompt.  The atmosphere inside is lovely- very nicely done in a casual way.  Also, there is unlimited iced coffee refills, a rarity in NY!", "author": "Allie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "This place is sublime. The pizza is amazing...really similar to Fornino in Williamsburg, in my opinion, with a better outdoor area. Honestly, there's nothing else to say but YOU SHOULD GO. Tonight probably.", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "I am surprised there are so many mediocre reviews, I have to conclude that the pizza quality varies (which isn't all that surprising, humidity varies a lot in nyc, so practically impossible to have the same quality everyday).\n\nWe loved it (I consider myself a picky pizza eater with regards to quality, but quite open to different styles), and tried their tiramisu and cappucinno, both great as well (which is rare because I dislike starbucks expresso, and find it hard to find good coffee in nyc).\nWe will probably take italian friends there next time...\n\nI wish this were in my neighborhood", "author": "Adrien D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-29", "description": "A wonderful new restaurant addition for Brooklyn.  We have eaten at many of the highly rated Neopolitan pizza restaurants in Manhattan \u0026 Brooklyn and this rates up there with the best.  \n\nWe have gone four times now within the past two months and have never been disappointed.  On our separate visits we have ordered the Margherita, Quattro Stagione,the Laura and the Parmigiana pizzas for our table, in addition to their salads\n\nWith regards to the main attraction, i.e., the pizzas, they are the real deal.  All the ingredients are fresh, the crust is fantastic, it is cooked to perfection.  The aroma of the hot pizza itself when it is delivered to the table straight from the oven is fabulous.  \n\nSo, yes, I love this place.  The atmosphere is wonderful, the decor is tasteful with whimsical touches.  The service is friendly, welcoming and just delightful.  \n\nOne reviewer posted that the restaurant is in the basement.  The restaurant is actually in the garden level of a brownstone, and they use the back garden for seasonal outdoor seating . \n\nWe will definitely keep going back.", "author": "Adele C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "I have to admit, this is some pretty good pizza.  I wasn't sure about this place the first time I went in here.  The staff seemed a bit snooty, so that put me off, but the food was so good as was the setting, so I went back again and it was okay.  So not sure what the attitude was about the first time.  Good for groups, great outdoor seating, and great pizza.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Sottocasa's pizza is growing on me.  Yesterday, I had one with hot soppressata which was exceptionally good.  And because they use a fearsome wood fire, the pizza rolls out in about 3 minutes, so it's good for a quick weekday meal. \n\nI wish the inside was more spacious, but that's not really their fault.", "author": "Raffi M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}