{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "REAL Neapolitan style pizza!  There are lots of pretenders out there, but this is the real deal.  The wood burning oven really makes a difference and I was surprised when I was told that it was imported from Italy - talk about genuine.  One bite and it was easy to tell that the ingredients are fresh and homemade.  What a find!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "Nice addition to the hood and pizza was better than average. But not great service, we went on a somewhat crowded night and our waitress had friends at the next table.  We were pretty much ignored which would have been annoying in and of itself, but the fact that our waitress was lavishing attention on the next table was just rude.  I would have liked an explanation of the drink menu since my companion and I were confused by the very expensive beer selection, we were open to trying one of the micro brews but since we got no face time with the staff we just ordered the cheapest option.  The pizza was good. We'll probably return at some point but not high on the list.", "author": "G O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "Really good pizza and fresh ingredients and pairings but waaaaayyy took over priced for the size which is an 11\" inch pie ( we measured it).", "author": "sm T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Pitch perfect Neapolitan pizza in a nice cozy space, with nice friendly service. Well worth a visit as you'd have to fly to Naples to get anything nearly as good.", "author": "Eirik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "Really good pizza at a reasonable price. Friendly staff.  Destined to be a neighborhood hit. The outside garden is nice as well.", "author": "kim h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "Best pizza I have ever had. So glad I live right around the corner. I will definitely be frequenting this place often--especially after it gets a liquor license.", "author": "Lacy R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}