{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "What a wonderful experience we had! I went here for my 36th birthday and with a party of 10 (including a toddler and a bang) had medium expectations about how well it would go. But the truth is, it went so fantastically well. Sottocasa was insanely accommodating (one of the guys taught my brother the car-seat-on-a-high-chair trick), brought the wine exactly when we needed it, recommended food when asked and EVERYTHING was DELICIOUS. Oh man I kind of want to go back now.\n\nFor me specifically I had the Amatriciana pizza which was mouth wateringly good, and the whole table had their lambrusco, which was the delicious kind and not that trendy slightly darker rosé with bubbles some places are trying to pawn off on the public. \n\nWe ate in the back covered patio space and it was lovely, but the interior looked like it had wonderful ambiance too. If you're looking for excellent pizza, great service and atmosphere, go to Sottocasa!", "author": "Mariangela A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "Sottocasa Pizzeria is solid neighborhood pizza joint with an extensive and inventive selection of wood fired personalized pies.  While service is low-touch and gruff, this pizzeria boasts an impressive menu of craft Italian beers sourced locally from Brooklyn-based microbreweries.\n\nThe table ordered the classic Margherita pie, the Salsiccia pie (hot Italian sausage), and two Diavola pies (sopressata, olives).  There were some highlights and lowlights of our meal.  \n\nFor starters, the pies were a bit too soft and underdone for our tastes.  If you prefer crunchy crusts, I recommend requesting well-done or extra-crunchy crust.  The Diavola pies received mixed reviews ranging from complaints about the quantity of olives used to a general dislike of Italian salami on a pie (a personal preference).\n\nThe Salsiccia pie was a huge hit!  Great taste and ingredient combination, with compliments on the overall spice/heat level.  The classic Margherita pie was also well-received.\n\nWe would definitely return to this friendly, cozy, and affordable neighborhood pizza joint.  With more savvy slice selection and a few special requests, this place could achieve pizza perfection!", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "I feel lucky to have such an amazing pizzeria in close proximity to my apartment. I was also fan-girling when I saw them featured on Scott's Pizza Tours!\n\nSottocasa has a fairly basic menu. There's a list of antipasti and... pizza. I recommend exploring the antipasti. One of my favorite things on the menu is the tuna chickpea salad. Its super simple, fresh, and healthy - a perfect pregame to a pizza. It's SO good, and I've learned to recreate for myself at home.\n\nWhen I eat neopolitan pizza, I tend to stick to the basics like a margherita. A perfect marghertia is hard to beat, and Sottocasa does it very very well. Sometimes, I waver and get the Salsiccia pizza, which is also amazing and delicious. *They also serve a burrata pie on the weekends!\n\nIf you live in Boerum Hill area, you MUST explore this restaurant. It's a super cute spot to have an easy dinner. And if you truly live nearby, they might even deliver (phone orders only).", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "I ordered the Autunno pizza bianche and it took approximately 15 minutes wait time. The pizza was devoured as soon as it came out of the oven. Here are my thoughts:\n\nFor a $19 pizza, the hunt of the truffle oil is underwhelming.\nThere is a generous amount of quality speck. It is not overcooked which I like.\nThere is a good amount of mozzarella and ricotta that holds itself onto the chopped brussel sprouts. Because of this, there is no messy bits falling off of the individual slice. Kudos.\nThe crust is a bit doughy for my liking. I prefer it crispy and airy in the inside.", "author": "Canny F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-29", "description": "Maybe I just went on an off day, but this pizza plainly just not good. It was doughy, burnt on the bottom, and liquidy on top. I believe one of the pies was just regular Margherita.  Friendly staff and cool outdoor/greenhouse part in the back, but I don't know if I'll have the courage to try it again.  It certainly wasn't cheap.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Amazing wood fired pies in the neighborhood which has become a go-to when I'm craving pizza. Authentic Italian Neapolitan pizzas, rarely with a significant wait time to get a table, and all at very reasonable prices.\n\nAll the pizzas are great. The time between order and getting the pizzas to the table was incredibly fast, even in a packed restaurant. Perfect crust, wooden char, and soggy/wet in the middle - just perfect. Ingredients were fresh. Service was friendly. \n\nThe reviews pretty much say it all. If you're ever in the area and craving pizza, drop in and you won't be disappointed!", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "I've been having really strong cravings for good wood fired pizza since moving to New York and hadn't quite found a good place... until now! \n\nThe crust is so fluffy with a slight char on the outside, although it's thin in the center to allow for the toppings to dominate. My sister and I shared the Laura, which has crushed tomatoes, mozzarella, speck, mascarpone, and rosemary... so delicious! \n\nThe tiramisu was okay (not the best I've had), but they have a pretty good wine list featuring wines from Italy and I really enjoyed the glass of Sangiovese Blanco I ordered. \n\nThe interior is cozy, but they do have a bar and an enclosed patio in the back with more seating, which I highly recommend when it's nice out. Service was a bit brusque, but the food came out quickly. I really enjoyed the pizza and wine and look forward to trying more varieties next time.", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "I used to go to Keste's in Williamsburg to get my gluten free pizza fix, but, once it closed down i thought it would be difficult to find a spot that matches up. Thankfully, i found Sottocasa. They can make any pizza on the menu gluten free anddddd they have vegan cheese if you are lactose intolerant or are vegan. The crust was thin but not dry; i got the pizza with vegetables (do not remember the name on the menu), and they didn't skimp on veggies like some places do! \nI took my friend who does eat gluten and she enjoyed the pizza as well! \nThe space itself is cozy but a little tight, i went on a weeknight and did not have to wait.\nWould definitely come back to this spot!", "author": "Masha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Amazing!!!!  The pizza was fabulous. The crust perfect. Chewy and soft. The spicy sausage with basil pizza was hands down best pizza I've had. \n\nThe caprese salad to start was fresh with pesto and arugula. \n\nThe atmosphere is subtle. Simply designed with plenty of table. \n\nI'll be back!", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "Solid, solid, real Italian pizza. High quality but unpretentious. A good place to bring kids.", "author": "G S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "We had a fantastic date night here. My husband has celiac disease, so I've tried a lot of gluten-free pizzas, and this was one of the best crusts we've had. I also had a regular one, and it was incredible. It's a really cute setting and the prices aren't bad. We also got the tagliate antipasto, which was a board with different cheeses, meat, and artichokes. Highly recommended!", "author": "Rachael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Sottocasa pizzeria is a little gem in my new neighborhood. Affordable and casual, but without sacrificing deliciousness. The pizza was so good I could have had 3 to myself.\n\nNot really-get one pizza per person though and that should be enough. Wine and beer are good prices. The back patio is covered and is super nice in the summer. \n\nIt's totally a place I'll be frequenting.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Italian Food is my favorite...Yes, I have said it time and time again and will continue to do so-lol. I am always up for trying any Italian Food Eatery and after viewing pictures on Yelp, I was sold on the idea of trying Sottocasa's Pizza. \n\nOn their website, they mention that \"Sotto\" in Italian means \"under\" and \"Casa\" means \"home\" which is a great way to describe this place nestled at the bottom of a townhouse. When I walked into Sottocasa, I received a warm welcome from the server at the bar and proceeded to view a cozy, quaint environment that made me feel at home. Indoor and outdoor seating and cool decor which included tables w/ candlelit arrangements created an inviting atmosphere. \n\nJohanna B. and I arrived around the same time to meet up for dinner. We opted to be seated inside towards the back area. Our table server kindly offered us water (you can choose tap or sparkling water). I decided to have an interestingly tasting sparkling lime beverage. \n\nWe ordered from the \"Pizze Rosse\" (Red Pizza) section of their menu. Johanna had the Amatriciana Pizza - tomatoes, carmelized onions, pancetta, pecorino + basil. I had the Prosciutto Crudo Pizza - tomatoes, mozzarella, Prosciutto (one of my absolute favorites), diparma + basil. I thoroughly enjoyed my individual pizza which is actually cut into 4 nicely sized slices...wow, such filling pizza-lol. Sottocasa's pizza has soft, chewy crust and is so seasoned. We each had a slice of the other's pizza and the Amatriciana Pizza was delicious as well.\n\nJust admitting that the pizza was filling, you would think that I would have no room for dessert right?....wrong!-lol. There was no way that I was going to leave Sottocasa without having some dessert. The Lemon Sorbetto is beautifully presented in an actual lemon that is inside of a elegant glass. Creamy, light and refreshing Lemon Sorbetto.... it melted in my mouth. This tasty treat was the perfect ending to a great meal. \n\nYes, you know that I will be back. If for no other reason than to try more pizzas and to have Orange Sorbetto for dessert!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Super stoked to have found this place. Normally I have to trek into Manhattan to go to Kesté. \n\nWe showed up for an early dinner and were happy to be seated right away. The ambiance is nice and the service was good. \n\nThe topping selection was solid and they have gluten free crust! I'm always amazed by how quickly these pies come out of the oven but never disappointed. :D\n\nFor those who enjoy languages, see if you can figure out why this restaurant has the name it does.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Exploring my pizza bucket list, I've been anxious to try Sottocasa. (And yes, I'm late to the game). This evening , I had that most pleasant opportunity\n.\nDear Sottocasa, why am I still thinking of you as though I've been on a fantastic date? Actually, I have because you're just about better than most.\n\nMy friend and I didn't even get a chance to order a glass of wine at the small bar since our table was ready upon entrance. Lightning fast. After all, it was a Saturday evening. We were pleased.\n\nThere seemed to be two sections to the restaurant--the front/main area and the back part which I believe transforms to outdoor seating in the warmer weather.\n\nOnce seated, my friend ordered a glass of Montepulciano wine while I opted for a Sicilian Rose. Both very delicious.\n\nWe were informed that the pizza were cut into 4 slices . We refrained from ordering any appetizers. I selected The Parmigiana pizza  which included eggplant, mushrooms, hot soppresata and Parm cheese while my friend selected the Prosciutto Crudo. Loaded with tons of proscuitto. The 4 slice pizza was huge!\n\nIn the end, we swapped two slices for two slices. This means, I experienced half of  each delicious styles. Wow factor. Even the entire crust/dough was done just right. Rustic with a nice bite. \n\nOverall opinion? I have died and gone to heaven. Obviously, I was recusitated because I'm writing this review.  And, I am here to tell you that you must try Sottocasa.\n\nThe interior was charming, service was exceptional and I fell in love ---with their pizza.  Yes, that good! \nI cannot wait to return again. Prices are standard for artisan style, personal pizza.\n\nI urge you to try it. Soon.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "This was a pleasant and welcome surprise stop after a few hours of happy hour drinking! We stopped in with a group of us around 6ish and there was a table ready so we were able to get in right away which was nice! The decor is warm and cozy and makes you want to sit and enjoy a glass of wine. Which is what we did! \n\nWe got a couple of red house wines for the table which were delicious! Then we started with an appetizer of little bites or the \"tagliere\" which was a selection of Italian cheeses and cured meats with focaccia bread. This was all so delicious! Especially if paired with the hot oil they had on the table you could dip the bread in. \n\nThen came the pizzas! We ordered 2 to share for the table which was just enough as they were pretty big! We got the Salsiccia pizza with hot Italian sausage, mozzarella, tomatoes and fresh basil. This was so delicious and I sort of wished we got more! Then we got the Boscaiola that came with mushrooms, tomatoes, hot Italian sausage, Gorgonzola, and fresh basil. Both were just so good and we all scarfed it all down. \n\nThe service was quick and polite and everyone left happy and full! I will definitely be coming here again to try some more Italian pizza!", "author": "Brittanny K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "I thought that this pizza place was ok. The pizza came out fast which is a plus but it was soggy in the bottom. \nThey give you a lot of prosciutto on their pizza which was nice but I don't like soggy pizza :/\nMaybe we came on an off day? But both of the pizzas we ordered came out that way. \nNonetheless, their truffle pizza was ok nothing spectacular in my opinion.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "Ah-mazing legit Neapolitan style pizzeria! Not just the pizzas but from appetizers all the way to desserts you will not be disappointed! I thought I was home.", "author": "Ervin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "This place is so solid. Legit Italian style pizza. The bread is light and pillowy, not overly chewy with a slight burnt tase. They give you olive oil to sop up the crust. \n\nWe got the Laura with speck, mozzarella, mascarpone, and rosemary and all the flavors were so pronounced and beautiful together. So smokey.. creamy.. savory... perfection ! I don't think the picture does it full justice either. \n\nI'd love to come back and try more pizzas and their desserts (tiramisu).", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Food: 9/10\nService: 7/10\nAtmosphere: 8/10\n\nSottocasa is definitely among the best Neapolitan pizzas available in NYC.  It's tucked away into a small cellar space that can be a little tough to find the first time or two.  The inside has old brick and wood trimmings, and seats maybe 40 or so people including the bar area.  The space itself is pretty cramped, but if you just want to grab a couple of pies and be on your way, you can get in an out pretty efficiently even during peak times.\n\nNaturally, the Margherita is a must, but one of my favorites is the Salsiccia (essentially a Margherita with house made sausage), which really adds a nice salty umami compliment.  I've worked my way through maybe a third of the menu at this point, and genuinely feel that as long as you're in the mood for the ingredients and type of pizza you won't be let down by anything.  The import beer list is also pretty nice, but the evening can get a little pricey if you're not careful.  Definitely a must try restaurant in Brooklyn, and not too far from the bridge if you're making a special trip!\n\nTIP: Sottocasa will deliver within a limited radius, but they only accept cash payment, so make sure you plan ahead if you want to go that route.", "author": "Ryan S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}