{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-10", "description": "I was not impressed came based on all the good reviews. Salad to start was awful and both pizzas were soggy and undercooked. The burrata pie was outright bland and sausage was mediocre. Go to Emily's or Roberta's if you're looking for great pizza", "author": "Rich S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "it's easy to make a pizza that is better than all that garbage topped with plastic cheese and motor oil that is sold in a triangular shape called a slice, but that's not enough, and there is where sottocasa falls, not enough, flavors were good but the whole thing was so watery that it looked as it rained over the pizza pazza or maybe just a pizza ubriaca. i still miss \"una pizza napoletana\" in the east village. c'est la vie", "author": "Federico S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "This place is a WONDERFUL addition to the neighborhood.  The pizza and arugula salad are delicious.  They have been open 11 days, and we have already eaten there twice.  The pizza is thin and crispy, and the ingredients are well balanced.  The salad has a wonderful lemon and olive oil dressing, and just the right blend of arugula, parmesan and tomatoes.  \n\nI highly recommend this place!!  I forgot to mention that the room is super cute and the garden is lovely.  You will not be disappointed!", "author": "Page T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "Great pizza! Fresh ingredients, and attentive service.  I keep going back! Once you place your order, your pizza is out very fast, but the servers don't rush you out once you're done.  Great local restaurant for date night :)", "author": "jenn m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "yup this place rocks. on my NYC pizza rating meter, i would rate it the best pizza i've had so far...and also extra points for it being walking distance from my house! if you like keste, you will definitely like this place more!\n\ngenerally, i've had very good experiences here with food. there have been a few times when the restaurant has been very busy and the pizza hasn't been 5 stars, however, the quality of the ingredients is fantastic and the service is TOP NOTCH. all of the wait staff and servers are very kind! \n\nmy favorite pizzas are the laura (with meat) and the verdure (vegetarian). there is usually never a line to be seated (compared with ALL other NYC pizza \"institutions\") and if you are arriving with a larger group, you can call ahead and let them know since they don't take reservations. for dessert, the tiramisu is highly recommended! i'd give this place an extra half star if i could :P i'll be back for sure since i'm already a regular!", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "Best and most authentic pizza in an area with lots of good pizzeria. Also fine and friendly service.", "author": "Jim H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Excellent pizza!!! Great flavors, and made with quality ingredients.  They have a great variety as well, and the people working there are very friendly.  For that area and the quality of the pies, I would say it's very reasonably priced as well.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Very close to authentic Italian pizza (having had the best in Rome and Brindisi). Great service, good prices for NY. Loved the outdoor space which was surrounded by a growing herb garden. Will definitely go back!", "author": "Myechia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "The pizza alone would earn 4 or 5 stars. 5 for the crisp one. 4 for the soggy one. I've never been to Naples, but I'm told (and believe) that Sottocasa generally does justice to the original. \n\nThe stars decline a bit for value and no reasonable way to augment the dining experience without having to make a second stop at an ATM. They use top ingredients, so I get that the pies are going to be expensive. Most are in the $16 to $20 range. Each pie is cut into 4 slices. The whole pie appears to be the equivalent of less than 2 slices of 'regular' NY pizza (Thank you to Mr. Berger; my 10th grade geometry teacher) which means that for an average eater, a half pie may not do it. (and to those of you food snobs who are so offended by me daring to compare original Neapolitan pizza to lowly NY pizzeria slices...bite me).   \n\nSo, I'm OK with the $16 pie...even if it's a $16 pie for each person...it's good stuff. But beyond that, the prices remain stratospheric. I like beer with my pizza (again, the snobs can bite me) and there's one beer on the menu that's $5 or so. The rest are as much as some of the pies. I didn't check the prices, but they seemed to have a nice selection of wine...and I'll bet that the price structure is similar. All that means that If I wanted to come here and really enjoy a meal of a pie and a couple of drinks (and not limit myself due to pricing), I'd have to spend $40 to $60 with tax and tip...and that's a bit high for pizza and beer. Even really good pizza and good beer.  \n\nBesides pricing, the hours are OK. The crowd is fine but as one reviewer noted, the place gets kinda Chuck E Cheeseish at dinner time. Normally not a concern for me but at this price level, I don't want to hear Tristan's mom telling him to shush every 2 minutes.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Comfortable, new space that has  a back yard for warmer days managed by a very friendly and welcoming italian crew. \n  Went there last night had a bottle of Pinot  Nero, arugula salad and 2 pizzas: Regginella and Diavola. The salad was plenty for 2. It was simple and fresh. We ate it all except artichoke pieces which  where non-chewable.\n   Both pizzas tasted like good quality regular  European Italian style pizza. We enjoyed both of them. The wine tasted soft and velvety and went well with our food.\n \n Stuffed at the end we still had some good expresso and frozen orange sorbet which was a nice, refreshing ending to our meal.\n\n Although it was busy, slightly stuffy and noisy at the end we had great time, felt comfortable sitting, good food and received good hospitality from the restaurant staff on a busy Saturday night. We will come back here anytime.\n\n PS I could never compare Sottocasa to Paly G's. Sottocasa's pizza looks and taste like a real italian pizza to me. Pauly G's pizza (again to me I respect all of the the opinions) is not pizza but some kind of middle eastern lavash or indian naan bread although they bake it in their fancy, special  brick oven.", "author": "Lora. N N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Great crust, really friendly staff, and a cool cured meat and cheese platter.  I've gone a few times now and the place has been pretty consistent from time to time.  The have a few interesting selections of beers as well.", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "First time visiting NY and we had to have pizza. However, we pride ourselves in finding the smaller places the hotels don't tell you about and found ourselves at Sottocasa, a mere 5 minute walk from the hotel.\nThe atmosphere is comfortable like a warm sweater knitted by your favorite Aunt. It's small but not crowded, dim but not dark. A place you want to stay a bit.\nThe food...I'm having trouble coming up with an adequate word, but Thesaurus.com gives me \"Miraculous\" when I type \"remarkable\" so I'll go with that. The food is miraculous. I got a salad to start with artichoke hearts, arugula and tomatoes with a lemon/olive oil dressing that gave the fresh greens and even fresher taste. It really complemented the pizza and upgraded my meal to \"healthy\" in my book.\nThe pizza we split (they may tell you its a personal pie however it was perfect for two) was the Prosciutto Crudo; tomatoes, mozzarella, prosciutto di parma and basil. I swear its like it melted in my mouth. It was so yummy in my tummy. I'd like to try their other pies and it's worth a plane ticket to do so.\nOnly reason it's 4 and not 5 is because I've only been once and I wish they had more beer choices, very very minor thing since next time I plan to try the wine.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "After one experience, I can say with little doubt that this place is now my go-to spot for pizza in the neighborhood.  I ordered the \"Laura\" and the \"Radicchio\" pies for delivery.  They arrived quickly and they tasted perfect.  The crust was wonderful.  The ingredient combos were inventive, but still satisfy traditional tastes.  Overall, I think this place is on par with Motorino and all of the other new pizza darlings getting raves in the Times and NY mag.  And if it's this good when delivered, I can't wait to have it at the restaurant!!    My only misgiving is that its a bit pricey.  But I'll be  a regular either way.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "very good pizza, although in the neighborhood I prefer Luzzo's for decor.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "if there was an option to do half stars, I'd do 4 1/2... \n\nwe had the Regginella, but we preferred the Popeye.\n\nthe perfect start to a new year.", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "My dinner companion and I could hardly talk to one another we were so ravenously devouring our pizza - the special: brussel sprouts, smoked mozzarella, gorgonzola, ricotta with a bit of truffle oil...the crust was perfectly cooked with a hint of the open fire. It was unbelievably good. The arugula salad we set the tone - fresh, flavorful and delicious. We can't wait to go back.", "author": "Elisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Delicious food, honest gourmet preparations. Ambiance is simple cafe style. Didn't give 5 stars as i found it slightly over priced.", "author": "Devang J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Good pizza and worth another visit. Nice atmosphere in the main room - brick walls, low ceiling, wooden beams - and pleasant service. They have outdoor seating in the back but, unfortunately, it is encased in glass and looked a little claustrophobic. I sat at the bar and ordered the sausage pizza. It had a nice chewy crust and a complementary - not overwhelming - amount of mozzarella, sausage and tomato sauce. Its not a crispy pizza and needs to be eaten with a knife and fork but I enjoyed it. The bill for the pizza and a glass of Chardonnay was $21 before tax/tip.", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Great pizza made by a group of Italian owners from different regions of Italy.", "author": "Alf O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This place is my favorite in the whole neighborhood, and that says a lot with places like Lucali, Sam's and Enoteca on Court nearby. The service is great, the diavola pizza is absurdly good, and the price is in-line with what you get for the product. Some interesting, albeit a bit expensive Italian beer options on the menu. My only complaint is that a chunk of the seating is at a big communal table, which can detract from the experience a bit if you're sitting next to a loud group. Otherwise, it's a great atmosphere with a great dinner.", "author": "Matthew F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}