{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "Sotto casa is my new favorite pizza places in the neighborhood.  The staff is nice and accommodating without being overbearing. They seem to want you to enjoy your dining experience while getting everything that you need.  The place always seems to be filled with Italians too which is a good sign to me.  The food is delicious and fresh tasting. I can't go without getting the rosemary focaccia which is essentially pizza dough with rosemary and sea salt on it- so good. The spinach salad is a favorite and any pizza with the hot soppressata.  I am a pizza lover and this place is fantastic!", "author": "sarah m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "Best pizza alla napoletana in nyc. And I stop here with my review, guaglio'.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "I went to Sottocasa for the first time Friday night.  As with most places in Brooklyn, it is small and somewhat cramped.  But that's Brooklyn.\n\nThe are many choices of pizza and I found that one is enough for two, especially if you have an appetizer.  Although the pizza was delicious, it was a bit on the cold side and the Gorgonzola was lost with the other ingredients.  The pizza was on the table within 5 minutes of ordering it, making me feel a little rushed.  \n\nWe were a party of six and were in and out before one hour.  When we arrived we were seated immediately.  We arrived around 6:30-7:00 and by the time we left, there was a wait for a table.  \n\nYes, the pizza was good and I would give it another try.  I would give it a 3.5 but I can't and yet a 3 would be too low for the first time.  Hence, the 4 star rating.\n\n.", "author": "Argante C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "I wasn't in the best mood before coming here and this place didn't really make it any better. Maybe I was expecting more due to the amazing Yelp reviews. Cute atmosphere, nice service, good wine and fresh ingredients but overall, the food was uninspiring.", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Delicious \"neighborhood\" pizza in Brooklyn that would be the best artisan pizza in town in any other city in the U.S.", "author": "Deborah N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Pretty solid pizza place. It has all of the features of great pizza--fresh ingredients, tasty sauce, thin crust, etc. The place is nice and the service is wonderful. The location is very convenient to so many means of transportation and the delivery is always prompt. I love that they have classic mini glass coke bottles and the tiramisu is authentic and delicious. I recommend the pie with truffle spread and prosciutto.", "author": "Francisco G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Best Pizza in BoCoCa and they deliver- fast!\nOrdered two pizzas and got them within 10minutes. They are extremely friendly and the ingredients are really fresh. Finally! Will order from them always.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "The best pizza in Brooklyn? I think so. Great staff, nice outdoor garden, and the tiramisu is amazing. But the pizza is the reason I come back once a month at least -- delicious ingredients, simple, surprising combinations, a tangy, chewy, charry dough...need I go on?", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "I had the verdure pizza, the toppings were great, I liked the crust, and the sauce was good. I did take out, so by the time I got back the cheese was a bit too chewy, and the pizza had quite a bit of grease on it. Nevertheless, the staff was very nice and it is a pretty authentic place. Pricewise it was a little expensive, but it is New York!", "author": "Val W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "The pizza here is amazing--especially the crust which comes out crispy and hot. The service is fast and friendly and they h ave a good wine selection.", "author": "Robert P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Great place. Really enjoyed the pizza and cappuccino.  It's very child friendly as well.  Will definitely swing by again soon.  Only negative is that pizzas are really just for one person.", "author": "Martin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "Yesterday with a couple of friends we spotted this pizzeria and decided to give it a try. Talk about serendipity...this place is awesome!\nFirst surprise: they seated us  in a nice backyard with big wooden tables; as long as the climate allows it, I love to have dinner under the stars.\nSecond surprise: the menu is attractive but fairly short, and that means they're serious about freshness and high quality.\nThird surprise: I could actually smell the wood from the wood fire in my pizza!! I can't even remember when was the last time I tasted something like that.\nI only regret I couldn't have a beer because they're still waiting for the liquor licence, but as everything else was so amazing, I feel good with rating the place with 5 stars.", "author": "nana n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "We get takeout from here. So there is no being swayed by ambiance or staff kindness. The pizza is fine. It's usually undercooked and the toppings are a bit raw. The dough is too gummy because it hasn't been left in the oven long enough. The artichokes seem canned. The ham is not the highest quality. Not the lowest quality either. It's our go to delivery in the area but far far from the best pizza I have ever had. They are also very small pies. Two people need to order two pies. These reviews in general seem like they would mismanage expectations about the pizza. It's good. Not transcendent. But good.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "We came here based off of the positive reviews we found on here. I really wanted To like this place and say I discovered a gem. But we were so underwhelmed. The arugula salad was dry and tasted like grass. Barely any dressing. And the margherita pizza was bland and kind of soggy! What a bummer. The staff was nice even though we felt rushed because a bigger party was waiting for our table. Unfortunately we won't come back.", "author": "T Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Everyone is commenting on how it's authentic NY Pizza.  After experiencing it for the first time because of the great Yelp reviews I would have to best compare it to Authentic Italian Pizza.  The several Pizza's we had here today reminded me of the pizza I had when I visited Rome and Sicily.  Excellent quality and care in preparation.  Keep up the great work!!  Ciao!", "author": "William P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Gonna keep this short and sweet.\nWhen I first saw the Yelp reviews, I thought they were fake.\nThey are not.\nThis is the most amazing pizza, EVER.", "author": "Anne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "We frequent this place once a week at this point.  Started on a Friday night, and went back that Sunday for brunch!  We started with the foccacia and olives and the arugula salad.  The bread is really special with its soft, doughy center yet crisp outer layer.  With the salt and toasted rosemary sprigs and olive oil, it is scrumptous.  \n\nSince our 5 or 6 visits so far, we have tasted many pizzas and all of them have been super tasty.   I couldn't pick a favorite. They always have a special and all the ingredients are super fresh.   We can't seem to get away from the spinaci salad though with it's scoops of creamy ricotta.  The tiramisu is the perfect ending for something a little sweet afterwards.  \n\nWe love the staff there and the place is very cute also.  Go there.  Do it.", "author": "emily m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Outstanding pizza. Managers and staff are Italian, and they are true professionals. Lovely patio in the back.", "author": "Mika N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "This place is really cute. It is small but has a very intimate and attractive decor. Food was good too. The table had a variety of different pizzas, which everyone liked. Service was good. Wine was plentiful. No real complaints. I will be back.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Great, reliable local pizza and salads.  The tuna and chickpea salad is DELICIOUS. Great wine.  I got a bad glass and they replaced it instantly on the house - I was really impressed.  They didn't need to comp my wine!  I'll definitely be back.", "author": "Rebecca E."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}