{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "Pros:\n-Tip notch service.\n-Cute outdoor seating in the back.\n-Good portions for the price.\n\nCons:\n-Pizza was too watery. We tried four different pizzas and the only one that wasn't watery was the brussels sprouts pizza.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "Our pizza was floppy and wet instead of crispy the way I like it.  One pizza I can excuse due to the fresh tomato toppings, but the other pizza had no such excuse.   \n\nStaff was friendly, but the way they presented the bill was tacky. There was no check folder or tray or anything...just a tiny register receipt with a clothespin clamped on it.", "author": "Etz E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "Came here on a late Saturday afternoon. Service was great- we were greeted and seated right away in their back greenhouse area. Very cozy, bright and quiet. Had the house beer, which was perfect for the crisp weather that day, I highly recommend trying the house amber ale. So hard to decide what to get, but you truly can't go wrong - so order whatever you want without pizza FOMO. We had the Laura and the Burrata. Both were addicting and so fresh tasting. Only 5 minutes went by from the time we ordered to the time piping hot pizza was sitting in front of us. We also ordered the focaccia, which was chewy and delicious even when I reheated it the next day. Will definitely be going back here to try every single pizza they offer!", "author": "Noah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "We come here all the time when we want delicious easy dinner.  I've also had their pizzas at their remote temp outpost in Industry City/Sunset Park.  Sometimes we will get takeout, but it's obv the best when it's fresh out the oven.  I always get the Valdostana with fontina prosciutto and sage - insane.  My fiancé gets the Diavola with hot soppressata olives and basil.  The Autunno white pizza with Brussels sprouts is also a favorite.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "We loved this place! Pizza is absolutely divine and delicious, I dream about the day we return to sample this delight! It is totally worth the wait and highly recommend to anyone who is visiting NYC and wants to venture somewhere. \n\nWe ordered salad and two separate pizzas - it is quite tight, can be a bit awkward if you're wedged between two couples on their first date.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Best pizza experience of NYC!  My fiance and I had a splendid date night last night and truly enjoyed Sottocasa's ambiance and staff in addition to the crisp, delicious Neopolitan style pizza!  They have a wonderful bottle beer list in addition to wine list!  Don't miss trying the Tartufata (mushrooms, light truffle spread, prosciutto di parma) or the Boscaiola (mushrooms, gorgonzola, spicy italian sausage).  Crisp, light dough with excellent flavor and the toppings were such great pairings.  If I had to pick one pizza over the other it would be the Boscaiola just because I loved the spiciness of their hot salsiccia :)  Don't forget to top off your meal with a wonderful cappuccino and tiramisu.\n\nThe staff are amazingly friendly and attentive!  Thank you Mari, Samuelle, and the rest of the staff for making our first night at SottoCassa as good as it gets!  We can't wait to go back for more.", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Awesome! Neopolitan pizza done right. Rustic spot a few blocks from the Barclays center.  I am so glad we tried this spot last night. We stuck to the pizza and ordered, I think, 5 different pies. All were wonderful. My favorites included \"The Laura\" (tomatoes, mozz, speck, marscapone and rosemary) and the Salsiccia (tomatoes, mozz, hot sausage and basil). Extremely welcoming place that really made you feel at home. Our waiter Ricardo was top notch and the owner Luca was great. You could really see his passion for making Neopolitan pizza. They are using top notch ingredients and it definitely shows. Great selection of wine and beer. I highly recommend checking this place out. It is about a 10 minute walk from Atlantic Terminal, Barclays Center.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "Here again this evening and still solid as always. Fast, friendly service and excellent pizza. You can't lose!", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "This may be the best Pizza in New York City. Definitely one of Brooklyn's best kept secrets. \n\nIt is definitely better than the more \"well-known\" hot-spots such as motorino and roberta's. The pizza's are in true Neapolitan style with just a few incredibly high-quality ingredients.\n\nTheir wood-fired oven operates at 1000° F, and cooks pizzas in about a minute. This gives them that great slightly charred and bubbly crust.\n\nYou can't go wrong with the Salsiccia (sausage).\n\nThey also have fantastic Italian micro-brews. They only other place I've seen their kind of selection is at BierKraft (retail only).\n\nTheir wine list is also fantastic, giving diners a nice selection of reasonably priced very solid Italian wines. Don't miss the Tocai from Angoris.\n\nThe people who run it are Italian (from the north I believe). Always a good place to brush up on my Italian banter.", "author": "Saul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Sottocasa is perfection, and perhaps my favorite pizza-on-a-Friday-night in the area (and I know a lot about pizza-on-a-Friday-night in the area, because my husband and I eat pizza, every Friday night, in the area).  The suggested combinations are bangarang, but they dont mind if you add or omit here or there.  I, personally, would put capers on just about all of their pizzas but that is just me!  The price point it spot on, the ambiance is casual, and their estimate of the appropriate amount of pizza to order for one or two people (or more) is as close to accurate as it gets, which I appreciate because it is really obnixious when somebody suggests my husband and I can split a too-small pie, or when I walk out paying $40 and with 6 days of leftovers on a single pie because the server or menu said it was a perfect size for one.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Great food, but came in at 10pm, and they watched our table like halks in anticipation of our departure. Minus two stars for abhorrent service.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "Came here on a Sunday evening and there was not a wait. We had the appetizer meat and cheese board which came with a Rosemary flatbread (amazing). The atmosphere was really nice, but was a little too bright for a true date spot. I want to note that they do not have air conditioning which made it a little uncomfortable to sit for a while on a hot summer day. Not to mention they have an open kitchen pizza oven. Would definitely come here again on a cooler day.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Me and my wife were walking the Fulton area looking for food getting hungrier by the minute, getting desperate for something good, we decided on pizza, quick search pulled up this place, thinking that it \"will do\" we walked in and immediately realized by the smells that we had found an amazing place. And when that magic brick oven pizza came to our table, we were sold, perfect crust, spicy italian sausage, basil, Gorgonzola all came together perfectly. Along with the house chianti and the beats with whipped goat cheese (perfect delicate balance) to the robust pizza flavors. Add all of that to a very nice little space and we have a winner. When we want hipster pizza we go to Roberta's, when we want classic italian, we'll be back here! 10's all around.", "author": "Jesse G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "As a morbidly obese american, and I was disgusted by the fact that this pizza would struggle to feed a family of 50 somalians. \n\nWhen I order a pizza, I want it to be so large that I am not hungry for at least 20 minutes. I'm on a diet, and my new goal is to eat only 3 tubs of icecream a day, which means I've got to find food that stops my hunger cravings for longer periods.\n\nMy asian girlfriend, whose name I cannot quite pronounce, rubbed her petite tummy and nodded her smiling head many times whilst eating the small potion she stole when I was busy wiping my pre-eat sweat from my face, so I think she really liked it.\n\nIn short, if you have refined, cultured taste and curiously don't eat like a Real American, go here. If you want a place where you can chow down like a chow hound in chow town, chow elsewhere.", "author": "Andrew I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "First time at Sottocasa last night. This quaint spot is the best place for a salad with the freshest ingredients and homemade pizza. My friend and I sat at the communal table although there were seats available at single tables. I loved the set up. \n\nWe shared the delicious Rughetta salad ( artichokes, shaved parmesan and lemon evoo) minus the cherry tomatoes. We also ordered the Barbabietole  (beets, apples and whipped goat cheese). Then... we ordered the Verdure pizza which was light, fresh and awesome!!\n\nThe prices were perfect. I will definitely be back.", "author": "Kimmi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-16", "description": "This is a challenging review to write because the person who sent me told me it would be the best pizza in the city, I may have gone in with my expectations set too high. Oh, that person is only in sixth grade but he is from Italy! :-)\n\nThe restaurant is very nicely decorated with a backyard - always an added plus - and one of the most friendly wait staffs around. Also one of the owners are usually (if not always) working at the restaurant which ensures high quality in every area. The menu is basically pizza which is not a bad thing but it would be nice to add a few other options. \n\nWe began with a Rughetta (arugula) salad which was plentiful and then split a Margherita pizza because we could not agree on what toppings to add (and the restaurant won't make a pizza with 1/2 orders of two different toppings). \n\nAfter dinner we were split on the quality of the pizza. I liked the crust but my companion was not overly impressed. The pizza itself was made from fresh ingredients but was almost too light beause we both left hungry! I would give Sottocasa 4 stars but my companion whose opinion I do take into consideration to make my reviews a bit more balanced, felt no higher than a 3...thus 3.5 with a recommendation that if you are looking for authentic Neopolitan pizza in a nicely decorated restaurant with great service, give Scottocasa a try!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "I had the Boscaiola.  What a fantastic little pie.  Fresh ingredients. Crust charred perfectly.  And some good wine to go with it. I think the owners are brothers.  Really nice guys - from Italy. What a surprise. :/.", "author": "Jack S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Top level pizza brought to you by an Italian staff. Nice salads, excellent coffee and a good vibe. Together with Barboncino the best Italian pizza in Brooklyn!", "author": "Lars H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "I've had the pleasure to eat at Sottocass 6 times now, and the food has been consistently amazing, the entire staff consistently warm and welcoming.  The open pizza kitchen is a show unto itself, and the pizza chefs' obvious passion for their craft is evident when you take your first bite.  \n\nSignificant update: they now serve wine and beer.  I haven't paid much attention to the beer selection, but the wine list appears to be thoughtfully selected and reasonably priced.  \n\nBut most of all, the pies are just so damn good.  I can hardly believe my luck to have this place just around the corner.  It was a natural choice for my birthday dinner (the day after Thanksgiving).  Everyone in our 12-person group left as smitten as I am every time I go there.  \n\nThey also deliver, but if you have the time, it's really worth it to sit down in the cozy dining room and let yourself be doted upon by the genial Italian staff.  \n\nOn our last visit this past weekend, for the first time, there was a brief (10 minutes?) wait for a table.  This is not even a complaint, however.  First of all, it's amazing the wait wasn't longer, and the minutes passed quickly while we enjoyed a glass of prosecco at the bar.", "author": "Anne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Perfect place for a salad, pizza and a glass of Italian wine.\n\nRoom:\nsmall, simple, rustic decor. \n\nFood: \n-salads are big; we got a few for the table and shared them.\n-pizza was great! The crust was thin and soft towards the middle and chewy-bready at the outside. We had the Margherita, Popeye, and the Quattro Stagioni. Lots of fresh ingredients and the tomato sauce was good.\n\nService: \n-friendly, attentive + they all spoke Italian. They did not bring the check until we asked for it, so you don't feel like you are being pushed out the door.\n\nWine:\nGood Italian wines  and the prices were reasonable.", "author": "Jennifer S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}