{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "The pizza is amazing! Delicious ingredients, simple and surprising combinations!!\n\nVery good", "author": "Daniele Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "3.5 stars...\n\n SottoCasa is a romantic little pizzeria that's very easily missed unless you're looking for it. They're located on Atlantic, steps away from Smith and steps below the sidewalk level. In addition to their indoor seating they also have a large back patio but unfortunately it was too cold outside when I was here. Their hours are pretty selective so make sure to check if they're open before coming, especially if it's for lunch.\n\n The pizzas are large individual sized and mostly run $11-16 each. I got the Salsiccia (hot italian sausage and basil), and my girlfriend got the Prosciutto Crudo (proscutto and basil). The freshness of the flavors was really apparent and everything had great flavor to it. Unfortunately they skimped a bit on the basil on both but the amount of meat was great. My only really issue is that their pizzas are limp and impossible to eat without literally folding it or eating it with silverware. I once saw Anthony Bourdain on TV eat pizza at a very traditional place in Naples Italy which was just like this so I don't question the pizza's authenticity. I do however believe that a thin crust pizza, especially in a nice pizzeria in NYC that uses a brick oven, should come out crispy with a little char where the ingredients don't slip right off the slices. It's for that reason alone that I wouldn't put this on my short list of places to come back to for pizza.\n\n Don't get me wrong though, the service and hospitality was great, and the flavors were wonderful. It's a nice place but it's just a little lacking behind places like Lucali (1 stop away).", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "What a lovely little place near the corner of Atlantic Ave. and Smith St.\n\nI went there with my girlfriend after walking by it one night, noting its name, and searching it online. It was very no frills, and I wasn't even sure if it was open for business yet. We were excited at the idea of a new pizza place in the area, because pizza's one of those things we're pretty sure is about as necessary as, I don't know. Pants?\n\nAnyway, when we first went, they hadn't had their liquor license yet (more on that in a second), but they were ready to serve their awesome custom pizzas. And awesome doesn't even begin to cover it. Their Regginella pizza, with its fresh cut tomatoes and buffalo mozzarella, was a delight, and the Popeye (with ricotta) was outstanding.\n\nSo far, so good.\n\nWe went back there last night after having difficulty figuring out what we wanted for dinner. Pizza, as should be the case with everybody, is the default choice when undecided on dinner, and Sottocasa delivered again.\n\nThe foccacia bread was tasty, if not slightly too salty, and the Regginella tasted even better than on our first visit. She had a glass of white wine and I had their Italian lager, Menabrea, and both were delicious.\n\nBut forget all that, because tiramisu. I don't know what I did to deserve discovering something so delicious, but remind me to keep doing it, because it was incredible. When you go, I highly recommend the two pizzas I mentioned, but you should not be allowed to leave unless you have the tiramisu. It is so $\u0026#)ing good. Seriously. I wish I had some right now.\n\nI'd bathe in it.\n\nI'll stop now. \n\nNone of this is even to mention the atmosphere, which is just so very laid back and pleasant. It's just an overall very nice place.\n\nGO HERE.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Great summer meal!  Shared a pizza, salad, and small carafe of sangria with my daughter.  Finished with lemon sorbetto for dessert. All delicious.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Amazing.  Went here for lunch at the midpoint of a bike ride from Queens. This pizza was unbelievably delicious. We had the burrata and the laura.  Both were fantastic.  I can't wait to come here again.  Wish it was closer though!", "author": "M A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "Some of the best pizza I've ever had - right up there with Keste and Forcella. I went with my fiance to check out the menu before signing the contract to host our rehearsal dinner here, and I'm SO glad we did. We had the Rughetta salad - fresh, light, and super flavorful. I got the Prosciutto Crudo pizza; husband to be had the Salsiccia. I'd like to say we were not pigs and had left overs - but no. We inhaled every bite of it. Then the owner surprised us and brought us a tiramisu on the house, which was the lightest, creamiest tiramisu I've ever had. I'm now facing the classic condrum upon my return: Stuff my face the way I want to on this pizza from heaven, or fit in the white dress the next day.", "author": "Karla F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "The Calzone was so good. Small parts of our pizza were burnt. I don't like the taste of burnt pizza. The pizza with the artichoke was okay. I prefer more flavor in my pizza. I liked the pizza that had the spices. The decor was lovely and I liked the waiters/waitresses. Nice bathroom. But taste-wise, I give it 3 stars.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "Wow. This pizza is amazing. The crust is like biting into heaven - chewy, yet fluffy, yet crunchy - dipped in a little olive oil after you have polished off the rest of your classic Margherita pizza, or sausage pie, or verdure, perhaps - there is almost nothing better. Except the Nutella pie, which makes you feel as if you have actually died and gone to heaven.\n\nThe ambiance is great for a date, family get-together, or solo night in the neighborhood. Staff is friendly. Selection of imported Italian beers is interesting and tasty. Great place to sit out back at a picnic table and enjoy an all around awesome dining experience.\n\nBut again, it is the pizza, obviously, that makes this place special - YUM.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Awesome pizza, cute/fun/romantic restaurant, and really nice service. I've tried almost all of the pizzas here and you really can't go wrong. Try one of the interesting draft beers to go along with it and you're in for a great night. The tables in back are in an atrium-like space.", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "DELICIOUS. The pizza here is fantastic. The place is low key, and not pretentious, like many of the places in the neighborhood are getting to be. I've been going to this place for over 5 years, and it's still good as ever.", "author": "Ms. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "Wow. The Laura Pizza. The Fresco calzone. Amazing. Food is fresh and comes out quick.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Last night was my first trip to Sottocasa and I'm already thinking about what to get the next time I go...\n\nLet me just get this out of the way. I. LOVE. PIZZA. I love trying different kinds and new places. I could easily eat it everyday and the pizza at Sottocasa is no exception. The crust is thin yet chewy and has that perfect char that comes from a serious oven. The ingredients are fresh and compliment each other perfectly. I loved their sauce, light and slightly sweet. I had the \"Laura\" and it was so good- fresh mozzerella, speck (the new love of my life), mascarpone and rosemary. I had a bite of my friend's pizza, which was one of the specials and I immediately had to try it at the mention of the magic word: \"truffles\". We split a great Italian IPA and I'm interested in trying some of their other specially chosen beers and wines. Although we were absolutely stuffed, we could not turn down the refreshing orange sorbet that was served in a hollowed out, frozen orange. \n\nSottocasa has turned pizza into the ultimate comfort food and it is only further enhanced by the cozy, inviting decor and atmosphere. White exposed brick, hardwood floors, flickering candlelight and an eclectic ensemble of chairs creates a warm space that you are reluctant to leave. From the looks of the other patrons, this has quickly become a neighborhood favorite drawing families, couples, and friends. The staff is on point, making sure everyone is taken care of at all times. It's definitely a team effort at Sottocasa and it shows. Grazie per una grande notte!", "author": "Colleen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Been here many times. Always consistent. great pizza thats perfectly cooked. Reasonably priced and authentic. Im a fan", "author": "mark s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "We just finished dinner here. Fabulous, authentic Italian pizza. Lovely service. Warm, cozy atmosphere. \n\nSo happy to finally have great pizza in the neighborhood!!!", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-17", "description": "Service, fine; no wait at 8:00PM on a Friday, big plus.  Ingredients, great.\n\nCrust -- soggy!  I ordered the Diavola and when it arrived, there was a puddle of liquid slopping across the top of it.  It soaked into the pizza and sogged up the middle 40% of the pizza.\n\nYeah yeah, it's Neapolitan -- Roberta's, the darling of the NYTimes and all foodies, has the same problem of soggy crust.  I get it.  The mozza is fresh.  The tomatoes are for real.  Still, I want to be able to pick up my pizza and eat it.  Wet crust, big no.\n\n(Hubby got the $20 special truffle pizza with prosciutto crudo -- less soggy.)\n\nBut as I said, the ingredients are terrific, and the ambiance is fine.  Just be prepped for soggy crust.", "author": "midge j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Went with a group of six.\nAs opposed to splitting a pizza everyone went solo. \nWine selection was good. \nEnvironment was open and airy and they had outside seating if you want. \nWith so many of us we didn't notice if the wait for the food was long as the wine was flowing. \nPizza was good and the ingredients were fresh and you can tell they are quite pleased and concerned with the quality they serve. \nDefinitely a nice neighborhood spot.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "We arrived when it was storming, and sat in the outdoor porch area which is enclosed sort of like a greenhouse. The ambience was perfect, the pizza amazing. I don't know how much more I can add that the other yelpers didn't about the food.", "author": "Shauta M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "I moved to a new apartment about six months ago and while it is in the same general vicinity as my old apartment there are a number of restaurants in my new neighborhood that I had never tried before- Sottocasa being one of them. I have now been here many times and has become one of my favorite restaurants in the neighborhood!\n\nFirst of all this restaurant is adorable. It feels like you are walking into a restaurant in Italy. They also have a covered patio, which I definitely plan to utilize if it ever gets warm!  Also, everyone that works here is so friendly-they are also very knowledgeable about the food and give really great recommendations if you are struggling to decide between a couple of options.\n\nNow for the food...for antipasto, I have tried both the insalatina and the prosciutto and mozzarella. The insalatina was very good-very simple, but it was nice to balance the rest of the meal with a simple, green salad.   The prosciutto and mozzarella were very good as well-the mozzarella was so fresh. The prosciutto was a tad salty, but I like my food on the saltier side so I didn't mind. \n\nThe pizzas I have tried-the Burrata, Diavola, Laura, and Prosciutto Crudo-were all vey good. If you like burrata cheese, the burrata is wonderful. The other three are fairly similar, but with different meats-my favorite of the three is the Diavola. You really can't go wrong with any of the menu options though-I can't wait to try some of the others. \n\nThe wine here is also very good and reasonably priced. \n\nOh one other thing, my boyfriend and I went here for dessert and a nightcap once and got the nutella pizza which was amazing (and I don't even like chocolate that much). \n\nAll in all this place is truly great!", "author": "Molly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "This is a lovely new place just opened on Atlantic. Staff are all really friendly and attentive.\n\nThe menu is simple but delicious - just good pizzas and salads.  We had the verdure and the parmigiana pizzas, a good size with lots of tasty toppings.  The pizzas are all cooked in a wood burning oven. The chef came out to check that we were enjoying our meal.\n\nThey have a cute yard out the back where we sat, enjoying one of the last few warm evenings this summer.\n\nThey are still waiting for their alcohol license but should get it soon they said. We look forward to going back soon and saving room for the nutella pizza dessert!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "Best pizza i have had in a long time. The ingredients are all fresh and the wooden oven makes the crust just perfect. Keep it up!", "author": "Martin F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}