{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Excellent and affordable pizza, salads, sangria and capuchino. Friendly and fast service. The place to go for a quiet date, a quiet afternoon with friends .", "author": "Angela G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Husband and I stopped for lunch at Sottocasa pizzeria while house hunting in the city. I ordered a Tartufata with truffle  spread and mushroom. I still can't believe the spread was homemade, that's  rare! My husband got the Valdostana, instead which was a little watery to my taste, but overall still tasted great. The back patio where we sat was a green house transformed into beautiful and cozy dining area. We ended our meal with an Italian style espresso shot and a glass of amaro. Unfortunately they don't carry my favorite one (Amaro Montenegro) but our server offered us a sip of their Anis liquor instead. I am not a fun of anis but my husband enjoyed it. \nGreat service too, the hostess was friendly and our server was Italian, very acknowledged indeed.\n\nFresh and tasty ingredients, soft, airy and yet crunchy dough  to die for.", "author": "Soily G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I cannot say enough great things about this restaurant.  They take their craft seriously.  Minimal ingredients, maximum quality.  An eclectic little restaurant (with outdoor seating!) that provides gourmet individual pizza and a reasonable price.  If you are into wines, i highly recommend you follow the suggestions of your waiter.  He's got an very good hold of what wine will go with the pizza as well as taking into consideration what you like and look for in a wine.\n\nFrom the white painted brick walls to the eclectic seating, this restaurant will bring me back again and again.", "author": "Brett W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Delicious authentic pizza and homemade burrata on weekends. Highly recommend the special - this evening was burrata, roasted asparagus and pancetta", "author": "Teri K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "Tried this place for the first time last night. We ordered and picked up. Pizza was good. Salad was good. But then I found a big dead insect in my salad. Poor little insect. Rest In Peace. Maybe it was the dressing he drowned in? Anyway, not eating here again. I know gross things happen to our food in kitchens everywhere but this was too much!", "author": "Modemme X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Best pizza and wine in a cute spot, gets busy on weekends. Great backyard and does events", "author": "Geena D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Solid neapolitan pizza here. Nothing particularly amazing about the place or pizza to have us hurrying back but if you're a neapolitan pizza fan you really can't go wrong here.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Ooh yum. Glad to have stumbled on this gem during a recent daytime trip to old BK. \n\nThe arugula salad was perfect with the right amount of cheese, olive oil and lemon. The two pies we got were eaten up quickly - a margherita and a sausage. Our daughter loved playing with the little retro cash registers while we waited. Loved the decor and that all the chairs were different. Would definitely come back!", "author": "Katherine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "VEGETARIAN, GLUTEN FREE REVIEW:\n\nBest Gluten Free pizza in Brooklyn!!\n\nI've been gluten free for years and pizza is a struggle. Some places have crust that's like a cracker, some use crummy frozen crust, some burn the heck out of it... The first time I opened the pizza box I thought they forgot to give me gluten free crust. You know when you order gluten free items and they look so legit it makes you wonder? But it was the gluten free pizza. The crust was like REAL PIZZA CRUST. On top of that, it was delicious.\n\nDefinitely recommend Sottocasa for gluten free pizza! I only wish they were open for lunch!", "author": "Liz W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "You want authentic Italian pizza? In Brooklyn? In an intimate setting? \nSottocasa is your place for Italian pizza.\n\nThe reason why I say Italian style because this place doesn't serve slices. This is a brick oven pizza restaurant using the freshest ingredients.\n\nMy college son is home for the holidays and wants pizza. Not just any pizza but pizza made with fresh mozzarella. Authentic Neapolitan pizza. I have Sottocasa bookmarked, lets see how it plays out.\n\nThe 5 of us walk into a very charming and intimate restaurant. We're seating close to the door at the large country French table. \n\nWe ordered a Focaccia and a salad topped with ricotta to get the party started. Everyone is saying what their pizza choices should be, I don't hear what they're saying. I'm here on a mission!\n\nI ordered \"The Laura\" made with fresh tomatoes, mozzarella, mascarpone, speck and rosemary. Oh baby!\nThe pizza is everything they say it is, the Speck (Italian meat) cooked down and tasted almost like bacon, very very decadent.\n\nNow our second choice was \"The Valdostana\" which is tomatoes,mozzarella, fontina, prosciutto di parma and topped with sage. \n\nWhat was brought to our table was not this pizza. Maybe it was a mixture, it's dark inside. what was brought to me was \"The Napoli\" I didn't taste any prosciutto but I did taste anchovies along with tomatoes and mozzarella. \n\nWe were in a rush, my teenager wanted to go to Film Biz Recycling before they closed at 7pm. \n\nWe left and loved what we ate. Next time we'll get it all straight. This is my last review for 2014. \n\nHappy New Year!!!", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Pretty good pizza! Lots of choices and the dessert and appetizers are delicious as well. Pricing is on the steeper end but the pizza is filling and you will have leftovers.", "author": "Akash V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "The pizza was fantastic; so flavorful and delicious. We ordered two pizzas: The special, which was a butternut squash pizza and the burrata pizza. Both were equally amazing. The dough and crust is perfectly chewy, soft and crispy all at the same time. \n\nMy only complaints are that they ran out of tiramisu and the service was not the best. The servers was not very friendly or patient. I felt rushed even though the restaurant was not busy at the time.", "author": "Carolina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Great pizza--very authentic Italian. I had the calzone which was a substantial portion cut into three pieces. Nice ham--coupe have been a tad bit saltier. My friend had the white mushroom pizza with prosciutto. Big four sliced personal pizza, very shroomy and cooked to perfection. Prices were decent for the neighborhood. The covered backyard dining area is adorably trendy and comfy. Nice date spot or just walk in for lunch.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "Can't really make a decision on this place, since I only had 2 slices of pizza...\n\nHOWEVER. The slices I DID have were very soggy! Their saving grace? The flavor. It was glorious flavor. I got mushrooms, sausage \u0026 onions, so my thoughts are that the mushrooms caused the sogginess. \n\nI'll consider coming back, but maybe I'll try another pizza without my beloved mushrooms.", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Best Italian pizza I ever had. \nVery cozy atmosphere, fast service and yummy deserts. \nPlace is not overcrowded and noisy even in Saturday night.\nDefinitely place I will come back.", "author": "Irina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "There's good news and bad news about Sottocasa. \nGood News: They make terrific pizza. Besides offering an assortment of pizzas and antipasti, they make the best gluten-free pizza I've had.\nBad News: It's in Brooklyn and we don't live in Brooklyn. On the other hand, I suppose that could be a good thing, otherwise we'd eat at Sottocasa every week.\n\nMy husband doesn't have the same food sensitives as me, which includes garlic and onion allergies. I love, love their gluten-free Margherita pizza. The dough and sauce are yummy and the Mozzarella and basil are fresh. Since he's lactose intolerant, my husband really likes their Marinara pizza with garlic, basil and oregano (smells good).\n\nWe've introduced friends and relatives (without our allergies) to Sottocasa. They enjoyed their other dishes.  \nPizzas are not sold by the slice. If you can't finish a pie, pack it up to go. It's still delicious the next day (or even two). We arrive early, before it gets crowded. It's not a large place.\n\nFor those who care, Sottocasa serves beer and wine. Since I don't drink, I can't talk about the alcohol. The restaurant is casual and child friendly. Check their website for hours. The closest Brooklyn subway stops are Jay Street-Metro Tech (A, C, F, R trains) and Hoyt-Schermerhorn Streets (A, C, G trains). The pizzeria is a few steps down to the sub-street level of an Atlantic Avenue townhouse. Sottocasa also has a Harlem location. Enjoy.", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Great little pizzeria. Had dinner there last Sunday. Our party of ten were fortunate enough to get a large table almost immediately and sit comfortably. It's not a large place inside so we were in luck! \n\nTheir menu features several great little pizzas. Fresh, tasty ingredients. Well prepared and served piping hot. Whether you like meat on your pizza or prefer nothing but veggies, you have several options. There are other things from which to choose but we all were game to just order several pies and share. That was a great call. NOTE: the Burrata pizza is only available Friday - Sunday and we *just* missed out on it as they ran out of the burrata cheese.\n\nOur server was attentive and helpful with his suggestions on what to order. We probably annoyed him a little with our indecision (thanks to also having 4 kids in our group) but he handled it well.\n\nCheck out this spot when you're in the area.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Most amazing gluten free pizza I've had in my life!!!! Had to eat all the crust it was so delicious. Great staff as well :)", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Yep.  It's as good as they say.\n\nIf you're looking for pizza made by people who love you and want you to be happy, ta-da!\n\nI recently flew halfway across the country for a pizza and a Pink Ale.  \n\nIt was well worth the humiliating experience of security screening at BNA.", "author": "Robby E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "This is a great place to enjoy authentic pizza! The outside appearance wasn't anything at all like how the food tastes! I had the calzone and everyone else in my party had pizzas. Everyone loves their meals. The temperature was a little hot in the dining area but the food was amazing. I would recommend this place to anyone wanting a good meal really fast. My dinner came out within 10 minutes. I would def come back.", "author": "Joshua B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}