{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "So I came here about a week ago, alone because I was in the mood for something new, didn't want to stay home, and my lame-o friends were all hanging out with their significant others...I'm not bitter at all. It was the best decision I could have possibly made! \n\nI was seated at the bar (since I was solo and definitely didn't mind). I had the roasted beet salad to start and it was, well...roasted beets. Lol. That being said, I devoured every single bit of it! I asked the bartender/owner/manager for recommendations on wine with my pizza and they let me sample two different ones so I could choose. I thought that was extremely nice of them (possibly because I've never been somewhere where they serve you a such a generous sample!). I ended up having the Murola Passerina which went deliciously well with...\n\nLa Diavola!!! The most delicious pizza I had ever had! You will see in my picture that I completely destroyed that pizza. The pizza was slightly charred in the outer edges, with a soft middle (some would say mushy, but I think its just a testament to the yummy ingredients coming together). I wanted to somehow replicate that pizza or marry it so I could make little baby pizzas and somehow devour them every single night. Ok... I think I'll stop this review since its become slightly inappropriate and creepy. Lol. \n\nAnyway, come here, have wine and pizza...fall in love!", "author": "Cindy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "This place used to be a solid 4 two-and-a-half years ago. Now it's just about a 3. It used to be atmospheric, and the food was tasty and well-priced for what it was. I paid it a visit yesterday, taking along a friend who was in town, and we were disappointed to see that the beets salad we ordered was a pile of ingredients. Just wet overcooked beets with clumps of cheese, placed on a hidden bed of arugula. There was NO salt, NO pepper, no olive oil, and no discernable dressing. We ordered all the condiments they could spare, and dressed it ourselves. The pizza was still good, thankfully, and still pretty well-priced but the selections hadn't changed in years. There's better in Brooklyn, if not in Boerum Hill.", "author": "S R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Delicious pizza, salad, and loved the beets too! Tiramasu made a great dessert. Very pleasant staff and locale as well. Thank you!", "author": "Stan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "It felt like eating with family!  They care about the food and it shows!!  It is expensive, but is OK for NYC, and the food , wine, quiet space, and service make it worthwhile!", "author": "Steve R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "The other day I realized that I was in a pizza mood.  Now I've almost completely cut pizza out of my diet at this point, and yes by saying that I know I sound like a bitch (all due deference to bitches).  With one small exception, I hadn't had pizza in months.  I'm Italian.  That's a problem.  To rectify this I visited Sottocasa, which was on my pizza hit list.  Being in the basement of a building, the space was small and intimate.  I decided to sit in the backyard, which has an enclosed patio along with some other open air tables.  The servers are all Italian, which I don't mind but actually isn't that big of a plus.  Namely, my server was kind of a douche and not all that knowledgeable about the menu; I thought at first this may have just been the language gap but it definitely wasn't.  For instance he didn't know basic facts like where the ingredients were from, couldn't make a recommendation outside of a clear upsell, and otherwise relied on his accent and being a \"pretty boy\" rather than actually being good at his job.  That might work with some 20-something girl from the Midwest who just moved to Brooklyn because it's \"cool\", but it doesn't do much for me.  I'd take someone of ANY ethnic background who actually knows what they're doing any day of the week.\n\nThey talk a lot about the beer list here, which may be the last place in Brooklyn dominated by Italians.  Italian beers, that is.  I actually wasn't that impressed, as I know a few places with better or comparable lists of Italian beers.  There were some good items to select from even if they price gouge out the ass ($12-$15 per glass).  I grabbed Super by Baladin which was great (very nuanced), and their house ale which was just beer (mediocre).  I got the diavola for my pizza, which is a margherita with hot soppressata and olives.  While some elements of this were good the whole thing fell well short.  In particular the olives were applied with a very heavy hand.  The use of olives and their saltiness to enhance the spice of the soppressata isn't a bad idea but they overshadowed everything else on the pie.  The soppressata was standard and very plentiful, but again this overshadowed some good fresh mozzarella.  The tomatoes were mediocre and were rightly lost in the application.  In addition the end crust was good, but the inner crust was far too thick to take on the characteristic \"wetness\" of a prototypical pizza napoletana.  This means you're eating a thick piece of bread rather than the thin, delicate set of contrasts that mark a great pizza napoletana.  All in all there were far too many things that prevented me from enjoying this pizza.  You'd expect some guys from Napoli to do a much better job.\n\nI'd go back to give Sottocasa another shot if I was with someone who wanted to try it, but I'm not explicitly going to it again.  It's okay, not even close to great.  And with more and more pizzerias opening it just fades quietly into the background.  Luckily the restaurant seems to be well run enough as they have a decent regular customer base; they'll be fine just where they are.  Classic example of an overhyped pizzeria.\n\nEdit (addressing the owner comment): Luca, I'd rather respond to you publicly.  Sounds like you have some problems; in particular you think your customers owe your restaurant something.  Respect is earned not given.  Your pizza was downright mediocre and my experience was subpar.  I've never once flouted my Elite status anywhere for any reason, let alone in your establishment.  Reading it again, I don't have any issue with the verbiage in my review, especially considering it was accurate; if anything I was generous.  I may try to be funny at certain points in the review as that's my writing style, however I think it's clear for anyone reading that I am actually calling out the lack of service I received.  If you don't want to take criticism it's your problem.  I'm knocking this down to 1 star which is where it belongs.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "We have been here twice, and the food, service, and atmosphere is consistently good. There are many menu options, the backyard seating is beautiful, and all the servers are impeccable. \n\nNeapolitan pizza has a soft spot in my heart because I worked as a bartender at a Neapolitan place during college, and got hooked on the pizza. I find it irksome that some reviewers didn't like their pizzas because they were watery or runny in the middle -- it is supposed to be like that, and it even says so on the menu! If you don't like that, ask for it to be cooked well done (which is very difficult to do without charing your entire pizza as it is made in a wood burning oven), or just go to pizza hut. This is real pizza. \n\nWe always plan to hit this place up for dinner on our way to Trader Joe's now, and we can't wait to come back. We need to try ALL the pizzas!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "On our trek for the best pizza in NY, in 6 months of us sampling pizza every Friday night from the 5 boroughs- this is our favorite so far. The crust is delicious, yes, it gets wet quick, but still, so so good. Service and ambiance both above standard. Parked right in front quickly on a Friday night!! If you're looking for great brick oven pizza, give it a try. I got a margarita pizza with arugula. Very good stuff.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Best pizza in Brooklyn.  I've been here twice now and was blown away both times.  It is Naples-style pizza, and there is nothing else quite like it in the City.  They have a special oven in the back, and I don't know what kind of magic they have going on back there, but it is amazing.  I've had the hot soppresata pizza and the italian sausage, both were terrific.  Salads are fresh and delicious here as well.  Can't recommend this place enough.", "author": "David F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Sottocasa (or \"under the house\" - which is fitting for its \"basement\"-esque location) is great place to go family-style on a bunch of personal-sized pizzas. \n\nMy friends and I shared the Tagliere to start, which consisted of some meats, cheeses, and hot/fluffy/seductive focaccia bread. Following that, we devoured the Laura and Burrata pizzas -- both were delicious, but I think the Laura was my favorite. That was definitely enough food for the three of us, and we left very satisfied. \n\nAmbiance was very comfortable and the place felt just the right amount of crowded (we were still able to be seated right away for a Friday night!) The servers were also very attentive, as three of them would come over at different points throughout the meal to see if we needed anything. \n\nIf I were being picky, my only complaint was the glass of wine I ordered felt like it wasn't the most generous pour, but maybe it was the small, stem-less glass that created that illusion. Not sure if I got the most bang for my buck with the wine.\n\nRegardless, I can't wait to come back and try some of these other pizzas!", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "We had the Laura and the Verdure. Both really good, but the Laura is amazing. Only thing is that the knife keeps squeaking on the plates and it's horrible.", "author": "Or L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "The Pizza, the Laura- Oh man that is amazing. Everything else- meh. Arugula Salad I just paid 900% of the cost of a bunch of those bitter greens, and everything does seem way over priced.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "As Usual The best pizza in this area of Brooklyn, great  Work with good selection of Italian Beer!!!\n\nChapeau!!!!", "author": "Alessandro T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Excellent wood fired pizza.  Hot Italian sausage very nice.  Crust done perfectly and not blackened.  Very fast service.  Use premium ingredients.", "author": "Stan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "\"Do you have Shazam on your phone?\" My friend asked, halfway through our thin-crust pizzas. I did, although there was too much noise echoing around this white, subterranean space to pick out the specific waveform. Thankfully, the next song from was from the same artist and this song was definitely by Italian singer Vasco Rossi.\n\n\"E...\" is a saccharine ballad. The video, which I later watched on my phone, involves an attractive model masturbating in a bed while reminiscing about her lover, the paunchy singer, who is wearing wraparound sunglasses and a backwards baseball hat. It's deeply uncool. \n\nSottocassa isn't like that at all. The goofy soundtrack might actually be there to ensure it doesn't tip in an uncomfortable level of pretentiousness. The pizzas and sub-headers are in Italian. The owners have apparently gone to great lengths to bring a long (but expensive) list of Italian microbrews to the States, all to accompany the pies.\n\nThere's an annoying no substitution rule on the pizza. This in practice means that while you can add something to the pizza, you have to pay for each addition, even if there's an ingredient losing. At $16, it's a bit annoying to have to pay an extra buck to swipe garlic for olive on an a sausage pie, but not so much to ruin the experience. \n\nPizzas arrive quickly and right from the oven. They are crisp, with a minimum of char on the crust and plenty of cheese on top. It's very solid and definitely worth including in the Carroll Gardens rotation, no matter who is on the soundtrack.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "I can't say enough good things about this place. Delicious pizza and totally decent service - the wait is never as long as they say it will be (although I do appreciate the over-estimates!!). We ordered a bunch of apps, and they were HUGE! We ended up splitting a pizza because we were full from the appetizers :) Great spot, delicious pizza.", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Stopped by Sottocasa tonight to indulge in some \"my partner is out of town and I'm staying in for the night\" take-out. I was a little alarmed at how many empty tables there were. I love this place. Great people, great food, and \"authentically\" Italian (they really are from Italy; I just hate the word \"authentic\").\n\nI'm willing to start eating there more often to help keep them open, but I can't do it on my own. Eat at Sottocasa! It's great for dates, for friends, for families, etc. And it's a local treasure that's only been around a few years. Young restaurants often have precarious finances. It'd break my heart if a chain whatever moved into that space.", "author": "Frank E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "I thought the pizza here was good, pretty standard wood fired Napoli style. \n\nWhat I liked was their Diavola Pizza, I love sopressata and olives so I knew I couldn't miss with the toppings I got.\n\nThe crust had good flavor and overall I really liked the pizza, my only complaint with all these styles of pizzas are when they use the san marzano  tomatoes it always makes the pizza runny, because of the nature of the sauce, hence a droopy slice. I love a crispy slice.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Hidden gem. Everything is fresh and delicious. High quality ingredients. Friendly and attentive staff. Great little greenhouse area in back. So, if you want a fantastic pizza, while sitting in the sunshine while the faintest breeze bathes you in the scent of fresh rosemary planted outside. THIS is your spot.", "author": "Yvonne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Have heard truly great things about our local pizzeria, so decided to try one for myself at home. They are very upfront about how Neapolitan pizza can deteriorate in the box. Boy, are they right. The pizza had no bite to it at all, just seemed like a sad sorry mess in the box. I will definitely try the pizza at the restaurant - the flavor of my prosciutto crudo pizza was good, though not fantastic (an odd creamy tomato base contributed to the gelatinous nature of the pizza) - but I won't ever do delivery again. I should have taken their own advice...", "author": "Nick A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "So happy I finally checked this place out! The ambiance, service, and food are all wonderful. Perfect for a fun date or catching up with a friend or two. \n\nWe ordered the Laura and the Salsiccia. Both were delicious! The crust was perfectly baked (as you'd expect from that awesome pizza oven). The ricotta flavor on the Laura pie was out of this world and that spicy sausage on the salsiccia was awesome, too. What's keeping me from giving the pizzas 5 stars, however, is how unset and burning hot they were when served. The scorching hot sauce and toppings kept sliding off at first. But after waiting a few minutes for everything to set, all was good. Maybe the chefs should wait a minute or two before serving the pies?\n\nThe other issue keeping me from giving that fifth star: the back patio is quite hot and humid. There is a fan, but when you have an enclosed patio in the summer, you need air conditioning. \n\nOverall, will most certainly be back! Bravo, Scottocasa.", "author": "Shannon G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}