{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Nice place for a casual date night or a more classy after drinks stopover.  Dim lights, rustic wood tables, small enough to feel cozy but not so small that you can't get a table.  Had the meat and cheese plate, really good ricotta, salty meats, and other tasty cheeses.  Comes with a huge flat focaccia, about the size of a pizza.  Slammin'.  Also had a pizza with salty meats, olives, etc.. And it was really good.  Not amazing, but really good.  Pizza crust tasted kind of like an Italian version of a good naan.  Didn't get any salads or other stuff, but everything looks good from what I saw.  Caveat to this review is I had a few drinks before I went so the intoxication makes food taste better meter may have been off kilter.  Left happy.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "I went here last night with friends from Italy after walking over the Brooklyn Bridge.  On the way they kept talking about this cheese that's half mozzarella, half butter called burrata.  We arrived and the space is super nice and comfortable.  There's a really nice outdoor seating area that looks like a glass greenhouse, I recommend sitting back there.  I ordered the \"burrata\" pizza and I understand why they were drooling about it, it is half mozzarella, half butter.  Topped with basil, tomatoes and sea salt, delicious!.  Deserts were also amazing!", "author": "Stasiak B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "I'm thankful that I live two blocks from this place because it's really, really tasty. We've been eating our way through the menu and right now, my favorites are the Diavola and the Laura. \n\nIt has a great atmosphere for a casual night with friends, or a low-key date night. Delivery can take awhile but if you order take out, the pizza is always ready within 10 minutes. The one time it wasn't, they gave us free drinks while we waited! All around, great place.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "There was a wait to get a table for 4 on a Tues at 7:30 pm, so the secret is out!  I think it rivals Motorino, but a lot less heavy on the sauces / cheese.  The crust is fantastic, the atmosphere is great.  Only complaint may be that we sort of lost our waitress after she took the order, but the rest of the service was great and the pizzas came out super fast.  We also got the focaccia / olive plate, which was tasty, but next time I would go for another pizza instead - it's basically the same as the pizza dough.  Definitely will be back.", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "Short review: The pizza took forever to come and when it did, it was burnt on top and soggy on the bottom. Don't waste your time.\n\nLong review: My mother and I ate here on a Saturday around noon. The restaurant is easy to miss on the street because it is at basement level and the sign uses dark colors. The interior was beautiful, but the tables are way too close together. The pizzas are all sold as 11-inch round pies, which seems like a lot for one person, but is just the right amount due to a super-thin crust. The beverage menu only offered beer and wine, so we had to ask if they had anything non-alcoholic. The waiter only suggested a few sodas, even after my mother asked for something non-carbonated, so we were annoyed to see him bring a cup of coffee to another diner only moments later. I ordered foccacia as an appetizer but what I got was burnt, wafer-thin bread with a little rosemary sprinkled on it. It tasted as bad as it looked, so we didn't eat more than two bites. A set of diners seated after us got their pizzas first. My pizza, the Reginella (cherry tomatoes, mozzarella, and basil), arrived next with a few burnt pieces of basil, which I picked off. The pizza tasted good, but thin crust + cherry tomatoes = soggy middle. Another set of diners seated after us got their order, before my mother's Popeye (mozzarella, ricotta, and baby spinach) finally arrived. The spinach was burnt worse than my basil, and the chef put on way too much ricotta making this pizza soggy as well. She didn't like hers at all. There is one unisex bathroom, kept neat and clean, and it is as beautiful as the rest of the restaurant. The check comes held in a giant wooden clothespin, which I thought was a cute touch. Overall, I feel this place has potential if they could get just their act together in the kitchen. But right now it's all flash and no substance.", "author": "H. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Easily puts Grimaldi's and Lombardi's to shame. This is the definitive pizza in NYC, but not New York pizza per se... the much purer Italian alternative. Great beer list too!", "author": "Paul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "My husband and I had dinner here a few days ago and it was heavenly!\n\nThe host at the door was super nice, giving us a choice of whatever tables were open (which weren't many on a Saturday afternoon). The pizza was amazing. I usually don't like pizza crust but the crust was just so fresh and delicious. The crust tasted like freshly baked french baguette. \n\nThe service and atmosphere were great as well. The server was fast, but we didn't feel rushed. The atmosphere was energetic with a lot of young couples and families.", "author": "Dora E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "great thin pizza + not cash only! = good go to date spot or nice night out with friends", "author": "Meg A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "I stopped in here on a Friday night with my husband and a friend at about 9pm.  They sat us right down, outside on the patio and we got to enjoy the weather along with some top notch pizza and nice wine.  We split two pizzas: one with salami and one with prosciutto.  Both were excellent.  A great ration to sauce to cheese to toppings, and a nice crispy crust.  The service was very welcoming and prompt.  A great neighborhood spot that's also worth a special trip out.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Went here for valentines day and thought it was a solid joint. The main waiter is very Italian and very friendly. The ambience is fine, the tables for two are just a little bit too close together though. Complimentary champagne was awesome. The pizza is very good but not spectacular. Nowhere near Lucali in taste or quality but then again, what is? I loved the charred chewy crust but thought the sauce made the interior too soggy. The verdure specialty pizza was just ok, but the Laura with speck and rosemary was very good. Overall a great experience and a good option for pizza in the area.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "Fantastic. Amazing pizzas, great service. Awesome deserts, our 6-year-old loved the lemon sorbet.", "author": "Natalie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Exceptional . We loved the \"Laura\" with hot Italian sausage added .... It is hard to eat only one; they are all sooo good !", "author": "Frank H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Absolutely delicious!!!!  I've been here 2 times and ordered delivery once.  I love this place. As soon as you are served, you are whisked away to a table -- service is attentive and with a smile.  They treat kids with respect too, not as a nuisance.  The pizzas are consistently delicious.  I had the buffala one Saturday night and .  I hope to have many, many great pizzas here with my family in the future.", "author": "Laura A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Very small \u0026 tight quarters, but cute \u0026 calm.  They serve amazing gourmet wood-fired pizzas with some unique combinations of toppings.  We had a white pizza with brussel sprouts \u0026 truffle oil and another red sauce-based pizza with hot italian sausage, gorgonzola and mushrooms.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Excellent pie!! This is what i had in mind when searching for a perfect pizza. Sauce, toppings and crust was perfect. I highly recommend stopping in and having the Boscaiola", "author": "Neal B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "decent pizza, but really nothing special at all.  had high hopes for this bad boy too.  \n\nas i try more and more of the \"best pizza of NY\", just continue to find that nothing ranks up to di fara's.", "author": "Ben J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "FINALLY! A Napoletana worth writing about!  Absolutely delicious, the dough is amazing!  Perfectly charred crust, truly fresh ingredients, simple and wonderful.  I ordered over the phone and the pie arrived within 10 minutes.  Reminds me of Motorino (Brooklyn location closed) and Grimaldi's (near the Brooklyn Bridge).  This is definitely my new neighborhood go-to.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "GREAT Thin Crust freshest ingredients and I don't know why some complain about soggy crust because my Sausicia was crispy where it should be, chewy and smokey where it should be and with big hunks of spicey sausage.  Primetime 8PM, Thursday on a beautiful night, got right in, sat in the back patio and Me and my two buds chowed down and laughed at otthers sharing a pie.  Have your Own!!  It's the ,manly thing to do.  Full but ordered excellent housemade tiramisu...Best I have had..Not too sweet.  Real Men Don't share a dessert...  Hands off mine!!", "author": "Tim L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Perfect slice of heaven!! We had a pie with arugula and ham top with truffle oils. Must try.", "author": "Stephen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-14", "description": "I want to start off by saying that I don't generally eat pizza, because I don't really like it.  Bread, tomato, cheese....how many different ways can you do this?  I've tried all the famous spots from DiFara (usually burned) to Lucali (overpriced) and have yet to be wowed by pizza.  Until now that is.  Sottocasa, where have you been all my life???  Perfection is what comes to mind when I think about this small  yet cozy establishment on Atlantic Ave.  The bottom of the pizza is just slightly charred as you bite into the softest pita like bread.  The menu proclaims that they use the freshest ingredients and that is NO LIE.  The tomato sauce feels like it was freshly made  and I wouldn't be surprised if they had a cow in the back providing the milk for the cheese.  Outstanding!  Well done Sottocasa!", "author": "Anna K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}