{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Came here for the first time after watching the Macy's fireworks on the promenade. Such a cute little place for a pizza restaurant. My boyfriend and I wanted some pizza but wanted to skip the long lines of joints that were filled with bustling people. Thanks to Yelp we quickly found this gem just a few blocks away. We split a green salad with balsamic vinaigrette (Insalatina) and also split the Verdure pizza. We weren't exactly starving so we figured it would have been best if we didn't get our own individual pies. The Verdure pizza came with tomatoes, mozzarella, eggplant, caramelized onions, mushrooms, and basils. Besides the basil that left a unfavorable bitter taste (which we didn't think went well together), the pie was pretty good. It was not at all greasy, the cheese tasted fresh and the crust was thin, but doughy. The restaurant also had a mini wine bar and an outdoor seating option with a backyard patio. The servers were also attentive even though it was quite packed. Overall, good service, good pizza and be sure to explore the menu!", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Great thin crust. \nSat in back patio that was as hot as a greenhouse!\nGood salads. \nSomewhat slow service.", "author": "Rustygirl M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Sottocasa is a superb spot for pizza!! My experience was excellent in terms of food, service and atmosphere. But, if I needed any confirmation, there was an Italian couple sitting next to us and looking very satisfied -- always a good sign.\n\nThe arugula salad was simple and fresh, exactly what you'd need to accompany the heavier flavors of the pizzas. The two pizzas we got were the Marinana and the Quattro Frommagi. Both were complex in their flavors and just right in texture. The tiramisu, finally, was very good -- not out of this world. But, hey, it's a pizza place. HIGHLY RECOMMENDED!", "author": "K S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "I came early (5pm opening) and was the only customer on a Tuesday evening trying this place for the first time. I tried the Burgetta Salad and Boscaiola Pizza (one of the most expensive pizzas on the menu).  The salad was average, although there were plenty of artichokes (which  I love). I will probably try a different salad next time. The pizza was delicious but the gorgonzola cheese flavor got lost in the pizza with the intense sausage. Next time I will go more basic. The crust was cooked perfectly and the pizza was extremely flavorful. A bit expensive $30 for just pizza and salad (no drinks).  However, I am glad to have such a great pizza place nearby and will definitely return.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-06", "description": "Wonderful pizza and great little restaurant. Will be back next time im in town.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Amazing. Polite, on point waitstaff. Delicious and fresh. A bit soggy but the FLAVOR makes up for it.", "author": "Dinah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "From what everyone on Yelp says and what Google has told me, the dollar pizza I have been shoveling down my gullet for the last decade is not real Italian pizza. Here I was thinking I was a native New Yorker, pizza connoisseur...\n\nFuck it, I still love my dollar pizza but I love Sottocasa too. It's definitely soggier than other \"pizza,\" but it wasn't like a bad or inedible soggy... ya know? It was actually ridiculously tasty, the crust was thicker and had a good crunch to the outside while the center of the crust was thin and wet with tomato sauce and topped with spicy sausage (definitely the best topping ever), everything tastes fresh and amazing. I'm not sure how this perfection was achieved in like 3 minutes (that's how long it took for our order to come out) but I'm not complaining.\n\nPrice point wasn't crazy but it wasn't cheap by pizza standards either, it ranges between $9 to $18 for a relatively small pizza, relative being the very important key word here because it was filling enough for the two of us. I know it sounds expensive because you can get a 16\" pie for like $8 nowadays but this pizza and NY pizza is a completely different experience, not even in the same categories of food in my opinion. Non-believers, go give it a shot and if you hate it... then Idk but by the looks of the reviews, the owner is happy to refund the haters.\n\nI want to say it's authentic Italian but how the hell would I know? I just know that it tastes really good.", "author": "Kara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "A perfect little restaurant! Friendly staff, charming atmosphere, and delicious pizza. One of my favorite places to eat in Brooklyn.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-03", "description": "Well, the ambiance is basic yet pleasant, and they have a remarkable selection of Italian microbrews, which are difficult to find in New York. But the pizzas we ordered came out suspiciously quickly (2 minutes), and sure enough, the crust was nothing like it should have been (i.e., it was soggy). Did they just warm up something they had ready to go? That would be a definite no-no. Yet, some friends keep telling me it's worth a second try, we'll see...", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "Yum! Great job here\nGreat service and delicious pizza.\nDefinitely a go to in the neighborhood.", "author": "Edwin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "Went here for a late dinner after an event in the area. We ordered the Diavola pizza and a Tagliere. So delicious! We came in around 9pm on a Saturday night and got a table right away. All the food looked amazing. I wish I could have eaten more! Looking forward to my next visit.", "author": "Rose B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "Sottocasa is good for takeout but way better dining in.  The pizza needs to come out super hot and doesn't travel that well.  Salads are great.  Calzone is INSANELY GOOD.  Honestly one of the best things I've eaten in a long time.  Absolutely loved it.  Service is friendly too.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-01", "description": "The rating is for the P-I-Z-Z-A not the ambiance or the appetizers, or the service like other reviews I've read.  I had high hopes because of the all \"fantastic \"reviews by my fellow Yelpers but after last night's dinner....not so much!  I felt duped by many of the great ratings either because a) you dont know what good pizza is or b) you overall rating was clouded by the service, the appetizers and the outdoor space!  Never again will I just read the great reviews and ignore the negative ones.   \n\nReview of the pizza, we had the Proscuitto Credo (about 4 slices).  It was SOGGY, the dough was char and lacked any structure.   There was no \"crunch\", and for some reason the proscuitto (which was plentiful) was top of the basil.....HUH?!?  The water from the basil probably made the pizza soggy!  Like any good sandwich, its all about the bread and SottoCasa failed terribly!  I am sorry, but will not return.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "A top pizza destination.  I ate from here tonight.  I think it is about my 10th time, and I thought it was about time to write a review.\n\nJust fantastic place for dine in, carry out and as I discovered tonight...delivery.  I have eaten at all the top rated pizza places and this one should be on the list. Not sure if it is better than DiFara's, old Grimladi's, or Lucali's, but none of the hassle.  It is a busy place, but i haven't had any long waits. It feels like a nice neighborhood place with an outstanding pizza.\n\nIt is a bit different than Lombardi's or Grimaldi's as it is more doughy.  Not thick.  It is very light and thin, just a little bouncy different.  But really good.  It also makes the Calzone a must try.  Feels like fresh, quality ingredients.  For people who like a crispier crust, they may be disappointed.  But I think they would instead learn a crispy crust isn't all that important!  \n\nMy favorite pizzas are the Reginella when I am in a light mood and want delicate flavors.  But I love the Salsicca when I want tangy.\n\nThis is NOT the place you want when you plan to eat as much cheap pizza as possible.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Loved this cute little place!  The pizza was fabulous and the mixed green salad was fresh. A definite must!", "author": "Lisa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "This was a great restaurant.  Arriving at 9:15 pm, we were immediately seated as we arrived.  We, being my husband and me, were seated close to the front where we got the great glass window view, so if we felt bored we could realistically people watch.  Unfortunately, it was dark outside, so we focused our attention on the ambience and the meal at our table.  \n\nThe decor is simple, classy, and semi-rustic.  With wooden communal tables, seating designed for two on the left, it is great for dates, one-on-one rendezvous, or bring a group of friends.  I find that the atmosphere here is great for talking, having a simple glass of wine or sherry, grabbing a beer, and just relaxing.  There is understated music in the background which is not overpowering, so that way you can have a full length conversation without wounding your vocal cords.  I like that.  The inside is filled with air conditioning and fans.  If you look carefully, you will spot a vintage sewing machine, an old fashioned metal fan, and also random baking needs on a shelf opposite the kitchen.  I should also note that there is a backyard which mirrors the exposed brick walls that cover the interior of the establishment. \n\nOur waitress came over to take our beverage orders and read us the specials of the day.  I found that she was quite nice and down-to-earth.  After hearing all the specials and reviewing the menus, we decided to order the salad with arugula, parmesan reggiano, artichoke, and tomatoes.  It was a great appetizer.  We finished it five minutes, but with its size, you may take twenty minutes.  The salads come in a huge round glass bowl similar to something out of an art gallery.  Oh, and we probably must have been ravenously hungry.  That might be why we inhaled the salad that quickly.\n\nWe also ordered the Reginella pizza: tomatoes, basil, mozzarella.  I want to say it was about 10 to 12 inches in diameter.  Man, was it good!  The ripe tomatoes had an understated but refreshing in combination with the homemade mozzarella.  The salt content of the pizza was minimal.  It is not your typical New York pizza place.  It does not bear resemblance to any of the pizza food chains(Domino's, Pizza Hut, Papa John's).  It is freshly homemade in their coal brick ovens.  I noticed others saw that it was soggy in the middle.  Being coal brick oven pizza, it can only be cooked a certain amount of time before the crust is completely charred, so if you ask me if it is soggy, then I would tell you that the interior is wet but it does not affect the taste of the pizza.  It's still really good.  I would come back and try some more flavors.  I see on Yelp that the pizza with salciccia was a hit!", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "Went here this weekend with 3 friends.  We had the barbabietole and rughetta salads, and the reginella, prosciutto crudo, and boscaiola pizzas.  We loved it all.  The pizza crust was perfectly smoky, thin in the middle and soft and chewy towards the ends.  While everything was amazing, the Boscaiola pizza was my favorite and I'd most likely try different starters next time just to change it up.  \n\nEven with all the competition and options in the neighborhood I will definitely be rushing back and happily recommending it to all my friends!", "author": "Rebecca Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-27", "description": "Seriously, I want my money back. \nThe pizza we were served was WARM. Taste like soggy flat bread with WARM cheese and ingredients. Tables were on top of each other. Felt rush....\nHonestyly, I had better .99 cents pizza.", "author": "SK C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "We arrived around 7pm on a Sunday, and even though the place was full we were seated very quickly. The staff is very nice and attentive. The interior and ambiance is trendy and welcoming. We had the focaccia and a Italian ham pizza, both of which we're delicious. The house lager is good as well. Highly recommend!", "author": "Erin .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "At first I was kind of annoyed that they won't change any of the pizzas....then I tried them.  Love this spot - great food and so good for a girl's wine night or a reasonably priced date!", "author": "Jaime G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}