{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Authentic Italian food. Fresh and well chosen ingredients. Very reasonably priced and small but nice selection of wine. Also great music and fast service.", "author": "Rudolph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "Let's begin with a very important thing: do you like the Italian pizza or the also very good american pizza? If you like both of them, great, but remember, they're two different thing.\n\nAt Sottocasa you'll get the REAL Italian pizza, Napoli Style. And believe me, as an Italian I can just confirm that. \nThe ingredients are super fresh and the taste...OMG! I feel like \"welcome home\" every time I step in and I order my Reginella (Just try it!).\nPeople inside are great, super easy and relaxed. And they're real as well...I mean, a lot of them are real Italians, starting from the owner/pizzaiolo. :)\nThe atmosphere it's just the perfect mix between a nice Italian restaurant and the Brooklyn Style that I love.\n\nI like the thing that if you call for a delivery they say, on the website, that it's not the best thing to do - Pizza has to be eaten right after it gets out from the oven -. \nWell, believe me...I called also for delivery and the pizza is good, very good...but it's definitely you better listen what they say! :)\n\nBravi!", "author": "Fabio F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "Sorry.....but that wasn't the most pleasant tasting pizza or service experienced this time. Pizza base was soggy and wet on one of the pizzas and straight after the query re dessert we were given the bill. No asking if we would like another wine or coffee. We were in that restaurant for a total of 40 min......\nDefinitely tasted hotter, crispier, drier bases and had better service in small country towns in Australia.", "author": "Susi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Went here on a date the other night after seeing a movie down the street at the cinema. Walked in super hungry and was immediately hit in the face with the smell of fresh dough baking in a fire. (There should be a candle for that small - somebody please make that). Service was great, we were seated right away and had our drinks with our delicious Burrata pizza (Fri-Sun only special) shortly following - on a Saturday night at 10 o'clock I mind you. I'll definitely be back time and time again. This place is one that reminds me yet again why I love living in Brooklyn.", "author": "alicia c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "Truly authentic Italian cuisine. \nLoved every minute of it.\nAntipasto and pizza was to die for.\nStaff were very friendly and kind.\n100% recommend it.", "author": "Karla S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "This is a cool spot, in a great neighborhood, with awesome 'za and huge calzones. What's not to love? The margarita was about as good as any I've had. Would definitely go back the next time I'm in Cobble Hill.", "author": "Mitch D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "When a place does pizza right, I don't try to over analyze it. I can't go on and on about the puffiness of the crust or the amount of char on the underside of the pizza. I'll leave that to the experts at the pizza blogs. But I've eaten at most of the great pizza places in NY and this one ranks right up there with Keste.\n\nThe Food\n\nThe ingredients they use are fresh and many of them come directly from Italy, as we were told by the server. I'm not one for meat on pizzas, so I've had the Quattro Stagioni (w/o ham) and the Verdure. Both are excellent! My friend liked his Salsiccia so much that he actually ordered another one and took half of it home. Our only minor misstep was the Sfiziosa - the anchovies were a bit too salty for our taste.\n\nThe Rest \n\nNice wine selection, and plenty of Italian beers that I've never seen before. Decor and staff are warm and inviting.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "the burrata was phenomenal. Also many interesting beers. The Laura was a little low on salt, but still great. Definitely order the Nutella pizza (it's way better than max brenner's chocolate pizza) and the house made tiramisu.", "author": "Vivaan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Great pizza! Probably one of the best I've eaten in my life (and I've been in Italy a few times. So I would say I have good references of what a good pizza looks like.). The dough is very good, very Italian. They use good ingredients. The dessert was pleasant too. I would totally give 5 starts for the food and restaurant atmosphere.\nI gave 4 start because of the waiter's bad mood. We asked for 3 pizzas but just 2 was served. When we asked about the third pizza, he said nothing. He didn't even apologize for the misunderstanding, just went to the kitchen and made the order. Actually we felt he was impatience since the beginning and after our complaint he looked at us like it was our fault for some reason.\nI don't know it's always like this, but it spoiled the experience a little bit. \nAgain, the pizza is great and worth it in spite of the waiter's mood. Just try to be clear and check if he got all your order.", "author": "Brínea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "I took here my italian sister and her boyfriend for a saturday italian meal\nWe took a cured meat and cheese board. The salami was def too dry and too thin. \nThe pecorino toscano was very good and well cut. We also had Parma prosciutto and in my opinion was too salty, and this one also too dry, maybe cause it was near the end or just opened. \nThen we took 3 pizzas, 2 quattro formaggi and 1 tartufata.\nThe 4formaggi was not cooked enough, def too spongy and i would have appreciated an higher presence of gorgonzola cheese.\nAs dessert we took 3 tiramisù. That tiramisù was AMAAAAZIND, delicious, creamy, we looved them. \nOur waiter was Luca, a very good looking and charming guy from Gorizia. He was very professional, precise, kind and with a nice smile on. Overall I would suggest this place to spend a nice evening in brooklyn.", "author": "Christian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Arrgggg ok ok i know its stupid to update a review and give the same amount of stars but 1. Yelp doesnt allow more than 5 stars and 2. I just had to re-confirm how awesome this place is (while at the same time discredit any crazy naysayers who think this place is anything less than perfection). Had me some parmigiana pizza and a calzone type thingie plus a carafe of wine (which they very generously filled to the very brim) and tartuffo and espresso for dessert! I am lying in bed a solid 4hrs later and still dreaming of my meal whilst planning my next trip. Truly feel like i take a brief trip to Italy every time i come here! Love you Sottocasa please never change!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I give it a thousand stars. Forget about \"New York Style Pizza,\" Sottocasa is where you will find the best pizza in NYC!!!!!", "author": "Christina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Pizzas are truly fantastic (special mention for the Laura and Burrata) and the staff is super nice. Def the best in the area: do not hesitate!", "author": "Robin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "The place was small but made the best of its location. I enjoyed seeing the pizza being prepared before me. The group I was with order to the margarita and marinara Pizza. Both were prepared quickly and tasted fantastic though I did prefer the margarita. Although the menu is limited it still was a pizza unlike anything I've ever had before. That would certainly be willing to eat there again and recommend it to anyone.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Sottocasa blew away my expectations. As I was leaving, I thought, \"Wow. I haven't written a review in over two years but this place seriously deserves the highest of 5-star reviews.\"\n\nWe started with two pizzas, the reginella and the radicchio, and they were so good we devoured them almost immediately. As we were eating, we ordered two more; the prosciutto crudo and the salsiccia. So, among a party of five, we ate four pizzas. \n\nEverything about the pizzas were good. From the dough to the crust to the sauce to the ingredients and the toppings, everything was good. \n\nThe service here was just as great as the food, too. We were seated immediately, our glasses were consistently refilled, and the waiter came by our table a few minutes after we started eating to ask how the food was, both times. \n\nThe pizzas here typically come in four slices, so when the first two arrived to the table, my group started cutting them into smaller ones. The waiter noticed within seconds and offered to take them back to have them recut. When the third and fourth pizza came out, they came out with eight slices each. Everything about the restaurant was just incredibly meticulous. \n\nI've already recommended this place to my friends. Five stars, definitely.", "author": "Isis W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "This is, simply, the best pizza I've had in NYC. And one of the best I've ever had, actually. Great little walkdown location, very friendly staff (brush up on your Italian so you can return their greeting) and incredible food. The beet salad was nice for sharing.", "author": "Lanny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "Amazing pizza. $6 dollar house italian beers. The service can be slow when the restaurant gets busy -- so beware. Otherwise, highly recommended! best pizza in the neighborhood -- reminds me of authentic Neopolitan pizza.", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "My favorite pizza place in all of New York City!\n\nI tried both the Reginella and Romana, which were both SUPER delicious! Our group got a complimentary nutella pizza, and it was mamma miaa oh-so-good!\n\nThe service is top notch. \n\nNumero 28 used to be my favorite until I found Sottocasa. It's more delicious, cleaner, and even cheaper!", "author": "Viviana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Delicious. Fresh, simple, and more than satisfying...we left no room for dessert! Great service, comfortable, casual atmosphere, great location.  So glad Yelp led us to this gem!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Let me start by saying I am a little fanatic about pizza. (And by a little I mean a lot). Came here after arriving from San Diego- sat on the back patio which was adorable! Ordered a glass of sav blanc and started with a house salad. Then we split a pizza with sausage, goat cheese, basil, mushrooms and added arugula. SO good!!! Dough was cooked to perfection and it was freshly baked. Service was on point and we got everything quickly. I already want to go back and it's 7am!", "author": "Elisa H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}