{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "As a Brooklynite, I have pretty high expectations for pizza. When I saw all the 5 star reviews, I was expecting a kick ass pizza that would make me want to stuff my face until I barf. This clearly was not it. \n\nWe ordered 2 pies, the Tartufata and one (I can't remember the name but it's not even on their menu online) that had caramelized onions, pancetta and basil. The Tartufata was ok, a little light on the truffle taste. The other pizza was disappointing. Apparently that pizza doesn't come with mozzarella cheese? It had a sprinkling of parm cheese on it. Technically is that even considered a pizza anymore? But my biggest grip was how soggy and wet both the pizza was! In my opinion, that is the worst offender for pizza. The crust tasted more like naan bread than the traditional crust I was looking for. So maybe it's just my personal taste for thin and crispy pizza that made this place so disappointing to me.\n\nOverall, I would not come back. The drinks are pricey, the pizza is soggy.  Both a no-no for me.", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Solid BK neighborhood go to pizza place. Most recently, we had no problems grabbing a table on Sunday evening for long weekend and shared a long table with another diner. The space is limited but fast service and speed in which the food comes out makes it easy for turning tables.\n\nWe had the arugula salad which was generously portioned and fresh. They have a good selection of brews including local beers. The wine selection isn't bad and has some easy drinking stables. \n\nFinally the pizza, which is more Napoli style to me with a soft doughy center and crunchy crust. We had the mushroom and sausage one, which left me craving for more. The size is typical of gourmet pizza joints in the area, so 2 ppl sharing 1 and a salad left us still a bit hungry but 2 pizzas would've been too much.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-19", "description": "It's okay- I like keste pizza way more simply because it's the same thing but much cheaper. I'm not sure about weekends but I know keste has a $5 lunch special on weekdays for a margarita pizza of the same size. This one had anchovies which were okay, they were pretty salty which is expected and I'm not sure if it was the best compliment to the pizza. The service was really good though.", "author": "Foodie_Nishi I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-10", "description": "We honestly wanted to like this place, but the service kind of threw us off. \nWe were served by a woman with short hair and glasses. She seemed off from the beginning. After she dropped off the check, she literally came by every two minutes to try and pick it up when we hadn't even had the chance to look at the receipt. We told her several times we weren't ready but she kept creepily hanging around. Besides the experience with our server, the pizza itself was made with noticeably fresh ingredients, but the base of the crust was slightly flimsy and the toppings kept sliding off. There are many amazing options in the area, not worth another visit.", "author": "Tina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Delicious. All the staff was super nice and helpful. Place is cute and quaint. Best pizza I've had in a long time.", "author": "Danette C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "Soo my family \u0026 i stoped by this nice Italian spot in brooklyn on a Monday night , atmosphere was very relaxing. Ordered a salad before the pizza to share, we waited a long time for our pizza and i noticed the waitress seemed very overwhelmed, she was not very attentive and the place seemed understaffed on the floor area , it did not seem too busy while we were there but eventually we got our pizzas \u0026 it was worth the wait. I recommend they get more help on the floor from what i saw i used to work in restaurants so i could see for myself , they had a host/bartender and a buser but i recommend they do get more help, the table next to me also seemed to be upset that the waitress wasn't attentive \u0026 needed a boost.. but overall the food is actually really delicious ! I would come back again but at an earlier time and different day", "author": "Sandra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Go there if you want to taste a real italian pizza. Fresh ingredients, perfect dough. The dessert was really good too!", "author": "Antonia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "My god. This was not only the best gluten free pizza; it's probably the best pizza I've ever had in my life! Such a cute little place. I wish I was east coast just so I could eat here regularly. But, I'll tell you what. I'll be back!\n\nMuch love from California!", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "We truly stumbled here on a whim because other places were super crowded. It was late at night, we got there around 10, and they were quick to sit our party of six.\n\nService was prompt, I could tell they were a little annoyed with our large group coming in so late, but I personally tried to show my appreciation to the wait staff.\n\nMy group got drinks fast and ordered pizzas shortly thereafter, and the 'zas arrived much sooner than expected. I got the weekend special (burrata, $15) and it was sooo good. Crust was perfectly bubbly, cheese was ooey, gooey and fresh. No complaints on my pie. Everyone seemed to enjoy their food. My pizza didn't have sauce, but someone in the group said the sauce is a little watery, making the middle of the pizza soggy.\n\nI'd go back to try other options for sure. For the price it was plentiful and above average.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Value: 7/10\nExperience: 8/10\nTaste: 7/10\n\nWe got 3 pizzas and it came out to $67. The pizzas are definitely on the smaller size and everyone had around two slices. The taste was good but the pizzas were soggy in the middle and couldn't really be folded. The staff were friendly though and food came out super quickly.", "author": "Yang X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Really great real Italian pizza with great service. We had the caprese and three shared pizzas, which were all very good. Especially the Laura and Burrata pizza (fri-sun only I believe) the service was also great as well as the dessert. The panna cotta was great and homemade as well as the tiramisu which was ok. \nThey have a very nice courtyard in the back.", "author": "Steph K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "Literally the best gluten free pizza you will ever have. The first time I got delivery I thought they had made a mistake and given me gluten it was that good. Also, my partner loves their regular pizza. The delivery is the fastest you will find -- I love everything about this place.", "author": "Rosie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "Easy to miss because of its location, but hard to forget after you've eaten here. This place is authentic, down to the Italian I heard being spoken by the employees/owners. We were greeted as soon as we walked through the doors. This restaurant is small, but it lacks nothing; along with the music, and the lighting it actually makes for a great ambiance.\nWe ordered two pies, the prosciutto crudo and the salsiccia. They both came in less than 20 min. Sorry I couldn't snap a picture of them, because we inhaled them as soon as they hit the table. They were absolutely delicious. Rarely do I ever have pizza that deserves a 5/5 but these pies were amazing. We finished off with tiramisu, and a latte for dessert. We left fully satisfied. It's rare that I find nothing to carp about at a restaurant. This place gets an A+ in my book.", "author": "Laina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "My fave pizza in the hood, such a lovely atmosphere and damn tasty! Always quick and efficient service too", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-15", "description": "Food is good... the only problem is they rush through customer. They serve the food quick and expect customer to finish the food quick and leave the restaurant. Whole process is super fast, talking order to serve, cleaning table even u still try to finish your food and give bye to a customer. They have enough table. Food was good", "author": "Kroniclex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Zomg also: covered back patio, delicate lighting, a little bit of green peeking out from behind the panes of glass, same amazing food (see below) and ambiance. I hope this place is here forever!", "author": "Claire F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "Best neopolitan-style pizza I've ever had. Period. I went almost a week ago and haven't stopped thinking about it. Also an interesting selection of Italian beers that I've never heard of before. You won't be disappointed here.", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "This spot has my favorite gluten-free pizza. Neopolitan style pizza with delicious toppings. Try them all.", "author": "Unkl- T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Hands down, this place probably has the best gluten free pizza I've ever eaten. Even my non-gluten-free friends said the crust was delicious. They offer the gluten free alternative for an extra $4, and it is cooked in the same oven as the regular pizzas, so cross contamination is possible but if you are looking for a great pizza place that's gluten free friendly, give this place a try! I had the prosciutto crudo pizza and it was great!", "author": "Christine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "We had our Rehearsal Dinner at Sottocasa and it was AMAZING! The food was delicious, the service outstanding, and the ambiance (we sat in the outside room in back) was charming.\n\nWe had been for pizza many times before and it is always yummy--brick oven pizza with that perfect crisp and chewy crust.\n\nIt's casual and sophisticated. The staff is friendly and knowledgeable. I'm a pizza snob and this is excellent pie. They have a nice wine \u0026 beer selection. And it's super reasonable.\n\nIf you're in Boerum Hill and you love pizza--you should go!", "author": "Madison C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}