{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Excellent pizza! Arugula salad has a fantastic lemon dressing--great accompaniment to the pizza.", "author": "M O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Absolutely amazing pizza and great coffee! Service was extremely fast to the point where I was surprised how fast I had my pizza, and the staff was all very friendly and accommodating. Would definitely recommend!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "What great gluten free pizza! My wife says regular pie is great as well. We love the feel of the place, both the room adjacent to the street and the garden area in the back. And the price is definitely right. We're fast becoming regulars.", "author": "Danilo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "Solid neapolitan pizza in a comfortable setting.\n\nWe ordered the prosciutto and mozzarella which was really good. Also had the diavola pizza was good, but certainly not super memorable. Just simple, good food.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Amazing traditional pizza @ Brooklyn! We had one with a homemade truffle paste and dried mushrooms with prosciutto20$ and a regular Margherita 14$, gr8 collection of Italian beers some starting at 6$ all the way to 15$.", "author": "Federico M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Stopped by last night while on business trip. I'm from Italy but live in Boston. This pizza is the real thing. I had the classic: Margherita, and devoured the whole thing. Light and tasty, just like it should be. Wish we had pizza this delicious in Boston. Environment is cozy and inviting. This stays in the map for future trips!", "author": "Marina Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "The best pizza of my life from sottocasanyc just hearing them say my name in italian was worth every penny but seriously this rosemary is so on point", "author": "Laura S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I've been going to regularly Sottocasa since they opened, and they make undoubtedly the best pizza in NY. Being Italian I can say that I rarely find this quality of pizza even in Italy.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "Good neapolitan style pizza that came out super quick, though there was a price: I found the crust a little too floppy / underdone. And it's not like we ordered a super loaded pie.\n\nThey are all about getting people in and out and it wasn't super comfortable. Also, the place is overrun by families with toddlers, so this isn't somewhere I would go on a date.\n\nIt's quite affordable and in a very convenient location, so none of this is a deal breaker, but I've definitely had better pizza before.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Yes, I am a fan of Sottocasa. This place is in our top 3 of pizzas. It is easy to get to being right on Atlantic Ave. You take a few steps down to the entrance, and it brings you to a cozy pizza joint. The staff are really friendly. The hub gets along great with staff as they are Italian.\n\nThe focaccia bread is a little thin and I am more accustomed to the thicker focaccia bread, but I was assured by the hub that it is also like this too. We really enjoyed the prosciutto \u0026 mozzarella that comes with a nice heap of arugula salad lightly dressed with a touch of lemon. They serve a burrata pizza fri-sun so we both got burrata pizzas. Mine with hot soppressata and hub with spec. They do not come with tomato sauce but with tomatoes. This is good for people that like white pizzas. The dough is just mouth watering good. All the dishes and pizzas are made of fresh ingredients. It just is done the right way here. \n\nAnd... to make your meal even more memorable, their tiramisu is amazeballs good. Not too heavy on the coffee drenched ladyfingers and definitely big on the light mascarpone. SO SO freakin' good. You leave on cloud 9!\n\nGreat atmosphere with very nice staff and amazing pizza and tiramisu. It does not get any better!", "author": "Donna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I read some reviews from my yelp friends and had to give this place a try.  \n\nA bit torn as to how to rate this place.  I ordered the prosciutto crudo and added spicy salami!  It was awesome, BUT it just needed a kick (hint sottocasa, make spicy oil if it had this oil I would have been in love!)\n\nVenue (4/5) casual vibe.  The owner and wait staff are very attentive and the atmosphere feels like a neighborhood favorite.  \n\nService (4/5) attentive and knowledgable on pizza!\n\nFood: (3.5/5) a bit bland but the crust was good.", "author": "Lana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Delicious Neapolitan pizza prepared by a Keste alum.  We had the salsiccia and capricciosa pizzas.  Both were delish!", "author": "SERENE N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-10", "description": "Went on Friday night with a Meet Up group. My friend who hosts had been there before and really liked the pizza. I was a few minutes late and they wouldn't seat the group until I got there even though everyone else was there, which was kind of annoying. \n\nI ordered a beet salad, which turned out to be a massive bowl of beats with a little dollop of goat cheese on top. There either needed to be less beets or more of everything else or both.\n\nFor the pizza, my friend and I shared the Verdure, a vegetarian pie with A LOT of caramelized onions. Still, the onions didn't outnumber the amount of beets in my salad. I had a slice and thought it was surprisingly bland. The person across from me ordered the special and also found it very bland. She didn't even eat half of it. \n\nI asked for some anchovies for the rest of mine to try and give it something with some flavour. The waiter brought them but didn't tell me I would be charged. The anchovies helped but by the time I ate my second slice, everything had slid off. There were to many onions making it soggy and I think the dough itself wasn't crisp enough to support the multiple ingredients. \n\nThere are many better pizza places in Brooklyn so going to give this a miss.", "author": "Shani F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-21", "description": "I'm a big fan of Thin Crust Brick Oven pizza joints, but Sottocasa fell short of my expectations. Don't get me wrong, what everyone says (in terms of flavor) is all true. We ordered a red pizza - Boscaiola (consisting of tomatoes, mozzarella, hot italian sausage, gorgonzola, mushrooms, basil) and a white pizza - Tartufata (consisting of mozzarella, home-made truffle spread, mushrooms, prosciutto di parma, basil) and both were delicious. However, what I was really disappointed in was how the pizza was actually made. They were the most SOGGY pizza I have ever had and it was falling apart all over the place. Too bad...flavor was good though. Also, our arugula salad was very fresh and a good balance with all the pizza we ate.", "author": "Win C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Friendly place for all ages. Lots of families, young couples, and friends. Chickpea and tuna antipasto was delicious. Pizza with speck (new to me) was great. Staff was helpful and kind. Only downside-too noisy for a conversation.", "author": "Wicca D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "In the words of Larry David, this place is pretty, pretty, pretty, pretty good. Staff is super friendly. Service is quick, and the pizzas are good. There's also now a semi-enclosed backyard area for dining. What more could you ask for?\n\nLoved the focaccia. It was basically a sauceless and topping-less pizza. It was huge, but delicious (no dirty jokes, please). The margherita pizza was also cooked perfectly. Very thin crust and fresh ingredients.\n\nPrices are very reasonable, but try to come on an off night because this place gets busy!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Go here if you like wood fired pizza! The sauce is runny, which I love. A perfect leoparding on the bottom. If you're getting margherita, basil is on before fire. The place is small and cute.", "author": "Paige G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Walked in late afternoon on a Saturday and enjoyed a table for two in the breezy back garden with no wait. Comfortably busy and the staff was friendly - the place was full of young families. I saw many tables ordering tasty looking salads but I went with the Boscaiola - spicy sausage, basil, mushroom, gorgonzola was surprisingly light on oil and absolutely superb! Thin crust at the middle of the pie and thick at the outside with nice chew. \n\nThe pie reminded me of the personal sized pizzas served in Italy. Totally unpretentious, reasonable and the waitstaff chatting with the table next to ours in Italian confirmed this is not your average pizza joint. I will be back!", "author": "Bunny B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Excellent pies, laid back atmosphere. Lots of Italian being spoken so you know it's legit.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "I have had a lot of gluten free pizza over the years and this is THE BEST gluten free pizza that exists on this planet.", "author": "linnea S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}