{"aggregateRating": {"reviewCount": 591, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Authentic Italian pizzeria where the style of pizza is similar to what you'd find in Naples, Italy! Highly recommend coming here for their awesome pizza, and charcuterie board. Fresh ingredients and delightfully simple neapolitan sauce!\n\nGives off a nice casual yet cozy atmosphere, grab vino and enjoy.", "author": "Ronald L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Solid Neapolitan pizza at fair prices. The dough is thin and has that bread-like elasticity of a good thin crust. I got the boscaiola, which has flavorful sausage and mushrooms. The cheese added a great flavor, I wish there had been a bit more of it. As other reviewers haven mentioned, the tomato sauce is very watery, so you need to eat it quickly. Definitely more of a dine-in experience than a takeout spot. Service was very attentive and kind. I'd definitely go back if I had a pizza craving and was in the area!", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "The best Gluten-Free pizza  you'll ever have in your life, right in Brooklyn and less than a 1/2 mile from Barclays Center. In NYC I go to Kesté's for my Gluten Free Pizza Fix. Both places are just as good. \n\nI will say that they could use some sound-absorbing ceiling tiles...but I did notice a nice backyard dining area so I'll check that out the next time. Great service, the busboy's really hustle and the man who appeared to be the owner or manager was completely gracious. A+", "author": "Rosh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Sottocasa is tucked into a busy part of Atlantic Ave, and has a little back outdoor patio that we were seated in. We got the Margherita and Burrata (only available Friday-Sunday) pizzas which were delicious, albeit a bit burned on the underside. The pizzas came out less than five minutes after we ordered. The service was quick and efficient. Would recommend for a quick bite!", "author": "Sophia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-21", "description": "If you are looking for the best pizza in Brooklyn this is NOT the place to go . The pizza is flimsy , the dough not cooked right. It's considered a neopolitan style pizza. All the ingredients slide right off of the pizza.  Maybe bad batch but not worth the rating it has which is why I tried this place. The price is too high for sorry excuse for pizza.  I'm from Texas and I don't play with my pizza.. Now the palyace called \"ARTICHOKE\" IS where I'm at now and it's amazing ! Look it up.", "author": "Mark V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "This is a fantastic neighborhood pizza joint slinging world class pies. Lived a couple of blocks away and started going regularly when they opened and for years after. The people are great, particularly the front of the house, and the pizza is consistently well executed. The dough has a flavor unlike the other great pizzas in the neighborhood, or really anywhere. I certainly have my menu favorites, but I've never been disappointed when venturing away from the usual. The center of the pizza can get a little soft, particularly with takeout, but I think that was more of an issue in the early days. \n\nThe dining room is super cozy on those bitter winter nights, and the backyard is a perfect way to unwind on a summer evening. Sad to have moved away...", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I love Sottocasa. A good friend of mine lives nearby and it's become our go-to takeout pizza spot. We get it at least once every few weeks together and it never disappoints. \n\nSo far I've tried the Aglio Olio, Romana and Margherita. All delicious combos with chewy crusts and heavenly sauces. Sometimes a bit of sauce will drip off as I'm eating, but I have a No Sauce Left Behind rule here. Any sauce that drips off gets soaked up with a piece of crust at the end. It's a good rule. \n\nFor some reason we've never actually eaten-in, but every time we go to pick up the pizza we always marvel at how lovely and cozy it is inside. Maybe next time we'll put Netflix on hold and get the dine-in experience.", "author": "Jeannette N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Best pizza I've had in NY. \n\nItalian run, fresh ingredients, thin crust, creative vegetarian options, and delicious. \n\nI recommend the Romano pizza if you like capers.", "author": "Benjamin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "This is exactly the kind of place that ruins you.\n\nIt's 9:30, and I'm comfortably relaxing in my hotel room in Brooklyn. I can hear the sounds of the city outside my window, and I'm settling in and watching some Netflix. There is a good nights sleep ahead of me. But then it hits me. I'm kinda hungry. And somehow I have wondered from my room. As if sleepwalking. And for the distance that most people would have to walk to their mailbox, I find myself sitting in a small family pizzeria. Sottocassa. It's below street level, and I'm fairly convinced the folks running it live upstairs. It's about 10pm now and I have no business thinking about eating pizza at this hour. But hear I am. How did I get here? It was like a magnetic force field sucked me in. Everyone is speaking Italian. And their laughing, and it's loud, and within an hour I have consumed about 2 million calories. I had the Proscuitto Crudo. Tomatoes, mozzarella, prosciutto, basil and sprinkled with amazing. And because I'm and \"all in\" kinda guy I absolutely went in for the home made Tiramisu to finish it (me) off. The food is only matched by the atmosphere. This place is amazing. \n\nI think I need to walk the Brooklyn bridge tomorrow morning, but it was worth it.", "author": "Vince E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Great pizza.. go for just that. Decent size. Good ambience. The greenhouse in the back is a lovely setting. \nThe salad was a let down. It wasnt that great! \nThe leaves were dry and bitter and felt anticlimatic with the food overall. The waiter recommended it. So be cautious of trying it.", "author": "Sabrina Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-21", "description": "Mediocre pizza at best. Very soggy,  falls apart quickly and pretty bland. Very nice staff they were  accommodating to a large party of about 6. It's decent for hipster pizza, I'm a native New Yorker so I'll rate this mediocre. And expensive for what they're serving. Tip:  skip the overpriced salads", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Still fantastic.  They now have vegan cheese, but next time I will ask for less of the cheese.  The pizza is great because the ingredients are super fresh.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Authentic real Italian pizza!!! This little secret in Brooklyn is absolutely amazing!! They a quaint outdoor seating area that provides for a great atmosphere. They hand make their dough right in front of you and ,from what I can tell, use only fresh ingredients. Much like a real Italian restaurant they don't open up til 5 but if you're there around 4:30 they might open a little early for ya. Don't come looking for some huge elaborate Italian menu!! They only serve pizza and salads and do a superb job at both!!! So if you in the Brooklyn area and looking for a true Italian pizza experience stop on in and treat your pallet.", "author": "Clint E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "Sotoocasa serves up some great pizzas. These are personal-sized Neopolitan-style pizza. Service is great, the space is great. The ingredients used in the pizzas taste really fresh. The only downside is that the final product comes out typically soggy.", "author": "Tunaidi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "I wrote my first review on Sottocasa three years ago. It is my favorite pizzeria ever. I feel the need to update my review because every time I go to try a new Neapolitan pizza place in the city(Manhattan), I always end up saying \"Nothing beats Sottocasa's pizza\" The dough, the sauce, above all the mozzarella, it's just all another level!! I also go to Italy every summer and I prefer this pizza to most pizzerias in Naples \n\nThe only reason I go try other places is because 1. I'm curious 2. If I want a night out in the city. Other than that, this place is the only place that truly satisfies all of my pizza cravings. Also, this pizza is always consistent. Every single time I come it is the same, unlike other places. \n\nIf this place was in Manhattan, it would probably have a line around the corner.", "author": "Virginia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Finally - a good pie.   Would actually return!", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "Maybe it was the eggplant, but the Verdure came out too soggy. Decent, but would not recommend.", "author": "Amit P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "After returning from Milan and Naples, I was eager to get my hands on another New York Neapolitan pie or two. I ordered up the Aglio, Olio (crushed red pepper, garlic, oil, ricotta on a white pie) and a traditional margherita. Not the best pizza I've ever had. It was messy and could not keep itself on the dough, but it did have a pretty good flavor.\n\nGluten free offerings probably attract a good crowd for a real pizza sans gluten.", "author": "Brad W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "The best Neapolitan pizza outside of Naples...really...this place stands up to the top spots in Italy. The ingredients are impossibly fresh -- do they make the mozzarella themselves?! -- and the pizza crust is straight up addictive. Pizza perfection!", "author": "Brandy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "This place gets 5 stars for their Buratta Pizza! They only have it on the weekends though, it's just that good... Their other pizza is pretty good too but nothing touches the Buratta. The place itself is cozy and spacious and their Italian beers are great too.", "author": "Lina T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Sottocasa Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "298 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MyoRx87__vQdas_Hj6DK-g/ls.jpg", "@type": "Restaurant", "telephone": "+17188528758"}