{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "After working up an appetite at the Transit museum we ran here for lunch. \n\nI got the bacon cheeseburger, nephew got a kids cheeseburger. \n\nWe were pleased BUT he needed a larger portion. Luckily my meal came with tons of fries and we shared those. I loved the bacon and the fresh toppings. Like stuff was crispy. The fries were different from other places and tasted really good.\n\nOverall a great stop, only ruined by the fact that we sat on the first floor not realizing there was more seating available and the cold kept seeping in and cold fries are never sexy.", "author": "Yoselyn F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-08", "description": "First of all these review pages need to offer a \"Zero\" click to\nreviewers so that it can be averaged into the equation.\nAnyway, although there might be Checkers out there that get\nit right I haven't found one. And the problem therein lies with\nthis chain's motto of \"get'em in, move'em out\" as in its customers\nare but mere cattle to be cashed in upon and then their remains dumped into the dog food factory trucks.\n\n\nEspecially problematic at Checkers is its penchant for hiring wayward runaway kids and junkies that it houses at nearby RV parks and makeshift tent cities under highway overpasses. Of course there's a\nhuge turnover, which contributes greatly to any semblance of having quality control and repeatable quality at that.\n \n\nIf you want a sloppy salad on a bun then knock yourself out and come here.\n\nI'd say in all honesty Checkers should take a shot at just being a no frills single and double burger w or w/o cheese as well as fries joint and just get that right. This is because the huge selection of fare is just too much for their sorry asses to deal with and maintain repeatable good results.\n\n\nWhat I've learned from insiders is that part of Checkers business model is the old play dumb bait 'n' switch ploy, whereby they get your order wrong and it's always for a more expensive item. And when you attempt to return it they say it's not returnable because you opened it. A cute part of this ploy is that the offending cashier always disappears and you're left to deal with an indifferent replacement that offers to call the police. And the pathetic joke is that there's never a Manager on sight they claim, so there's no chance of a Manager keying in a delete purchase, which the regular cashers say only a Manager can do.\n\n\nPiss on Checkers I say. Damn Checkers to hell.", "author": "Sonney D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-09", "description": "First off I visited this location in the middle of lunch hour. I walked by Popeyes and McDonald's jammed pack as every other fast food restaurant I walked by. I finally came across Checkers which I can see straight to the counter. It's not crowded at all.\n\nI walked in and there was a funny smell...you would think I would walk the hell out. Right!... WRONG! I ordered the $3.00 chicken bites w/fries and a banana shake. The cashier asked if I wanted any sauce. I replied \"honey mustard\". I was than told the sauce would be an additional .23 cents. I asked when did this start. Mind you my son orders these bites a lot by my home and I never had to pay for a sauce separately before. \n\nOverall my Banana shake was delicious and the food was alright. But charging for the first dipping sauce. I'm not with that. \n\nIn addition take care of that odor.", "author": "Teniqua K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "I came in to order some food and I had received a drink. I had accidently spilled some of the drink on the floor. The cashier proceeded to be extremely distasteful and told me I had to clean the liquid up. I had said that was not my job and left the store with my sister and our food. She then proceeded to follow us out of the restaurant and harrassed my sister and I and she threw the drink out of my hand like a barbaric imbecile. I had called the cops and they told us to not come back- anyways the whole experience was truly appalling- I cannot believe a worker like that exists within this establishment. Seriously, you can go to a place like shake shack and be respected and have better quality food than to come to a dump chain like this with trashed workers who are miserable and violent.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "I ordered off the board a combo. The board has a price. When I got the bill is was higher. It seems I was automatically up sized  to the Go Big option without my consent. The cashier was very unfazed by my questions. Basically \"that is how it is\". I feel cheated and a classic bait and switch.\n\nBeware the GO BIG scam", "author": "KENNETH W. C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Ive come to this Checkers location a couple of times and have previously had fries, fish sandwiches and their bites boxes.\n\nFood freshness and preparation standards are so-so. Not all the time but half the time I get the fries they look like they've been fried in old oil multiple times. \nSandwiches here are subpar as well. Looks even more thrown together than other fast food locations.\n\nBut let's talk about the soda I was offered once (photo attached). That was a Coca Cola that I ordered. Does that look like a Coca Cola to anyone? LOL. Tried my drink before realizing it and opening the cap and it basically tasted like like plain seltzer w/ a hint of coke.\n\nService wise, the typical expected at a fast food restaurant.\n\nWould come here again if starving, but definitely not with high expectations.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "Ordered a fish sandwich meal, got served a chicken sandwich instead. So obviously I was not a satisfied customer.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-01", "description": "Cheeseburger Special Deal = Buy 2 for $3...a deal I couldn't resist. The cheeseburger tasted alright...better than McDonalds, but not better than Shake Shack. The onions, pickle, and sauce in the cheeseburger really gave the meal a boost and complimented each other quite well.\nSpace here is limited; it is suggested to eat elsewhere since the space seems ratchet...it's usually filled with high school kids from god knows where...", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "A good place to go, if you want to grab a burger and fries, but you hate the overcrowded McDonald's. Now, I'll get this out of the way, the atmosphere in that place is definitely subpar. So I'll agree with other reviewers on this. Service can sometimes be slow, depending on the time of day and how many people are working. Luckily, I found that the food compensates for the shortcomings. Got the big Buford, large fries, and large soda for around $9. There are always good deals available, and coupons you can redeem. The food was delicious. Big Buford is sort of a Big Mac, checkers style. Definitely better than its McDonald's counterpart. Fries are okay. Roadhouse burger (with bacon strips on top) is probably the greatest burger I have ever tried. I can't speak for the other foods, as I am a recent customer, and the menu is pretty new to me. But overall, I would go there again in the future.", "author": "Vladimir S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "Ghetto area but the place has always been clean, the hours are amazing (open until 2 or 3am depending on the day), and the fries are addictive. I've been twice now late at night and they have to make the fries fresh for me so both times theyve been piping hot and delicious, they're covered in a seasoned batter that makes me coming back. It's interesting to see a fast food chain have burgers, hotdogs, and wings though I wouldn't go out of your way for any of those here. I had a burger, it was about the same as a McDonalds burger, meh but dirt cheap. Shakes are good but not as good as McDonalds or Burger King. It's really the fries that makes Checkers stand out (and the hours). \n\nAlso they actually have a outdoor private patio! Sadly it closes at a certain hour so I've only snuck a peek at it but it's something worth mentioning.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-19", "description": "Fries are addicting.  Burgers are cheap (like 2 for $3) but very small and taste worse than Burger King's.  No smoothies when we went at ~8pm.  Private outdoor patio in the back has lots of potential.  Hope they clean it up.", "author": "Jing X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "I asked for salt for my fries. Instead, all I got was a salty attitude from the guy behind the counter. And they didn't even have napkins either.\n\nThe food is standard fast food.\n\nAn extra star for the customer restroom.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "One word to define checkers: ghetto.\n\nChicken bites \u0026 fries combo box was $3. \n\nDirt cheap but you get what you pay for. \n\nStill a step up from McDonald's I guess.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-13", "description": "Food is dry. Ordered chicken and it was like eating cardboard. And fries are way too spiced up and greasy. Worker asked 5 times what drink we want and every time we said Coke. Eh...I don't like it. Not going anymore.", "author": "Sofya Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Believe me, I was very skeptical when walking in.\nIt does look a bit run down indoors, but the Deep Sea Double Fish sandwich was worth the risk.\nThe fish fillet actually looked like fish, but the generic kind across the street at MCD.\nAnd the bun was toasted and crispy.\n\nFor a little more than $3, I was happy for my day worth of protein.\n\n5 stars for the food.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-21", "description": "There's nothing spectacular about Checkers, but there's nothing wrong with them either. I usually hit this spot after a jaunt at the bookstore or movie theater across the street. Hey, it's cheap, and I don't have it so much that I get sick of it. \n\nAlso, the fries are undeniably bomb.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "I've been coming to this Checkers for the past 2 months after school and when I really need something quick, cheap, and hearty greasy goodness I go here! I normally get the 2 for $4 Spicy Chicken sandwich, with small fries, and a 16oz coke cherry soda. Then replaced the spicy chicken sandwich for their new BIG CHICKEN which is also 2 for $4. It's supposedly a pound of fried crispy chicken on two big pieces of toasted soft bread (not a bun!) with shredded lettuce and mayo on both sides. I could honestly never finish up the 2nd sandwich and also been ordering medium fries (I'm a piggy) because...it's checkers fries...try it, and you know what I mean.\n\nI always go for their version of a $1 menu, even though some items are around $1.19. I do go to a very expensive college near by so I really stretch out my dollar.\n\nAt exactly 12pm this place gets crowded, because of the lunch hour rush but you'll still be able to order and pickup your food. You'll still be able to seat and dine in, they do have the lonely seats against the wall, the other side tables and chairs, and an out door patio. \n\nThis place is certainly better then McDonald's on Court st because I see they have security guards waiting outside the place....that doesn't seem to friendly for me.\n\nStick with this Checkers, they have better deals, and better prices. You really get a lot more for the money.\n\n\nQuick tips:\n\ntheir $2 chicken bites is a bit bland but I still get my usual.\n\nmy addiction\n\nnom nom nom\n\nnot so crowded thank god!\n\nso glad there is a checkers in a good neighborhood. I was starving and I was in need for food. Small little place but not so crowded at all!", "author": "Rosanne W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "Ordered food for the first time from Checkers and this happened to be the one I went to. Wasn't expecting a gourmet burger but boy was this worse than McDonalds. Ordered a Checker double with no cheese. My burger came with out cheese( just as I ordered) but I guess they figured I wouldn't like the standard burger toppings such as tomatoes, onions, lettuce, mayo so they omitted those as well for me. All my burger was topped with was ketchup and two disgusting pieces of pickles. Never again.", "author": "Mariam B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-28", "description": "Large\nMilk shakes\nAre big. Quick\nBurger joint that\nIsn't always so quick. Cheaper than shack.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "Every time I come to this checkers the employees are super loud. They are short on staff and take your orders extremely slow. \n\nAlso, if you enjoy roaches crawling all over your ice cream/milkshake machine this is the place to go. As I was placing my order I stopped in mid sentence as I noticed a roach crawling down the wall, quite disgusting if you ask me. If they had better management their atmosphere would be much better which this is unfortunate, because checkers food is always good.", "author": "Francine C."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Checkers", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/uFGvt1JXvSzeEmssa2kzQg/ls.jpg", "@type": "Restaurant", "telephone": "+17187975333"}