{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "You would never guess this place has a beautiful and large outdoor patio in the back. So grab a burger and enjoy the sunshine!", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-09", "description": "So after an underwhelming dinner last week, I walked by Checkers; making note of some of my friends defendants inside and thought to myself, \"my skin's been surprisingly clear and the blood has just been wooshing through my arteries recently; why not eat a 3,000 calorie meal dripping with enough bacon grease to keep an axle spinning for years to come?\"  \nSo I walked over to a friends place.  She was eating paella and watching Ghostbusters.  \"I find her interesting because she's a client and because she sleeps above her covers... FOUR FEET above her covers!\"  \nI walk back over to Checkers, deciding on the Big Buford (which I guess is their version of a Big Mac, with really very little discernible difference in taste) and an order of Bacon-Ranch Fries...oh yeah, that's right, I went all out!  Bacon-Ranch Fries are just what they sound like: an order of Checker's french fries fried crispy in fryer oil that seems like it hasn't been changed since the Regan Administration, then drenched in ranch dressing and what I would estimate is nearly a half pound of low-quality, greasy bacon.  \nI took a bite of my burger, then forked some fries into my mouth...my arteries shed a tear.  I took another bite and another forkful of fries...I think I felt my heart stop.  \n\nCheckers is where you go when you want to have fun abusing your body and know full well that what you're about to do is wrong.  Like going to a crack house, hanging out with hipsters without the aid of anti-psychotic medication or having unprotected sex with Lindsey Lohan.", "author": "E W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "The Fries were good but the burgers were a risk to take. I ended up getting really sick after eating there. Apparently for me, it was a miss. What can you expect from a fast food place?", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Low, low prices-much cheaper than McD's across the street.  Burgers are freshly made.  HOT fries and chili.  Friendly counter lady.  Great value for the price.", "author": "Leihsia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "Not Bad For In Indoor Checkers.Great Burgers And Gotta Love There Fries!!!!Location Is Very Good Right Across From The Movies....", "author": "Maurice W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-08", "description": "I want to like this Checkers.  I really do.  It's on my way home from the subway, it's (at least theoretically) better than McDonalds, and it's closer to my apartment than Five Guys.  My first trip was a couple of days after it opened, and it took forever to get food, and I was pissed off, so I decided I'd give it another shot, so here it is.\n\nI stopped by at about 8:30 on a weeknight.  It wasn't crowded at all.  There were (I counted) twelve people working behind the counter, probably more than there were customers in the place.  There were two or three pending orders.  There was nobody on line to order food when I walked in, but it took me a minute to decide what I wanted and another customer got ahead of me while I was deciding.  The two of us waited about three minutes before one of the twelve employees decided to take our order; they filled a pending order or two in the meantime.  Pretty poor, most of them were just standing around while we were waiting.\n\nEventually I ordered my burger, fries and shake.  It took about another five minutes, because, you know, that's a really complicated order at a burger place.  This Checkers takes the term \"fast food\" to new lows.\n\nThe burger was alright.  A little better than McDonalds.  The fries were good.  The shake...  ugh.  Came out of the machine very fast.  Felt very light in my hand for the size of the cup.  Translation:  A lot of air in this shake.\n\nI'll probably come back again because it's convenient, but after I do, I'll probably also be upset that I didn't spend the extra ten minutes walking and go to Five Guys instead.  Overall, they can do a lot better.  This could be a four star review if the service was on par with any fast food place anywhere in the country, but it was just painfully slow.  I'll happily revise if it's better next time.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-18", "description": "Walking thru Brooklyn - is a Adventure. A little chaotic walking from Downtown Brooklyn, passing thru the Supreme Court.\n\nAlways on the lookout for a decent burger. Sure every little mom \u0026 pop shop trying to make a burger - no one comes close.\n\nI try to rank my favorite burger to Tommy's Burger in Downtown Los Angeles, CA.\n\nSo you walk into Checkers Hamburger Joint - you notice the Diner decor, but the smell - is the one that hits you once you walk thru that door.\n\nCheckers has the Best and friendliest workers in Brooklyn.\n\nCheckers has the Best French fries and their Hamburgers rate - maybe 7 or 7.5 out of 10. Add the Cheese, Chili and raw onions - it will definitely bring it up to 8.\n\nValue meal - Checkers has a value, overall - better than Mickey D's or Burger King.", "author": "OmegaFatty A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-03", "description": "Their wings and burgers were alright. Nothing special about them. Their fries were pretty good. Tried out their bacon, ranch fries. Heart attack food. Ha ha. Reminded me of Jack In A Box's we've got in Cali.", "author": "Kalita N."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Checkers", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/uFGvt1JXvSzeEmssa2kzQg/ls.jpg", "@type": "Restaurant", "telephone": "+17187975333"}