{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-19", "description": "Okay i visited this resturant a few days ago, the food there was great, the lines and wait time to collect your order was horabble, for a fast food resturant it need to speed up the orders, \n\nWhat impressed me the most was the manager dispute infont of the customers with her casher, i had to asked myself how can a child with a getto attitute manger a shift, and treat her employee like that, really it was like if she was bulling the casher instead of training and development of that employee, \n\nThe so called litter girl who is the shift leader need to really work on her management skills and focus on deliving her order faster. Overall that type of abuse from shift leader to employees is no placed for my money.", "author": "Sparkles L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "I went there today for dinner.  I had a bacon burger.  It was decent and oily like it should be for a burger that is.  It came with red onions, pickles, and cheese.  I also got an order of fries.  Man were they crispy delicious! My hubby opted for the spicy chicken sandwich which came with fresh lettuce.  It was not bad--I had bite to check it out.  I think that the items arrived in a timely manner.  More than that, the price is more affordable than McD's.  One thing that I would prefer is that they have a bathroom--unless they do and I did not see it?", "author": "Polly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "What am I supposed to say....It's Checkers!\n\nAlways loved them when I lived down south....The food was good...The people were nice....The store itself is a bit rundown and the seats are torn....\n\nAgain...It's Checkers!", "author": "Nicholas R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "I've been here far too many times...why is it that after 5 drinks my brain turns into one huge craving for grease and salt??  Whatever the reason, I really enjoy Checkers (even sober!) for their seasoned fries and burgers.  I love the Cheese Double Cheese and fully loaded fries (fries with bacon, ranch dressing, and cheese).   \n\nDon't look at the calorie counts, what's the point?  \n\n**Essentially, this is the ghetto McDonald's, both in terms of patrons and prices.  So yeah, swagger in accordingly.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "Checkers food is not the greatest but they have the best cheese fries hands down! also they are the only fast food chain that has a banana milk shake! otherwise I don't eat much of anything else on the menu to be honest......", "author": "Eric S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "I love Checkers.  I was so excited to hear that there was one that was easily accessible in NYC (vs. the one I always saw from the highway in Co-Op City - too far).  I met a friend here and was so excited I kinda ate way too much.  I hadn't had their fries or a Checkers vanilla shake since I was in FL in December, and I had been dreaming about them since I knew about this location opening.  I ordered a meal so I had a spicy chicken sandwich and a gi-normous diet coke in addition to the aforementioned fries.  I of course had to add a (small) vanilla shake to that order.\n\nThe restaurant was clean (however, it's also new, we'll see what it looks like in a year).  It's very small, has several booths and a long counter with stools along the opposite wall.  I'm used to Checkers being a drive-thru only establishment with a couple tables outside so this whole eating inside at checkers makes it a new experience for me.  When we got there it was half-empty, but soon after it was packed.  Its location is great because it's right across from the movie theater on Court St.  You can fill up on spicy fries and banana milkshake before you waste your money on overpriced theater candy.\n\nI enjoyed my food, but I think if I didn't know how delicious it was from growing up with it, I might not have been so pleased that day.  My fries had obviously been sitting there too long, because they were lukewarm.  That's the best part of going to Checkers!  You can get burgers and chicken anywhere, but their spicy fries are so good.  I'll blame my cold fries on it being a new restaurant and therefore being full of new employees.  Also, the booths are not bolted to the ground.  The seats move quite a bit as you sit down and as you get up to leave.\n\nI will definitely be back.  Expect an updated review soon.  Once I get my hands on some piping-hot fries, that 5th star will appear.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "After reading about a Checkers being under construction in Downtown Brooklyn, I did a bit of research and the picture painted was that it's essentially the Aldi (discount grocery) of fast food joints. Checkers calls itself \"nation's largest chain of double drive-thru restaurants,\" a claim which has too many adjectives to be \"the largest\" of anything.\n\nThe \"dual drive-thru\" concept is so much of Checkers' image, and gave me a hard time guessing how an urban (non-drive-thru) location of theirs would operate.\n\nBrooklyn's first and only Checkers is located on Court Street Downtown, right across the United Artist Cinemas. It's a rather good location to run a late night spot indeed (late-night moviegoers). Much of the rest of this area is dead at night and even on the weekends. In fact, there are a string of fast food joints just two blocks up the street which cater entirely to the office crowd and close at the end of the business day.\n\nUnlike Checkers' drive-thru locations (which probably make up 95%+ of its properties), this location has a good amount of seating, with three booths and bar-style seating along its right wall. It even has a patio in the back with three round tables.\n\nCheckers' menu is huge. They have about every kind of unhealthy-but-tasty food option you can imagine. Burgers, chicken sandwiches, chicken strips, fish sandwiches, hot dogs, and gooey deserts. In fact, Checkers doesn't have a single healthy (or even healthy-looking) option! My previous Aldi reference also refers to, beyond the simple interior, the large menu of $1 to $2 items, listed separately on the menu.\n\nI went with a combo consisting of the Bacon Champ Burger (630 cal), could have done much worse!), medium seasoned fries (420 cal), and a \"medium\" (32oz) diet coke (1 cal). All this cost me about $8. It was 9pm and only my second meal of the day after a low-calorie breakfast, so I had no regrets! I was given a receipt with a number and my order was ready in about four minutes.\n\nThe burger was delicious and had slightly less manufactured taste than I had expected. The fries (always served seasoned) were crispy and especially enjoyable.\n\nThe staff was extremely friendly (granted, it was their first week!) and they were keeping the restaurant extremely clean (tables were wiped twice during my 15-minute stay).\n\nAll-in-all, Checkers offers a great alternative to the mega-chains and is a great addition to this corner of Downtown Brooklyn, especially with its rare-for-the-chain seating and patio.", "author": "Kai B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-19", "description": "This place NEVER has grilled chicken. After coming here a few times and asking for the grilled chicken sandwich and being told that the grill was off... I was annoyed and asked them if they EVER had it..... the young women behind the register rolled her eyes and told me no. Smh. If you don't have a menu item available.. ever.. you should take it off the menu!!! It's highly annoying. Hamburgers are gross, and tenders are hard. The saving grace for checkers is their seasoned fries and milk shakes.", "author": "Marla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "What can I say - cheap oily salty tasty unhealthy food. It's something when I don't feel like McDonald's. Service is often slow.", "author": "Terk C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "So, I've never had a Checkers burger. I previously had a bad experience with their milkshakes; but then I'm lactose intolerant so...it's starting to look like it wasn't the milkshake; it was a bad decision on my part....\n\n*present day*\n\nThere was time to pass till the movie started and I was feeling a bit peckish...so I sauntered in and ordered a Cheese Champ or something that sounds close to that....with their famous seasoned fries (that's what it said on the sign). \n\nIt didn't take long for them to make my burger and call out my number, so I was happy.... the burger actually tasted like it was made out of meat rather than the it may contain meat taste of McDonalds. I was happy. Then I was sad because I forgot to tell them no mayo and no tomato because normally they slap too much mayo on there and the tomato is either welted or dry. I was happy I forgot. The mayo wasn't over done and the lettuce, tomato and onion was fresh with a snap. It was delicious. \n\nThe fries....uhm....they were okay. I wish they were more crispy but they were well seasoned and the portion wasn't too huge.\n\nAlso, my Sprite didn't taste like Sprite vomited in water....so I was pleased yet again.\n\nFood - 7 out of 10\nAmbiance - 4 out of 10\n\nIt's a nice whole in the wall spot when you need a burger but you don't want McDonalds, Wendys or any of the regular over processed burger joints around.", "author": "Anastasia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-16", "description": "Crunch,crunch,crunch!!\n\nOk folks, this is the first time that I've ever munched at a Checkers, and this is my experience with this particular fast food chain. \n\nThe restaurant was clean, well lit, with comfty seating,nice service. I ordered the number 1, (I forgot what its called,sorry). Basically it was burger with two patties, cheese,lettuce, tomatoes,mayo, ketchup and red onion with a pickle here and there. The fries were deep fried and extra crispity. The burger was aight, but I must admit, I love their crunchy fries. By far the best fries I ever had! To me the burger was bland and boring, but their fries is what I love from Checkers. If any Yelpers, have been to Checkers which burger would you recommend, because to me the #1was boring.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "Maybe my expectations have hit rock bottom when it comes to the downtown Brooklyn area where I work, but I had literally zero to no high expectations for this place when I walked in. During my break from work I had wandered over to Court street to hit the bank and the bookstore when I spotted Checkers across the street. After surmising that there wasn't really anything else I was interested in along this strip, I tentatively walked in and *shifty eyes* glanced around...\n\nOkay, a little dirty, but that's to be expected in Brooklyn. I walked up the counter and allowed two other people to go in front of me as I was deciding what I wanted. I turned to the cashier, and lo and behold! She was friendly! Even smiling! I looked around thinking \"what the...\" and placed my order. She punched it in without incident and even asked if I wanted cheese on it (I'm not sure who puts cheese on a spicy chicken sandwich, but it ain't me). The total was $5.97 for the chicken sandwich, fries, and 32 oz. drink, and I had another \"what the...\" moment as I dug the change out of my pocket. I was a couple cents short in order to break a $20 evenly and she took it, said \"that's fine,\" and gave me the $15 back no questions asked. Now my reaction is \"WHAT the...how is this happening?\"\n\nLess than five minutes later, my food was ready. The cashier was still friendly, and I walked out feeling a little overwhelmed at the treatment I'd just received. I ate my spicy chicken sandwich, sans the optional cheese, and fries and actually thought it tasted pretty good. When I'm in the mood for an artery clogging meal again, I'll have to stop by and try it out again.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "I have to say that, if I hadn't lived near this Checkers, I probably wouldn't have ever tried it.\n\nAs is, the two fish sandwiches for $3 was what finally dragged me in about 3 weeks ago. Since then, I have compared the fish sandwich here to Mccd's, the new fish sandwich at Wendy's, and both the veggie burger and the fish sandwich at Burger King. \n\nI am going to have to say that the fish sandwich is better than Mccd's and Burger King and is only bettered by the new Wendy's sandwich. Probably not great for the cholesterol or the arteries, but very tasty, especially when they put on pickles and tomato. And, yes, the pickles are crispy and tasty, as is the tomato.\n\nI am also a huge fan of their spicy fries, I have ordered their fries a few times at this point and I definitely like them better than 90% of the fries that I eat.\n\nBeing that I don't eat chicken or beef, I have had to rely on the reviews of others to make a decision about the other sandwiches, but everyone who I know who has had either a chicken or beef sandwich has said that the sandwiches are better than both Mccd's and Burger King.\n\nI will have to add that once, when I went in to get my order, I was about $0.20 short, and the woman at the counter threw in her 20 cents, which completely shocked me. I did go back and pay her back, but still, that is the kind of generosity from a fast food place is unheard of.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "I've had the sandwiches and burgers here before and felt grossly sick from it (not in a food poisoning kind of way but a glutton eating the most unhealthy fast food ever way), but today I tried the fried apple pie and it was oh so tasty. I loved the McDonalds apple pies of the past that were fried and then they switched to the baked ones and they just weren't as good. I used to always order the apple pie at McDonalds in other countries because many of them still continued to fry their pies. Now I don't have to wait till my next trip to have one. Checkers has them and though they are slightly different since they have a heavy dusting of cinnamon sugar, they are still delicious. I couldn't have these on the regular, they just seem too sinfully good, but they definitely satisfy the sweet craving every now and then. Worth a try!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-03", "description": "Food: I'm all for having more options for lunch around BK Heights vicinity, since I work there. But this place has been knocked down to a mere french fry joint for me. The burgers weren't spectacular, comparable to other fast food joints and simply a fail when compared to 5 Guys a few blocks away. Come here when I have an unhealthy craving for french fries laden with melted cheese. Nice guilty pleasure, however half way through, I always regret it when the effects of all the sodium kicks in. Not even a quality guilty pleasure if you can't enjoy it all the way to the finish line. \n\nDrink: Fountain soda, milkshakes\n\nService: Usually only one cashier open, even though there are two cashier machines/stations. This always results in a long line. \n\nCrowd/Ambiance: Students, workers out for lunch. Few tables and bar style seating along one side of the store. The bar table is short so not much leg room for tall people or gut room for chubsters. Outdoor seating at the rear, but the tables are those stone tables with built in seating circa 1980's McD's. Highly uncomfortable and dirty.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Cashiers and food prep workers are very friendly and efficient.  Worth more than minimum wage!  The food itself is freshly prepared in front of you, and they will make it to order:  without onions, etc.  Prices are as low as you can go.  Where can you get 2 big burgers for $3?  The store is neat and clean.  They have a bathroom and outdoor seating for nice weather, in the back- a little known amenity.  I am a regular at this place.", "author": "Leihsia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-15", "description": "After a local fair I went to this place called checkers.... I asked for a plain cheeseburger, it took them like 10 minutes to find out how to put a plain burger in the system. Then it took them 10 minutes to get the drinks, AND it took 20 minutes just for 2 burgers. and they tasted really bad.\n\nP.S. I gave my dog a piece of the burger... he threw-up!", "author": "Ben D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-25", "description": "What drew me here was my inner child.  Not only do they have vanilla, chocolate and strawberry milkshakes...  but BANANA too!  I was transported to the world of semi-liquid banana Laffy Taffy.  Mmm.\n\nOK, other than that, there's nothing special here.  Decent fast-food grade burgers (better than McD's, but about on par with Wendy's and BK).  Tastily seasoned  fries are crispy, but somehow not starchy enough.  Still, it's near my office and I'll likely still stop here now and then.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-01", "description": "I have no childhood filled with Checkers food.  I think this makes the biggest difference with how you view Checkers.\n\nThe place is clean... like a fast food joint... quality of food... like a fast food joint... customer service... like a fast food joint... priced... like a fast food joint.  \n\nSure, the fries have an incredibly foreign, unknown \"secret spice\" (aka: pepper).  But other than that, I really could not distinguish this from a Berger King.  This place is no more special.\n\nI see no reason to go here above 5 Guys other than saving maybe $1.50.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "I love coming here after a good movie at the theatre across the street :) I was a bit concerned when I first ordered from here that the food would be gross but it was really good despite the fact we ordered so late in the night . Their 2 burgers for $6 is a good deal me with those fully loaded fries with ranch dressing bacon and cheese omg its so worth it ^_^ Great place to go to since I gave up on mcdonalds ... Will be going back", "author": "K S."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Checkers", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "111 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/uFGvt1JXvSzeEmssa2kzQg/ls.jpg", "@type": "Restaurant", "telephone": "+17187975333"}