{"aggregateRating": {"reviewCount": 10, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "Don't expect to find this place open all the time, their operating hours really only coincide with the Navy Yard's own daytime business hours. So if you work at the Navy Yard, please do come over here for lunch. \n\nIt's rather small and it can be very hot, but they make a great deal of sandwiches here, some of which I've been fortunate to try out. The nautical themed sandwiches are slightly more expensive but very much worth it, considering the lack of eateries in the neighborhood. They're easily the best deli within walking distance of the navy yard.", "author": "Mohammad H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-18", "description": "I walked in this morning to get a cup of coffee and my egg and cheese sandwhich, to my dissapointment they did not have coffee ready. I am not sure about anyone else but if you are a coffee shop, you sell breakfast, before opening you should have everything ready to go. I got my sandwich but no coffee, as i was in a hurry and i could not wait. Somewhat disheartening, now i am looking for my caffeine fix ...", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "You know that scene in 30 Rock where everyone goes crazy over the sandwiches that the teamsters bring? That's how good these sandwiches are. We ordered 4 and everyone got a quarter of each one. The named subs are Amazing. We got the Destroyer, Depth Charge, USS New York, and Missile Cruiser. This place is awesome is you're looking for a damn good sandwich that's a step up from your normal bodega burger or sub.", "author": "B N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Totally solid deli with great lunch stuff.", "author": "Luv2 L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "Have ordered a few sandwiches ever since they remodeled a few years back and it's always been a pleasant experience, very solid if you need a quick cheap lunch around the navy yards. \nThe nautical themed sandwiches are pretty good too.", "author": "Gee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-06", "description": "I go to the Navy Yard for lunch sometimes because it's right near the school i work.  not only do they have good sandwiches for really cheap prices, they also have lots of side by the quarter, half, or full pound. dishes and they also make hot dishes like pasta and fried shrimp.  the food is really good, espesh considering it's a corner shop, and the prices are good cause they give you huge portions.\n\n they have daily lunch specials ( fridays they make fish and seafood) but they also make breakfast sandwiches and i think theyre open really early for the people that work in the navy yard.  its such a cute walk in sandwich shop with the nicest workers.  theres a southeast asian guy there who is soooo polite its almost alarming.  like he's from the nineteenth century or something.  the guys are all really nice and friendly.  i honestly dont know how id make it through the school year if this place werent four blocks away.", "author": "maureen h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "I had been walking and/or riding by the place for 2+ years until I stopped in a while ago.  I love this place!\n\nGood sandwiches, great bread, fast preparation and, as Maureen noted, \"there's a southeast asian guy there who is soooo polite it's almost alarming.\"\n\nI love their \"signature\" sandwiches too.  Sail on Navy Yard Hero Shop.", "author": "Matthew T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "I work nearby and the place is always busy. All of their food is amazing. They use boars head, fresh chicken cutlets, overall all excellent quality deli food. \n\nhttp://www.menupages.com/restaurants/j-j-navy-yard-sub-shoppe/menu\n\nhere is a link to their menu on menu pages", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-04", "description": "They are across the street and I called for two sandwiches an hour ago. I hates it, precious! I wants sammies, precious! Evil troglodytes, precious....", "author": "Briana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "hey guys this place was taken over 6 months ago and its call j \u0026 j navy yard sub shoppe....the old place was call navy yard hero place and what a horror that place was....BUT GOOD NEWS!!!.. these new guys are the real deal man...they kept all the signature sandwichs...AIRCRAFTCARRIE,DEPTH CHARGE. USS BROOKLYN. USS NEW JERSEY...and they are even better then before...place was   redone and looks unbelievable...spoke with the owner jimmy he's not only a great guy but man this guy can cook!..everything is homemade receipe's from his grandma, mother, and wife. But this guys meatballs and chicken cutlets are off the charts!!!..I WILL PUT J \u0026 J 'S MEATBALLS AGAINST RAO'S IN HARLEM ANYDAY!  i tried to get the receipe from jimmy but he told me if he did that he would have to kill me!!...anyway this is a must stop right in front of the brooklyn navy yard off adelphia st on flushing ave i tried to call and the numbers changed. FYI...new number is 1-718-522-5150  .they do deliver in the area kid on bike and orders are always right ..(not like the last guy he  took forever)..give it a shot everyone good ITALIAN COOKING and a great guy running the place,", "author": "james p."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "M and J Navy Yard Sub Shoppe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Flushing Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0ePKIRIVUJyBqf4ICLniZw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225150"}