{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Halal carts use to be easy to find in Downtown Brooklyn and Brooklyn Heights, but over the past few years, they became harder to track down. Fortunately, things seem to be turning around... because now there are TWO regular carts near Joralemon and Court street... and Halalish is the winner hands down. In fact, Halalish's food is probably better than just about any cart food I've tried in all of NYC (except for maybe White Hot near Madison Square Park, which is my all time favorite because they give you like 5 french fries with your chicken and rice--random, I know, but interesting and tasty and just enough fries to make you feel like you didn't cheat too much).\n\nMy favorite things at Halalish are the Chicken Over Rice and Combo Over Rice (chicken and lamb). With each dish, you get a choice of either yellow rice or spicy rice (if you like spicy food, get the spicy rice). You also can dress your meal with a few olives and a pickled pepper! These definitely add a special touch.\n\nCheck this cart out if you're nearby and need a quick, tasty lunch. Oh, and the owner is super nice, attentive, and helpful. Kudos to you and your business! You are doing a great job.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "Great Kosher (certified glatt) food cart and a nice addition to the food cart community in Downtown BK. Yossi's is simple: it has three options: \n1) falafel (with or without \"chips\")  - $ 5. Spiced well, fried to perfection.\n2) Shnitzel, $7 on a pita (the pita being fluffy goodness) or $9 on a baguette.\n3) Fried eggplant and boiled egg sandwich, also amazing (sounds strange, but it truly is a fascinating israeli concoction).\n\nThey also have a variety of salads and fixings that you can choose from to put on your sandwich for no extra charge. Everything is super fresh and looks clean!", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "This new cart parked on the corner of Joralemon and Court during weekday lunchtime has been a revelation for the Downtown Brooklyn area. Since it started parking in this high traffic area it has seen fairly long lines for customers seeking to satisfy their craving for falafel during lunch.\n\nYossi's Falafel Cart has a very simple menu which is highlighted by its $5.00 falafel sandwich which is the focus of this review. They also have chicken schnitzel (!) and eggplant sandwiches which I will review in future quick bites. 5 dollars for a falafel sandwich might be a little steep considering the local halal carts and some delis nearby sell their falafel sandwiches between $3 and $4.50. However, dare I say you will not find a falafel sandwich in this area with more flavor then Yossi's. I was skeptical too. The falafel sandwich was constructed very simply but eating the sandwich was a satisfying experience.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "FOOD: I have never had anything from this cart besides the falafel. It's the single greatest falafel I have ever had...ever...in my life...ever. It's certified Glatt Kosher for those who are concerned, but not only is it that, it is full of amazing falafel flavor. The falafel hot sauce is the real deal and it adds just the right amount of spice to a falafel because a falafel SHOULD be a little bit spicy (and not because of tabasco sauce like some places!). I've had the fries once and they're pretty good too. But I can't go hear and get something besides a falafel so that should tell you how good it is. 5/5\n\nSERVICE: It's a cart, so you get straightforward cart service. He has always been both friendly and accommodating and if you go enough he will establish a rapport with you. 5/5\n\nAMBIENCE: It's a cart so expect standard cart ambience. Generator in the background, no seating, and outdoors, but amazing food. 5/5\n\nPRICE/VALUE: $5 gets you a piece of heaven called one of his falafels. Seriously. Best value ever. 5/5.\n\nSUMMARY: I think that last sentence sums this place up so well I'm going to reuse it: \"$5 gets you a piece of heaven called one of his falafels. Seriously. Best value ever.\" The only unfortunate part is I haven't seen him back since the fall. I'm wondering if he has a seasonal permit, and will be checking the corner of Joralemon and Court over the next few weeks to see if he returns. 5/5", "author": "Raymond R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "Kosher food is very limited in Downtown Brooklyn where I work, so it's very appreciated, albeit from a corner cart on weekday afternoons.\n\nI've been to Yossi's three times, tried the majority of the menu. Once had the falafel, once the schnitzel (fried chicken breast), and once the 'sabich' which is a surprisingly good hard-boiled egg/hummos/salad sandwich. So good my family started making them at home.\n\nThe French fries are hands down the best I've ever had. I'd say well worth it to go just for the fries. Not sure if they batter them or what but they're out of this world.\n\nI'm giving Yossi's a 5 also for freshness. I appreciate that they make everything right when you order it fresh (so you need a few minutes for the falafels to fry). Other places are great for stale/old food.\n\nSo for something kosher, affordable, quick and fresh, I say go to Yossi's. Would go much more often if it were healthier! I should tell them to make regular salads too...", "author": "S S."}], "servesCuisine": "Food Stands", "priceRange": "Under $10", "name": "Yossi’s Cart", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "Corner of Court St \u0026 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": ""}