{"aggregateRating": {"reviewCount": 70, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-16", "description": "Disappointed in the service, not my first time here. There where only two other tables that night and things kept being forgotten. The soup came out cold, things where missing on my plate that was on the menu and the \"jumbo shrimp\" cocktail was so small. I'm very shocked because i had such a nice experience the last time I visited this restaurant. The worst thing was the menu was prefixed that night so how can you mess that up? they can do better.", "author": "Julson J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "After working ten hours I felt too tired to venture out and find a place to eat.  This won out just being convenient, as it was in the lobby of holiday inn Charles was my server and was both friendly and informative. Having a pescatarian diet and not being overly hungry at the time, he was really helpful helping me recommending certain foods to fit my diet. \n\nI ordered two appetizers, the bok choy and the grilled artichoke.  Both were delicious. The sauce of the bok choy was so flavorful,  I wished I had some bread to soak it up. The grilled artichoke was perfectly paired with an olive tapenade and sliced almonds which complimented the artichoke brilliantly. \n\nI'm really disappointed that I didn't order a dinner but will both stay in the same hotel and definitely come back to try some more dishes.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "Finally had a chance to check out Brasserie Seoul this weekend. I'd been going to Chef Sung Park's intimate restaurant Bistro Petite for the past 4 years... every Birthday, Valentine's Day, random Friday night craving with my boyfriend was spent dining with Chef Park, so I was excited to see his larger scale restaurant near Barclays. \n\nWhen we arrived there we were sad to find out that Chef Park was not involved in the restaurant AND that the menu was in fact no longer Korean-French fusion. It was more American fare with so suggestions of Korean (i.e. fried chicken with daikon radish...). Disappointing, however, we wanted to give it a shot since we'd trekked over from Manhattan, so we stayed to try the brunch options. \n\nWhat do I think of the current Brasserie Seoul without Chef Park?\nIt's a good thing that they're changing the name, the current name as it stands is misleading. \n- Steak and Fries brunch -- if I wasn't starving I think I wouldn't have eaten this. For $23 I was expecting my meat to actually be medium and not chewy. The fries were okay as was the salad, but I've had better at places like Friedman's (which you should definitely go to if you haven't tried it already)\n- Beet Salad -- again, if I wasn't starving.... what's with the creme fraiche base? I don't understand this addition to a salad, its unnecessary. Also the whole idea of a beet salad is that it's heavy on the beets not the arugula. \n- Chocolate Cake -- this was a nice gesture to us from the kitchen and current Chef. We did really appreciate this as it was a birthday brunch.  \n\nMy final thoughts, I did like how bright and clean looking the restaurant was. The natural light was nice especially during a brunch. This place is like any 3star hotel dining option. Not worth the trip, but if you're staying at the Holiday Inn or in the area and just in the mood to have a couple drinks, not the worst option.", "author": "Devonne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "All the photos are of food they don't serve.  The steak was dry and the wine too sweet.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "Delicious French toast for breakfast...\n\nFor lunch I had a grilled chicken sandwich and my friend had the burger. Both flavorful and service was fast!!", "author": "Q B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-01", "description": "Not what we had hoped. We're big fans of chef Sung Park and used to frequent his restaurant Bistro Petit until he closed it to relaunch Brasserie Seoul. Unfortunately the menu was completely different than what we had read about online and it now appears as a mess of random things: \"Mediterranean platter\" \"Polish cod\" \"bistro burger\" \"steak and quinoa\" \"chicken wings\" \"sushi\". What's the theme here? Where's the French Korean influence? No \"farro mushroom risotto\", no \"oysters and pork belly\", no cassoulets, boeuf bourguignon or duck that we'd seen advertised. Very disappointing!!\n\nWe tried the fried chicken wings which were soggy, tasteless and most likely microwaved. The truffle mac and cheese was fine. The 10oz steak was very plain, lacking any sear, flavoring or sauce...it was just a slab of unseasoned meat. Salmon was ok but also lacking, though nicely plated. The \"passion finger\" dessert was good. We tried several different cocktails and found them disappointing and overly sugary, filled with neon juice and syrup. At least the waiter was attentive and the restaurant itself is clean and sleekly designed (though hardly \"intimate\" as listed on here).\n\nBesides the misconceptions about the menu, we'd also hoped for a bit more of a spiffy atmosphere because Yelp lists Brasserie Seoul as \"dressy\" and \"upscale\". Turns out this space is connected to the lobby of Holiday Inn with diners in t-shirts and sandals, on their computers, dirty ripped menus, pop music, etc. which...whatever, I'm fine with casual dining, but we once again found ourselves feeling mislead. The whole night wound up being an underwhelming experience.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "A beautiful scenery! Love it! I love to go out for a casual dinner with family or friends from time to time.", "author": "Mia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "I love the casual setting!!! I love coming here with all my family and friends! I will be back! The drinks were amazing as well.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "When I arrived I was little skeptical. The appetizers were okay but could have been better. However the entrees and desserts were fantastic. This is a place I will eat at again.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Worst experience for our group. The place was not busy this Saturday but it took half an hour to get our drinks, another half hour for the appetizers and an hour for the main course. The food was overcooked and the chef who was on the phone most of the time did not want to address our concerns. He talked endlessly to some people at a table behind us. He did not care. The server was okay. The only thing that came out okay was the duck leg, the rest of the food we ordered was bad: the cod, tuna and a mix of mussels dish. If this place is to last, they need to respect their food and their customers.", "author": "Ishmael N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Love their margaritas and sliders never had dinner. their wings are hit and miss I didnt care for the pasta with crab meat the staff is very friendly", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-03", "description": "I'd say this place was a little overhyped. Everything is good but nothing really stood out either. I got the fricassée de champignons for an appetizer cause I got lured in by the truffle oil but I'd recommend getting some of their other appetizers, I made the wrong choice. I quite enjoyed the prawn pasta. Gochujang worked well with the tomato sauce without overpowering the tomato taste. Risotto (more mushrooms for me) was nice, def recommend for the vegetarians out there. The cassoulet was my least favorite. Very heavy, got a little too oily in the end for my taste, couldn't really taste the kimchi mixed together and there were a LOT of beans. It also took a while for the food to come out. You'd definitely get a satisfying meal here but I wouldn't go out of the way just to eat here.", "author": "Songnia X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "This French-Korean establishment has been on my foodie radar for some time now. It was on NYC Restaurant Week list for several times already and have always wanted to try this Brooklyn restaurant. I'm glad I'm coming in today to try it. Very delicious and interesting appetizers. The bone marrow was AWESOME. Even my dinner companion insists we must try it again for next dinner. Modern trendy decor restaurant with a touch of Korean French fare! Wonderful wait staff and compliments to the chef and staff.", "author": "Alvin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "I dined here for the first time two nights ago, and I was impressed by the atmosphere, range of menu options, and attentive staff. The Beef Bourguignon was excellent, and the wine we ordered was so good that I will definitely order again.  The manager chatted with us and sounds like they're redoing their menu, so I'll definitely be back once that's rolled out. I think this restaurant needs to advertise more - it was a really nice dining experience!", "author": "Leigh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Went here last Thursday night! Made a RSVP and was taken to my seat quickly! Had the margarita cocktail which was great and served with crushed ice which I loved! Not overly sweet at all!\nWe ordered the tomato and buratta salad- was yummy and fresh, amazing way to start a dinner! Then we tasted the mushrooms- so much flavor! Dip the toast in the sauce! ;) also tried the truffle tduck and cheese- which was my favorite of everything- very comforting, lots of cheese, truffle with a slight chili kick! Then we had the fish which was very special and the sauce which we have to have again! Everything was exceptional and we are definitely planing on trying the brunch here too!! Service was good! They kept our table cleared and packed some leftover for us too! So happy for places like this in Brooklyn!", "author": "Neti B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-17", "description": "Service is nonexistent. Nothing French or Korean about this place. Same old American food like most other mediocre restaurants. Oysters and \"fried chicken\" sucked. No decaf coffee (at a hotel)....... yogurt panna cotta came straight out of the fridge and tasted old. Wife's tuna salad... tuna was definitely old.. Only reason it's getting 2 stars is they had a good burger and good happy hour deals ($8 cocktails $5 beer/wine). Will for sureeeee never be back though", "author": "Silas N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "I have been stopping here for lunch on Sundays.  Excellent food! I love the French Korean fusion. The wine by the glass is outstanding!!", "author": "Emco H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Came in for dinner the other night was a blown away, this restaurant has been having mixed reviews but me and my girls had an amazing experience. The decor and lighting was perfect for ladies night and the music was good but not over powering the room. We just got the , the fried anchovys and the Fries with the home made ketchup they were both so delicious, we were craving more but held back our urges. For our main course we shared the Kimchi Boulabaisse and the duck trio everything was packed with taste and amazing flavor and the aroma was to die for. Some of us stuck to wine while others tried drinks from their cocktail menu (\"Sun also rises\" and the Daiquiri) and I think we just found our new favorite place for drinks this summer would definitely recommend a visit here because we definitely will be back!!", "author": "Mafe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Excellent experience. The vibe is nice and the food is truly delicious. We had Truffle Tteock \u0026 cheese that exceeded our expectations. Both entrees Tuna and Cod were delightful and intricate. The wine is list is great. We tried Noble Tree Cab and Cote Rhone as well as as Vino di Visciole for dessert.", "author": "Maya D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "First I'll start by saying that our waiter Charles enhanced our experience with such excellent customer service that will keep us coming back!\nThe food was exotic and is the example of fine dining that was worth every penny!", "author": "Jonn B."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Brasserie Séoul", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "300 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K_En4RdIwU-pHslC0fg3NQ/ls.jpg", "@type": "Restaurant", "telephone": "+17183301099"}