{"aggregateRating": {"reviewCount": 70, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "We came in on a Friday night and got seated immediately. Looks like this place was recently renovated and rebranded as a hotel floor restaurant. I'm glad they added a Korean twist to their food.\n\nWe started with oysters, which were good and decently priced. The bulgogi plate came in a cast iron and was delicious. We also opted for the Korean fried chicken wings, which were so amazingly and surprisingly spicy. \n\nGreat and friendly service. An awesome find in DoBro if you need a quick evening option.", "author": "Kevin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-18", "description": "This review is just for the food. Service was great, very nice and accommodating hosts/waiters. (Would give 4-5 stars based on that alone)\n\nBrasserie Seoul based on the better views, sets higher than normal expectations for hotel restaurants but doesn't meet them. \n\nThe food isn't inedible, it just isn't what you would expect. Having made these dishes myself before and watching pro chefs online prepare them, this is my best guess at how Brasserie Seoul put the following dishes together:\n\nKorean fried chicken wings- mostly likely reheated frozen wings (soggy skin).\nTruffle mac n cheese- most likely instant mac, no flavor and just a bit of watery cheese. \nSteak au poivre- no peppercorns (queue Sterling Archer).\nHudson valley duck- duck breast was cooked well but no seasoning.\n\nI'd skip eating here altogether since you can probably go down the block and pick up a pastrami egg and cheese that won't disappoint lol\n\nSide note: Yelp page reports the venue dress code attire as 'dressy', it's not", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "We were staying at the Holliday Inn and were happy to find this place.  We sat at the bar every night and Jordan took great care of us, remembering our drink orders and making recommendations.  The bar menu was pretty good, chicken nachos and fried chicken were tasty and if you like spicy, try the Korean wings.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "Amazingly beautiful restaurant and nice setup. There's a place in the back that's outdoorsy without being exposed to the elements; as perfect as one could ask for. \n\nBRUNCH TIL 4!!! Really good menu setup and honestly a slamming burger if brunch isn't desired. \n\nShannon is a solid waitress. It's refreshing getting someone genuinely nice and attentive.", "author": "Benny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Great atmosphere! Live music on the weekends really compliments the experience", "author": "Tuck G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "After dining at Bistro Petit, I knew I had to try out Chef Parks newest venture at Downtown Brooklyn when I learned about it in on NYT! \n\nClient lunch, shared appetizers and desserts. The restaurant was bright and cozy. The Chef came by and explained the inspiration and key ingredients of the dishes, giving personal suggestions on which main we should go with. \n\nWe started with a simple field green salad with wild flowers, heirloom tomato salad, truffle tteock \u0026 cheese and fricassee de champignons. All was delicious and easy to shared! The truffle tteock \u0026 cheese was the crowd pleaser, assembling a decadent Mac \u0026 Cheese but with the Korean rice cake. So delicate but satisfying! \n\nI went with the Beef Bourguignon and I know it is good because I had a version of it at Park's Bistro Petit. It is presented differently this time with a lid which is a subtle nod to its Korean inspiration galbi jjim. The short rib is so tender and every component of the dish balances with earthiness, saltiness and sweetness. \n\nThe meal ended with a tart Blueberry Soup and Beignet with ice cream. My clients were impressed and I again was wow'ed by Chef Park's creation!", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "Where should I start......\n\nUpon arriving there was no one at the hosts desk, we practically had to seat ourselves. Once we finally got someones attention we had to use the bathroom. Bathrooms are locked because it is attached to the hotel, we had to ask for the bathroom key, TWICE.\n\nThe appetizers were ordered, and they never came back to get our entree order. Once we were half done with our appetizers they took down or entree order. The appetizers were okay, I did enjoy the Portuguese octopus but the artichoke flatbread and burrata taste like something that came from a jar. The beef tartare was okay. \n\nOnce our entree orders were in, we waited for a good 20min to get our food. Once arrived, one of the orders were wrong, so we had to wait for that to get cooked. I got the long neck clams in linguini, it was WAYYYY too salty. We also go the steak which was cooked to our specifications but didn't have a great taste. The burger was also okay. \n\nOverall the experience was not great, I feel bad because the name of the place gives off an interesting name of Korean fusion. Nothing about the food was Korean, and barely French. Seemed more Italian to me. The waiter did try to justify the experience by giving complimentary drinks etc but the restaurant just isn't as good as it used to be. I hope they improve the staff as well as the quality of food.", "author": "Julio G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "What brought me here is that I always used to go to bistro Petit and then Chef Park came here. I loved that they had a book on oysters. I got the prime burger, medium rare as per usual, and my friend ordered one the Cavatelli Both were great. The fries accompanying the burger were crispy on the outside, soft on the inside, thick and well seasoned. The cocktail I got - the expat punch was great as well, reminded me of a whiskey sour. I chose it for the toasted barley tea and the toasted barley flavor didn't really present itself but it was still a solid choice.  Then for dessert we split some sort of fruit mousse, I believe it was either mango or passion fruit with strawberry. The interior is very white, with pop music playing in the background. Neither too casual not too buttoned up. I would definitely visit again", "author": "Celia N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "Food took too long to be prepared... wasn't much to prepare... most of the food was also cold. The service as well was lacking in attention. Between ordering and the buffet might as well go to an ihop you'll get better service.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Love the ambiance in this place, it's right In downtown Brooklyn, never have a bad experience here and the food is always good. Not my first time here and def not my last.", "author": "Romy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Beautiful location- a hidden oasis with enclosed outdoor area in back. Great drinks too!", "author": "Cristy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Very quality establishment. Excellent service and excellent drinks. Food was very good as well. All around great place - very convenient for downtown Brooklyn. The manager (Shannon?) and bartender (Jeff?) were great and very friendly.", "author": "Channing H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "Waited 40 minutes for 4 eggs and breakfast potatoes which I saw the waiter take from the hot bar. The eggs were runny at the top, solid at the bottom, and appeared to have been dropped on the plate from a distance. When I asked for them to be recooked the waiter pulled out his notepad and tried to tell me I had made a mistake when I ordered. None of the meal was comped and they didn't make any attempt to rectify the problem. We had to go to the front desk of the hotel to complain and they helped us.", "author": "Olivia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "Pretty chic restaurant. Dropped in on a Sunday afternoon for some brunch. I was seated immediately, severs were very attentive. The waiters name was actually Ricky very pleasant young man and gave some great suggestions. I ordered the Scottish salmon which I substituted the zucchini and leeks for greens and quinoa. Salmon was crisp and flavorful. I wish the green beans were warmer they were a little under luke warm. Nonetheless, still decent.", "author": "Karen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Boyfriend texted me one day about how I needed to check my email ASAP. Turns out that chef Tae Goo Kang opened up a new restaurant after closing the one in Williamsburg (Bistro Petit). We were excited to go, but left feeling sad and hungry.\n\nHere's our takeaway:\n-Food is delicious but not worth the price point.\n-Service is subpar for the price point, too. We got the oyster pork belly, and nobody seemed to know which oysters came from where. Server kept dropping utensils and was aloof when there were only 3 other parties in the restaurant.", "author": "Susie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "This is a great restaurant! The food is delicious and the atmosphere is very classy..Great for a day/evening out for intimate dining or casual with friends", "author": "Dawn O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-18", "description": "What happened to the chefs signature French and Korean dishes??!?! Bistro Petit was amazing, and the only reason that I dined here was to have the Kimchi bouillabaisse. What a let Down.", "author": "Ariel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-28", "description": "The first time I dined here about six month ago, the name of the restaurant was Brasserie Séoul, and the cuisine was clearly defined as French-Korean Fusion. The dishes were unique and satisfying, the waiters were incredibly friendly, and the restaurant was fully deserving of a four star review. I came back last week and saw that \"Séoul\" has been dropped on the menus, although not on Yelp or even on their website, so judging by the new name alone, I'm guessing the cuisine is now simply French? Things I saw on the menu: 3 different Italian pastas, Italian crudo, burrata flatbread (that would be Italian again), Portuguese octopus, Mediterranean hummus/olive/feta appetizer, just to name a few. Things I did not see on the menu: a single French dish, unless you want to count the fact that French fries go by Frites here. Confused? Yeah, me too.\n\nSo here's where things get even more complicated: I came back here for the weekly Monday CUBAN night and the extended happy hour because my boyfriend's parents were staying at the Holiday Inn right above Brasserie. Our waiter got instantly defensive when we asked about the happy hour, rudely stating that happy hour only goes until 7PM daily, and that the only Monday special is the discounted mojito. He then rushed off to loudly complain about our question to the bartender. Exact words on the Monday menu \"Live Cuban music. Happy hour 6PM to 9PM. ALL NIGHT $7 Cuban Mojito.\" To clarify further, the restaurant is open until 11 PM and has a long separate Happy Hour menu. How would you interpret that \"special\"? We made the mistake of staying even after all this because we were exhausted, but I wish we had found better plans for the night once we knew the whole Cuban night and happy hour was a fluke. Oh, and there was no band or live music anywhere in sight. No es bueno.\n\nThe $1 oysters we managed to order right before 7 PM would be something positive to point out, but our waiter went to complain about us yet again to the bartender when we asked for crackers or a side of bread to have with the oysters, then awkwardly came back empty-handed having forgotten to actual bring the crackers or bread and had to be reminded. Also, the oysters came with a side of salsa. ¿Que? The salmon entree was overshadowed by the simple side of polenta it came with, although not one person out of our group of four could taste the truffle oil that was advertised for this dish. The artichoke flatbread was luckily only big enough for one bite for a each of us because it tasted like bland cardboard.\n\nBrasserie is in need of some serious help with its identity crisis, unprofessional waiting staff, and the disorganized, uninspired dishes the chef pushes out. It's sad to see a new hot spot that seemed so full of potential just a short six months ago has fully turned into nothing more than a standard, overpriced, empty, Séoul-less hotel restaurant. Au revoir, Brasserie.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "One of my favorite places to go when I'm around the neighborhood starting with the staff to the decor and food. :)", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "Mixed feelings.\nSome dishes were good, but some weren't.\nWhen we went on Saturday night, it was semi crowded and was taken to our seats. But it took awhile to get our DRINKS. Seoul mate was actually tasty.\n\nFoods.\nOysters and Pork Belly: they might be good individually but the flavor was not wonderful. It wasn't horrible but not worth trying. Disappointing. \nWagyu Tartar was good except too much Wasabi oil. \nFried Anchovies: they need to work on their sause. \n\nI hear they recently opened so might give them another chance after they make improvements (ghats me being nice). \n\nFoods were 2 stars, and 1 star just because the staff was trying their best. \n\nBut except to wait long time for every order.", "author": "Ayumi N."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Brasserie Séoul", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "300 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K_En4RdIwU-pHslC0fg3NQ/ls.jpg", "@type": "Restaurant", "telephone": "+17183301099"}