{"aggregateRating": {"reviewCount": 70, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Seems like they recently changed the menu. Had been quite creative and delicious. Unfortunately not the case any longer.", "author": "Sean S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "While my onion soup was ok, duck meat was hard and definitely overcooked. My companion's tuna was nothing special. And no, I don't mind almost 2 hours for dinner -  this isn't a fast food restaurant. Our waiter was a cool dude, but the bill totally didn't match what we've been served.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-17", "description": "So the place looks pretty and clean, I'll give them that. But my brunch was lacking. The eggs Benedict left so much to be desired. Very plain. The English muffin looked like it had just come out of the bag in the fridge, and tasted like it too. There was almost no Hollandaise sauce, like they were trying to ration it. The hash brown potatoes weren't crispy. I've never made eggs Benedict before but honestly I could probably do better.", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "In town for work and found this gem across the street from my hotel.   The food was delicious!   So good, I came back the next night.  The grilled spicy eggplant flatbread was light, but packed with flavor and spicy!   It was perfect for one person as an appetizer.   The beef tartare was seasoned perfectly.  The prime burger was delicious.  The oysters lacked flavor.   Jarvis makes great drinks behind the bar.  If you're in the area, you have to check it out.", "author": "Rossina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "Services is appalling - we were waiting for served for brunch for 20 minutes and after ordering the food we sat for a whole hour and no one brought out our food. Such a shame as it's a nice hotel but service and the food manager should not be in hospitality! Staff very rude.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-17", "description": "Maybe they were having an off day, but this was a pretty terrible meal. Tuna tartare and brussel sprouts were fine but nothing special. Eggplant, fried chicken, and short ribs were all awful. Tasted like they were reheated or overcooked. Ambiance and service were great, but this was really just a bad meal all together. Too bad, because I wanted to love it.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "I would give it 0 stars if I could. Supposedly this place was too busy that it took 30 minutes to get drinks but there was like 3 full tables and rest were leaving. 30 minutes later they bring out a small plate with a slice of old crusty bread with fig on top, tasted horrible and not sure if that was supposed to hold us over until our entrées arrived 2 hours later. You would expect at this point they had gone out and fished seafood and the food would be out of this world. Yea, not quite the Tuna thingy with foam, not sure what that was, but passed around table and no one could eat it. The seafood stew thing was overcooked like it literally sat on stove while we waited for 2 hours. They brought some sad looking Brussel sprouts, that looked like someone else's leftovers as consolation, but it was so burnt and cold was inedible. I get they are new but then shouldn't you be listening to your customers to improve? What's even more infuriating is chef is chatting away behind us with his buddies and could care less about food or his customers! Really!? Good luck lasting in NYC, better off ordering room service from Holiday Inn next door. At least you won't have to wait 2 hours for food and probably tastes better too!", "author": "Suki N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I'm a Manhattanite but decided to make the trek to Brooklyn to try Brasserie Séoul and it was WELL worth it!! 100% recommend the seafood pancake as a appetizer as it is a classic dish that includes all the best Korean flavors. The atmosphere was so unique- with a comfy yet warm layout and staff that was VERY attentive. I highly recommend this spot for a date night!! For an entree, I had the crusted cod fish and it was delicate, yet savory and paired well with the chef-suggested Soul Mate drink. This drink was surprisingly pleasant as it combined a classic Korean yogurt flavor with a slight hint of alcohol!!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "Came here on a Tuesday evening.  Maybe a total of 10 other diners at 4 tables were in the restaurant.  It seems like they are still sorting through training and development issues as the servers and line cooks seemed inexperienced.  Overall, the food was quite delicious (4 stars) but minus one star for speed of service.  We ordered the Oysters and Pork Belly (OK if eaten separately, but not together as it's plated), Roasted Bone Marrow (delicious), Steak Tartare (pretty good, basically a fancier version of Yookwe), Kimchi Bouillabaisse (very good with great depth of flavor and lots of seafood) and Duck (very good as well).  However, the timing of the food was very slow despite the restaurant being quite empty.  It's an open kitchen so you can see Chef Park training his line cooks during dinner service, even showing one of them how to shuck oysters.  Appetizers took about 20 minutes to come out despite 2 of the 3 being raw preparations and our main courses took another 45 minutes (seemed like Chef Park was cooking the Duck dish himself).  We were at dinner for almost 2 hours.  Would definitely go back for the food but only if the speed of service improves.", "author": "Kevin V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "I did not like this place. I got a dish called pasta which includes two prawns. The prawns were mushy and didn't smell very pleasant. My work partner order the kimchi paella and his prawns  were also mushy. Service was very slow and we didn't see our waiter very much. Listed as $$but I thought it was expensive for the food we received. $9 for a bowl of pea soup! I won't be back!", "author": "Chris S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Brasserie Séoul", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "300 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K_En4RdIwU-pHslC0fg3NQ/ls.jpg", "@type": "Restaurant", "telephone": "+17183301099"}