{"aggregateRating": {"reviewCount": 70, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "We had breakfast here. You can order a la carte or have the buffet. It's downstairs from the Holiday Inn, so they maintain a typical continental breakfast menu to please most guests (eggs, pancakes, yogurt, etc.), although it would have been nice if they offered the Korean-French items that the restaurant serves for lunch/dinner.", "author": "Cece Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Bums me out to write this, but they changed chefs and completely altered the menu. It went from being an interesting and unique restaurant to just another cookie cutter boring, uninspired French Bistro. The quality of this place went majorly downhill.  Total bummer.", "author": "Billy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Best happy hour in Brooklyn. Dollar oysters. $7 really good cocktails. Sliders and other bar snacks are great too. I always appreciate the service here and like the fusion food going on here.  Don't know why ranking is lower but I'm guessing a lot of people trying to keep the happy hour a secret haha :o)", "author": "Murph T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "Staff was really nice but no one seemed to know what was going on.  We had two servers come to take our order and it felt like there was no communication.  It was not busy at all, but everything took forever.  The food was okay, but not worth waiting all that time for.", "author": "Stephanie N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-28", "description": "Went here for RW lunch.  This place is inside of the Holiday Inn.  The food was average at best, but the service was extremely slow, even though they only had a few patrons at the time.  When I got the check, I was billed the regular menu prices, not the $26 RW price.  I requested to have it corrected, and it took forever to get it straighten out.  This place has some potential, but needs to have much better service in order to survive.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "I was unimpressed overall - they have a number of issues to sort out with respect to execution of space (massive ventilation issues), timing and pacing of dishes (absurdly too slow), and the overall dining experience. As a vegetarian, the options were somewhat limited and definitely not good enough to merit a second trip. Specifically, the tteock was a bit bland and, for the love of god, a mushroom risotto is the best vegetarian option a kitchen this creative can come up? It's neither French nor Korean nor interesting. The \"chick pea cracker\" in the heirloom tomato was literally an Indian pappadum not credited as such (and attempted to be dressed up as something fancier). That dish was good but didn't belong and masqueraded too fancy. Frankly, the fries/ketchup were probably the culinary highlight for me!\n\nAlso, this place was just radically too expensive in my view. You can do way way better in many more expensive neighborhoods than this for the price we paid. Wouldn't recommend a dinner trip out until it's fixed.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "Giving it two stars because one of the two dishes was good- very close to only one star.\n\nCame here for brunch- only two other tables were occupied.   Sat down and waited at least ten minutes until anyone came over; there was no water at the table but there were water glasses and wine glasses.   A lot of people were working there but never really felt like we had a server.   Ordered a bloody mary and bellini- the lady that took our order than went behind bar to make drinks, she also filled our water glasses.   Another guy brought our drinks over and took our order.   And then we waited and waited and waited.   It took a good 45 minutes for food to come out.  Not once did anyone come over and ask if we needed anything ie. water glasses were empty for a bit, and brunch drinks also got light.   When food eventually came out- they did not bring my friends entree and put the fries in front of her.  We stated she also ordered something- no acknowledgement whatsoever to whether they knew that or apology or anything.   I got the bread pudding bacon and eggs which was very good!  5 minutes later they eventually brought my friends dish which was the benedict.  One of the eggs didn't even look like an egg... Again no one once asked how anything was, could they get us anything.   When they were trying to clear our plates  one of the waiters asked if I wanted another bloody mary which I might have had it been thirty minutes earlier...   \n\nPretty mediocre experience driven mainly by the awful service.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Simple Amazing ! Recently stopped by and had an amazing experience. We started off with some delicious cocktails one called Seoul Mate which used a korean yogurt and Sun also Rises that tasted like a refreshing margarita . We had the steak tartare and Truffle Tteock for appetizers and shared the Wagyu Steak that was one of the best cuts we've ever had ! Definitely worth stopping by can't wait to come back .", "author": "Jay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Good food and very friendly waiters. I got the fried chicken as starter and salmon salmon as entree, both very good", "author": "Yuting L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "Worst service ever!! They forget everything and is slower than a turtle! Cannot believe the service!", "author": "Sam A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "After trying to find a place to eat that wasn't jammed packed, I came and found this place that recently opened up. The dishes were pretty good and a different take on French and korean fusion. Would definitely come back", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "We decided to try this restaurant after reading tasting table and NYtimes articles, and we really loved it! I think it's more French styled with an undertone of Korean influence but loved the flavors overall. It was a soft opening so they treated us to a complimentary champagne in the beginning, which was a cherry on top. Our favorite was the oysters with pork belly and kimchi, and truffle ttuokboggi (genius how he thought of this!!!) as well as bone marrow/tomatoes. We had duck cofit for entree, which was great but thought it could use more flavor. Each dish had such a great mix of flavor and I'm so glad we have a restaurant like this in the neighborhood. We also had the blueberry compote and passion fruit ice cream for dessert and they also recommended a really good dessert wine to go with it. Being Korean myself, I loved how he creatively used Korean flavors for French dishes. At the end, the chef came by and even chatted with us which made the whole experience so personal! We love this restaurant and will def be returning for brunch or another dinner. There's \"soul\" to the flavors of his food and you can feel that the chef cares about every dish and is passionate about what he does. Five stars for impeccable service and delicious food!! Def recommend !!!", "author": "Deborah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-09", "description": "We only stopped for drinks, but left after the first round after watching the bartender's hand shaking as she measured out our tiny pours for $14.00 each. It's in the Holiday Inn Brooklyn so maybe that explains it. Skip the bar", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Looking for a good atmosphere, great service, and AMAZING food? This is the place to go. I was very unsure about what to order because I'm not one to go out to fancy restaurants, but that staff was incredibly accommodating and guided me to having the best meal of my life. Definitely worth the money, would come back here any time!", "author": "Megan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "The service was great and our waiter was extremely kind! We started out with truffle fries, very flavorful, and had the short rib and halibut for the mains. He even threw in some after dinner drinks for us. Awesome place to grab a bite!", "author": "Jason C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "The food was perfection and the recommended pairing were perfect. I would highly. Recommend as the service food and beverage selection was great. It is all about the details!!! Great experience.", "author": "Joseph K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "The service at this restaurant is great. The venue is chic and modern. But the food quality or seasoning needs to improve.", "author": "Beth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "If you're looking for somewhere different to eat this is the place to go! The Cavatelli with crab was out of this world! Staff was extremely attentive which is rare these days. We did not wait long for anything and the food was great, it really exceeded our expectations! We will absolutely be back soon!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "I usually dont leave a comment but I had too this, due to the warm hospitality and treat I had at the restaurant..I had a fantastic lunch everything was fresh and nice.. I want to personally thank shannon for her services making sure we had a wonderful meal.. please keep up the good work..", "author": "Philip O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-17", "description": "Not sure what the deal is with this place. Went for lunch and there was only one other table in there and he seemed to be on his computer the whole time and I think maybe staying at the hotel. The service was non-existent, the food extremely average and the work they were doing added a lot of hammering and sawing sounds in addition to the smell of smoldering wood that was coming from all the sawing. There are a ton of great places in this area now. If this place doesn't change, and fast, it will be nothing more than a breakfast bar for the hotel guests.", "author": "Mike Y."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Brasserie Séoul", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "300 Schermerhorn St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K_En4RdIwU-pHslC0fg3NQ/ls.jpg", "@type": "Restaurant", "telephone": "+17183301099"}