{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-19", "description": "Halfway between a grocery store and a deli, but more grocery-y since there's a whole bottom section of the place.\n\nGood selection of cheeses. Lots of shelf-stable stuff below as well as produce.\n\nThere's a sushi counter, a burrito/taco stall, and then the salad/deli section. I went with one of their sandwiches that mentioned chipotle chicken. I thought it would be the chunks of chicken they had in the display, but it was actually sliced cold cuts, which was incredibly disappointing. They should probably specify which sandwiches are hot, and which are cold. Maybe it's my fault for not asking.\n\nThey also have cold brew and kombucha on tap, so that's nice.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "This is my first one star review. \nThey are rude, we asked if they have a product and guy angrily said he does not know. \nI got a chicken burrito, it was so cold meat in the middle had still ice on it.", "author": "Enis Berk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Cutest zucchini's!!! 10/10 would recommend salad bar. The cats are friendly and Alex the cook is the man.", "author": "Liz W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-31", "description": "Come here for breakfast all the time.  The guy behind the deli counter is extremely rude, slow and just horrible at his job.  Not sure why he still works here, hes constantly arguing with everyone.  Owner/Manager just hides out in a corner, this place has so much potential but they are milking the fact that they are the only game in that area.  I'm sure that that will end when something new opens up.", "author": "Ankur A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I don't see why all the past reviewers have been sippin' on the haterade. Yes, it's pricey, but they have a larger and healthier selection than your typical bodega. They keep the line moving quickly.\n\nFun hidden treasure: the bagels are shockingly good. They're kind of like Martin's potato bread. If you ask for veggie cream cheese they'll mix regular up with broccoli and carrots. Weird, but tasty!", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "Meh, I guess this is an option for a less expensive bodega in this (now) spendy neighborhood.\n\nExcept it's not less expensive.\n\nAnd it's not less grimy.\n\nI've purchased produce, canned goods, and assorted items here, often for work. The produce is old and decaying. I have to pick through all of the available options to select the single less rotted or battered onion, citrus, potato, etc. \n\nThe shelf stable items are dusty and clearly not rotated on a regular basis.\n\nThis might be okay if the prices were cheaper. But they're ridiculous, even for Dumbo. \n\nThe clerks are rude as f**k. They've actually dropped my credit card on the floor and stared at me blankly, without comment. They never say thanks or acknowledge customers, even those of us who've been in the neighborhood for decades before this store. They're surly if you need a receipt. \n\nThis is a last resort option for staples.", "author": "Jess P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-22", "description": "Grumpy sandwich counter staff. Wouldn't come here if it wasn't the only place in the area", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "Agree on cashier guys not being friendly, but is that really part of their job? I think most of the time they are rushed. This place is a go-to for me as I work down the block and they stock some pretty quality food options and have decent lunch options\n(sushi, burrito bowl, salad bar). Prices are high, but let's remember we are in Brooklyn's most expensive neighborhood, folks!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Staff is nice, food is good. But has alotta flies in the place. Especially by the sitting area.  Will not be visiting this place anymore", "author": "Anthony H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "BEWARE THE MOTHERF*CKING CAT. \nI have no idea why this isn't talked about more - perhaps because it's super embarrassing to admit being attacked by a cat- but YOU GUYS!  LISTEN UP: This bodega is home to the most terrifying beast I have ever encountered in my life. And that's saying something. The resident cat is a demon masquerading as a bodega cat- it hides in the cracker aisle and will attack unsuspecting passers- by without warning - much like the Bridge Troll in the Three Billy Goats Gruff. This thing WILL  attack both you and your baby stroller and it WILL draw blood. I am speaking from experience. This thing is merciless. I dont care how high you are or how badly you want those cheese puffs- it is just not worth losing a limb.", "author": "Lindsay A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-18", "description": "Fuck these guys. They have TWICE tried to cheat me by entering a higher price on the register than what it was labeled. When I corrected them, the guy behind the counter put on a shit-eating grin and just said \"oops.\"\n\nThen on top of that, they actually went and marked up prices a few hours before the blizzard just because they could. See the eggs picture - what assholes.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "Boy oh boy was the guy behind the counter rude!!!!\n\nFirst of all someone was mopping when I went in making it difficult for me to peruse one aisle. \n\nWhen I was finally able to get what I wanted and attempted to pay by card,  I was rudely told it was a $10.00 minimum. Okay, no problem. I searched my purse and came up with 3 cents short of what I needed. As I was based just around the corner I then told him I'm going to get the money and I'll be back.\n\nThe look he gave me! Wow! You would think \"she's definitely trying to steal something\".\nSorry, I'm not that desparete. I won't be back. \nI can understand workers being winded after a long day. But as a former CSR I darn well know the difference between tiredness and someone with a rude persona. \n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "I get my coffee from here most mornings, strictly because of the close proximity to my office - but the place is not great overall.  I used to purchase office snacks from them, but have since gone back to Peas \u0026 Pickles when they re-opened after renovating.  The prices at both stores are just plain silly for grocery items, but at least at P\u0026P they are efficient, friendly enough, and more importantly - CLEAN.  After a few times making the mistake of not looking at the date on snack items at BF, which I later discovered were stale as stale can be, I always double check any expiration date and the condition of the product if possible, on the rare occasion that I decide to pick anything up.  \n\nAs others have mentioned, the people that work behind the registers are straight up rude each and every day; when I go there, I keep my sunglasses and headphones on in order to have as little interaction with them as possible, sad as that may sound.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-29", "description": "Although it seems to be the most convenient market next to my job. The customer service here is the absolute worst. The employees are a bunch of negative Neds (most are men) There are several times when they were rude to me or my fellow co-workers. I read some comments below and it's good to know we are not alone. Whether it comes to asking general questions about products or during the cashing out process, the tone and aggression is always felt. I've decided I will no longer  come here, yeah it may not make much of a difference, but I feel good knowing, my money is not going to some mean individuals. \n\nThe snack and drink selection is the only good thing about this place. The groceries are over priced. The salad bar looks \"scarce\" , The pre packaged sandwiches are unappetizing and I've had the driest turkey sandwich in my life from this place. I've heard Pea's and Pickles is owned by the same people, but they are much nicer there. hmm go figure.", "author": "Maureen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "I ordered the balsamic grilled chicken panini. It tasted alright. Paid 8 dollars for a panini a drink,  not bad.", "author": "Fatima M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "I don't like writing negative reviews, but after my second bad encounter with the owner/manager (whoever he is, wears glasses behind the register) I felt it was necessary to leave this review. \n\nYes, they have a great selection of snacks, drinks and food. But none of that seems worth it, when every time I walk into that place, I get a negative and aggressive customer service.\n\nA few days ago, my second attempt at picking up snacks the other day, the same guy rung up my snacks. I gave him $20, and my boyfriend wanted to switch out his Kind bar for a different one. I asked the guy from the register how much was the kind bar, and after realizing that it costs more than I expected, we put the bar back. He rudely said that he already charged me for it and refused to give me the correct change back for my $20. I told him I hadn't even brought it to the counter and he shouldn't charge me while I'm asking how much it costs. \n\nThis is the second time I had been insulted, rushed, and treated unfairly. I'm giving YOU my money, maybe take that into consideration. \n\nEither way, they are rude beyond rude in there. I was humiliated and insulted. They have poor customer service.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "Went to the updated bridge fresh with high hopes that they had turned things around. While it certainly looks nicer, that is about where my positives end. Not only was my breakfast wrap terrible (complete with tasted like a kraft singles cheddar cheese square) but when I went to checkout, in true bridge fresh style they tried to charge me a $1 more than what was posted for the sandwich. When I pointed it out and pointed to the board he still tried to hold his ground. After some back and forth he finally dropped the price to what was advertised. They have always done this... CHECK YOUR PRICES when they are ringing you out. They have always tried to slip an elevated price past me and I'm sick of it. Despite a fresh look it is still the classic shady, disappointing bridge fresh.", "author": "H B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "Customers beware. We bought a loaf of Jewish Rye bread from this deli. Upon arriving home we discovered that the entire packaging of the bread was ripped off. We immediately went back to return it to the deli, but the guy at the counter refused to exchange it or refund. Not only that, if you notice carefully, all their edibles are close to the expiration date and their produce is quite old and limp, i.e. nothing like their name suggests -- its not fresh! Yes, we've been guilty of shopping there for the past 11 years on urgent need basis, but now is the time to call it off. If you care for your, and your childs health, I'd suggest you find other alternative.", "author": "Devyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "A bit baffled by the negative reviews. All employed were exceptionally kind toward me. Prices seemed on par with most Brooklyn small grocers in the surrounding neighborhoods. \n\nCoffee selection is above average (and includes pumpkin spice!) with soy milk, cream, and milk all readily available. It's deli-level good, which is what I was expecting; but if you want something more, then certainly keep walking and head toward Brooklyn Roasting Co. \n\nDidn't try any of the prepared foods so can't comment on that aspect of their business. I'll withhold a star and update this review when I do.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-19", "description": "I stop by here because I'm usually in a rush on my way to work and don't want to walk the extra two blocks to Pickles \u0026 Peas. The staff here is rude, no matter the time of day. Actually, never openly rude, but always seems like I'm bothering them if I want to, say, order a sandwich, or pay for my purchases. I've been going here randomly for about 5 years, and the coffee has gotten so bad that it is nearly intolerable. The only bright side is that they have soy milk out and open for use, which not all delis have.\n\nThe sandwiches are okay, and the prepackaged vegan options are standard. They have grab \u0026 go salads and sandwiches sometimes in the center open cooler. \n\nThe back is all groceries, although I never shop there.\n\nThe best part about this place is the cake near the register. $2 will get you a huge slice of cake, with my absolute favorite being the carrot cake - best I've had in the city.\n\nThis place works, but there are nicer people with similar prices down the block.", "author": "Dos T."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Bridge Fresh", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/xudQULjiI_pkrjEYtawUXQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184881993"}