{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "These guys are fucking criminals. I don't know what else you'd expect, though, since they've got a monopoly in the neighborhood.", "author": "Dale C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-26", "description": "Rude staff.  I moved from soho to dumbo a few months ago. Been here several times, despite finding visible mold on their cheeses on one occasion, and on another occasion purchasing a chicken breast from the deli that smelled too horrible to eat when I removed it from the container at home. Still, it was conveniently located for me so I continued to give them my business for non-perishables. \n\nHowever, yesterday the counter guy yelled at me for not using a basket when I dropped something. I only had 5 items. Nothing broke. No harm was done. I picked it up, purchased it. No big deal. But he still felt it necessary to berate and degrade me.\n\nIf I ever talked to a customer like that when I worked in service anytime someone dropped their fork or knocked over their wine glass, I would have been fired.\n\nThe thing is, I just ran in for one item, But impulse shopped 4 more items on the way to the checkout. That's why I didn't grab a basket. You would think they would encourage people to buy more than they originally walked in for. But what do I know?\n\nThe only thing I do know is that I won't shop here again. Peas and Pickles is only a block a way and their staff have always been really nice and I've never seen a block of green cheddar cheese in their dairy section.", "author": "Elsie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "Extremely overpriced deli sandwiches, even for the neighborhood. They never have ingredients for the sandwiches on their menu and the deli guys mess up your order constantly. Made sure he put muenster on my sandwich three times and got verbal confirmation and lo and behold no muenster, no cheese. If they had any competition they would be out of business in a heartbeat. I'm sticking to the halal cart down the street.", "author": "Asher E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "You know what?  These guys are fine.  And yes, when you're the only game in town, that's good enough.  The sushi is actually great if you can get there mid-day when it's fresh (when in doubt... come on folks, use your eyes...).  Agreed that prices are a little bit all over the place - sometimes better than Forager's... and sometimes not.  Just pay attention or be prepared for that.  They pack a lot into a small space and I can generally find whatever I am looking for.  Some of the guys are actually quite nice.  So three stars exactly.", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "It's a big deli, and it's generally OK, but nothing great.\n\nPros:\n- generally convenient for a lot of folks living and working in the area.\n- pretty big selection for a deli\n- lots of good impulse items, great selected of chocolate bars\n\nCons:\n- the deli staff is chronically under-staffed, and yes, they are rude. they frequently seem busy setting up for the day -- at 9:30 am. Plus, because they are busy and distracted, I'd say they get my order wrong about 40% of the time.  I've given up on that. (I said a plain bagel, not sesame; i said don't toast it, but you did anyway; why is there mustard on my breakfast sandwich..?; you get the point.)\n- The mold on the pre-made food.  Watch out.  I'm not the only person to spot it, or to get sick from their pre-mades...\n- On several occasions I've had to wait for the cashier to finish organizing boxes, finish his phone conversation, finish his email, generally finish whatever he is doing before checking out.\n- for the love of god, turn on the effing AC...\n\nI'll probably keep stopping by because it's right on the way to work, and there aren't many options (Dumbo Kitchen is a whole other kind of mess).  But I'm not the first person to suggest that if Dumbo had more deli and restaurants, BridgeFresh would be in deep doo doo...", "author": "Jeremy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "given the complete dearth of supermarkets in dumbo, bridge fresh is an easy solution when you're in a bind (aka heading home from the f late at night and realized you are out of bread and yogurt). ive found this place to be cheaper than peas and pickles PLUS (probably more importantly) there are far less people soliciting outside (and sometimes inside) the shop. of course i never want to shop at these bodegas in dumbo (more economical to venture to bk heights for whatever you need), but again- prefer this spot to p\u0026ps granted they are open.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "This place is definitely racist. I've have a black friend who went here and on multiple occasions asked to use his credit card for a purchases only a dollar or so below the credit card limit, a request which for him is always declined. As a white male, I have asked for this exception and received it multiple times. I've also witnessed other white people receive the same. I won't ever be patronizing this place again.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-29", "description": "I love the guys behind the kitchen. They make incredible food, they are pleasant, friendly and overall I have a great experience every time I order form them. Especially love their burrito's and Monterey Panini's! Sadly my time enjoying these foods has come to an end as I can take the rudeness of their cash-register counterparts no more!\n\nThe guys behind the register are so sour, SO sour and SO rude that I may even go as far to say, they are responsible for making the incredibly yummy food taste terrible. One would wonder how it is even remotely possible to have a 30second exchange over the transaction process make the food itself taste bad. But they do and they have mastered it.\n\nI'm an Aussie gal who also loves Bounty Bars (if you're from the commonwealth you know what I'm talking about - deliciousness!), a rare but wonderful chocolate treat which they carry. I would much rather give up my indulgence in chocolate than step foot in their store again. Rude rude rude!\n\nI'd also rather pay more and go to Forager's or any place else for that matter than give them one more dime!\n\nCase in point: I asked for a burrito-less burrito. Basically everything on the burrito but not the tortilla. They tried to charge me double for it. Confused by their logic I asked why adding the tortilla made it less expensive. They just looked at me and said nothing.  I disagreed with their logic, left the item on the counter and walked across the street (to a mexican restaurant!)\n\nI have used a credit card daily to buy lunch. Today's lunch came to $4.64 and they accepted my card without hesitation. Realized I forgot my dear Bounty Bar and went back to get it. $1.79. Am now told that no transaction under $5 is accepted for cards. I told them I just bought this (held up lunch item). They shook their head and said no. Well alrighty then. No chocolate treat for me today and no lunch purchases for you here on. I just don't get why it's so hard to give people money.\n\nDUMBO is a small and friendly community. These Cash Register tyrants would fair well to add a smile to their daily role and perhaps recognize the industry they chose to be in, customer service!\n\nGood bye Bridge Fresh.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "Kind of narrow isles, and not super organized, but they carry such quality ingredients, and a ton of vegetarian options. I was most happy by the Israeli couscous, which was available in whole wheat. The staff were really helpful in navigating the aisles, and I'd definitely come back if I were in DUMBO. For $5, I bought a huge thing of whole wheat Israeli couscous.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-14", "description": "Like most places in DUMBO, this deli would never survive in any neighborhood where they had to compete against other businesses The cashiers are nice, friendly guys. The deli staff are lazy, rude, and either don't listen or don't care about making your order correctly. They stop cooking breakfast ridiculously early. On the weekends, I can't get an egg sandwich. I've complained a few times and now they give me dirty looks whenever I'm in there. But, hey, it's DUMBO, so they will continue to thrive despite being rude, lazy, and incompetent.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-31", "description": "Deli in the front, market in the back.\n\nAs a general rule of thumb, anything you can find at Jimmi's down the street is going to be cheaper. Jimmi's does better breakfast sandwiches and salads, while Bridge Fresh does better lunch sandwiches.\n\nA grilled ham and swiss is pretty good for $4 if you're looking for a super cheap lunch. Avoid the paninis, they are always undercooked. One time I asked the guy if he could cook it longer, and he just said no. So fuck him.\n\nThe cups of orange juice are $3. A liter of orange juice from the back is $4. Go figure.\n\nOne exception: 4 stars to the italian sub here. There's a guy who works a day job as a counter dude here so he can sometimes fulfill his dream of making delicious italian subs. They're also huge-- half of one is a very satisfying meal.\n\nI've been working in DUMBO for almost 2 years now, so I know this place pretty well.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-26", "description": "There hasn't been a single occasion where i've been shopping here and haven't come across rotten and molded produce. Half the stuff is priced incorrectly (per pound? each?) or not at all. Once, out of desperation I bought some pre-made sushi (no fish-- I would never trust them with that) and the rice was rock hard the thing must have been a week old. There are lots of different guys that work the registers here, and quite a few of them are jerks. In short, this place sucks. The only reason people go here is because there is nowhere else close by, end of story.", "author": "L W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-21", "description": "Though the hours and grocery selection at its neighborhood kin Peas \u0026 Pickles are far superior, Bridge Mart is more convenient for those of us in Dumbo who aren't privileged enough to live between the two bridges. A much kinder staff as well, not sure what problems people have with the attitude of the guys here as they are all polite. \n\nBridge Mart attracts one very drugged out nutjob always standing outside the store trying to talk to me and getting in my face whenever I enter. It is starting to get irritating.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "I come here for the deli bar. The head chef back there, Alex, is the absolute nicest guy ever, and if you come here regularly enough (I work just up the street) they'll start to just know your order. The coffee and iced coffee is DIY and is decent. A sausage egg and cheese and a large iced coffee, my standby, is about $5.80.", "author": "Stefan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "This is a good little market/deli in the dumbo 'hood. It's a bit larger so there seems to be more variety.  They have good prepared salads, sammies, etc...\n\nI just hate when cashiers try and rush me out. Let me take 2 seconds to put my money back in my wallet. That seems to be the case here.", "author": "Tina B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-04", "description": "Be careful what you eat there. I had two vegan prepackaged meals from there and got really sick. Plus the staff wasn't that friendly either. I won't be going back.", "author": "Sina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Did you know that these same folks own the Peas and Pickles? My housemate told me that. It's safe to assume that they have saturated the supermarket industry in Dumbo. Whatever. I go to Bridge Fresh even though they aren't open as long. The guys working there don't look at me funny for buying the same thing for weeks on end. You can't buy that kind of acceptance. Well, I guess I sort of am buying it. But hey, even after that little revelation, I still feel like going over there for a soda. But I won't since, they're closed.\n\nTheir prepared food selection is variable, and unfortunately they seem to have quit making some of the stuff that I liked. But you can order from the counter, which I'd suggest. Incidentally, this is where all the Peas and Pickles sandwiches come from. \n\nI've grown to appreciate the undeniable convenience of having the extra-large and well-stocked pantry afforded by a corner bodega - probably something I couldn't live without at this point. Bridge Fresh is one of the high points in this little neighborhood, and you should definitely give them some business. Or just some money, since I think most of them are married.", "author": "Nash G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "Just returned a moldy sandwich from this place. This isn't the first time I or some fellow employees have encountered this situation. I've come here several times over the past month for sandwiches, snacks, fruit, etc. If you get the sandwiches fresh from behind the counter, they're not too bad. But the few times that I've picked up a sandwich sitting (expiration date is wrong) out on the island near the suishi stand, I've gotten either found mold or a horribly tasting flavor. This has also happened to me with fruit and salads. That'll be the last time I venture to this place.", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-27", "description": "Spoiled, bad chicken that made me sick! I purchased a pre-made green salad with chicken and the meat was slimy and had an awful taste and smell. I threw out most of the chicken, but the 1-2 bitefuls I ate still upset my stomach.\n\nI purchased a chick pea salad as well and it was ALSO slimy and smelled bad, though not as bad as the chicken. \n\nI immediately called the store to recommend taking these products off the shelf. The storekeeper was apologetic and ensured me he will do just that, but when I asked for a refund, I was offered nothing but \"I'm sorry...\"\n\nI'd also like to add that time and time again the male cashiers can be a little too engaging and forward with their female customers. I'm sorry, I'd like a tea, a FRESH salad, and to be left alone. Is that really so much to ask for?", "author": "Katheryn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-18", "description": "This place is kind of amazing. I was in town day and night for the last two weeks working at a nearby studio, and this place was a saving grace. \n\nDumbo has a very limited selection of evening non-bar/fancy-dining and so this place hit the spot. Whether I was looking for a fresh bean/corn salad, or a banging chorizo quesadilla (complete with chips, sour cream, guacamole, yes guacamole the sacred green stuff that you have to beg most restaraunts for any) this place definitely hit the spot. And the guys that worked there were all sweet cheeks. \n\nSure it's a little expensive for snacks and whatnot, but what no-dive deli in NY is not?", "author": "Zara B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Bridge Fresh", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/xudQULjiI_pkrjEYtawUXQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184881993"}