{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "Don't let the \"organics\" on the sign fool you, this is more or less a standard deli with all their other products feeling like a mixed bag.\n\nThis was the place I'd go for lunch during the first week of my internship  in Dumbo before realizing that Front Street Pizza had better food and was a better value being only a few blocks away. However, save for an occasional food truck, this is one of the few options you really have if you want to eat on a somewhat reasonable budget.\n\nI thought their sandwiches were good and large despite being a couple of dollars more than I'd normally comfortably pay for a sandwich but at the same time I did feel it had a bit more meat than I was used to. I can't really say the same for the Potato Salad here which tasted anything but \"fresh\", I'm guessing it was sitting out by the salad bar for a few hours.\n\nYet, I've still been here a few times after that first week of not knowing what I was doing. In this post CompUSA world, it is one of the few places to pick up Bawl's Energy Drink, and I think the little area to eat in the back wasn't really too bad either.\n\nUltimately, this is a decent place to go if you want to pick up something small, they take a bit longer than you'd want for them to prepare a sandwich for you but it is a bit better than the Spanish place across the street.\n\nJust avoid the salad bar.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-29", "description": "If you work or live in DUMBO, Bridge Fresh can single-handedly sustain your existence. It has a little of everything: Extensive coffee selection, full deli, vegan sandwiches (for the hipster in all DUMBOers), beer, sushi, and if you squint you'll see a full grocery selection in the back complete with fruit and vegetables. If you're having such a good time that you don't want to leave, they have indoor and outdoor seating.\n\nWord to the wise: Bridge Fresh's large coffee is a full 25 cents cheaper than the coffee stand in front of the York St. F station.", "author": "Greg G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-22", "description": "Really pretty average.  It felt a bit dirty to me when I went.  Competition is is Foragers and Pickles - which both seem much better.  A friend of mine on here though thinks it's good so I'm going to check it out again.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "Absolutely lovely. I've been working in the DUMBO area for about three weeks now and have been coming to Bridge Fresh everyday. Sometime twice. They advertise as natural, but I think a lot is organic as well.\nEvery morning starts with a coffee with soy milk--which is just as good as any cafe for half the price (coffee is coffee and in NY, coffee is dusty); getting a large drip for 1.25 is brilliant. Then its often back for lunch; finding good vegan pastries and sandwiches for under 5.00 is god-sent.\nEventually Bridge Fresh will be where I do all my food shopping.\n\n(excuse the lovely and brilliants.. been watching BBC too much)", "author": "Brad S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "A combination, deli, supermarket in the middle of Dumbo.  Ordered food is only worth it during lunch and breakfast.  Prepared foods - especially the sandwhiches/salads leaves little to be desired.  Made to order salad on the other hand is very good and reasonably priced.  This place does a lot of business in the area.  I only which they would fix up the place a little.  The behind the counter food prep are definitely needs a sanitary makeover.\n\nStrangely this place has not been graded by the Health Department...which is clearly a \"B\" in my books.", "author": "Dina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "This is the place to go for lunch if you don't feel like spending 10$ a meal. Sandwiches and salads are cheaper than the other local spots and everything is good with big portions. \n\nJust a simple place to come for lunch with co-workers to bring back to the office. I will be back every time I'm buying lunch.", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "This is your average deli/grocery store with the ubiquitous make-your-own salad bar, pre-made \"panini's\", and steam table. It's a workhorse of a lunch joint and the kind of place you'll end up going at least once a week when you need to eat at your desk (or preferable stare into space at the park). For sheer value, go for the $6 rice/bean/meat bowl. No complaints, no high praise.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "I go to bridge fresh about 4 times a week as it is in close proximity to where I work.  I find the sushi to be great (although true enthusiasts should go to MISO, about 4 blocks away) and the tossed salads are also a favorite.\n\nMy one complaint is that sometimes the freshness of the packaged/prepared food in the center is not up to snuff.  \n\nOverall excellent, nice employees and the little black cat is adorable.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-20", "description": "The guys at the front counter are rude and sour.  I have been going to this deli Monday-Friday every day and many times on the weekend for a good two years and spent $10-30 each time, every morning.  I have easily spent over $5000 there the last year alone if you do the math.  But every time, no matter how nice I greet them, it's as if I'm wasting their time.  Final straw, after all this time and money spent, one day I was 33 cents away from the credit card minimum, and they made a big fuss about it.  I couldn't believe it.  (which by the way, being a business owner myself, credit card minimums violate your contract with the credit card company).\n\nNot to mention a month prior I got food poisoning from their chicken salad.\n\nI'm done.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "Nice deli that is a mini supermarket.  They have the basics and more including produce and many gourmet products such as kettle potato chips.  They are so friendly every time i need to pick something up and usually have what I'm looking for.  I am not a fan of their fruit such as the blood oranges which have not been very fresh, but otherwise really great mini supermarket for the basics or when you need a something quick and don't feel like travelling to a larger grocery store.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "I love the make your own salad bar (it's where I first learned to enjoy salad) and the deli guys who remember my order. The staff is overall very friendly and they have a good selection for a market of their size. I used to eat here almost every day for lunch when I worked nearby. And their bagels are cheaper than La Bagel Delight on Front Street.", "author": "Emma M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-06", "description": "Disgusting and Rude. I bought their deli-made potato salad at 11am. Took a bite at 12pm and looked down to see fuzzy mold all over the top of it. I took it down to them to ask for a refund. Then the guy started arguing with me about how much it cost. Not even an apology from them. \nStay away.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "I just paid $2.05 for ONE apple..... I don't understand why I handed over the money, but I don't think nature ever intended for people to empty their bank accounts for an apple. OVERPRICED! not only that but they refuse to get their in store cat neutered. They don't think she's worth it cause she's \"just a cat\" (their own words). So wash your stuff you buy from their cause the cat rubs it's butt all over everything because she is miserably horny.\n\nTake the walk to Foragers. Much fancier, cleaner, nicer, and cheaper.", "author": "billy b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "Bridge Fresh is the only full sized grocery between the Manhattan Bridge and the Vinegar Hill projects, and it does have a decent selection. It's prices are kinda high on everything that isn't coffee, sushi, or from the sandwich counter though. \n\nI stop here every morning for iced coffee and some kind of snack, and eat lunch a couple of times a week here. In anywhere but DUMBO the lunch counter prices would be amazing ($5 for a 6 topping salad, cheap sandwiches, etc) but Jimi's and the shop just next door are the same price.  The sushi is good and cheaper than Whole Foods.\n\nLike I said, when you need a box of Cheerios, a loaf of bread, some garbage bags or canned goods and you don't feel like walking to the projects, this is your place.", "author": "Devin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-22", "description": "Meh, indeed. Bridge Fresh is an overpriced kingdom of mediocrity in all respects. Kudos to the owners on their success, but for years BF has been the clarion bell warning that there is not enough variety and competition on the DUMBO food scene. It's a shame.", "author": "Andy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-05", "description": "Food is of mediocre quality. I've had sandwiches in the ready-made section with chicken that was close to raw on the inside. Yuck. The grill that makes the hot food (paninis, burritos, etc.) is decent, as is the salad bar.\n\nService is ho-hum, though I noticed that they have two new cashiers who same a bit friendlier. Let's hope that trend continues.", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "One of the best burgers I've ever experienced - yes, experienced - in this cozy little DUMBO convenience store. Indoor and outdoor seating punctuated by an adorable black kitten providing mealtime entertainment,   Bridge Fresh is a great place to go when you're craving a delicious burger away from the Manhattan snootiness.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-07", "description": "Their individual slices of cakes \u0026 pies in the refrigerated display in the center of the store has mold growing on them. It's easiest to see on the chocolate slices, because of the contrast. I've bought one before and almost ate it, but took it back and got a refund. They were going to offer me another slice, but I insisted on my money back. Just today, they still had moldy cake. I reported them to 311. \n\nI love the downtempo music though! Very cool!", "author": "Chloe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "I love these guys!  A decent, fresh grocery store, deli, and all around awesome neighborhood spot.  All the guys there know me and are super friendly.  It's not as cheap as your mega grocery store in the burbs, but for what it is and where it is... I LOVE IT!", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "My work staple. My office is just down the block from Bridge Fresh and so I'm here every morning for coffee.... and then two more times during the day for more coffee. They have some of my favorite foods (40 spices humus, greek yogurt, dried cranberries, coffee... obviously) and though the prices are a bit high compared to other parts of Brooklyn, it's quick, easy and efficient. I love Bridge Fresh!", "author": "Alexandra K."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Bridge Fresh", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/xudQULjiI_pkrjEYtawUXQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184881993"}