{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-21", "description": "The saving grace of this otherwise dumpy place is good prices. Sadly that isnt enough to sustain an establishment or it wouldnt be if it wasnt in dumbo where the options are few and the quality laughable. I'd say avoid it but what choice do we poor unfortunate souls that work in dumbo have? Just know what you're getting into and dont be taken in by the mountains of colorful pre-made food stacked all over the place because it was pre-made...last week.", "author": "john s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "I work in DUMBO and find myself pigeonholed into grabbing lunch here pretty frequently. The prices are heinous, yet continue to increase at a steady rate.  I don't know who had the brilliant idea of pre-cooking 20 pounds of hamburger meat and then leaving it in the display case for 12 hours, but the 3/4\" of solid fat that settles at the bottom of the plate is enough to make one gag.  It's OK though, because they sit right next to three mountains of equally old pre-cooked chicken; which looks as though they're either covered in moss (pesto?), baby vomit (cajun?), or week old chinese takeout goo (teriyaki?)  Salads are one of the few solid choices - although the guy behind the counter never seems to understand \"vinaigrette\" on the first go-around and will make you repeat yourself at least twice.  Every. Single. Time.  Just go to the roach coach in the park around the corner and save a few bucks.", "author": "Danny O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "The groceries and pre-made sandwiches are over priced. Their two sandwich guys though, Ricardo and Alex, make the best chicken burger I've ever had. Just ask them of a chicken burger \"estilo paisa\" and prepare yourself to be amazed.", "author": "Ken K."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Bridge Fresh", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/xudQULjiI_pkrjEYtawUXQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184881993"}