{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Stopped in on a whim on the way back to my place. I've been searching around for a decent sushi place nearby ever since I moved here. This one has a fighting chance to keep my attention. Service was good, my waitress seemed to almost anticipate my needs (coming over with more water just when I ran out, clearing the table between courses as I'd finished). \nGot the tuna tartar appetizer, some sashimi, and one of the house rolls. The presentation of each dish was fantastic. The tartar was perfect and the sashimi fresh. Skipped on dessert this time but the creme brûlée looked fantastic. I also liked the touch of bringing out a watermelon slice after the meal.\nI'll make it a point to come back there.", "author": "christopher b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Love the seafood soup (meal, not appetizer, although appetizer soup is pretty good too!). Fresh veggies loaded with seafood. My husband's favorite is crunchy scallop roll. Drink specials are terrific, and service is amazing. It's our favorite place to eat in brooklyn heights.", "author": "Lisa O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "We were here for lunch. I had the Katsu and it was pretty good but was a little dry. The amount of food they give you for the price is great, especially for japanese food. The decor is really nice and it's a great place to meet up with friends.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-26", "description": "This is easily one the best Japanese places in the Heights... too bad that isn't saying much, though.  I did delivery and got the crispy duck.  Entree came with a side of rice and a salad.  Salad was delightful, and the dressing was pretty good.  \n\nSince this was delivery, I won't grade the crunchiness of the duck skin after a long steamy ride on a bike.  The meat was somewhat chewy, though the medley of vegetables somewhat made up for that.\n\nOverall, it was a decent meal given the area, and I'll likely order from here again when my craving for Japanese food comes up again, but next time I'll try the sushi.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "Pros:\n-3 roll special for $11 which includes Miso Soup and Salad (comparable to Nanatori).\n-I really liked the Miso soup\n-The sushi was good and the fish slices were nice and fat.  There was more fish than rice.  Don't see that often.\n-Large space and I liked the interior \n\nCons:\n-Slow service and not very attentive.  They didn't really check up on us so my friend had to ask for like a million things on her own initiative.  \n-Sick of the same old salad dressing at every Japanese restaurant I go to, but not really a fault of Ozu specifically per se.  \n\nOverall: I would defs go again.  Their sushi is better than Nanatori in terms of quality, but I dunno why I have an affinity for Nanatori.  Maybe bc of the bustling atmosphere and good memories.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-09", "description": "Their customer service is absolutely atrocious, Disregarding their food, which is a little above mediocre quality, and borderline decent in some, the waiters and waitresses are either inattentive, or constantly hovering. \n\nWhat I absolutely detest the most is the poaching of customers for tips- the bartenders don't get paid any percentage of tips from the drinks they make for the tables, and even so far get tips taken from waiters and waitresses because their guests are served food at the bar!", "author": "Jack B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-24", "description": "Just went in for a quick lunch today, 1 x sashimi lunch + 1 x sushi lunch was cheap ($35 for 2) but blech.\n\nIt may be my unrefined palate but i had to spit out one of the pieces of sashimi (there was another piece the same but i didn't try whatever fish it was).\n\nAlso the miso was a little \"bland\".\n\nThe decor is nice though? but i get the feeling the reaosn it was empty for lunch is that it's been there a while and the owner better fire the chef/purveyor.", "author": "dean c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-06", "description": "I really wanted to like this place, especially since our neighborhood go to, Migita, closed and we are in need of a new sushi go to. \n\nThings got off to a rocky start when my husband ordered a Tanqueray martini straight up with a twist and something that looked like a margarita was delivered - with a lime curly thing. The waitress was adamant that he got what he ordered but nonetheless asked the bartender who came to the table and said he had put in a splash of lime juice. huh?! He was nice enough and made the drink that was ordered. \n\nOn to the food portion of the show.\n\nWe three each wanted to start with a hand roll then have an entree. The waitress argued that a hand roll is not on the appetizer menu and pointed energetically at the menu to prove it. So, we asked for the hand rolls first. We were halfway through when she barreled over to the table with our entrees. So with half a hand roll in one hand we rearranged the table to make room for our entrees. \n\nTwo of us finished and one was still eating when the two finished plates were pulled off the table and we were asked if we wanted dessert. \n\nThe food was fine, not outstanding, and the nigiri sushi was oversized, not well composed. The service was not so good and the place was pretty empty, so it wasn't because it was busy. Probably fine  for takeout but I doubt we'll be back.", "author": "jane p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Really good sushi, and an interesting menu offering more than your regular sushi and rolls. And the friendliest owner around.  Nice wait staff and a good atmosphere.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "The spicy girl roll will change your life! Get the vanilla tempura ice cream too. End with a nice Sapporo and you're set", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "I'm extremely picky on sushi...and I give this place an \"A+\"!  I like the decor of the restaurant.  They have ladies night (which I enjoy)...2 drinks for price of 1. The presentation of the rolls always brings a smile to my face :) Best cocktail: Lychee Martini.", "author": "Candis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Great service and delicious sushi. Try Lady Gaga and Milennium roll", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "I was here for lunch and got the lunch basket, was yummy. What was real yummy was the green tea ice cream. You gotta try it!", "author": "Idil E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-31", "description": "Bad, lukewarm, smelly sushi, very questionable. Should raw fish be eaten warm?  Eww.  I don't know if the owners are rating this place but there's no way they deserve anything more than one star.  Rude service and did I mention the food was bad, really, I mean bad. And it's not even that cheap. So to sum it up, you should eat here if you want to over pay for really bad food, especially sushi with rude service.", "author": "Syddie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "While not the cheapest Sushi place in New York, the freshness, selection, and decor make this place a keeper for me. The staff is pretty friendly too. Would definitely recommend this place to others!", "author": "Harry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Wow! What a fabulous little Japenese restaurant! My roommates and I decided we would have a nice dinner out. Having never tried sushi it came down to Iron Chef or Ozu which is right across the street from us so we chose the latter and boy did it never disappoint!\n\nThe ambiance was just right upon entering. It was very modern and upscale looking but with a casual feel. The lights weren't too dark, the music not too loud, and it was surprisingly empty for a Saturday night. \n\nWe were quickly seated at a table and the service was incredible. Our waitress was extremely nice, they kept our water glasses filled and were both friendly and knowledgable about the dishes. The manager came over to talk to us a few minutes after we'd gotten our food and struck up conversation not just a simple \"how is it?\" but a really personal interaction\n\nMy friends being sushi experts ordered wild sushi while I played it safe for my first time and got the California Rolls and an order of chicken pad thai in case it didn't go over well but it did! The sushi was delicious and the pad thai came in a huge serving chalk full of fresh veggies and sprinkled peanuts. It was enough for me to take home and have as left overs for another meal.\n\nWe ended the night by sharing the tempura cheesecake. .A soft creamy new york style cheesecake with a thin crispy outer layer. To. Die. For. I hope everyone else enjoys this restaurant as much as I did. I can't wait to bring family and friends here asap!", "author": "Jess G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Went to Ozu twice in the past couple weeks, and I'm going to have to say that they now take my #1 spot for Japanese in the area. They make their rolls exactly the way I want it - a lot of fresh goodness inside without overloading on cheap rice. If you want to get your money's worth on rolls, definitely check out Ozu. $8 for 2 and $11 for 3 rolls for their lunch special. I also loved that they offered brown rice for free when I ordered their sashimi lunch special. Definitely will be frequenting this place from now on!", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Skip the crowds at mediocre Iron Chef House up the street and head over to Ozu ASAP!\n\nThere are a ton of decent sushi joints within a few blocks of Ozu, but it is now my go-to spot. I've only gotten takeout (though the restaurant is spacious, clean, and stylish), but the food is always fast, delicious, and generally inexpensive. Especially the sweet potato rolls, yum! The tempura is great, too.\n\nThe employees are incredibly friendly and will offer you a glass of water if you're waiting for your takeout order. A great addition to the neighborhood!", "author": "Anna N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Great food, good prices, happy hour all the time!\nSadly you cannot use Yelp coupon on same tab as any drinks.", "author": "Travis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "One of the best sushi in the area. I had the shrimp tempura appetizer which was ok. They only gave 2 pieces of the shrimp and the rest was vegetables. I also had the shrimp tempura roll which was amazing and I don't even like sushi that much. I the avocado salad was big and yummy. I also had the avocado roll which I wasn't to fond of.", "author": "Mallory A."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}