{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "Awesome date night option in Brooklyn Heights. 2 for 1 drink specials, spacious, clean and lounge-ey ambiance. Love the presentation of the food. I've enjoyed all of the sushi I've tried here. LOVE the dreamer appetizer. Only suggestion: don't go for the non-Japanese options. Fried rice and thai soup were really not great. Really love this place- I order from here at least once a week. Service is quick and it's also right across the street from the 2/3 subway stop.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "Stumbled across a place for a quick lunch. Very poor service, we waited indefinitely for drinks that never arrived. I also watched my food sit on the pass for 10minutes before it arrived, cold of course \n\nOn the plus side it tasted great anyway and the portions were big. The bento box is a good option. I had the Spicy Girl Roll which I would also recommend", "author": "Jamie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-26", "description": "I've been to Ozu quite a bit with my friends but the last time we went our waitress was so rude and asked why we didn't tip more. I'm positive that they're not allowed to ask that.. definitely will not be returning.", "author": "Julydia O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "best sushi and best place to go for a birthday. well we got lucky. they brought out an ice cream dessert with a candle on top and played the happy birthday song on the speakers ans cut off the regular music that was playing. amazing service amazing sushi.", "author": "Javier R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Great atmosphere, food, and service! Had the peanut and avocado roll and chicken hibachi with miso soup. Everything was fresh and full of flavor!", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "On one of my lazy summer days at an internship in DUMBO, I found Ozu, and since I was craving sushi and the reviews said delivery service was very promising, I gave it a shot.\n\nThe reviews didn't lie. The lady who took my order allowed me to change up my lunch special (I can be very fussy so I appreciate anyone who can put up with that), and she said it'd take 30 minutes. It was there in 15, which pretty much blew my mind.\n\nI love most Japanese salads because of the killer dressing, so no need to get into that. As usual, I could taste the MSG in the miso soup, but it wasn't as heavily seasoned as others. It had a lighter taste and there were more scallions and tofu pieces than you'd usually see.\n\nThe dragon roll was okay. The eel and avocado were kind of mashed together, but I should've expected as much. Delivery and avocado is not a good combination. The spicy salmon roll was the star though. I'm not really a raw sushi expert, but the fish tasted fresh and there was just enough of it so the flavors and texture weren't too overwhelming for me.\n\nThe total was $15 overall with tip, including the fee for swapping rolls, and that's a pretty fantastic deal for a filling sushi lunch.", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "I first went to Ozu about 2 years ago and was highly impressed. However I must say the place no longer impresses me. On my most recent visit my friend and I used a Groupon which was an incredible deal. It included an appetizer, two speciality rolls, dessert, and two drinks. The rolls were just very underwhelming. Quite honestly it's hard to explain but I would say the quality and taste were on the lower end. I had two cosmos that tasted like straight vodka (not really complaining but I woke up with a headache the next morning). The ambiance is wonderful. It's very inviting and trendy however because of the underwhelming food I'm not sure of I'd return of recommend it to others.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "This food was pretty good- the martinis even had a decent amount of alcohol in them.\nUnfortunately the service was shitty- she rushed us, totally acted grumpy we even came, and in the middle of my ordering- stopped me to laugh at a joke her co worker across the room was making.\nNot one smile, not one thank you, nada- no wonder they needed a groupon deal. :/", "author": "Farha Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "The restaurant is dark and intimate and very modern the sushi here is very fresh and the rolls are unique. I don't quite remember the name of the rolls we ordered but they were all so fresh and the sauces were great! I would definitely come here again. This place also would be ideal for a date since it is quite intimate.", "author": "Nabila M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "I came here to eat with my family and I really enjoyed it. All the waiters were very friendly and welcoming. We were a big crowd, but they had no problem with putting tables together to create more seats. Everything here is really clean and elegant. Weird thing to notice, but none of their plates were chipped. Usually I see one or two in other restaurants haha. Some food I recommend are the sushi pizza, seafood udon noodles and the sashimi. They're soooo fresh. The restaurant can get very busy by 6-7pm, but it's normal here at this neighborhood. It's right by the train station so it's convenient. My new favorite sushi restaurant :)", "author": "Amy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "It does certain things well, which makes us repeat customers.\nThe sushi rolls are pretty good and their 2-for-1 drink specials are pretty excellent (big, tasty and a nice amount of alcohol).  I am gluten-free, and they have gf soy sauce and were able to answer my questions re: the menu.  I recommend the tricolor special roll with no sauce for a good gf roll.", "author": "Bernardo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Came in on a Tuesday evening. Seating area wasn't busy but bar was packed. Got the shumai which were served piping hot and were very good. Got the Lady Gaga roll, omg it was DELICIOUS and HUGE, like 10 pieces huge. I had gotten a shrimp tempura roll as well and couldn't eat it after tackling the Gaga. Interior is spacious and open. Fish was fresh. Servers were on point and the prices were good. Also, the location cannot be beat, as it is directly across from the Clark St. Station. I heard the drinks they serve are delicious, although I didn't have any liquor on my visit. They also have desserts. I will be back for the liquor, dessert, and another Gaga roll!", "author": "Melanie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "I just moved to Brooklyn this month and Ozu has become my go-to for sushi delivery. I've ordered 3 times and have been pleased each time with the quality of sushi and the fast delivery. The prices are reasonable and the sushi is yummy. I'm looking forward to dining-in in the near future.", "author": "Maegen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Outstanding service great food and great drinks definitely coming back .\nThis is one of my to go places around the heights", "author": "Ces M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "The menu must be at least 10 years old. Very limited choices and boring. The fish is definitely not fresh either. We ordered 4 dishes including three rolls one sashimi. Me and my BF both had irritating stomachs afterwards. Not worth a second chance.", "author": "Tiki Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "Ozu has a trendier vibe than the more superior Iron Chef, just one block away. When Iron Chef is too crowded (as it was on my last visit), Ozu is a good alternative. \n\nI sat at the sushi bar and got an up close look at the preparations. The Angel Hair Roll was to die for, and the Christmas Roll was also pretty fun! We also tried the Shrimp Tempura appetizer, which I loved (though you only get 2 shrimp along with some veggies) and the Shrimp Fried Rice which is packed with shrimp. \n\nThough the food was very good, the service was lacking. My friend ordered a second beer, and even asked for it a second time when the server came back around to check on us. The beer never appeared, but it did show up on our bill...which we remedied immediately. \n\nI would go back..but Iron Chef is my first sushi love in Brooklyn Heights.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "I live on Clark street and Ozu is my go to restaurant. Amazing food, great service, nice atmosphere. I recommend 100%", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "Typical Americanized Japanese food, run by Vietnamese people, I think? I went with some Vietnamese friends and they said the waitresses were speaking Vietnamese.\n \nLots of options on the menu. The sushi I got was good, but small. The udon my friends ordered did not seem authentic at all, but it was large.", "author": "Gillian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "Meh, just \"okay.\" The rolls I got (Banzai and Clark) were bland and pretty flavorless. Not in an offensive way, just not particularly good. The fish was fresh and the price is right.", "author": "Megan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "Friendly service, great cocktails ( not watered down!! ), decent sushi ( reasonable price ) !! 2 for 1 drink till 11pm everyday!!! Very good deal!! The only thing i want to complain is the calamari (may b they over cooked tho too hard on the breaded ). Still, i do recommend this place~", "author": "Fifi C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}