{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "I was surprised that the food is decent here. I'm super picky about sushi as I've had sushi in Japan and have traveled there a number of times. It's not like Japan but has lots of interesting dishes on the menu, fish carpaccios, fresh sea urchin, good rolls. Subtle flavors. I love the drink special. I used to always go to Manhattan for sushi but grateful I can stay in the Heights. The fish tastes fresh and is well presented. Service is good. Everyone I've taken here has enjoyed it. Everything I've had is good.", "author": "June K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "M coworker brought me here to celebrate my last week at work. We were seated immediately because we went in for a late lunch. We each ordered a dish and shared the food. \n\nWe had the lunch special which came with three (or two, if you wanted), miso soup and salad. The salad was smoothered with the ginger dressing; very sweet. I didn't have any soup, but the sushi was delicious. We had the Spicy Tuna, Salmon Avacado \u0026 Yellowtail with Scallion. No complaints here; everything was as described. \n\nWe tried the Salmon Hamaki. Salmon was cooked to medium and covered in sweet sauce. It was set very well on the plate with some brocolli, carrots and other vegetables.\n\nAnd since we couldn't decide our last dish, we asked the waitress to recommend an apetizer. She suggested the Broiled Hamaki Kama. This was sooo good! It was a huge piece of fish, the fish tail part to be specific, cooked just perfectly! Not overdone or underdone. It was on the saltier end but when paired with the sweet sauce that came with it, it was perfect! Just a good balance of flavour for the fish.\n\nI can't wait to take friends here \u0026 try some new things on the menu!", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-06", "description": "This was for Delivery\n\nI saw a bunch of decent reviews on Yelp and other sites so decided to give this a try.  Worst mistake of the week thus far.\n\nWe ordered a bunch of stuff.  Seaweed salad, edamame, Tamago sushi, scottish salmon sashimi, yellowtail scallion hand rolls, lady gaga roll, crazy roll, steamed shumai and the christmas roll.\n\nI enjoyed the seaweed salad but half of the container was filled with lettuce so there really wasn't a lot of it.  The edamame, shumai, and rolls were ok.  Nothing great, kinda bland for everything in them.  I've never had scottish salmon and thought it was very good.  A bit milder than atlantic salmon and very nice and buttery.\n\nEver have watery sushi?  Well then try the yellowtail hand roll.  The fish itself was so watery it was practically inedible.  Now one can think frozen fish can be watery if not handled properly BUT THE TAMAGO (egg) WAS WATERY TOO!!!  Disgusting!\n\nThe fact that I needed some chips and salsa after eating just to get the lingering taste out of my mouth means I will NOT be ordering from there again!", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "I spent the summer of 2010 in Downtown Brooklyn, and frequented Ozu at LEAST 3x a week. FRESH fish, beautiful presentation, fair prices, and a very friendly/attentive staff made this one of my favorite spots in town.", "author": "Keith C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-11", "description": "This restaurant is good, especially for those that live in the area, but overall it's nothing special, the sushi is just as fresh as the next place and a bit overpriced. I'd come back again if I'm in the area and in the mood for sushi and too lazy to walk to Smith street.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "Honestly the sushi here is right at the precipice of mediocre. I'm not sure if you're familiar with the landscape of sushi quality but if you fall off the precipice of mediocre you end up in the sea of below average, and there are all kinds of health risks associated with that.\n\nBut the service is like comically attentive and so endearing that it makes up for it. That was patronizing, but go there, it's true.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-12", "description": "I agree with mostly all reviewers on Ozu.  The sushi isn't very memorable, but the prices are great for what you get, and the service is friendly and fast.  I'll definitely be calling Ozu for delivery considering so many people have had good experiences.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This is the best local sushi in Brooklyn!!! Two for one drink deals every day from 4:30 till closing. The staff is wonderful. I go so often they know me AND my family. They know what we want to order and if they have a special they make sure we know about it. I love this place.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "This is my go to place for Japanese food in this area. When I order on seamless it is always fast and fresh. My favorites (that I have tried so far) are the crispy duck roll and the steak fried rice. All the various sushi's I have tried so far were good for the price- I haven't had anything I didn't like from this place.  \n\nThere was a special the last time I went- the tri-color sashimi for $10. The sashimi was good and a bargain for the amount we received. \nI saw a few reviews with concerns about customer service, however my experience was great- they were friendly, helpful and fast. Overall I really love having this restaurant in my neighborhood =)", "author": "Hannah O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "I was feeling great before going out to dinner here with my mother. I ordered a Clark roll and seafood udon soup, but I couldn't finish my 8 piece sushi and hardly touched my soup. After leaving the restaurant I crossed the road and vomited right away. I would credit this to something else, but then when I opened up my leftover soup and found a long black hair in it. It's definitely not mine because I am a redhead. The food tasted good when going down, and the atmosphere was nice, but I am not sure I will be coming back to eat.", "author": "Emily K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "The more I go here the more I like it.  This place has got me into sushi which deserves 4 stars on its own!  Love the lamb chop starters, cooked to perfection and not at all fatty.  Tuna tartar is delicious.  Tried many things on the menu and never been disappointed.  The all night happy hour is an added bonus.", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Very very nice place~I have tried millions of their rolls and sashimi, not once went wrong", "author": "Quintus Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Geat Service! Modern decor. Great variety. Favorite roll is the mango duck wrapped in rice paper. Love their dumplings too :)  nice spot for a date. Take a walk at the promenade afterwards. Beautiful location.", "author": "Valéry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "Love it! Even the takeout is presented with pride and flare..Staff is awesome and always make you feel special. Go! Enjoy! Let's keep this place open.\n(I did enjoy being able to bring my own bottle of wine, but they recently opened a full bar...So I'm not sure you're able to do that any longer.)", "author": "Gia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "The BEST seafood fried rice on the planet. My friends and my wife tasted it and they are hooked! You can go to a high end restaurant and still cant compare.\n\nThe staff is warm and friendly.\n\nRishi", "author": "Rishi K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "Bought group on, however, whereas groupon advertised the full menu, I was given a prix-fixe group on menu with very limited options. I call this the classic bait-and-switch! The group on menu contained very poor options. When I pointed this out to management, they pretended ignorance but finally agreed to let me order from the full menu. However, when it came part of the desert (which again was part of offer), the waitress said I had exceed the allotted value of meal and would have to pay extra! What BS! Ordinarily, I would be OK, but the way the scammed customers is what pissses me off. While food was OK, I will not be coming back here again as whole experience left a bad taste in my mouth.", "author": "Gene T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "* still only delivery review update *\n\nOzu gets more solid every day. I order delivery so often I think Ozu just updated their Facebook status to \"in a relationship.\" I didn't accept the link to me because I thought it was weird, but I think we might be in a short-distance delivery relationship that is quite nice.\n\nOzu really does it up with their specialty rolls and their corresponding prices. While some places get a little too creative for their own good, pairing things that should never be paired, Ozu keeps it fresh and offers some nice alternative rolls. I will lay out a personal guarantee on the following rolls:\n\nCrazy Roll (spicy salmon, avocado, cucumber, tobiko with special seaweed outside) - $10\n\nSeason Roll (toro, scallion, crunch top with sweet shrimp \u0026 green tobiko with chef's special sauce)* - $11\n\nClark Roll (spicy tuna, yellowtail, crunch, avocado, top with tuna) - $9\n\nThe service is also excellent from a delivery end. My friend on the other end of the phone is always super-nice, knows me and always sends a little something extra in the bag for being a good customer. The delivery time from the Heights to DUMBO is never more than 30 minutes from order to door.\n\nI always walk by Ozu and it looks nice inside so I would not avoid going in either. I just happen to enjoy having it delivered right to my door. This is an excellent addition to the Heights, where there is a fair amount of sushi, but most of it decidedly average. Ozu stands a cut above most.\n____________________\n* If you do not like sweet shrimp (amaebi), do not get this.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Our favorite Brooklyn Heights Sushi restaurant. Amazing, broad menu (with specials every day). Full bar. Friendly, efficient staff. Eat in or order for delivery, the quality is always great.", "author": "AJ D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-09", "description": "My friend and I went to Ozu and were not impressed...I am surprised actually it has such good reviews.\n\nOur service wasn't that great, until out waitress switched on us (she kept leaving to answer phones).\n\nThere was no flavor to the sushi that we ordered for whatever reason, it did not seem fresh. My friend did order chicken teriyaki which looked very fresh and a decent portion, however the sushi rolls were small and flavorless. (and we both had an array of different sushi).\n\nThe pricing wasnt horrible but we left still hungry and disatisfied...", "author": "Amie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "This is our go-to for sushi in the Heights. Fresh ingredients and a clean, modern feel. Great lunch specials. Lady Gaga roll is a must-try!", "author": "Kari K."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}