{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "I have to thank this place for introducing me to the beef negimaki, it is superb here! I also have to praise the Naruto rainbow roll as well, beautiful presentation with wonderful flavors. The sushi here is fantastic, the disappointment comes with the non-japanese items on the menu. We got a Thai soup that was weak in flavor, it seemed to be watered down. I would go back for the sushi, but only the sushi.", "author": "Mel N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Lunch box combo is so worth it for the price ($9). Got the chicken teriyaki and it came with miso soup, 2 spring rolls, 8 pieces of California roll, vegetables, rice and fruit. On top of that I had it delivered and it came within 30 mins, hot and in a cute box. Would definitely recommend!", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Found a favorite sushi place,great food and friendly service.......give it try ，really good place", "author": "Christy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "I want my money back.\n\nUpon entering the restaurant we were presented with a limited choice menu for groupon only and treated like we are trying to rob the restaurant.\n\nThey tried to rush us out the whole time.\n\nWhen we were about to order drinks, from the menu the server told us, we can order anything from the menu, but later corrected and told us for sake only the cheap house sake, also not mentioned in the menu. \n\nSo we ordered a cocktail, which was really bad. I asked the waitress if I can change it and she calls the manager, who also told me we can't change it.\n\nThen the food came after 20min, we ordered the same roll as the neighbors next table, however our rolls were significantly smaller 5 pieces instead of 8, and the actual diameter of the roll was smaller. The spicy salmon looked different from the one from next table. We were afraid the food was tampered with and did not eat it.\n\nI am extremely dissatisfied and want my money back. The restaurant should disclose any details related to the order and not treat me as as a criminal.", "author": "Kris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "Had delivery via Grub Hub. The food was really good and affordable. Chicken Teriyaki lunch box $10 - soup, salad, California rolls, white rice, 2 veggie rolls. The chicken was cooked perfectly. Teriyaki sauce not too thick, not too sweet.. it was just right! :-)", "author": "Aisha D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Came here with a groupon deal. There's a separate menu for it. Big restaurant. Lighting is not too dark or dim or bright. There's a cool retro red OZU sign by the entrance.\n\nService was quick. Food was mediocre.\n\nDrinks: Ozu Mai thai \u0026 that martini with sake in it. Both were not too strong. Ozu Mai thai tasted like pineapple but not too fruity. The martini wasn't fruity or sweet at all.\n\nAppetizer: calamari was very uniformed. It was all the same ring sizes. Usually you would get the really small ring but it wasn't there!\n\nRegular roll: Ozu roll. Cooked salmon with onions wrapped in seaweed and rice. Not a good roll combo. The onion taste took so long to leave my taste buds.\n\nSpecial rolls: Lady Gaga roll and Out of control roll. Both pretty good. \n\nOverall it was alright. The groupon deal was worth it but otherwise not going back again.", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Stopped in here for some sushi the other day and it was really good! The place was very clean which I find very for sushi places! The food was really good and they had a lot of options to chose from! We ended up ordering a lot of different rolls, some Japanese sodas, udon soup, salmon teriyaki, and some tuna! They were all excellent and definitely a place to go back to! Very satisfied!", "author": "Kailee H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I had seamless take out tonight.  Their sushi is sold and pretty authentic Japanese style. Fishes are great for the price.  Out of all the Japanese restaurants around here, they serve the best basic sushi (Japanese style, not crazy rolls). I'll definitely order again!", "author": "Yuko A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Horrible! Very slow service! Their sushi pieces were the tiniest pieces l've ever seen! I went there to enjoy my lunch with my wife and all we experienced was anxiety! They forgot one of our orders! It has never happened to me even in the busiest restaurants! It was a shame!! I don't know how they survive with this poor service in Brooklyn!", "author": "Masih T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "Sushi chefs throwing fish around angry yelling in Chinese. My \"mackerel\" was some mystery fish and teriyaki sauced drenched all the rolls. NO GO.", "author": "E L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Great rolls and not expensive. \nComes with a nice ambiance and good service :)\nThere is a wide variety of rolls and the fish is good.", "author": "Trinh And Laurie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Ozu is such a great neighborhood restaurant. My favorite is the spicy seafood soup, all the rolls and the two for one drink specials. You can NEVER beat that. It baffles me why they are never crowded.", "author": "Sabrina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "Pretty solid 3 stars - nothing major to be unhappy about, but nothing particularly outstanding either. My Red Dragon Roll came fairly quickly (~10 minutes) and had some decent crunch, but other than that texture and flavor were rather bland. On the good side of bland, to be sure! but still bland. Basically, a suitable place for food if it's late and pouring really hard outside and you just want to find the nearest restaurant because water is slowly but surely starting to seep into your shoes.\n\nDecor is reeeaally nice and modern though, loved it. If I come again maybe I'll take advantage of the 2-for-1 drinks deal. Mmm drinks. Mmm alcohol.", "author": "Millie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "This restaurant really has it all.  It is my go-to place every time I want to get together with a group of people.  The food is very good, sushi is very fresh, and the presentation is absolutely beautiful! (See pictures)  As if all that isn't enough, the restaurant has a happy hour from open to close with 2 for 1 drinks!  And as a martini drinker, I fully expected that my martini would be watered down, but no!  I have NO idea why Ozu isn't packed every day of the week, but as some reviewers mentioned, it's usually half empty, if even that much. My partner isn't really a big sushi fan, but there is enough cooked food on the menu to keep him happy, as well.  Prices are good (considering the neighborhood) and I am unfailingly met by cheerful and polite serving staff.  Run, don't walk.", "author": "Karen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "My visiting bf and I were wanting to explore Brooklyn and came across this sushi place (not traditional Brooklyn fare, but whatever). The sushi was very good. They have a two for one special during happy hour for cocktails. We both got two Long Island Iced Teas each so we got pretty tipsy. I ambiance of the place was also very nice.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "I ordered a lunch special. It came with steamed shrimp and vegetables with rice, small salad, and soup.\n\nThe food was OK. Definitely no complaints but also nothing special.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Been here quite a few times. The food is pretty decent, have had the duck salad a few times, as well as the sashimi entrée, and sushi rolls very tasty. I'm a fan of the bogo drinks, but they sometimes forget to adjust it on the bill, so keep an eye out for that. Also the waitresses don't seem to be very knowledgeable of the menu, and don't really seem to be very experienced either, and messed up my order almost every time I've been here so that's been pretty annoying. Delivery is very quick and the lunch specials are pretty decent too. Nothing really makes this restaurant stand out as extraordinary though which is why it only deserves 3 stars.", "author": "Jake S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Happy hour!!! 2 for one drinks and they are so strong two is all you will need. The service is always very quick and staff is very nice. I love their habachi menu and the sushi is also delicious. You can't beat their lunch specials too. Check them out.", "author": "Yolanda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "Used a Groupon Deal here: http://www.groupon.com/deals/ozu-1\nThe deal: 3 appetizers and two drinks for $18, valued at $38\nYou are limited to certain appetizers which cost $4-$5 each.\nDrinks are two for 1 till 11pm everyday.\n\nSummary: \nThey charged us $38 flat-rate for dinner to account for the cost of Groupon.\nAdded %18 gratuity for a party of two; 9% tax, then subtracted $38 from the final total of the bill.\n\nActual Experience:\n$15 for appetizers (3 x $5), $10 for drinks (Buy 1 get 1 free), Total = $25\n\nIf we bought the same items without the Groupon it would have been:\n$25 x 1.09 (tax) x 1.18 (gratuity) = $32.15\n\nNet with Groupon: [$38 x 1.09 (tax) x 1.18 (gratuity)] - [$38 (groupon credit) + 18 (Cost of Groupon)] = $28.87\n\nACTUAL GROUPON SAVINGS: $32.15 - $28.87 = $3.28\n\nVerdict:\n18% automatic gratuity for party of two = bullshit\nForced to choose between 3 cheap appetizers = bullshit\nOverall Value of Groupon = bullshit\nWould I Recommend this = No way!\n\nWhy two stars?\nFood was reasonably tasty and presented well.\n- Exception: had to return dumplings since they had a foul odor.\nDrinks were well made and adequate in size.\nI recommend ordering a la carte", "author": "Mystery M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "Too expensive. Naruto Rainbows suck. Lobster was okay. But seriously $30 for like 6 pieces of sushi. Come on. Nope. \n\nAlso the water quality looks contaminated.", "author": "Cal C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}