{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "This place is my usual for delivery sushi. The delivery is often quite fast. The sashimi has well sized cuts and is always fresh!", "author": "Nick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "A friend invited me for a dinner at this Japanese restaurant on a Thursday night. This place has really fancy decoration. I love the atmosphere in here, light music and dim light, a very good place to bring the date to. I got the salmon appetizer, it was really good and fresh. Also ordered the Chicken Teriyaki and Tempura combo. The service was excellent.\nThey also gave me a 10% discount for its grand openning. The price is little cheaper than other Japanese restaurants in the neighborhood.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "One of the best sushi experiences I've ever had -- in fact, so good that after the first time I went by myself, I went back the very next night with my husband.\n\nBoth times I sat at the sushi bar and was delighted that the sushi chefs were eager to talk about what rolls and what fish they like best. As a result, I tried fatty yellowtail for the first time and got some Japanese raw oysters. Loved both, but especially the yellowtail.\n\nThe presentation is a big part of what put the place over the top so try dining in to get the full effect, but the taste was so wonderful that I just sort of closed my eyes and groaned in happiness. My delight was so obvious that one of the chefs gave me a deep, proud bow.\n\nWe got the Yankee sandwich, which was a sort of bizarre but yummy combination of fried eggplant with spicy tuna and lobster salad, the pepper tuna roll, a departure from my usual spicy tuna roll, and the magic roll, which really was. We also got a special roll I think called evergreen with tuna and jalapenos, which was great, and the Clark roll, which was merely good.\n\nThe downsides: two TVs playing different shows and seeming more suited for a sports bar than an elegant, modern new restaurant, and the top 40 radio playing Gaga. Really? It's also pretty dead for dine in, so if you're looking for a fun crowd, you won't get that. Looking for a quiet place to decompress after work, right across from the 2/3? Maybe, as long as TVs and radio don't bother you.\n\nI initially thought the prices were on the high side, but the rolls are huge, so next time I'll order less than I do at most places and probably get our bill down. Plus it's BYOB, which makes it cheaper.", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "This Japanese place is da bomb!! Better than Iron Chef! It is very inexpensive and wonderful! If I could go back every day I would! The decor is nice, and the waiters were excellent! I don't know why it is always empty? If you like the place, tell all of your friends because it is worth it!  \n\nIt is also BYOB! That is awesome!", "author": "Ben D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "Tonight, me and my girlfriends decided to try out Ozu, which is a new Japanese restaurant/lounge in Bklyn Heights, and we weren't disappointed!!...I love the ambience, decor and the food was phenomenal!!...I tried the very fresh tasting and well cooked \nSalmon Teriyaki with delish Beef Nagmaki which also had fried shumai, brown rice, and California rolls...I was so stuffed just from eating the Salmon with vegetables, that i asked the waitress to brown bagged it....The presentation of the food was very elegant, and I felt like i was dining out in the city...Although, they don't serve cocktails yet because their waiting for their liquor licence, you can bring your own wine which is pretty cool!!...I'm definitely coming back \u0026 has bookmarked their website as a favorite!!...Go and check this place out, because it's worth it!!...:)", "author": "Dominique P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Ozu is probably the best japanese restaurant in the area. We've came here several times for lunch or ordered to go and it's always very fresh and tastes great. But it's never busy there because their location is a bit off the busy streets which is a shame given how much better they are. It's a cool place to sit down and service is nice and friendly. Most of the time I just get sashimi or rolls and they never fail to deliver. I hope this place picks up as it deserves some credit.", "author": "Namik G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "A friend and I ended up here totally famished after a long day at work. I just moved to the neighborhood a couple of days ago and was eager to try some local places. \n\nWe had the scallop motoyaki to start. It was a little too mayo-ey, but once we scooped some of it aside it was pretty good.\nI ordered the magic roll and the philly roll. The magic roll was super good, one of my favorite rolls I've tried so far. The philly roll was ok, nothing special. \n\nWe also tried the tempura apple and banana dessert. The apple texture was a little strange, but overall it was a good dish.\n\nNote: they were very excited about having a full bar, so my friend and I decided to indulge in a cocktail. Not sure if they were missing a bartender, but the drinks were a little off. Might want to stick with beer and saki here, but it might be worth ordering a cocktail when the bartender is there on the weekends.\n\nThe open book dishes are cute, and the waitstaff was very pleasant and very fast. I'll definitely be going back!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Excellent service and good sushi. The scallop appetizer was amazing and the drinks were just right. Great place for a quick bite or a date.", "author": "Maurice S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "BYOB. It's Ozu's best kept secret. Hopefully the liquor license won't arrive.\n\nThis new sushi restaurant is the nicest I've seen in the area. Great food, great value. And finally, a modern space, like Joya, that isn't tiny or harried, or closed by 9 -- Clark Restaurant, what's up with that? But that's the charm of Brooklyn Heights and I love you for it.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-02", "description": "Strange.  Is it strange to open, yet another, sushi bar on a street with two other sushi restaurants on each corner.  I was in a hurry and just grabbed a Crispy Tuna Roll, tea, and a bowl of Edamame.  Presentation was beautiful and the food was tasty.\n\nSomeone has obviously put some money into this place but then left the marketing to a neon paperboard sigh with \"15% off\" written with a sharpie and propped in the window. Luckily the staff was very friendly and helpful.  \n\nNow for the strange part.  I had ordered and was waiting for my food when I saw movement, under the table and at the bench seating, behind me... startled as I thought I was sitting alone... I watched the sushi chef crawl out from from his afternoon siesta. Is that a Japanese custom i am not aware of?", "author": "Natalie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "The lunch Bento Box here is a really great deal because it is includes soup and salad in addition to a well sized entree.  The salmon teriyaki was absolutely delicious and fresh.  In addition, the decor is comfortable and classy.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Ok let's clear all the misconceptions about this place ask for Amy and expect a great service the Sushi is really good amazing location awesome decor we loved every moment of being there it was a fabulous dinner and we mentioned Groupon before going so they surely have a different menu for Groupon but you know Yelp makes a huge difference and I make it a habit to mention Yelp anywhere I go The strength of yelp means a lot to people in hospitality businesses. Saying this I wouldn't credit the fact that we were treated as Royal family cause we mentioned Yelp but Amy is Really very courteous and so was Eva and this is a place I would surely recommend great food good ambience and warm service", "author": "Vik R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "OZU was OZume!!! (\"Awesome, lame attempt, I know)...  I only rate places when  I love them or am really disappointing. This place was great.  My wife and I were wondering through Brooklyn Heights looking for some lunch and stumbled upon this place.  We were immediately attracted by the decor.  The place has lower light, and the feel of a nice restaurant, while not being too fancy to be a local hot spot.  When I sat down and saw their napkins, I really felt bad using it as I know they weren't cheap.  They have like flowers and stuff on them, they aren't your typical picnic napkin.\n\nWe sat down really wanting some Japanese beer and sushi.  Unfortunately, we thought, they did not have their liqueur license yet.  However; they told us we could go and purchase our own alcohol.   There just so happens to be a \"wine and spirits\" store across the street with a great selection.  So, I went next door and bought a $10 bottle of wine that had a twist top, not knowing if they would have bottle openers or not.   I came back with the bottle and the waitress, not knowing it was twist top offered to open and poor it for us.  She was GREAT!!!\n\nThe Sushi here was very good.  Like other people have said, the presentation was AMAZING.  We sat at the bar and the chefs (is that what you call them when they do sushi?) would take their time and do each plate differently.  It was really fun to watch.  We had 4 rolls of sushi, all of them were really good.  They have something called \"crunch\" which adds that little extra to it, and it is great...look for it.  \n\nWe left this place for a little over $30, including our wine from next door.  If you are a drinker get on this soon.  Although; I think when they have normal prices their drinks won't be too bad, based on the price of the rest of their food.  We went on 5/29/10 and had a great time.  Please review after you go, I would like to hear what other people think.  If you have had better sushi let me know, because this is my goto place till I find something better.\n\nThis may not be important to most of you, but it is to me.  Their bathrooms are amazing!!!  To get there I walked down a narrow hallway surrounded  by some shiny silver curtains.  I came to a 10' door.  I was expecting the biggest bathroom ever' fitting of a 10' door, but it was a single holer!   I had the whole place to myself!  I had to go pretty bad and my balance wasn't great (BYOB).  So, I had to Superman it.  One hand on the wall and two feet firmly planted on the floor. The wall, which is stone, was very cool to the touch, which made even my peeing experience spectacular!!!  Even if you don't eat here you should try their bathrooms.  But if you do that you are a cheap douche, so buy an awesome roll, drink some alcohol, and try their bathrooms.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-25", "description": "Rather than writing a detailed dissection of the food, let's just say it's similar to culinary experiences I've had on business trips to small towns in the Midwest and trying the local Japanese joint. \n\nAgainst my better judgment, I tried the Crispy Peking Duck (Chinese food in a self-proclaimed Japanese restaurant), which was served in a cold Mexican flour tortilla that you get in supermarkets, with parsley on top (?) and oddly, was not crispy (nor flavorful) \n\nThe decor is somewhat promising, but countered by the Z-100 (including commercials!) static-y radio playing faux teenie bop-er trance. I also don't like TVs in restaurants.\n\nBTW--A lot of the Yelp reviews for Ozu are HIGHLY SUSPECT.  Many are from first time posters with a goofy marketing message touting the 15% off deal.  It's clearly the owner and his mom trying to jack up the rating.  Sad.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "This is a great sushi spot if you are also looking for decent drink options. Used to come here all the time when I lived close by. They have a buy-one get-one cocktail deal, and lots of yummy unique sushi rolls. The interior is also very nice- clean, chic and modern. There are a few sushi spots in the area, but I would definitely recommend this place for a nice dinner out with cool cocktails!", "author": "Devin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "I live a block away and finally went to Ozu for the first time at lunch today.  The service is very good, the decor is what I expected, and I was pleasantly surprized by the food.  Honestly, I was amazed at the size of the servings in relation to price.  As far as flavor was concerned, in my opinion Ozu has hit a home run!  I had the spicy tuna, shrimp tempura, and the yellow tail w. scallion rolls.  The flavors were great.  I will definitely be going back to this place!", "author": "Shannon N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "We have eaten here a few times, mainly because of convenience.  The first time the sushi was very fresh, and a pretty good meal. It's nothing spectacular, but is still quite good. My BF loves their Philly Rolls. I have found on other occasions the sushi to have that dreaded 'fishy' taste to it- particularly the tuna. It's certainly not the best sushi in the Heights from what we have tried so far. I think of it as a hit or miss experience.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "It's right across the street from the subway station. The presentation is simply gorgeous, and the plates they use are so nice. One of them is shaped like an open book, not the typical round dish or wooden sushi stand. This is more of a modern Japanese restaurant. The food was really good and fresh. I highly recommend the volcano roll. It was my favorite dish of the night.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Ozu is wonderful. My friends and I come here to relax. It's my favorite place for sushi in Brooklyn. The atmosphere is modern and laid-back. The location is perfect. You can eat then walk down to the promenade and it's right across from the clark/henry st station.\n\nThey offer a wide variety of sushi, sashimi, and other Japanese crusine plus the 2 for 1 drink special is an awesome perk (and the drinks have tasted good every time I've ordered one). The customer service is great. The people are always friendly and welcoming. I've never had a problem.\n\nPrices vary but if you are on a budget, you can get full and not empty your wallet. Food wise, my favorite is the \"Spicy Girl Roll.\" It's fried shrimp wrapped in avocado, rice, and seaweed topped with a spicy lobster sauce. It's off the chain lol. My favorte drinks were the Godiva Martini (try it) and the white russian. Recently tried the tempura cheesecake. Delicious.\n\nIt's best when it isn't very busy, like ALL restaurants.", "author": "Jeremy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "This is the first review I've written on Yelp, however I had such a great experience at Ozu I felt compelled to write a review to get the word out. \n\nI'll try to keep this short and sweet: I've now eaten there once and had delivery once. The restaurant was great to bring our 13 month old (if you go at 5:30 of course!) because they have high chairs, plenty of space, lots to look at it, and it's not a particularly quiet place where every move she makes is noticed.  Although a little clubby for my taste, the decor is very well done. The host and waitresses were extremely friendly and helpful. Food was excellent. Definitely better than Iron Chef which I always thought was ok but seemed to get great reviews. The presentation of each dish was beautiful, fish was super fresh (that's from my husband since I am pregnant and stuck to the many delicious vegetarian options), and I thought the prices were really reasonable. Our delivery experience was great too -- same great food and quick delivery. \n\nFor full disclosure, I am a Brooklyn Heights resident and interested in having our small businesses actually thrive and stay in the neighborhood, but trust me I'm not about to misrepresent my experience to have another crappy restaurant stay in the neighborhood (unfortunately we have plenty of those!). I truly think Ozu is a great Sushi restaurant all around and by far the best in our neighborhood. Try it out!", "author": "Becky G."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}