{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "This place is next door from my apt, and even though it took over my favorite chinese place, I still wanted to give it a fair chance.  I was a little put off initially by its attempt at being trendy, but once inside you I seemed forget about, with the exception of that tacky neon on the wall.\n\nSince I was alone I sat at the sushi bar.  After I ordered, the sushi chef sent over a free little sushi thing which was delicious.  I ordered based off the chefs recommendations and was extremely pleased by all the sushi that came out.  I got a little history about the restaurant from the chef which I found to be very interesting.  Apparently the owner used to be a take delivery man in the same neighborhood back in the day.\n\nIt was BYOB when I went, though I think they finally got their liquor license.  I am not sure if it beats Iron Sushi up the street, but its pretty damn close and easily had triple the amount of seating.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "This is one of my go to places weekly. Gotta love the 2 for 1 drinks! And the sushi sashimi meal is awesome. Lunch sashmi is great too.", "author": "B C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "They provide a limited menu for the Groupon, which was a disappointment. We never reached the value of $63-only about $58. Plus, their drinks are priced high.  Our waitress spoke English with a very thick accent.  She had trouble understanding us and we had trouble understanding her.  However, everyone in the restaurant is very nice and it has a nice ambiance. It's a nice place to have happy hour $3 drinks, watch a game, and eat.   Surprisingly, the not so special roll seemed more special than the special rolls. I think it's called Osaka and as for the special rolls, we had Mango Hawaii and something else with tuna and tobiko on top.", "author": "Ny'ker C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "My feelings towards Ozu are pretty much exactly what Krista J. has mentioned a few reviews below. It's essentially the trendier and newer version of the better restaurant down the road. Ozu is much more modern, it's larger, and it's certainly \"prettier\". \n\nThe sushi was pretty decent(I've had the House Sushi, and a few of the rolls). It's fresh and I can't complain it. There just wasn't anything that gave it that extra \"oomph\" or pizzazz for memorability. \n\nThe service is decent, though I would say Iron Chef is probably slightly better. I probably wouldn't go back if I could go to Iron Chef, but Ozu is a pretty decent alternative.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Ozu is a great place for sushi. The place accommodates for various occasions such as family dinners or large gatherings, birthdays, and also offers options for kids who may not be interested in raw fish. The area is large and spacious.\n\nThe food is also amazing. Items such as the tuna and avocado pizza were amazing. I went with family so we ordered five of them. It was THAT good. We also ordered the seafood udon which is a great option if you're not into sashimi or raw fish. Depending on which rolls you order, their size can range from medium to big. (The fried rolls are bigger.) The sashimi slices were also really which which my family really appreciated, but I just don't have the palate for raw fish. xD\n\nI speak highly of this place and it's definitely worth trying out for yourself. Don't be afraid to try the items that no one else has tried yet! Stumbling upon the tuna and avocado pizza was one of the best things I've ever done!", "author": "Andy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "This sushi lounge is a casual and trendy place to get together for a drink or a late meal. The sushi is good, though nothing special. However, the two for one drink deals (\"happy hour\" until 11 pm) are awesome - where else can you get two cocktails for $10 in NYC?? One fun tip - we gushed to the waitress about how much we loved the food and she gave us two chocolate, banana cream liquor shots!", "author": "Dee L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "We ordered food from here on GrubHub, paid but it never arrived. Tried calling the restaurant multiple times but couldn't get an answer. Pretty bad service all round.", "author": "Lee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "When I used to live in the neighborhood this would be one of the better sushi spots to go to. The decor is pretty fancy but despite that it is a casual spot. Food also comes out rather quickly and everyone is friendly. They also have bogo drinks which is nice. Not a high end sushi spot though. Good for a quick dinner.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "The food here was okay but the service was excellent. They even threw in an extra tempura ice cream on the house since we had a birthday boy! Would definitely not mind going back if I'm in the area.", "author": "Drew E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "Definitely an interesting place right by the subway. \n\nThe miso soup was simply amazing :) it was warming and filled my soul with happiness, especially when it was cold and miserable outside T_T;\n\nI also had the tuna tataki. I ordered it without any specifications; all i knew was that it came with ponzu sauce (my favorite!). When it was brought out to me, i was astonished at the presentation. Yay! Cucumbers! :D fresh tuna, seared to perfection, but I thought it needed a little more lemon. no biggie. reasonably priced also ($11 for tuna tataki and $2 for miso soup). oh, and free fruit!\n\non a side note, the bathroom was also pretty interesting. \n\nbtw, you MUST get the candy by the hostess stand. the flavor is asian pear. once i ate it, nostalgia overcame me lol. awesome way to top off the meal.", "author": "Paulina N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "This place was a very solid three star performance. \n\nThe rolls had fresh ingredients and smelled like the sea rather than fish (which is what I look for in a great sushi joint.) This place is small and trendy and right across the street from me. Pretty cheap and quick. I literally ordered 2 rolls and, 3.5 minutes later, it was on my table. \n\nThe ginger was rough. It smelled and tasted like chemicals and it crowded my palate. Lunch prices were dirt cheap.\n\nI'd go here again. Nice and relaxed eatery.", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "I #%^*ing LOVED their sushi (pardon my language). I just had it a few hours ago and It literally put me in a trans of satisfaction. I didn't eat there I picked up, however I stepped in, and it has a beautiful bluish purple atmosphere and I would have been ordering more and more food if I sat down there to eat. I want more of that sushi. oh yea and it was my first time every eating from here. \n\nif you want really yummy sushi with pretty sweet names then seriously come here.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "I just want to take the time to show my appreciation for Ozu.  Ozu is a very nice Japanese alternative in a neighborhood with several options, including one right up the street, Iron Chef House.  I prefer Ozu to Iron Chef House because they serve sushi in a more straightforward way.  If you order a spicy tuna roll, that's what you'll get: a minced spicy tuna mixture, rolled in rice and seaweed.  If you get it with \"crunch,\" the improvement in texture is well worth it.  In contrast, a recent lunch at Iron Chef House reminded me of why I haven't been there in years.  Both rolls I ordered were covered in a thick sauce, and my two salmon sushi were sliced too long and thin, placed atop an over-sized ball of rice.  Even I, with my big mouth, didn't dare attempt to eat them in one bite.  Ozu's sushi is served in a much more palatable manner, with a better ratio of fish to rice.\n\nI'd like to make a special mention of Ozu's tempura appetizer, which I always order if I dine at the restaurant rather than take out.  It is very nicely cooked, with the correct amount of batter.  I've never had a tempura dish at Ozu that has been over battered as often happens at Japanese restaurants.\n\nOzu is not a fine dining Japanese restaurant, but it is a solid neighborhood restaurant that I hope stays around for a good long while.", "author": "Graham B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Good sushi. Good cocktails. The Groupon is a bit skimpy and could be a little better but overall the sushi is pretty good quality and not very expensive.", "author": "Josh E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Tried the restaurant because of a Groupon I purchased.  Atmosphere \u0026 food was great.  Will make this a spot to go to on occasion.", "author": "Kiara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-01", "description": "Ate: Duck appetizer, sushi sashimi combo, dragon roll\n\nDrank: Sake, lychitini, kirin\n\nLiked: Duck and dragon roll were decent\n\nDisliked: The service blew big time. One of our waitresses couldn't speak English, another told us we could substitute an item and the owner later wanted to charge us $2 to do it. And this is for a cheaper item! The best part was her reasoning that the magic roll was already premade. Why would I want a premade roll!?\n\nChicken: Not a lot. Probably not worth it anyways.\n\nWould mom like it?: Mom would start yelling at them in Chinese soon into the meal.\n\nWait: none \n\nWould I go back: Only if they comped my next meal.\n\nRecommend: Just getting drinks here or be ok with poor service.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "A good sushi meal in New York for less than $20 and BYOB?!\n\nWelcome to Ozu.\n\nChirashi for around $15. Maki combo (spicy tuna roll, salmon with tempura roll, and eel roll) for around $13. Specialty rolls anywhere from $8+. The food is fresh and the portions are plentiful. Each roll usually has 6-10 pieces. \n\nThe place is nice and trendy. And the service is super friendly. Only problem is that they can be really slow at bringing out food for large groups (45+ minute wait). \n\nDon't forget to grab some guava candy as you head out the door. And get the menu for free delivery orders.", "author": "Alice T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Nice, clean. This is the second time I've come here. Prices are reasonable. Sushi was good, loved the Lady GaGa rolls, weird name, great taste.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "Always reliable \u0026 good. Never had long wait, always able to accommodate large group. Nice wait courteous staff, although it's a little bit dark interior, it's very consistent quality with sushi \u0026 hot entrees are delicious. Will always be my pick in the Brooklyn Hts area.", "author": "Kat L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "I walk by this place everyday. \n\nI got handed their menu on the street the first day I was here. \n\nSo why has it taken me so long to try it out?\n\nI love all food so when I get a really intense craving for something, I feel like I must oblige and that's what led me to Ozu. Maybe it was intuition because it was also the last day of their Grand Opening special. Even though the nice man on the phone told me they were no longer doing it, he gave it to me anyways. \n\nAlthough this menu offers all sorts of great sounding Japanese food, it was shrimp pad thai that my tastebuds were calling for. I picked it up fast and easy and was amazed to find the amount of noodles that awaited once I ripped open the brown paper bag. It was good. Not my favorite pad thai ever but it did the trick. I even think it tasted better the next day. \n\nThe great service and close location will definitely lure me back to Ozu soon. Maybe the BYOB too.", "author": "Cassie P."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}