{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-15", "description": "Had some pretty average-to-bad sushi here. Maybe it was an off night. But 4/5 pieces were too fishy tasting.  I'll stick with Iron Chef, thank you, and maybe try Ozu again in a few months, since I like to support my neighborhood businesses.", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-08", "description": "I've only ordered delivery (which was very good), but what stood out was how sweet they were on the phone. Aaron introduced himself, said he hoped we would one day come see the restaurant, talked about the decor and asked how our previous order was the second time we called. He sounds like an adorable uncle. Too many restaurants forget the importance of customer service. Ozu isn't just a nice restaurant, it's a friendly neighbor... who happens to make great food!", "author": "Janny J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "They love to please - so get in here while the Nobu-trained sushi chef whips up wonders to delight the eye and the palate. Sexy and fresh this joint takes Brooklyn Heights back to the place you might, say, swankily hang out in again. Rumor is, dj's are a coming. Bring the noise, that's all I'm saying.", "author": "Ella N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "Great neighborhood sushi spot with late hours.  Service is always great.  Their soba is not bad either. ...and there's a full bar.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-29", "description": "This place is awful. Do not eat here...The fish is warm and my friend got deathly ill after eating there. \n\nYou have been warned.", "author": "bkln b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "My friends and I who are living in Brooklyn for the summer are OBSESSED with this place. We literally eat here once a week, if not more. They have great drink specials and amazing rolls. Highly recommend", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "The fish here is very fresh and delicious. The restaurant is adjacent to two other sushi places, which are also quite good, so they have to compete with each other. Ozu is the best. The sashimi is upper shelf Manhattan quality at Brooklyn prices. The chefs are creative, but they let the outstanding ingredients speak first.", "author": "Yondas E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "I've been here about six times now and the staff is always super friendly and attentive. I always go for the the special rolls since I'm a maki kinda gal, all around $8 to $13, very inexpensive for the quality and portion of sushi you are getting. The Mango Hawaii, Unaju and Magic Roll our some of my favorites. Yum!\n\nThe fish is so fresh, no fishy taste whatsoever. I always get something with eel when I come in here and it just melts in your mouth, not chewy like some really bad sushi places I've been too. \n\nBy far the best place for sushi in Brooklyn Heights, maybe even Brooklyn. Far better than Iron Chef. I'm hooked!", "author": "Nell C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "There really aren't a lot of places to order good Japanese takeout in Brooklyn Heights. That being said, Ozu definitely makes the cut. I had the Chicken Teriyaki with Beef Maki if I remember correctly and it was a lot of food. The food is cheap and good, the delivery good. I would definitely recommend it to someone who enjoys Japanese food on a casual basis.", "author": "Divya P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "Wow I felt I must review this place as I saw its really high rating--  I think its very misleading.  My boyfriend and I ate here a while ago-- maybe in April?  Its been awhile, so maybe they have gotten better, but I will describe our experience then.\n\n1st of all, the location is very surpising.  There are 2 other sushi places on the same corner.  One right across the street.  The other one is a very popular place that is absolutely delicious and I imagine a big competition for this new place.  \n\nThe interior is very nice, it has a loungy vibe; a modern manhattan feel;  We were ordering some of the special rolls and asked for suggestions and our waitress, although very nice, did not seem to know the menu.  She wasnt very convincing.  We ordered gyoza and eddamme for an appetizer.  The gyoza had a strong taste of plastic-- almost like the burners were new or something and the fumes had infiltrated the food.  Not good.  The special rolls that we got were also just not very tasty; maybe we chose the wrong ones, but it would have been helpful to have a more enthusiastic waitress that knew the menu better.  We havent been back since.", "author": "emily m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-21", "description": "I LOVE this place. I was a fan of Sea Asian and was despondent when they were pushed out by greedy landlord. Never quite understood the iron chef obsession that afflicts my neighborhood.\n\nAnyhoo, the food is delicious. fresh, great value. The smoked eel roll is amazing as is the tempura. Light, fresh, flaky, panko. what else can you ask for? service could not be friendlier and more attentive. the owner makes an effort to remember customers so even after a short time it feels like Cheers. \n\nHope Ozu stays around for a lobg time.", "author": "lola f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "This was my first time in Brooklyn and we did a google search for sushi in the area and this looked intriguing. This is a great place with great value. The interior is very trendy with a full bar but the prices will not scare you away. Everything is reasonable and very tasty. The service was great and 2 FOR 1 DRINKS! The manager Aaron was very nice and friendly. I highly recommend this for anyone, but a solid date spot if you want to impress without breaking the bank.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "Very clean, new place.  Sushi is very fresh and attractively plated. They put enough wasabi on your plate too! Some places put too small of a dab. The salad that comes with the dinner is good, lots of other veggies in it besides lettuce and again attractive and tasty.  We had a restaurant.com coupon, but neglected to read that it's good from Sunday to Thursday!  The manager kindly showed us the fine print, which many of Restaurant.coms coupons have......But he gave us a big discount anyway and gave us pot of Sake for our table of 4 for free! Yes, Bathroom looks better than most peoples home bathroom. I've been to most of the Japanese restaurants in the Brooklyn Heights area, this will be my new favorite, especially when you get the Restaurant.com coupon - just come Thursday to Sunday.", "author": "Gregg J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "Great food at a pretty good price, easily the best sushi in Brooklyn!  Also has a great atmosphere.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "I love this place!  The food is amazing and fresh and the servers are very friendly.  Best quality sushi in Brooklyn Heights, hands down.", "author": "Vick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "We ended up here after an appointment in Brooklyn Heights. Loved the food and the sushi guy named Sky was very skilled and friendly-he even gave us a tasting item for free which was really yummy. Michelle is an excellent hostess and was very helpful as well. We will be back!", "author": "Margaret A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "The food can't be any better plus the fact that they are having a promotion right now. The restaurant is nicely decorated and is a welcoming place with good service. I will definitely go back with my family and friends.", "author": "shirley c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "I think this place is terrific, not to mention one of few places in the Heights that can truly be described as \"good,\" let alone \"terrific.\"  The first time I got dinner I had stopped by and asked for a recommendation.  I bought what the maitre d' recommended and because it was so good was back a week later to get dinner again.  The fish is certainly fresh, and the drinks are not \"weak.\"  I note that last time I was there it was with my boyfriend, who does not eat sushi and was just keeping me company at the bar, so if his drink had been weak I'd have heard about it for sure.  (Mine was, if anything, too strong.)  I don't know what is wrong with some people who just need to trash a place--i.e. \"The Free Bitch Review\" on Zagat.com--but I just invited a friend who is a major sushi lover and I don't expect to be embarrassed.", "author": "michele h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "Number one Sushi Chef in NY!!!! Number one friendly management around the neighbourhood!!!What makes this place great is the exteremely welcoming staff and awesome presantation of delicious dishes. Sushi bar has been gerat since my first visit so I havent even tried the kitchen yet. I have been there for dozen times and I would go every day if I could.", "author": "Funda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "Food has improved since I last visited- seems they change a new chef. Very happy with it now. Highly recommended.", "author": "Michael l."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}