{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "DO NOT EAT HERE. TERRIBLE SUSHI AND TERRIBLE CUSTOMER SERVICE. This was the worst sushi I've had in New York City. I dined in on a Sunday 1 week ago and ordered a very standard spicy tuna roll and spicy salmon roll. Instead of pieces of fish in the roll it looked like it had been pureed (ick) before being put in the sushi roll. It was super fishy and I only was able to eat three pieces before I couldn't bring myself to eat any more. Separate from that I got sick from the meal that evening. Upon calling the restaurant to complain that the sushi was basically inedible and I got sick to boot, I was passed around from employee to employee. I was told to call back at 3 different times to speak to the \"manager\" who was always mysteriously gone when I called and no one else could help to at THE VERY LEAST refund what I paid for the 2 rolls that were absolutely disgusting and made me sick. The woman I spoke to was incredibly rude and they kept telling me I needed a \"doctor's note\" for them to refund me if I had gotten sick. That is absurd. Do not go here. It's terrible. I literally have never had sushi this terrible, even from cafeteria places. No one who worked at this restaurant seemed to care that their food was disgusting and made a customer sick. AVOID LIKE THE PLAGUE.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Pretty impressed with this as a Groupon destination. The cocktails were tasty, the shrimp tempura app was very interesting with a variety of fried veggies and a delicious sauce. The Lady Gaga roll wasn't my absolute favorite but my mot friend raves about it so I will recommend it based off of his enthusiasm. Definitely try the Sweetheart roll, it was my favorite and had just the right amount of crunch ;)\n\nThe green tea mochi dessert was sweet and refreshing - and they have us a $10 gift card to come back (unfortunately we were only in town for a short trip). \n\nDefinitely recommend for lunch and dinner if you are looking for a relaxing date spot.", "author": "Kelly V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "One of the most underrated Japanese restaurants I've been to. I live nearby and absolutely love the vibe and the food here! The drinks are amazing and the sushi is great quality and there are so many options. Definitely check this place out and you'll be pleasantly surprised!", "author": "Taylor F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "I chose 3 stars because it is a nice restaurant... But the food portion is not enough. \nAs you can see, most of the reviewers here are not Asian... \nIf you want to get good Japanese food with a reasonable portion... Maybe this is not the place for you.\nI also used the groupon too... I paid $32 for $63 value... And I still think it was not that worth it...", "author": "sai h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "This place is all about presentation and customer service. We mixed up the details of a Groupon and they were incredibly nice about it. The food was beautiful. The space was nice and comfortable and everyone seemed to be having a really great time. I'll be back for sure.", "author": "Cori C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-19", "description": "Ozu is passable if you know what to order.  All of the sushi items I've tried have been quite good (chirashi, rolls, etc.) and if it weren't for the sushi being so good, this would be a 2-star establishment.\n\nMy experiences with their hot food have been subpar.  The chicken teriyaki I was delivered last week was rubbery and inedible - even my partner, who is a chicken-devouring machine, hated it.  Their gyoza and shumai are fine, but nothing special.\n\nWhere this place loses major points is in its delivery packaging.  They use non-air-tight containers so their sauces always spill everywhere - all over the bag, the table, and the other food. This is a huge pain and will probably keep me from ordering delivery from them again.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "Very good food excellent service! Its very clean and quite. Will be coming back!", "author": "Maria I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "I love Ozu! I've lived in the Heights for a couple of years now and have been regularly ordering from them via delivery apps. From time to time, we stop and actually eat at the restaurant too when the mood strikes us. Really is a nice looking place to stop into. Always been a fan of their bento boxes and the Dragon Eye Roll, that's my favorite. They are almost always quick with deliveries too.", "author": "Jase D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "If I could give this review 1 star, I would. \nWe came around 5 ish on 4/18/16 party of 3. We were told immediately that they couldn't turn on the air conditioner because, the manager wasn't there for the day and didn't give them permission. We proceeded to order appetizers which were great \u0026 entrees came. One of them didn't say they had green \u0026 red peppers, which my brother is allergic to. When we told the waitress and other person in charged they said they couldn't take it back. Because, we ordered it we had to pay for it. And the manager wasn't there so they couldn't even take it off the check. While she told us all this in a screaming manner. Now, who goes to a restaurant to get screamed at? While your paying for this service, unacceptable. While they ignored us they hide in the back kitchen screaming to each other. They never came back to our table, and I had to get up to get my check. I never expected to to get screamed at and treated in that way from going to a restaurant. The food is great but service sucks. Explains why they are empty all the time.", "author": "Wendy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "I was going to bore you with a long story about why I was in Brooklyn Heights and how I came across a dead body and yada yada yada. But you're probably just here to learn about Ozu.\n\nSo here is your succinct sushi summary: solid and satisfying, but not special.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Let me start by saying that I only eat cooked sushi.\n\nSo I've only had the cooked sushi options on the menu, a few appetizers, and a couple of desserts. And I mostly order delivery, though I have dined in a few times.\n\nFood's always good.\nService (especially delivery...VERY fast and convenient) is pretty good.\nRight across the street from the train station. A-ok with me!", "author": "Marie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Consistent good sushi. Recommend the double decker role, maki b combo and the sweet potato roll with avocado is delicious.  \n\nFast, free delivery or good ambiance if you want to go in. Usually have good specials and the staff is friendly.", "author": "Collin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "It's Sushitini time. I call Ozu \"Sushitini\" for their delicious sushi and their generous buy 1, get 1 free drink promotion that includes martinis. Their martinis range from the classic to the fanciful. The lychee and French martinis are great for those who want something slightly sweeter than a classic Martini. But my recommendation is to start dirty and finish coco.\n\nAaron, the owner, might be the happiest and most energetic restaurateur you'll ever meet. He's always happy to see a regular and can often be found chatting with patrons.\n\nMy favorite non-alcoholic items on the menu are the Mango Hawaii Roll, the Happy Bill Roll (I know, I'm vain), and the Magic Roll.", "author": "Billy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Great food, service, and atmosphere. I was nearby and stopped before they opened. They welcomed me and seated me. They were very friendly. The food was very good. Artisan sushi chefs prepared a excellent array of sushi and sashimi for my lunch special, on a Saturday! Great style and just the right level of lighting. The music was a good variety played at a comfortable level for a tranquil mood. I can definitely recommend them for great food and a mellow mood to reduce the stress of your day.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Really good sushi spot. I loved the decor, very clean spot and the food is fresh. I had the Japanese spring rolls, sweet potato roll and seafood roll. All very delicious and inexpensive. Would definitely come back here.", "author": "Jemima E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "NEW OWNERS ARE GREAT!\n\nThis is one of best sushi places in Brooklyn Heights. I live in Los Angeles and stumbled on this place during a business trip 8 months ago. I come to NY on business 4-5 times per year. Although I stay in Manhattan, I always make a couple of trips to Ozu to visit the owner Lee, his wife Maggie, and the entire staff.\n\nLee and Maggie bought Ozu from the previous owners about a year ago so whatever review you read prior to then may not apply.\n\nEveryone at Ozu is wonderful. Lee and Maggie have turned Ozu into a most enjoyable experience. The sushi is always fresh and reasonably priced. The service is friendly and unobtrusive.\n\nI always sit at the sushi bar and have great conversations with Lee and several local regulars who  have nothing but praise for this place.\n\nI highly recommend Ozu!", "author": "Joseph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "Full disclosure, have not been to the actual restaurant\nGreat place to order from. Sushi has always been great, tempura is not my fav, but delivery is always on time and the price is great for the quality.", "author": "Margaret A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "I decided to treat myself to a sushi outing for 1. There was way too much traffic and I was already downtown so I decided to try Ozu. The restaurant is beautiful and it wasn't  crowded. I sat by the window, coincidentally right behind another man that was eating alone.\n\nNonetheless, they have a 2 for 1 drink special that last all night, so that's a plus if you love sake, cocktails, and wine. I didn't have anything to drink because I was driving.\n\nAs for the food, I had a miso soup and I tried the Tokyo roll, both were good. The miso soup was tasty and filled with goodness. The sushi well,  I can't say that it was amazing, it  wasn't the best sushi that I've ever tried, but it was good.\n\nI'd recommend Ozu to anyone that wants to have a nice sushi dinner for one or more. I'll go back if I'm ever in the area.", "author": "Kia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Fish was super fresh and servers were attentive. The food is also pretty cheap. Two entrees, 3 appetizers and wine for about $55. Not bad, the pinot grig tastes like water though. Stick to the cocktails.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "Food: 5/5\nService: 5/5\nCleanliness: 5/5\nDecor \u0026 Style: 5/5\n\nHmmh, I rarely give all 5's. Everything was superb. It had a nice, chill, good ambiance, mood, and feel. The manager even let me charge my phone. \nIn conclusion, check out the restroom! It's so nice, I stayed in there for awhile =)", "author": "Nick N."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}