{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-30", "description": "Sunday lunch summons a platter of sashimi for one in Brooklyn Heights.  This sushi cafe is conveniently accessible nearby 2, 3 trains at Clark Street and A, C trains at High Street- Brooklyn Bridge.  Price is reasonable and there are many food options in addition to sushi, sashimi, katsu, udon and soba noodles Bento Box, and tempura.  Seating is abundant for a sushi cafe and restroom facilities are modern wall flushing button and clean.  The facility lighting is either broken or intentionally have very annoyingly irritating strobe lights.  Customer service is attentive and informative.  A sushi boat is offered as my neighbor table order was served.  Yelp mobile check-in offer is available, takeout menu, business card and Asian hard candy mints are also available.\n\nMy sashimi 18 pcs platter $20 is fresh, but I was hoping for a medley of both sushi hand rolls and sashimi however, this was unavailable on Sundays.  It appears by prejudice the weekday lunch menu offers more options than dinner or weekend lunch.  The pickled ginger appears stale and very dry to accompany the sashimi.  Nevertheless hunger pangs strike and I engulfed this entree within mere minutes.  The dark soy sauce provided was high in sodium content as the only option which should provide low sodium soy sauce as well for the health conscious.  This entree comes with a bowl of rice as a option, but I opt out.  Miso soup and ginger salad are offered as standard Japanese cuisine appetizers.  I love Asian ginger salad dressing.\n\nShirley Temple $2\nServed in a sports 16 oz. pint beer glass with handle and, my favorite, 3 pcs maraschino cherries.  Amid this drink is non-alcoholic, but it was enjoyable.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Stopped by spontaneously after exploring DUMBO and I love that Ozu is directly located across Clark St. Station! So convenient for quick travel and accessibility. \n\nOzu offers affordable sushi options among various other entrees. 3-roll maki combos ranged $13 for example. They have a full bar and offer pretty decent happy hour and general drink deals as well. \n\nThe restaurant is clean and relatively spacious. Service was quick and efficient.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "There are a couple japanese restaurant in this block but never tried ozu. I'm so glad I did. Had the sashimi and sushi platter for one. Sashimi was very fresh and portions are good for the money I paid. Also service was very good and extra star for super clean restaurant and bathroom!! Will be back!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "The food is delicious! I went there for the lunch special, I had the chicken teriyaki, California rolls, salad,soup and peas . I will definitely be coming here again.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Returned to my old hood last night for a board meeting at my building, and I stopped in Ozu afterward. This place is always a solid choice for me in the hood. The food is yummy, they feature a huge selection of food items, and the service is always on target. Sure, the atmosphere isn't cuddly and cozy like Iron Chef, which is a block away... but the interior is modern, sleek, and inviting. Oh, and of course, there's the 2-for-1 drinks EVERY NIGHT! \n\nSome of the stand outs for me include: Nabeyaki Udon soup (above average compared to other Japanese restaurants), Pork Gyoza, the Lady Gaga roll, the Spicy Girl roll... and all of their regular rolls (Philadelphia, Spicy Tuna). Note that the prices for all of these are pretty reasonable, too. That's definitely always a plus for me!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Cool little sushi place right down street from Brooklyn bridge park. What you would expect from\nA typical sushi place.", "author": "Matt R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-28", "description": "Used to be 4 stars great. Has really gone downhill. Red flag; serving sushi /raw fish that comes covered in sweet fruity sauce. Eww. Why?", "author": "Disco .."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "Pure garbage\nI never write reviews in my life but this one is no joke. This is raw fish, there is no room for cutting corners, I wouldn't even cook your food. It smelled like a fishermans ballsack, I threw my order out and lost my appetite. And no, I know what sushi tastes and smells like and no I'm not a whiny silverspooned yuppy. I tolerate these things but this just really pissed me off. Btw this is my second time eating here, same garbage. You're only open because of clueless people drenching your garbage in sauces, close this place down.", "author": "Zoma D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "Quality is justifiable given the cheap price and good quantity (we had 2 apps and 3 courses + dessert only costs 25pp)! Convenient location - sitting right across the street of Clark Street station (line 2,3); plus very friendly staff (they allowed us to park my friend's bike near the entranceway because we didn't have a bike lock); So, I think it worth a solid 3.5stars.\n\nWould recommend BBQ combo ($20 two meats plus veggies and main dish). The BBQ beef is tender and juicy. The portion of this dish is solid too.", "author": "Cristina X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "My father told me he wanted to have Japanese food next time he came to see me. So when he came to visit on Thursday we passed Iron Chef and saw how crowded it was and I knew my parents would not enjoy that. \nWe were greeted by a bubbly young lady who lead us to our table. Everyone was very nice, VB the menu, yes, it's extensive, but I feel it's organized very well. I really enjoy sashimi while the entree was more than is generally like to pay at $20 it was very delicious and was 18 peices with soup/salad and rice. My mom got the Spicy tuna roll with no complains and no raves. But my father LOVED his bento box which was huge. Salmon teriyaki with beef negimaki 6 California rolls and veggies. \nThe tea was generic but the attentiveness of the servers was great! Never saw the bottom of the mug and I never had to ask for more water. \nAll in all of say yes you can probably find better sushi, it's not just Japanese because it does serve things like Pad Thai. But it's a great addition to the area with great service. I will be back but probably for the lunch specials.", "author": "Elena F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "I usually love this place, and was super excited when i saw they have creme brûlée so you can bet your ass i ordered that as soon as i saw it. I watched as the waiter set the beautiful plate in front of me and i immediately went to dip my spoon in aaaand nothing. Nothing happened because it was FROZEN. I literally could not get my spoon to break the caramelized top. Idk if cold creme brûlée is ever a thing but it shouldn't be and it should certainly never be frozen. So basically i don't recommend getting dessert here but the sushi is good and cheap.", "author": "Abby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Straight forward sushi joint! Good bang for your back with the lunch specials. Service was warm and food always comes out promptly. Really don't need much more for a sushi dinner.", "author": "Monica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "We love Ozu!  Our work schedule is ridiculous and don't have a lot of time to cook so order from here almost every day.  Food is consistently excellent and delicious, and service is absolutely awesome.  TEN stars for Eva, who helps us with orders every week, and is just wonderful!!!  Thank you Eva and Ozu!!!", "author": "Nan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Such a fabulous place! I eat here all the time. It is amazing!! I come here with friends and family all the time. Always such a pleasing experience. The sushi is reasonable price and absolutely delectable. My waters always filled. Servers always in reach. I love Ozu! One of the best sushi places in Brooklyn Heights!", "author": "Skyler P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "Drinks are extremely bad! We tried the first round and asked for them to remake.  They remake the drinks. We still didn't like the drinks.  However the manager refused to even take off $5 for the check.  I don't recommend this place at all - it's a unreasonable place. They don't take customer comments and make proper adjustments.  Food looks pretty and well presented but quality and freshness is debatable.", "author": "Pearl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "I don't understand why anyone would give such low ratings to this place. The food is excellent. Service is truly sweet and genuine. They are so curtious and nice. I'm writing the review as I'm still eating. We almost didn't come in because of the low rating. We were so hungry and the place across the street was closed so we just took a chance. \nTry the Annie roll, lady gaga yum yum yum.", "author": "eva e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "We ordered from ozu last night for dinner. The food was really great and the delivery was extremely fast. We ordered a bunch of different rolls, Pad Thai and pork gyoza. I highly recommend Ozu - Kyoto used to be my go to sushi place but I am switching to Ozu from now on.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "Although appetizers are delicious, the sushi is subpar to other places in the area. It's quite pricey, and the sushi is just ok. Some of the rolls tasted very, very fishy. \n\nSomething odd about this place is they don't allow you to taste a wine before ordering and drinking it. I have never experienced a restaurant telling you you can't try a certain wine before ordering. Don't they have to open the bottle anyway once someone orders? Just very odd. \n\nIf anything, order the tuna tar tar and gyoza appetizers. Overall, ambiance is great but it was absolutely empty on a Saturday night.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Quick seating and great staff. Sushi was awesome! Lady Gaga roll is awesome!  Such a cool atmosphere", "author": "Jenn V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "We weren't able to sit into our originally planned location so decided to try Ozu instead, given the large space inside so that I could store my bike. Apparently this was not a wise decision as none of of the food we ordered impressed us whatsoever. The only thing we enjoyed the most was that huge plate of pineapple fried rice with shrimp; yet it was also lack of flavor that we would have to ask for extra hot sauce in order to bring up the taste. The crispy duck appetizer was a bit soggy; while the king crab roll was fishy. Not quite sure but definitely you have got better choices in this neighborhood for decent Japanese/Asian fusion type of food.\n\nApparently the emptiness inside the room justified the popularity, or lack of that. I would recommend visiting the Iron Chef House (our original plan) one block away to enjoy some authentic sushi pieces.", "author": "Elaine H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}