{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I've ordered delivery 3 times now at work. Always good, reasonable and always fast. Ordered for my entire team and it all came in 30 minutes and only cost $125 for 6 people. So reasonable!", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Very good food, got the yakisoba and it tasted great! The restaurant was very well kept, and was very decorative. Waiters were also very nice and checked on us frequently.", "author": "Daniel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "Pretty good sushi! Came in for lunch (specials are available until 3:30) and had the shrimp tempura and sweet potato rolls, with an additional inari tofu sashimi piece. Lunch specials include a salad with lots of carrot ginger dressing and a bowl of miso soup - both good but the miso could be a little more fresh. The tiny mushrooms are cute though. \n\nThe sweet potato is fried tempura style in their roll with some mayonnaise on top (which I could've done without), but overall a good flavor. The shrimp tempura rolls have avocado and cucumber, with some oyster sauce on top. It was tasty, but it's hard to taste the fish when there are too many other things inside. This roll includes 5 larger pieces, but the other includes 6 smaller ones. Overall a good meal, especially when paired with a lager like Sapporo or something akin to that. \n\nI love the waitress here, she was so sweet and a great conversationalist when it came to travel! \n\nProbably won't return but not a bad spot of you're in the area.", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Excellent sushi at reasonable prices. The Aaron roll is fantastic! The place is very chill, perfect for a quiet dinner solo or with friends.", "author": "Patricia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Had dinner there with my daughter and had such a great time. The food, service and location are amazing. It is right across the street from her dorm. I bet she eats there 3 day per week. Great place!!", "author": "Patti K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "I would give them zero if I could! I personally believe you should not go to any random place to have sushi but today we really wanted to eat sushi for lunch and we end up here! First of, the waitress seemed very confused and not focused on her job! So I repeated my order twice loudly! The restaurant was really empty but it took them 40 min to prepare our food! AND she was simply forgotten to place my order!!!! So it took more time for me ( my husband was already eating his lunch ) Now it's time to talk about the food itself! We ordered lunch specials and the sushi pieces were really small as it was cheaper! My rolls were not looking good and they would tear apart while I was picking them up! \nI won't go there anymore and I don't suggest it to anyone! They need some real changes!", "author": "Mona E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "As you exit the Clark Street subway station, Ozu is a nice, intimate restaurant facing your way. My friend and I initially planned to dine here, but we decided to wall around first and get a glimpse of the east river and the beautiful sunset above the high rise buildings in Manhattan.\n\nAs we make our way back to Ozu, we were greeted by the hostess. Now this is a Friday night, so I'd assume there would be more people dining in the restaurant, yet I was wrong. The restaurant was almost empty as well as the bar area. I would consider this restaurant to be more Pan Asian fusion than exactly Japanese.\n\nMy friend and I were seated by the hostess and given two menus. The waitress was very nice to us, although she spoke very little English. One of the best parts of this restaurant was the ambiance. It was dimly lit, the music playing had a variety of genres from pop, r\u0026b and hip hop. \n\nWhen we received our menus, my friend and I ordered our appetizers and drinks first. The appetizer that my friend ordered was the Sweet Potato sushi. Mine was the Chicken tempura roll. The appetizers were relatively cheap. My friend's own was $3 and mine was $5. Although I was not interested in trying my friend's appetizer, she did say that it was very, very good. My chicken tempura roll was very good as well and the sauce that accompanied was very good as it was lightly drizzled on the roll. Inside of the roll were avocado, rice, seaweed and bean sprouts. I definitely recommend it. Another part of my appetizer was the soup that came with my entrée. It was VERY delicious. Now while my friend didn't particularly care for it, it was one of the best parts of dinner. It had tofu, seaweed and pepper in it. \n\nAs we looked at the menu for drinks, the special for drinks are two for one, which I thought was awesome. My friend ordered two Pineapple Paradise cocktails and I ordered a Godiva Chocolate martini as well as the Mango Paradise cocktail. My friend's drink was very delicious and while there was not much alcohol, it was very tasty. This is also similar to my Mango Paradise cocktail as well. Very little alcohol. Now, the Godiva Chocolate martini is not for the faint hearted. It's very, very, very strong and I was unable to finish it. I would recommend it if you love strong drinks but I would not order it again personally. \n\nAs we get ready to order our entrées, my friend orders the Pineapple fried rice. Her dish is very good and I do recommend it. It is served with an umbrella, pineapple chunks, cashews and tiger shrimp. It was very delicious. I actually preferred to have ordered that dish instead of mine. While I did order the Chicken Teriyaki with brown rice, I would have preferred the Pineapple Fried rice. My dish came with a sweet teriyaki sauce, snow peas, carrots and broccoli. The chicken was tender and cooked well. It was very, very good. \n\nAs the night ends, my friend and I were very full. The appetizers and drinks made us full, but the entrées take the cake for that. As we both tipped 30%, the waitress did deserve it. She answered all of our questions and maintained a positive attitude throughout our time spent in the restaurant. Although this place is not very busy, I will say if you do stop by, you will enjoy it! It's perfect for a date night, business lunch or a night out with friends.", "author": "Omolara O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "Ozu is a Japanese restaurant and bar in Brooklyn Heights. However, I found it to be more Pan-Asian since there were a few non-Japanese dishes available on their menu.\n\nThe place has an impressive dining area. It was spacious with a high ceiling that made the place feel very open and a full bar that served various cocktails and original concoctions. Since it was 2-4-1 happy hour cocktails when we arrived, we started off with a thirst quenching lychee-tini, jumbo prawns shumai and shrimp with vegetable tempura as appetizers. Both dishes were good and fun to share.\n\nFor my main entrée, I decided to try the Lady Gaga roll, which was made with spicy tuna, salmon, yellowtail and avocado wrapped in soy bean nori and tuna, topped with special spicy and sweet sauce; and Ozu rolls, which is Spicy tuna, yellowtail and tempura crunch, avocado inside topped with tuna. Both rolls were delicious, but the Lady Gaga roll stood out for its variation in flavors and it melted  in my mouth beautifully. We then concluded our dinner with a nice touch of mochi ice cream.\n\nIn summary, I was not completely blown away but I can dine here again whenever I am in the area.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Great Japanese restaurant! I recommend ordering the Hibachi Lunch Specials. They are definitely the most bang for your buck. If you are there during dinner then the Hibachi Dinner Combo is also great!", "author": "Abigail B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "The menu is huge \u0026 the service is great. \nAll the classic sushi dishes w/ great portions.\nBut as everyone is raving, TWO FOR ONE cocktails are for real! Not watered down or short changed in any way. The saki is good \u0026 the Martinis are hard to beat! Best deal in the neighborhood. Never rushed or ignored. Even the rest room is large \u0026 comfie!", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "This is probably my favorite restaurant by far. The Sushi is absolutely fabulous and I honestly can't decide what is my favorite dish because everything they prepare is pure wonder.\nThis Asian fusion restaurant is great compared to others I've been to. The service is impeccable and their prices are affordable, especially compared to the wonderfully delicious menu they have.\nI would and will recommend this cozy and comfortable restaurant to friends and family anytime.\nI'm not easily impressed being a picky eater but there isn't anything they serve that hasn't had me licking my fingers and leaving in complete satisfaction.\nSo keep on serving those gorgeous and tasty dishes!!! Thank you for a wonderful time.", "author": "Eddie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-15", "description": "Ozu in of itself is not a bad sushi place. However, I've experienced better quality sushi just half a block away and in comparable prices. I got the sashimi lunch from Ozu and I can tell the fish pieces are not as fresh or cut well. The glass that the sashimi came with made the presentation look fancy, but the glass looked very dirty. I'm glad I tried Ozu, unfortunately, I wouldn't come running back for my sushi kick considering there are other options in the area.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "I got delivery from this spot. Usually delivery are hit or misses, whether the food isn't great or the portions are not worth what you are paying for. This spot definitely was a winner.\n\nI got the Chicken Teriyaki Lunch Box. This costed me about $13 including tips. The portions was definitely not an issue. You get the chicken, veggies, 8 pieces of sushi, two cantaloupe fruit pieces, white rice, a cup of miso soup, and salad. The taste of the meal was not an issue, especially for delivery.\n\nI will be keeping tabs on this place in the future.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "This was the best groupon deal I've ever experienced. Usually I find groupon disappointing, but with Ozu I was very happily surprised! $30 deal for two sakes or cocktails, 1 appetizer, 1 regular roll, 2 special rolls and Mochi ice cream for dessert.\n\nThe sushi and appetizer groupon options were good - for the appetizer we tried the kalbi which is pieces of Korean meat still attached to bones. Tasty. The sushi was really great - we had the New York roll, Lady Gaga roll and the spicy tuna crunch roll. All were awesome! Sitting at the sushi bar was great too because we were chatting with the chef and he ended up giving us an octopus salad on the house! Very nice of him. We left full and happy.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Ozu has become one of my favorite spots in Brooklyn Heights. I literally order from here almost once a week. I'd have to say they offer some of the best Bento box combos, 1) Salmon Teriyaki + Beef Negimaki 2) Beef Teriyaki + Chicken Katsu, etc. The Bento box is very generous in size and the meats are of excellent quality. It's always perfectly prepared and absolutely delicious. They know how to take a simple item to the next level, such as the Sweet Potato roll. Something about the sauce makes it stand out above every other restaurant. Everything on the menu has been great, from the specialty rolls to the Bento Boxes to the Udon noodles. Delivery is always quick and perfectly prepared. Dining in is a lovely experience, too! The environment is very trendy and the staff is friendly and attentive. Ozu is an absolute win in my book!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-17", "description": "Stopped by for lunch around 3pm on Saturday. It was pretty much empty with maybe another table. Service was normal. Didn't expect anything more. \n\nStarted out with some drinks. There was a lot of variety in the menu. It was pretty much impossible for me to choose something because I'm pretty indecisive. The waitress recommended the Long Island iced tea. Too basic. Settled on the green dragon after I said I wanted a strong drink. The base is vodka. It was pretty strong. But the green flavoring tasted too artificial for my liking. \n\nFor food I went with the peanut avocado roll and the ozu roll. The peanut roll was an adventurous choice. I liked it. The peanuts gave it crunch, while the avocado gave it a creamy balance. It didn't blow away my taste buds. But it was enjoyable. Don't think it was good enough for the price though. The ozu roll was pretty good. I really enjoy raw fish sushi so I really enjoyed it. However, from the picture in the menu and the price I was expecting at least 8 pieces. Only got 6. (#firstwolrdproblems). That was pretty disappointing because I was pretty hungry. \n\nMy friend ordered a shrimp pad Thai. The shrimp was good. The noodles had a weird detergent taste. My friend did not enjoy it either. \n\nThe bathroom was clean and the design was nice. \n\nI would not go back for the food.", "author": "Bennet G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "I'm glad I came here to try out their lunch offerings today! I have been at jury duty for two weeks, which sucked, but I tried to look on he bright side and use it as an opportunity to take myself out to lunch In a neighborhood I never really get around to. I liked Ozu a lot. I had a cold sake for 9 bucks, but there are two for one cocktails all day so I took advantage of that. ( I don't get paid for jury duty so I didn't feel so bad for a boozey lunch). I got the sushi and sashimi platter. The soup was lovely ~ I love it when they put enoki mushrooms in the miso soup. Salad dressing was good. The lunch platter was presented nicely and was fresh and delicious. \n\nI'm jealous that Brooklyn heights has such great food! Maybe I'll get a felony offense so I have a reason to come back to the Supreme Court area...", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "Upon walking in Ozu is gorgeously decorated, but sadly the chic decor can't save this sushi boat from sinking! \n\nI was expecting okay sushi that would satisfy my craving but instead I left with a bad taste in my mouth literally.... The menu here is massive! Which for sushi restaurants is a bit unheard of... And by massive I mean pages full of special rolls most places only have a few to pick from.... \n\nSo we proceed to order and we had a groupon deal which allowed two cocktails, appetizer, one regular roll, two special rolls and a shared desert. Our server was very sweet... I ordered the cocotini and it was very tasty.\n\nThen came the calamari... Someone on yelp said DONT order it I should have listened it was the worst I've ever had! So oily and chewy not good at all... Now the sushi... It came out and looked nice enough we had a Crunchy spicy tuna, lady gaga roll and the Mexican roll... The lady gaga roll was almost inedible... Just wayyy too much going on and not fresh tasting at all. For desert we were given Mochi ice cream it was not I repeat not edible and they definitely used Hershey's syrup all over the plate... \n\nThe worst part of the meal was the flies! Yes flies! kept flying around and landing randomly on our table I got tired of waving them away and one finally landed on my cocktail... Needless to say I was ready to go. I really wanted to like this place but it just wasn't good... Oh and as for the flies I could understand if a few got in during the warm summer months but it's the DEAD of winter!!!??? Where the hell are they coming from?!!!!! Something here is FISHY! Beware!!! I won't be back!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Great food and excellent service. The place is clean and decoration is sober\nSushi pieces are big and with good fishes\nRice with shrimp excellent too", "author": "Ana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "I came here last week for the first time and I loved it y'all!!! Seriously, such a pleasant dining experience. In fact, I'm going back tomorrow.\nI came here with a friend for lunch and we LOVED the food, the atmosphere, the service and the prices.\n\nFood: We got the lunch sushi special (miso soup, salad (which was so good), and 2 rolls for $8). I'm a huge sushi fan and this is definitely in my top 2 or 3 of sushi places. It had great flavor (bland sushi makes me sad) and they weren't stingy with the fillings. I asked for spicy mayo on the side and they didn't cheap out on that either. Also, I don't know what it is about their salad dressing, but they gave a healthy dollop on top of the salad (!! yes), and I loved every bite.\n\nNow for the sangria... OMG. So sweet and refreshing. I kept remarking to my friend about how great it was. It was really great!!! Buy one get one free drinks is incredible, people. Oh but frozen drinks don't count in the B1G1.\n\nMy friend got chicken fried rice IT WAS BOMB GUYS IT WAS AMAZING. Okay, now I'm just raving uncontrollably. \n\nService: Not overbearing (which I can't stand) but very kind and considerate (win.)\n\n The sum up: They aren't stingy with their servings/portions, which is a HUGE win. I hate when places are and even with incredibly fair prices and deals, it is a huge credit to this place that they don't cheap out. When my friend got her enormous rice plate the first thing I said was, \"they really hooked you up!\" Fantastic. You get your money's worth in both size and taste and this is all why I will frequent here.", "author": "Yari C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}