{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-15", "description": "Ozu has formidable sushi. I got the sushi lunch special and I tried the spicy tuna roll, avocado roll, and another kind of roll with cooked salmon, sautéed onions, and eel sauce. The price was very fair ($11 for soup, salad, and sushi), and the fish was extremely fresh. The rolls were very generous and I thought the fish to rice ration was perfect--more fish than rice! \n\nThe MAJOR con for this place was the service...my sister got a hot lunch special and her meal arrived 10 minutes before mine. We were one of only two tables in the restaurant at the time, and the waitresses and sushi chefs were just standing around shooting the breeze while I sat there waiting for my food. The hostess was nice, but the waitresses who served us were pretty unfriendly (maybe because of a language barrier) and inattentive. \n\nVerdict: sushi=good, service=bad", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "I'm a big sushi fan and I must say I love the sushi they serve at Ozu. Their special rolls are delicious and unique with a touch of modern creativity. I came with a friend from out of town. \n\nFor appetizers, we ordered seaweed salad, tuna avocado tartar, and tuna tataki. The seaweed salad was nothing special, but is the same as any place but I think love it so I order it ever time I'm out. The tuna avocado tartar was really fresh and tasty. When the tuna tataki came, I was completely blown away with presentation but I did let the presentation judged the taste of the dish. The tuna tataki was so soft and tender,  it was like heaven in my mouth. \n\nFor rolls, we ordered a Banzai roll, Season roll, and a Purple roll. The Banzai roll was a little spicy with the perfect amount of kick. I generally don't like spicy food but the amount of spice was perfect. I also told them to go light on sauce so it was adjusted to my taste. I loved the crabmeat, eggplants and the crunch in the purple roll. It was delicious. I also enjoyed the season roll very much. I personally don't like scallions at all so I wish I told the waiters no scallions on the season roll. My friend on the other hand, didn't mind the scallions at all and she really loved it. It was actually her favorite. I wish we had room for dessert but we were so full. \n\nOh did I mentioned, their drinks were so yummy? I had a godiva martini and a mango drink. I forgot what my friend had but she told me it was very good. The decor was beautiful and service was decent. No complains. I will definitely be back soon for more mouth watering sushi and drinks!", "author": "Xiao O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Grabbed a quick dinner on my way to Brooklyn bridge park for the fireworks. It's spacious and very clean. Service was prompt and efficient. Had the sushi and sashimi platter for 1 and the chef really put some effort towards the presentation. Tasted great with nothing to complain about.", "author": "Remy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "This place opened a few days ago in the space previously occupied by Sea Asian. Thing is, the space is totally different, they spent some serious cash making it look like a fancy Manhattan raw fish joint.\n\nI ordered the toro tartare, a yellowtail roll and a crispy duck roll and one piece of Chu-toro sushi. \n\nAll were made with care and tasted really good. Especially the toro, it was very fresh !\n\nThey are still waiting for their liquor license, but I hope this place thrives!", "author": "George S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "The mushroom soup was delicious. The crispy sesame calamari was terrible. The sushi was ok. The cocktails were downright bad. The red bean mochi ice cream was excellent. So all in all, kind of a mixed bag. I'd go back for the ice cream if I happened to be in the neighborhood.", "author": "Ellie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "I ordered a noodle dish. The portion was large. I was unimpressed. I found the dish to be boring.", "author": "Spencer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "I eat here sometimes 3 times a week. It's that good. Consistently. The fish is fresh, the portions are generous and the staff is very attentive and sweet.  I love the Tri-Color Sashimi appetizer, the Dreamer Roll, the Red Snapper Carpaccio and they always have delicious specials!  Go, sit at the sushi bar, sit at a table, get take-out or delivery - it's all great!  So happy they are on my block and I'll be back tonight.", "author": "Nora R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "I'm not sure why I get takeout from here when they've told me they do 2 - 4 - 1 and its a beautiful space.  I'm also not sure why I've broken my \"Never Get Sushi For Takeout Rule\".\n\nLast night was my second takeout meal.  Unfortunately they did my biggest pet peeve of putting a sauce on the item that is not listed in the menu description.  I don't like condiments so I definitely want to know if you are going to use one.\n\nThe Clark roll described as spicy tuna, yellowtail, crunch, avocado and topped with tuna had some white sauce on it that reminded me of horseradish cream!?  I'm not sure but I especially don't like white condiments.  I ate it but regretted it.\n\nOverall the sushi is decent and is what I expected for the price.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "New Wine and Food Pairing Menu. With Seasonal wines and dishes My wine expert  girlfriend from Williamsburg was amazed that an esoteric Small production French Muscadet is now on the menu. I was amazed that it was Only 7 bux for it. I had the French Michael Chapoutier Rose. We were surprised at this transformation and both concluded that it may be  most competitive  wine prices to quality in Brooklyn Heights. The service is attentive, the dishes are artfully crafted and this new wine program is going to mesh all three aspects of Ozu into a Brooklyn Sushi staple.  Hope there are more wonderful suprises to come.", "author": "Adam Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-20", "description": "It's an ok place for sushi. These ppl who run Ozu are not Japanese though. They are Chinese ppl. It matters bc Japanese make sushi well. Not a bad spot for locals to dine but don't expect too much authenticity.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "Three of us came here for dinner.  \n\nThe portion is G R E A T.  \nFish is F R E S H.  I loved the Sashimi special.  $22 for a LOT of fish.\nDecro is modern and clean.\n\nMust get:  Spicy Girl Roll (I know, sounds tacky)\n\nThe service was just an ok.  We had two waitresses, and one of them was not a happy camper...\n\nOverall, I would definitely come again.  I think this place is great for groups as well, as there is ample space between tables...(no elbow bumping with your next table neighbors  :)", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-20", "description": "I've done takeout here a few times but I went there for the first time last night and used my Groupon. \n\nAppetizer: Grilled Miso Eggplant-good\nRegular roll: spicy crunchy tuna-good, salmon avocado-a little fatty\nspecial roll: Mango Hawaii-good, Out of Control Roll-good\n\nThe restaurant itself is really nice and modern. I would definitely go to the restaurant vs. takeout. It's good if you're in the area and craving Sushi.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "This place is awesome it has delicious sushi and their drinks are just as great! Love this place", "author": "Grisel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "This place is just  so so sushi. It's got much better competition in the neighborhood. It has decent fish, but the rolls are tarted up a bit too much. Too much mayo, that sort of thing. It's less fancy rolls reveal fish that isn't worth writing home about...it's ok. Iron chef, ani, Hibino: all better", "author": "Owen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "Went to restaurant on groupon which states 1 app, 2 special rolls and 1 reg roll link to menu shows entire menu, when we arrive after being at I inform them I got a Groupon and they bring over a different menu with very limited selection.  I ask the manager why wasn't it mentioned in the Groupon and she gave me a lame excuse that she asked them to change it and I could get a refund.  Great so I am hungry, so asked if I could apply the amount I paid toward my bill which it states on groupon she refused and was completely rude. So annoyed by experience would not return.   Customer service is just as important as food and it was horrible.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Quickly seated, very clean and comfortable environment. Katsu bento was delicious with fresh oranges. Spicy tuna sushi was not spicy at all, but it was good. Vegetable yakisoba tasted great, although the vegetables were cold. Overall, the food was delicious and I recommend it to anyone looking for tasty Asian cuisine.", "author": "Eriko I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Stumbled upon this place after walking across the Brooklyn Bridge, and what a treat! I bought the yelp deal for $5 off, and the the prices here are already low! The service was awesome, \u0026 the manager, Aaron, was so kind and attentive. The best part of the meal was when they brought out my husband's sushi platter - the presentation was jaw-dropping! It was beautiful! It had tons of fresh sushi, garnished with a flower, greens, a martini glass, a shell, and it was laid out on ice. I highly recommend getting the platter if you like sushi!", "author": "Nyla I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "My friend and I were walking around the city and after looking over the Promenade, decided we should finally eat. \n\nWe had passed a sushi place after getting off the subway, but that place was closed and Ozu was conveniently right across. Their menu was posted outside, so we were able to decide whether we wanted to eat there or not before even walking in, as opposed to coming in and looking like weirdos, unsure of if we'd be happy with the rolls they served or not. After a minute of looking around, we were greeted and seated at a nearby table, right by a window, overlooking the street. No complaints. \n\nThe food seemed priced like many sushi places that I've been to. Their lunch menu was a deal: any two rolls for $8 OR any three rolls for $8 (of course from a selection), along with soup and a salad? Why not?! The meal was good in general, but I think next time, I'll take the route of ordering actual specialized sushi rolls as opposed to the ones offered on the lunch menu. (They even have a roll named after Lady Gaga and Jeremy Lin, which made me chuckle a little).\n\nService was good, but I can't say THE greatest. Our waitress was attentive and even offered my friend a fork after seeing him struggle with his chopsticks (haha). \n\nWell kept, clean restaurant. Nice ambience and easy place to find (right at a corner, from what I remember).\n\nI'd definitely come and eat here again. Mmmm, sushi!", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "Price is awesome for the area!\nMust try the Lobster Pizza!!!!! The fish was very fresh and so was the other seafood.", "author": "Cecillia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "I was here Saturday 4/26. Food was fantastic and atmostphere was cozy \u0026 fancy. The waitress was very friendly.  I would definitely come back however after work drinks 2-1 for deal and cheap. Highly recommend this place. Furthermore, with caution do not attempt to come in a car. Parking is horrible....  It tooks us about 40 minutes...", "author": "Irene R."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}