{"aggregateRating": {"reviewCount": 242, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Take out or dining in? Dating or with your family? Soba or rice? Nigiri or rolls? I tried almost a half of the menu and I expect to come back to try another half.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "This place is nice and the price is reasonable.. I just live around here.. I did not give a 5 because the sushi is not really authentic.. But it taste good too.. :)", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "I came upon Ozu  two or three years ago after friends and I encountered disappointments with Iron Chef up the street,.Since then, Ozu has become my normal neighborhood go-to-sushi place. My requirements are fairly simple: raw fish has to be fresh, presented neatly, and within a reasonable time. Ozu has more than met the standard. Their miso, true, is uninspired, but the fish served on the chirashi plate, at lunch or at dinner, is sparkling fresh and delicious, the sake appropriately warm, and when I brought y daughter and granddaughter a few weeks ago, the staff was kind, warm and tolerant of the four-and-a-half-year old running down the aisles.We all love Ozu, and it has become a permanent part of life in Brooklyn Heights!", "author": "Peter H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "2 for 1 drinks all night: great deal, 4.50 for all the martinis etc. Good quality and selection of drinks.I did have to order the second drink 5 times or so before i finally got it 30 minutes later. The restaurant wasn't that busy either...Try godiva martini, it was a big hit\n\nQuality of sushi: average. \n\nWe were here with a party of 20 for a bday party, and the service was the worst i have ever seen in my life. It took some of the people 2 hours to get their food. Obviously they  cant handle the crowds. So if you are coming with a group of more than 10 or so, avoid at all costs. They did seem very apologetic and gave us a discount at the end, but for a final bill over $1000 dollars the service was nonexistent.", "author": "Fred B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Good service and delicious rolls (try the Hot and Fancy rolls).  Place was filled on a Saturday evening, which is also a good sign.  Excellent location to boot (across the street from the train station!).", "author": "Tanisha N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "Been here a couple of times and I love it!\n\nNice decor. AMAZING appetizers. And very friendly bunch of staff!\n\nI recommend the cold appetizers and special sushi rolls. They have a pretty good selection. I try to order something different each time, by the recommendation of the waiters. I just tell them that I'm a huge fan of salmon. And so far so good. I'm pretty satisfied there :)\n\nI like that they also don't try to rush you out like some places do. I've came here with friends each time, one time in which we sat for probably 2+ hours just chit chatting. We were the last ones there, but I was impressed that the waiters remained friendly and did not seem to mind at all. Instead, being their last customer, they offered us dessert on the house!", "author": "L J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Did the Groupon thing with Ozu and it was fine. The owner was nice, treated me like I was a full paying customer, and the food was excellent. The Miso soup was perfect, nice and warm and smooth. The app was eggplant, very tasty and well presented. First roll was California roll (my friends choice) and as this is a safe roll for the folks who are scared of fish, it was tasty for a beginner sushi palete.I had the NY roll and it was perfect, well presented and fresh Sushi rice was just the right sticky amount. Next roll was Lady GaGa and very well presented..as if Lady GaGa made the roll herself..put on a wooden stage,and bigger than life. Tasted great also. I cant remember my friends choice, but it was good also..I would for sure come here again as a full paying customer, and Groupon did the right thing by introducing me to Ozu.", "author": "Mystery C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "I've generally gotten sushi here, which is always good (not amazing, but not bad). The best think I've every ordered is their tuna and avocado appetizer which is half an avocado with fresh delicious tuna piled on top and a nice sauce drizzled over it. Also, their 2 for 1 drink special is great.\n\nI would advise everyone to stay away from their non-sushi dishes. The chicken and beef are always very very dry and unseasoned, and their teriyaki sauce tastes watered down.. ew. Their bento-boxes come with an obscene amount of food, but I honestly did not want to eat most of it.\n\nI especially wouldn't eat here with Iron Chef House right down the street, unless I'm specifically coming for the drinks.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "Ozu is no longer BYOB but it offers a \"2for1\" deal on all alcholic drinks which eases the booze bill a bit.  Their cabernet sauvignon is Yellow Tail and it is a fine choice.  Turning to the food, try the spicy onion roll.  Not sure why it is called \"spicy\" but it tastes like an onion ring rolled in rice.   This roll and the sweet potato roll are each served warm whichis tantalizing against the cold rice.  New to Ozu is the Hibachi lunch and dinner.  Have not tried it yet, but expect to.  Overall, Ozu is a pleasant place to dine.  Smoky grey walls, pin point halogen lights and tables with plenty of space between them.  Staff is ultra attentive and the presentation is just so pretty.  Worth a visit.  Across the street from the Clark Street 2 and 3 train stop.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "I've only ever had takeout from this place while visiting a friend's apartment, but I have no complaints.  What I love about rolls is that I can eat a lot without getting full too quickly, which means a lot of variety.  Of course, I've only had from the classic rolls menu, but it was all very good.", "author": "Penelope M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "The sushi dinners were so awesome and the service wasn't too bad either. The price was just right and not too expensive. Loved it! It is now my new favorite place!!", "author": "Becky L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-27", "description": "Just ordered a meal off of Seamless from them and nearly 2 hours later they're still a no-show and their phone line seems to be hooked up to their fax line so there's no way of getting in touch. Shame, I was hoping to check out their sushi.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Took a friend here for her B-day.  We both had a pleasant experience.  Great sushi and special rolls, awesome presentation.  Save room for some green tea ice cream and sake afterwards!", "author": "Trecia Bianca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "The sushi here is reason enough to visit, but the service is exceptional. Michelle is a gem, as are her colleagues. My husband and I order from Ozu at least once a week, and every time they make us feel welcome and special. As long as we're in New York, this will be our go-to place.\n\nIt's worth noting that this is the first Yelp review I've ever been compelled to write.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-21", "description": "I've lived in Brooklyn Heights for many years and have always gone to Iron Chef House to get my japanese fix. They aren't bad, but Ozu is far superior. I've never had sub par fish or service, even their cooked food is good. The ambiance is a bit modern for me, but the wait staff and the quality of sushi is so on point I don't mind having to listen to Lady Gaga while eating my sashimi. (Which says a lot.)", "author": "katy m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "AMAZING, CHEAP sushi. Loved the simple but trendy decor. The sushi was made fresh right in front of our eyes, and it was BYOB. Will definitely be visiting this place again.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "This place is a nice walk from my work and also close to home. Went here for the first time because of the Groupon, which was pretty good. They stamped our receipt for a free round a saki, so we went back again. I like how you aren't sitting on top of the table next to you and the sushi rolls are different and always good.", "author": "Marlo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "I would say their appertizers are good.\nSushi and Sashimi are fair.\nBut, they hot and cold appertizer are special and u wont find them out there.\nTheir Sweet Shirmp Salad are Yummy.", "author": "Steph T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-30", "description": "Don't get me started on how disgusting the sushi was here. I gave it a shot since I like to support new neighborhood restaurants but will not go back. My sushi tasted rotten and was slimy. I waited 15 minutes for a glass of water and way to long to be served considering the place was nearly empty. Skip it or maybe try it but bring some pepto and immodium for dessert.", "author": "J C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "great prices, friendly service, and decent sushi!\n\nthe lunch specials are awesome because they are so cheap and it does come with quite a lot of food. sure the sushi selection that came with my sushi special wasn't the best, but it was 10 bucks! everyone ordered a variety of dishes, and they all seemed to enjoy their meal.\n\nthe atmosphere is also very trendy, clean, and modern, which is a nice change for a cheap sushi restaurant.", "author": "Flo T."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Ozu", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/-Iray0Wqh30aJC9IWBaWGA/ls.jpg", "@type": "Restaurant", "telephone": "+17187973288"}