{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Comfortable environment, easy to talk to people, great service, and diverse beer selection. Even though I would love for more selections and a cheaper food selection, this is a place I will go to many times.", "author": "Casey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Awesome neighborhood bar, great service, beer selection and food, dropped in before a show at Barclay Center, great choice, will be going back!", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "I came here with some friends after visiting another bar. We went to a german beer hall to celebrate Oktoberfest, and this place is my friends' local bar. They knew several people/bartenders that were there. You know you've had a good time when you end the night with car bombs.", "author": "Jacob M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "A neighborhood gem- Really low key and cool bar. Great place to watch sports too (i watched a world cup game there over the weekend) and they had a screen projector and showed the game with audio which is awesome. \n\nBut what's really unexpected there, and a great surprise is the food. The food is way above standard bar fare. The fried pickles are bar none to anywhere else in the city, and the burgers are made from local meat from a butcher in the neighborhood. (love that). \n\nIf you see one of the owners, Dan, make sure to say hi. One of the nicest guys around.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Nice little space close to Atlantic ave subway station.  A convenient meeting spot to visit your friends who live out in brooklyn (but what kind of friends live in BK anyways AMIRITE?).  What I like about the Hollow Nickel is their nice draught selection, their ability to make me a decent Old Fashoo, and the friendliness of their staff.  It also doesn't get uber crazy on weekends like some of the more popular brooklyn or manhattan establishments-- in other words, low-key.", "author": "Devin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "I held a boozy birthday brunch for a friend of mine in the back garden area of Hollow Nickel, and it was awesome.  First of all, Nichols is amazing. He made everything easy-- from the planning beforehand and the service during, right down to the processing of the payment at the end.  It all could have been overly complicated and a pain but Nichols made sure it was not.  He and his staff were friendly, efficient, honest and accommodating.  The food and drinks were good too! I had the BLT, which I thoroughly enjoyed-- thick crispy cuts of bacon, fresh slices of juicy tomato and crisp lettuce all on top of two perfectly toasted slices of sour dough bread. The bread had some sort of mayo on it that made it different (in a good way) than any other BLT I've had (can't remember what the flavor of the mayo was, sorry, maybe avocado?).  By all accounts everyone else enjoyed their food too. Oh and the pickle backs! First time I've had them but I enjoyed those as well.\n\nAll in all, a great experience hosting a birthday brunch at Hollow Nickel. Good times. Highly recommend.", "author": "Brooklyn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Best time!! Pickle backs were amazing. Happy hour was great. Vibe was awesome. Totally recommend it!! Get the French fries!!!! Xoxoxo", "author": "Ricki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Oh heyyy. New pre-show @ Barclay's spot. Lovely spot with nice bartender, good food and seating accommodates groups! We went on a Tuesday night so not sure what the weekends are like, but we all had a great time and will def be back!", "author": "Jeanette L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "I'm from New Orleans, stumbled upon this bar. Had a great vibe and the specials were amazing.  The specialty drinks were fantastic as well!!", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "Great friendly bar.  Fun bartenders with drinks at good prices.  The back yard is find.", "author": "Neil C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "The Hollow Nickle is a  quaint, unique neighborhood bar/restaurant. I have been here many times and have never been disappointed.  I love the intimate seating both in the bar and the patio. They serve both lunch and dinner, on Sunday's they have brunch. I don't have a favorite on their menu because whatever I have ordered has been delicious.  If you love wine, you will be impressed with the selection to choose from and it is always served in the proper glass, which to me is very important.  They also know their Scotches and Bourbons.  My husband loves their beer selection.  They have something for everyone!!", "author": "Deborah A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "I think I could have loved this place, if our food hadn't taken 50 minutes to come out (for 2 sandwiches - and no, the restaurant was not slammed)), and if our order hadn't been completely wrong, and if I hadn't had to take the food, myself, up to the bar, twice, because our server never checked back. I think I could have loved this place if I had actually gotten the vegetarian sandwich I ordered, instead of a turkey sandwich which I took two bites of before I realized it was meat (we were seated in the garden, and it was so dark we couldn't see what we were eating). I think I could have loved this place if, when the guy who delivered our food (not our server; she seemed to have some friends seated around us who were occupying alot of her time) had known what he was carrying and, when I pointed clearly to my companion and said \"he gets the chicken,\" had actually put the chicken sandwich in front of him instead of me. Two bites and all I taste is barbecue sauce, and I did not order a sandwich with barbecue sauce. Not a good sign that I couldn't even tell it was chicken. As our server makes an appearance about every 30 minutes (which is how long my companion has been waiting to order another beer), I grab my plate and make my first trip to the bar, where I am told that the sandwich is chicken and my companion must have mine. He does not. He has someone else's turkey sandwich, confirmed on my second trip to the bar. I am the customer. I should not be carrying food around this restaurant, but I am also middle -aged, and couldn't afford to spend the time I have left waiting for my server's rare appearances at our table. I think I could have loved this place- a relaxed vibe, comfortable outdoor seating, a typical bar menu, but some of the sandwiches sounded yummy, especially the goat cheese, spinach and tomato sandwich I ordered but never actually got (I had a premonition there was going to be trouble when she took our order without a pad. Write it down, sweetie!) I think I could have loved this place, but I can't imagine ever going there again without experiencing PTSD flashbacks - that's how bad it was.", "author": "Mamie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "This has become one of my favorite bars of all time! I have been there plenty of times for afterwork get togethers, friends birthday parties and even just by myself to hang out.  The owners are super friendly and accommodating, the bartenders are really sweet and are super willing to adjust recipes for drinks(which i always need) and they have an amazing backyard! \nI've been here with one of my friends that owns another bar in the neighborhood and even he agrees, this is his favorite new place to hang out after work!\nIt has a great,casual atmosphere and I always end up staying for hours!", "author": "Anit H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "REALLY good food.  worth a visit even if you don't drink.\n\nWevisited in Saturday afternoon, and were the only people there.  I got a chorizo quesadilla and my sister got the fish and chips.   both were great.  \n\nMy rioja wine was perfect with it, too.   Everything I like about a rioja (oaky and red) and nothing I don't (it was smooth).", "author": "Toni S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-16", "description": "It pains me to write this. I live directly across the street from Hollow Nickel, I was so happy to see it open in the neighborhood and am in there at least once a week and have spent many a nights with friends in there. But I  had such an unpleasant experience there this evening that I had to write something.  I ordered my drink and the wait for the burger was getting a bit long, so I (very politely) asked the bartender (tall man with a beard and long hair, he is there on Wednesdays) if he had any sense of when the burger would be ready. He looks at me like I am a nuisance and says disdainfully \"I have no idea, i don't know whats going on in there\". i think perhaps he is joking and he's like... agressively, \"I don't know\".  i know it doesn't sound like much but his manner, his tone, body language was terrible and rude. Do not engage with this man, he is terrible. It was such a surprise. I always thought of H \u0026 K as my neighborhood spot, and have dragged so many of my friends in there but alas, no more.  i think the guys is one of the owners, dude, we get it ...you own a bar.", "author": "Busayo O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Great little place. Cool vibe and a surprisingly good cocktail \u0026 whisky collection. Make friends with Fontaine at the bar - she made some experimental cocktails for us that were unusual, but tasted pretty great. Worth a visit.", "author": "Indu C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "Cute atmosphere but terrible service.  Went for a bday celebration on Friday and the bartender was unbelievably slow, out of it, and overwhelmed with few and simple drink orders.  It wasn't even very crowded.  Made us look for somewhere else where we could get service.", "author": "E J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Stopped in after doing errands for lunch.  Fabulous burger and a beer for only $10! (The cook butters and grills the bun so it's crispy--just great!)  Evidently they just started opening at NOON.  Lovely woman, 'Fontaine', at the bar.  Good service and good conversation.  I highly recommend.", "author": "Margie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "I had my birthday party there a few weeks ago and it was fabulous.  We had so much fun sitting outside at the patio.  The food was great and drinks were fabulous.  Everyone was very friendly.  I love that patio and will be going back soon to hang out again.", "author": "Franca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Hollow Nickle Hooray!!  This bar is so pretty!  \nThey get 5 stars! Owners, decor, backyard, menu \u0026 cocktails -  all top notch! \nI came here on a date and for a birthday party, both nights were fantastic.  The owners were in house both times.  They are so chill \u0026 down to earth. The dj was super cool, he played some songs for the birthday girl!.  But lets be real- the backyard is beautiful! Roomy with a great seating for a crowd, but has cozy seats when you want to look at your date dreamy. Complete with strings of lights in the trees, and yes I said trees.  The decor inside is so sleek, with leather button tufted couches, exposed brick, chunky wooden benches, and yep a fire place.  The prices are fair and everything on the menu was really tasty, but not in a typical fried bar food way.  And believe me we should know, we ordered almost one of everything.  Thanks Hollow Nickel, we will be spending our summer with you.", "author": "Chris P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}