{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Amber, who runs the show, is really awesome, she let me even use the remote! Really rad outdoor space too and the crowd was all very cool.", "author": "Cat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "After attending a Yelp Elite event, two of my girlfriends and I were wandering along Atlantic Avenue searching for a bar and that bar was Hollow Nickel.  It was late Thursday night and it was perfectly quiet! The entrance was narrow with white twinkle lights and candles placed throughout the bar.  The dim lighting allowed for a romantic ambiance which I loved!  \n\nWe were greeted almost immediately upon finding a nice table in the back.  I continued to marvel at how cozy this place was with their book shelves filled with books (shocking I know, but in a bar??) and a fireplace lit up with candles of different heights.  The wall above it seemed to be chalkboard but the walls in the bathroom were definitely chalkboard! Fun!\n\nMy girlfriends and I just wanted a nightcap and ordered a couple drinks.  I ordered a Shirley Temple, because I'm responsible and had important work to do the next morning, while my girlfriends had beer, because they didn't have urgent work due in the morning. We all decided to share seasoned fries with melted cheese and I'm pretty sure we were disappointed with how it turned out.  I thought it hit the spot but my friend brought up a good point that the cheese should have been flavored and that in lieu of gravy, we should not have been charged for chipotle mayo sauce...Oh and the seasoning on the fries was just dill. Plain ol' dill.\n\nOur server was very attentive if not overly attentive.  He was very patient with us and tried his best to accommodate our requests.  Pretty solid service and experience overall despite the gravy/chipotle mayo and tasteless fries incident.  The location is great since it's very close to the Atlantic Ave station by the way.  Despite that, willing to try other food they may offer and will definitely visit this place again.", "author": "Anna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I came here more than a week ago to celebrate my best friend's birthday and this place gave me the most unexpected experience ever. Coming here, I thought it was going to be like a typical restaurant, with a waiter/waitress taking you to your seat and coming to your table every 20 minutes refilling water and asking if your food was good. Instead, this place ended up being the most relaxing and freeing place to dine and drink.\n\nWhen we went into the restaurant, the bartender simply told us to sit anywhere and handed us the menu. We had to go up to the bar, just to order our food and drinks, which was I found surprising.\n\nWe ordered nachos, burgers and french toast which all fell in the range of $11-20. The portion of the burger was pretty big with a side of fries. The nachos were one of the best nachos I have ever had, as it came with a container of guacamole, and salsa, which all had a hint of spice to it which gave it a kick of flavor. I particularly loved the french toast I ordered, as it was topped with berries and a side of maple syrup. The french toast was very rich in flavor and had the perfect texture, not too mushy in the middle and not burnt on the outside.\n\nIf you are someone who is particularly into fruity drinks, I'd recommend getting the white peach sangria; it has a small kick of alcohol that kind of hit me a bit, but with an overall fruity taste. \n\nFood: delicious, portion is worth the money\nAtmosphere: very relaxed, color scheme of black and red (which I love)\nService: majority of the time self-service, I had to repeat a few times my order of french toast since he did not hear me.\n\nIf you are in the area of Barclay Center after watching a game or concert, I would recommend this place as it is spacious and not as crowded as other places in Brooklyn. One more perk, is that there is a beautiful outdoor setting to hang out or go for on a casual date.", "author": "Ladiny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "A good local bar with a solid burger and beer combo.  Vibrant crowd, friendly bartender, and clean overall location.  What else do you need?", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "i came in here for the first time the other night and had a great time. Our bartender was Grace (#loveher) who was attentive, welcoming and friendly but not over bearing - she also made solid food recommendations. she's also adorable and had great music on. we had the basics: whiskey, beer, wings and burgers- all super stellar. we were there on a Tuesday and the crowd was solid. like not dead to the point where you feel like an alcoholic and not crazy slammed- it was a great night. the bar is really well thought too design wise. like not divey but not so fancy that you're scared to break something. i didn't really know what expect- i've never gone out in that part of brooklyn, but i'll definitely be back. thanks for a great night out :-)", "author": "Mary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "I really like the bar. Good cocktails, nice beer selection. Drink deals. Food has been good when I've had it on occasion.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Our go-to brunch spot in the area. One of the best Bloody Mary's I've had - pretty spicy!  \n\nBrunch food is solid. Wish they had more options. Also it's a bit slow to come out. Friendly bartender. Greats vibes and music.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "This is def one of my new favorite bars! So happy to have come across it on yelp.\n\nWhen I went they had an awesome hot spiked apple cider drink... Along with other drink specials that were awesomely priced. \n\nThe food was good although some items seemed a bit overpriced. The burger and beer combo was a good deal!\n\nBartenders were super friendly and attentive.\n\nGood mix of music was being played and the crowd was laid back and diverse.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "had a birthday party there for my wife last night. The staff was super nice and helpful. Good food. As a bonus it was acoustically pleasing as we could all hear each other talk", "author": "Sean M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Place is amazing. I threw a party here for about 50-60 people on a Saturday night. We set up an open bar and used both the inside and outside parts of the restaurant. The management and staff could not have been more helpful throughout the whole party, including helping me set up. The atmosphere at the bar was perfect and I got rave reviews from my guests the next day. \nMy only \"problem\" was dealing with effects of the free bottle of rum they gave me the morning after. \nThanks again to everyone at the Hollow NIckel. Looking forward to my next visit!", "author": "Matt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "Hollow Nickel has some really good consistent specials. The beer and drink deals are great. The food is pretty good. Probably the best bar for proximity and quality to Barclays.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Great, great neighborhood bar. Relaxed atmosphere with a wonderful backyard space that can be enjoyed when the weather is nice. \n\nThey also have a couple of good deals including burger and a beer and a beer and a shot.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "This space is really good looking and comfortable. I've been able to have work meetings here, dates, and heart-to-heart talks with good friends - the nice neighborhood atmosphere accommodates it all. \nThe food is fresh, and made of good ingredients, which can't be said for a lot of NY restaurants these days - focused as restauranteers are these days on volume of customers rather than quality of food. These guys prepare your food as if they prepared it for you, well beyond the usual bar food standard. A warning to vegetarians like myself - there's some meat in things where you wouldn't expect it- like the jalapeno poppers. Ask clarifying questions.\nLast time I was there they suffered a few minor kinks and gave me a free margarita to compensate, which made me feel that they really cared about keeping customers happy and well respected.", "author": "r m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "Nice little spot on atlantic avenue to get together with friends. They have an outdoor area and seating for larger groups in the back that include comfy couches. The food is your typical bar food fare (lots of fried options (french fries, fried pickles, poppers), guacamole and chips, etc.\n\nServers were friendly and came to clear the table soon after the food was finished. There was a woman walking around with free drinks to promote her company, and we weren't rushed at all (I believe we were there for at least 2 hours chatting)", "author": "Camille H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Was walking in the neighborhood and decided to stop on it. Plus I seen happy HR so Tha was even better lol. Sat at the bar, ordered a corona and a buffalo chicken wrap. Wrap was amazing!! If I wasn't pressed on time, I would definitely stay a lil longer. I will definitely stop in again", "author": "Martine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Love this bar! My husband and I go all the time. Fried pickles are addictive and we also love the crunchy fried chicken tenders. $7 margs are solid and love the other cocktails too. Saying love a lot, but I mean it. Go here!", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Great neighborhood bar. I was staying near by for business and visited this bar on two different nights. \nThe bar staff was very friendly and laid back. Nice atmosphere. Good beer and bourbon selections. \nThere burger is delicious, a combo of angus beef, lamb and pork rib meat. Jalapeño poopers have bacon in them , f@€king yummy! I also had the wings and they great as well. \nI had. A great time there and met friendly locals. I'll be back when I come back to Brooklyn.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Such a great little bar! Decent drink prices and awesome bar food. The fried pickles are killer and the chicken tenders are everything you want a chicken tender to be. Space is limited so get there well before 10 if you want somewhere to sit.\n\nThe staff is really friendly and helpful. We had a great chat with one of the bartenders when we were there and he even made us some delicious custom drinks that he made up on the spot. Small beer and wine list, but always a varied offering. For liquor, they definitely focus on whiskey though, so maybe pass this one if that's not your spirit of choice.\n\nSince I don't live in Brooklyn, the location is a bit out of the way for me. I'd recommend it to anyone who is already going to be out in that neighborhood.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Great local beer options and attentive staff. This is a great place to go if you're looking for someplace casual and low key.", "author": "Francis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Friendly staff and great service! Got our order mixed up but bartender was really apologetic and comp our order!..awesome. Food was delicious would definitely go back.", "author": "Nerecia K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}