{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "I came to this place bc I had a friend who was having a pre-wedding meal with friends who live in the city. Idk, this place didn't change my life. The service is ok and the food is ok, but honestly, I'm over a sticky wooden bar and dudes w/ beards who are above it all. Food was mediocre at best and kinda overpriced.", "author": "Florence P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Good hangout for beers and whisky.  Cocktails are not fantastic and the food is on the higher end of the bar grub spectrum, but still just that.  Nice that they have a back garden in summer, though the decor out there could be more atmospheric.", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "My date and I really really enjoyed this place last night. First, the DJ was awesome -- legit turntable DJ who seemed to be playing exclusively James Brown for a while which is hard to argue with. \n\nThe bartenders were all-around great. We didn't really know what we were in the mood for but our guy steered us into some tasty libations (and even adjusted my date's drink to her liking)\n\nI'm diggin the vibe. A little older (late 20s, early 30s) but if I'm ever back in the neighborhood I'll definitely return.", "author": "Pete S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Small and enjoyable place to enjoy tasty food or a delicious adult beverage. Currently enjoying the phenomenal Left Hand Nitro (milk stout). I give it a four instead of a five simply because their beer selection is good but not great. \n\nJason, a bartender, is great. Friendly, personable and accommodating. \n\nI will be returning.", "author": "Casey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Hollow Nickel is my favorite favorite bar and patio.  On a nice summer night, this place is unreal with the waft of honeysuckle blossoms, the glow of fireflies, and of course affordable beer.  They're also crazy friendly here (esp on a Sunday night when it's not busy).  Try it, love it, do it.  Drink.", "author": "Madhu R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Great food and great drink.  I just wish the fruit in my sangria not taste so mealie and old.  I still recommend it and would go back.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "I love this place!!!!!!!!!. I literally thought the best burger I've ever had in my life was at shake shack. Hell no! Hollow nickel baby. I took time to make sure I've met the cook in the back his name is eddie and eddie can make magic baby. After a burger I usually feel real disguised and want to do at least 2 hours at the gym but here the burger was light and I had a excellent salad with it also. Definitely going to be a regular here and the manager Travis and the bartenders make you feel very welcome.", "author": "Keon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "This is a fantastic neighborhood spot! \n\nThe vibe is relaxed, the drinks are generous, and the bartender is super friendly. The crowd is a nice mix of folks, and there are homemade french fries and chips!!! Yummm!\n\nThe bar owners put major detail into build out of the space, it's gorg! And they've got a semi-private back room and a snazzy back yard to boot! \n\nLooking forward to the addition of food items on the menu!!", "author": "miss b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "This place sucks. All the good people are gone. Used to be good but I guess management has their head stuck up their big dumb dirty butts.", "author": "Shan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "I'm pretty sure I ended up here randomly one night years ago with my sister. After our friend decided that he was going to drive everyone home and that there were not enough people to fit in the car, we walked into here and awkwardly were left to chit-chat with his Russian friends. Zoom forward two years later and I'm here again after drinking from a keg in a fake soccer field. I did not need another drink last night by any means at all. But I had one. It was a something IPA and ended up being more expensive than I had wanted to pay. Though, our waiter was a weirdo and wouldn't give us a beer menu and I'm not sure if one even existed. I like the ambience of the place. There's a bookcase filled with. . . books. Chuckles. And a chalk board for writing and doodling in. . . chalk. Low romantic lighting. We split an order of cheese fries that came with really weird not delicious at all cheese. It tasted kind of like melted feta. And it was supposed to come with gravy. But they didn't have gravy. And they gave us some kind of chipotle mayo instead. That they charged us extra for. Which makes no sense because we didn't get any gravy that we were paying for anyway. Sigh. I can't have everything perfect. A decent bar in a convenient location when there aren't many on the way to the train along Atlantic Avenue.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Would highly recommend. Ginger toddy was unique and very well made, grilled cheese with bacon on sourdough was delicious. Casual vibe, playlist was great. Excellent spot for a meal and a couple drinks. Whiskey list was extensive and a good number of house drinks. I'll be back.", "author": "Alex O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "I walked here only because the name \"Hollow Nickel\" piqued my interest.  What I found was a great selection of craft beers, a delicious albeit limited menu, and a pub-like ambiance.\n\nI recommend the chili.  It looks like it came out of a can, but it tastes much, much better.  Plus, they brought over some Tabasco without me having to ask.\n\nIt's a bit of a hike, but the next time I see the name Hollow Nickel come up in a list of nearby restaurants, I'm certainly dragging my group here.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Standard fare. Beer and burgers. Service is relatively fast.", "author": "Tracy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Found this place while staying in Brooklyn for the weekend.  It's in a cool neighborhood.  Great outdoor patio.  They have a decent draft selection.  The place is very relaxing and low key.  We really enjoyed this place. They do serve food but we did not eat here.  Their brunch menu looks good and we definitely want to check it out next time we are in town.  Great place to unwind.", "author": "D W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "This bar replaced my favorite coffee shop (RIP The Flying Saucer) but it has turned out to be a great place in its own right.\n\nGood drinks, friendly bartenders, decent bar-food selection.  The backyard is great, and there's nice space in the back of the bar for larger groups.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Bar looked cool from the outside so I've made a mental note for a long time to one day venture in with a friend. Glad I did because this place is awesome!\n\nThe bar inside is dark, cozy, with plenty of booths and tables and music to keep your feet tapping. Happy Hour is til 8pm during the week. Fortunately, it wasn't humid so my friend and I got to enjoy their pretty garden in the back. With a big tree and greenery around, I fet like I was a someone's garden. They're benches and tables to plop your ass on and enjoy drinks. For a Friday night, it wasn't busy so got to relax and mellow out in the quiet garden.\n\nLocated about 5mns from the Atlantic Ave station, it's conveniently close to grab a pint or two.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I don't want this bar to get more popular, because then it would get crowded and suck.  There is a lack of good places in that neighborhood that a) aren't dives and b) serve decent food.  Plus it has a sweet outdoor space.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "My guy, Kyle, and I were in town for a concert at the Barclays, figured we'd have time to grab some grub beforehand. Saw all the great reviews for this place on Yelp and decided to give it a go.\n\nOy.\n\nFirst, we walked in to some staring. No greeting, no menus, no \"sit anywhere you like.\" Okay. Whatever. It's a casual pub.\n\nSo we seat ourselves at a table. And wait. And wait. Finally, Kyle goes up and asks the guy who'd been staring at us and even walked past us a coupla times for menus.\n\nAt this point, we figure we're gonna have to do everything but cook the food ourselves, so Kyle goes up to the bar to place our order. Meanwhile, guys over at the next table are wondering what's taking their chips and guac so long. When the server comes around with chips and guac for another table, and they ask where theirs are, he basically berates them for not having a number. Because you're just supposed to know that you need a number to get your order without anyone offering you one, apparently.\n\nThirty minutes go by before we remind our server that we placed an order. We're going to have to scarf at this point. Good thing Kyle paid already, right?\n\nYyyyyeah, no. Server drops half my sandwich on the floor when the food finally comes out.\n\nNo immediate apology. No offer to make another or reduce the charge. We have to initiate that whole thing when the server comes around a while later and asks if we got everything we need. With no sense of irony.\n\nI'm like, \"Well, I'm missing half my dinner, but otherwise, all is peaches, I guess.\"\n\nIt took another fifteen minutes to get the bill adjusted. And I'm still hungry. \n\nIt's really a shame, too, because the food was really good.", "author": "Chisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "Another place that serves the neighborhood well. The food here is great, I'd come for it even without the bar. Burger, fries, and fried pickles are really good - most things come with awesome chipotle mayo. I really like the quesadillas too. Their happy hour could be better, but no real complaints from me. They make up for it by giving a free drink every once in a while!", "author": "Zack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Hollow Nickel has become my neighborhood spot to lay low, grab a good drink, tasty snacks and good conversation with a friend or two. Dark, cool and casual the front has mini booths and a wrap around bar while the back has benches for larger groups. A flush bookcase filled with games lines the wall between the two spaces along with the bathrooms. \n\nThe food, is delicious. Especially the mini burgers and skinny, sexy onion rings. These two finger foods are a must for bursts of flavor all over your taste buds. The cocktails, they are strong! Too strong in-fact but at $5-$6 bucks a pop how can one complain? I'm not, however a big fan of their white wine selection. It's a bit too sour for my taste. Overall, I dig this place. Each experience has definitely been a good one. \n\nOh and let's not forget, they have a back yard too. Great in the warmer months.", "author": "Valerie V."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}