{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "Love the outdoor space in the warmer months! My friend and I have tried here many times but it's not hitting that \"awesome\" with us. We are determined to give it another go soon though, and hopefully I can upgrade my review!!!", "author": "Piotre W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "One of the best spots in BK! Great people and awesome atmosphere. Be sure to check out the patio. If you have time ask about their name. Cool piece of Americana.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "We needed a lounge-bar like this in the neighborhood! It is tastefully decorated, and yes, they actually have the Hollow Nickel there! (Google it if you don't know the story). It is pretty new, but it has won our heart with delicious food and creative cocktails. Ah, the prices are also reasonable and the owners and staff are extremely nice and friendly.\n\nYou also have to see the backyard! It is cozy and has some cool sculptures you can enjoy with friends while having a cig. \n\nThis spot is great, and you always end up having an interesting conversation with locals and staff.", "author": "Silvia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "Ate here with a friend before going to the Barclays Center. It's conveniently located just a few blocks away so expect a big crowd any time something is going on at the arena. We both had burgers and fries. The burgers were good. The fries were amazing. The draft beers are a little pricey, in my opinion, averaging about $7. \nThey have a decent sized backyard which is nice but it was packed when we walked in so we sat inside. A small bar up front and a small eating area in the rear consisting of about 3 tables and a couple of couches for lounging.\nThe food took over an hour to come out due to the crowd (I assume). They are quick to clean up though, removing dirty glasses etc. The staff was friendly. The crowd was reasonably quiet considering how many people were there.\nId definitely go back next time I'm at the arena.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "Came by for a few drinks and a snack before a show at the Barclay's Center.  There is a varied list of craft beers on tap and the pinot grigio I ordered, though somewhat of a small pour, was alright by me.  My boyfriend \u0026 I shared the turkey melt, which was very simple and good.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Great service and perfect setup for a large group!  We used the back space to host a pre-new years party before heading to barclays for a concert. The space was decorated for us and easily fit our group of about 20. The prices were reasonable and Travis did a great job of making sure we were taken care of. We will definitely use this bar the next time we are in the area for a barclays event. Highly recommend!", "author": "Ian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Came here twice for a birthday and going away party. Good places to have a party if you put in reservations. Place doesn't get too crowded. The best drink here I think is called the Atlantic.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "what to say ?perfect from A to Z,the faste service ,the dressing of dishes to quality of what is in it ,not to mention the place full of magic and smile present on the face of all the staff,i think it should be emphasized.looking forward to returning.i highly recommend !", "author": "Loganne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Fun spot for happy hour drinks and greasy food!  The prices are reasonable and they have a nice selection of beer (wines not so much but I was decently pleased with the $7 sauvignon blanc I ordered).  The food almost bumps this place up to 5 stars--fried pickles, fried jalapeno poppers, guac etc.  Those poppers were incredible--this was weeks ago and I can still remember them. Maybe it was just that I haven't eaten like that in awhile but honestly the dishes were great, in a friend food/death wish way.  There's a cute backyard too, which I'd like to check out one of these days.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "As a neighbor living on the same block, let me be the first to say THIS PLACE ROCKS (and just opened last night). \n\nBeautifully detailed interior, tree-filled backyard, delicious cocktails (try the cilantro mojito!), prices that don't give you a heart-attack and most importantly- the most friendly caring owners and staff. Also, I saw that they have a full kitchen, so that must mean delicious snacks to come. They used to run the old Flying Saucer café, come in to see how they revamped the space completely. So happy to have this gem on Atlantic- they really want to keep the vibe of the neighborhood intact and make sure you keep coming back. Oh, I will. And so will you.", "author": "iampiama h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "I live in the neighborhood, and have been to hollow nickel a few times at this point.  Last Sunday a few friends and I decided to do some day drinking in the garden and for the first time ever I was thoroughly disappointed with my visit.  The bartender that afternoon was just absolutely terrible.  The guy was rude from the get go.  I walked up to the bar and asked him how he was doing with a smile and literally got a grunt in response.  A little later, I went back to the bar in search of a menu and now there was another woman behind the bar, hoping that she might be in better spirits than her fellow worker I inched towards her direction.  She was chatting up someone at the bar who was clearly a friend and proceeded to ignore me.  I stood patiently, waiting for her to turn her gaze to me..and when she finally did, she just looked at me and continued her conversation with her friend.  Reluctantly, I went back to my grumpy friend to retrieve a menu.  I'm not sure if the employees that day were just super unhappy, or if the bar has taken a turn for the worse but I don't think I'll be back to find out.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "I love this place! Aside that I waited 9yrs for a decent bar to open, this place has so many good things to offer. \nHollow Nickel's service is outstanding every bartender and wait staff is above and beyond nice. Food is the perfect bar food. Booze has a great selection if seasonal beers, bourbons, whiskeys and delightful cocktails. Bartenders are really knowledgeable and helpful. Please visit this local wonder!", "author": "j R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "This is a very solid place, just a whisper shy of five stars.\n\nThe atmosphere is very cozy, staff friendly, jokes on the menu funny. \n\nThe drinks are inspired. The designer seems to like sweet flavors, cinnamon, ginger, and honey all show up multiple times. No complaints here.\n\nThe food ranges from excellent to decent. Edamame hummus is a great idea, and although the menu *seeeems* to indicate that the pita chips are baked elsewhere, if I had not read that with my own eyes I'd have sworn to you that they were hand-made on the spot by spell-wielding pita sorcerers who were using their powers for good. Just a little too salty though, guys, if I may weigh in.\n\nFried mac and cheese was also fantastic, a little sweetness in the crunchy breading, perfect.\n\nThe only beef (heh) I have is with the sliders. Portobello slider was too tangy.. maybe it marinated too long? Pork and beef sliders were serviceable. I either needed more karate out of the sauce, or maybe a less-dry bun.\n\nAnyway, great, great place overall. Will definitely be back.", "author": "Bret H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "Some of the patrons here have no respect. They drew and scribbled all over the art in the backyard, completely ruining three pieces. Who does that? I don't care how intoxicated you are, respect the art around you. I wish I knew the sad people who did it and could ask them what they were thinking. Really unforgivable.", "author": "Olivia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "What a great spot that a friend of mine took me to after brunch down the street from here. It has a decent sized backyard with large tables and plenty of seating to fill up with friends, and enjoy the outdoor weather after such an intensely awful winter. The interior is cozy, and the bartender (a cute auburn guy with a beard) who made the most fantastic White Russians that I ever had (and yes, he made them the right way! Layered, not mixed!). Good vibe, especially when in good company! Definitely returning here. Bring friends, and tip well.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Why haven't I been here before. Tiffany was a great bartender and the wings were good. Great Sunday Happy Hour and fun crowd. A very neighborhood place but 'outsiders' like me were every welcome. Great selection of wine, beer and cocktails! Stop in--you won't be sorry.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "This is such a great bar in Brooklyn! It is a cozy bar that is so much fun to hang out at with friends. One bartender in particular - Logan - is the best! He was so talkative and friendly and made the experience awesome. I will definitely come back to this bar next time I am in New York!", "author": "Megan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "A friend of mine had his birthday party here and I was very impressed. There was a solid crowd of people and a good dj spinning tracks in the front - ok, not spinning at all, but he had a good mix. My friends really liked the hummus and the chicken wings. \n\nThe waitress serving drinks really took her time, but I think she was the only one working the back, so I give her some credit. \n\nNot the best place on earth, but a solid hangout spot, especially if you live in the neighborhood.", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "We met up with some friends for dinner and drinks. Great spot! We were happy to find it wasn't too crowded. The beer selection was nice, and they have great specials to choose from.", "author": "Nathan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Went with a good friend prior to a show at Barclay's.  Great pub atmosphere and food.  My burger was cooked perfectly and was delicious.  Fried pickles were slightly overcooked but still yummy.  As the other reviews mention, a good selection of beer and bourbon.  Service was prompt and friendly - Hanna was our waitress.  Seemed as if it would be a good place to go after a show too.", "author": "Thomas A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}