{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Highly recommend. \nWith short notice to bartender Jean and the excellent kitchen staff, 13 thirsty, hungry people descended on the Hollow Nickel after a fabulous visit to the nearby Transit Museum. We received terrific service from this \"order food at the bar\" establishment. Met some other wonderful patrons who had also been to the Transit Museum that day. First timers to both the Museum and the Hollow Nickel, we all had a great time. \nThe menu is nicely varied pub food. A breakfast burger and fried pickles were our more adventurous choices. Lots of great burgers cooked to order, chicken wings, tomato soup and grilled cheese for the young at heart. The beer choices on draft were great. Loved my IPA. \nWish this place were closer to home. I'd be there every weekend. \nClose to the Barclay Center if you're in for an event.  Has an outdoor back patio which looked nice though a little too chilly outside today for any of my group.", "author": "Nancy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-02", "description": "Like this spot a lot for a relaxing hang in my neighborhood. In the winter there's a fire in the back and the backyard is delightful in the summer. \nReally good beer and shot combos; beer and burger combo; beer and hot dog combo... you get the picture. \nI would not call this a dive, it's far to clean for that, but it's also not stuffy, nor too self-conscious. Just a great neighborhood spot.", "author": "Julia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "Man I really don't know how I feel  about being that guy that gives every place 4stars but if you're every near BARCLAYS center and love a good dive bar with GREAT food please come here !!!\n\nHighlight was leaving March Madness and continued watching Richmond (aka my 7th graders college class name) on the screen. \n\nFOOD: \n\nWings are beyond phenomenal. Like had I known the were that good I would've deaded all the other orders and got 50wings. It's hard to describe what makes a good wing Bc so many components go into it. Ima keep it short: juicy and crisp at the same time. \n\nJunkyardDog: I mean a hot dog with no nitrates is always the wave. I slacked not getting it bacon wrapped. \n\nQuesadill: Top Notch - you can tell The ironed it on a plancha! \n\nBurger \u0026 Beer Combo: My friend said it was cooked to perfection!! \n\nAMBIANCE:\n\nDive bar, def a date spot. Small cozy and to the point. \n\nSERVICE:\n\nThey don't give a fuck about serving you lol ask for a menu at the bar , shut up, sit down, order your amazing grub, and enjoy.", "author": "Bennie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "This was one of a handful of places near our hotel that was open late and still serving food. Bartenders were pretty friendly and accommodating and let us know we could sit anywhere but needed to come up to the bar to put in any drink or food orders. Fair enough. \n\nOverall vibe... hipsterish. Cheap drinks, decently priced food, low lit, a bit of a grungy vibe to it, but I was diggin' it. Fellow patrons were pretty friendly as well as I recall a guy recommending a beer to me and said if I ordered it he'd get the next one on him. That was nice of him, but didn't take him up on the offer as I just was looking for a late night dinner and beer and planned to head out. Overall a decent sized bar with a good amount of folks on a late wednesday night watching the Lakers game. Kind of felt like I was back in LA for a bit (whoop whoop).\n\nAnyways, for food I was quite impressed with the burger. Hard to say if it was actually as good as I remember or if I was just starving having flown in late and not eaten yet. But for $14 will get ya a burger and beer combo. Not much to it, just a special juicy blend, cooked to your liking and served with lettuce, tomato, and onion. They patty was perfectly cooked medium as I requested and definite a unique spice blend they use on it but delicious. Also shared an order of the chicken tenders which were uniquely battered with panko for extra crispiness and the honey mustard and bbq sauces tasted homemade and were great as well. \n\nGlad we lucked out on this spot so late at night as it was just what we were looking for. \n\n'Til next time, cheers!", "author": "Francis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "This is a great little dive bar. I loved the pickle backs. Perfect bourbon pairing and pickle juice had spice to it. Had burgers and fries pickles with colleague. Food was good. Unremarkable but not disappointing.  Great vibe. Inexpensive. I'll definitely return. Kinda average for Brooklyn but exactly what was needed.", "author": "Bill P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "buffalo wrap was good. I like how they put the whole wrap on the flat top to heat it. It gives it a crunchy exterior. The breaded chicken is cooked well. I would say the flavor is pretty good. I though there were too many raw onions but that is just for my taste.\n\nThe bar area is cool with a little bit of a hipster feel to it. \n\nThere is a small kitchen so it is very cool that they can pump out decent food.  Cool place.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "If I'm heading toward Barclays area for whatever reason I like to pop into Hollow Nickel. Great happy hour deals, and even better beer and shot for $6 all day. The back is nice and chill to hang with friends in the warm weather days. Also, the food is surprisingly good! The chicken fingers are my favorite, super crispy and large, almost like schnitzel fingers if I were to rename them. The fried pickles equally crispy and well seasoned. My buddy said the burger was really good, came with a beer for $15 if I recall.\n\nYou won't feel hollow coming here, and you won't have to spend too many of your hard earned nickels to have a good time. Oooof, ok, cheesemiestro out.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Didnt try any food but it looks decent.  Scored the last solo bar atool at the full but not overly crowded bar on a Tue at 6pm.  I like the simple menu. $4 buds, 5 corona, 6 stella and heiny and 7 for guiness.  9 and up for wine. Simple system, simple crowd.  Gonna try ot on a weekend brunch.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "Came here for brunch with high hopes, but they got shot down faster than a runaway squirrel. \n\nThe veggie burger was unappetizing and bland in flavor. So I deconstructed it to the bun and egg, which were palatable on their own.\n\nThe service was inattentive to the point that I had to walk up to the counter and demand my check after 15 minutes of finishing what I could on my plate. \n\nHowever, the remeding qualities of my experience were the side salad and my friend's burger, which were adeqaute. All in all, not really a spot for a vegetarian like me.", "author": "Sainath D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "Bartender lectured me because I was not comfortable handing over my credit card for him to hold onto. He told me that \"no one else has a problem\"! I have had my card I information stolen in the past. Then his friend who was sitting next to me chimed in making me feel even more extremely uncomfortable. Customer service training is required here!", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Alright happy hour spot close to Barclays Center. $5 well drinks, $6 margaritas and wine and beer specials 4-7. First vodka club was on the bartender which was super kind. Also tried the \"Rosemary's Baby\" gin cocktail which was not on HH and a little sweet for my taste. Ordered a Hollow Nickel salad with mesclun, goat cheese, candied walnuts and dried cranberries. Pretty good and a satisfying portion. Tried some guacamole and wasn't crazy about it. Chips were VERY salty. \n\nOverall a solid choice for HH or a casual drink on Atlantic Ave. Would return.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "We happened to be driving down Atlantic ave one night and we saw this local bar. It looked nice kind of like a comfy sports bar from the outside so we pulled over \u0026 went in for a beer. \nIt's a nice space and I can see myself having a good time here, however when we were there, there was a really loud hipster chic loudly discussing some music album with the bartender. Energy here was a bit bougie and hipsterish. We drank 1/4 of our beers and just left.. \nBeer selection was really small. (Also they don't carry Heineken) and the draft picks we got sucked.. menu didn't seem so appealing either.. \nMaybe we'll be back to give it another try in the summer since they have an outdoor area.", "author": "Tal O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Great fries literally ! Also their burger is a must try drinks are very reasonable and strong", "author": "Ashely L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "I got wasted and \nMade an ass of myself so\nA successful night!!!*\n\n*cheap, strong drinks and friendly bartenders. Im still so embarrassed so see you never", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "It was a pretty good vibe. I like the decor. I had a chicken sandwich, my boyfriend had the burger. He wanted a second burger. My only criticism would be more seasoning on the fried chicken and a nice sauce would take that sandwich beyond anyone's expectations. Also we didn't like that the bartender kept going out for smoke breaks.", "author": "Kendall M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "After watching WWE in Barclays center we wanna to seat somewhere and found this place which was open late night.. Bar attendant was funny guy\nSo sadly kitchen was closed but they have snacks", "author": "Shev O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "It took me way too long to try this place.  Small but lots character.  Tap selection is solid and having Blue Point Toasted Lagers at $5 (and not just at happy hour) makes me excited.   Other beers are $7 and at this point I will take that price since beer prices seem to be creeping up in BK lately.  I recently saw a Bells Two Hearted for $9 at a bar in Greenpoint .  Bartender acknowledge us right away when we walked in and even said goodbye to us as we were leaving.  Maybe I am old school but I miss that at bars lately when the bartenders act too pretentious.  We didn't order food, but I would come back and try for sure.  One tv in the corner is perfect for your sports game fix.", "author": "Ang M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Good place for late night waters or drinks.... lol. I like this place. They have good specials and make awesome drinks according to their menu! Lol", "author": "Mon-Cheri H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "This bar is amazing! Bartender Jamie is super friendly and happy. WAY better than the salty experience we had down the street at Robert Bar.\n\nBut seriously Jamie is super amazing and should be here every night. SUCH a great face for this business.", "author": "Stacey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "This place was great! I stopped here before a show at Barclays.\n\nThe setting is pretty intimate - I wish I lived closer to this place. \n\nI had the BLT and the fried pickles. Both were really good - I would definitely order them again! \n\nNext time I'm at Barclays I'll definitely stop by this place.", "author": "Colette H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}