{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "My friend found this place on Yelp and decided to have happy hour/dinner here on a Friday evening around 6pm. Judging from the reviews and pictures, we decided to give this place a try. \n\nOnce we stepped in, it was CROWDED. The only available seats we saw were by the window and seated ourselves. There were shot glasses and glass cups everywhere. No one came around to cleaning them so we just pushed them aside. There was a huge blackboard with a mini menu and also a small paper menu floating around from table to table. \n\nWent to the bar and ordered the turkey toastie for myself \u0026 the angus burger for my friend and drinks. Asked for a malibu bay breeze and blue hawaiian and the bartender that helped me said they don't carry malibu and I just settled for a cider. Waited on the blue hawaiian for a bit and she never came back with it. When I finally got her attention again, I asked her where was the blue hawaiian and her response was 'what's in that again?' I'm sorry, but how are you a bartender and not know what's in a blue hawaiian? When I told her she said they didn't carry blue curacao. \n\nWhoever she was, she must be new. I wish I got her name because she was clueless throughout the whole time I was there. I had to repeat my order to her twice and the order number twice. I told her I wanted the burger medium and it came out well done. The turkey toastie was your typical turkey sandwich drenched in butter. The fries that came with it were super salty. When we were finish, I went to close my tab and it took forever to get her attention. She looked over at me a couple of times and totally ignored me when I tried to wave her down and she decided to help others instead. Super annoyed, I just waved down another worker to close the tab for me. \n\nOverall, the worst experienced ever. The food was mediocre, the service was terrible, the selection was limited and it was disgusting inside. Save yourself the trouble and avoid this place. You'll probably have a better experience at Applebee's inside Atlantic Terminal.", "author": "Cristina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "Unpretentious, low key bar right on Atlantic Ave.\n\nLove the tin ceiling, booth seats and shelves with real books (yes, real!). There is also room on the back with more seatings and backyard, but it was reserved the night we were there, so I could not check it out. \n\nThey have TV for all you sport fans!\n\nGood beer selection. Food is simple, but pretty great. Fries were good, and BLT was very, very nicely put together - perfectly toasted bread, thick-cut bacon, fresh tomatoes - delish!!! \n\nNow, someone please, please tell me the meaning of abbreviation on the mirror??? I will love you forever if you do!", "author": "Nadia Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "MEeehhh I want to love this place because it's in a really ideal spot for meeting up with people (since SO many trains converge around this area) but my experience overall was mediocre. While the staff was friendly and the backyard was beautiful, the old fashioned I got was terrible. large sugar granules settled into the bottom of the drink, and a large orange wedge was just dropped into the glass without any sign of muddling whatsoever.\n\nthe best advice I could give is to order a spirit neat or on the rocks - they do have a nice (although somewhat limited) selection of scotch/rye/bourbon, and the food definitely looks on point.\n\nI think while chasing the last warm days of the season, this is a great spot for a quick drink or food, but I wouldn't recommend ordering cocktails per se.", "author": "Vicki L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-12", "description": "Well... we tried valiantly to eat here on a Thursday night. After settling in at a table and realizing no one was coming, my date went up and thought he grabbed the attention of one of the staff. After waiting a while longer and still nothing, I went up to the bar. Even though I made eye contact with one of the staff and told him we'd like menus, he never came back. Too bad... menu looked great online and we were really eager to try.", "author": "Briana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "The Hollow Nickel is a wonderful neighborhood bar. Great space for parties, awesome backyard, sick ass deep fryer, and super friendly bar staff. \n\nI've been here a million times and it's seriously better every time but I'm writing today specifically because they just came up with something that is going to be the next hot thing in Brooklyn. It's called a \"Gravyback\" and it is a shot of rye followed by a shot of magnificent thick-ass turkey gravy, made especially for thanksgiving. This is the kind of dope shit that goes down at the Nickel.\n\nP.S. Great hook up bar", "author": "Joan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Great neighborhood spot. Indoors and outdoors both good spaces. Love a place where you're equally fine getting a nice meal or a Narragansett tallboy.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Great pub with beer garden that is a sun trap in the afternoon. Food was nice, service quick and reasonable prices", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "This is a great place to come to before a show at Barclays! Came in at 7 on the dot and the bartender still let us order the $5 margharitas for happy hour. Knowing me, I got too excited and ordered 4 of them lol. They are definitely worth your money because they are strong!!", "author": "Amber C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Had the best, most unexpected time here. I was on my way home from the Mermaid Parade when my belly started rumbling, so I whipped out my handy yelp app and headed here, a short walk from Atlantic Terminal. Let me start off by saying I was ready to call it a day and head home but this place lit the entire night for me, suddenly anything was possible.\n\nWe walked in around 6 and were instantly in the mood for a good time. I wasn't planning on drinking but they had a $6 dollar special, a shot of whiskey and a beer, they were able to sub in their Hollow Nickel Ale, which was so refreshing. I ordered the BLT with a salad, it was awesome. The sourdough was wonderful and perfectly toasted, the bacon was crispy, tomato was juicy and there was a good amount of mayo. The salad was fresh and dressed to perfection.\n\nWe decided to try a pickle back shot, I recommend everyone try this, at least once! It's hard to stop at one and before we knew it, we missed 3 trains and just decided to stay. We ventured out for a bit but it wasn't long till we were back, this time we headed to the outdoor area. It's beautiful and very roomy, there was just enough seating for everyone and the waitresses were always making their way through the crowd, making friendly conversation and taking drink orders. This was truly a magical night, made possible by Hollow Nickel.", "author": "Shoshana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Based upon the name I thought this place was as empty as my soul. Or as hollow as my views on society. On the contrary however, it's packed. With lots of awesome things like, swell drinks, good people, delicious food, and chairs. Got to love chairs.\n\nI'd been meaning to stop by the Hollow Nickel for awhile but never got around to doing it. Always something came up. I had plans, or an emergency came our of no where, or the feds were onto my illegal wild animal trafficking. Typical things that pop up.\n\nIn the past month or so I've been there for a few times. in particular for some happy hours. They were quite happy so there was no false advertising. \n\n$1 off all tap beers. As well as deals on well drinks. They also have a deal going around all the time. $6 beer and shot combo. It's a Narragansett tall boy, so while it's not my favorite beer it is a 16oz, and Evan Williams is pretty darn good for a well shot. If you like suffering and hate yourself you can get the deal with a Corona and a well shot of tequila instead. There's also a margarita special, you may want to inquire about. \n\nMy favorite thing about the place is the food. I don't care for Jalapeno Poppers, but these are not ordinary poppers. They're almost more like fritters. Tasty tasty fritters. I also love their guac, fried pickles, and fries. And I don't normally like overly seasoned fries either, but once again this place just knows how to do it real well. The dipping sauces are fantastic. They got chipolte mayo. Cucumber mayo. Mayo mayo. I like mayo!\n\nThere's lots of different seating, from a several stool tables in the front, a bar with a television, booths, tables in the back, and an outdoor area. Perfect for whatever size your party is. \n\nMy one quarrel is the beer selection. It could be a bit more vast. And I don't think the price of the drafts are that great, but they're not awful either. I have to say their personal house brew is pretty good, and is only $5 bucks. They also make a solid Manhattan if you want to get all fancy. \n\nSo if you find yourself strolling down Atlantic, this is a great option for a great time.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "This place was listed as allowing dogs. They don't. Management: please correct your listing.", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "This is a really nice looking bar with a cool vibe and a really warm, cozy, inviting feel to the place thanks to the decor, the candle lit tables, the bookshelves full of *GASP* REAL BOOKS, the homey chairs and the modest fireplace.\n\nNow that I've gotten most of the pros out of the way I can focus on why I'm giving this place 3 stars. The beer selection is ok. Fantastic maybe in the Mid-west, but this is Brooklyn - the supposed land of awesome beer outside of Europe - the beer list is meh. So is their wine list (if I remember correctly...which I'm pretty sure I do), the cocktail list is pretty great, over-priced for where we are, but still pretty damn delicious looking.\n\nI ended up getting a Hoegaarden (a refreshingly crisp beer brewed in Belgium and consumed by me many, many times) and my friend ordered an IPA which she may have not been too crazy about - but at this point we had certainly had enough to drink from a bar hop and a Yelp event - lol.\n\nMy other friend raged hard on the Shirley Temples because she was responsibly trying to not get wrecked since she had a job interview in the morning. Smart lady.\n\nWe did have the munchies and wanted to try something off the menu so we settled on herb-crusted cheese \u0026 gravy fries. Oh surprise, they were out of grave (it's like barely 9ish mind you, who's out of gravy????? With this dish being the only thing on the menu that required gravy how could they be out? I take it everyone comes here for the gravy fries and only the gravy fries...\n\nI asked for ranch sauce *in place of the gravy*, a friend asked if they had chipotle mayo and they said they'd make some for her - then I asked for regular mayo and *surprise* they ran out. Ugh.\n\nSo the fries come (after a decent waiting period, thank goodness for my beer) and they the top layer (and only the top layer) is covered in some flavorless white cheese. At first my girlfriends liked them, I pointed out the cheese wasn't good and so they both sampled the cheese without fries and came to the conclusion that I was right.\n\nThe fries alone were pretty damn delicious, real win here - but later when we got the check we realized we were charged for our ranch. We explicitly asked if we could get it *in place* of the gravy they ran out of and were told yes, mind you they also ran out of mayo. How does one run out of condiments? \n\nOur waiter was super attentive though so it's tough to blame him because his service was spot on. I blame the kitchen folks or whoever does the shopping - buy more mayo, more gravy making ingredients (assuming you're not buying pre-made gravy, le sigh) and a better quality melty cheese - that white stuff was not good and actually took away from the fries.\n\nI'd come back here if in the neighborhood, but I wouldn't go out of my way to leave my nooks in Queens or Manhattan to come here if I didn't have to :-/.", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "Really enjoyed Hollow Nickel! Came after work with 3 coworkers to grab some food and drinks. The happy hour is great, we all partook in the $6 sangria special. The sangria was delicious!\n\nFor food I ordered the BLT as well as frickles for the table. The frickles were sooo good - not too greasy and really crisp. Just wish the order were a little bigger, or the price tag a little lower. It seemed expensive for the roughly 10 frickles that actually come in the order. My BLT was great too, nice sized portion and fresh tasting ingredients. \n\nOverall, Hollow Nickel is a really cute spot with a solid happy hour. I recommend it and if in the area again would definitely return!", "author": "Maya S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "Cool place. The kitchen is not so great, however . Very bland fare from this place. I had the burger. Not much to note about it. \n\nI was with a group of people last Sat. We all\nrather underwhelmed by the food. I'd go here to drink, but I wouldn't recommend eating here", "author": "Tom D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "This bar has the three CB's that are necessary at a drinking establishment: \nCraft Beer. Cute Bartenders. Clean Bathrooms.\n\nI'm not sure how I haven't been to this awesome neighborhood spot before, but now it'll have a place in my boozing rotation.\n\nCame recently to have drinks with a friend, and it was certainly brimming when we got there around 7. But the crowd died down an hour later, and thankfully we secured a seat at the bar. To safely get a barstool, I'd say arrive after 8 on a weekday.\n\nWe had a couple beers (Sixpoint and Lagunitas) and ended up getting some food as well (quesadilla). Beers were $6-7, with some cans running at $4.\n\nWhile all the of previously mentioned were no different from a typical Brooklyn bar, the service here is awesome. Bartenders are chatty and sweet, and regulars seemed nice enough. You'll get a Cheers-y vibe, and I'm sure you'll want to hang out with the gang every night soon enough. Bottoms up!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Let me start out by saying that I am a regular patron of this bar. My friend Annie and I go there once or twice a week. What keeps us coming back is the great bar food... mainly the wings! The cook Eddie does a great job and whenever he is there we know that we are going to have a tasty  meal. He also makes an amazing burger and will customize a healthy grilled chicken wrap any way you like it! As long as he is the cook there, we will be loyal customers. The bartender Mark is also super kind and attentive. Hollow Nickel will thrive having these guys around. I am taking off one star because of the inconsistency in the quality of the food when Eddie isnt there. He really is quite talented in the kitchen.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "On a quiet Tuesday evening my friend and I decided to grab a bite to eat at Hollow Nickel. We walk in the door take a look around waiting to be greeted and seated. After a few seconds we assumed customer's seat themselves. So we chose a table and waited. Approximately 5 minutes after seating ourselves a staff member from the kitchen brought food out to the table across from us. We greeted him in hopes of at least a greeting in return. Our greeting from him was \"you order at the bar\" and he walks away! We brushed it off made our final decisions and ordered at the bar. The bartender hands me our soft drinks and a table number. I bring our drinks and table number to our table. A bit later we received our food without utensils and napkins. We had the chicken quesadilla and a burger so we attempted to enjoy our food without making too much of a mess on our faces. Not once were we asked if everything was ok or if we needed anything else. We then came to the conclusion that this is a restaurant/bar without wait staff. We received our bill of $31 and split it down the middle $15.50 each. To my surprise I checked my bank account and had a charge of $17.50 from Hollow Nickel. I gave them a call once they opened. A manager by the name of Kane was pleasant and helpful. He sent me a picture of my receipt showing someone changed my total to 17.50! They also changed my friend's receipt to reflect the same. It's really unfortunate to have this happen. It is only $2 but it's in no way professional or acceptable to change a customer's receipt. I go in to get my money back and I receive a nonchalant apology from another manager (I assume). From that apology it seems like this is a customary act from their establishment. Stealing shouldn't be taken lightly!!", "author": "Tiara N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "What were we thinking going here with a Bruce Springsteen concert in 2 hours around the corner. Lol!!  Place was packed and spilling out the doors.  People pretty much piled on top of each other to get to bar. We gave up waiting for the waitress. There was only one.  Went to bar to order our lunch.  There were two bartenders there. The wine was so good but took like 15 min to get it at the bar. There's a bunch of picnic tables in back\nThat the one waitress seemed more consumed with that area. Kept walking right past us.  Never acknowledged us once.   I gave 2 stars for food.   When there's a big concert, hire more staff to handle the chaos. Really stinks being ignored by the staff", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I always have a good time here, so hey 4 stars.  It's just a regular slightly-divey bar with tasty tex-mex bar food.  The only vegetables I recall are potatoes (fried) and jalapenos (on nachos and in the fantastic jalapeno poppers).  Everything we ordered was fried or covered in processed cheese or both, tho there probably are more wholesome things on the menu if you are in that mood.  Bar staff are fine, it's open late, after midnight the sofas in the dining area are perfect for groups of noisy drunk people eating said jalapeno poppers (did I mention how good they are?)", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "If you are looking for a place to chill before a show at Barclay's, would highly recommend the Hollow Nickel! It's a smaller place with a lot of charm, and with an outdoor area. They have a great happy hour and food selection - I was trying to be \"healthy,\" so got the veggie burger and fries. Veggie burgers are hit or miss for me, but you can tell this was homemade. The fries are delicious - the seasoning is next level. The staff is also super friendly. One tip - if you are going before a show, go as early as possible - it gets crowded!", "author": "Ali C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}