{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-01", "description": "Stopped by for a few drinks and enjoyed the atmosphere.  The spot has lots of comfortable seating, ideal for groups, and a cute backyard.  \n\nThey have a nice beer selection and plenty of cocktail offerings to choose from.  Their happy hour is long but not exactly cheap.  I certainly took advantage of the $1 off drafts, but with beers being $6 - $7 to start, it didn't exactly blow my mind having $5/$6 drafts.  Happy hour to me should hover around the $4 mark for drafts - just my opinion.  \n\nThe food was really good though!  We tried the french fries, which were delicious, as well as the fried pickles (yum!) and guac/chips, which were tasty and plentiful for sharing.  The jalapeño poppers looked great, but I couldn't partake due to an allergy.  \n\nOverall, it's a super cute spot with a really great laid-back vibe.  I would definitely come back and enjoy a few drinks with friends.", "author": "Jaci H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "A fantastic neighborhood bar in Boerum hill area. Located super convenient to Atlantic terminal and Barclays (my go-to spot for post Nets games). Very intimate, the staff is really great, and they have a nice mix of alcohol. They even have my favorite japanese whiskey! During sporting events, the staff puts up a big screen to watch, and they have the ever important backyard space. The food is spot on, and the fried pickles are excellent. I wish i lived closer to it!", "author": "Ray C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "The kind of place that made me wish I had reasons to return to Brooklyn on a regular basis. Had one of their signature cocktails made with Pimms (which I've never had before and you don't find very often out in the burbs). It was really refreshing on a warm, humid summer evening. Definitely a return visit is in order if I ever go to the Barclays Center.", "author": "Ron P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-07", "description": "Terrible service. Took 45 min to get our order at 2:30 in the afternoon, after I had to get my own beer since the waiter forgot it. One lone guy in the kitchen going back and forth to re basement, one negligent waitress and one annoying bartender. Staff up right or go home.", "author": "E K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Cool bar to chill and have a few beers. Get very busy on a Friday night!", "author": "Sil A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "First time in Brooklyn, stumbled in at 1 am on a Sunday night after a long flight from Seattle. The kitchen was closed but they served us some of the best guacamole I've had in a long time. The bartender gave us some recommendations for dinner while we were in town, including Rucola, which was as promised, AMAZING. Drinks were excellent, as was the conversation. Diverse and friendly crowd. We came back the next night to another set of staff that was equally personable. Thanks for making strangers feel welcome. We'll be back.", "author": "Sandy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Went on a slow Thursday around 4pm cause I desperately needed a charger and to use the bathroom while thifting. The bartender Jean met me inside and introduced me to a solid 12-7 happy hour, $5 margs. Also got a solid quesadilla, recommend this place 100%, solid food, solid/personable bartender, and super laid back environment. On my third marg now getting ready for next spot.", "author": "Daniel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Gene aka Joaquin is the best server. Always friendly and nicw. The pickle backs are delicious   A+ chicken wings. Perfect place for after work.", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "This place has great prices, and a chill atmosphere. I went on a Saturday evening and it wasn't too crowded. There is a patio but it was really hot so we didn't go out there. A lot of people have complained about the kitchen, but I didn't have a problem at all. I ordered a BLT and my boyfriend ordered a chicken quesadilla, and they both came out correctly and quickly. The drink specials can't be beat. I got a $5 margarita, which was quite strong, and my boyfriend got a Narragansett and a shot of well whiskey for $6. I would definitely recommend Hollow Nickel.", "author": "Emma F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "Great little spot. Good atmosphere and friendly servers, plus a fine happy hour.\nThe kitchen was backed up when we went, so we had our drinks and left. But I would definitely return to try the food and sit outside.\nIt's three blocks or so from Barclays Center. A good place to meet up and have a few before the show.", "author": "Ed Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "Quaint, cute, dark little wood-grain joint on Atlantic Ave near the Barclay Center. Probably the best bar of its type in the area (locals are gradually losing out against the wave of corporate-chain bars and commercialization brought by Barclay's). But this is a pub that still has its 'regulars' and is making new ones frequently. VERY clean, neat, and swept. No dust anywhere.  \n\nNo jukebox, but there's a sweet little backyard and there's also a bookshelf of used books. More bars should have this. Bring in a couple of paperbacks you've completed and pick up a few new ones to walk away with. \n\nOverall, quite a fun interior: magically, the tables and booths are designed and arranged in such a way that allows people to circulate and for diners to 'nestle closely together' without feeling cramped. The 4-top tables are also very compact, though still comfy for a group. And the deuce tables have the perfect dimensions. You can talk at normal volume without feeling as if your conversations are intruding on other tables. Other pubs should take note! \n\nFood: creative/classics. Hearty portions. Extremely well handled. Particularly well done are the fried dill pickles. A crispy, munchy, tart, treat. Draughts: 4-5 mixture of imports and craft brew. \n\nPrices: very reasonable. No sticker-shocks.\n\nService: here is where there's a *slight* letdown. A busboy from the kitchen is the only food runner; not a real waiter and there's often confusion because the bartender takes the orders at the bar. The resulting confusion means that you can wait a while for your food, and it may get sent to the wrong table.\n\nCrowd: scruffy but convivial. Pseudo-chummy. \n\nBathrooms are well-tended to; you can see that someone is on top of germ issues. They're obviously scrubbed (with good strong bleach) every day. \n\nThere's coathooks under the bar--now that is a very welcome touch. Its amazing how many bars overlook this touch.\n\nKey fact: this is perhaps some kind of LGBT bar? It may not be apparent at first. It's a friendly and clubby atmosphere in general--good for everyone, either way--so no reason to give this aspect any concern or regard. Its a mellow and toasty place to get a buzz on.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Went there before a show at Barkley's. People very nice. Food good. Air conditioning was very bad. Would go back but not in the summer for a quick meal.", "author": "Andy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Excellent space, very friendly staff and great food! - I had a veggie burger, it was very good and the fries were perfect. I would love it as my local, it's a very well designed bar with a large outdoor space too.\n\nBravo!", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "I love this place! Great atmosphere, food and the draft beer selection is fab.\n\nOh! And the garden makes it even better. Beer is always better outside :)", "author": "Patti S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "The hollow nickel is the shit. I seriously love this place. My girlfriend found it randomly through Yelp, and we keep coming back. Doesn't matter what the original plan is, we always end up here. The staff is super friendly, and they have a great craft beer and cider selection. The food is great, especially the grilled cheese! When you come here, make sure you get a pickle back shot, they're brutal but amazing. I LOVE THE HOLLOW NICKEL! I'll be getting a t-shirt soon.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "A great bar located on Atlantic Avenue. Went to this bar shortly after Atlantic antic and still was able to have the six point Atlantic antic beer.The bartender was friendly, enjoyed conversation and polite. There was a fresh indoor ambience that was interesting and woodsy. The back area was a little mosquito driven but still a fantastic set up and very relaxing.", "author": "Beer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "I've been to Hollow Nickel about a dozen times since it first opened. It started out a little rough around the edges (I can't even say why, I just didn't love it), but it has grown on me by leaps and bounds. A nice beer selection, decent happy hour, great food. I find myself drawn to it whenever I'm trying to figure out a good place to go with a group: the space in the back, as well as the relaxing backyard, are perfect for groups. A few weeks ago we managed to get a group of 14 in the back space comfortably. Even though it was a busy Friday night, the bartenders managed to get everyone served politely and promptly. I'm glad I kept coming back!", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "I came here for brunch with a friend. I enjoyed the breakfast burrito. My friend liked the scrambled eggs and loved the \"home fries.\" Very cozy spot with friendly staff and delicious food. I'll definitely be coming back.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Great bar for a low key night with a group of friends. Head straight to the backyard for that chill Brooklyn ambiance. \nPros:\n- cute rustic decor\n- very affordable (had a burger for $12, sangria for $8, they had specials going on like a shot \u0026 a beer for $6)\n- great food\n- you can very well hear each other even on a Saturday night, which not many bars offer\n- also on a sat night it was not extremely packed, which made the experience a lot more pleasant\nCons:\n- the only thing I wasn't a fan of is that there's no waiter service - you have to go to the bar every time you want to order something.\nOverall, very much recommended!", "author": "Tanya C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "Weak and weary from too much gaddamn fun, we stumbled upon this place, lured by the $5 margaritas sign. (They have other $5 drink deals too whuuutt). They have a magical backyard oasis, and the guac and chips were surprisingly delicious and rather sizable. If I lived in the hood this would definitely be a regular hangout. Shoutout to our lovely server who teaches kids about hiphop!", "author": "Cristina D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}