{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "Stop by for lunch. Burger pretty tasty and sweet potato fries were yummy but a bit upset with the honey mustard. It had a weird taste so settled for bbq sauce which went well with my tasty burger. Service doesn't exist here and you have to get up to order, ask for things and even pay. So a bit from the norm but nevertheless if you're here to drink then the bar is a good option. The bartender is ultimately everybody's waiter.. but good atmosphere, awesome location so I would return again!!", "author": "Alaina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Great place to grab a drink and some bar food.  It gets pretty full at random times but I've never had a problem getting a seat/service. They have good happy hour deals and shot deals (beer and a shot, pickleback shot deal, etc.) and a great selection of whiskey.  The bar food here is pretty satisfying, and I sometimes find myself craving the chicken fingers.  If it's a warm day, you should definitely check out the backyard!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "This is a review for food only! In short, food took too long to come out (almost 40 minutes for 3 plates) and food did not taste good.\n\nCame here right after a Nets game to grab a quick bite. But little did we know our quick bite was gonna last over an hour. Got here around 1015pm with 2 other ppl. We ordered quickly at the bar, 2 (cooked medium) burgers with fries, and a shepherds pie.\n\nThen we waited, and waited and waited. 30 minutes in, we asked the bartender where our food was, and he's like it's coming out. 10 minutes later (past 11pm already!) the 2 burgers come out and they were definitely NOT cooked medium. Both burgers were too done, and the outside of the meat was all burnt. It was so dry and we were not happy with the burgers, but we were hungry and it was getting late, so we ate it anyway. Fries were overly salty. \n\nMy shepherd's pie came several minutes after the burgers. I've never really ordered shepherd's pie before so I don't really have anything to compare it to, but it was not good. Basically it was mashed potatoes with ground up slurry of meat. The taste was just alright. \n\nFyi, think there was only 1 cook in the kitchen so that's probably why it took so long, but nonetheless, I'm still giving it a 1 star review cuz I had a 1 star experience regardless of the conditions.", "author": "Ada W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Came here to check out a bar with food. Cool little spot with decent drink deals. I stuck with the shot and a beer (Narraganset \u0026 Evan Williams for $6). We tried the nachos which boasted homemade chips. I don't know if they were homemade but, they're delicious. Someone else complained theirs were cold. Ours were warm but, could of used more time to melt all the cheese. Their salsa also tasted like there was pickle juice in it, not into that. Also had the tenders which were very crispy and were great. Affordable prices and so far everything g was good. Good amount of seating in the back, still small place though. Staff was very pleasant as well.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "Cute, friendly little bar. Went here to grab a quick bite and drinks before a concert at Barclays. The food is just ok... Burger was pretty good, chicken tenders were not good, fries with cheese were great! Drinks were good and the service and ambiance were great.", "author": "Talisha H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "Causal hang out spot, looked pretty popular. Small bar, you have to order everything from the bar. They have a backyard. Very casual and chill. Bar staff was decent.", "author": "Justin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Fun\n\nNeighborhood bar.\n\nGreat, friendly staff!\n\nEasy place to meet friends, relax and enjoy!!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "This was a bizarre experience for brunch on a Saturday...confused our order, overcooked a burger, acted like they were really overextended when we were one of two occupied tables, and were just all around kind of rude...", "author": "Mary E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Love the vibe here and the buffalo wings were the perfect late night snack! The cocktails are unique and prepared with care. \nDefinitely check this place out if you're in the Fort Greene area.", "author": "Liz K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "Stumbled into Hollow Nickel on a rainy Sunday when we were in need of shelter from the rain.\n\nFood is about three stars, but the service pushes Hollow Nickel to four stars.\n\nThe ordering (at least on a Sunday) is DIY, but we didn't mind with Abbey's friendly demeanor. :)\n\nProtips:\n$6 Pickle back shots\n$7 beers on tap\n\nGood rock and roll tunes as well.\n\nThanks for the great service, Abbey. We enjoyed staying dry with you!", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "I came here with a group of eight people before a concert down at the Barclays Center.  We made it in time for happy hour and were able to find seating out back under the string lights at a longer picnic table.  I would recommend this place for a happy hour or their $12 burger and a beer special.  \n\nA lucky find for a pre-concert pregame.", "author": "Paula C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Came here for some beers and an early dinner with some girlfriends during happy hour. Tried the grilled cheese and chicken tenders. My friends had the quesadilla and blt. Portions were great for the prices. Really no complaints. They have a backyard that's a pretty nice spot to just have some drinks with friends.", "author": "Lolin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Great neighborhood bar. Everyone is very friendly. Good wings and fries. Still working my way through the menu.", "author": "Dudley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Stopped here for the burger and beer special before the Lakers/nets game with my son and had wings for appetizers\nExcellent service\nVery reasonable\nWould definitely come here again", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "Hollow Nickel has two things that make a great bar - a good whiskey selection, and an amazing backyard. I've passed by this place many times while walking home and never really stopped in. But I had some time to kill and decided to take the plunge.\n\nThey have a very respectable whiskey/bourbon/Scotch selection, all for very reasonable prices. Laphroaig was $12 and Blanton's was $13. I've definitely paid more for both.\n\nThe backyard is pretty huge. It's nicer than 4th Ave Pub and is a lot more open. Great place to be during the spring or summer months.\n\nSad that it took so long to get my ass over here, but I'll definitely be returning!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "This place is super Brooklyn. Cool, cozy bar with an even cooler outside seating area with mismatched furniture. \n\nThe bar gets a tad busy and it could take a while to get a drink. \n\nI ordered a cheeseburger and thought it wasn't half bad! I enjoyed the fries too, they were sprinkled in coarse pepper.\n\nThe service was friendly.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "A very cute Brooklyn bar with a large choice of beer.\nWe sat there for a pint stayed for 4 hours.\nVery friendly staff !", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Hanging out at Hollow Nickle with both cousins and friends having a good time great atmosphere.", "author": "Phillip A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Good and affordable option near Barclays. My dad had the grilled cheese and I had the chili and both were really great! I love that they have beer specials and beer-shot combos - always a plus before a big game:-) I absolutely will be back!", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Was going to see Iron Maiden on a Saturday and we decided on going to this place for food and drinks beforehand. We luckily got a seat inside. They have several choices in beer aside from the usual beer choices, not vast, but I'm sure everyone can find something they'd like.\nAs for the food, took slightly long to come out, but it was worth it. The burger is above average in my opinion, and their fries were very good; so good we ordered a second order. My gf got a buffalo wrap, which was good, but for some reason, had cucumber in it. Other than that, it had good flavor.\nAtmosphere that day was a bunch of metal heads, but I'd return as i like the divey look. Also has a backyard.", "author": "Edward R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}