{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "I love this place. Great vibe, usually good music--i once walked in on a Spice Girls homage, and then onto Prince and the best of the 80s and 90s. Perfect. The burgers are great.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Love this place. It has indoor options, inbetween option with open mic and a garden!  It is a relaxed neighborhood bar atmosphere.  Burger and beer deal is awesome.  Love having it in the neighborhood for a chill night out.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Went to Hollow Nickel for some pre-concert drinks and grub (first time). \nAwesome backyard garden. Great happy hour specials. Large beer/whiskey menu. YES!!!!\nThere were some initial concerns with the service and delays getting food out. When these concerns were expressed, the manager treated us very kindly and addressed our concerns with total professionalism. The atmosphere was wonderful, the food was delicious, and the prices were great! What started off as a rocky night was completely reversed by the professionalism and grace of the manager (and hey, who doesn't have an off night now and then, right?!?). I would definitely go back and recommend this place for happy hour, dinner, socializing, etc... AND THEY HAVE A LARGE GARDEN! SCORE!", "author": "Karyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "Came here randomly after work with a friend one day just to grab a quick bite and drink. I was skeptical but I had to try out the place since all the reviews seem to be so great.\nHe ordered a burger which he said tasted good but he's a big eater so the burger which turned out to be a slider was quite small but tasty nonetheless. I ordered some sweet garlic wings which were pretty good.\nI'm a real critic when it comes to my mojitos but i ordered one anyways just to give it a try. It turned out to be pretty AWESOME! \nDefinitely a nice, cozy, chill spot. And I must mention again, GREAT MOJITO!", "author": "Willz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Great atmosphere and bartender. \nAte casual business dinner, average burger, very good poppers.", "author": "Douglas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great neighborhood Bar.  Perfect before or after Barclays as well.   Bartenders are friendly and the drinks are spot on.", "author": "Erich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Greatest apple martini in town. The manager is super friendly and really understands hospitality. Fully recommended!", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "This place rocks!!!! Bartenders are super friendly and the prices are amazing!!! $5 for a well whiskey (which is Evan Williams and old overhault) and the food is really good!!! I had a burger that was cooked perfectly. Didn't feel bloated after eating a burger and fries. The manager Travis was very attentive and informed me the kitchen staff is new so he wanted to know how they were doing!!! I am going to come here all the time now!!! I recommend this bar to everyone!! Super excited to come here again!!!", "author": "Ricky J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Great beer!!! Love the backyard. It a great place to enjoy a spring day!!! Some of the best burgers you'll get in Brooklyn.", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Love the Hollow Nickel's craft beer.  They have a rotating selection so you can always try something new!", "author": "Jason N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "The Hollow Nickel is my first stop every time I make it into the city.  Amazing backyard, food and staff.  Where else in the city can you get a burger and beer for $10.00 that taste amazing?  Stop by the Hollow Nickel and you will not be disappointed!", "author": "Trisha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Great service, very cool vibe, good location. I didn't get to check out the outdoor setting or the food, but I'll definitely be back. Drinks aren't overpriced either.", "author": "Jameson S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "First time here -- the brunch is great for $12 you get an entree and a cocktail/drink. They also have a backyard and super close to Barclays for pregaming:)", "author": "Melissa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "My favorite Brooklyn pub. Great bartenders, great atmosphere (complete with secret passage behind the well-stocked bookshelves), backyard if you want to be outside, cozy nooks if you want to curl up inside. EAT THE FRITO PIE. Thank me later.", "author": "Jana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "We had a fun time at this bar. Reasonable prices, friendly staff, cool interior - we'll definitely be back.", "author": "weldoris b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "My first experience at Hollow Nickel was pretty perfect, and I can't wait to return. My fiance and I hosted our engagement party on Saturday May 4th, reserving the back part of the bar ahead of time with about 25 people or so. Working with Lori to arrange everything, Hollow Nickel offered us incredible flexibility and just made it as nice and easy as possible. The night of the party could not have been better. First off, the bar is gorgeous, and their back room was just what I had pictured when looking for a casual but elegant place to host our event. When we arrived they had put down reserved signs and candles on the tables that were ours, and introduced us to our server for the night. Our server was absolutely awesome! He took care of our large group all night (about 5 hours) without a hitch, and was lovely to each and every guest (so much so that all my friends are still praising him!). The bartender also did a fantastic job because every drink was perfect (not too sweet, not too stingy on the alcohol). About midway through the night the kitchen surprised us with enough complimentary fries and chipotle mayo on the house (which could not have come at a better time). \n\nEveryone was so lovely, thoughtful, attentive and overall just made it an awesome experience for us and our guests. I would recommend Hollow Nickel to anyone in a heartbeat!", "author": "Ivy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "As a neighbor near by, I am into this place. Very nice dark ambiance. Good vibe. Good selection of beers. Fairly priced at ~$5-6.\n\nOwner seemed like a great guy. Used to be the old Flying Saucer Café, I assume they have a backyard like Flying Saucer did, but I didn't get it out.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Great Craft Beer Bar! Great Food, friendly \u0026 knowledgable staff! May be my new local spot.", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "Just waited close to an hour for an order of chicken fingers, and I never even got them. Worst service I've ever experienced. And to top it all off everyone in there had an attitude.  Fuck this place.", "author": "Zane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Amazing service, amazing brunch. The French Toast was delightful. Atmosphere was really cool. Stood around for the game and later had the amazing wings.  Owner Dan and Bartender Travis is really attending to everyone.", "author": "Jimmyrod1978 .."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}