{"aggregateRating": {"reviewCount": 202, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Backyard is perfect, drinks are reasonably priced, bartenders are a delight.", "author": "C W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "Dive bar with a nicely orange-string-light-lit backyard, an exuberant bartender, quality beer list, hefty bookshelf of assorted books for borrowing, and an overall comfortable feel. We enjoyed sitting in the backyard, which was quite spacious. Though we'd already eaten, we glanced at the menu, which included dive bar standards like chicken fingers; other patrons scattered around the place seemed to be enjoying their selections. Seems like a good spot for a casual meet-up and a beer.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Delicious food. \nGreat ambiance. \nOrdered the nachos with everything on it\nand the chicken quesadilla.\nGreat selection of craft beer as well.\nNice little shin dig.\nI'd go here again, and maybe bring a bunch of friends too.", "author": "Harry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Stopped by on a Saturday afternoon. The place was almost empty. Quiet, relaxing lunch. The food was excellent! Burger, fries and wings. My husband said the fries were some of the best he's ever had!", "author": "Tiphanii M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Here's a list, in no particular order, of things I really dig about this place:\n\n- It's never crowded. Admittedly, I've never gone on a Saturday night, but every time I go, it's practically empty which means I get a seat and good service and I can talk to my companions in peace. I'm sure the owner would prefer it to be full all the time, but this is my perfect vibe right here.\n\n- The drink selection. Not the craziest most obscure craft beers, but you can definitely get something better than Stella or Guinness. Plus they serve this one brand of cider I love that for some reason I can't really find anywhere else, so good on them. Prices are decent.\n\n- Food. Pretty good for basic \"pub\" fare, especially their vegetarian options. Prices are fair.\n\n- Happy hour on weekends. Self-explanatory.\n\n- Killer backyard. Lots of seating, quiet, tons of shade, not swarming with mosquitoes. Like, I live 5 minutes away and have my own private yard, and still sometimes I'm like, \"I wanna go hang out in Hollow Nickel's backyard.\"\n\n- Service. Friendly, funny, quick, they remember us even though we're semi-regulars at best. I like these dudes a lot.\n\nOne star off because once my veggie burger was kinda dry and the margarita is really nothing to write home about. But really this is more like 4.5 stars, because I'm THAT person on Yelp, and I really do like this place a lot.", "author": "Kate Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Excellent choice for a bar if you have some time before going to an event at Barclays just up Atlantic Ave, or if you just happen to be in the area! Casual and reasonably priced pub-style food, good selection of drinks (and $1 off well cocktails until 9pm). I recommend the black bean burger! Surprisingly tasty.\n\nService was a bit slow. Our waitress was the only one handling the entire front of the place, plus also helping man the bar. \n\nCurious to try the outdoor garden in the warmer months!", "author": "Mike N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Nice bar and restaurant in the BK, close to the Barclay Center, which makes it nice to go after a game. Prices are relative cheap compare to other bars in the area and the city. \n\nI had the ommegang witte beer, which was really good and the wrap. The beer was $6 and the wrap with fries $10. Bill came to $16, taxes were already included I believe. \n\nGreat place! I would like to give another try for the nachos and the burger to see how they are. \n\nKeep up the good work!", "author": "Jose J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Omg. I'm in absolute love with the Hollow Nickel. I've been here a handful of times and I will continue. Every time I've come it's just as great as the last time. I love the bartenders they are so sweet and funny. Logan is great and so is another one that I sadly don't remember his name. He wears a hat and has an awesome beard. \n\nPickle back shots are where it's at and if you don't do one then I am sorry. \n\nGrilled cheese is the perfect post beer meal. \n\nIt's just such a chilled out spot and it truly is the ideal bar for me. I always love trying new places but honestly, I always end up here and really wouldn't want it any other way. \n\nMoving to Brooklyn has been such a great experience and the Hollow Nickel will truly capture my love for living here and being a Brooklynite.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "This place is a solid choice all around. Found it here on yelp \u0026 the rating didn't let me down. \n\nWas with a group of friends \u0026 was sold on the backyard patio. Pleasantly spacious with great bench seating on one side to maximize the area. Atmosphere was super relaxing. If weather permits, DO THE BACKYARD! \n\nDrinks flowed thanks to their $6 beer \u0026 shot special. Your choice of a beer \u0026 tequila shot or beer \u0026 whiskey shot. We went with whiskey \u0026 loved it. Best surprise was the food. Looked great, tasted even better. The LGBT (Lettuce, Guac, Bacon, Tomato) sandwich is awesome. Their wings are standard bar fare, but again totally worth it.\n\nYou order at the bar, grab ur drinks \u0026 a numbered robot to wait for food delivery at your table. Can't get more simple than that. Will definitely be back again when in the area. Another round of shots!!!!", "author": "Rick R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-26", "description": "Very very very long wait for jalapeño poppers, fried pickles \u0026 chicken strips... Over an hour wait on a Tuesday", "author": "Rosana F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "A fun no frills kind of bar; great for catching up with a friend. Very low key vibe. The black bean burger is worth a try! Above all, it's the patrons that make this place enjoyable in general. A variety of different people seem to frequent this place and most are easy to strike up a conversation with. I do think you need to order food and drinks (possibly?) at the bar even if you're not seated at the bar. Happy hour specials are on the average side and kind of limited, but still ok!", "author": "Steve S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-03", "description": "bought my friend here for her retirement we had a nice time. We got there around happy hour which was cool and self serving, so you had to go to the bar to get your drinks which was fine. Drinks were between 5 and 8 bucks. Margaritas were tasty, nachos really good. Eventually a server came and would clean the table and replenish drinks. I can see myself coming back here again. they had a back door area as well.", "author": "T H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Love this place. Great decor, friendly bartenders, cheap happy hour, and delicious food. What's not to love? I had a $5 margarita and yummy fish tacos. And my friend and I sat there for like 2 hours afterwards just talking and drinking water, and they had no problems at all with that.", "author": "Abeer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "We enjoyed dinner and drinks outside on the Hollow Nickel's back patio this past Friday evening. It's a casual place with a variety of beer options and comfort food choices. We enjoyed the massive burger and the sourdough grilled cheese, with the seasoned fries (so good!!) and the salad respectively.   All were well done and portions were very generous. Service was friendly but generally they encourage you to order at the bar as there is only one server that rotates around the restaurant and patio. Prices were very reasonable for the neighborhood. Great place for a bite before or after an event at Barclays (a couple blocks down from it along atlantic). Worth the visit!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "We stopped in before the Motley Crue concert at Barclays (obviously) and I will say I was super pleased with the entire experience.  It had the feel of a cool, rock bar, but wasn't grimy and the food was great.  The jalapeno poppers were the clear winners (they are like giant fried balls filled with cheese and spice deliciousness).  We got nachos, which were also great.  The beer selection was on point, servers were all cool and easy and attentive.  It wasn't mobbed,  but had it not been raining I would have loved to sit outback.  This will become a go-to for me for sure.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "I was a bit let down by my recent trip to Hollow Nickel. We stopped in around 9pm on a Friday looking for a low-key night and a casual bite. It was way more crowded than I was expecting, so there wasn't really a place to sit. I also hadn't anticipated such an off-putting crowd. Within minutes of being here, I had a menu swiped off my table and then someone else stole a chair we were using as soon as my boyfriend got up to place our order.\n\nI went with the burger and beer special ($10) which is quite a good deal, even if the beer is Narragansett. The burger comes with cheddar cheese, lettuce, tomato and onion. Even though it was a little dry, it was still pretty good! It didn't come with fries, but my boyfriend's chicken 'wich did. I had a few bites and it's a decent sandwich. The fries were probably my favorite part of the meal. They were crisp and flavored with pepper. Maybe appetizers are the way to go.\n\nThe beer selection was unique. Not a large variety of beer to choose from, but they seem to go out of their way to have out-of-the-ordinary brands on tap. Prices were average.\n\nTL; DR: Hollow Nickel is aighttt.", "author": "Steff L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "This place is really cute with a huge back yard, easy-going atmosphere and nice bartenders. \n\nStand by the bar for a rowdier experience or go to the back where they have a couple tables intimately nested. \nThey also have 2 4-seater booths opposite the bar that keep you in the action but let you sit and take a load off. \n\nI've been here with friends and co workers, but it would definitely be great place for post date drinks or a big crowd of people.", "author": "Dharini P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Just had drinks and appetizers so I'm not going to talk about what's exactly good to eat, but the guacamole was super tasty.\nGreat spot with a LOVELY BACKYARD (which makes it reach the 5*!) - you gotta love it! Decent wine and nice staff. Thumb up.", "author": "Charlotte G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "I try to be fair with my reviews. With that being said after a leave a not so good review and the manager or owner of an establishment reaches out to me to rectify the situation I appreciate that. Once that happens I give the establishment the benefit of the doubt and not hold them solely responsible for when their staff may be having a not so good day. This particular owner reached out to me immediately after my experience with his establishment and even gave me his personal cell number. How's that for excellent customer service? I may or may not be in Brooklyn any time soon because I was a tourist during this visit but if I am I'll definitely reach out to him and give his establishment another try.", "author": "Teneka W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "Good brunch food but since nobody else was there and we sat out back, the service was very spotty. Would recommend sitting at bar or at least inside for a meal so they don't forget about you.", "author": "Mara P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Hollow Nickel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "494 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ADPKC9W6yy7UgdSVezacZg/ls.jpg", "@type": "Restaurant", "telephone": "+19292261966"}