{"aggregateRating": {"reviewCount": 18, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Came on a rainy Friday night and all the seats were full, my party of three sat at the bar. This is a cute and long space, the back has more seating that can't be seen in the back. They also take reservations. \n\nWe started with the monkeyball and hash potato jeon. If you're a fan of hash browns, this rendition of a Korean pancake using hash browns is for you. The monkey ball is a ball of spicy tuna stuffed on top of a portobello mushroom coated in tempura batter and deep fried then cut into pieces and drizzled with sauce. It was flavorful but I'm not sure if I'm a fan of my spicy tuna partially cooked.\n\nThe spicy miso ramen was super spicy! Very tasty, I would definitely recommend to people who like their ramen on the spicier side, they use a thicker type of ramen for this. Their cheese donkatsu was presented very nicely they give you sesame to ground yourself to put into your tonkatsu sauce yourself. I had the seafood tteok boki which is their spicy rice cakes, it comes in a hot stone, so beware the temperature stays hot for a while, I had to scoop it onto another plate to cool down. A decent amount of seafood, you definitely can taste the spice. Everything was super flavorful. I will be back, their cocktails sound good as well, definitely want to try one of those!", "author": "Lolin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "This place is definitely worth checking out!!! \n\nIt was a lot bigger than expected, with a good number of tables, even a small back with more seating. The back area could make for a nice spot for a big group. \n\nReally appreciate interior decor. It was modern, tasteful, with Korean flare - fun but not tacky lol\n\nService was good and friendly! \n\nFood! \nSo I have it 4/5 stars total because all the appetizer were ok, but the entrees were very good:\n\nAPPS\n- tempura: wasn't so crispy :T (SKIP)\n- pork belly: not bad, 5/6 pcs w a salad on the side. Wasn't really anything different than straight up just cooked/seared pork belly (A-OK)\n- potato hash: got a nice crispy bottom, but also nothing too unique or special (SKIP)\n\nENTREES\n- seafood dobokki: good portion! Good amount of seafood! Very flavorful! (ORDER)\n- chicken cheese katsu: imagine a mozzarella stick. But wrapped around cheese is chicken. So like a chicken cordon bleu. I thought it was executed well, def satisfying fried foods. Imagine little kids would also love, very familiar (ORDER)\n- kimchi fried rice: maybe best kimchi fried rice we've ever had!!! (MUST ORDER)\nThe kimchi fried done very well! With good amount of kimchi and flavor. The hot pan made the bottom crispy. It's cooked in the center, and surrounding it is like this golden river of cheese and egg!!!!!!!!!! So having a bite with some rice, cheese, egg - was super on point. I would come back again just to order this dish", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Loving this new addition to Cobble Hill! I've been on a hunt for good ramen spots and this restaurant did the trick for me.\n\nI came on a weekday around 7 and it wasn't busy. I sat at the bar and was immediately checked on and served. The bartender gave me some suggestions on the ramen options and I ended up going with the Tonkotsu ramen -- a very solid option. The broth was really creamy and rich and I loved the mix of pork and veggies. The noodles were a little more thin than I typically like, but the bowl was still very plentiful.\n\nExcited to come back and try more!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Came by on a Saturday night and was packed. Hands down the best Korean / Japanese fusion restaurant in cobble hill, borum hill area. Ssam used to be the only place I go to but so happy for Ichiba  cuz everything was so good and great value for the money.\n\nI had the monkey ball $10, chicken wing $9 as appetizer and then the cheese tonkatsu and spicy miso ramen, I believe both were $15 each. Food here is incredibly fresh and very good flavors. If you are very hungry I suggest the spicy miso ramen or the bimbimbap. I never had braised beef with japanese ramen but my gosh they were so tender and flavorful, also generous portions.\n\nCocktails are $12, thou I didn't drink tonight but my friends did like them.\n\nRestaurant is very cute and love the music selection. Keep the music pumping, love the liveliness of the place.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-22", "description": "I really wanted to give this restaurant more stars but they need some more work to earn them. \nService was okay, friendly waitress, on top of cleaning and running food. Quick service. However waitress never checked on us after we received the food, we would have told her that we were unsatisfied. Everything was over cooked or burnt, the squid was all black and crispy without flavor. All of our entrees came in sizzling burning hot, we had rush and put everything in the plates because it was burning the food. I been to many restaurants like this, food comes out burning hot and it cools off but not here. It kept on burning and burning and killing the experience and flavor. Please work on your kitchen.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "Pretty good Korean bar, I thoroughly enjoyed the kimchi fried rice. It was smoking hot and super flavorful. I also had the soft shell crab bun which was just okay... the bun itself wasn't very impressive. However, there are many options on the menu that I must come back to try, looking forward to it!", "author": "Keturah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "I think it's a new place in the neighborhood, so we decided to try it out . The atmosphere is very nice and modern with music playing on a background. \nWe started our dinner with buns with soft shell crab , the crab is cranky with juicy inside, bun is fluffy and complement crabs nicely . We also got monkey ball , which is fried portobello mushrooms staffed with tuna , very flavorful profile . Finished with tuna salad in which the tar of the dish is dressing, wish tuna was fried/grilled differently. For the main course we got seafood with noodles , delicious , I asked for spicy one cause I like it like that  ( be careful if you are not really a spicy fan) . And we tried beef steak with rice , also full of flavors . We definitely come back one more time for dinner", "author": "Aleksandra E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "I really want some good korean options in the area and So I checked them out for dinner and it was so good and it's decently priced for the area. I enjoyed the flavors in the dishes we ordered: soft shell crab bun, golbi beef, and the spicy pork bimbibop. I definitely want to come back to try their ramen next! I do like their interior decorations too.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Great food, atmosphere and service. The potato pancakes and tempura appetizers are yummy. Ramen and bibimbap are great mains. This is our second visit and we will be back again and again. Love the new spot. Both of our cocktails were very good too!", "author": "corissa m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "Pretty decent casual Japanese and Korean food. Ordered grilled eggplant that taste like uni, super yum. Kimchi fried rice tastes super authentic. Park katsu will give you fresh sesame to grind and add to the sauce. Will come back for more food.", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-07", "description": "Over an hour for delivery. When I called about the order, the person on the other end of the line hung up on me. If you're looking for delivery, this isn't the place. Food was tepid and meh.", "author": "DA W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "I could not find one thing I did not like about this place. My husband and I stopped in for diner midweek. The decor - dark, woody, rustic with a touch of steampunk - is just on the right side of fancy. It is pleasant to be inside. The cuisine is mostly Korean asian fusion ish.  The food was absolutely delicious.  We had the potato pan cake, glass noodles with mixed sea food and ramen noodle with spicy ground chicken. The very pleasant waitress was kind enough to warn us that the ramen will be spicy, but it was also so full of flavor. The staff was great. Always there when you need them but not intrusive. At one point one of the waiters scooted by and delivered a few extra napkins - before we could ask for them - because he noticed we needed them. And the chery on top was the bill...it was half of what we normally spend on a diner this size in this neighborhood. Great place for a just-because dinner or when you need a nice restaurant to take someone to.", "author": "D P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-20", "description": "A potentially great restaurant but a few recommendations:\nFood - Excellent. Luckily the highlight. \nService - Quite poor. Extremely slow. Seems like there was a lot of take out which slows down the kitchen. And if you seat me at the bar for dinner and multiple tables open up, ask me if I'd like to sit at the table. Last, don't ask me if I'm done with my food when I'm actively still eating. I waited long enough for the food why are you rushing me?\nDrinks - Trying too hard. Work on quality and less on cute names for cocktails. Also, a whiskey sour doesn't need a straw. None of your cocktails needed straws. \nMusic - Tone it down. I want to eat not do ecstasy. \nDecor - Fine. But undercut by the service.", "author": "Riri R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Happy to find a good Korean spot in the area. Think modern/fusion with a good bit of Japanese on the menu. Started with the seafood pancake (excellent) tempura plate (good) and tonkatsu ramen (very good) and seafood tteokbokki (decent but least favorite) as entrees. Very good overall and authentically Korean. Would recommend and will come back.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "Great meal in Brooklyn! Spent the weekend checking out colleges and found this gem for takeout! Great price, service!", "author": "Rosemary L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "A welcome addition to the neighborhood. I have been craving the shrimp potato appetizer ever since I had it. And the ramen dish I tried was also very good. The \"fire chicken\" was a solid 3-4 on the fire scale (out of 5) - not for someone who doesn't like spice. Will definitely come back and explore the menu further. Didn't love the eggplant appetizer though. The skin of the eggplant was a bit tough. I have had eggplant at Japanese restaurants before and I prefer it to melt in the mouth a bit more.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "The food here is great. It's really authentic and fresh. The actual place is so cute and very aesthetically pleasing. It's a great place for a small group of friends or a date. I wouldn't recommend going with big parties because their table are really made for two to four. The decorations were honestly what really sold me. All of the walls are hand painted with beautiful designs. The prices honestly weren't bad. The staff was very friendly. My only complaint was parking, however it's New York, what can you do. Highly recommend the spicy miso ramen.", "author": "Alexis C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-03", "description": "The service was ok... the waitress was not attentive and never came to check on us.. I had to find her and continue to ask others to help me and my guest. She was nice to answer our questions about the menu and let us know there was a little wait to get our food which she quoted 20-25mins.. actually it took 45 mins before my food arrived. The drinks and cocktails are over priced The for the portion they give you.. no happy hour menu; when I finally received my dinner it was steaming hot but very salty and the the seafood octopus and shrimp were over cooked.. the noodles were sticking to the frying pan.. not a good meal with the total cost of $100 for two people. I don't mind spending money for food and drinks but it has to be a great quality and not mediocre cooking skills and bartending mixing was awful! I spend money one food and drinks all over NYC if very few places because it's worth my time and hard earned money! I won't go back to this place to try something else because they did not overall leave an good impression and I still left a 15% tip even though I felt the service and food was not to my standards!!' Please learn how to cater to real foodies and knowing quality over quantity for people who have no clue what's good cooking and what's not as I'm sure I could bring in a Japanese native and they would say they same as it's not authentic at all since I've had better cooking meals at a friends house than this restaurant. The floors were sticky everywhere when you walked in and all thru the restaurant.. the bathroom was clean so as a woman I appreciated that however the rest of the experience was horrible!! I ordered a shot of Good quality Bourbon  and she gave me a sip portion like for a baby and it cost me $14 which usually the glass is an actual shot size and this was not as I am a whiskey, scotch and bourbon drinker so I am fully aware of the sizes and portions a near drink should be!! They are over Rated perhaps because of location on Smith Street and they're trying to please the White Folks and Gentrification instead of creating quality food, a better mixologist with a better food atmosphere for a great dining experience. They won't get my money anymore again notice I tipped the waitress 15% of a $100 tab even though it's wasn't worthy Bc they can't say Black Folks Don't Tip Well!! We do but however we like giving our money to businesses that take time to care and put in quality work in the entire experiences.. #brownpeople love good food and quality service... their additional tip is #blacklivesmatter #qualityservice work on hiring better chefs and staff!!!", "author": "Lesley H."}], "servesCuisine": "Japanese", "priceRange": null, "name": "ichiba kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "196 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/fDXqJ0qDVK_FK8hwQhwH1w/ls.jpg", "@type": "Restaurant", "telephone": "+19292950148"}