{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "I'm not a big fan of Mexican food, but I met up with a few colleagues here, and we enjoyed a nice peaceful meal in the outdoor eating area. I liked how they had a sink for hand washing immediately upon entering the restaurant--really nice touch for a taco place, and any place with finger food in the city. \n\nFeel: social, hang-out spot, family-friendly \nFavorite order: seafood tacos (fish, shrimp, etc.)", "author": "Heart H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "These tacos are delicious. The chorizo had a great kick to it. The black bean and sweet potato was smooth and creamy.\n\nThere is one problem. The tacos are tiny. Wee little things. You will probably need to eat six of them. Which will leave your wallet very empty.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Amazing food we ordered half the menu. The staff so friendly accommodating. Best I've ever had cant think of a single complaint except I ran out of room in my stomach. Fish taco's are worth the trip.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Came here the other night after watching a movie at B.A.M. It was after 11pm so I was impressed that they were still taking people for dinner. At this restaurant they give you paper menu's to fill out, then your server comes and grabs the menu from you. I ordered a pina colada for myself , and then two chicken tacos and a chicken quesadilla for my boyfriend and I to split. The quesadilla was amazing and you could tell that cheese was real cheese and not that artificial stuff, we ordered a second one. The tacos for me were just okay. My pina colada was really good though. It wasn't your average frozen drink. It tasted like an actual mixologist used natural flavors and real coconut water to make the pina colada flavor so I order a second one as well. We wanted to try another taco to see if it would make a difference , so we order a fried fish taco but that taco was still underwhelming. If I do ever come back to this spot, it would be for the quesadilla and the pina colada. However, this restaurant is a taco spot so their tacos SHOULD really be outstanding.", "author": "Rasheeda M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "Wish this was better. \n-Service was pretty much non existent. \n-Waited 20 mins for a menu (even after asking)\n-Food took 50 mins from time of order \n-Food was luke warm when it finally arrived\nIt looked fun \u0026 cool, but the actual experience was very off putting.", "author": "Gianna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "The Tacombi empire has expanded to Brooklyn, setting up across the street from BAM. This new location is on the smaller side, and I could see it being busy during peak hours, but I grabbed some mid-day tacos with friends during the week and it was pretty empty. The decor is a little more bare bones than other Tacombi locations, but there is also a cute patio that offers some outside seating. I went with the crispy fish, al pastor, and carnitas tacos. The crispy fish is usually my favorite taco to get at Tacombi, but it tasted a bit off this time around. The al pastor and carnitas were spot on. We didn't get drinks because we thought the prices were a bit higher than needed, and there's no happy hour, which is certainly a bummer. Regardless, Tacombi is a welcome addition to the Fort Greene area and another great option for tacos in the neighborhood.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Great service. They were super accommodating to our party even though we came a little before the kitchen closed. Enjoyed their food, good flavors and sauces. Their verasurva (spell check) tacos were amazing. Loved their rice and beans.", "author": "Manouchka C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Love tacombi! Tacos are delicious, everything is fresh... atmosphere feels like a beachside cantina in (a good way, not cheesy way).. also great breakfast tacos.", "author": "Hadley L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Decor: Tropical Caféteria\nService: con una sonrisa\nFood: Sabor!\n\nSomebody had to come for the barrio bandits selling beans and bullshit and calling it Mexicano. (I'm looking at you El Toro, Pequeño and primos.) Enter Tacombi. \n\nThe spot they chose is on a dope corner for traffic and accessibility, opposite BAM Opera House near all the trains. The space is tiled white walls with colourful pops of graphics and Spanish. The ceilings look like pressed tin, evocative of white doilies from Tita's sala. \n\nHow did the previous tenants make rent selling caucasity on a plate with only crickets for customers? A mystery. Tacombi began their courtship of the neighbourhood with a tenants-only soft open for the folks living above them. How charming. Next day, place was lit. Although the wait for a table was endless, the service was expedient and friendly. \n\nWe had a Rubio, an Horchata, and a sugary Lupita Piña for refreshments. The watermelon purée in the Rubio was fleshy and refrescante against the tequila and lime- definite standout and summer staple.\n\nFare is tapas style. I am here for their hormone free chicken presented as Pollo Yucateco. The rice and beans was perfect texture. The seared fish taco- cod--very very good though seared is a lie, it was fried sorcery. The pork in the Gringa quesadilla and the al pastor taco is neither for gringos nor the fainthearted and should be served with a warning. The Yellowfin Tuna Tostada was buttery textured, fresh, note-perfect. Guac is very simple two or three ingredient dip done well, with chunks of just ripe avocadoes. Friends said the shrimp taco was excellence and I love that they offer fresh squeezed juices.\n\nMy only complaint is portion size but hey, tapas. And that's the smartest menu format for this spot and space with theatre and culture steps away. Welcome to the barrio Tacombi!", "author": "Hadiza A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "I anticipated the opening for so long so not sure if I have some bias. The tacos were amazing and the vibe of the spot was chill and relaxed. The drinks are a bit pricey to me but hey it's Ft Greene.  Nice place to go to just grab something light with friends and talk. Service was great and the mezcule mule was my favorite.", "author": "Kenisha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Excellent. The carnitas taco blew my mind. All the tacos were awesome to tell the truth.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I've eaten here several times now \u0026 I am always happy with my experience! The food is incredible and the portions are great. The staff is always so friendly and the atmosphere in the restaurant is always so enjoyable. It's great for lunch or dinner \u0026 very reasonably priced.", "author": "William D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "Place is nice and comfortable with a very \"Mexican mercadito\" decoration style, service is good and prompt but the non-alcoholic home made drinks\nare pretty bad made from concentrate chemicals and over diluted, tasteless and of course over-priced; so better get a Mexican beer o Mexican cane-sugar \"Lupita\" drink... Tacos are decent in terms of tender juicy meat probably not for my taste... something is missing... \"too gringo style\", chorizo con papas tacos are not bad neither... but not outstanding! conclusion; \"mediocre overpriced tacos\" in a a neighborhood that is still struggling with poverty!!!", "author": "Gerardo Karen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "Tacombi is by far the best Mexican food in the city. The Fort Greene location is one of my favorite places in Brooklyn. The food is spot on, fresh ingredients and you'll think your in Mexico (authentic)..the Management and staff are always great, friendly, and they go out of the way to make sure everything is perfect.", "author": "J.T C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "I'm of two minds of this place.  \n\n+ As a place to hang out with friends, kick back with a couple of brews on the patio, I think it is great.  The decor is kitschy cool and relaxed.  The drinks are expensive but what you'd expect of a trendy place.  The service was terrific and quick. The location is also great right at the nexus of Boerum, Ft Greene and Park Slope.\n\n- The food is just okay, and small for the price.  While I haven't found any better tacos on the area yet the price makes these hard to swallow. In case you go though, I thought the chorizo y papas was the best that I had.  (disclaimer: I lived in SF for the past few years and was spoiled by good Mexican food out there so take it all with a grain of salt.)\n\nTLDR; Hang out and drink here, skip the tacos.\n\nEdit: One last thing.  For those of you with MSG sensitivity, my allergies flared up right after eating here so you might want to avoid it if that's a problem for you.", "author": "Mitchell H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-05", "description": "Place is cute and good atmosphere. Wanted to try this place for a while since it used to be my old neighborhood. The tacos really didn't impressed me. The tacos are more on the just fancy tacos than a real one. Flavor wasn't bad but if you have tried a real taco, you'll know what I'm talking about. Also the tacos come with only one thing tortilla, the inside was really liquid so was hard to eat it with your hands. Have to use a fork for it. I will recommend this place for the drinks and the corn esquites. Drinks are really well made and worth the money.", "author": "Marjorie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Such a great value in terms of taste! For sure a little expensive compared to other Mexican places in the area but honestly SO GOOD.  Plus my server Robbie was so knowledgeable! I'm not super familiar with authentic Mexican food and he answered every question and made perfect suggestions (the corn esquites was amazing and I never would have thought to order it without his suggestion) will for sure be coming back to this location! And be sure to order a Paloma", "author": "Katie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "My friend and I were seated immediately on the patio. The patio is barebones--folding chairs, plastic plates. No greenery, no decor, just a dark navy awning, fully fenced in--feels more like a prison cafeteria.\n\nDid I mention the casual decor? Well the prices don't match that. $6.95 for ONE street taco. $14 for ONE margarita. You could eat here 4 times for $50 a pop, OR you could book roundtrip flights down to Mexico City for real street tacos at the SAME PRICE.\n\nI was excited to try this place and was sorely disappointed. Our server was very kind and attentive, that was the only highlight. We found shell of the avocado in our guacamole. \n\nYou can find SO much excellent Mexican food in Brooklyn for a fraction of the price. Tacombi is just trendy--that's it. Save your money and go elsewhere.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "I sampled all the delicious tacos here for lunch. Though all were great, the fish tacos were super delicious and fresh. Lol I order 2 more after trying them. Now I am super full and satisfied.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "First time visiting their new location in Fort Greene. Less seating than their manhattan locations but environment feels like you're in an authentic Mexican restaurant with blue tiles and fountain in the dining room. We sat in doors but their outdoor seating looks nice and is family friendly. Food is always good however I feel like it is pricey for tacos. $5-7 for each breakfast taco feels a little steep however I guess you're paying for quality and location.", "author": "Robby A."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}