{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Enjoyed my date night there! Enjoyed the food and the service. \nPros: The service was quick and food came out quick. The place is spacious so even though it's loud, you're not on top of other guests. I liked the idea that you just put the quantity of what you want from the menu to order instead of saying it to the server because it was a bit too loud. The server came to check on us as we were eating our food which made the experience very smooth. The decors are cute and the table setting as well. The tacos I ordered were pretty good! I would go back there for Girls night or another date night! \nCons: The menu is limited, not a lot to choose from. It's a bit dark at night. The chairs were not comfortable to sit on and the drinks were okay. I still enjoyed myself even if everything was not to my liking.", "author": "Bellinda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "I heard so many stories about this place being overly expensive with not so great food. But I loved it! \n\nEveryone was so friendly when I came in. I came by myself and sat at the bar after a long day with nothing in my stomach. And they immediately tended to me. Which is what I look for. \n\nThey happened to be training someone when I got there which was fine because she was just as friendly as them. \n\nI got the corn in a cup with a taco. To be honest the taco was a bit too spicy. But I enjoyed it anyway. \n\nThis is a cute little spot if you're looking for a quick bite alone or with a few friends.", "author": "Zayn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "This place is the real deal to me for Mexican food in Brooklyn. I like the totopos and the tacos al pastor are really first rate. I also tried the sweet potato and black bean taco and it was outstanding. \n\nMy only gripe is that the could put a little less salt in the totopos.", "author": "Jonathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "Really enjoyed the vibe of this place. Came with friends and the price is fairly priced. I felt like I was stepping into a bar in Mexico which is a pretty cool experience. They really like pineapples and I do too so that made me enjoy the design even more. Definitely planning to come back and there's other activities in the area too.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Walked in at 5:58PM on a Thursday. It looked empty, I asked for a table for 2 and the hostess said it'll be about a 20 minute wait unless we wanted to grab a seat at the bar. \nWe choose to sit at the bar because we wanted to be in and out anyways to catch a 7PM Screening at BAM across the street. \nWe settled at the bar and by the time we sat on the stool the restaurant was PACKEd! \nWhew! Talk about timing! \nWe were greeted and given a menu to fill in our orders. It's pretty pricey, ranging from $4 - $8 for a single taco. \nWe ordered: \n- Watermelon Soda \n- Avocado Tostada \n- Acapulco Shrimp Taco\n- Black Bean and Sweet Potato Taco\n- VERACRUZANA Campechanos\n- Gallo Quesadillas \n\nEverything was tasty, but the VERACRUZANA Campechanos was PHENOMENAL!!! \n\nThe team also moves very effectively and efficiently. We were done, paid and stuffed by 6:30PM.\n\nIt you're looking to splurge on tasty tacos, I would recommend this place. \nBetween the rent, the efficiency and the flavors I do understand the price point! \nIt was nice to sit at the bar and watch how the team worked! \nI'll be back.", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-18", "description": "The food was delicious the prices were too high the small margarita was $13 and a couple small tacos are delicious though I want to give her 4 stars if they want to knock down the price a little it is authentic Mexican food the best tacos actually since I've been in New York those prices are for what?", "author": "Catina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "LOVE LOVE LOVE THIS PLACE. Every single time my boyfriend and I come here it is great food and amazing service. Love that they have a wide variety of vegetarian options for him as will as great meat options for me \nThe staff is ON point never miss beat and so nice and welcoming . You want authentic Mexican food this is where it is ! I love it .", "author": "Shannon A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "This place is such a gem... if it weren't for their astronomical prices we would be regulars. I'll start with the positives, the atmosphere is spot on; it's a great place to dine on the patio and have a margarita, the decor is vintage and cute. The food: it's really good, so are the drinks - we have not had a bad meal there. \n\nBUT it is very overpriced for the portions they serve, the tacos and tasty but super small and priced crazy. You would think you were dining in some SOHO boutique restaurant, it's seriously not worth the money. I would be cautious about this gem for sure.", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "The taste was great. The tortilla taste amazing BUT.... there was not enough sauce. The seasoning was amazing and the meat had a good spicy kick to it but it would of been more worth it for 10$ if it was bigger and a bit warmer but I ordered it on postmates. But I wouldn't mind ordering again, the food tasted great", "author": "Anna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Love this place! Came in before a BAM movie screening and we were starving and need a quick bite. We ended up ordering the black bean and sweet potato taco, the Acapulco shrimp taco, veracruzana campechanos, and the gallo quesadilla.. I also had the watermelon juice for a drink... we sat at the bar and the kitchen was just cranking dishes out.. really well ran for the small amount of space they have.. the watermelon juice was absolutely refreshing and complimented the heat from the food.. they give you three different sauces you can put on your food and all were good.. one was sweet, another spicy, the third was tangy.. the food came out quick and was delicious.. my favorite was the campechanos which was absolutely delicious... the shrimp and the sauce\nCompliment each other very well.. the quesadilla is also a hit.. love the cheese they use.. I would definitely come back to dinner here again!", "author": "Shashank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "I don't know how it happened but I've been on a taco kick for the past month. I've been on the hunt for tacos packed with deliciousness. As I mentioned to a group of my friends, some taco spots serve tacos that resemble the leaning tower of Pisa but are quite flavorless. I'm happy to report that Tacombi is not that place but I'm getting a little bit ahead of myself. \n\nTacombi is easy to get via mta. It's bright inside and the staff is very attentive. They also have outdoor seating if the floats your boat. Now getting back to the food. Tacombi has a simple but generous menu of items. Did I mention, they also have three different sauces at the table for your extra enjoyment. \n\nSo after getting settled in ... i.e... take a thousand pics of the place and menu, I decided to get a pina colada and four tacos. I had the shrimp, pork, crispy fish and chicken. Each taco was packed with flavor. I will definitely be back very soon.", "author": "Percy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "We had nachos, taco al pastor and fish tacos \nThe fish tacos are pretty good. This place don't have sour cream. What Mexican restaurant don't have sour cream. It was very pricey", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "I thought the food was very good. Service was fast and pleasant. The only disappointment was the margherita and mescale mule. In distinguishable but for the container\n Next time will come for the food and stick to beer.", "author": "sanjay s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "Eh, what can I say... service is great but the food? not so much. It's missing flavor and it's definitely not fresh. The tortillas taste 2-3 days old, not crispy at all. This place has potential but falling short in many ways.", "author": "Rose R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "OMGGGG!!!! Amazing! The avocado tostados are heaven sent!!!!!!!!! I want more! I want more! Matter fact I'm going to get more lol", "author": "Eyvone D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-08", "description": "I was working in the area and didn't know what to get and happened to stumble across this place. Wanted to give it a go, I was too lazy and too cold to walk around.\n\nGot me...\n\nHorchata - cinnamon flavor was strong, drink itself was in the thick side. \n\nBarbacoa - first time having this so I'm not sure what barbacoa is suppose to taste like. Flavor was good though, mildly smokey with a hint of lime. Would recommend. \n\nAl Pastor - I love Al pastor but there was no pineapple. Then flavor was intense, needed to wash it down with the horchata\n\nCarnitas - juicy, and full of flavor. 100% would recommend. \n\nThe place is nice. Looks like a building you see in movies with Latin surroundings. People were welcoming and made sure I was doing alright.  The only reason why this place isn't rated higher is because of the size of the taco. It's smaller than your average tacos however they are pretty good.", "author": "Ron J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Mexican cuisine is by far amongst the most vibrant, colorful, and palette stimulating, so when I have bad mexican food, it must mean somewhere along the line, someone really messed up.\n\nTacombi: where the drinks are $15 and the tacos have no flavor. \n\nThe only things I enjoyed were the homemade sauces at the table and the corn.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "First time visiting Tacombi. Its conveniently located across from whole foods. Really love the vibe in here. I've never been to Mexico city but I imagine there would be places like this. Hostess was friendly and the place is packed with dimmed lights. Had the guacamole, several tacos and quesadillas. All very very tasty and taste fresh. There were all different kinds of sauce but I didnt have to use any cuz the food is nicely seasoned. Drinks were yummy too. Food is smaller portioned but with good service and nice atmosphere I thought was worth it.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "Decent taco spot with good drinks.\nI feel like it's hard to get really good tacos in a casual, sit down place in NYC (honestly if it's not out of a truck or little bodega, it's probably just ok) so I'm glad this opened up nearby. You order through an order form so it's a little faster than more traditional waiter service but they don't rush you at all so it's a nice convenience. The interior (and exterior) is really cute and there's lots of indoor and outdoor seating for when it's nice out.\nAll considered, 4 stars, but if this place were in California, tacos would be 3 stars.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-27", "description": "Can't get behind most of these bad reviews! This is a place I'd stop in to grab a QUICK bite not somewhere I'd plan on staying for awhile... dropped in to get some tacos before I headed home since I was in the area. The (spicy) chicken taco was superb - one of the best chicken tacos I've had in a long time, just based off the flavor of the chicken alone. The only topping it came with was some pickled red onion and cotija cheese but it would've been amazing with maybe some radish, cilantro, etc. Do not forget to squeeze some lime on top for optimal flavor! Also had the sweet potato \u0026 black bean taco + the esquites - both were good. The tacos are small in size but again... quick bites. Probably wouldn't pay what they're asking for the fish/shrimp/more expensive meat tacos because of the size but for the chicken tacos, I was satisfied. \n\nI'll be back if I'm ever in the neighborhood :)", "author": "Shawnee E."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}