{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "Overpriced and not really the best Mexican or at least close to average Mexican meal I've had. My taco was served on my friends plate, and the waiter assumed it was because I ordered it with hers. And then when I told him it was made on a separate order he apologized. Horchata is made out of almond milk. Salsa's aren't what you expect them to be. Chicken tacos weren't too great, shrimp was actually not bad. Tacos are very small. Overall not an extremely bad experience. But wouldn't eat here again.", "author": "Mirna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "This place is amazing! Amazing food. Amazing service. Amazing staff. Adam sets the tone for a great authentic Mexican culinary experience. I recommend this establishment to anyone who enjoys great food accompanied by great service from the staff with a winning atmosphere!", "author": "Shaun B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-24", "description": "oily food with no flavor, and a little on the dry side. \nBut the Horchata was great not too sweet.", "author": "Stephany G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-12", "description": "2 stars because my waitress had such a nice smile: only bright spot here as far as I was concerned. The humble aluminum table vibe, reminiscent of a sleepy town, was contradicted by screaming music: the Taco-overpriced at 8$-was swimming in grease: I am sure there are many who will love this place-not me though", "author": "Virginia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "This place looked cute and authentic, and we were expecting a fair and wholesome experience. We ordered a \"quesadilla\", expecting two tortillas with delicious filling, but alas, it was a sole tortilla, like a soft taco...for $8.....bruh. The sauces were dank, but prices were wack.", "author": "Shana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "Good food and awesome space. However the service is terrible and would prevent me from coming back. I hope it's handled as quickly as possible", "author": "Jessi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "The food is amazing....my favorite is the shrimp quesdia. The staff is also very accommodating and friendly.", "author": "Nachelle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-04", "description": "I wanted to love this place.  The staff was really good.  The food was good but $4.50 for one small taco...it can add up pretty fast.   I also had a pineapple juice for $6.95, however, when the drink came it came in a small glass so definitely overpriced.", "author": "Princess L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-05", "description": "Wow. This place was really bad. The ambiance was ok, but the food so disappointing. May have been the worst quesadilla I have had in my life. Tacos were below average. Guacamole and chips were decent, but not hard to mess that up. Too bad. Was looking forward to a good Mexican spot.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "The food and drinks were all very good but It is overly expensive for what it is. \n\nWe had a total of 4 drinks and 6 tacos for two people and the bill was over $100. \n\nWe may go back but we won't be buying the drinks.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Corn esquites and chorizo taco were my favorite. Service was great. Atmosphere is social and the music is good. Right across the street from Bam so perfect if you have a show to catch. Be warned tho, most days I've walked past this place there has been a wait. Call ahead to check wait time.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "Because there are not enough taco options in fort greene. El toro, la paquena, Jalapa jar, Cesar's, Havana outpost. So let's open a way over-priced joint.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "Tacombi is my idea of hell. It represents the most predictable form of gentrification you'll find: use the cheapest foldout chairs imaginable to allure gringos with a little sugar in their wallets into the putative \"authenticity\" of the cuisine and then charge them sky-high prices. This is what's known as an extortionist establishment: the kind of place that fools white people into paying anywhere from four to seven dollars for a \"taco\" -- and, by taco, we're talking not a hard shell, but a microscopic tortilla, a size so ridiculously pequeño that you won't even FIND this in bona-fide enclaves like Sunset Park or true-blue areas of the Bronx. I do have to give these \"We are the 1%\" types some credit on the spices they affixed to the free-range chicken. And the whole culinary three-card monte racket these cads are pulling off takes moxie. But let's not kid ourselves. This is a place that serves as an authenticity surrogate for affluent types too timorous to venture beyond their despicable glass-walled buildings on the East River. I also have a natural aversion to anyone who insists on explaining what types of sauce I need to use on a fucking taco. Folks, this is not rocket science. And if I have any issues understanding the fine distinctions between rojo and verde, I'll ask. Tacombi reminds me of a Chinese reeducation camp -- I mean, I don't have any personal experience, but it wishes to indoctrinate its clients with the established text rather than permitting any method of discovery. And because your pal Johnny is more of an adventurer rather than some brain-dead tourist, he didn't exactly enjoy himself. Still, if you lack an adventurous streak, then Tacombi was made for you. So I suppose it serves some people. But I didn't need to spend so much fucking money on tacos -- I'll tell you that much. They weren't THAT good.", "author": "Johnny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "This is my new go to spot in fort Greene. Such a great place to eat inside or outside! Love their outside patio especially. They have amazing margaritas and other cocktails. Highly recommend the street corn, avocado tostada, and the bigger Mexican street style taco -chilango, you won't be disappointed.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "It was a good starters . Tacos are nice, environment is good. I liked the service. Food is spicy but you can choose to do it less spicy", "author": "Eden M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I live in the area and decided to come by for some tacos on a Sunday afternoon. The service was excellent, as were the tacos. We ordered several of the Chilangos tacos, as well as the Baja Crispy tacos. Both were delicious. I highly recommend this place.", "author": "Brandon M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-02", "description": "This place really sucks. The service is bad and it's overpriced. Tacos don't taste good!!", "author": "Michael T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "Stopped in because it looked like a cool place to sit outside and have some Mexican food and a margarita.  It was a bit packed so I was told it would be 20 minutes for a seat outside.  Cool I'll wait for it.    So sat at bar and ordered a regular margarita and guacamole.  30 dollars later I get a text that table is ready. Closed out and ready for my outside table but pointed to an inside.  Here comes the bs about \"oh we thought you wanted inside\". Yeah right!  You are saving tables for 2 or more.  Not worth the fight.  Margarita was definitely not worth 13.00 and guacamole was just ok.  This place is a Cardi B restaurant.  New and popular but not really good!", "author": "Mia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "The food is great, it's amazing, the agua fresca is amazing. Couldn't have found a more authentic place. Great place to hang.", "author": "Mario Santana A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "I really wanted to like it, but I was underwhelmed.  My daughter--who loves traditional Mexican food--said, 'The best thing was the water and it tasted like pool.'  I agree with her.  Maybe we went on a bad day, but we were not impressed.", "author": "M P."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}