{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Came here to order take out, the service is so slow!!!! I waited for 30 minutes for them to make 2 tacos. And my beef taco is cold, not warm, not hot, cold.", "author": "Angie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "The fish tacos were amazing, the service was a 10 out of 10. And the manager Adriana made our experience a one of a kind, she was very professional.", "author": "Elbia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Finally! A lunch time/post-work spot in this neighborhood that has tasty food, a good vibe, and is affordably priced. While I think the flavor of the food in this location leaves something to be desired (rice \u0026 beans were quite bland) I have faith that they'll get into the rhythm of things and perfect the cooking soon enough. Outdoor area is also splendid and wait staff is super friendly.", "author": "Leo P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "decided to give this new place - occupied by middling German before and American before that - a try. first occupant of the maitre d'desk told us he will bring  one guest to her place and check whether a table was available, when clearly at least 3 tables in the main dining room and at least that many were available outside. then another gentleman clearly convinced if his importance - after all he was carrying a tablet with seating info - arrived at the desk. after tapping his tablet he informed us that we would have a 20 minute wait. at which point we said no thank you and went to the haitian restaurant 2 doors down lafayette ave. clearly the mexican place does not have their act together.  don't know whether being a biracial couple had anything to do with he second maitre d's attitude?", "author": "Michael N."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}