{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-24", "description": "Expected a lot from this place but honestly it's just cute decor with overpriced, mediocre Tex mex. We ordered an array of tacos and quesadillas. As soon as they put down the plates of food, I was disappointed in the amount I got for the price, and thought maybe the taste could make up for it, but no - nothing special on that front. Really wanted either more flavor or bigger portions for this price point. Service was good - but $12 for bland chips and guacamole?", "author": "Demi W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-27", "description": "Very mediocre flavors.  Would really be surprised if that was Atlantic haddock in the fish taco. Carnitas just okay", "author": "Richard W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-17", "description": "Beware. If you order the angus beef barbacoa taco today you will be disappointed. I used to love this taco dish. I had it over 5 times at the location in Nolita. Me and my wife came out from the theater across the street for dinner. The first thing that popped to my head was the beef barbacoa taco. Wrong choice! What I got on my plate was a dry, extremely salty, super spicy shredded beef on a corn tortilla. Really disappointing.  The good thing= hibiscus water, watermelon juice + avocado tostada.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-21", "description": "Food is decent. Customer service needs to step up.  No options for diabetic.  Look warm water all I got.", "author": "Dora H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Affordable, great service, good food. The staff made a minor mistake with my order and they apologized, brought out the right one promptly, and offered the mistaken order to us. My boyfriend was very happy he got a complimentary taco out of this :)", "author": "Evi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "The food is authentic Mexican and really good. Sorry no pictures I ate my taco and quesadilla", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Excellent service and great food. Loved the guacamole and house made chips. Couldn't be any more satisfied.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-26", "description": "Met friends for dinner on Saturday night before a BAM show.  We arrived early and they let us sit at a table to wait for our friends, which was nice.  I understand that they want to capture the idea of a little Mexican joint with the metal tables and the beat up folding chairs.  Those places are fun because they are rough around the edges and you pay very little for really good food.  They got the atmosphere right, and the food was good, but OMG the prices - teeny weeny portions with a hefty price tag.  We ordered rice and beans and got an itty bitty saucer of rice and beans combined - the size of a small ice cream scoop.  Also, the margaritas had no tequila in them.  They are a good size with almost too much flavor b/c it is all filler.  I had 2 margaritas and didn't even get a tiny buzz.    We spent a lot of money, and 2 hours later after the show, I was hungry.  In retrospect, I felt disrespected having to sit in a crappy folding chair and hand over half my paycheck for food that didn't fill me up.  There are plenty of other good restaurants in Fort Greene to go to - don't go here", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "I had to write a review as the food here was awful. $12 guacamole which was old and bland, fish tacos that were overcooked and just as flavorless, had to cover them in hot sauce just to get some taste. Overpriced and not worth it. Go to sunset park instead", "author": "Vanesa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "we stop by Tacombi first time for lunch \u0026 instantly it became my favorite spot for Authentic Mexican food, the ambience and character of a restaurant is magical, from host to server to buzz boy everyone was so nice plus food arrived in a short time and was just amazing, the owner/ manager is very humble and approachable as well. Now we go to Tacombi all the time.", "author": "Ali M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "Excellent location - across from BAM. Excellent crispy fish taco \u0026 esquites. But the $ 13 margarita is small, uninspiring \u0026 dreadfully\noverpriced.", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "This a great place .. Good Food and friendly staff .. I strongly recommend this place .. Drinks on point also .", "author": "Edwin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Finally, great Mexican food in Brooklyn. Service isn't always the best, but the food is delicious and it's fairly well priced for New York.", "author": "Amit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Excellent. Perfect vibe and ambience. Sensational tacos and flavors. Good value. Exciting addition to the Brooklyn food scene.", "author": "William S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Yummy food. Be sure to get the corn. We had a great lunch. Carnitas all around. The pork was the hit of the table.", "author": "Dennis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Reconsider. This is a place with loud style and little substance. The food makes for good high class Mexican for your mom and dad after a feel good documentary across the street at the BrooklynAcademyofMusic, also known as BAM. Because you will order chips and guacamole and a 16$ cocktail and a couple of tacos and rice and beans and they will come out to you at a staggered belabored pace that makes for a stutter-step meal complete with a sugary cocktail that leaves you sailing for the toilet bowl after a failed attempt at the trending Whole30 diet. Social currency is the new currency, so come here if you have little going on, but stay away if you have a rich social life and an identity to protect. This is a sad imitation of a stucco burrito parlor in the center of a white metropolis.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "as is the case for a lot of food in new york, the portions are pretty small and not cheap. but the taste makes up for it. i usually get an avocado tostada and corn esquites and it's just enough to fill me up if i'm super hungry. both are delicious and there's not much that can be done to improve upon them. in the summer, there's nothing more refreshing than an agua de sandia.", "author": "Cristina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "AUTHENTICITY AT ITS FINEST! Seriously this place should win an award. I decided to go in with the Wifey and for a second I thought I was in South America. The vibe inside was identical to your typical neighborhood restaurant in South America. Loved it! Got me really excited for my upcoming trip to Ecuador. Quick and speedy service. Food was excellent. I recommend the Corn appetizer and the quesadillas. Will be back with Family!", "author": "Johnny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "This place is the most authentic Mexican food I've found in New York. The tacos are uniformly good, and the ambiance is pure Mexico. I see some people faulted the service, but I've found the service staff to be attentive and helpful. I'll definitely be back.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-21", "description": "First the positive: the staff is friendly and attentive. The place is across from BAM and has the typical pre and post show rush. They pretty organized with tables, wait time, etc. However, the food is TERRIBLY overpriced for what it is. Portions are small and the quality and taste is kinda average. In order to charge $5-6 for a Taco, they better be amazing and sadly they aren't. The crispy fish tacos are somewhat bland and the black bean sweet potato taco is so small, we almost laughed when it arrived at the table. They have a type of Mexican street taco (i had one with braised beef) which was pretty good although i almost choked on the chili oil it was marinated in. Maybe my fault. $13 Margaritas? Maybe I'm a bit behind the times and yes NYC has become a town for the rich but i can't consolidate these prices with Mexican street food: this isn't Mexican Haute Cuisine but i guess 20-something hipsters think it's cool like that. I'm totally OK with that but i won't be back anytime soon.", "author": "Nicole R."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}