{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-14", "description": "Tacos are authentic. Great favors. I had the shrimp and Baja fish. Love the fact it's house made tortillas. \nDrinks was on point. I order the Mezcal and Paloma. Both had excellent favor. Definitely will be back. Outdoor seating had heat which is a plus. \nNot 5 stars yet because I want to try more on the menu. Until next time.", "author": "Benito M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "Conveniently located local spot with a fun atmosphere.  The food left me Confused.  The variety of the menu offers something for everybody.  But there is a huge variance in the quality of the items.  I generally like places that have multiple hot sauces on the table, but this place was merely average.\n\nOn one hand the fried fish taco was delicious and generously portioned.  It left me wanting to eat more.  But the al pastor taco was dry and flavorless.  I order al pastor whenever I get a chance, but this taco was truly disappointing.", "author": "Dan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-03", "description": "While NYC has made many strides with good Mexican food in recent years, there are still too many underwhelming and overpriced places that can leave anyone who has experienced amazing and fairly priced Mexican food elsewhere feel played.\n\nThis is one of those places, unfortunately. 2 stars for passable Mexican food, although small portions, spotty service, and \"new Brooklyn\" price gouging. An additional charge of $5.95 for a small side of pico de gallo when one is already paying healthily for chips and guacamole is but one example and seems particularly disrespectful of customers. Sparse, $7.95 tostadas is another. And there weren't many chips on the chips and guac plate either, so we asked for more and it took 30 minutes to bring them, literally as we were paying the check to leave.\n\nService is pleasant but inefficient and uncoordinated and watch out: if eating here in the winter time, be prepared to freeze your a** off if you are given a seat on the enclosed patio. There are overhead heaters, but they are too few in number and poorly placed. If you are sitting in the corner table and - God/dess bless you if at the corner seat - you will have to keep all winter clothes on. I kept multiple coats, wool hat, and scarf on through the entire dinner and still shivered the entire time. At one point, we told a server that we were really cold and she said \"sorry about that\" and turned away without giving thought to an offer to move us.\n\nRecommended only for location, convenient to trains.", "author": "Will V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Went last night before a concert at Barclays. This restaurant is super close to it, so that worked well. \nIt was busy when we walked in so we ordered some drinks while we waited. \nThe margs were great. Just enough salt. Not too sweet. \nWe were seated in the outdoor area under heat lamps that made it perfectly comfortable.\nOur main waiter was Robby, and he was fantastic, though he wasn't the only one who checked on us and tended our table. It's evident that the employees work as a team.\nNow, for the food: Wow. Every dish was so delicious. Stand-outs include the street corn, the tuna tostada, the chorizo. The guac. So, so good. All of it.\nCan't wait to go back soon.", "author": "Kate F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "Right across from BAM, so Tacombi is perfect after a movie. The margaritas were pretty basic and nothing special. The guacamole was the highlight of the meal. The chips that come with it are thick so it's a filling appetizer. \n\nI had the chicken taco which I didn't particularly enjoy. There was no basic chicken option so I opted for the spicy chicken per the bartenders suggestion. Ouch! I left a little bit hungry. \n\nI will come back in the summer to sit in the outdoor area. Otherwise I'm in no rush to try Tacombi again.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Today was my second time at Tacombi and it was GREAT! I was warmly welcomed by the host, I think her name is Katherine. She's very polite and professional. We had guacamole for appetizer, it was good, even though I think it was lacking tomatoes. I asked why they don't put and the told me that that's the traditional way of making guac. I'm not complaining, it was great anyway. The chips that came with the guac were OUTSTANDING. Right amount of salt and spices, very crispy and I ordered more to get home. I had the pork tacos as well, for the second time and they were good as the first time I went there. I like consistency . The service was excellent.", "author": "Iskra P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "Came here on date night. Ordered tacos and they were both good. The taco shells tasted house made and delicious. Staff was nice and friendly.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "My experience at this restaurant was so amazing. My family and I went there yesterday afternoon for dinner and almost left because the seating are looked very tight and we had our 5 month old son in a big stroller. While standing outside with my boyfriend and two kids were about to leave when the male hostess came outside and asked if we were looking for seating and to give him a moment while he made room. He ran back outside shortly after to let us know he made room for us and appreciated our patients. We were seated very nice and cozy in the corner by the window with cool breeze blowing on us. He was so apologetic and was so accommodating. To follow , the female waitress came over and explained the menu in full detail to us and also assured us she would fix our wobbly table as she noticed it shaking when my daughter leaned on it. Throughout our time there the staff was so nice, accommodating, understanding, and so observant. My daughter, who is a picky eater loved her meal, guacamole and chips and shrimp tacos that had a spicy kick to it. All in all this place was lovely. I will definitely return because at the time I was extremely sick and couldn't  speak. But wanted my family to enjoy their dinner and the staff made sure we all enjoyed our time there. Great job", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-17", "description": "I was disappointed with this experience, although the food wasn't horrible, the overall experience was nothing to go back to. Went to a show across the street at BAM and decided to grab a bite. We ordered 3 different tacos and tortilla chips topped with cheese and beans, I also had a fruit drink of pineapple and ginger(non alcoholic). First the tacos, although it was prepared well it was on a single tortilla which fell apart soon as you picked it up, they should double it up. The tortilla chips were done well, my fruit drink was $7 in a high ball glass filled with ice, half with the juice and the top half with the thick foam from the juicer, that sucked.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "Great location and great service. I came here for a late bite and this absolutely hit the spot. All tacos should have a pineapple. Also you can't go wrong with a margarita. Very delicious. The staff was patient considering the kitchen was closing. I'll definitely be back, but much earlier so I can fully enjoy myself. Check it out folks! You won't be disappointed.", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-28", "description": "Tacombi serves tacos to the masses across the street from BAM. The flavors are good, hot sauces are so legit, and selection of agua fresca is the bomb. Ingredient quality is excellent. But portion sizes are small, as in, a taco is four inches across. And then prices are high ($50 for two people without alcohol) so I hate to say it, but it's three stars.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-16", "description": "The food was good and there is a cute atmosphere with nice presentation of the meal. Service was also friendly and quick. I really enjoyed the grilled fish tacos. The portion sizes were  so *tiny* and most of the taco was just filled with cabbage. Our bill for 5 tacos, chips and rice/beans side (no drinks!) was 47.00, so it just felt like the value for the price was not there. You could walk down a few blocks to Dekalb market and have 4 tacos for 14.00$.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "It was Friday so as my mom and I walked in we were told it would be a 20 min  wait. They took my cellphone number and sent me a text 10 mins later to inform that our table was ready. I thought we were off to a great start. \nYou are given a paper menu which you use one per table order. \n\nAmbiance: aluminium tables and lacking actual decor. There is an outdoor seating area but again nothing gran about it. There is a cute sink where you could wash your hands before and after getting your grub on. \n\nService: once my order was taken I didn't see my waitress again until I received the check. \n\nDrinks-Pineapple agua fresca and the watermelon agua fresca. By far the watermelon agua fresco was delightful and so refreshing. \n\nFood: Guac and chips which felt like two spoon fills and for $11.95 I expected a bowl or guac\nShrimp tacos- we asked if it was spicy and our waitress informed that the sauce was spicy. We asked for the sauce to be excluded but it wasn't. \nBaja crispy fish taco-the taco was good but the actual fish lacked flavor. This portion was bigger than any of the other tacos we had\nAl pastor tacos- these were very spicy but flavorful. \n\nThe tacos are small and for a total of $40 I think it was a bit much given the portions. It's a trendy hang out spot but I don't think it was worth it.", "author": "Sophy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "I drove past this place so many times and begged my boyfriend to go here one day. The food was really good. Nice atmosphere, and nice wait staff. I'll definitely be back here soon for more esquites!", "author": "Jeannette M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "These guys are doing a LOT right at this location. A little on the \"fancy\" side (ie not trad taqueria, but still street style). Both carnitas and al pastor are worth the trip, especially the carnitas. Great salsas as well. One thing guys-- why not two tortillas per taco? There's a lot of meat (a very good thing) but the tacos broke apart after sitting on the plate for a bit. However, this is NYC, so they get 4 starts and actually 4.5 would be closer. On my NYC/CA scale: a California 7 and a NYC 9.5", "author": "Johnny L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-22", "description": "The people that work here are really nice but the food is super average. \nIt's not bad, and it's not awesome eithet", "author": "Cali H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "I love the vibe at Tacombi. The food is on point and the staff are really lovely. I was there with some friends last night and we had a really great time. The food is simple and supremely flavorful. A little more pricey than I'm used to paying for tacos but it's worth it. \n\nIn other news the staff aren't only friendly but we were looked after by several people who were really attractive. I'll definitely be coming here again!", "author": "Jess M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Came for drinks, and sat at the bar which is small. I think they set that up for you to sit and eat. Make a resv if possible so you don't have to wait like the ton of people behind me at the bar. Drinks were good at the bar, and we had a avocado tostados which was great.  They had a lot of hot sauces which were good. Inching to try dinner here!", "author": "Dililah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "For what it is, Tacombi gets 4 stars in my book. It's not fancy: I really couldn't believe this was the same place that used to be Berlyn - they've totally stripped it down so it looks like a Mexican beachside shack on the inside, and the menus are paper strips that you use to place your order - but the food is pretty authentic to tacos I've had at beach shacks in Cozumel.  Prices are pretty reasonable given the quality, even though the tacos are on the small side, but that's a plus in my book because I could try several different ones. My least favorite was the fried fish, but that may have been because I ate that last and was pretty full. The al pastor taco and shrimp tostada were my favorites. Wash your tacos down with a Rico: watermelon and lime infused vodka makes a great cocktail!", "author": "Denise P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "Food is good mostly the tacos ! I tried the Paloma and it just taste like alcohol the fruit waters are good our price check was about 80$ which wasn't bad we did get guacamole elotes like 3 order of tacos a quesadilla 2 waters a alcohol drink lol over tall it was okay not sure if I will come back I do recommend for a short stop to eat and drink", "author": "Alma L."}], "servesCuisine": "Mexican", "priceRange": null, "name": "Tacombi - Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_5FCmzLT8pdKg1zMZxxbzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472940647"}