{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "This place is very good, a little pricey, but high quality.  It's all vegetarian and a lot of it is gluten free.  It's great to have so many options as a vegetarian when you're usually limited to one or two items from a menu.  I've had the Full and Cozy Bowl and their smoky beet burger, both of which were quite tasty.  The veggie burger was really good, but not super filling so I got a side salad for $3, which was a bargain and helped fill me up.  The Full and Cozy Bowl was very filling with its baked tofu, quinoa, squash, and cranberry apple salad.  \nEverything at Two Tablespoons seems to be pretty healthy and all the ingredients seem very fresh.  I will say the staff was somewhat sub-par.  The guys working behind the counter were very slow and only worked on one order at a time when there was a large line of people.  I honestly think one of them may have been stoned as he didn't seem to fully comprehend what we were saying when we ordered, but in the end we got our food and it was all very good, so overall I give them 4 stars.  It would be 4.5-5 stars if the service was better and the prices were more reasonable.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "So I watched What the Health and threw out everything in my kitchen. \n\nI decided to walk through Dekalb Food Market a couple days later like a fool. So few vegan options... and a crap load of meat and dairy at every turn. Which reminds me to stop procrastinating because I should have come here sooner. \n\nBut I found Two Tablespoons without even looking for it. The best veggie burger I've ever had. And no, it's not my first one. Added guacamole because.. guacamole. It was expensive as all hell. About $13 and then there's an option to tip which is bizarre. The wait was fine being that I was the only customer. If I'm going to eat out once a week, it might be this. \n\n-1 star because the cashier was exuding a crappy ass mood that nobody should have to deal with.", "author": "Olivia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Every time I go into Dekalb Market Hall, I promise myself I will try something... new but I always end up back at Two Tablespoons.  Their food feels fresh, healthy, and balanced, and there is enough variety on the menu to hit the spot no matter what I'm craving.  I especially like the tomato-chickpea stew that is incorporated into some of the bowls, but everything I've had here has been great.  \n\nThe only negative is that it's a little on the pricey side, but otherwise highly recommended.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Randomly stopped here as I was shopping.  I ordered the smoky beet and black bean burger.  I've had black bean burger in the past but never with beets.  This is my favorite sandwich at the moment.  Recommend to anyone who wants to try a none meat burger....", "author": "Madd M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "The best veggie burgers you can find! I love the spring rolls and bowls as well, but burger is my fav! I usually add guacamole! It's always fresh, juicy and delicious! I moved from their locations and miss them terribly! If you are around, don't think twice! \nRegarding the price.. I prefer to pay higher price for high quality food than medical bill later on.. worth every penny!", "author": "Elina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Great and healthy eating at City Point in DOBRO. Rent must be high (pricey). But yummy, healthy and local produce make for satisfying, quickly prepared meals.\nWish they revised their \"open beer\" policy though. TJ' s be damned!\nGo for the veggie burgers and beet salads, then head to Fort Greene Park.", "author": "Jorge A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I loved the veggie burger that was made gluten free.  I only eat bread one per week. It this will always be a monthly treat to look forward to.", "author": "Valerie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "The food here is good EXCEPT the summer rolls. I tried one of each as a hungry lover of summer rolls and ended up throwing them out. Unlike the rest of the food, they are premade and not made to order- and taste like it. The lentils tasted dirty, the beets were stale, the tofu was sour somehow? Especially with the size and price and how good the veggie burger specifically is, I was kinda bummed.", "author": "Aisha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Best veggie burger I have had so far. Tofu roll was awesome also. The only thing is need some more variety in the drink selection. A+", "author": "Jim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I'm absolutely in love with this place!  The staff is awesome and the food is incredible!  Best vegan place around! My fav item on the menu is the beet veggie burger and it's insane!", "author": "Angie Renee A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "We ordered the tofu noodle bowl and the quinoa tofu bowl. Both were so good! Everything tastes fresh and the veg was cooked perfectly. Will definitely come back for a good hearty and healthy option for lunch or dinner.", "author": "Lindsey H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "I loved Two Tablespoons when they were starting out. However, I've been noticing in some locations such as this one, their summer rolls are served premade and don't taste as fresh.. They forgot to include the dipping sauce so it feels like I'm eating a bland salad with no dressing.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "I'm surprised about the negative reviews on here, I think the food is absolutely wonderful! It's the kind of food that makes you feel good after you eat it. It is a bit pricey but come on guys, we're in New York City it should be expected. I've been to both locations many times, but the staff at the Albee Square location are just exceptional. So glad that one opened up near me, keep up the good work guys!", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "There are various combos of tasty seasonal veggies on quinoa or miso broth bowls, a fat and delicious veggie burger (beet-based), spring rolls --generous portions dished up in compostable  containers for easy take out, or eat in at DeKalb Food Hall's communal picnic or cafe tables nearby. I like the variety of ingredients and sauces, and the mix and match option of \"build your own macro bowl.\" It's the healthy option at the Food Hall, staffed by friendly efficient servers.", "author": "Nancy c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "First off its extremely overpriced for what you are getting. Secondly the food was bland. I got a custom bowl with quinoa, some lentil salad, tofu and avocado. Everything in my bowl needed seasoning. If I have to go out of my way to reseason your over priced food then maybe it should be cheaper. Wouldn't recommend this place nor ever eat here again. This is the kind of place that makes non vegans not want to go vegan.", "author": "Mis N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "This was the worst veggie burger I've ever had. As a lifelong vegetarian, I've had my fair share of both great and awful veggie burgers, but this was the awful. The beet patty was mushy and sticky, and it had no flavor. Certainly don't make the mistake I did and order it with a gluten free \"bun\" - it looked (and tasted) like stale white bread from 1950. The corn roll was similarly flavorless and completely disappointing. Their one redeeming quality is that they sell wine. It was a huge waste - and it cost $61 for two people (2 sandwiches, 1 roll, 2 drinks, 2 waters). Ridiculous and we threw out this tasteless meal.", "author": "Nev J."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Two Tablespoons", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/J2IesgLhwrUotuISHVh_bw/ls.jpg", "@type": "Restaurant", "telephone": "+19293682765"}