{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "I didn't know what to expect because they have just ok reviews, but I thought it was delicious! I got the Shanti Bowl and my mom got the Sun Circle Bowl and both of them we're very good. I will definitely be eating here again soon.", "author": "Renee D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-23", "description": "I like to support vegetarian places, but this place is too overpriced.  \nIf you get a regular portion, you spend too much for more food than you can even eat, but if you get a small portion, it's still expensive, and they don't even fill the bowl to the top.  \nI like to tip, but when the bowl I'm given is partly empty, no.  I assume their supervisor tells them to portion the the food the way they do, bc otherwise it seems they must not want tips.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "My friend and I were looking for something nutritious to make up for eating poorly the previous day. As we came across Two Tablespoons, the menu and pics of the macro bowls caught our eyes. We decided to share a Green Market Bowl and added a dollop of guacamole on top (~$16). The counter guy was nice enough to give us another eco-friendly bowl to split our meal so we wouldn't need to look like horses at a trough. After finding a spot to eat and splitting up the bowl, we finally dug into the food.\n\nAfter noshing in silence for a few minutes, we finally lifted our heads to exclaim how delicious it was. It was certainly the best bowl of vegan food I've ever had, and I'm not a vegan. I love a good steak and barbecued meat. However, the combination of separately-seasoned vegetables and grains made for a very tasty and warming bowl of goodness that I would not hesitate to order again. Yummy and guilt-free... That's a win-win in my book!", "author": "Wendy F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-16", "description": "Let's start off with the good. The curried cauliflower was tasty and the cabbage and other toppings on the veggie burger were nice. That was it. They didn't include my drink, the cauliflower side was way too small (for my standards and what it cost) and the veggie burger itself was incredibly dry, flavorless and over cooked. Maybe I give the cauliflower a pass, it may not be a good deal but it was still the highlight. Probably won't ever order again.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "This town has an endless amount of eateries, and I think that Brooklyn's Dekalb Market has a collection of some of the best that I've been this weekend.  Located on the lower level of a shopping center are a variety of places to eat. There were so many, that I joked about starving to death from indecision.  \n\nI decided on Two Tablespoons because of my need for something healthy and nutritious.  According to staff, their take on vegan/vegetarian is inspired by foods from different cultures and places that the owners have lived. \n\nA great choice was made with the Sun Circle Bowl - Quinoa, fingerling potatoes, herbed hummus, red pepper spread, arugula, olives, cucumbers, and feta.  Topped with a scoop of avocado.  Can't tell you enough how good it was.  \n\nStaff was quick and efficient. Delicious and fast.  That is all.", "author": "Ken Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "I get bowls here when I am looking for a filling and healthy option in the area. It's a good quick option for those in the downtown Brooklyn area. I really like the pesto tofu - the pesto sauce is really unique and not too creamy. The tofu isn't usually too greasy and has a nice amount of firmness. I really like the cauliflower, broccoli, zucchini, and cucumber tomato salad as sides in the bowls ! \n\nI've had the scrambled eggs as well, but thought they weren't as good as the lunch bowl options.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "Thursday night, no one in line in front of this healthy stall at Dekalb Market. Simple menu filled mostly with salads and bowls as well as a moderate drink list.\n\nOpted for the \"Full and Cozy\" Bowl ($13ish) - baked tofu, squash, quinoa, apples, cranberries, feta, pecans, and a few greens. Food is ready within 5 minutes - a super dense bowl separated perfectly from each other. \"Full and cozy\" is right for this bowl, as getting through the tofu and the super rich squash is enough for a meal. Salad provides a good texture difference, especially with the sweet fruit and crunchy pecans. Quinoa is plentiful and easy toe at with the other ingredients. Washed it all down with a glass of Malbec ($9) - a strong Chilean wine to pair with the bowl.\n\nSlightly on the expensive end, though the service is quick and the food is filling. Definitely will come back for another bowl.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-13", "description": "I subtracted 1 star due to the lack of politeness of the workers who attended me. The other star is for how cold my burguer was. On top of that, I paid almost 3$ for water. I'm vegan and I like to support all vegan places, but this one I do not recommend. I wasted almost 20$ and was sick for the rest of the day.", "author": "Stephany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "I went to two tablespoons for lunch on a Wednesday afternoon. There were a ton of dishes on the menu that looked great so it was very hard for me to decide what to order. I ended up ordering the veggie burger made out of beets and it was very good! It came with a lot of toppings and the challah bun was a nice touch. My only complaint is that it was very messy and kind of fell apart as I was eating it. But I definitely want to come back here to try more things on the menu!", "author": "Leah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "Very courteous guy at the counter, quick service and the Sun Circle bowl I ordered was tasty and filling. I enjoyed it. Would come again.", "author": "Brian T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-16", "description": "Ordered delivery from two table spoons. Good quality ingredients but the bowl I ordered was extremely flavorless and the menu is very confusing to order off of as a first timer. With so many options in DeKalb Market I would highly recommend trying all of the other various shops before stopping by two tablespoons.", "author": "Gisella P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Very bland, unoriginal, and costly. Have tried multiple items from the menu and can confidently say I will never order from here again (unless they totally overhaul their business/menu).", "author": "Steven H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-17", "description": "Took 2.5 hours for delivery of a simple veggie bowl. No updates or anything. Terrible!", "author": "Nicholas P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "We stopped here one Random Wednesday night and was beyond pleased ... In Dekalb Market , this place has got to be your stop , especially if you're vegan like me ...  great job !", "author": "Jacob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "A great option in DeKalb food market if you're vegan, vegetarian or just a fan of healthy, delicious food. I've enjoyed their quinoa bowls topped with all sorts of veggies and also their tofu summer roll wraps - big enough to be a whole meal (and only cost $10 for 2). Oh--and the beet veggie burger! One of the best veggie burgers I've had. Top everything with extra avocado...obviously! Enjoy", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "My favorite place for a quick lunch or dinner at Dekalb Market Hall. Love that it's filling, but also doesn't make you feel gross if you eat too much.", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "I couldn't decide what to get because everything looked good to me. I ended up getting the beet burger with guacamole and it was amazing. Hands down the best veggie burger I ever had. Usually I don't like veggie burgers because places only have veggie burgers made out of black beans (which I'm not a fan of) but I love that they use beets!!! As a non-meat eater I am always looking for new vegetarian/vegan places and this is one of my favorites in NYC.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "Was happy to find a vegan option in the Dekalb Market but the three sides I got disappointed and I found a short black hair in my food... not worth the $13 after tax.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "So delicious. GF buns and GF veggie burgers and delicious fresh takes on rice paper wraps with vegetables inside. Not too much garlic, which is also great -- sometimes veggie places just whack you over the head with all the garlic they use. This place is solid and healthy. Probably the only place I'll eat in this food hall.", "author": "Roxanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "I stumbled upon this place inside of Dekalb Market Hall. Everything on the menu looked so good! I was torn between the veggie burger and a macro bowl. Well, the veggie burger won lol. I must say i was not disappointed! The cashier and cook were both nice and had great customer service. I also ordered the strawberry basil lemonade and It was very tasty and had just the right amount of basil.", "author": "Allyson A."}], "servesCuisine": "Gluten-Free", "priceRange": "$11-30", "name": "Two Tablespoons", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/J2IesgLhwrUotuISHVh_bw/ls.jpg", "@type": "Restaurant", "telephone": "+19293682765"}