{"aggregateRating": {"reviewCount": 6, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "Walking around Brooklyn decided to stop in \n\nOrdered a medium pizza and it was huge \n\nIt was good but not the great New York pizza that people crave \n\nMy search continues", "author": "Alex P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "Rude employee! She was extremely rude to me by making me rush in ordering. I even asked her a simple question, what comes with this order? She just hissed at me and told me to hurry up and order something..... There was no one behind me in line. I was the only one ordering and she was so rude. I was standing there for only 2 minutes and looking at the menu! \n\nAnd then when she charged me $7 for chicken tenders, it wasn't even tenders. It was an order of 3 nuggets and minimum fries..... That's not worth $7! And not only that but the tray was burnt with yellow stuff. I don't know if it was a rat bitten tray container or some weird chemicals. But it was not normal. This pizzeria is absolutely horrible! I will not be coming back here ever again.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Ordered delivery from here for work on Friday, loved it. We were a little apprehensive since there were no reviews but took a chance and it was totally worth it.\n\nCalled the restaurant around 11:30am and ordered a half tray of chicken parm and half tray of baked ziti for 12:30pm. The chef threw in 2 orders of garlic bread for free (so glad he did!). The food was cheesy, delicious, hot and really tasty. The garlic bread was a cross between bread and knots. Yum. \n\nTo top it off, delivery was right on time (wow!) and the delivery guy actually came upstairs to drop off the food to a conference room. Definitely recommend this place.", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "I went to Brooklyn to visit my mother in law and we ordered food from here. I'm vegan so I wanted a garden salad with balsamic and my husband ordered it with balsamic and no cheese they said ok and like 20mins. Well it took them 40mins to get there and they gave me the wrong dressing it was some creamy white kind, blue cheese or caesar... everyone's order was fine", "author": "Vee B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "I have forgotten about this restaurant for almost a year and the cashier girl called Gabriela R. on yelp who was rude to me that day, decided to write on my profile to be more rude and to name call me \"naughty p**sy\". I had to actually block her. Nuts!", "author": "Sam Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "I work across the street from this place on a barren stretch of Livingston where it's the only game in town so I have been many times. Sadly, I'm forced to conclude that the terrible food is never getting better and the terrible service is never getting better either. This place stays in business purely due to lack of competition and a steady stream of business from the construction workers who work nearby. Avoid it at all costs. Hopefully a bodega will open up nearby someday.", "author": "Ben W."}], "servesCuisine": "Burgers", "priceRange": null, "name": "Bella Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "208 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QKM2yXrfNevcsnj2WMtUCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224100"}