{"aggregateRating": {"reviewCount": 25, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "$15 for two rolls. The avocado was brown in the salmon avocado roll. The spicy tuna roll was gross. They definitely mixed old spicy tuna with the new. Deli sushi would have been a better bet! Will not be going back!", "author": "Keith F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "This is the bomb sushi place! Definitely what the neighborhood needed. Food is fast and super fresh. It even tastes clean. Love the rice cracker crunch, too. We ordered delivery the last two nights. I sense we will become regulars. :)", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "The sushi is good, but slightly expensive.  The real problem is the menu.  Do you just want tuna or salmon rolls?  Not at this sushi place.  Ugh.  The menu looks like it is made by someone who hates sushi.  Every roll is either spicy, Sriracha, avocado or California variants.  If you order without the avocado your roll will be served half empty, and only after intense discussion.", "author": "Kurt W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Good fresh sushi that's delicious! The vibe is modern and the place is colorful. Stay is friendly and helpful", "author": "Sarah Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "For fast casual sushi, this place is the best! The place isn't fancy at all and it is really for take out only, but the food is super fresh and tasty.  Some of the best sushi I've had in Brooklyn-- and the delivery is much quicker than almost anywhere else in the neighborhood!  They've only been open about two weeks and I've already been three times.", "author": "Melissa D."}], "servesCuisine": "Sushi Bars", "priceRange": null, "name": "Big Eye Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zsP_BmbazAZszmiOSH4FVA/ls.jpg", "@type": "Restaurant", "telephone": "+13475990188"}