{"aggregateRating": {"reviewCount": 25, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-13", "description": "I live in the area, and have walked past this location quite a few times. Last night, after coming from drinks with friends, I desperately needed something quick and relatively healthy for dinner - and this fit the bill.\n\nI honestly felt bad, because they were 15 mins from closing (but to be fair, I asked repeatedly if they are still open!). My order was the spicy tuna bowl, and it came with some edamame, some sliced cucumbers, generous serving of rice, spicy tuna, and because I was the last order of the night - some salmon sashimi too. YUM.\n\nThey were also kind enough to give me 10% off as a first-time customer (since he couldn't locate the discount card for a future visit). The food was fresh, the service was quick and I'm glad we have new food options in the area.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "This is a good place to get fresh and quick sushi to go. I live next door so I'm glad this place opened up as there isn't this type of cuisine in the area without having to go to Dekalb Hall.  I removed one star because it is a bit on the price side but this will definitely be in my regular rotation\n\n\nUpdate: I unfortunately have to downgrade to three stars. I paid over $15 for a snow crab bowl which is mostly rice and very very little crab, and two small pieces of shrimp. I just don't think that's worth $15.  I think they need to figure out the portion sizes if they are going to charge these prices, and then maybe it'll be worth it.", "author": "shana l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "A new sushi spot with a very interesting sushi line up. They got some very unique sushi rolls offered which are out of the box from your traditional sushi restaurants.\n\nI got the Sriracha Salmon and Shrimp Mango Avocado. The Sriracha Salmon Roll was intriguing as it is not like the traditional Spicy Salmon Roll you can typically get. This I presume is salmon soaked is Sriracha sauce so you get that sweet and spicy taste all in a roll. I'm a fan of it. The Shrimp Mango Avocado roll when you first look at it, I thought of how proportionate the roll was, barely a sliver of mango in the roll. Once you pop in the roll into your mouth, you can taste the mango being complementary with the shrimp and avocado flavors. A perfectly balanced flavorful roll. Each roll is cut into 8 pieces.\n\nThey offer other items if you're not that into sushi such as rice bowl and salads, although very limited in selection. I am looking forward to trying the other rolls they have to offer next time.\n\nP.S. This is a card only establishment.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "The man behind the now closed Ganso restaurants and the recently opened taqueria called Taqueria just opened a better-named fast casual sushi spot, once again in downtown Brooklyn.\n\nThis is a great choice for a quick delicious meal if you want some cheaper high quality sushi. It's in the vein of Bondi, in that there are set combos, prepared fresh and quickly. Here though, there is also nigiri plus a few other options, like a Sashimi Salad and a Sashimi Bowl. I tried the sushi bento for ($14), which comes with 3 delicious pieces of nigiri and one roll.\n\nA construction worker just walked in asking if they had shrimp tempura and walked out sad, so hopefully they find the crowd they deserve for a good fast casual spot.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Really fresh, high quality sushi, and super creative vegetarian sushi. \n\nThis area is pretty lacking in high-quality sushi--we ever only go to Hibino and Dekalb's Daigo handroll. So it's sad to see other reviewers complain about price, since you really need to use the right comps. BigEye is actually more bang for your buck in comparison. I'd love to see what they think of Daigo, where you'd get an amazing handroll but for $8 apiece.  \n\nEven better is they say they source sustainable fish, and they've got a great array of Japanese snacks and drinks in the shop.", "author": "Ash C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-14", "description": "Bigeye Sushi is good for my big mouth! Came here after work on a weekday and was one of the only customers inside. My partner and I shared three rolls - california ($7), shrimp mango avocado ($8) and yellowtail jalapeno ($8). The price is right, and we were both very impressed with the freshness of the seafood/rolls. You can add rice cracker crunch to any roll for 50 cents. We had this added to the shrimp mango avocado roll. It added a nice crunch but wasn't really necessary. Sidenote: I totally missed the free miso soup deal on Yelp so take advantage of that if you can. The storefront is small but bright and clean, and there's a row of seats to dine in. I would go back for carry out.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "Update: \nThe past couple of orders have given us an upset stomach. Not sure if it's quality or handling but recent changes are not pleasant. Even the single packet ginger and wasabi takes forever to individual open for such small amount and really missing the fresh aspect.", "author": "Ezer K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-08", "description": "A casual take-out Sushi place with prices like a 5-star restaurant.\n\nI walked in and found the place completely empty. I was skeptical when I saw $14 for one roll + three pieces of sushi. As expected, they handed me one underwhelming roll and three pieces of sushi.... for $15 with tax. I was starving and famished after forking over the money and swallowing the single roll.\n\nFor $15 you can walk over to an actual sushi restaurant and get a 3-roll lunch special, with miso soup and salad with ginger.\n\nThe speed is good, the quality is good. But you need to rethink your business model around quantity/price or there will be more slow days ahead.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-11", "description": "In the midst of this MetroTech area, Bigeye Sushi is a nice addition to the lunch options. It's no doubt that it's pricey but it's relatively quick. I've tried their sushi platter and sashimi bowls. Both are pretty fresh but small in order. They also have snow crab which I've asked specifically if it was imitation crab meat and they said no. It's a pricey order, but for real snow crab, I guess you'll have to pay. For the few times I've been there, it's not a buzzing lunch spot so I hope they will last for a bit and maybe even adjust their prices a little.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-07", "description": "Great quality but the portion size is not up to standard. I was surprised by how light and insignificant the paper bag felt when I picked up the order of sushi bento. For $14 before tax, it came with 3 pieces of nigiri and one roll in a small sushi takeout box. The nigiri and roll were well made, with fresh yellowtail and well-cooked rice, but each piece was small and weighed perhaps only 2/3 of what could be expected at any other sushi restaurant.\n\nI am not a big person, but I still left hungry after eating lunch here.", "author": "Honver L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "Zero stars!!! I spat out pieces of plastic. Please check your inventory to find out how this could have happened. People can get seriously sick from this.", "author": "Hanna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "I am not going to leave a long review here.  This is just a run of the mill  sushi spot. They have basic stuff that is nothing special. When they first opened they had some good reviews and I tried it but, never got to writing the review until now. If you are walking by and want a quick snack this spot is tolerable but definitely mediocre at best.", "author": "Howard A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-16", "description": "A bit expensive for the quantity and quality of sushi.    The fish were very fresh., but the roles were a bit simple.  The cashierless concept is fresh but confusing - especially during first visit, it wasn't obvious where one should place the order, and it feels awkward looking lost in front of other customers that are sitting in direct sight of you.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-28", "description": "It is a plus working in the downtown area to find great fresh sushi.  The taste was great but I do have to say I do not like the mechanical way of handling food.  Everything is machine fixed or packed in a pouch.  Also, lets mention the price is type steep for the food.  Overall, taste was good and location a plus.  I would rather it be a sushi bar freshly made by order.  The ginger too was even packaged smh... I wouldn't return but it was a quick pick for a healthy eater like myself.", "author": "Krystal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "It wasn't busy. I ordered a salmon bento box. Salmon bento box is on the receipt and sticker affixed to the bag. They gave me the wrong order. Also, this place is pricy for the location and for what you get ($15+ for lunch). Other than not getting what I ordered and the cost, the food is fresh. I will probably still go back because there isn't much competing in the area. But next time I'll check to make sure they are giving me what I ordered.  NB: no cash used here - only credit cards.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "I sauntered into Big Eye Sushi about 20 minutes ago while on my way to Kim's Market, which is located next door.  They offer \"boxes\", essentially 3 pieces of sushi and one roll. There's also platter options and sushi bowls. I just finished my meal and it was absolutely delicious - super fresh fish and the rice was the perfect consistency. I'll probably never come back to this place though as they are cashless and just happened to have my girlfriend's credit card on me, which is a rare occurance. Businesses that do not accept cash are discriminatory. Plenty of people do not operate with credit cards, especially those who are lower income. Anyways, awesome \u0026 delicious, but probably won't be back.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "The presentation and taste are impeccable I've had other sushi places in the area and this tops the others", "author": "Ashley N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-22", "description": "High quality full of freshness sushi. I always get the spicy tuna bowl and my husband likes to try everything especially the yellowtail jalapeño roll.... consistently good. The neighborhood needed something like this. I will support this local business.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-08", "description": "Salmon was dry and completely tasteless. I threw the salmon and ate rice only. A waste of money. Would never go to this place again.", "author": "Wei W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "Really fresh. For a casual place, I'd compare it to the other high end stuff like Sugarfish (which is, admittedly, better in CA than it is here). You can order online and it's usually ready pretty quickly. Get in on their loyalty program. Two free rolls after like 10 purchases or something, which is a pretty good deal.", "author": "Jasmine M."}], "servesCuisine": "Sushi Bars", "priceRange": null, "name": "Big Eye Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zsP_BmbazAZszmiOSH4FVA/ls.jpg", "@type": "Restaurant", "telephone": "+13475990188"}