{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-22", "description": "This DeKalb Market Hall location is my favorite of Pain D'Avignon's locations. I believe it's the only one of the three where pastries are actually baked on site, and if you get lucky with timing you can get some warm and fresh from the oven :)\n\nRecommended:\n-Walnut croissant ($4.25) - the walnut filling is not overly sweet and has good texture with some solid walnut pieces inside. It's not twice-baked yet the interior of the croissant is somehow still nice and light. You can still taste the yeasty flavor of the dough even with the sweet filling, which I really enjoyed.\n-Croissant ($3.50) - one of the top 3 croissants in NYC in my opinion (after L'imprimerie and the now-closed KarVér/Payard). It looks gorgeous and is super flaky outside. The inside is a bit on the chewy/greasy side, but it's still reasonably light. I didn't eat the ends, which were extremely hard, dry, and crunchy, but overall it was still enjoyable.\n-Baklava croissant ($4.50) - I got one of these fresh from the oven so that may have skewed my impression, but I really liked this. It wasn't the most texturally light or croissant-like, but it was still crispy and flaky and delicious. It has both lemon and pistachio inside, and it's not overly sweet or too syrupy.\n\nOK:\n-Kouign amann ($3.25) - it's ok but not my favorite KA in the city. The texture is more bready and chewy, and the caramelized bottom was too sticky and stick-in-your-teeth for me personally.\n\nPastries I've tried from some of Pain D'Avignon's other locations:\n-Hazelnut croissant ($4) - has a chocolate hazelnut filling. The one I tried (from the location in the Plaza) was not fresh, so the ones here might be better, but I liked the walnut croissant more.\n-Pistachio chocolate escargot ($3.75) - the pistachio filling was good but the pastry I tried was pretty hard (not in a crisp way).\n-Almond croissant ($3.75) - not bad but not as good as the walnut croissant. The filling is smooth and not overly sweet, but overall it was on the dry side to me.\n-Coconut chocolate croissant (black and white croissant) ($4.75) - this is a chocolate croissant with coconut cream. The filling is good and not too sweet, but the white chocolate on top was very sweet. The chocolate dough looks visually impressive but I found it bitter and salty rather than chocolatey.", "author": "Lena J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-29", "description": "I've only ever been here for two things and that is their coffee, and their walnut croissant. \nI'm a simple guy, when I see Stumptown roasters, I do not hesitate to buy a cup of coffee or latte. I mean can you blame me? The roast is just amazing and I've never been disappointed with any place that serves this roast and this place was no different so I recommend anyone who appreciates good coffee to come here.\n\nThe walnut croissant here blew me away. Perfectly buttery and flaky with a great essence of the walnut flavor. Almond croissants are usually my go-to but I think I found a new one! Give this place a shot when you stop by Dekalb", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "I was minding my own business, having just placed my order at Katz's which is directly across from this bakery, but their naughty little display of breads and pastries will lure the purest of souls, and I got sucked into their vortex of carbohydrate sex!  Never mind the sandwiches, quiches, and scones, I immediately gravitated towards the slices of loaf breads.  On this particular morning last weekend, they had Chocolate Olive Oil ($5), Lemon Olive Oil ($5), and a hybrid croissant bread pudding loaf ($6), though I felt the prices were a bit steep, it is seldom that I come to Albee Square and obviously Dekalb Market Hall, so I decided to get the choc and lemon to share with my hubs.  These loaf slices are not for the faint of heart!  They are dense and heavy, like a brick, but so damn delicious, it will make you a believer.  I have to say the chocolate olive oil loaf was out of this world.  It was so moist but not at all greasy, and the chocolate was not sweet or bitter, and just right.  The dusting of cocoa powder and that sprinkling dash of sea salt were perfection and I fell head over heels for it.  This loaf is similar to the Brooklyn Blackout cake from Ovenly bakery (another favorite of mine).  The lemon loaf was also great, but I think it could have upped the lemon flavor, and for some reason, this slice did seem a little greasier than the chocolate one.  \n\nIn the end, I'm convinced this one slice of chocolate olive oil loaf cake was truly one of the best baked goods I've ever eaten.  And, I can't emphasize enough just how masterful that dusting of cocoa powder atop the whole thing was for me, because it just knocked it out of the park!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-17", "description": "I occasionally find myself wandering around Dekalb Market Hall in the mornings, and Cafe D'Avignon:\n\n1. Is one of the only stands open at that time.\n2. Is the source of that delicious, buttery aroma that wafts around the entire floor. \n\nYou're not going to be sad about the croissants, the quiches, the cookies, the croques...but if there's one thing that I keep coming back to, it's the kouign-amann. If you've never had one, it is a magnificent mix of butter, pastry, and sugar, and it will singlehandedly make you fat. \n\nBut it's worth it, and the lady who hands it to me in the mornings is comfortingly just as bad at pronouncing it as I am.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-06-01", "description": "Ever since this place opened, it has been my favorite go to spot. Starting from the croissants to the cappuccinos. I love the coffee drinks from select baristas, especially from one of the female employees that has been there for a long time, maybe that is why. However, with plenty of new employees it seems that not everyone is meeting the proper standards of hygiene. I have noticed that a particular employee has been lacking proper hygiene which is not attractive to the business. He does not have a pleasant smell. Keeping hair properly put together, being clean and neat in the workspace, as well as smelling properly is essential to attracting customers to a business. I have been there with other friends and they have noticed the same issue. On any other day, I would have rated this spot 5 stars.", "author": "Raquel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-05", "description": "Kudos for being open at 9am on a Monday but if you are charging $8 for a breakfast sandwich you better make it good!  Well... it wasn't!  As you can see they are pre-made and then heated up (no problems with that.)  But it fell flat.  Needed some pepper and some kind of sauce. Lacked flavor.  Not getting my $8 again!", "author": "Holly W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "This place is picture perfect! Mouth watering baked goods and simple but good coffee drinks await, though beware: 1 coffee and 1 latte plus tip can easily set you back $10 or more. \n\nNot an everyday indulgence but definitely a delicious once-in-awhile treat!", "author": "Yasmin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-06", "description": "Right after picking some groceries up from Trader Joe's we decided to grab a afternoon snack. The drop coffee is pretty good. It wasn't bitter at all. The chocolate scone we got was definitely a fail. It tasted stale, hard, and like it was made days ago. I was not impressed at all. I'll just stick to the coffee next time.", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "Moxy Hotel location -- I stopped in yesterday on my way to an appointment.  I had a small window of time to order a coffee and breakfast.  I ordered the avocado toast and it was out of this world.  The toast was crispy on the outside but moist inside.  There was a hard-boiled egg on top with a garnish of dill.  It was soooo good!  The staff was accommodating and very kind.  I did sample pecan toast which is something I am going back to try.  This place is a hit - don't miss it!", "author": "JoAnne C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "Food: 6/10\nService: 6/10\nAtmosphere: 5/10\n\nCafe D'Avignon has a pretty good sized setup at the Dekalb Market Hall, and is easy to find near the entrance to Trader Joe's.  The offer a pretty wide variety of classic French pastries, sandwiches, and coffees.  In my one visit, I tried the Croque Monsieur.  It checked all of the boxes in terms of ingredient list, but seemed awfully reliant on butter and the bechemel sauce, which made for a greasy, heavy affair (a bit too much so when you have to go back to work).  Given the large number of bakeries and coffee houses in the area, I wouldn't recommend going out of your way.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "Server was nice and coffee tasted okay but it was not hot, which is kinda important when it comes to coffee! Wished I could've microwaved it...or something. Sad, I know.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "9am on a Sunday morning, this place is one of the few lively booths in Dekalb Market Hall while the others are still waking up from slumber. A short line of early birds waiting to get their breakfast savories, pastries, and coffee - and delicious they all are! My smoked salmon bun was heated up in the back, melting the whipped dill cream cheese and toasting the brioche bun to just the right degree of flakiness. Wide selection of breakfast sweets in the bakery section and the coffee is great too. The quiche and croissants look extra buttery and flaky. Lovely place to start your morning off or to pick up a mid afternoon snack!", "author": "Yang Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "The $2.45 cranberry pecan cookie tasted like 2 pounds of butter in a one pound sack. Not bad per re but even after finishing the cookie I can taste a buttery aftertaste, as if I'd just directly eaten a spoonful of butter without anything else.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I started stopping by the place since I found out they sell some of the best kouign amann in nyc, which naturally lead me to their other pastries. Some are a bit odd, some absolutely divine. Everything tastes quality and freshness. And the staff is always friendly and helpful. It's my small indulgence after going through a Trader Joe's shopping trial. Can't wait to try something new on my next grocery trip", "author": "L T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "4 stars for the flaky, buttery perfect pain au chocolat I had here early one Saturday morning. Well worth it. Plus it always feels nicer seeing bread freshly made and on display. I'm sure I'll return since it lures me over whenever I try to make it to Trader Joe's.", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "I have nothing but love for Cafe D'Avignon. I've been to Essex St location, this location seems more substantial. \n\nThe folks here are the baking up some fine French pastries inside the Dekalb Market Hall. I'm looking at the pastries and baked goods on display, I see a \"walnut\" croissant?? This is something I have never tried, my go to croissant is Almond.\n\nAlso on display are various salads \u0026 sandwiches. I went straight to the Croque Monsieur. The Croque Monsieur is topped with Black Forest ham and a béchamel sauce. All on thick, funky sourdough toast. Sold! I don't have to look at anything else at this point.\n\nI'm walking out with my purchases, the walnut croissant was flaky but I'm still with team almond.\n\nThe Croque Monsieur on sourdough toast was the star of the show. This was a nice treat that I had the next day for lunch.\n\nThe coffee being served is a Stumptown roast. If you're looking for a French \"anything\" I recommend stopping by the Cafe D'Avignon area.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-12", "description": "That place made me ashamed to be french came for breakfast had one of their sandwiches with eggs and bacon it was cold and made a while back their croissant tasted like crap what a shame", "author": "Eric A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "I was feeling a pastry kind of morning and having eaten at cuzin's dozens a few times decided to try this spot. I was thrilled to learn they have the difficult to master kougie amann on the menu, (for only $3.50!) and got the original and a fig and goat cheese version. I started in on the original and found that it was quite unlike the other versions of this pastry I've had around the city. There was no custard-y inside, but just flaky pastry dough kind of baked to death on top of some sugar that had caramelized, then candied, and pooled at the bottom for a pull-your-fillings-out kind of experience. I took a few bites and decided it just wasn't worth continuing. Mom picked it up and I honestly warned her about the caramel stuff- she wasn't really too much of a fan either. Then I ate the fig and goat cheese one- this one was much closer to what I expected from the first. The killer for me with this was it was savory- dusted not with decorators sugar but kosher salt. There were also disappointingly few digs inside. But if they could get their original to this shape/consistency/inner goodness, I'd be a fan. Or if they added sugar to the fig and goat cheese. Overall not a place I'm in a rush to visit again.", "author": "April H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "I'm a big foodie and eat almost all my meals out so def know when I've found a hidden gem. This cafe is incredible!! Their avocado toast is out of this world- I can easily say it's one of the best I've ever had. And all their pastries are delicious. The cranberry pecan cookie and almond croissant are my favorites... but literally love everything on their menu!!!", "author": "Alexandra I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I didn't expect to stop here (I was very early for Trader Joe's), but I was pleasantly surprised. They were one of two early open vendors and the staff was very nice especially for the morning. The bacon egg and poppyseed bagel was DELICIOUS. I wish it never ended! It was very filling and I would recommend it to anyone. I also got an iced chai which was very good. The only con about this place is that both of those together were about $14, so definitely not good for you wallet, but worth a special breakfast here and there.", "author": "Brooklynn K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Cafe D’Avignon", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/vVPRcR_zjbC7SCGiIEEYEw/ls.jpg", "@type": "Restaurant", "telephone": "+19293784848"}