{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "amazing lattes, staff, and baked goods! i go here several times a day and the lattes are the best that i've had. everyone is really nice. i love the ham and cheese croissants", "author": "Lina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Came to this place at the DeKalb Market and the croissants were calling for me! The pastries are baked right there (always soothing seeing the baker brush butter all over the croissants before popping them into the oven),\n\nI got the spinach feta quiche which had currants and toasted almonds. It was very light and airy, delicious. The croissant was also on point, very flaky, I think the best I've tried so far in NYC. I'll be back!", "author": "Mahsa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-20", "description": "I was disappointed yesterday when I ordered a cappuccino to find that Vanilla was the only flavor they offer to add to coffee.  I'm not sure vanilla is even well-matched to coffee.  How hard is it to keep Hazlenut, Mocha, etc.?  The coffee was good though - but the lack of flavors just seemed lazy.", "author": "T G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "This evening  was my first time visiting cafe D'Avignon on Dekalb ave and I must say the customer service was phenomenal  from the cashier being really patient with me while I took a while deciding what I wanted to get because there were so many options , while i was deciding she could tell I was really hot so she offered me a glass of cold water , she then began to recommend me a beautiful pastry called a kouign Aman she described how it would taste and it taste exactly how she described it , she was great very patient and sweet , I then ordered a vanilla latte , the barista patiently described the different types of milks there were and even though I decided to choose whole milk she still smiled and had a great attitude and we began to talk about the weather , when she finished my drink I was so shocked at such beautiful latte art I had to take a picture . I highly recommend everyone to stop by this cafe the food and drinks are amazing and the customer service is wonderful", "author": "Jasmine J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Had a quiche Lorraine and a latte on a Friday morning around 10 am. Very tasty and quick service. Good if you want a fast option just a little pricey for a quick service restaurant.", "author": "Cindy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Perhaps our favorite place at Dekalb. Staff are friendly, coffee is strong and breakfast treats are wonderful! I love their waffle cake and kohhie Aman. Their scones are best when they are fresh from the oven. Yes this place is pricy but it's worth it!", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "This review is for the espresso bar - I haven't tried the food yet, but will!  I was at Dekalb Market before a movie at Alamo, and was in dire need of caffeine.  Luckily, I stumbled upon Cafe D'Avignon and ordered their special honey cinnamon latte (I say \"special\" b/c I think they feature different homemade syrup flavors throughout the week).  THE HONEY CINNAMON SYRUP WAS GAME CHANGING.  I was licking the last remnants out of the cup.\n\nService was great, latte was life changing (wish there was a location nearer to my apt or work cause I would go every day!).  Only slightly negative call out is that an approx 8 ounce latte, with the special syrup and skim milk was $5.72 - kinda pricey. \n\nDef recommend - it'll caffeinate and delight!", "author": "Katie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "I didn't try anything here but the cold brew, but it was memorable cold brew.  \n\nWarning: the double layer cups are still hot.", "author": "Xiaoyu Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "The comte kouign amman is subpar. Not only was it cold, they didn't offer to heat it up. A kouign amman should be flaky. This was not. It was super dense. A cheese kouign amman is better eaten warm. That way the cheese flavor would be more noticeable. But the fact that you serve anything cheesy without offering to heat it up just reflects in the service. If this was warm or if they offered to heat this up in toaster for a minute would have made a world of a difference. Coffee was not bad but nothing special. One done.", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "Worst chai latte I've had. Save yourself the $5 and walk 10 minutes up to Paris Baguette where they actually know how to make one. Don't make the same mistake I made", "author": "Taner B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "I would normally give this cafe 6 stars not only 5 but I have to give it 4 today only so that Managment can direct this appropriately.  I'll start by saying the coffee, food and most importantly the supervisor (i think that's what he is) from Turkey (how exotic!) are AMAZING always soooo nice. BUT this morning I show up a bit earlier that normal in hopes of getting my coffee right before heading into work. It was 6:59. Literally. As I walk up the young girl (seemed new , African American with braces) was counting money. I asked if I could order and she not even looking up said- we aren't open. So I waited for a whopping 45 seconds till my phone showed it was 7... then patiently waited till she finished counting her bills and then again asked if I could order since I wanted to not interrupt her counting. Her reply was \"you already did\".  I apologized even tho I didn't have to. Just so that I can get to the ordering part and Leave. I asked for a cappuccino. She then turned to another employee who was in charge of the coffee making (african American young guy with head phones in his ears) he responds with \"we don't make those now\" and I said \" what do you mean?  I get cappuccinos here every day, I live upstairs \" he then proceeds to say \"she can have potted coffee\" even though I was standing right there. I asked \"why?\"  (It's now 7:05) and he said because he doesn't have a rag and apparently has to go downstairs to get the rag then proceed to clean the coffee station before making any cappuccinos and didn't want to make mine even though they were already open because then he would have to continue making it for other people and he wasn't ready yet. No apology, no \"so sorry we aren't ready\".... It felt like \"please leave \". If I didn't know the supervisor and how nice everyone else is I would never be back there.  The last thing someone wants first thing in the morning is all that attitude.", "author": "Alona T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "Great coffee spot inside the Dekalb Market.  They appear to have quite the variety of baked goods.  I sampled a quiche which was pretty good.  Ended up just getting an iced latte since I had just grabbed lunch.  It was a nice strong brew, not too bitter or anything either.  I think a lower acidity from what I recall?  Anyways, a great cup of coffee to top off lunch.", "author": "Bryson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "The staff is friendly and provide good service. The lattes are great, I can't remember who supplies the coffee but it has a good flavor. The chocolate olive oil bread and lemon cornmeal loaf are flavorful  and moist. The only thing I didn't love was the quiche Lorraine wish it had a little less salt and maybe a little heavy cream to give a smooth texture to contrast the flaky crust.", "author": "Kaye L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "I would give Cafe D'Avignon six stars if it was possible! This is the best place in DeKalb Market.\n\nQuality: I've come a few times and the breads are so good. On almost every occasion, they had freshly baked breads and plenty of samples to try. I still dream about the raisin pecan loaf.\n\nService: The customer service is unparalleled. The manager, T, is such a nice and friendly guy. He always has the best recommendations and treats so well. Part of the reason that we've come back so often is because of him!\n\nVariety: There are so many different types of breads to choose from! I'd recommend (again) the raisin pecan but you can't really go wrong. It's not just breads and pastries -- you can grab coffee, sandwiches, and other menu items to hold you down.\n\nSpace: It's grab and go but there are plenty of seats in DeKalb.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "The coffee is amazing! I loved it!  Delicious! Employees  were very nice. This place looks trendy.  A little pricey  but totally  worth  it.  I will be back", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-18", "description": "Definitely not coming back here. This place is falsely advertising their products. Their menu has much less expensive prices on their pretty sophisticated website. I was excited to try this place because it appears to be aesthetically french. First they only had one quiche available (their menu has several online) and the price in the actual location is a whopping $9.25! With tax that's $10 for a slab of quiche. The website says $7. The cashier asked the manager about it and she just stayed in the back and didn't even come up front to apologize for the huge increase in price from what they are advertising on their website. Using an excuse as \"our website isn't updated\" is the worst customer service attitude. I was hoping she would be happy to adjust the price since that's their wrongdoing but clearly that wasn't going to happen. I did not order the quiche and left with a skim cappuccino and a plain croissant that tasted like any other run of the mill coffee and croissant. This place is a rip-off.", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "I tried this cafe twice.  The first time I had a chocolate chunk scone, which was mediocre.  The second time I got a smoked salmon sandwich, which, in retrospect, I sincerely regret not noticing was not refridgerated.  I paid dearly for this mistake, as I suffered the worst bout of food poisoning I have ever had in my life.  Please be very careful when ordering any food that must be kept either hot or cold.  I do not trust their judgment in this regard.  I was seriously ill, and I do not recommend eating here.  You have better options in the food court.", "author": "Victoria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "The word that describes the experience here is \"fresh\". The baked goods literally roll out of the oven and into the assorted displays -- and you have to grab them up before they're gone in the morning rush! The coffee is strong and balanced and he staff are polite and sweet.", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "I live in City Tower and have come to Cafe D'Avignon so many times for coffee and a quick breakfast. I had always been pleased with them until this morning when I paid $12 for a small cold brew and a day old salmon sandwich. The sandwich used to be $6 and went up to $7.50. That was fine with me until I bit into what was unmistakably stale brioche and not-so-fresh, stringy salmon. If you are going to raise your prices, don't decrease your quality.", "author": "Vanessa R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Cafe D’Avignon", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/vVPRcR_zjbC7SCGiIEEYEw/ls.jpg", "@type": "Restaurant", "telephone": "+19293784848"}