{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "Academy is a solid diner option, open early, with friendly staff and a can do attitude. Service is fast and to the point and they make a point to remember the regulars. With big booths and open windows, it feels very neighborhoody and we enjoy people watching here. \n\nI'm exclusively here for eat in breakfast, which has a very affordable menu and solid options.\nPancakes are hit and miss- sometimes having a touch too much baking soda, but were excellent the last time I was here.\nSouthern breakfast was hearty and a big plate. \nFrench toast is my go to, hubby likes the Belgian waffles\nThe breakfast sandwiches are good and not very heavy, with a nice soft roll.\nThey refill coffee and top off tea cups with hot water.\n\nCASH ONLY. But with the prices, hopefully you won't need it. They have a clean bathroom and high chairs. 3.5 stars", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-04", "description": "Good for breakfast but the owner, an older gentleman is a complete turnoff.  He has a sour disposition which doesn't make you want to spend your money in this place.  His family members are a different story, his son and I think it's his granddaughter are pleasant and welcome you to the restaurant.  \nAttitude is everything and I'm done with spending my money in a place where the \"owner\" doesn't appreciate my business.\nPlus a side note, the bathroom often doesn't have soap or if it does, it is so diluted that it is nit effective.  A scary prospect when you know the employees are dealing with your food.", "author": "Pat H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Service: 5 stars\nPrice: 5 stars\nRubber pancakes: 1 star\nGoopy syrup: 2 stars\nCrispy bacon 4 stars\n\nThey seem good people. Affordable places need to be supported to stave off the demons of gentrification. Maybe it was a bad pancake day, or just a weak spot on their menu. I'll come back and try again.", "author": "Vas S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "Charged an additional $3.00 for subbing hash brown for home fries when on a la carte menu, price difference is $.50. Restaurant had already made the food and sent it out for delivery without verifying the additional charge as other restaurants do. Received the food while food delivery app rep called about the additional charge... Rep said they were charging $2.75 when hey actually charged $3.00. Totally unacceptable to push whatever the hell charges they want...", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "Ordered delivery from them.  Got a breakfast side order that I have gotten from them in the past with no issues.  This time, they delivered an item I didn't order so I thought maybe they mixed up my order.  I called them up only for the guy on the phone to almost immediately yell at me that I'm wrong and that there is no such menu item even though it's listed in the breakfast side section.  He kept yelling at me saying I'm wrong and that somehow he did me a favor by sending me an item I didn't ask for.  What I don't understand is if the price is wrong, why didn't the restaurant call me saying there was a mistake before delivering my order?  I guess I will never know since I'm never giving them business again, and there is absolutely no way I would recommend this restaurant anymore.  Food is typical diner fare, but customer service is clearly beyond terrible.", "author": "Jerry Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I really like this dinner! It's tow blocks away from my home so I have eaten there many times. The place is small and simple, but they have a huge menu of different kind of delicious dishes: omelettes, eggs, sandwiches, salads, hamburgers, wraps, meats, pasta, pies, soup...everything! The prices are really good and the service is very good too, they also have take away option. Only cash.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Very solid NYC diner. Has everything you want for the right price. I just wish it took credit cards. I've never had a bad meal here and l the wait staff is very friendly. In a time when diners are being forced to raise their prices sky high or shut down, it's nice to see a place that still manages to be affordable and quality.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "Was going to have lunch at the Smoke Joint across the street but they were closed for remodeling so I went across the street to the Academy Restaurant \nHave not been in a real diner in years \nDecent cheeseburger.  They don't refill ice tea orders,  when was the last time you saw that\nBut the reason for the low score,  there was a frozen ant the ice cube of the ice tea. Maybe a good thing I did not a 2nd glass.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "No frills, kind of place\n\nAcademy is like any other NYC-type of diner, which is not a bad. Standard breakfast and comfort food is Academy's MO. The service is pretty fast, one can be in and out  under 30 minutes by ordering a regular diner breakfast. Is the service super friendly? Not really. But, it is not rude.  The prices are pretty similar to other diners in Manhattan. If I am in the area early in the morning, then I would drop by to grab an no frills omelette.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "This restaurant has terrible management. The wrap I ordered was delivered without any of the ingredients described on the seamless menu. When we called to alert them, the manager began arguing that the ingredients (clearly stated as included) were optional and therefore it was my fault. He not only refused to rectify the situation but also said he wouldn't correct the description on seamless and then hung up on me.", "author": "Meghan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-11", "description": "Our sour grapes waitress grabbed our butter dish when she cleared our plates. I watched her try to be stealth and recycle it. Your trickery can't fool me!  Gross, watched our used butter dish go to someone else's pancakes.", "author": "Courtney P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Before endeavoring to walk across the Brooklyn Bridge I wanted to have a filling brunch. Yelp helped me find this straight forward no frills diner not far from the Atlantic Ave/Barclays subway stop. We were greeted and seated by our no nonsense waitress with the thickest \"NooYawk\" accent. Very nice lady, she addressed us all as \"hon\". Quickly our food arrived. The California omelette was thick and filling, the chicken in the chicken and waffles featured \"fall off the bone\" tenderness and my cheesesteak was a delicious, generously sized treat. French fries, oatmeal and the coffee all rate a MEH. The solid comfort food is great but I'm taking off a star for lack of any ambience and a \"cash only\" policy.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "A fine example of an indispensable but disappearing genre: the NYC coffee shop/diner. Has all the staples and a friendly waitstaff (except the cashier). Here at least once a week.", "author": "Doug H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "We have been ordering for the last 20 years and this morning after being on hold for about 5 minutes, the woman came back on the line and hung up. After calling back, she said that she was too busy and couldn't finish the order, but she could do it now. She took the number and didn't even ask for a telephone number or write down the apartment order. She was not apologetic or anything. I understand that restaurants are busy but instead of hanging up, she could have handled that situation better. Despite being treated horribly, my mother still remained calmed and gave the respect that she clearly didn't deserve.", "author": "Gigi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Work was hard today. Putting a meeting together by yourself is exhausting. I guess my boss recognized that because he asked me and another associate if we wanted lunch. Let me think, boss is buying lunch, definitely! He said this place was on his radar so he wanted to try it out. This place was \"Academy Restaurant.\" We walked over and at first glance it's not very special. But looks are deceiving. When we walked in we were told to sit anywhere we wanted. This was a business lunch so it was better for us to sit in the back. The waitress, who just started was very nice. She came over and took our drink orders and got them right away. She was very knowledgeable about the menu. When she came back we ordered and she quickly put the order in. I was pleasantly surprised with how fast the meal was ready. I was disappointed however when my broccoli came out to be hard, I asked for soft and she told me it would come that way. Also the butter they used had no real flavor. I completely enjoyed the Parmigiana, it was delicious. My boss felt the need to share his meal with me and I really didn't want to argue with him. I told him it was my first time trying the Ruben. He said it's really good so I took a piece. I can't believe what I've been missing. It was delicious, truly flavorful. I finally see what all the talk is about. In hindsight I should have goto one at a place in Manhattan that closed down (It will remain nameless). I will definitely try it again. This place is nice just to grab lunch, it's not really a place you bring a date, but it's definitely worth a visit.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "At my mom-friend's recommendation, the four of us came here for lunch after a 2-hour play date in Fort Greene park. \n\nRefreshed ourselves from the sun and sprinklers with turkey bacon, onion rings, french fries, a turkey cheese burger and a turkey reuben and lots of ginger ale. The food was decent. Any place with decent onion rings gets a vote from me. No complaints here except my turkey reuben was a little dry and the cash only policy is a bit inconvenient since I don't trust non bank ATMs, like the one in the foyer of this not-so-cute diner. \n\nThe meal portions are abundant and the prices are about average, not cheap. A little bit pricey for me because I know I could get better quality food nearby.\n\nAcademy is a family-friendly place though. Good enough to bring the kids for a quick lunch. The environment is lacking where the service is helpful and friendly with the kids.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "I've ordered at least 3 times prior to this time. This was my fourth time and is my last time. There were 2 hairs in the home fries. The corned beef hash tasted disgustingly bland and I just couldn't eat it. ( I mean it!) And there's no jelly in my \"bagel with peanut butter \u0026 jelly.\" It was just peanut butter alone. Overall the experience is just gross this time. I only ate the bagel but did I just spend $25 for a bagel with peanut butter on it? I am just confused. Idk what happened to the restaurant but I ain't ordering ever again.", "author": "Yarong W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "This is a good diner,if you get a waitress with experience. I was late to meet my co-workers today and was in a hurry to get back to work. All I wanted was an orange juice. She came to the table 3 times. I was trying to place my order, but she seemed flustered with my other 5 co-workers and their 5 water glasses and 1 orange juice. I told my coworkers I had no time to wait and she was not taking the order, so I escused myself and I got lunch elsewhere. Later after talking to my coworkers, they informed me that te waitress only gave 1 menu for 6 people before I had arrived.  They felt that something was wrong, but could not understand.", "author": "Brenda O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "lovely breakfast portions ! always tastes fresh but the price is a bit high. The omelettes are really good and the hash browns . \n\nI also love the pancakes with icecream ! \nservice +  delivery is always great. \n\nduring the holidays they make great hot open sandwiches with mashed potatoes for me its wonderful as well.", "author": "Rose R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-27", "description": "I decided to order the Texas burger, after my colleagues raved about it. I was not impressed at all. I guess they had extra trimmings, which I was not privy to when I decided to try it for myself. I liked the fries, coleslaw, and pickle that accompanied the burger. Great service, nice quiet space mid-afternoon. I could never pass on sitting in a booth, feels like the Happy Days sent minus the jukebox.", "author": "Kristia B."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}