{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "I walk past this spot everyday..but i just realized last week that they close at like 4pm...so saturday i made it my business to check it out for breakfast...good lawd all mighty am I happy that i did. The breakfast was great and the service was top-notch. I order the 2 fried eggs w/cheese, home fries, turkey sausage and toast.my meal came with coffee and OJ..all for a measely $6.50..everything was really good and fresh! I gave them -1 because they close so earlier..u know sometime i like breakfast for dinner...and that is not an option over here.", "author": "Bev G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-04", "description": "Right down the street and around the corner from BTHS.  I used to come here every morning and eventually skip my first two classes.  I still stop by about once a year if I ever get the chance and the waitresses still remember me! I would have the #5 everyday for eggs any way, potatoes (inlcuding mashed), toast, and coffee or tea. Great start to a day and down right hospitable.", "author": "P C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "I don't go here for the service, but the breakfast is fantastic.  I love breakfast food, especially from diners, and this one is just the perfect diner for this.  \nThe portions are very filling, the food tastes great, it's quick and clean.\nThe service is not the best, but it's what I would expect from a low-end diner.  Our waitress, however, was very friendly (although she seemed overwhelmed), cheery, and nice.\nI say go here if you're starving and want breakfast fast.", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-22", "description": "Breakfast on a Saturday at 11:00 am.  Not a fluke you are going to busy.  Horrible over all management of place,  Not enough servers to accommodate all tables that they kept filling.   If you don't have the staff warn people you are going to be delayed or don't seat them until you can deliver good service.     Staff over worked and understaffing lead to--delayed delivery of food ordered, all sides  late and wrong and not all meals brought out at same time.  Forget enjoying a second cup of coffee.  Food is only a 3 star.  Nothing out of ordinary.  So many other places to enjoy a meal out.  Go elsewhere.", "author": "Lovegrub W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-28", "description": "This diner is right in my backyard just around the corner from me.  Very nice prices, the best Yankee bean soup I have ever tasted next to my mama's.  They also have very good short ribs.  Small quaint place. Only open from about 6 am to 4 pm.  So if you are in the neighborhood try it out.", "author": "Catie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-26", "description": "Disrespectful Staff Unsanitary conditions  My mom and I stopped in here one sunday morning, The menu says Eggs any style+bacon or sausage etc at a certian price. So we both decided we wanted to order a omlette style egg with bacon, So we wait and I look at the table and realize it was filthy, And look at the utensils and realize they are dirty so I ask for a set of clean utensils. The waitress gives me a set...ok good, then we get the breakfast it wasnt quite what we ordered but ok we dont make a big deal on that. After we eat we get the bill and it was get this....26 dollars for 2 breakfasts. Eggs and bacon with toast. We goto the manager and ask why is the bill so high. The waitress comes out and says we ordered \"special eggs\" because we said we wanted it omlette style. The menu says eggs any style so we got the impression we had a choice to have eggs any style we wanted. They said they only do eggs 3 styles sunny, side up, over easy and scrambled and eggs done any other way would be charged as an omlette (note the menu doesnt state that it says any style and the waitress doesnt explain to us what the limits of any style is) Overall the service sucks the management is rude and acts unnecessarily so...and you may get food poisoning here so id not recommend it.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-22", "description": "I am surprised this is still the only diner in the neighborhood after a couple new restaurants popped up.  I always love eating at the diner.  Food are usually good and comforting.  This diner's food is nothing near good.  I usually order breakfast from them since they are right next door.  Avoid their omelette's.    Eggs are done pretty bad.  The only thing I like from them is the baked chicken.  I don't expect high quality food from diner but this one is not that great at all.", "author": "Loretta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "I love this place. Its an old school diner. What you see is what you get. The wait staff are friendly and fun. The food is good quality diner food. Its cheap as all get out, and they deliver about 10 minutes after you order. For real. I hope this place doesn't get washed away by a Connecticut muffin.", "author": "Moss S."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}