{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "It is a good place to go when you want ok diner food at a reasonable price.", "author": "Spencer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Saw the reviews on Yelp for this place, and I'm glad to finally discover it. This place is literally behind my building so I will be going here often. My wife and I were hungry for some breakfast food around 6 and decided to stop by after reading the good yelp reviews. As we approached, we could see people inside, but they were mopping the floor...not wanting to be rude (they were supposed to be open til 7), I asked if it was OK if we sat down. The woman host was very nice, sat us down and got us 2 Pepsi's. We both ordered the lumberjack breakfast or something which consisted of 3 Pancakes, 3 sausages, and 2 eggs. Everything was delicious, and relatively cheap too. I will be coming back here, its nice to have a diner as well as some cheaper brunch food (as opposed to General Green, etc.) within walking distance", "author": "AJ K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "When my bf and I crave a hearty brunch, Academy diner is the first spot that comes to mind in fort greene.\n\nFast service , tasty omelettes, and big portions for a fair price.  I always find myself happily stuffed when I leave.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "if you're looking for cheap easy breakfast food, then this is your place. Nothing fancy about this place... just a good 'ol diner to help your belly feel satisfied after a long night, or a middle of the morning waking up eating spot.  \n\nThey have grits, friendly efficient service, and a clean bathroom :)", "author": "Rhonda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Sometimes I really crave a pair of eggs over easy.  Some toast to wipe up the remnants.  A small mug of acidic coffee to wash it all down.  A busy woman to call me sweetheart, and unexpected flourishes (the greek salad has anchovies, the grapefruit juice is pulpy).\n\nThe familiar weight of a laminated menu with outlandishly large pages.  A wipeboard of daily specials that I nod at but never order, Hello Turkey Chili, nice seein' you again, twice in one month!  Non-gentrified prices.  A counter, rotating stools (oops, you know what kind I mean), and enough booths for everybody.", "author": "Ying L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "This was my mandatory and daily breakfast stop on my way to BTHS every morning for 3 years. \n\nI stopped in recently, they saw me and blurted out 'Toasted Cinnamon Raisin Bagel with cream cheese and a Peach Snapple'?\n\nI was SHOCKED! I haven't been there in like 10 years! They still remember what I like to eat? And what I look like? Amazing.\n\nTheir bagels are great, and they put on tons of cream cheese just like they should. I love them.", "author": "Inna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "Straight to the point, its pretty much your average neighborhood diner. Been around for YEARS!\n\nI ate here twice over the past week. Quick, clean, good service \u0026 relatively cheap. My cousin is in love with the blueberry muffins that she claims has been the same since she was a little girl. She always gets it lightly toasted. Yum!\n\nI had an egg white omelet with tomato, onions, peppers \u0026 cheese, home fries/potatoes and wheat toast for about 7 bucks. The second day I had a belgian waffle with scrambled egg whites.  Simple breakfast prepared to my liking.", "author": "Maisha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-31", "description": "I don't know how you screw up a fried egg hero, but this place has done it.  The food was edible, but that's about it.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "Breakfast was fine (eggs perfectly cooked, succulent turkey sausage, slightly undercooked homefries (boo!) and late toast). Service was pretty good (except for the late toast and our disappearing waitress). Coffee was refilled...as was water. The 'calmness' of breakfast was undermined by the constant jittery muttering/complaining of another waitress who seemed to need a cigarette.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "As a resident in the neighboorhood, I finally got a chance to have breakfast there last Sunday (4/3).  I thought my breakfast was pretty good especially the French Toast and the price for the breakfast special was just right.  It's nice to know I have another option for an early breakfast instead of going to Junior's.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "This place is amazing!!! Best food and fast service!!!", "author": "Chris M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-07", "description": "It is a terrible experience. the condition is i pay the order online and i think it will be delivery. but it need to pick up and i don't want to go to pick up so i call the restaurant. I ask them for the delivery but they say they can't do it. I think that's ok because it's my fault and i told them i still will pay but i can't go to pick up the food it is too far. i said i am sorry and let them give the food to someone who want it. then they hung up on me!!!twice!!!!! because i can't believe what happen and call them again so they hung on me again!! what a awful service!!", "author": "Jen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "The food here is yummy and the service is good! Sometimes New York has some of the best secrets are right around the corner! The service was very wecoming the atmosphere felt safe and warm! The food was quick and well prepared. I ordered the eggs,susege and home fries platter. It came with OJ, Coffee and toast. For what I payed it felt like I got more them I paid for meaning good price! So if your looking for some good food served by nice people this is the place! And don't forget to leave a tip before you go!", "author": "William L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "Yay.  \nIts the go-to diner in Fort Greene.  Clean.  Fast.  Good.", "author": "J G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "Great little low-key neighborhood joint. No frills here! Lots of locals, and the same little older women are always there, ready to take your order as soon as you sit down. Props for the free OJ with breakfast.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-24", "description": "Been a regular here for years.  This place is a true diner.  The staff is wonderfully sweet and welcoming, and the prices are perfect real diner prices.  Anything on the menu is great hearty American food.  \n\nA staple I wish every neighborhood had.\n\nIf the neighborhood rents ever increase and threaten to kick them out - I wish a community fund were in effect just to keep Academy Diner in existence.  They deserve to be here forever.", "author": "Nathan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-15", "description": "Okay, the water sometimes tastes like sweat, and the food, though it tastes pretty good going in, will give you that typical feeling of a grease grenade going off in your stomach soon enough afterwards. But it's a diner, what do you want? Fort Greene needs one, and every so often I'm glad I have this place, which will let me cram eggs, bacon, toast, corn beef hash, coffee, and juice into my gullet--all for like six bucks plus tip. The wait staff is friendly in that homey-dinery sorta way, even for Brooklyn. My only real complaint is that I wish it were open for longer hours, maybe even 24 hours. But then again, in this neighborhood, that might just ruin it.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "I work a few blocks away, and I used to order lunch from Academy most every day. I can't say enough about the quality of the food, the portions, the service, prompt delivery time, etc. - it's all good. They also have a diverse menu with a lot of choices.  This is a cut above your average diner. Unfortunately, they know it now, and their prices have been gradually rising. About 6 weeks ago, there was a significant price spike that I simply couldn't tolerate - can't spend between $15-$20 daily for lunch. I went from ordering 3-4 times a week to maybe once every 3 weeks. It is becomng a boutique eatery, which is fine if that's what they want to be. I am sure my dollars won't be missed too much judging from the hipster crowd with seemingly unlimited supply of time and money. I will still go there - but it will have to be around pay day when I want a \"treat\" - it is no longer the everyman's diner.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "I deliberated for a bit about whether to give this place two or three stars, but decided to go with three for the simple fact that the service is super quick.\n\nI don't think you'll find anything amazing in the traditional diner food prepared here, but if you want some cheap eats served up quickly, albeit on some pretty beat up plates, Academy is a safe bet.\n\nOne thing that I liked was the fact that this place felt like a neighborhood favorite, as more than a few customers were greeted by name by the waitresses, who even knew their typical orders.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "I have had nothing but the best service and the best food at this place. It's family owned and operated and you get a taste of that as a side order with your meal evey time you go :) It's just like being at my mothers house over the holidays. I sit at the counter listening to the great oldies they have playing on the radio eating my chicken and waffles with a red stripe beer to wash it all down with. It's delicious!!!!!! Thank you academy!!!! Your the best!!!!!!", "author": "Kayla K."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}