{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "TERRIBLE CUSTOMER SERVICE: I was so excited to try the lemon chicken soup after seeing it on Yelp. Placed my order via seamless and got chicken noodle instead. Called the restaurant as I assumed it was a mistake and I was laughed off by the manager who said seamless got it wrong (not the rest) and to just enjoy it as its close to lemon chicken. Unpleased with this answer I called seamless and they called the rest. back and the manager said he had no recollection of our conversation and it didn't happen. It's an unfortunate thing when a business does not care about doing the right thing. This was my first and last time ordering from this place. My other food was sub par at best and they also got my egg order wrong. Avoid at all costs, decide on giving another reputable business your money than this juke joint!", "author": "Tierra M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "comfortable place to have a meal BUT their prices are out of sight.  $12.00 for spaghetti and they don't offer bread or a salad with it.  The place is not a five star restaurant.  It's a diner.  \nThey need to get real and realize not everyone is going to support their prices and their price increases.", "author": "SirEthan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "I stopped in here the other day for breakfast before work. Nice little spot with a solid breakfast with GOOD PRICES! Coffee wasn't very warm so I asked for another one and the 2nd was perfect.\n\nI will be back", "author": "Charles H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "I woke up on a rainy day and wanted pancakes so I picked the first 5 star restaurant I could find. I had the chocolate chip and my boyfriend had plain. They were ok but you could tell a ton of butter had been put on the side and melted all over the pancakes on their way over to us. Not a fan of butter on my pancakes so it may not be a place I order delivery from again because you never know what to expect. I like delivery that thinks ahead and puts thing in containers on the side. Food was good overall though!", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Great food!!! 4 star because the waitress was slow and threw the food on the table... Great people though!! Please eat here", "author": "Nassia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "This place brings back memories. Do you remember those days in college when you would go out with friends for a night of raving and if you got separated, everyone agreed to meet at a local diner in the morning? And there would be the comics section in the local newspaper to catch up on?\n\nWell, now I am beyond my years of raving. But I can't help to reminiscence. \n\nI came here this morning to catch up on some work and to have a sit down breakfast. I have always had a thing for diners. It is comfortable, homey and you get to hang out as long as you want. \n\nThe waitress was nice and even complimented me on my earrings. I ordered up some French toast, two sunny side up eggs (I like them runny), and some home fries. It was a perfect morning meal. \n\nI like that they have a sit-in area with old school swivel chairs. You can sit at the counter and chat up the owner and cook. \n\nI dig this place. It reminds me of a place back home. And it reminds me of all those nights of raving and meeting up in the morning and discussing the previous night's scandalous activities. I miss my alternative secret life...oh well, at least I have this place to take me down memory lane. And...they make some kickass French toast!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-26", "description": "Sadly, I've never actually step foot into the restaurant, I only order delivery a few times a week so this review is strictly for delivery/breakfast food. \n\nOn my days off, sometimes it's hard to leave the house and luckily, Academy is on grubhub! They always get my order right(which is rare for delivery) and are so fast in bringing me my food. I generally order a bacon, egg and cheese or some other sort of bagel sandwich with a coffee. Sometimes, I forget to place in the comments section how I like my coffee made and they always call and ask me to confirm if I want it \"the usual way.\" Their bacon is crispy, and food is always delivered hot!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "The food is ok but I love the waitresses. It has been here since I moved to the area in 93 and I hope it stays forever.", "author": "Ina T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "Visited today for a late breakfast after the gym with my mom. \n\nHer order: Scrambled eggs, home fries, side of sausage, toast, coffee.\nMy Order: Scrambled eggs, home fries, corned-beef hash, coffee. \n\nMoms meal:\nCoffee: They ran out of cups. we were served in paper cups... (not trying to be nit-picky...but really? one other family was in there. not doing the dishes perhaps?)\n\nEggs: My mom says the eggs were decent. cooked well.\n\nHome Fries: Ice cold.\n\nSide of Sausage: The sausage had a pretty nasty after taste. I didn't believe her, then i tried it. Pretty bad.\n\n\nMy Meal:\nCoffee: Same as moms. \n\nEggs: Decent.\n\nHome Fries: Ice cold.\n\nCorned Beef Hash: I eat Corned beef hash a lot. this was (most likely) one can of Hormel Corned beef hash. Very skimpy portion. \n\nListen, I'm easy to please. At the end of the day, as long as it's hot and tastes decent, you'll get a decent review. This was just a poor experience.", "author": "Tony B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Great place for a quick bite. Their service is great as well. Took a friend there for a quick breakfast and good was good. The prices are a bit higher than they should be though.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "I've ordered breakfast and lunch takeout from them a few times. \n\nFood is perfect diner fare. It was delivered quickly and was hot, tasted great, and included all the condiments. What more can you ask for?\n\nI can't wait to have a sit-down meal there.", "author": "Ally G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "I placed an order online through Seamless, after waiting for almost an hour, for my order that I did not receive, I called the restaurant to find out where it was. He said in a very rude way that he didn't have it. I asked him if he could find out where the order was and he told me he couldn't do anything about it. I insisted and he started yelling that he didn't get the order and that he wasn't going to send an order. I called Seamless and got a refund. Never ordering from this place. So much for the staff being friendly...", "author": "Alejandro G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "I just wanted to eat and they ran me out of there before I finished. I've been here a couple times and the one waitress who has been there a long time is great. However, this time it took me about five minutes to get a menu from a fairly new girl. No big deal. I'll hang out. I don't need a menu right away. But then, once I got it, they thought I knew what I wanted within ten seconds. I had to keep telling the lady to give me a minute, just one. So I finally ordered eggs and a soda. But the soda can had brown syrup all over the top. She set it down, and then thought about it for a second or two before deciding to run a little water over the top. It didn't help, so I had to use my napkin to wipe off the rest of the gunk. So I'm sitting there with a brown wet napkin and a sticky soda can.They did give me a cup of ice. The food was fine, but just as I finished my last bit she sets down the check and tells me I have to pay now. I didn't say a word. I was quick. I'm a fast eater. So wanting to get her out of work or whatever I walked to the cashier, paid, and when I went back to get my bag my plates and soda which I hadn't drank but half were all cleared. What the hell? I paid for that soda! I only allow myself one can of soda per week and  she took the one I paid for away to rush me out of there. I just wanted to eat and drink a damn soda for fifteen minutes but for some reason that was too much time. I know this is the outlier rating, but this place made me mad this time. So when I go to the mall or the DMV now, which is right around the corner, I HAVE to go somewhere else just to finish what I paid for.  I work in the service industry too. I did tip, and this is the one time I wish I hadn't. You stole my dang soda from me.", "author": "Holly J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-17", "description": "I walked to this place from my brother's apartment to have breakfast one day during my vacation to New York. I should've ordered something else but I was in the mood for eggs and sausage so I had that. Though I had no idea they would include grits on the plate. I tried a bit of it, but I don't think grits really sit well with me. It was kinda tasteless, really. And why are their glasses of orange juice so small?", "author": "Henry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "This is a great breakfast spot! I've come here a bunch of times, always for breakfast. I'm actually here for breakfast right now. I always end up ordering the same things but there have certainly been no complaints thus far and the staff is always very friendly and accommodating, not to mention it's always nice and clean here :)", "author": "Donald W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-01", "description": "I've come here twice in the evening, and both times had really substandard food that was incredibly overpriced. The customer service is anywhere from indifferent to downright snotty, and even the cooks give you nasty looks as though you've just insulted their mother. All the positive reviews seem to come from people who are there early and/or order off the breakfast menu, so maybe that's where I went wrong, but I won't be back a third time to find out.", "author": "Ama R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Yes it's a diner but all so good. Came here with hubby and kids. This is your typical diner that serves great breakfast. We had pancakes, waffles and eggs. All done to perfection and the servers were all great. Highly recommend this place.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "The breakfast is amazing, great french toast and turkey sausage.  Its a little pricey for my liking but its worth it.  The staff is very friendly and the atmosphere is great.", "author": "Alicia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "Hands down my favorite diner in BK. The espresso isn't a traditional espresso (in fact I'm pretty sure it comes out of this machine at the push of a button) but it's delicious like a frothy hot chocolate. Put some whip cream and nutmeg on top and it's the best thing since... regular hot chocolate?? I ate my whole stack of pancakes and I have NEVER been able to finish a stack anywhere else. I heard their french toast is amazing too. \n\nThe friendly service, the great comfort food - Academy Restaurant is the best place for a weekend breakfast.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Definitely not 5-star worthy, but Academy Restaurant is a reliable place to get some cheap, decent diner food. My super filling lunch was only $7.50! It consisted of a bacon omelette with home fries and 2 pieces of whole wheat toast. I don't have a big appetite when I'm just waking up, so I couldn't finish it all.\n\nNote: They have a GYRO OMELETTE! Comes with yogurt sauce! Also, my friend found a strand of hair in his food.", "author": "Kassy M."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}