{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "On a deeply hungover Sunday, unable to get up from the couch, I kept fantasizing about fried mozzarella sticks--specifically, that someone would bring them to me.  Around 8 PM I decided I had nothing to lose and called Academy Restaurant--a neighborhood diner I had been to only once--to see if they could fulfill my desire.\n\nGuy: hello, Academy\nMe: uh, are you guys like, open?\nGuy [very enthusiastically]: of course we're open! Anything you want!  [He literally said that.]\nMe: wow, really?  If I order mozzarella sticks, can you bring them to me?\nGuy: ...sure, why not?\nMe: ok.  Can I have two orders please?\nGuy: two orders mozzarella sticks?  You got it.\nMe: really, that's ok? Even if I don't order anything else?\nGuy: ...our minimum delivery order is eight bucks; that's over eight bucks\n\nWithin 15 minutes I had the most perfect, piping hot, crispy not soggy mozzarella sticks at my door.  AH-MAZING. Thank you, Academy.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "I love Breakfast especially Diners. This is best in Fort Green, Brooklyn!! Love there corn beef hash, home fries have a touch of Spanish flavor. There service is quick no waiting \u0026 most importantly the waitress are super friendly!!! WOOT WOOT", "author": "Irene R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "It depends on the server..... Some are not friendly/attentive, some are the friendliest servers I've had in NYC.", "author": "Alison H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-28", "description": "So I managed to complete a Yelp check-in here, however, that was the extent of my experience here.  Went in around noon on a Sunday, and while busy, the place wasn't \"slammed.\"  Instead of waiting for a table, my friend and I decided to sit at the counter.  After nearly 30 minutes of waiting for anyone to take our order AT THE COUNTER, we left.  I mean the servers were running around all over the place and they saw us looking around, but not one person acknowledged us.  I even asked the manager if we could get service, still no one came.  In spite of all the other nice Yelp reviews, this place made a bad first impression with me.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "One of my favorite places to visit in Brooklyn, period! Parking is a bit hard, but with a lil patience and some know-how of the area, you'll be just fine. They do not accept credit cards, but they do have an ATM there. If you want to avoid the ATM fee, just bring cash. The great thing is, the food is not expensive AT ALL! Especially for a business in that area. The staff is just amazing! Your food is always prepared the way you like it and if it isn't, they have no problem correcting it. I've NEVER had to wait too long to be assisted. You seat yourself when you walk in. I think i've sat in almost every chair/booth in this place. The grits remind me of my moms. The eggs are made to your liking. Great oatmeal, burgers, waffles, etc. I absolutely LOVE this place and HIGHLY recommend it to anyone wanting to visit.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-28", "description": "I live around the corner from this place and never thought anything of it, nothing really stands out about it but I thought I'd give it a try for breakfast. I had a hankering for bacon. Unfortunately, my instincts were right.\n\nSeated immediately, the place was pretty sparse initially but it filled up by the end of the meal. For just about 7 bucks, I got scrambled eggs and bacon, with the regular toast and home fries. The food came very quickly and didn't look terribly appetizing, however It did taste better than it looked though. I thought I would probably be able to make what was on the plate just as well (but part of the problem was that I didn't have the ingredients in my fridge). The staff were attentive.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "A cheap eat near Barclay's Center.  Good for breakfast.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "Passable and predictable diner food.  Fast service.  Generous  portions.  A bit expensive for what you are getting...   The only reason I ever end up here is because the various better restaurants in the immediate 1-block radius are either not open yet (early brunch or breakfast time) or too busy (dinner prime time).", "author": "Brad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Love this place. Cheap, fast and clean. The waitstaff gives this place it's neighborhood charm. Classic old school Brooklyn.", "author": "Luz G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-21", "description": "A solid coffee shop in the neighborhood. My omelette was cooked well and the potato hash browns were cut in good size chunks. It didn't have a lot of onions cooked with it which is how I prefer it so I was happy. My friends had burgers with fries and onion rings and they enjoyed it. Nothing fancy but that's how I like my diners.", "author": "Pauline L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "I live right around the corner frim this spot and I love it. The food is good and always fast to come. A must try!", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "This is where my friends and I always go for brunch. It's right next to our old high school so we have many fond memories of the place, love the kind staff and end up ordering the same food each time. Good overall diner fare and nice atmosphere. Would recommend for anyone looking for a simple place to get breakfast or lunch.", "author": "F K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "This is my favorite diner in Brooklyn. My friend and I go at least once a month give or take. We always get the same waitress who is very nice. It has your standard diner food, but they are willing to change things up for indecisive people like myself. Once they gave me two types of salad dressing just because I couldn't make up my mind. It has tons of standard diner foods but also a few things that are a bit different. Plus, you can't beat the location, two blocks or so from the Atlantic Barclays center and right next to the G.", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "I have never went Inside this place but I order from the often.  So far,  anything that I have ordered came very fresh and very delicious. I highly recommend this place for lunch if you work around the area. Delivery takes about 40 min", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "If I could give this place zero stars I would. I just had the worst customer service. I placed an order and Debbie, the owner, was very rude and irritable while taking down my order. when I called back to check the price of my coworkers order- she was very bad tempered and decided to cancel the entire order based on her experience with other people who work in my building that have either changed or canceled their order due to the price. If other people call n cancel orders but you never experienced that with my number then I expect decency and better customer service. If you don't want to provide proper service as well as food to our work building then no problem - You have just lost a lot of business. I will never order from here again. You will lose a lot of business with that attitude and service Debbie.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "This is a no frills diner. But if you want decent food cheap and fast this is definitely your spot. We came here after waiting 45 minutes (after placing our order and not getting our food or drinks) down the street at blackforest brooklyn . We had fantastic service here.", "author": "A Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "Good diner food and very polite, friendly people. I live two blocks away and their delivery is always quick and the food still hot. I've walked in and they always have families dining there for breakfast on weekends. I'm a fan of this place!", "author": "Sha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "Hands down the best breakfast in the neighborhood!\n\nThe staff is amazingly friendly, sweet, accomodating, and quick. What more could you ask for from a local diner? The pancakes are fluffy, and the bacon and sausage are always cooked the way I like it (crispy). I have never had lunch here, but I will say that the folks I travel with love the egg dishes.\n\nThank you Academy for being our go to for a breakfast/brunch in the area that doesn't require a 30 minute wait at a peak time.\n\nI am sorry, but I have to take 1 star away for offering corn syrup based pancake syrup as opposed to the real thing.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "I have gone here continuously since 2007!\n\nThe food is about four stars the service is six stars.  The food is solid diner food, you won't find anything too fancy on the menu, just solid diner fair.The prices are perfect, breakfast for me and my lady is no more than $15.\n\nThe waitstaff are awesome, it feels like family in here.  Everyone knows Toula and Debbie are great, always keeping coffee cups full and plates of food ready.  I have brought my visiting family here, for a quick, cheap satisfying breakfast, they loved it.", "author": "spazzy p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "I got the french toast and my girlfriend got the Oreo pancakes, both with sides of bacon. The food came in less than 20 minutes and was delicious! I will definitely be ordering from Academy again!", "author": "Terry B."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}