{"aggregateRating": {"reviewCount": 108, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Let me start off by saying that this is a no frills place. This is a diner and I love it! I am embarrassed to say that it took YEARS before I set foot into this place. I went to HS right down the street and everyday I passed this place not realizing the gem that it was. \n\nThe breakfast specials on the weekends are great deals. You definitely get your money's worth. The wait staff is efficient and kind. \n\nI took off a star because sometimes the silverware is a little iffy but other than that, this is a good place to get some good eats.", "author": "R C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "The place is an old school diner of old. Fast food and quick service is the main reason I go here so often. I could stop in and have breakfast and be in and out within 20 minutes. Now quick service comes with it's faults, food typically comes unseasoned and a bit underwhelming. I will continue to frequent the place when in the area but I've had better diner experiences. One thumb up over here", "author": "Barry G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "This diner doesn't even deserve a 1 star. The poorest customer service and managerial communication. We ordered and item that said it came \"with\" toppings. The wrap was delivered without those toppings. When we contacted the restaurant, that manager said those were optional despite the menu saying it comes \"with\" them. He hung up the phone on us once when we requested he \"fix\" the problem. I called back and he simply refused to help the customer. It was such a simple fix. Apologize and refund or offer a future service or replacement wrap. Very disappointing.", "author": "Meghan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-21", "description": "I love the burgers here. It's one of my favorite diners in Brooklyn. It only got 3 stars because when I walked in at 2, the little old lady who's been here forever refused to allow me a booth. She said 1 person can not sit in a booth. It's bad enough I do it all the time but I'm literally looking at 3 single people in booths, 1 of which she sat me in front of at the counter. She mentioned it being lunchtime. I know she's not psychic but the restaurant has been here. I've lived in the area all my life. 2 PM is not an influx of people time. Lunchtime is dying out at that time. As if to prove it, 3 whole people came in. All I'm saying is if you're going to lie, make it plausible.", "author": "Brielle W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-27", "description": "Came here for brunch hoping to be pleasantly surprised and was not. It took a few minutes to get noticed and receive menus even though the place is really small. On the plus side, we were able to grab a pretty comfy booth immediately. \n\nWhile cheap (you can get pancakes, two eggs, coffee and OJ for $8.25), I probably won't be back given that none of the food met my pretty low expectations. The omelette was overcooked and the pancakes reminded me of what you might expect at McDonalds. \n\nCome here for a decent deal, but don't expect much.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Delicious Food!! Huge Variety!! Awesome service!! ;)", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Just had waitress go off on me for trying to order food for delivery. She shut down their seamless account due to busyness \u0026 asked me to call back in 15. Then another 10. When I called a third time, she shouts \"MA'AM, ma'am, whether you come in or call, it's gonna be another... 30 minutes?\" Like I'd caused them to be so busy. Also, 30 minutes sounded completely made up on the spot.\n\nI asked her name \u0026 was fed immediate defense of \"Why? What do you need my name for, I~\" Because, Debbie, I'll need to be able to ID you accurately as I document this chat about your restaurant--which I witnessed being built  \u0026 will surely see shutter. Why on earth would you take out your aggressions on me? What a shame.", "author": "Nira H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "The staff here is racist and rude just because we got something small. They talk about you in front of you because they don't think you understand spanish. Like sweetie, people are educated????? Also, right after we got our toast, I saw a small piece of hair in our butter container. ABSOLUTELY DISGUSTING. On top of that, the waiter slammed the check on our table immediately after we got the food.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "Yummy food, nice staff...except for one waiter who always looks mad when taking an order or asking him a question. The last time I was there with my Dad, he was kinda rude. I didn't let it get to me, we all have a bad day. The next time he wasn't as bad but still lack people skills. Not friendly. The lady at the counter is sweet and the elder waitress is also a doll. I hope she will be my waiter next time. Overall the food is great! Love their omelettes and muffins. Prices are reasonable and clean environment. My advice for the not-so-friendly waiter...smile. You may not like your job or don't want to be bothered but it should never show on your face when serving customers. It's not fair to us. A smile goes a long way.", "author": "Dara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "An early morning on an empty stomach,  I needed something quick and delicious.... case closed!\n\nSearched yelp and found this spot!\n\nTo get straight to the point, this is a typical diner atmosphere.... not too much lighting with your older than average waitresses who knows hospitality and service. \n\nI have to add that it is very clean.... seemed like a neighborhood favorite. Anywho,\n\nI ordered a veggie omelet with pepper jack cheese and turkey sausage with a mixed green salad, orange juice, and coffee. \n\nThe outcome: I cleaned my plate.... my omelet was made just the way I liked it!\n\nMy aunt on the other hand who typically don't eat out thought that it needed all sorts of spices,  but I told her not everyone eats a lot of spices... lol. She still ate all her food!\n\nLOL!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "We ate here for the first time last week and it was pleasant. The food was ok. Nothing spectacular but it wasn't awful either. The waitress was nice and patient with us- a family of 5, age ranging from 4 to 66. But I detected a hint of 'tiredness' after we summoned her for the 4th or 5th time for extra napkins or something like that.\n\nI saw that the other table next to ours ordered waffles and they asked for more whipped cream. The same waitress just gave them a whole can. The kids in the table finished the entire can.\n\nI guess that's part of what great service should be.\n\nMaybe not return to this placebecause it's not in our neighborhood. The food, service and atmosphere were not extraordinary enough to want to make us drive out there to have breakfast or brunch.", "author": "paulin h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "This place is super awesome. For the location and the amount of food you get for the price, it's simply unbeatable. Their eggs are sauce. The hot sauce, is sauce. I can't stay away from this place. The only thing that bothers me is that the interior is a bit run down, maybe that's what adds to the feel of this place. I highly recommend for a large and affordable delicious breakfast.", "author": "Dmitriy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "Avoid it at all costs. My friend and I were the only people eating here, and we heard the wait staff referring to us using derogatory racial slurs. Please hire respectful staff with at least a high school diploma, or at least educate them.", "author": "Kira L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "Decent diner. Egg cream was 5 stars, like seriously surprisingly good if you are into that kind of thing. I am so I was pretty pleased.\n\nService was quite slow. Food also took a very long time to come, so don't come here if you're in a rush. \n\nOmelette and oatmeal were perfectly fine. Potatoes were bland and not crispy enough. Also beware the hot sauce option was terrible so I will be bringing my own if I dine at Academy again!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "As far as food goes, it was fine: Eggs and home fries, hard to screw up. But the boss woman behind the register, another story. Somebody must have peed in her cornflakes otherwise she was the last Greek still pissed at the Trojans . When I pointed out the error in our check she barked at me to give it back to the waiter. After he made the correction on the check, she asks ME \" so what is the right price?\" WTF I don't work there! This is your place and staff get your shit together. Gives me change while on the phone, a \"thank you\" was not to be had. And my response to her: take a long look at this face, you'll NEVER as it in here again nor my $$.", "author": "Len O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "I've been in the neighborhood 15 years and have been ordering here forever. Now they've increased their delivery min on the weekends. Huh? Yeah, they've lost a customer.", "author": "Frances T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "I love the,Academy Diner.  I've been eating there for 20 years! The breakfasts are tasty and filling and reasonably priced. \nThe waitress service is efficient and friendly.  The seating is comfort. Thank you Academy for serving up good meals for details a design now. Great specials too... Greek cuisine.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "My favorite neighborhood spot for breakfast.  Good food,  great service, and doesn't break the bank.  Waffles and pancakes are delicious.  They also have turkey bacon which makes me happy.  Just remember...cash only.", "author": "Toya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "This restaurant's definitely not hipster -friendly. Decor basic yet clean. I had scrambled eggs, sausage, toast, French fries, oj. Food tasty, comforting. Eggs didn't include seasoning, that is good healthwise. Food including tax comes to 11 bucks, which is good for that section of Brooklyn.", "author": "Behlor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Fort Geene staple. Good service and people, decently priced comfort food with a hint of a nostalgia vibe. I'm in love!", "author": "Michael H."}], "servesCuisine": "American (Traditional)", "priceRange": "Under $10", "name": "Academy Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "69 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/FV2WYkiVkv3X8eQ8UIqM-g/ls.jpg", "@type": "Restaurant", "telephone": "+17182379326"}