{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "Came here on when in town for business. I was staying at another hotel on the block. The hostess sat me at a high top. After 15 minutes of servers walking by without a glance, I stopped someone who said this table is one that doesn't get served (I had to order via the bar). He said he'd take my order. Annoyed, I ordered a sashaimi salad to go. The hostess came by to apologize saying that servers were supposed to do these tables. I was going to order a glass of wine, appetizer and meal, but no.\n\nVery cute place and the food looked amazing coming out. If I'm ever in town again, I'd give it a other chance. make reservations", "author": "Tara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "Kimoto is right by my office building. The food is decent and the drinks are usually good. Service is always fun. They have a nice rooftop and glass ceilings. We mostly end up here for drinks and grub post work or happy hour. It's a go to mostly out of convenience. The have decent happy hour drink specials. Food could be better.", "author": "Rivya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "The music and vibes are amazing ! Food is tasty . Bottle service prices are really cheap . Highly recommend !", "author": "Heily R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I have been to so many restaurants and never have I witnessed such unprofessionalism and poor customer service. I came to Kimoto excited to celebrate my Friend's bday party and at first when you walk in the  ambiance was beautiful. We had a cute little area that held 20 of us at the side of the restaurant. In about 15 or 20 mins our waitress came around and ask for our drinks and appetizers, which came out relatively quickly how ever heres where the disaster starts not one time after the appetizers came out did anyone  take our drinks or the remaining plates that were there after we were finished. We weren't served utensils or napkins of any kind not to mention when we ordered our entrees the empty plates and glasses were still on the table . Now the entrees took almost 2 hours to come out and some people didn't even get their food. After that we had to ask the manager to please clean the table so we can eat and asked if they forgot some of the party guest's food order. Now Kimoto is also known for their lounge with a gorgeous view so it's no surprise that we wanted to take advantage of that not to mention they had hookah. But that came to a halt when they made us wait another hour to get a area for hookah to then tell us there's no more hookah. The manager was extremely rude to one of the guests calling him bro and telling him he's not obligated to accommodate us and even try to call security. It's safe to say I will NEVER go back to this place again. So if your in the area just by pass this place  and don't waste your time. \n\nPs: the food was good but the Customer service sucks !!!!!!", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I live across the street from A Loft and Kimoto. Stopped by today, to be told the outside rooftop is all reserved, but if we want to sit outside find our own seat. \n\nThe hostess then proceeded to hand us two menus and literally we were left to walk outside to find seats. \n\n1. Not all the seats had reservation signs. \n2. Even if we have to find open seating, you don't hand two customers menus at the host/hostess stand and basically give them a nod of \"good luck, find your own table, if you want anything you will have to walk up to the bar from your spot and order.\"\n\nIt's professional courtesy to walk your customers at least to the general area and help them find a seat. Funny thing, as we were leaving, b/c no way in hell was I going to, at that point order anything, she walks two guests outside with menus. \n\nI get a lot of your food business are hotel guests, and most of your business may be from weekend party goers, but if you want to be part of this neighborhood try better. Don't shun the locals who will give you consistent business. Left a nasty taste in my mouth. \n\nI love spending money in helping neighborhood businesses, but the lack of, or any love for their craft or trying to be something more than a tourist spot, from this experience has turned me completely off from this establishment.", "author": "Hyun Suck K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "Talk about a catfish! This place is perfect if you like hookahs, salsa dancing and neon lights! I took my colleagues here and it's a club with decent food. Honestly, the only reason I'm giving this place two star is because the food was OK and it was relatively clean. Incredibly oblivious service, music so loud my ears are still ringing and THEY FREAKING CAT FISHED ME. This is not a serene roof top dinner spot, this is confused excuse for a restaurant. \n\nBut we did get to meet the future governor of NYC Cynthia Nixon! So I have it one more stars. \n\n\nBy the views are a lie. This place is great for drinks if your 22. Otherwise, pass. \n\n#voteCN!", "author": "Kelly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Nice place! We had a great time with friends on Friday! Had no problem with table, we did a reservation before. Beautiful view and club music! They have hookah also. Perfect place where you can eat, drink and dance", "author": "Marina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-28", "description": "This is my first time here. I came for my friends bday. The staff was a little short with us. I feel like we tried our best to be patient and polite. But it felt like they didn't want us there. It kind of ruined the experience. The place is beautiful. But the people who served us were not very nice. It made me want to leave. The manager on duty really made me upset. I understand working in a lounge or restaurant is hard and tiring but at least talk about me when I can't see you.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "Food: 5/10\nService: 3/10\nAtmosphere: 4/10\n\nKimoto is located atop the Aloft hotel in Brooklyn, and serves mostly pan-Asian food.  If you go in the afternoon for a quick drink, the view is pretty nice and it's normally not too busy before 5:30 or so.  As the night grows older, Kimoto gets significantly louder and service gets noticeably less and less attentive.  Additionally, after your initial order, expect a healthy delay until your next interaction with a server.  Depending on how in the mood you are for a lively, loud environment, this may also be the gap in service where you decide you'll just get the drinks and go.  Another gripe I have is a trend for menu items to be out of stock (including drinks).  Combine these factors with food that is ho-hum at best (I've also seen sushi get sent back/not eaten a few times), and Kimoto is just not worth it.  Overall, if you just want to grab a late afternoon drink with a decent view, stop in and consider something to nibble on like the chicken gyoza or crispy spring rolls, but I don't recommend anybody linger.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "I wish Yelp would give us the a half star feature already; I would give this place 3.5 stars. I am all about ambiance and the vibe of a place. If it was based on that regard alone, I would give this place 5 stars. We went around 7pm on a Friday night. Great DJ, playing old school R\u0026B with a few hip hop and reggae songs sprinkled in. As far as food is concerned, that's where it gets tricky. We ordered the Kobe sliders, wings, pulled pork sliders, and a crab cake. All of it was subpar at best (the crab cake was totally unacceptable, I returned it for the pork sliders which were pretty dry). My boyfriend asked for his Kobe slider medium rare and was informed that they could not do that, hmm? When it came out, it tasted like my 15 year old nephew cooked it on a grill at the beach. Super tough and flavorless. My friends who went a couple weeks before us said that the sushi is amazing. It is a Japanese restaurant so I guess I should have tried a roll or two. We ordered a bucket of their twist on a mule, it was pretty good. It didn't taste strong but it definitely creeps up on you. Overall, I would go back to this place just to enjoy the vibe, drinks, and music but I will TOTALLY eat before I get there.", "author": "Staci C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "Honestly this 1 star was given just for the hookah. So i came to this restaurant/lounge on a saturday night for my sisters birthday. when the waitress came to take our orders we were not notified that the chef was leaving in 10 mins. it wasn't till after she took all of our orders and then 30 mins later she comes back and tell us that the chef left for the night. The first thing that came to my mind was, why didn't the waitress notify us before taking our orders. anyways the waitress then comes back with a sports bar menu with nothing interesting for us to order except some low budget wings, that took an hour to come. at this point i'm irritated, I asked to speak to a manager, the manager finally shows up and i told him that i wish we knew the chef was leaving at a certain time that we would have ordered earlier and etc, his response was \"it states on our website what time we close the kitchen for dinner\" at this point i'm dumbfounded at his response, like am i going to sit here and go on the website to check this, like you guys were wrong the orders should have never been taken in the first place and we should have been given the night menu instead so we knew. \n I read the reviews before coming here about how HORRIBLE THE SERVICE IS. but here i go trying to give them the benefit of the doubt. they definitely showed me their true colors. and the poor waitress had to take all the heat. she was a lil slow aswell because shes part of the blame, but i think she's kind of new. but who cares. and on top of that we asked her to bring the birthday cake out like 20 times so we can sing happy birthday and she kept coming back to our table without the cake. and at that point we were all extremely annoyed that we got dressed just to stare at each other and eat nasty wings. NEVER AGAIN.", "author": "Temitope S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Was there with my girls and we all had such a good time. I think this place is good for a group. Drinks were great and we loved the appetizers. They have DJs with a dance floor for some exercise if your buttock is tired of sitting lol. \n\nWill be back for one of our Birthdays!!!", "author": "Tsering Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "This place is amazing. Great atmosphere and excellent drinks. Definitely a good place to bring friends for a fun night out. I recommend their dragon burger it's so delicious!", "author": "Natalie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Came for the weekend, definitely a good place to go with friends. Beautiful interior, great food, love the vibe and provides great customer service. Would come back!", "author": "Sang M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Was here for Halloween and had one of the best experiences ever! This rooftop is aesthetically pleasing and has great apps and drinks. Would definitely recommend.", "author": "Tashi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Everything about this place is great from the Google to the sashimi. I tried a variety of the drinks but my favorite was the capricio Brazilian drink with lychee. It's a nice rooftop and a very chill spot to just hang out in the daytime and the Sashimi salad was my favorite... basically anything with the Sushi was delicious", "author": "Sara T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "I came here for a going away party for a co-worker of mine and I was disappointed - I didn't eat just had a few drinks (which were actually pretty good and resulted in +1 Star).  All though we had a reservation for the group they seemed unprepared for us.  We shifted to several different spots over the course of ~ 30 minutes without avail.  We eventually just ended up in the area in front of the bar - which was totally fine, but why not just put us there in the first place?   So would I go back?  Yes, probably for happy hour but not with a large group (and it certainly wouldn't be my first choice).", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Love the skirt stake and mermaid roll was excellent.the service was good....and the view was amazing.....love the view...... I highly recommended this place...", "author": "Sabbir A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "Terrible Service, made a reservation a week in advance yet, my party and I still had to wait 30 minutes for a seat. We were all served our food at separate times and 3/5 people in my party were completely disgusted with their drinks. The manager completely ignored our complaints and tried to make is pay for bad drinks and extremely LATE food. There were only two servers on an extremely busy night. And I went to this restaurant on a Wednesday night, not a weekend. \n\nIf I could put less than one star I would. \n\nThanks.", "author": "Amber V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "This is my favorite place to go, when I want hookah n drinks. The staff are real friendly and attentive. Past 5 years I threw my birthday party and it was amazing and perfect, the service was great and on time. The best rooftop in Brooklyn. The manager is the best plus he is cute.", "author": "Jumon A."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}