{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "This place was horrible! I came when there was barely anyone here. Our drinks took forever and when we finally got them, the drinks were the wrong ones!! And then our actual order took even longer and when we got the bill they charged me for the wrong order and my actual order. Save your money and go to literally any other bar.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Had a great time. The food and drinks were excellent and reasonably priced. Very grown and sexy vibe, would definitely recommend this place for Birthday celebration or a girls night out.", "author": "Sharon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Came here for an anniversary dinner and happy hour. The dishes did not disappoint and the drinks were perfect. Cute views from the outside half", "author": "Mel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Out of towner exploring a new part of the town and this was just the perfect spot. Quickly yelped outdoor spot and landed across this gem!! Very interesting Japanese beers so we tried out a few and had the aioli fries (perfect to pick at). \n\n\nOur server, Miguel, was really very friendly and helped us out on our itinerary for the rest of the night. We had questions...and he had the answers! He was very attentive and was just very welcoming. We asked about the music, and 5 minutes later out came the dj. This dj spun old school raggae, rap, hip hop! Really wish we could have stayed longer, but we had to head back to jersey!\n\nThank you kimoto!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Greattt food and drinks!! Went there on Sunday and the views are amazing!? The prices were reasonable for a rooftop spot and everyone was very nice", "author": "Sam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "This place was so much fun! My friend and I had a really comfy couch and table to ourselves with a nice sunset view of the Brooklyn borough. The fried rice and the mermaid roll were to die for!! AND they were playing really good music (including Justin Timberlake ;) ) I literally wish I could have the food everyday. The only downside is that our waitress was pretty inattentive and we had to approach her at her computer stand all three times we needed something. But it wasn't really too big of a let down since we were so focused on the amazing food! I would definitely recommend this place to anyone :)", "author": "Macys D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Discriminate/segregated \n\nThe overall service was great, a little slow though. However, I didn't like that the rooftop bar was segregated. It appeared as if they seated all the white people in one section and everyone else in another section. When I addressed the hostess about this she stated \"sometimes I've been screwed over in the past, so sometimes I seat certain people place!\" I asked what does that have to do with anything and not allowing us access or informing us about the seating outside. We spent well over 100 dollars in this establishment. I would not personally recommend it.", "author": "Nunu E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Stumbled upon Kimoto when searching for a spot to grab Happy Hour with a friend. I believe that I have been to this Venue a few years ago when it was a night lounge but it seems that they have remodeled it and it looks great. There's a bar to sit at, tables for inside dining, and then an outside area to eat or just enjoy the views. They don't have table service for the outside seats so you'll have to order food at the bar and then take it outside yourself. \nThey have a relatively cheap happy hour m-f, and then additional specials for each specific day of the week. We opted to get a margarita pitcher which was the special for the day and it was really strong. \nFor food, we ordered the soy garlic wings which were not as good as I expected. I've had soy garlic at other Asian themed eateries that were much better, these were just off. We also ordered some truffle fries which were delicious, and the mermaid sushi roll which had shrimp tempura and caviar, and it was my favorite food of the evening. \nI will def come back here for happy hour and maybe on a weekend, where they supposedly have a DJ. They also have hookah available but it is a little pricey.", "author": "Robin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Cool nice chill spot. Good for parties or dates. Food is incredibly tasty! And the prices are reasonable. Came in the winter and where I was sitting was a bit crafty but I bet the summer is perfect. The service can be improved a little just being a bit more attentive. Had to try to get their attention a few times.", "author": "Jaael L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "Extremely poor  service. After I was seated I sat watched several waitresses walk by without even acknowledging me for 10 minutes. Finally I got up and went to complain the response I got from staff was I just worked here. Pathetic.", "author": "James S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "This is a pretty cool spot. i came here on the glow in the dark party to celebrate my birthday. I got the platinum package which came with 3 platters of food and bottles. The food was good my waitress for the night was reallly nice ( i forgot her name). \n\nHowever, it was pretty empty though and i expected the DJ to be better but i still had a good time. Definitely want to check this place out during the summer", "author": "Cassandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Very nice  ambience lovely view of the down town area and the Hawaiian mojito is the bomb", "author": "Nick W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "So you know those places that everyone thinks they look really really cool going to? Like- they'll post pictures on their instagram stories with a caption like \"we out here\" and the view looks -eh- somewhat cool? Yeah this is that place. \n\nMy friend (bless her soul) picked this place out to celebrate her birthday. She made a reservation for a party of 10. When we arrived they gave us these two tiny love seats- for 10 people! Not only that but they were situated at opposite ends of the outside patio. Someone is clearly SO smart. We ordered a pitcher of the Jalapeño-Pineapple margarita, two beers and a rum and coke. 30 MINUTES later still no drinks! Some people ordered food and that dream was quickly dashed. Myself and another friend went to our waitress to cancel the entire order since we had decided to leave but unluckily for us she was heading our way with our drink orders. Im not going to complain about the drink- it was mediocre at best- but we were paying for it and that meant I was definitely downing that acidic crap. We cancelled anything else that hadn't arrived at the time and headed to a beer garden where we were promptly seated and served all the food and beer we desired. \n\nThe end.", "author": "Jessy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Love all their roll specials and the weekly specials are a good deal. Definitely my fav Thursday spot with DJ Dylan playing the best music. The view is really nice from the outdoor seating and the hostess is the sweetest person ever.", "author": "Yangchen D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "Good drinks great food. However I hate that people are smoking Hookah right in the middle of all the other customers that don't want to inhale all that. I get it, people have the right to do what they want but anyone who wants to do hookah smoking should have an area away from other customers that don't want to be exposed to that. Their website doesn't even advertise Hookah smoking however don't be surprised to see a bunch of people smoking hookah indoors. The view is beautiful though.", "author": "Dmercedes S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "Didn't get the table we asked for, service was terrible, food was average. The view is nice but other than that there's not much to recommend.", "author": "Sam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "I wasn't even aware of this place but was invited to a birthday party on a very wet Saturday night. I'd love to visit on a sunny day to enjoy the rooftop properly. The Manager Jonny was extremely attentive and gave our a group a lot of his time. He even arranged for a special cocktail for the birthday girl that has a flower which dissolves when he poured the alcohol in. The DJ dropped some dope tunes and although I didn't eat anything there as it was far too late from me, several of the items on the menu looked tempting. Definitely need a follow up visit, the Manager was telling me Monday and Tuesday nights they broadcast sports.\n\nAs I was leaving noticed the size of the bouncers, looking at the size of them I'd assume they have sampled all the dishes on the bar menu!", "author": "Victor A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "I had a wonderful time celebrating my best friends birthday here. I would like to give a special shout to Susie who made our night soooo special. She was very pleasant and honest and she made us feel extremely comfortable. Sasha was also very helpful in making sure we had a really good spot to sit and enjoy our tasty drinks and hookah and food. The DJ was really good and played songs everyone was able to sing along to and dance to. The new Hostess Amaya was also very sweet and honest with us about happy hour specials as we were told by another employer that happy hour wasnt happening and it was. Thanks to Susie, Sasha and Amaya my friend and I enjoyed our night to the fullest extinct. Thank you!!!!", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-26", "description": "Very average sushi. The view is this place's distinguishing feature. Grab a drink and enjoy the view before your dinner reservation elsewhere.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "very classy rooftop place , best hookah in brooklyn ! \ndrinks are really amazing!  i recommend this place for party's !", "author": "Thunder C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}