{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Came in for brunch on a Tuesday for my birthday. Really great experience. Great views. Great service. Not super packed because of the time. Order the steak with rice bowl and a couple of beers with my wife and they were pretty good. Definitely recommend.", "author": "John Vincent H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Sophie was a fantastic server. It was Valentine's Day, and she treated us like royalty. The food was phenomenal and the drinks were delicious. One of our favorites!", "author": "Amber L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "The food was pretty good and the cocktails were tasty. A little busy and loud, but this is definitely based on the rooftop concept and the weather. Staff were friendly and great for recommending cocktails.", "author": "Tashay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Very, very nice ambience and views of the city. Mixed crowd, so the DJ plays a great mix. I didn't eat the food while I was here so I can't give it 5 stars but the drinks are good. It's a very nice Happy Hour venue. The wait for an elevator is troublesome but it'll all worth it to get upstairs.", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "This is the first rooftops I've visited in Brooklyn. Unfortunately the day I chose to visit was a rainy, chilly day and the rooftop area was covered. It is located on the 24th floor so it has a good view.\n\nService : Id give them a three on service. The service was generally good. The person taking our orders was a little impatient and not particularly friendly. However, the food and drinks were brought out promptly.\n\nFood : all we had were appetizers and drinks. We had the truffle fries, the nachos, the vegan sushi and some fried spring rolls. The sushi was quite good and the portion size was good. The fries were okay a couple of fries were undercooked. Nachos were good as were the spring rolls.\n\nDrinks : we had a couple margaritas and a Bacardi cocktail. The drinks were standard.\n\nAmbience : the place has a decent amount of seating. Has a combination of couches and chairs giving it a nice lounge feeling. The have hookahs that they bring around so if the smoke bothers you not a good place to be. As I mentioned at the start when I visited the rooftop was covered so I didn't get a good feel for how it would be if it were open.\n\nI'd visit this place again.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Food is great! Aesthetic is cool! View is amazing! Our hostess Amaya and the manager Sasha were super accommodating, friendly, and made our night a fantastic one! See you again:)", "author": "Jamila M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "My friends and I came here on a beautiful evening and we were told there will be a 45 minute wait for a table so we decided not to opt for one and decided we will be fine by just standing around a table. After 30 min...I was greeted by Amaya and was told she made some arrangements so we can have a table. She didn't have to but she was thoughtful enough to accommodate us. The drink and food selection is abundant and the service was impeccable. We will be coming back in the near future!", "author": "Eric C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "It's a nice location and had a mixed diverse crowd.  Drinks are average price for the city and made pretty strong. The dj (music selection) plays more so for a 40+ type of crowd until late into the night/morning. Hookah was average and good seating options.", "author": "Brittany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Came here to meet a friend and have some drinks. Bartender Yuliia was very nice and she definitely knows how to make a strawberry margarita. That's her in the background lol. I will definitely be a new regular here!", "author": "C.J. F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Such a cool hidden gem! Just came here for drinks (I recommend the tropical mule) and appetizers. The food, the view and the service were great. I tried the crab rangoons, truffle fries and Korean bbq wings. I'll definitely be back!", "author": "Briana T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "The view from this rooftop bar is indeed a fine one. One of the best in the city. You can gaze way-y-y-y-y out over Brookyn, block after block. But other than this, I'm not sure what I can find to say to 'flatter' this strange establishment. Just about everything in it rankled, grated, jarred, irked, or irritated me. \n\nIt could be that the joint tries to do too much at once: dance floor, DJ, lounge, sports bar, hookah. It's simply not a place to relax. You have to 'keep your head on a swivel'. There's just too much jammed into too small an area. You wind up bumping and tripping constantly, nonstop jostling and staff/customers squeezing by you. \n\nThere is a mildly interesting Asian theme to the menu --and most of the waitresses are Asian as well--but other than that, the bar is emphatically ~~~~ghetto~~~~. It feels just like being on Fulton Mall 25 stories below and 2 blocks over. \n\nCrass, very LOUD, very low-class-mindset revelers. Yakking it up, yukking it up...yada yada yada...all shoving as much food \u0026 drink down their gullets as possible. Boorish. Lots of social incompetency: pathetic |||||||| addictions and the corresponding rudeness to everyone else in the vicinity. \n\nBut to be fair, these last complaints are not the fault of the management. Getting back to the venue itself:\n\nFurnishings: 'sofa nooks' and sofas lining the windows; and yes they are comfortable, extra-padded, and easy to recline in.\n\nNevertheless, most of the environment is tiny-little-tables tightly packed together. You huddle over your drinks / food like chimps. And of course you have to shout to make yourself heard over the blasting hip-hop (aka: audio garbage) provided by the DJ.\n\nIt's just slightly better on the outdoor patio; but not by much. Still, that fresh air and open sky is quite a treat.\n \nPrices: slightly elevated; (no shock, it's a given considering the location) but in some instances drastically so. Hooka $30, no free refills. Otherwise not too bad. Worth staying for 3-4 rounds.\n\nLighting: subdued. Thank Khee-rist they get that correct. But otherwise [visually] 'Kimoto' is decorated with a lot of the usual tired, cheap, glam schtick which is everywhere these days. \n\nEh. I sincerely wish these rooftop bars were of a better ilk. I've never seen one yet that I could respect. Maybe they're just always bound to attract a certain kind of numbskull partygoer. This Brooklyn example is not as bad as some I've seen but it could be a whole lot better. I just don't know what to advise as an expedient.\n\nThe good news is that downtown Brooklyn now has a lot of choices--including a couple more of these venues--which means you don't have to go all the way to Manhattan to be this stupid.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "overall it's a nice place good drinks a little pricey but I have no complaints with the food and drinks also it's a rooftop space so you do have a choice to be inside or outside and its connected to the Sheraton hotel dwn twn bklyn", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "My friends and I were seated promptly. A waitress came to us and asked if we were ready to order. We said no and asked her to come back. She was gone for 35-40 minutes, meanwhile she kept looking at us even though we were signaling to her to approach us. I had to get up and find her myself and bring her to our table! By the time we were ready to place our orders, the kitchen was closed for entrees and only open for apps.", "author": "Nissa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Kimono rooftop has become a downtown staple for afterwork cocktails and good vibes with friends. It's on top of the Aloft hotel (24th floor). You don't have to worry about getting up there because there are three elevator to take you there....so there's no wait. When you get to Kimoto you are greeted by a hostess who offers table seAting or bar service. We went for table service. They have standard dinner tables as well as \"lounge\" couches, a couple of them were reserved but I'm not sure for who because they still weren't seated after our 2 1/2 seAting lol but nonetheless we were seated at a two top until lounge seating became available. We started with drinks they have happy hour til 7 so I ordered a couple margaritas and a tequila sunrise - weak drinks....I'm usually a two drink kind of girl but I had 4 and a shot of whisky smh we also ordered calamari (over fried) octopus balls (looooove 'em) the burger (amazing) sushi(ok) fries (so crunchy and to die for) after all that food we waged it down with blueberry mint hookah. Yes an Asian fusion restaurant with hookah....cool by me. It was a  good way to end the night. Now keep in mind Kimoto also offers a view of Brooklyn on their rooftop. You are able to overlook Williamsburg, the new center built across the street and a view the of new Brooklyn skyline. I would def recommend especially in the summer when it is an open roof top.", "author": "Laquana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-01", "description": "Didn't care for the service, lemonade, or the food. Great view that's about it. It's an ok spot since it's close to work. Servers not attentive.", "author": "Kimaya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "First and foremost, location is stellar... in walking distance of A, C, F, R, 2, 3, G, 4, 5 which means it's a great meet-up space from many locations around the city. Plus...rooftop views of Manhattan, Lady Liberty, Brooklyn... \n\nThe space is versatile, transitioning from completely indoor roof space, to quasi-outdoor (read: sunshine and air with shade and A/C), to completely outdoor roof space. (The completely outdoor roof space can be a challenge during the hottest part of the day but with the other options and the sun's inevitable shift behind buildings, you couldn't ask for more). \n\nThe food is phenomenal! Do not leave without trying the Korean BBQ Chicken Wings, they have the flavor of BBQ and the kick of Buffalo. The Crab Rangoon (bite-sized and adorable) and the Gyoza Dumplings are filled with flavor and pair well together.", "author": "Jolleen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Went here for a friend's charity event. It was a decent rooftop bar that's pretty long and narrow with limited outdoor area and view. Drinks were okay and the food was even worse. I wouldn't revisit, but it's an okay spot for hangout on a slow night if you are already around the area.", "author": "Rezaul K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Reasonably priced drinks and food. The neighborhood is definitely much more developed than years passed. The views are great for such a small roof top. I was there Friday night, and I the DJ spinned some great old skool hip hop so we loved it.", "author": "Fred L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "This place is so nice! Food and drinks were amazing. Nothing is horribly priced as well. You get the gorgeous view of Brooklyn with music and the ambience. Only thing that could have been better was the hookah. It was $30, they have about five flavors. It was good at some points but constantly got weak and weak. Otherwise, the service and quality of the place was amazing! Definitely coming back Xx", "author": "Madison M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "This place could be great, but the service is a mess.\n\nFor a party of 11, they seated us between two couches--each tucked against the wall. This could have worked had the music not been so loud that I had to yell in the ear of the person sitting directly next to me (maybe this is why people are on their phones and no amount of DJ preaching changes that. Maybe society is falling apart. I'm not a seer). Fine. We moved furniture around and the staff didn't mind. This did not fix the main issue. That for a group of 11, we were in a space that barely seated 7. One love seat for two. One three seater couch. We got creative since asking for more seats produced one whole chair. Asked for more, but they never came.\n\nMaybe we just had to wait another hour. Given it took thirty minutes for one pitcher of margarita, two beers and a rum and coke to appear. The jalapeno margarita wasn't bad, just practically booze free. The beer was beer. But the rum and coke... The soda was flat. That's practically an accomplishment. \n\nBut what about the food? That is a great question. Our two appetizers were almost an hour in the works when we asked for them to be cancelled, abandoned our sad drinks and made for the exit.", "author": "Elle T."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}