{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "The Aloft hotel is my go-to stay when I'm in town. Can't beat the friendly staff and it's a comfy stay. Extra bonus is there's a rooftop Japanese restaurant.  My colleague and I called after landing from a 6 hour flight to see how late they serve. We were told until 11pm. Perfect we got there at 10:12pm. Only to be told the kitchen was closed. But we were told 11pm! The bartender responded with 1030pm. We responded with \"so the kitchen is still open!\"  Nope, already closed. And not reopening. Here's why that's annoying:\n-We called and were told the kitchen was open\n-we just travelled cross country and needed food\n-it's the hotel restaurant and doesn't honor the times it says it's opened. \nNot okay. I really hope a manager sees this and starts enforcing your hours or changes them to read \"whenever\".  As an SPG gold member, this restaurant doesn't live up to the quality of the hotel or how it's run.", "author": "Jiffy I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Overpriced, bland, and lacking in veg options, saved from a one star by the location. Despite that saving grace, I'm not planning on going back.", "author": "Aly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Picked this place for a birthday dinner. We had a great view of outside, couch was comfy. Had some fun cocktails and followed up with beer (they have a pretty decent beer selection for a roof top). Had a variety of appetizers and the tiger shrimp teriyaki. Food was good, our server was attentive, and even went the extra mile when they lost our order.", "author": "Kristina G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "Music was typical pop hip hop, too loud for diner, the food was so overpriced for the quality. The wings sucked, the rolls mediocre, spicy tuna a disaster. Terrible place.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "VERY bad service. Long wait to be seated. The hostess did not pay attention to our needs. Server took forever to take our order. The food was decent. Never coming back again.", "author": "Kanchana K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "Don't bother - $20 cover charge for 2 at an empty bar on Sat nights and I got rejected for having a starbucks during Sat brunch.  Of course, there's a \"dress code\" too and $25 credit card minimum. \n\nWe live in the neighborhood and really wanted to see Kimoto succeed but they definitely don't make it easy to be a customer.  They are trying to act like a fancy Manhattan rooftop bar when their only opportunity for customers are locals and hotel guests.  \n\nWe were open to being loyal repeat customers even with their cover charge and $14 cocktails but they lost our business forever when they would rather lose me as a customer than let me bring in a $3 starbucks iced coffee. \n\nIn a day and age where every business is trying to be more consumer friendly, I've never been to a more consumer unfriendly business as Kimoto.  They deliberately create hurdles for customers to jump over (go home and change those summer flip flops!) and what you/they get in return a bar that is empty even on Friday/Sat nights.  There's no vibe and the view from my own apartment is better. \n\nThe kitchen is slow but service is seriously the issue as per the countless yelp reviews on this very subject.  There are tons of bars/restaurants in the area that appreciate your business but Kimoto is certainly not one of them. \n\nI hope management reads these reviews because I'm always a champion for small businesses in an up and coming area but right now, Kimoto is doing everything possible to turn off customers not attract them.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Went last night for a friends birthday and had an amazing time. The food was delicious and the service was amazing. I was going to just order a cup of sake but the waitress explained how I would get more out of the carafe. All of the staff was attentive, not to mention the lovely view and atmosphere. Can't wait to go back.", "author": "Caroline R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Great environment and food. In love with this place! The prices and amazing, you can't beat it anymore plus the view the absolutely breath taking!", "author": "Afroza S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "This place has never disappointed me, the nachos \u0026 sushi are excellent \u0026 the waitresses are sooo nice. I honestly don't want too many people to find out about it because i'm afraid it will get rowdy lol.", "author": "Alana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "I like this place it is a cool rooftop to hang out for saki", "author": "Jack Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "last night I went with a couple of friends to celebrate at Kimoto Rooftop . Food was great but a little on the pricey side . I really enjoyed the view and the Dj was awesome . Our server Suzy really helped us get the party started, she was super attentive and bubbly . Over all I had a great experience and will definitely be coming back. We had a blast .", "author": "Danielle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Great place to hang out and get drinks however was disappointed with the food. Service was nice and courteous. Wings were good. The kobe beef burger was burnt when asked for medium and I'm a kimchi lover but it just did not mix well. Hookah is cool but a bit overpriced. Wouldn't suggest watermelon flavor.", "author": "Myohwa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "The school I work for decided to have our end of year dinner at Kimoto. The views were decent, but lots of high rises in the way. The food was tasty, but definitely was not a very good selection. (I will place this on our administration who planned the event.)\n\nThe bartenders were incredible. Victor was awesome, funny, attentive, etc. There was also another bartender at an additional location, closer to the outside area. He was also excellent. We received top notch customer service from wait staff, bartenders, even the elevator gal. \n\nHowever, I'm sad to say this one star rating is based on a very rude employee. The experience of the evening was highly overshadowed by the actions of this one man. He was in charge of the bathroom line. (For some reason???) And if you stood in the hallway for any reason other than waiting for a bathroom he would quickly become aggressive with you about leaving the area. Myself and three others were accosted by this man. I'm sure we weren't the only ones.\n\nMy encounter: I left the bathroom and noticed a friend in line. I stopped to talk with her for a minute on my way back into the bar. As I did, the bathroom monitor began yelling at me to move from the area as I was blocking the hallway. I tried to explain that I was just stopping for a minute to speak with my friend when he became very rude and continued yelling at me to leave the area. At one point he went and got one of our administrators. I left the area and explained to her what had just occurred. She responded telling me I wasn't the only one it had happened to that night.\n\nMy friend's boyfriend's encounter: My friend K was in line and her boyfriend had just exited the bathroom when he saw her. He stopped to ask her for some ones to tip the bartenders. The bathroom monitor swept in and forced him out yelling at him to leave the area. The bathroom monitor threatened to kick K's boyfriend out of the bar.\n\nMy friend's encounter: A co-worker needed help zipping up her dress. My friend was making her way to the bathroom to help out the co-worker. As she walked up the bathroom monitor PHYSICALLY kept her from entering the bathroom. She tried to explain she was just going in to help a friend and he put his hands on her and refused to let her in. \n\nAs I said, these are the three instances that I know of and heard directly from each person. It's sad that a lovely evening was ruined by the actions of this one man. Maybe this place is nice when there aren't private events, but I'm going to have to say I will never go back because I do not ever want to be treated that way ever again.\n\nI highly suggest taking your private events elsewhere!", "author": "Suzanne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "tl;dr: good Asian food prepped bar-style, reasonable prices, but it's the cool rooftop view that makes this place worth it!\n\nHubby and I came here for a quick late night date. You have to enter the Aloft Hotel and take the elevator up to the top floor. We ordered bulgolgi tacos, spicy fries, and gyoza. The bulgolgi tacos were delicious with a crunchy fried wanton shell, tender meat, kimchi, and refreshing slices of jicama-like straws. Our waitress explained that the chef won a challenge against Bobby Flay for his recipe, and I can believe it.\n\nThe spicy fries were covered in a dry rub that was actually spicy. We enjoyed the pairing with the savory tacos. As far as the gyoza was concerned, we were taken aback that they were entirely fried, not just pan-seared or steamed. They were a little over-fried to a dark brown for my taste, but it's difficult for gyoza to not be delicious. \n\nWhat makes this place worth it however is the rooftop bar view that overlooked downtown Brooklyn. Although the bulgolgi tacos were very good, this wouldn't be my first choice for Asian food just because the preparation is catered more for the bar scene rather than an authentic Asian food experience.", "author": "Cecily S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "Three stars because it's an unpretentious rooftop that doesn't mandate bottle service to get a seat.   The service was friendly, but uneven, throughout. I arrived before my friend and had 3 different servers ask if I needed anything. When my friend arrived, ghost town.  We quite often had to flag people down and it took at least 30 minutes to get the bill and return it. I liked the variety of drinks on the menu, and thought they were fairly priced... but our Kobe burger fell flat. WAY, WAY too much sauce of some kind on it.\n\nAnyway, I WOULD come back if in the area--prob not on a weekend night bc this was an uncrowded Tuesday and they were struggling.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-09", "description": "I was not wowed about the drinks menu, neither the location or the view.\nI understand that they are trying to make the location a hip place but I do like downtown Brooklyn as it is right now and I don't think, we need to make it classy like the rest of New York. The view was ok, the service mediocre, did not try the food but just a $8 jap. beer.", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "My friends and I sat outside and ordered at the bar.  We were a group of 5 people, so you think that we would want to eat together.  Nope, not at this place.  Our food was literally brought out 1 entree at a time.  We took turns watching each other eat.  Then twice, not once, but twice, the wrong entree came out. Finally a manager appeared and the chef came out of the kitchen.  It took them a while to figure out the food and confusion, but we finally received all our food after 2 hours and every one repeating their order at least 5 times.  While the last person was eating their entree, more food was brought out that we didn't even order.  An hour or 2 later we ordered more food and only half of it came out.  So we had to go through this whole confusion AGAIN!  To top it all off, they included a 20% service charge.  \n\nThe reason I gave 2 stars instead of 1 is because the food was actually good.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "The service was comically bad. Some of the worst I have had in recent memory. The table they intended to seat us at appeared occupied so they decided to seat us next to the very loud air conditioning system. Another table offered was in a corner, also near the air conditioning and totally blocked in by a large group. Finally seated, we ordered three drinks, only two came. After our appetizer came, out waitress came with a check-even though our dinner hadn't arrived yet. This is the last time we saw her without having to flag her down. Our food came in stages-- one correct dish and one incorrect dish each time. Had to flag her down when we were actually ready for our bill. Plates were never cleared. When we were finally ready to pay, we asked her to remove something from the bill and 15 minutes later someone else brought the bill. We told them about our disappointing experience and they said they would discuss with the manager. Ten minutes later someone else returned with the revised bill and the equivalent of one drink had been removed. No apology or acknowledgement of any kind. Manager never came over to us. The food was fine (nothing special) but given the service, or lack there of, I wouldn't recommend this place to my worst enemy.", "author": "Kari G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "I'll give it two, though it deserves only a one star. As this place sits on the roof of the aloft hotel, all we saw were the elevators. According to the website, parties under 8 do not need reservations, QUICK TIP NOW... Make reservations anyways, and yes you must request to be on the rooftop deck at this rooftop bar! My party of four were placed in the dunce seats. I call these the dunce seat because we were sitting right by the entrance with the elevators, while security watched us eat along with other lingering wait staff.  (We didn't even make it to the rooftop deck area, which if you're going to a rooftop bar.. I'm pretty sure you're expecting to see more than the elevator, am I right?) \n\nPros: beer list was great! Local Brooklyn beers and a large assortment of Beers from Japan! We loved them! Oh also the water is filtered and crisp, always a plus in my book.  \n\nPro Food: Parmesan and Truffle Fries were great! A little more truffle on there and they would have been perfect! Served with a teaspoon of ketchup. \n\nNow the cons.. The staff and food. Mediocre at best. Let's start with the staff. We were poured water promptly by staff number 1, but a bit later were ask by staff #2 if anyone came to help us yet, replied no. Staff member #3, a young boy, came to take our drink and food order. #3 showed back up with our brews and started to pour one, dropping the other on the table floor and hurried away. After replacing the dropped beer, we never saw #3 again. After ordering from a extremely limited menu, we had the following: \n\nPotstickers (Chicken) : which were far from POT STICKERS, more like mini; over deep fried chicken spring rolls. \n\nWings: Garlic Soy \u0026 BBQ; they weren't bad, just nothing special to write home about. \n\nBento Box: I'm sorry did you mean Burn-to Box?! We ordered the mushroom Bento Box, and the best thing on the might have been the white plain rice. The mushroom was a little to charred on one side and seemed like forgot about on the other. You get a bite of everything else, and two shrimp tempura  for $19.. Skip it and get more truffle fries! \n\nEdamame: when you order this in absolutely ANY OTHER restaurant you have soy sauce, but I'm assuming condiments are a luxury here again. We asked the food runner (#4) for soy sauce but he forgot about us, another five minutes before we saw another server, we asked #5 (just there to refill water) for soy sauce. Got it! I'd also like to mention that the edamame came out last so we were done with the rest of the meal by this point. \n\nStaff members #6 and #7 cleared your plate as soon as you were done, refill weed our beers and brought us the check. Needless to say $140 later, I had no idea what just happened.\n\nLast but not least, let's talk about these chairs. We were about a foot off the ground on wood boxes, just throw pillows down, it would have been more comfortable and more Japanese like.", "author": "Erika Beth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Had a lovely birthday lunch here on a Monday. It was great because we basically had the entire balcony to ourselves. Although we had to walk to the bar to order, the food was delicious- highly recommend one of the signature bowls. my spicy california roll was also very fresh. delicious cocktails - overall a great experience and I will be back!", "author": "Chinelle E."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}