{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Came here on a Friday afternoon with a large group and there were just some tourists grabbing lunch and hanging out since they were staying at of the hotel. Such a hidden gem in the area considering there are only a handful of rooftops in Brooklyn. We were too early to make the happy hour which starts at 4 pm but the deals looked good. There was a decent food menu, plenty of seating to lounge around, and a stunning view! Planning to visit again soon.", "author": "Farhana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "We were here for my friends birthday. As we entered, we saw the place was loud but the songs the DJ was playing and their signature cocktails didn't make us feel that way. The food was good and definitely it wasn't expensive at all. Would definitely recommend to check this place by skipping one of the rooftop in city.", "author": "Sai Likith M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-14", "description": "Perhaps it's fine if you're ready to order the second you sit.\n\nIf you need a moment to look at the menu, however, you might be better off just leaving--like I did after wasting 24 minutes.", "author": "Kim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Great view and good happy hour. After 10pm they have a DJ that plays some fun music -- like throwback Thursday with some 90s hip hop and R\u0026B.", "author": "Jeremiah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Great drinks, great bartenders, great ambiance and great view!  I've been here twice and I've enjoyed myself each time. It's never overly crowded but if you get here too late, you won't be able to get a seat outside. You can see the Statue of Liberty off in a distance and the city skyline. I feel like this place might be a hidden gem since it is on a rooftop, but all the better. I'm definitely making this my go to place, especially during the summer!!", "author": "Y. D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "This was not that great of an experience. Kind of dirt and the food was mediocre at best. Will try again for happy hour, since that is what they are known for.", "author": "Makeda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "A rooftop bar in downtown Brooklyn? Yes, please. The space is nice and the seating wraps around so you get to view Brooklyn from tons of angles. Hopefully the get some heaters for the chilly fall weather. \n\nThe drink here are the star (as they should be at a rooftop bar). I had the Peat's Revenge and my fiancé had the No Sleep Till... The Peat's revenge was smoky with a hint of citrus and it was lighter than I expected but still good. The No Sleep Till... was a lychee cocktail, it was fruity but not too sweet and tasted a little like grapefruit. There were several other cocktails and lots of interesting beers that we try when we come back. \n\nFor food we tried the bresaola summer roll, disco fries, and pork sliders. The summer roll tasted like a cold it sandwich in a summer roll form, it would be good if you were into that sort of thing. The disco fries were good, covered in brisket, cheese, peppers and sriracha. The fries themselves were great too so if you just got a side of fries I'm sure it would be awesome. The pork sliders were a bit on the sweet and the peppers were a nice addition. Overall, the food we had was ok. There were several other items on the menu that could have been better. \n\nThe real reason to come here would be to have some great drinks in awesome downtown Brooklyn setting.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Love love Love this place. Came here on a recommendation by a friend who I must say will never send me to a spot that was not on point. I must say it's chill and definitely on point if ur looking for a chill night with some good drinks.  Can't really eat the food cuz I'm kosher but I'm sure it's delicious. But the drinks r fabulous. Didn't really remember the bartenders name but the boy do they mix a drink. Definitely will b coming back especially on a Wednesday to try out the cigar night.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Really cute place . EXCELLENT FOOD!!! The service could have been better but I would definitely go back . Went for 4th of July , was able to see some fire works from far but nothing special . The music was on point . They had hookah and I loved their strawberry mojitos . I bought the open bar through Pulsd, it was worth it . My favorite were the Parmesan fries ! I LOVED THEM ! Cute place in downtown Bk. So glad I found it.", "author": "Karina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I rarely venture into the city, but going to Kimoto is totally worth it. Each time I've gone the staff has been very friendly \u0026 the food was delicious. I recommend it to anyone I know that is going to be in the area.\n\nGet the Beef Bulgogi Tacos!", "author": "Kristina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Doesn't boast the same views as of other roof tops in Manhattan. Drinks are okay, nothing special. Pure 4 star roof top by all standards.", "author": "Yar R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "As much as I want to love this place. I must say the only thing saving them is the view. The service at Kimoto is SUBPAR at best. On my visit here the waitress did not only take long to take our orders, but she never returned. When I approached her for another drink she never returned. After 30 minutes of no service, I practically had to walk to the bar and order a drink for my table. When I asked another waitress for assistance, the inexperienced waitress told me that my waitress was busy servicing  other parties. Half the place was empty which I could not understand why she was so busy. I've worked in the service industry before so I know the difference between good and bad service. The service here isn't just bad, and horrible isn't enough to describe to blatant lack of service or discrimination here at kimoto. Good luck to all if you  ever have the opportunity to visit be AWARE!!!!.", "author": "Cindy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "Pretty nice looking rooftop bar/restaurant in the middle of brooklyn. We ordered multiple dishes including, kobe beef burger, eggs benedict, and chicken waffles. For sides, we ordered french fries. The food was exceptional, nothing amazing. Everything but the eggs benedict was only average. I couldn't help but to keep stealing off my girlfriend's dish. The service was really poor, that's a shame. We order fries for sides and it came 40min after we finished our meal, not to forget the edamame that we ordered never came. Our server was nice enough to give us the fries on him though. I'm not sure exactly why this place is so unorganized but it definitely can be a better place if everything was prompt with the okay food the serve.", "author": "Dennis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "This place has a nice atmosphere. The service was fairly good and the DJ played a nice mix of music. The rooftop area has some nice views of Brooklyn to enjoy.", "author": "Saikrishna P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "I came here on a Wednesday night to meet a friend who was staying at the hotel. The bar had interesting decor - more stylish over comfortable, but not bad. It felt spacious since it was kind of empty around 10pm on a Wednesday. We ordered a bottle of prosecco, and service was fast. It was too cold to sit in the covered area, even with the heaters, and I felt a weird drop on my shoulder fall from who knows what (the ceiling is covered too). It was even colder on the roof so we didn't get a chance to enjoy the views. The rooftop isn't bad, next time I want to go out in Brooklyn maybe I'll come back, but there are better rooftops in Manhattan.", "author": "Akhila R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "great place to visit with e.g. teenagers, for the view, music and food. I recommend the sushi. It is not as plush or posh as Manhattan rooftops so more relaxed atmosphere. This rooftop allows under-21s.", "author": "Sander V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-21", "description": "literally worst \"asian fusion\" food i've ever had, had to actually send dishes back (which i never do) (don't get the edamame hummus- i'm a huge fan of edamame hummus but this was sooo bad) The Kimchi ramen was literally just spicy spaghetti , the Burger was \"meh\" , the only thing decent was the fries. (a friend told us the sushi was really good though) -- also this place is part of a hotel which we didn't know. I guess that's why the food is bad-- tourists don't know good new york food. Oh well. It's a cute place but weird atmosphere and terrible radio music.", "author": "Magenta M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Granted it was a Tuesday evening but the staff there was so accommodating. I dropped by around 4pm to see if they could accommodate a party of 8 to celebrate my boyfriends birthday. She immediately reserved 2 tables on the terrace and was very friendly in doing so. Our waitress Gabby brought him a birthday drink, all of us birthday shots and once we checked in they gladly brought us hot sake shots! I would happily come back for more celebrations! Wonder what it's like when the Dj \u0026 hookah are live!", "author": "Brianna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Great place to go. Awesome drinks, beautiful views, a little pricey but overall a great place to go to enjoy a night in Brooklyn. Would recommend to any one", "author": "Brian T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-31", "description": "Normally I don't do reviews. But after traveling 90 mins from westchester to this place because my friend asked me to, I feel like warning people who want to come here for a rooftop bar. This is literally just a bar at rooftop. No view at all. If you are used to rooftop bars in Manhattan like me, don't waste your tin coming here if you are looking for a nice rooftop.\n\nThe only nice thing is that there are quite many Asian hot girls, if that's your thing. Other than that I really can't think of anything nice. Spent 20 mins to get a drink, spent another 20 mins to get my coat.", "author": "Daniel N."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}