{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-09", "description": "Let's be real. Decor is gorgeous. \n\nFor a hotel rooftop restaurant I am really impressed at the layout of the space and the overall aesthetics. The seating is broken down into lounge and table seating we close lounge because of the people watching capacity. Just kidding. But really the lounge seating is very comfortable. \nThere are vines and strings of lights and paper lanterns that give a relaxed nature vibe. Really beautiful. \n\nFood. We ordered the Truffle Parm Fries, Spicy Tuna Pizza, Crab Rangoon and the Seaweed Salad. All tasted good. The presentation was pleasing to the eye. The best of the four was a tie between the Rangoon which had a heavy celery presence that I liked and the spicy tuna pizza because who doesn't like spicy tuna.  I think the price point is dancing along the verge of overpriced however I can see for being a hotel restaurant and a rooftop where the pricing is coming from. The happy hour before 7 for margaritas was great. $6 each!\n\nOverall it was a lovely experience. I would probably try another rooftop next time but it is def a great date or chill happy hour spot if you are in the area!", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-29", "description": "It was a very nice outdoor setting. \nBut our waitress was MIA most of the time barely checked on us to see how we were doing nor ask how was the food where it arrived. \nDecent price, the drinks was the best part", "author": "Soraya F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Okay...if i can rate this place 1 star i would...i only say this statement to places where i feel like i received the worst service of my life. I am not sure if anyone else had encounters with worker Vanessa but my experience with her will ensure I NEVER STEP FOOT back inside Kimoto ever again! First of all we waited 30 minutes for a server, and when none came, Vanessa came and introduced herself as the \"boss,\" saying a server will come take care of my friends and i. After that she disappeared, and we ended up walking out because not a single worker helped us or offered water! What kind of \"boss\" does that?! My friends warned me about this place..i shoudlve listened instead of wasting my time.\n\n\n\n\nUPDATE: im looking at all the \"Not Recommended\" reviews \u0026 im thinking that whatever those people are saying about this place, IS ALL TRUE! Idk why its not recommended.  LOL. DO NOT come here guys, save your time \u0026 money! It is not worth it", "author": "Tracy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-23", "description": "This place was... interesting. We came here for lunch after checking into Aloft and were shocked at the difference between nighttime and daytime for this place! We played it right here, and sampled a bunch of different items. The campfire drink was an instant favorite! We both really enjoyed the Korean bbq wings. \n\nWe then headed out for a while and decided to check things out for the evening crowd. This place was LOUD! I swear we're aren't as old as that makes us sound, but I'm going to try and put it into perspective. We were staying on the 18th floor and could clearly hear the music through the ceiling.\n\nThe food was good and I can see this being a beautiful meetup space in the afternoon. Just maybe before 9pm", "author": "Christy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Cute lunch place, love the atmosphere! Food was a bit pricey but it was delicious. Would return.", "author": "Maria D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "Chill spot in Brooklyn. View is beautiful. \nStaff is friendly and helpful. Food is average nothing out of the normal. \nHad chicken dumpling that was ok.  Wing was disappointing. I mean come on. Not crispy something you see coming out of a fried chicken spot in the hood. Not impressed. \nSangria was good nice favor. \nI will return to check out the rest of the menu.", "author": "Benito M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-29", "description": "Thursday night was cool...it gets pretty busy after 6/7pm, a live DJ comes in....and a bouncer! A big one too...lol \n\nFriday night 5pm happy hour, drink specials are $5.00\n\nFood was nothing to rave about. Wings are average, sushi rolls seem extra large in size. Didn't enjoy them at all, they taste like Carolina rice that they tried to fancy up.\n\nDrinks are strong...get that tropical mule ! \n\nService is tricky...it's all about the waitress you get. Some have better skills than others. \n\nAmbiance is chill...eat, drink, listen to some tunes and be out!\n\nI like it, but don't like it at the same time...I'm weird tho\n\nCheers!", "author": "Nakia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "This is a great place to sit down and relax, and enjoy good food, and drinks, and hookah, in Brooklyn and Manhattan,  \nThe staff are so nice, they really care for you to make sure that you are 100% happy, they check up on you every few seconds to make sure you have everything or if you need anything especially The waitress Gin\nIt's a friendly environment, very clean, their food is delicious, The view is amazing, \nAnd a big shout out to the \"manager Vanessa\", she will make sure that you are 110% satisfied, \nShe is so friendly and she makes sure that everything is good,\n\n this is my favorite place", "author": "Aron B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Love the vibe of this place. It's def a summer place! Love the rooftop! Love the ambiance and food is good too! I came here during the winter and the vibe wasn't the same. However in this beautiful spring day it is gorgeous. A beautiful view of the city while drinking! What more can you ask for?", "author": "Bellinda I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "Great space ! Very nice for a night out in Brooklyn, I liked the dodferen music in every room and the decor was nice! The music was good too and different in each room you want into.. we went for the rooftop but only a little section wAs open to the public.. very cute and nice place to go for a girls night out or a night on the town :)", "author": "Nancy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "If you are looking for great food, friendly service, or an overall good time, LITERALLY go anywhere else. Our entire experience here was horrible. It was so bad that ZERO stars would be far too generous. I recommend Aloft switch out management and probably the rest of the staff because they will lose money if they continue with this place.\n\nWe came here because we saw that they had some great views, but they seated us at the only area that did not have a view. Then once they seated us the hostess forgot to give us menus, napkins, and utensils. We had to ask her for them even though her host stand was right next to us.\n\nThen we had to wait an additional 15 minutes for our server to even remember that we were there. When she finally came to us, another server ran up and informed us that it was last call for food and we needed to put our orders in now. Ok fine, whatever. We were hungry so we were ready to order anyways.\n\nHowever, it felt as if this was our server's very first shift. She asked us to point to the menu for each of the things that we wanted to order. We asked her about certain items and she told us that she had never tried them. Then once we put in our order, she came back 2 separate times to tell us that they were out of duck and other items so we had to order other things.\n\nWe also ordered some hot sake and beers, but that also took forever. We saw our server walk to the bar and look for shot glasses and pint glasses, but it seemed like they were out. So she had to repeatedly go back and forth from the back to the bar.\n\nThe only redeeming part of this was that they brought our food out quickly. However, calling this food sushi would be an insult to the Japanese culture. I don't even remember what type of rolls we ordered because they were so bad. We could tell that they used old rice to make our rolls. Like the rice at the bottom of the pot. It was hard, crunchy, and stale. GROSS!\n\nWe realize we are missing 1 roll and 20 minutes later it finally comes out. We could tell that they had to make a new pot of rice just to make our roll because the rice on our roll was still hot. It was so hot that it made the seaweed really soggy and our roll fell apart while eating it.\n\nOur server never checked on us or even refilled our water or drinks. We wanted to pay and leave, but we never saw our server. My friend even waved his hands and made eye contact with the manager (I am assuming he was the manager because he was dressed in the same floral shirt as the rest of the staff, but was sitting at the bar barking orders and on a laptop). However, the manager just ignored my friend even though he clearly saw him. Definitely never coming back!", "author": "Theo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Oh this place is the bomb.com and is a cool after work spot. Most importantly, the food is soooooo goood. That is always the best part for me.... I mean hello.....\n\nThe truffle fries.... Off The Chain\nThe grilled wings.... Off The Chain\nThe nachos - GR88888t\nThe calamari - Mouth Watering", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "Me and my boyfriend came here for two Valentine's Days. This year and last. I love what this restaurant did this Valentine's 2019. They made it really swanky with couches. Had red and pink heart decorations everywhere (but didn't over do it) and they had the best Valentine's day playlist. Everything from Frank Sinatra to R \u0026 B to 2000s pop. Such a great atmosphere.\n\nService is nice and attentive. Hostess is great. Told her we wanted to take pictures and she brought us outside in the freezing cold when she had a bare midriff top on and took the most georgeos pictures of us. Really made our night feel special. \n\nWe ordered the BBQ chicken sliders. The flavor was amazing. It hit my mouth with so much robust unique flavor. Not just pure BBQ but there was something else there. Though the amount of chicken is not even an ounce on each one. The amount of chicken is so small. Please put more chicken on so it fills the bun! \n\nWe had the rock shrimp appetizer which was good but for 16 dollars they should give more than 7 little popcorn shrimp. \n\nDrinks were delicious. All the cocktails where great, loved the 'Ice Water' cocktsil. It has aloe in it which makes it taste so fresh and refreshing. And not overly sweet. \n\nThe sushi was great, we ordered the harajuku roll which was delicious (8 maki). Fresh mango and salmon. And only 14 dollars. Cheaper and more filling than the rock shrimp. \n\nI will come back again next year for Valentine's. Please stick with that playlist and atmosphere. But put more chicken on those sliders!", "author": "Marisa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "I've been there twice now and the service is TERRIBLE. The staff seems more interested in hanging out with each other or their phones than the customers. It takes them forever to take your order and you'll be lucky if they have what you want. Our waitress took shots with her friends rather than taking our order. It's too bad as the location as much potential and could be really great if they made an effort.", "author": "Anette R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-21", "description": "Cool spot... has a nice view.\n\nTried one of their cocktails with Hennessy and pear puree -- it was really nice the first time around, but not as good the second time. Not a fan of inconsistent cocktails, but the bar was crowded so the bartender was moving really quickly to tend to folks.\n\nHad the cheese flatbread... it was really just a cheese pizza. It was good, but nothing to write home about. Can't really go wrong with cheese on bread.\n\nLadies at coat check were really nice. Bartender was neutral -- again, busy and seemed to just be trying to get his job done.\n\nWould go back again if I'm in the area, but wouldn't be my first choice.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "I've got a love-hate relationship with Kimoto. The food, drinks, hookah, nor service is phenomenal in any way but I keep coming back for the view! \n\nYou take an elevator to the 24th floor, where you are greeted by the hostess who takes you to your table. This bar is massive, with an outdoor and indoor section! The last time I went, they screwed up our reservation and gave us a dark table in the corner for my group of 12, even though they confirmed we'd sit in the area with the couches. Halfway through dinner, they moved us to an area with a better view. Super inconvenient. So clearly, making a reservation doesn't help much either. \n\nFor dinner, my favorite appetizers are the nachos (large portion for a cheap price of $9), garlic soy wings (20 for $20), and tuna tartare (MY FAVE! -$17). Some delicious entrees are the Kobe burger (tender and juicy-$15) and the shrimp fried rice ($24). \nMy favorite drink is the Moscow mule. They serve it in a large bowl and say it's for 6 people but really it's for max 3, and it's watered down. It costs about $50 so it's more cost efficient than ordering single cocktails. They also serve some cocktails in cute coconuts! \n\nAlthough the food and drinks range from blah to amazing, the service really brings down the rating for me. I've never been to the bar on a slow or busy day where it didn't take at least 30 minutes for the server to take your order or give you the bill. One time they took 45 minutes to bring out the hookah and I was over it by then. They're consistently understaffed, so a minus 2 star for wasting my time. If they clean up the service, this place would have a lot of potential!", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "Came here and the female manager Vanessa is very unprofessional and does not have any customer service skills. The male manager is polite and friendly. The waiter was very attentive and polite with the guests. However due to the behavior of the manager Vanessa (unfortunately I was unable to receive her full name) I will not be returning to this establishment. She is racist and ignorant. \nThere are two female managers I am aware of the woman \"supposedly\" named Vanessa is heavy set with long dark hair white woman. \nI would not attend this establishment if I were you.", "author": "Titilayo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "This rooftops is gorgeous. So many seating areas that allow for laid back and fun dining. Took my staff here and we love it.  \n\nMusic amazing and waiting staff is awesome as well. Gin and Jennifer are so warm and attentive. Thanks ladies!!!   After work Friday's!!", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "I came here for dinner and drinks because my friend recommended it after she went on a date here.\n\nViews? . Food? . Drinks? \n\nThe food was pretty good. I got the Jap chae and one of the sushi rolls which was pretty good. I'd give both a 8/10.\n\nThe cocktails really won be over because I felt that they were so creative (I got some lychee one). \n\nMy friends and I also ordered a huge Moscow mule, which seemed watered down but that's what expected at bars these days (shrugs)\n\nThe service was also amazing and so accommodating. We got seated indoors first, but we wanted to sit outside on the roof so they moved us :) our waitress was also super sweet and amazing (I forgot her name but she had cool tats :) )", "author": "Angela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "A disappointment on a number of levels. The service was possibly the worst I have received in a very long time. We sat and sat and sat for at least 20 minutes, and finally had to request a server to come to our table. We had some of the sushi, which was quite good, but did not compensate for the long wait and impersonal service. They need to pick up their game before I will return.", "author": "John S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}