{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Awful customer service. Servers seem untrained \u0026 lazy. They did not check on us. Did not clean off our table. Had to wait a long time then she tried to push the tab on us when we weren't done. \n\nMy friend had an area for us all to get together. They would NOT allow me to start a tab. And said that the group of 8 people had to pay on the 1 tab, limited to only 4 credit cards. I bought a birthday cake for my friend \u0026 at the end of it, the African American was like \"there's normally a $20 cake fee but I'm waiving it this time.\" Why was that necessary??  What a way to ruin my friend's birthday??? It's not outside food, it's a birthday cake. We didn't see any dessert items on the list. Don't need to be an a-hole!! \n\nWill NEVER come back. \n\nWe all collectively spent about $300 for a few hours. I guess it's not enough money for them \u0026 they don't want the business. Wow, just wow. One of the most subpar services I have ever experienced.", "author": "Lisa Li M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Love Kimoto!!! I love everything about this place. The drinks are sooo good. I think the best time to go is either after work or the weekends. The service is amazing. The host is friendly, the atmosphere is cool. The view is beautiful \nHighly recommended", "author": "Christy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Excellent attention and food. Even though we had no reservation and were a group of 6 the wait was short. Great place to celebrate my birthday", "author": "Ale R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "The food was less than desirable Friday's was better than eating here dj is trash. Food less than mediocre. Staff 150% trash. The drinks ok.  The wings smaller than target tots.  Food over priced I put one  star because I can't put a half.", "author": "Mikey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Went here a few times this summer. Great food, drinks and atmosphere. The view of downtown Brooklyn is breathtaking!At night the Dj plays the latest hits. Good little after work spot. Can bea little pricey but go during Happy hour, That's your best bet.", "author": "Julian K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Went here for happy hour drinks and snacks. Restaurant is located on roof of a hotel which is kind of unique. Was pleasantly surprised with quality of the food. Had an avocado pizza which was really tasty. Burger was also really good. Atmosphere was a little off but perhaps we were there on a weekday at an off hour. Would go back and nice spot if you're in the neighborhood.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Loved it here. It was a really nice spot and the food was great! \n\nLocated on the top of Aloft hotel, it doesn't seem like a super trendy spot and it's not, but it is trendy ish. Like baby trendy. We sat in a covered patio and it wasn't cold, just perfect. There was a DJ and another small party but that's about it. Pretty empty but everything was great. I think this spot is definitely more popular in the summer!\n\nYou should order:\n\nTuna Pizza - amazing! (5/5)\nNachos (4/5) huuuuuuge portion\nMermaid Roll (3/5)", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "This rooftop is nice it's a grown and sexy vibe with a great dj. I love the lightning here and the food and drinks was great me and bae with be coming back when the weather is good.", "author": "Alicia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "This was one of the worst dining experiences I've ever had. \n\nTo begin, a friend and I went upstairs and were handed two menus and told to order at the bar. Yet, the very same waitress was serving every other table on the rooftop. \n\nNevertheless, we proceeded to order at the bar. My friend ordered the \"Hawaiian Mojito\" which was not a mojito at all. The bartender free poured a ton of passion fruit purée and rum and then measured out some pineapple juice. He put a sprig of mint on top as garnish. We tasted it and it tasted like a rum and juice. My friend asked if there was supposed to be lime in the drink and the bartender gave her a puzzled look. She pointed to the menu to show that there was lime and mint and he said \"oh yeah, I forgot, but you won't taste a difference.\" He then proceeded to place the aforementioned mint sprig on the dirty bar well, add lime juice and shake up the drink and put the lime back on top, as well as a straw he touched all over. This is NOT a mojito. There was no mint muddled or lime juice and my friend ended up sending it back. \n\nI tried to order the \"tropical mule\" but asked for bourbon instead of vodka. The bartender said it would cost an extra $2 even though both were well drinks. I ended up ordering the red sangria instead, which was quite the disappointment. It had no fruit in it, but a decorative dyed flower on top. It tasted like juice and not sangria. \n\nNext, we tried to order food. While ordering the waitress said to the bartender \"there's no sushi chef so no one can order sushi.\" We asked if we could order poke bowls and the bartender said yes. We ordered the 50/50 and the salmon mango. While waiting for our food multiple dishes of sushi came out meaning it was not fresh. We were very disappointed in our food. The 50/50 had jalepenos and did not note that on the menu. The salmon mango did not have jalepenos even though the menu had it listed. In both bowls the mango was so under ripe it was pure white and inedible. The bowls were pretty disgusting. \n\nI will not come back here and I don't suggest anyone does.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Really good atmosphere and really good food. Rooftop and interior is very pretty and the place overall has a good vibe. We ordered at the bar and the food was brought to us. Service was fairly quick except for when the waiter forgot to bring us our nachos. It was hard to be mad though when the nachos tasted amazing. This was the first time the toppings on the nachos didn't run out before the chips. Will definetly be going back here.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "Stayed at the Aloft hotel (which was great!) so decided to come up here for drinks. It's a nice view but that's pretty much it. My friend and I only stayed for one drink. It was super loud and the bouncer checked my id but not my friend's and he was really nice to her and rude to me. I guess I just sound bitter, but it's still true.\n\nAnyway, we went to the outdoor part, which I guess was for smoking, and another customer called us out on it, but it was the only place we could hear each other talk. The view was pretty cool, especially at night. A lady at the table next to us got kicked out for smoking pot so I guess I'd say don't try it.\n\nThe staff also started closing down the patio way before the place closed. Definitely would not go again. We thought we'd be getting a laid-back friendly bar that is similar to the Aloft's style, but that is not what we got.", "author": "Kensey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "excellent service + felt at home by the lovely charismatic waitress, \"Heyly\". food quality rocks had the dragon burger cooked very well. recommend this place , forgot to mention you get a great view of the city, great hang out spot for get together", "author": "Anderson R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "NATALIE thank you so much for being such a great server to my large party. I loved how you didn't get flustered from copious amounts of food ordered and you made sure everything was perfect. I loved the sushi thanks for the recommendation! I also enjoyed the drinks you recommended too. I'm truly impressed with the service here at Kimoto and I will be coming back soon.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "This was a really cool spot. Went there on a first date and had a really great time. The food was delicious and since you eat with your eyes, the presentation of the meal is also really beautifully done. The view we had was of downtown and it was amazing. The ambiance that's created by the seating and decor was top notch. The only thing I didn't like was this weird odor that wafted by once in a while, but aside from that this place is definitely worth a second and third and fourth visit. The rooftop was an absolute perfect place to be since it was so hot and humid out and the breeze that we had up there made everything even better.", "author": "Sheenica F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-20", "description": "Today is my husband's Birthday. In celebration of his Birthday and also the wonderful weather, I decided to bring him to Kimoto's rooftop for lunch. After reading such wonderful reviews we couldn't wait!!!\n\nThe hostess was very kind and assisted us to our seats. Our waiter Jailton quickly came over to take our order. We ordered drinks and two orders of tiger shrimp teriyaki. \n\nJailton never came back to the table to ask whether we were okay. Jailton never asked whether we wanted another round of drinks (which we did by the way). In fact he wasn't friendly, nice, concerned about our experience at Kimoto or any of the above.\n\nAbout 30 minutes after we ate Jailton gives us our check. To my surprise, there was a 20% service charge. I asked him to explain why there was a 20% service charge on the bill. He explained that it's a standard fee that Kimoto charges because lots of tourist come to Kimoto but don't tip. So I then asked him are you saying you added your own 20% tip on the check? He replies no. It's a standard fee Kimoto charges. I willingly paid the bill. \n\nBesides it's hubby's bday I wanted the day to go smoothly. No need to further investigate this mysterious 20% fee. As we finished our drinks at the table, I over-heard others discuss their check...........\n\nMy blood began to boil. As I watched and listened to how much they were deciding to tip Jailton. \nI began to wonder......So you mean to tell me this standard fee isn't so standard? I don't hear them talking about 20% service charge. Did you seriously decide how much your service is worth and charge me? So the white patrons you don't add a \"service change\" to their bill huh? The \"blacks\" need a service change? \n\nI kindly walked over to the hostess and asked to speak to the manager. As I waited for the manager guess who of all people walked over to ask is everything okay?? Yup you guessed it \"JAILTON\". Can't make this shit up! \n\nThe manager Miguel, asked what was wrong? I kindly asked about the standard 20% fee that was added to our check. The manager quickly said that a standard service fee is NOT COMPANY POLICY. He then walked over to Jailton and asked to correct the check and refund me the 20%. I appreciate the manager however what Jailton did completely ruin my husbands birthday. It also made me extremely upset. \n\nI am a professional, educated, hard working woman. Who just so happens to be black. I enjoy dining out just as much as any other red blooded American. I also enjoy paying gratuity based on merit. How dare you Jailton? You didn't deserve 1% yet you took it upon yourself to give yourself 20%? \n\n\nNever again! \n\nKIMOTO is a NO GO for me! \nThanks for ruining my husbands birthday and pissing me off in turn!", "author": "Patti E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "This place is a hidden gem! A really good time here. \n\nPros:\nMusic Hip/Hop R\u0026B 7/10\nFood 10/10\nDrinks 10/10\nHookah 7/10\n\nCons:\nNeed More Tv's \nService not great but gratuity included \n\nOverall solid, I will be coming back.", "author": "Terence B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "This place is super nice! Within the rooftop, there's indoor, partial coverage, and outdoor seating. The view is beautiful (even though some construction ruined it for me a little bit). The service could be better, seems like they're a little understaffed tonight. I came on a Monday and got some bomb $0.50 (each) wings! They have deals like that Monday-Thursday, as well as happy hour specials. No cover on weekdays and it's very easy to just come into the hotel and come up the elevator to the bar. I'll definitely be back here when I'm back in NY!", "author": "Folasade A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I had my engagement party here and it went off without a hitch. The staff was very attentive and all the food was excellent. They were very mindful and I would recommend this place for a party! Great ambience, service etc. it's great views and a nice place to chill out with friends after work and get drinks too. Love that Buddha beer.", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-25", "description": "My boyfriend and I went here for dinner. I couldn't hear a thing because the music was blasting. It is the loudest restaurant i've ever been in. We were seated and our waitress took 20 minutes to come to the table. We ordered 3 different sushi rolls but for some reason they brought out two caterpillar rolls, the completely wrong order. Maybe the waitress couldn't hear our order over the blasting music? Our waitress disappeared after that and we didn't see her, we had to tell the bus boy about it. A different waitress came out and said she'd comp our drink but when we got the bill, nothing was comp'd. We ate the two caterpillar rolls which were mediocre. Never coming back here.", "author": "Lina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Amazing food \u0026 cocktails! I got the sweet potato noodles with chicken on top \u0026 a jalapeño margarita. Both super delicious, I'd make reservations because depending on the time you may not be seated. I crave my food from there from time to time, it's that good \u0026 fresh.", "author": "Gee G."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}