{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "We came here for happy hour. The place was cute for the menu was short for happy hour and they only had the options of wings for Monday. But the bartender was attentive and very sweet.", "author": "Gina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "For what it is, its one of the best. A rooftop bar restaurant that does not sacrifice flavor for experience or vice versa. You throw on your nice pants, eat, drink, chill, or all of the above.\n\nA large group of us went, excited about the prospect of enjoying a drink and sushi 25 flights up was too much to pass. We started with the barbeque wings, these were large, sweet, with a little zing at the end. By the time we finished up I had my first Dragonite. We ordered almost every drink on the menu, but for my test, if you like liq'ed up lemonade, it doesnt get better. They have their fair share of hard drinks, relaxing drinks, and even more festive ones like the Kimoto, where you douse cotton candy with the liquor and mix it together, amazing.\n\nEntree wise, we had it all. The blue crab fried rice, is easily one of the best fried rice i have had in life. It comes wrapped in whats maybe a banana leaf, chock full of that crab meat. You pour over the sauce, finish it with lime juice, and heaven. We had also tried the lobster roll, godzilla roll, skirt steak, and one other roll I unfortunately didnt get to identify, there was too much food on the table. Of all, the lobster roll is a must, i believe for even someone not so accustomed to eating sushi. Its a little crispy on top, fresh tasting, and throwing im some ginger at the end completes it.\n\nBy this time I was on my second dragonite, and we headed to the rooftop side. Beautiful. Hanging lights, a long walkway that leads you to the nightsky overhead, the DJ blasting everything from oldskool to bachata, hooka, and best of all, couches. The decor is tasteful, the ambience great for a date towards the middle, and best for a group of a few friends further down.\n\nBrooklyn needed a spot like this one. I appreciate their great service, great food, great environment, will be returning again soon!", "author": "Devon O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Mel is super nice great waitress and and the food is good and came really fast. The experience is amazing. YOU SHOULD COME HERE WITH FRIENDS! 10 out of 10!!!", "author": "Sabrina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "I'll start with the pros as the experience wasn't that that terrible \n\nViews, location, ambiance \n\nCons: so we were seated ordered a whole bunch of food and then got asked to move to a table that was set for a lounge. \n\nGot moved, didn't get drinks until a half hour after we were sat. Hookah came out 45 minutes after we sat. \nThe food finally comes and the food runner tries to place the food all over the table even though it was evident we didn't have any room. \n\nThe sangria s are watered down. They taste like they re made in batches. Sent back the first one and then settled for white because we didn't want to deal with complaining again. \n\nMy sister said the steak was good , flavorful. I had the duck. Was a little cold but decent at arrival. \n\nThe biggest pet peeve of the night was that our server didn't come back at all for anything check or just to check in besides every 45 minutes to an hour. No water no clearing of the table nothing. But was walking past to check on a party it appears. \n\nWe waited an hour and 29 minutes to get our bill and then another 45 minutes (waited for the hookah coal to turn into dust) and she had just came back with our cards. \n\nAgain, decent ambiance views and food, but they d do much better working on their service to customers.", "author": "Pryndall W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Great place, great food and drinks, great view! Jennifer was so sweet and a wonderful server. Highly recommend this place.", "author": "Bridget R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Been here only once, so first impressions.... VERY busy and lots of traffic on a Saturday night. The inside looks really nice though, very well decorated with Asian style decor. The rooftop is amazing, an incredible view of the city and looks even better at night with strobe lights. The DJ really knows how to amp up the crowd and play awesome music like Reggae, Hip hop, pop, old school jams...etc. I know when I went, me and my friends danced to a whole bunch of classics.\n\nNow the food was SOOO good! The appetizers (I had the shrimp tempura and it was to die for with the spicy mayo!) and the drinks were so good too. The Aloha comes in an actual coconut which is cute. \n\nBut as great as the food was...my only con was the prices. If you wanna eat here, definitely make a special occasion out of it because the appetizers alone are over $11. Was not to thrilled about the price i had to pay after having one drink, appetizer and a meal. Also, the tax and tip will make your bill even more bigger! \n\nAlso don't come to the restaurant (at least on a Friday or Saturday night?) if you're looking for a quiet setting for dinner. It can get really loud, especially if there's a party going on and a lot of dancing. Other than that the staff is nice and accommodating, they even dance with you if you're having a good time lol", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Went to Kimoto on Saturday night. I found this place and book marked it as one of my places to go, so I was really excited that it turned out to be a hit. I went with my boyfriend for date night. Their entrance is a posh hotel, once near the elevator you go up to the 24th floor which is the rooftop. I got there around 9:45-10:00 p.m. There was about a 30 minute wait but we ended up only waiting 15 minutes. We were given the option of seating which was nice. They have nice lounge chairs in a black light room. We ordered a bunch of appetizers since they all sounded so good, some drinks, and a hookah. The hookah, the drinks and the food were all really good. In addition, the DJ was ON POINT. He played all the summer tunes and was definitely grooving with the crowd. The place wasn't very packed, but there were definitely good vibes. I will definitely be back, in fact my sister is having her bday celebration here so I'll be there jamming !", "author": "Rasheeda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-01", "description": "New Year's Eve Party\n\nI do not normally leave bad reviews, but It is my responsibility to inform everyone of the negative experience had yesterday. Hopefully management will read this and improve their customer experience.\n\nManagement needs to step up and ensure there are processes in place to maintain order. I was ID'ed twice and the front door check-in was not communicating well. You get off the elevator and there is no indication where coat check is nor is there a person to give you direction.\n\nOnce you're all set and go to the bar, there is one bartender and believe me when I say he's slow to serve. At one point, if you weren't tipping, he wasn't serving. Now, this bar could fit 2 bartenders per side, and that's where the aggravation set in. How do you sell a 3 hour unlimited drink pass and have limited bartenders? At one point there were 30 people per side of the bar and the bartender got overwhelmed of people flashing their band that she did not know who to serve. It took 25 minutes to get a drink and refill and I only was able to get 4 for the $79.99 3-hour unlimited (and only 1 was top shelf because they never communicated if top shelf was included). This was a complete ripoff. Appetizers were part of the package, and I rarely saw anyone distributing food (3x tops). The DJ did not have the proper setup. All I saw was the MacBook and when I say he couldn't mix, he couldn't mix! The music genre was ALL over the place! Music interrupted in weird places and it almost seemed like music skipped while it played. People would dance and then stop and then there was no movement whatsoever because the music jumped from dance to pop with slow tempo. The countdown to New Years was LATE and party favors were not well distributed either.\n\nHere is where things go wrong! Coat checkout was a disaster. 5 fights broke out waiting on line and people began skipping. We waited 2 hours for a coat. The screaming and shoving got so bad, a bouncer had to be inserted. Females tried to fight the bouncer, a white knight tried to save a \"damsel\" in distress (in a fight she initiated) and people started targeting line jumpers. When I finally get to where 1 of the 10 employees who are doing coat checks are, we found out they lost all of the coat hanger tickets to match to our tickets. Chaos erupted and people's belongings were lost! The irony is they made coat check mandatory and said \"take a picture of your ticket\" yet the lost all of the stubs. It was so bad, they had to let people go into coat check to search 3 racks for coats. I found the coat I was looking for after checking 3 times and being told to leave twice if I was not looking. Of course my $30 umbrella was lost/stolen. \n\nAll in all, this place is not a good night spot. I am not sure about the restaurant, but I do not condone spending your money here for a night of dancing and drinking. Go somewhere else unless you like possibly losing your coat or belongings.", "author": "Koree Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "Only giving this place 1 star because I have to. We were a party of 7 and had called prior to make dinner reservations. When we got there, they sat us down in a small area of couches with ottomans as the dinner table. We asked if we could get a full size regular people table, and they said that we didn't specify we wanted a SIT DOWN DINNER RESERVATION when we called and so they couldn't accommodate us because they didn't have the space. To add insult to injury, the service was HORRIBLE:\n-We were seated for at least 20-25 minutes (NO exaggeration) before anyone even looked at us;\n-When we finally ordered drinks from the waitress, she messed up the drink order, twice;\n-The drinks took forever to come out that we contemplated going to get them from the bar ourselves;\n-We ordered appetizers and they didn't bring us plates/napkins/utensils, so we had to ask for it, and when they finally brought it, they plopped the tower of plates on the ottoman and walked away, leaving us to separate them ourselves;\n-They never cleared the table after our appetizers, so when our main courses came out, we had to ask for the table to be cleared first and the guy looked at us like he had seen a ghost; \n-They never brought out utensils with dinner, so again, we had to ask for them;\n-The ottomans/tables were so small that a few of us had to put our drinks ON THE FLOOR so we could make room for the food. \n\nThe food was bad, the service was even worse. The bill came out to $427 and they took it upon themselves to include a nearly $70 tip. It was not worth it AT ALL. \n\nI do not recommend this place one bit. The manager (or whoever she was that spoke to us) was apologetic about not being able to accommodate us with a regular dinner table, but being that we were basically eating dinner on the floor, they could have at least adjusted the price a little to make up for everything else. \n\nThis place seems more concerned with money and not with customer service at all. \n\nOh and the view stinks!", "author": "Cyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Besides getting off the elevator to enter in such a tight spot, this rooftop lounge is pretty decent! Nice views, good vibes, Friday night music was good. Very good drinks decorated with beautiful flowers. I want to come back for happy hour soon.", "author": "Kenya F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-19", "description": "This place is one of the worst places I have been. They charge you for  mandatory coat check and then have no system to hang the coats or get them back to you. The coats are draped through the kitchen, up the stairs, piled on the floor and in no number sequence so close to impossible to get back. I went here on NYE and not only did they lose so many peoples coats causing a number of fights to break out, they assured everyone that if they reached out the next day they would be reimbursed for their loss - it's now been days and nobody is responding to anything and the car is 'closed for holidays'.  \n\nOn top of this a number of people's coats were burnt, while dumping the coats they were placed near the hookah causing a fire. We are lucky they didn't set the whole place on fire!!\n\nWe are now 2 weeks on and the venue keeps telling me they are logging an insurance claim. It's 20 degrees out and I don't have my very warm coat I invested in. I would never go to this venue again.", "author": "Ayaila M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "Great vibes great place ...incredible views of downtown Brooklyn you can even see the Statue of Liberty from the rooftop . Very sexy looking cocktails and cool desserts", "author": "S D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "Came here for Happy Hour and it was worth it! They have deals on Wines, Sangrias and Beer. Truffle Fries are a must.", "author": "Joana I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-07", "description": "Came up here with my coworkers for a drink. The hostess found us a table outside since it wasn't very busy. We sat out for over 15 minutes with zero staff coming over to at least greet us. One waitress walked by our table several times and made eye contact, but simply didn't even pause to welcome us. \n\nNo one ever came by to take our order. We walked back to the hostess who was on her cellphone and let her know that we weren't getting any service. She looked at us like she'd never seen us before.\n\nTerrible place, so many better spots in Brooklyn to get a drink at--avoid this one at all costs.", "author": "shafique k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "The rooftop is really a restaurant on the top floor with a small patio. The majority of the restaurant has a roof and is not on the rooftop. Everything was out that night. No ginger beer. No chicken or veggie dumplings. They had shrimp dumplings but 20 minutes after my entree arrived they claimed that they were still working on it. I cancelled it. My entree was jap chae. It was good. Nothing special tho. My drink was mediocre too. It was lychee. The lychee they used for garnish was gross. It was canned. Nothing wrong with canned but it was sour. It was bad. It was old. At least open a new can. Last, it was too ratchet. And I love ratchet. So trust me when I say it was extra.", "author": "Diaz M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "I raved about this place even though service lacks. Kimoto owes me money. I recently found a bill from them where a service charge was put on my bill however there was limited service performed for top tip rate except the taking of the order and the delivery of the food. I went to get my own pitcher of margarita from the bar. The bartender gave me pitcher and cups like I was the server. In addition we were outside and Angelo made me go inside to handle getting the drink instead of doing it for me as he should have. So as far as I'm concerned I'm owed 16.60 especially since I tipped on top of that.", "author": "Aja C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "As an out of towner this rooftop is IT! The ambiance, the music and the service is top notch! Thank you to our waitress Gin she was so nice and pleasant during our visit. Definitely will be back next time I'm in NYC!", "author": "Tashi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "If your looking for a chill casual spot with an open rooftop view/vibe I would recommend putting this spot in the rotation. We had apps- wings, sliders, fries, etc, and drinks (draft beer and whiskey.) \n\nIf you want a casual chill spot with an open air rooftop, cool views, solid booze, and food this is a great option!", "author": "Brett C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-06", "description": "The food and drinks I had were great! I'm vegetarian and got some of those options, miso soup, garlic fried rice, green dragon roll, all really good. I got the tropical mule which was amazing. Cute place! Service was iffy though so minus 1 star. I'll be coming back!", "author": "Alanna N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-12", "description": "Got snowed in and decided to give it a try probably the worse food I had in my life this is a total joke ! Worst should mai I have ever seen soggy grilled peppers and they managed to over cook my steak twice !", "author": "Eric A."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}