{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "a nice place if you're in the area, they try to make it swanky and high class which i have no problem with. Bar Tenders are selective with service even when the bar is completely empty. Not a problem if you don't want a good tip. Has a dance floor and a club space but I find it to be a little pretentious and snobby in an area that really doesn't command it. \n\nThis is more of a tourist hotspot or a hotel patron's area to hang out. would I come here again? only if my friends were here and I were meeting them. \n\nFood is mediocre at best.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "Take those \"crispy rolls\" off the menu. Who thought that was a good idea? Everything else was fine, but seriously...", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "This place is awesome omg. I had a blast here with my friends. They food looks and smell good too i didn't have any because i was full but my friends say the food is really good. Would definitely come back for brunch and watch the sunset", "author": "nyala s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Only went here for a beer on one night during my stay in Brooklyn. \n\nIt is accessed through a hotel that is on the bottom floors. The elevator that takes you up has a list of the menu and other items that they have for order. My only gripe is a limited beer selection. They do have a long list of cocktails that you can order.\n\nThe view of Brooklyn is pretty amazing up there. I love that you can walk outside and that they have plenty of seating for you and your group.\n\nStaff was friendly and seemed to be having fun.\n\nI'd stop in again for another drink or two.", "author": "Brandon D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "After making dinner reservations, my out of town friends and I arrived- we were not greeted but was coldly asked \" Yes?\". After explaining we had reservations for a  party of three, They led us to some sort of lounge seating area not meant for dinning but drinks rather, we assumed tables were booked, since we had only made reservations hours prior. After eating, the hostess asked us to leave saying the table was reserved; she was rude and un-professional. The staff is Ghetto, the place is dirty, you will be embarrassed trying to impress people with this place. I was really disappointed", "author": "Erickson D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Come for the rooftop view but not the service.  The food was fine.. we ordered a bunch of appetizers; Spring rolls, Gyoza, Shumai, Edamame, Rangoons all were tasty but don't expect to get decent service.  The place wasn't even crowded with plenty of staff who were literally standing around.  Server came for a drink order promptly but we had to chase her down to order food and more drinks.  There were only five of us and like four other tables and only a few people at the bar so they definitely weren't even close to being busy.  She could have easily doubled our bill if she had come back and asked if we wanted more food or beverages.  She even had the audacity to add a 20% gratuity.  Never again.  Do yourselves a favor and eat somewhere else.", "author": "D M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "I was here for a total of 30 minutes, 90% of which was spent waiting. It was a Monday night and the place was fairly empty. I wanted to check out the view \u0026 have a cocktail since I was staying in the adjoining hotel. Big mistake.\n\nYou couldn't see much because, although that day was unseasonably warm, there was still a cover on the \"outdoor\" patio so the view wasn't clear. I seated myself at a table and waited for a server to approach me. It never happened so I chased down an employee for a menu (Oh, look at that! $0.50 wings). I waited some more to place an order. After being ignored a handful of times I walked over to the bar and asked for assistance. They asked me to wait (...sensing a common theme here).\n\nThe bartender, who seemed to be going through training on the POS system, finally asked what I wanted. I placed a to-go order for wings and ordered a drink (...I had a weird feeling there was going to be a wait). 15 minutes later I asked if the bag sitting at the end of the bar was mine. Everyone looked confused. They checked and it was. I left (which was the best part of this experience). Wings were sub par.\n\nWould not waste my time again even if it was \"convenient\" based on the proximity to my hotel room.", "author": "Jinah Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "My boyfriend and I came here for brunch on a Sunday afternoon, right as they were about to wrap up. The hostess told us that she would seat us, even though brunch was ending in ten minutes. \n\nThe ambience- Nice rooftop with views of downtown Brooklyn. Sophisticated and elevated table setting/menu. Perfect for dates and great lighting for Yelp photo ops.\n\nThe food- The BEST part! I ordered the Sriracha Shrimp and Grits and my mouth was watering the entire time, literally. I didn't want this dish to end and was regretting my last bite the entire time. The shrimp and Sriracha combo had the perfect amount of heat, and was matched with scrumptious buttery garlic-y grits in the perfect portion.\n\nThe drinks- Our meals each came included with 2 brunch drinks, I opted for 2 passion fruit mimosas. Delicious and served their purpose. \n\nI'll definitely be back soon, yum.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "I'm giving Kimoto two stars because of their poor  service. I made a reservation for last Friday night and no one told me on the phone that I had to pay a ten dollar entry fee for dinner. To make things even more upsetting the man who came in after myself and boyfriend complained about paying the ten dollars so the staff let him in for free!! I was appalled. Upon arrival I gave the host my name in which she repeated incorrectly twice after being corrected I even went out of my to spell my name for her and she still mispronounced it ( btw my name is three letters so I know I'm not knit picking) that really showed a lack of effort . My waitress took extremely long to come back to our table and we had to keep getting up to look for her (it's probably because her tip as already included in the bill ). Although the service was ridiculous the food was actually pretty good, as well as the dj... in fact the dj played a pretty great set and made our time more enjoyable.", "author": "Mia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "so where do i start.. it was 4 of us and we ordered carribean roll, crispy rice roll , bbq chicken sliders and 2 orders of burgers. The burgers were decent but really not worth the price.. the rolls were absolutely gross! the worst sushi ever hands down and ive had sushi from many different places... alright lets move on to service.. The service was terrible .. allow me to explain.... when they brought out our food they left one of the orders out and it didnt come out until 10- 15 minutes later.. maybe they had forgotten about it until we asked again. ABSOLUTELY no napkins were given. When we tried waving our server down, it seemed like a struggle to get us the napkins as it took her time to bring it back to our table and only handed like 4 napkins. Finally, we got our hookah which was decent but that was the ONLY decent thing here. NEVER coming back here. Save your money and time.", "author": "Laila B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "I celebrated my birthday there and had a GREAT time! The weather was decent enough in October for me and guests to really enjoy ourselves outside on the roof. The staff Alyssa, Johnny and especially Nelly were all  excellent and very accommodating! My guests gave me praises all night long on the food drinks and the beautiful views!", "author": "Adam A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "Pretty Decent view. The food was bland and drinks were basic. The lady next to us had her feet on the table, keeping it very classy. It's sad because it really could be something great! Service was good except everyone kept taking my plate before I was done.", "author": "Louise L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Its my favorite go to place ever. Staff was top notch, food is awesome and the hookah is awesome as always", "author": "Antonio G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Visit Victor at the bar.  He is friendly, sociable and knowledgeable about beers.  If you are a hotel guest he makes great recommendations for other places whether it is restaurants, bars, shops, or activities.  \n\nIn terms of a hotel bar, they have a good brunch, great view, and a beer selection of 30+.   The rose cider and Japanese hefeweizen recommend were great!", "author": "Laura R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I wasnt even aware of Kimoto until a friend invited me here for a b-day get together. The location is really convenient, right off the Q/B/N/R stop at Dekalb and the 2/3 at Nevins Street. \n\nThe service was great (ask for Gabby), but the layout by where we were seated was a bit inconvenient for a large group (basically the first seated area when you walk out to the patio). I could see other people squirming past our group, and since it was a large group, that made it a bit inconvenient. The space also seems a little cluttered....\n\nI checked in on Yelp and got a free hot sake carafe. For food, i ordered an Angry Lobster roll and a Mermaid Roll. Regarding the wings, they were a bit mediocre. I had the Soy Garlic wings - i can't really say that they were that good to where I'd order them again. \n\nFor drinks, I also ordered a Humidor, consisting of Bulleit bourbon, Carpano Antica and an infused ice cube of Campari. Wasn't really a fan of it. We also ended up ordering about 8 more sake carafes for the table (lol). \n\nI'll check them out again since it is located in a convenient location, but here's hoping next time will be a little better!", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Food was absolutely delicious! Skirt steak, dumplings and the salad were really flavorful", "author": "Lu P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "Worst service ever. They took the wrong order and when everything came to the table they didn't give not even a napkin. We asked for changing the order and it didn't happen.", "author": "Valentina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "It was on the top floor above the ALOFT downtown Brooklyn hotel. The sushi was really good and the drink was amazing! It was earlier in the year so they had a cover over the restaurant. Definitely stay a night and check out the Japanese sushi.", "author": "Santhy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "This has been the worst experience ever. I had a party for 9 and when I got there on time they made us wait 30 minutes because a man would not get up from our reserved section. Second they gave me my own drink and I had to pour the liquor my self. I am very disappointed with the service and I will not be returning again.", "author": "Shadai A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Nice rooftop spot. \nView was awesome. \nWait staff young, but attentive--elevator girl, hostess, bussers; they all looked 16! Lol Stephanie my waitress was really nice, pleasant and professional you can tell she was working hard!\nFood and drinks were tasty; we had the wings and lychee martinis.", "author": "Tanya J."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}