{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-20", "description": "The only reason why I gave it two stars was because the food was ehhh/ it was okayyyy. Could've been a lot better had there been effort put into it.. edamame were ice cold and flavorless and I ordered the spicy ones. One server had an apron on and was running and on top of her game. My server however looked like she was about to go out and trying to rush us out. She never came to check on us and she barely said two words to us. Had to ask busser for water and utensils and refills etc. extremely annoying to be honest. Music kept changing mid song, pick a playlist and stick to it. Take the auxiliary cord away from the jack ass playing his phone. Automatic gratuity is not deserved, I almost didn't even want to leave a tip because the waitress was so bad, but I was forced too??? Train your employees, the game is hospitality. There is none to be found here.", "author": "Sal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Great food, they have 2 big bars. I reccomend to go during the warm weather so they have the outdoor area open. They also have hookah which is really cool. This is a nice spot, you have to dress casual. I will be going again !", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-14", "description": "The drinks are amazing I go here once a week ! It's not that bad on price . Food is okay service was pretty chilled host look like she didn't know what she was doing so we decided to go to the bar", "author": "Deena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "The layout and decor is absolutely gorgeous. I came on a Friday night after work with a few friends and the food was spot on! The Nachos and the Korean wings are awesome. The parmesan truffle fries are good but they were a bit crispy. The drinks are absolutely wonderful and fulfilled my expectations! Definitely will go back again when it is warmer!", "author": "Raiesa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-10", "description": "I'm going to be generous and give this place two starts. We went here for my friends 30th bday ( big deal, well to us). Disappointed is an understatement. Let me start by saying that the view is really nice, atmosphere and vibe cool. The DJs were really good, so I will recommend going there for the music and vibe. When it comes to food and drinks, save your money and energy. I was mostly put off by the service. We had a party of 10. We all put in our orders. When the food came out, I was missing my dish. I waited more than an hour after all my friends ate there dinner. Even though the manager took care of the issue, I was not please. Then come the drinks, I am convinced these people add water to all their drinks. To the point where you can taste that the drink is watered down. Just unethical. Also before the dinner I called to ask if it was alright to bring a cake to surprise my friend. I was told they have a $25 charge for all outside cakes( like sis that's the price of the cake), that alone should have been a warning. I'm sure there are people who have better experiences from here. But I can not say the same for myself. I won't recommend this for food and drinks to people I care about, hence I won't recommend it to you all. So Go at your own risk.", "author": "Haja F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Awesome place to grab a drink in the spring / summer time. Decent happy hour prices and beautiful view on the rooftop.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Kimoto was on the 24th floor of my hotel, and an easy choice when I needed a late lunch where I could also get some work done. I was told that in the evening it's loud and party atmosphere, but fairly quiet at lunch and until after work hours.\nI was seated in a covered but open area, already taken with the views. \nThe server arrived quickly and provided water, and took my order for a Brooklyn craft beer on the menu ($8). When she returned, I ordered a specialty roll, the Harujuku ($15) as well as Chicken Gyoza dumplings ($8).\nThe beer was very good and I was glad to drink local.\nThe dumplings were way too crispy and dry for my preference.\nThe roll was pretty, but lacked much flavor. And for $15, I would expect so much more.\nThe server didn't return and I had to seek her out to pay so I could go.\nI'd return any time for the views and a night out with friends. But probably not for the food. But that view...", "author": "Anita S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "I still go to this place very often irrespective of the 3*\n\nThe food is good, the drinks are great, the atmosphere is pretty chill and it has a good view of the city.\n\nBut the reason for the low rating is the service. Absolutely terrible and slow and disorganised.\n\nOn my most recent visit, we had 3 different waiters.\nOne of our waiters must have forgotten about us and went on to party with her friends who were guest and along came another waiter to help us.\n\nSometimes there's a cover charge and sometimes there isn't. I can never get it straight.", "author": "Mirabel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "My friends and I had an amazing time here. \nSuperb service and delicious food.\nWill definitely come back for the food, drinks and amazing view overlooking down town Brooklyn!", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "This place is gorgeous! The view is very nice! My waitress, Jannifer, is able to give me nice guidance on the food, and she is very prompt! I will definitely come to this place again!", "author": "雨婕"}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "This is my go to spot after a long day in the office. Nice atmosphere and decor. Although there's many good things to say, bad interactions leave a lasting impression. The manager was receiving a complaint from a patron and it was getting heated, my incident was with the bartender. I had bought many drinks with coworkers and simply asked for water, to my surprise she completely ignored not once, but 3 times. I had to ask the manager why that was and he said \"I don't have the patience for this now\". Given the heated complaint before, I get it and it's tough going complaint to complaint. Remaining professional and adhering to your customers is what this business thrives on.", "author": "Rashed S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "Food was decent drinks was great bartenders was very nice would come here again wasn't any dress code but you have to be 21 they check at the door waitress was okay she forgot napkins and utensils was alittle annoyed she would leave so quick and I wasn't done with my orders other was it was a cool place DJ should play more of a mixture including bachata etc.", "author": "Chynna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "The best happy hour for Monday! Wings are like 25 cents a piece and they're so flavorful all three options. Happy hour is until 7pm with wine and champagne included :) With the place always busy expect service to be a little slow but the servers are very friendly and polite. Our waitress suggested this fun cocktail the aloha and she even jazzed it up for ya. Oh oh and before I forgot... the garlic fried rice is bombbb!", "author": "Sade T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Oh how I love you, let me count the ways. \n\n1. The hotel restaurant is located in a retro hotel, ALOFT\n2. The greeting upon entering the 24th floor, will make you smile\n3. Sophie the waitress made my day\n4. Johnny the manager was attentive and nice \n5. The music on Friday - SMILING STILL\n6. Diversity\n7. Amazing Drinks\n8. Hooka\n9. Great lounge seating area\n10. Beautiful view\n11. Great appetizers \n\nI will be coming back to the hotel and well as Kimoto Rooftop restuarant. \n\nThank you!", "author": "Petrina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "This place has really limited space. Came here for the New year's Eve party and was pretty disappointed with how small and disorganized the space was. For the amount of people, the bathroom availability should be criminal. Totally over packed, ridiculous.\n\nCoat check also lost my scarf!", "author": "Alicia Katherinea B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "The rooftop is gorgeous,so are the views and drinks. The Korean bbq wings are a must! If you like coconut, rum and instagram worthy pics, get the Aloha! Stay away from the calamari, it didnt even taste like squidI highly advise you make a reservation before hand if you want to sit outside,it can get pretty crowded.\n\n The service was okay, I dont blame the server, it was happy hour on a Friday summer night. However, one thing that really aggravated me was how quickly the hostess sat down a white couple with no reservation. I walked in at 6:10, put my name down for a table outside and proceeded to have a drink at a hightop. 30 minutes later,I walk around to see if there were any empty tables. THERE WERE OVER 4 OPEN TABLES! I walked up to the hostess and explained what I saw,she   sat my party down with no hesitation. Now as my friend and I get sat,we see a lost couple walking around,trying to find a table. The same hostess that sat us noticed them,asked them if they had a reservation and when they said they didn't, she sat them at a table outside IMMEDIATELY! What kind of bullshit is that? \n\nMake sure to make a reservation if you're a POC or you won't get sat for a long time.", "author": "Yamii N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "Love the drink. Get the kobe beef slider!! So Good!! Really nice place for night life if you seek for places thats not in the midtown.", "author": "Han K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Every time we come here we as well as our guest are treated with so much hospitality! My husband and I went for a getaway weekend as we are new parents and new married couples. They made this day soooo special. We called it our \"date day\".\nThe decor and intimate space towards the back was amazing with the best music! We cannot forget the beautiful champagne cotton candy cocktail!\n\nAs soon as a new staff member arrived, they came to greet us!\n\nGoing here in the daytime on the weekend for a quick getaway with your spouse or even your best friend is a hit!\n\nSpecial thanks to Vanessa, Johnny, and Gin!!!!! You guys made our experience special. We will be back soon!", "author": "Raychelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-14", "description": "Granted I came in here in the evening on a Wednesday night only to have drinks so my expectations were a bit different.  Loved the view but the place was a bit empty.  There was no one serving so we had to get our own drinks and they ended up doing shrubbery maintenance while we were 15 feet away that further eroded the ambience.", "author": "Lee F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "Went on a Sunday midday and had the time of my life with my friends. We sat outside - the view was amazing!. The wings were good and the sushi was good as well. If you're looking for some good specialty cocktails this is your place. The music was really good. Mostly reggae and top 40. Our waitress was so much fun! I would love to go back!", "author": "Chitara W."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}