{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "I was here a month ago now, but I've been charged 6 times since then. Okay drinks and good views, but it's pretty obvious that someone has been taking down card numbers and skimming off the top (the bank has said that every purchase after the first has been punched in as opposed to swiped). Stay away.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "I'll be fair, the staff is awesome and super courteous.  The customer service was great and that says alot for it being in Brooklyn  *no shade*.  However, I was not impressed with the menu. I'm mean the options were limited and if you have any sort of dietary restrictions you'll have a hard time enjoying a meal there. The furniture was also crappy. I guess they wanted to blend in with Aloft and go with the cheap crappy Ikea furniture. I think it's a great happy hour spot and seems like a good place to host events. The view is amazing.", "author": "Marchelli H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "Came here to smoke hookah. The server was great and hookah quality was decent but it was expensive, small and when we asked for a coal change (because it went out after 10 min) were told that we would have to pay the $15 for a \"refill\" (new coal + new flavor) since they were \"running low\" on coals. Not typical for any hookah place in NY and likely will not return.", "author": "Myla P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "The drinks are expensive, the food is gross.  You are paying $14 for 4 pieces of tempura that clearly just came out of the freezer and into the deep fryer, that you can dip in a huge vat of  mayo with wasabi. The bulgogi tacos? That's some pre-made gruel too. Drink menu is unimpressive for a \"beer garden\", which they are not. If you want a beer garden, go to Black Forest of DSK, or even Ganso, the Japanese place that has an extensive list - all in the neighborhood. You cannot be a beer garden with 3 beers on tap, one of them being Sapporo.  Rooftop, check.  Great view,  eh.  But, that's not the point.   I would recommend the hotel for guests to visit me, but would be embarrassed if an out-of-towner had to experience the food here.  It's a shame because there are a lack of good after-work cool hangouts in the neighborhood and I'm always looking for a place for my parents to stay. In addition to the expensive drinks and expensive/inedible food, the service is bad.  I was there at 4:30 on a Friday and the elevator was an obnoxiously long wait - don't know what it's like if they actually have a crowd.  Interestingly, all the tables were \"reserved\" with little reserved tags on them....but no one was there. They bring their freezer-fried-food over to the table with no drinks, no napkins and a leave it to sit there. The waitress has no idea what the happy hour special is....do they just find these waitstaff on the street the morning-of?  I guess that's what you can expect from a corporate-owned money making business venture that has a captive audience (hotel guests). If you are someone who wants to have a good time, you can do a lot better.", "author": "marisa p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "My friends and I are a group of native New Yorkers and were excited to try a new bar in the neighborhood. As a concept, it sounded great. Once we got there we were immediately told that there was a dress code and once we saw the clubby atmosphere we realized that this bar is not for us. Kimoto fits in more with the outdated \"clubs\" in deep Brooklyn or Queens that are trying a bit too hard then with the hipper places in Boerum Hill and Brooklyn Heights and it's probably more for tourists. I will keep going to Long Island Bar, Grand Army, and my other local places that have good atmosphere, nice staff, and good drinks.", "author": "V P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Really cool Asian fusion spot in an up and coming neighborhood with great folks that live close by. Their Saturday parties are super chill and what I love the most is the great diversity of people that go there to hangout and get their drink on. The food is presented with great service detail and after getting to know the owners and managers a bit I am sure each dish was produced with the utmost care. . Will definitely go again and bring friends to enjoy the views.", "author": "Samu L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-08", "description": "I love this place. A nice new rooftop bar and lounge in brooklyn definitely worth a look at least. Especially if you love breathtaking views. We went on a Tuesday to check it out and get drinks before going somewhere else. We get here and the place was a little hard to find with the signage. Not their fault but that should be kept in mind. We get up to the 24FL and find a seat and after about 5 we still weren't greeted. Another 5 minutes same thing. Eventually I went to the bar and put in my pitcher of margarita order and nachos. This order comes to the table without issue. After sitting, drinking and taking in the views we get the bill and the daily specials that are on every table is not reflected on the bill. We had to get it correct. This happens so I could understand but this showed me that the staff was not knowledgeable and I guess overworked with the tables. For a Tuesday hopefully that gets straightened out.", "author": "Reese M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "Well, we couldn't even get in - despite 3 of 5 of us staying at the hotel - because one of us was wearing shorts and that didn't pass the dress code. And we're in downtown Brooklyn, the least hip neighborhood in the universe. Since when do you need to be wearing long pants, in July, to have a cocktail and eat a Kobe Hamburger.", "author": "Jacob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Fantastic modern Asian place in Downtown Brooklyn.  We went there for after-work drinks.  But we ordered some food and found it was simply phenominal.  So we stayed for dinner.  The bartenders are expert and make great cocktails.  and the food is simply fantastic.  It's pricey but totally worth it.", "author": "Rajendra M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-07", "description": "They served me a glass of disappointment. They called it a vodka tonic, I call it a glass of vodka and boiled garbage.", "author": "Ben H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "First! Great atmosphere \u0026 location, discovered a new beer that I really enjoyed as well!", "author": "Sara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "We were very disappointed by our experience there. For starters, I made a reservation for six people at the rooftop but we were placed at a table in the entrance, next to the elevator. It made us feel that these guys were trying to squeeze as many dollars as possible from the space they have. Because we were in that area, the music was very loud and there were people around all the time. Then the service was very slow, despite a smiling waitress. They were missing items on the menu. When the food arrived, another surprise: the portions were very small and expensive and didn't blow our mind. I got the Kobe burger and it didn't even come with fries although the price was something like 15 dollars. Basically, it was a bun on an otherwise empty plate. Our food not only was slow to arrive. but the dishes arrived separately: some of us has to wait even more before we got our food. Plus, we had to request forks and knives from the waitress. As for the rooftop, the views are not impressive. There is a big cooling tower or something like that in the middle of it, and it takes up a lot of space. The manager was friendly when I brought all of this up, but I hope they actually take action. For now, if you want breathtaking views, just go to the Promenade!", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Very cool spot, didn't have the chance to eat much while I was there, but what I had was good and interesting, while their version of the whiskey sour was glorious. I need to go back.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-06", "description": "They are located on the top of the Aloft in Brooklyn and you have to go through the hotel elevator to get there. That wouldn't be so bad but for no reason, they only allow you to go up with an elevator attendant who waits on the top floor instead of the lobby. We just waited 15 minutes and no one came down to check the lobby for if they had customers. After asking the hotel workers in the lobby, there is no way to call up to let them know they have customers so you're at the mercy of the elevator attendant to even get in the door. Having gone before, once in, there is an extremely limited food menu. Don't waste your time.", "author": "Catherine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "I came here for a light meal and drinks and I really enjoyed it. This place was exactly what I wanted in a rooftop bar. The drinks came fast and were delicious. The food was here in minutes and was fresh and amazing. A wonderful end to a friday work day. Beautiful breeze and relaxing atmosphere.  Ill definitely be back!", "author": "Larissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "My boyfriend and I purchased tickets for their New Year party (26$ each). The party began at 21:00, and we got there at 22:00. There was a long line and they very slowly selected people from the line. They didn't seem to care that people had bought tickets ahead of time enough to even communicate what was going on. About a hundred people, many of whom had already paid for tickets, were waiting and waiting. At 23.30 they finally admitted that they were at full capacity and can only let people in if people came out, but \"not to worry\". We left, disgusted. This place took advantage of people who prepaid, by taking their money but then selling tickets at the door to over-capacity in the early stages of the night. Then, they didn't even respect their customers enough to tell them what was going on so that the people waiting can enjoy themselves elsewhere, instead of spending midnight waiing in line. I got there at 22.00, after paying for tickets 3 days earlier, and could not get in. It's morally abhorrent and completely unprofessional. I sure don't want to go have fun and spend money in a place that treats people this way, I will never set foot in this place.", "author": "Yael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Second time to go Kimoto like the place there have a very good view and feel!miss the chicken wing there! And there is a mix fruits drink without alcohol taste delicious but I ask the bartender he said he did not have the name yet!if you go check it out with the ponytail bartender! I just love that drink!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "BUYER BEWARE!!! While the location, view and ambiance are great, beware of deeply overpriced drinks, particularly after happy hour. The house wine on happy hour is $6. The happy hour cocktails are $8. We only realized after we got our bill, that the drinks more than doubled in price after happy hour. The house wine went up to $16 and the same cocktail went up to $17. While I know this is common, I have not seen such a increase in prices after happy hour anywhere else. $16 for a glass of house pinot noir is ridiculous. Very disappointed.", "author": "S N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "I went in a group of 7, and this was one of the worst restaurant experiences ever.  Elevator guy reeked of gin. Server had to ask everyone twice or three times to repeat their order.  Drinks were wrong or missing for half our group.  When the food arrived, some of it was wrong and several people didn't get anything.  Some had to wait almost 30 minutes more for their entrees (which the server didn't even remember), and the rest were already finished.  And the check was completely screwed up.  They never even offered an apology; in fact, no one seemed to care.  To add insult to injury, the food was BAD.  Not mediocre, not serviceable.  BAD.  Avoid this place like the Zika virus.", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "I can't imagine returning to Kimoto. The food was mediocre at best. The beer selection was a joke. On a random Thursday evening, multiple options were just unavailable. The outdoor space was fine, but with the addition of a DJ it is a space that doesn't know what it wants to be. There were small children out on the terrace, meanwhile the DJ is playing club music so loud that our table couldn't even hear each other. The table next to ours complained and so did we but the staff was apathetic. We left shortly after.", "author": "Sabine M."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}