{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "WOW! Kimoto did not disappoint. The atmosphere, staff members, and food were amazing. \n\nMy boyfriend and I sat in the lounge area. I loved it. Comfy and chill. I had the Mermaid Roll and ginger salad (house salad) and he had the chicken wings with BBQ and fries. All if which were delicious. \n\nThe drinks were too die for! The Forbidden Fruit made with Hennessy was his favorite drink for the night (and is still talking about it. LOL) and I absolutely loved the Passion Fruit Mojito--Not too sweet, just perfect. \n\nOur server was super nice and attentive and the manager, Vanessa, went above and beyond to make sure our experience was the best. I greatly appreciate her help.\n\nWe are already planning our next visit!", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Now that I have comfortably settled with my piping hot cup of coffee in a remote corner of the world; I can begin to recollect my thoughts of the wonderfully wild, rambunctious, unforgettable night at Kimoto. We rolled in with the squad approximately at sundown. Let me start off by saying probably one of the most breath-taking sunsets I've seen was off that rooftop. There is a secret spot in the back where people slip away to smoke and swap bacteria that has a phenomenal view of the Hudson River AAANNND the Statue of Liberty in the distance. The rays of the setting sun caressed lady liberty's thighs with sensuous delicacy. After I was done ogling that tear jerking scenario I made my way back to our table snuggled in our own separated section (which they didn't charge for; it was courtesy of the wonderful hostess and a few charming words) \n\nListen ladies and gentlemen... listen, listen, listen to this. Be kind to the staff. You don't understand, this is a common courtesy but the people that work here will go above and beyond to make your experience special if you simply say please and thank you. I don't know what kind of animals they're used to dealing with here. I apologized if we were of any inconvenience with our large party and the staff exploded in condolences that it was no trouble at all. We all ordered food and drinks. Personally, I was quite taken with the Darkwing duck roll and the sliders. I loved the wings and dem popcorn shrimp popped my tastebuds. Mm-mmm-mm good. The DJ shook the house and we shook our assstronauts(we work for nasa).  Bring your asses bring your nauts and forget about leaving sober. Kimoto goin show you a good time.", "author": "Masha Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Great service especially from a worker named Vanessa, an amazing place to just chill and enjoy good music! Food was absolutely great and drinks not very expensive. Definitely a place to hangout with a group of friends or even a  nice small date. I had an amazing time here.", "author": "Daquan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Yummy food and drinks with a beautiful view! It's a cute date place but they also have tables for bigger groups.", "author": "J B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "reason for one star: shitty view, shitty food, shitty service\n\nI ordered 2 drinks which I didn't even finish cuz it was ugh.... but I gotta say, one drink with Asian pear and Hennessey, it said mushy Asian pear and henny, it sounded interesting so I ordered it. the drink was ok but no mushy Asian pear....instead I got a thin slice of non ripe Asian pear....like come on fam.\n\nordered truffle fries.....came cold with the smaller amount of truffle oil...like literally 3 drops and smallest amount of parmesan cheese. after first layer of fries...no more truffle and no more cheese. \n\nordered chef special sashimi plate....where do I even start. first off, soy sauce was too thick as if they've been sitting in the storage for a while. then gets to wasabi....low quality non legit wasabi.....shit don't even mix in soy sauce. just looks like clumps of green turd in my thick ass soy sauce. the fish??? they said it was fresh from market today.... who y'all tryna fool fam? and the rice was too sticky.\n\nthe servers were nice....just not attentive. I had to get up 5 times to get their attention. \n\nover all pretty shitty night because of this restaurant", "author": "Jun J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Affordable sushi, great view, thoughtful service-- what more do you need in life?!\n\nI highly recommend the spicy salmon roll; it literally melts in your mouth (in a good way, don't worry!)", "author": "Jaemoon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Really cute rooftop, the view is awesome. Decent prices. This area is really developing well. The happy hours drinks are tasty. I ordered a few appetizers, I think the wings could have been down a little my crispy but wasn't bad, I ordered the soy garlic, the bbq looked really good. The food is pretty fresh and clean tasting. It's more of a Asian vibe menu but stuck in there was nachos lol! I thought that was quite a spin on the menu! Music at a low volume, easy to talk. I recommend this spot for after work hang outs.", "author": "Tanisha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "Horrible food, fried rice was same rice used for shushing it was very mushy, Caribbean roll was decent waitress Hayley was not welcoming drinks was watered down we went in on a Wednesday night and it was dead but we still didn't receive good service only nice thing is the elevators and the lobby", "author": "Joane G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "On my first experience with this restaurant i was offended and hustled by the hostest. I requested a table to eat for 3 and was told that i can't get a get a table unless u bought a bottle or spend over $200 on food. When i surveyed the place there was 3 tables available n the hosted insisted that i can't have a table to eat unless i buy a bottle. She goes on to tell me,.i'll have to stand and  eat at the bar.. when i went to the seating area a waitress was happy to seat me n serve me , but the hosted told her no,  unless we buy a bottle we cannot be seated... as a first time customer i feel hustled n corned because i could have been seated but she refused to seat  me unless i spent no less than $200.. i would never refer or return riu this place of this is the service they give there customers..", "author": "Tracy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Definitely liked this spot! The food was really good and the hookah pretty decent (only a little annoying that repacking costs $15). But the staff was SO friendly and accommodating for our large group when we didn't even make a reservation! It was a really good night and the staff made it possible! They had good music and good vibes going so I throughly recommend this place! \nOh and GET THE FRIES!! Those were soooo delicious!! Idk what they put on top but it was so good!", "author": "Archana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-19", "description": "I wanted to love this place so badly but I caught them while they were still setting up for the day and I guess that kind of threw everything off. But still, communication is key. Came here alone to relax before a bar tending shift and just wanted to enjoy the vibe but there was none. I felt like no one wanted to talk to me when I arrived and just sat myself by the window. I was brought water and then it took a while for the server to remember to take my order. I got a miso soup, sake and a black pepper tuna salad. Miso was standard, could've been a bit warmer and served without utensils. My salad was a train wreck. All the ingredients were huge and my dressing was plated more like a garnish than something to balance the dryness of the greens so I had to get up and ask for more twice since no one came to check on me. Come to find out my server was eating in the back with the hostess. First I walked back there to ask and when I realized I needed more, I asked the bartender so I wouldn't bother her again? The whole experience was just uncomfortable like I wasn't supposed to be there. And afterwards I felt like they knew I was annoyed and instead of starting some type of dialogue about it, they all just avoided me. So then I had to flag down homegirl for the check. -___- such a beautiful establishment to have a bunch of kids running the show. Im almost positive I should've sat at the bar since that seemed to be the only adult in there. Anyways, the music was alright. Good mix of nelly furtado and old school vibes. Im sure this place is a lot better at night. Maybe I'll try again but not a good first impression. Shit happens I guess", "author": "Arielle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Formerly Brooklyn Terrace, Kimoto's style is inviting. Indoor/ outdoor dining. The menu is reasonably priced. I will definitely return for dinner as I only had drinks.", "author": "Dat S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Gorgeous venue!\n\nA friend of mine had her bridal shower on a portion of the rooftop and it was stunning. The food was delicious, the drinks were great and the space was amazing. \n\nI totally look forward to visiting for drinks or dinner, I'd also recommend it to anyone as a possible venue", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Came here on two Saturdays around 4ish with my sizable volunteer group (ANY) of ~50-75 and they were very accommodating as we let them know in advance both times and they had friendly staff on hand, goes a long way since this is not always the case...\n\nVery large and long space that has a decent view of Brooklyn.  I am usually not the biggest fan of rooftop venues because just like tapa places, I think they are overrated/overpriced.  Perhaps it was because it was a happy hour but everything was reasonably priced.  I was especially impressed with their Japanese beer selection, probably over 10 in addition to the ~5 beers they had on draft.\n\nI've only had the wings here and don't remember what flavors I got but they were tasty. \n\nThis is a much better happy hour spot than our group previously went to, (they also provide kickback since we are a non-profit, so that is awesome) I am a fan and will return.  The sushi and other food looked pretty appetizing.", "author": "Johnson L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "Why are they charging a $10 cover on Saturday night when I can cross the bridge and go to any rooftop for free? It was empty because everyone knows you don't need to pay a cover! Therefore we left and went to Manhattan because we can go to STK, Gansevoort, Mr Purple or the Empire Hotel for FREE! :)\nThe sushi is good here though!", "author": "Jessica d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Had a great experience \nWent during a slow part of the day and was pleasantly surprised at how peaceful this place can be. It seems like it can be an amazing place to spend an evening out as well. Parking is rough but you can pay for a lot it's Brooklyn......", "author": "Elior K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Delicious food and great atmosphere. The DJ was great and the surrounding views were beautiful! Great experience and will definitely recommend to others.", "author": "Aisha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Food is lovely and so as the view.\nDefinitely will come again,  but think I might come again at night for a lovely nightview one~", "author": "Annie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "It was a great experience! It's beautiful! My husband and I enjoyed the experience. The cocktails are delicious. Definitely should try the \"Forbidden Fruit\". Will be a returning customer!", "author": "Kiana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Had the best skirt steak ever! Yummy drinks and yummy sushi. Definitely get the nachos as an appetizer. The Caribbean roll was so good and filling too.\n\nThe view was nice too on a warm spring day.", "author": "Loretta R."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}