{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "From all of the bad reviews I have seen and coming here myself with some of my coworkers, I have to say that this place is really nice and the the view at the rooftop is spectacular. They offer coat service at no cost so you don't have to worry about misplacing your coat or having it stolen.\n\nI came at a time when the place was not packed to the brim so I was able to quickly order drinks at my convenience. Great place to hang out and chit chat over some drinks.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Such a great place! My friend and I had no reservations at all and just walked in. The wait was over an hour and we were told to wait by the bar. We found Amaya and asked if there was anything she could do and she sat us down immediately. She even GAVE US FREE SHOTS. DJ/music was awesome and service was good. Shout out to Amaya for making our night!!", "author": "Farjana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "What a beautiful rooftop!!! Our experience was made perfect by Amaya. Thanks to her we were able to have the most hype coworkers reunion of the summer!!!", "author": "Teddi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "I went to this place to check it out because I was thinking of doing my birthday party there. I made a reservation and that went through fine. We were seated upon arrival outside, as requested, and then things went down hill. It took them about 30-40 minutes to acknowledge our existence, with no water in the mean time, even though they passed us a few times and attended to people next to us who came later. While waiting for service, a waiter proceeded to bring us three different meals thinking we ordered them, while we still have not even been asked to order, which we told him yet nothin changed. When we finally got our food, about an hour- hour and half later since we got there, it was alright. We got the shumai and duck roll to share because we didn't want to spend too much and that was kind of hard with their prices. I give credit to them that the duck roll was interesting, pretty original to anything I've eaten before, but for $17, I don't know. We ended up paying around $30 for the two of us and left completely hungry, searching for more food. All in all I decided not to do my party there because the service was horrible  and slow, there's barely any space to move around outside, it was really loud, the view wasn't that crazy amazing, and for their prices I don't think it's worth it. If you're looking for a place to have a drink and a small bite then this place is good for that, but for my intents and purposes, I was unsatisfied.", "author": "Melanie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "I had the harujuku roll and was shocked by how awful it was. Seriously. The rice was mushy, the \"spicy tuna\" looked and tasted like raw hamburger, and the mango on top was so bland I thought it was a noodle.  The hostess and server were nice and I liked the ambiance and view, but I would not order food there again. There are so many similar comments here on Yelp that you have to wonder why the hotel hasn't addressed this important aspect of the business.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Food is pretty good, and I actually think they have good sushi but the Miso soup is way too salty.  But there is no getting over the absolute lack of service and personality.  Either sitting at the bar or in the dining room, no one knows what to do or what's going on.\n\nI've come here three times now and can say that this the worst service in NY so far.  Just sitting at the bar tonight, the bartender had the personality of a bar of soap. He did the slick\"I'll just remember your order\" routine then had to come back twice to clarify the order!  Dude...it's just me!!!!  One person!!!  If you can't remember sht then don't pretend to.\n\nTwo separate groups stood at the \"host stand\" where there is NEVER a host or hostess, then walked over to the bar and asked if they should just leave.  So pitiful.  Can't wait to see what this place is going to be in 6 months when this one fails.", "author": "Goto A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "The ambiance is incredible! Views of the statue of liberty, and with so much outdoor space, there's not a bad seat in the house! It truly is the perfect venue to combine a NYC rooftop experience with awesome food. The drink menu is thorough, with some high end Japanese whiskeys that my husband loved, and this really neat cocktail involving cotton candy that was both clever and delicious. Finally, I love that there is variety in the menu offerings so that you get the best of both Japanese and American dishes all in one spot! Highly recommend the dumplings, crab rangoon, wings, and pizza.", "author": "Kelsey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "My review is for a quiet clubbing event that I attended here, we were celebrating my friends bday here we all bought tickets online for $15 each, I was impressed with how organized things were, when we got in we got IDs checked and took the elevator up to the 24th floor and there was one line for coat check ($4) and one line to get the headphones. To rent the headphones you need a credit card that will be returned to you once you give them back at the end of the night, I didn't bring my wallet with me but they were nice enough to let me rent them with my ID, there are 3 DJs that are organized by colors on the headphone which you can switch between at any time, the dance floor is huge and has a cool rooftop area too, I would probably come back here if in the area for happy hour because I liked the space", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "I came here on a Saturday around 6:30PM. There was a private party going on until 7PM. I waited and took the elevator to the 24th Floor (rooftop) and it was a 3/5 experience. We were pleasantly greeted and were told our options. The private party was still going on so we didn't have access to the whole left side. We were given an option to sit outside or sit inside. We walked around and chose to sit inside. The waitress was a little inexperienced, she didn't really give us time and recommendations. I ordered 3 items and 2 drinks. She came back and told me that they were only serving specialty roles and small bites since the private party was going on. Quite a bit underwhelming sinceI planned on getting a full course meal here. The drinks (free saki for yelp members) were good and the appetizers were good. The view is a little bit over rated and the services wasn't all that.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "I only gave it four stars because of how hot it was inside lol. But other than that it was great ! Nice scenery. My table was by the window. We came here for my co workers 30th birthday. The drinks are good... try the korean bbq wings !. The hookah was good...and our waiter was gabby. Ask for her.  She's great !!!", "author": "Tia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Good scenery! Its hidden because its in the aloft hotel but I prefer that because downtown Brooklyn can get pretty quiet. Oh and try the wings and crab rangoon....AMAZINGGGGG!", "author": "Miah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "Very Disapointed. Rooftop bar was inclosed. Service was not good. 15 minutes for a table greet, watery cocktails never got a chance to try another round. app came out with entree 25 min after ordered. Food was ok. Service squashed any apeal this place might have had.", "author": "Angel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Love the vibes; Enjoyed the many different genres of music and drinks were not water down... The view is ok ( from what I could see, went Nov,2016) ... definitely will go back during warmer weather  to enjoy the view and drinks again.", "author": "Notoya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Great place for music and drinx... was a lil slow in the beginning... then the music picked up and haven't sat down in 3 hrs.....", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "You might as well allow your ears bleed if you're present at this venue. I live three blocks away and can hear their music so clearly I could have my own dance party.", "author": "Davis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Where do u start? It took 15 mins to get greeted by our waitress, then after taking the drink order it took another 25 mins to get our drinks sooo it took 40 mins to get drinks after we were sat and they weren't even that great. The rest went downhill from there. There was only 2 of us. Food was average, we didn't even get our food at the same time. On the plus side, great atmosphere and great music. So my recommendation is to go have dinner and drinks somewhere else and come here to have a beer and enjoy the place.", "author": "Dan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Amazing ! Great customer service , beautiful view , and most importantly delicious food!", "author": "Karen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "I wanted a rooftop in a part of the New York City that I don't frequent much, anymore. I found exactly that, here. \n\nI love how secluded from the city's bustle I felt. I love how it made me feel as if I were in Chicago instead of right here, in NYC. \n\nThe staff was super friendly. We opted for 2 choice seats at the bar. We ordered some appetizers and they were decent. \n\nHonestly, the star of the show was the service that we received. \n\nGrab a mezcal margarita here. They made me an excellent one using El Buho.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Came here for dinner with my family a while back and let me just say This place was exceptional! Amazing food, amazing view and the ambience was perfect. We ordered a whole bunch of sangria pitchers and margarita pitchers and each one was sooo yummy. Service was amazing and they made us feel really at home. Will definitely come back soon!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Came here for the first time last night and I loved it. It wasn't  too busy but the vibe is nice and they play good music. The food is good too. But the best part was the service ! My table was served by Johnny \u0026 he was amazing!!! He was so nice and helpful, he made our time so enjoyable.", "author": "Chelsea-Rae D."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}