{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "From Vancouver. Canada \nDiscovered this great rooftop bar kimoto\n\nService from Natasha outstanding !\nBest rooftop bar in brooklyn", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Great rooftop bar in the middle of Brooklyn Heights or what is now known as NoBro. Awesome drinks and exquisite appetizers! My only complaint is the neurotic host who is obviously inexperienced or needs to polish up her people skills. She went into panic mode when we wanted to sit in the outside area but the table was reserved for 7:15pm... It was 5:15 when we were hanging. Calm the eff down honey! There's plenty of time for your bougie hipster clientele! Great views of Brooklyn!", "author": "Miguel Á."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Favorite spot for a night out. Great food, location, servers, especially the bar, and their cocktails.", "author": "Bee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "My friends and reserved an area for open bar and I couldn't be more happy with the service. Angelo, the bartender was so accommodating and friendly. We were a pretty big crowd so I appreciate the patience and amazing hospitality. I would definitely come here again for the awesome drinks, service, area, atmosphere. The owner Andy is also a great person!", "author": "Lilian Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Cool spot. They played a little of everything during the night scene. Could use a better DJ but definitely would come back!", "author": "Vaune C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Cute place in downtown Brooklyn for happy hour. Beautiful scenery indoor and outdoor dining available. Quick bites to eat and hookah can make for a great date night or outing with friends. Been here twice already...love it.", "author": "Tiff H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "I went here on a Saturday night , for an \"Afro Caribbean\" party. Let's start from the beginning the bouncers or \" gentlemen\" checking the ids were so rude , and rough looking , I wanted to leave from the time I saw their non welcoming faces. I only stayed because a friend of mine was having a birthday gathering there. After asking for your ID, the bouncer quickly rushes you to pay a bogus coverage fee to get inside. At one point he even tapped my shoulder to inform me to hurry up which was so rude , let someone do that go him, I'm sure he wouldn't like it . I ordered sushi which was TRASH!, over cooked rice with barely there shrimp or crab inside , I'm sure my 10 year old daughter could make one better . Water downed over priced drinks , which I'm sure they thought they did s good job because of the stupid looking flower on the side of the cup. Staff is just rude, while passing you in the crowd they just push their way thru, no excuse me nothing ,. I seen one of the staff members twerking and exposed her bottom and her and the hostess thought it was cute , laughing , ummm ok ,. A beautiful rooftop , that will soon be closed or shut down because of all this . Crowd, not my type of crowd , rugged , rough , I'm pretty sure fights have broke out in here before . At one point I heard a man say \" I'll slap the sh!t out of him \", . Kimoto management you guys turned a beautiful rooftop into a possible death trap and just an overall flop. Som", "author": "Hector B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Came here for the first time for Halloween and it was just as packed and popping as any Manhattan club I've been to. The speakers and lights definitely changed the scene from classy lounge to a party house! Now I hear they're hosting events every Saturday. Definitely check out eventbrite for early bird tickets. They hire live hip hop DJs who know their throwback songs. \n\nIf you're here for food, definitely try their Kobe kimchi burger and if you're someone who likes spicy food-- get their spicy French fries. It's the perfect amount of kick and crisp. There's a large assortment of beers and liquor.  All members of the staff are super friendly and accommodating. \n\nI can't wait to check out more of their events!", "author": "Alice Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I had an amazing time here, my server Susana was so sweet never failed on any order made sure we loved everything and the sushi rolls were the best and the mojitos. Definitely would come back again!!", "author": "Susana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Kimoto is a new Japanese rooftop beer garden that breathes life into an up and coming neighborhood in Downtown Brooklyn. \n\nUp above the Aloft hotel, you will get beautiful panoramic views of Downtown Brooklyn which includes the Barclays Center.   Here's the skinny:\n\n- Beautifully decorated. It will remind you of a traditional Ryokan in Kyoto. \n\n- The place is huge. You have the option to sit inside or outside with the amount of space here. \n\n- Great selection of whiskeys, bourbon and craft beer. Reasonably priced. If you're looking for a Corona or Heineken, you're in the wrong place. \n\n- Friendly staff whom are very kind, accommodating and courteous. \n\n- Food is delicious and the chicken wings are a must. \n\nIn an area which desperately needed a new bar scene, Kimoto adds a new type of flare; not only by beer garden standards, but rooftops as well.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "The service here was friendly and very attentive. I'd come back here for drinks and to hang out but not for food. \n\nReasonably confident that they do not have any salt in the kitchen or the line cooks do not know where it's at.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "The place is very nice atmosphere to hangout get a drink or hookah with a couple of friends but to have dinner is not my ideal spot! The food took an hour to come out and it was cold, the waitress didnt check on us and just disappeared, my brother ordered steak it was cold, and my broccoli was over cooked and cold! But the fries though..... they were bomb!", "author": "Gigi I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "Convenient to NYU Tech area where we stayed, went based on Yelp! search.  We split apps and two rolls.  Avocado is a theme ingredient apparently and that was monotonous.  As a restaurant choice I'd rate the location over the food, but it's not bad.", "author": "Jim T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "Waited at the bar 10 minutes. Ignored by bartender and went elsewhere. Wouldn't recommend it.", "author": "Brian W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "Upside it was nice having to take an elevator to get to the restaurant and having it be on the rooftop ! It was decorated nicely. Downside was we had to wait almost an hour for our food and the music was really too loud.", "author": "Drew D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "Made an order, was supposed to be delivered at 8:38pm, called the restaurant @ 9pm, which I was told my order wasn't even ready to be delivered. Ask the young lady how long again before I received my order? Her reply was idk it depends. I mean come on people. You all can do better.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-20", "description": "I came here for a private party and truthfully it was just alright.\n\nI would definitely come back for the views but the food and drinks nothing was really worth it.\n\nI asked the waiter to help me pick a drink that was sweet assuming he would know the menu the drink he recommended was definitely not sweet at all.\n\nWe had the pre-fixe menu and the salmon tartare had bones and also like a drop of sauce and it was felt like it was missing something and also I feel if a dish has bones maybe you should let people know.. I am so obsessed with tartare and this is literally the only time that i have had and it has had bones in there. there was nothing really special about anything that made it send out.\n\nThe best part of the night is that there private room/dining room is next to bathroom. The toilet overflowed and everything came into our room how appetizing..", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "Kimoto Roof Top Beer Garden\nNY BK Downtown\n6pm Saturday 25th June 2016\nTwo Stars\n\nUsually rooftop bars get bad reviews because it's too crowded too douchey or the lack of service. There was no line to get in but we had to wait for the elevator. The attendant told us that there was a strict dress code at 7pm. We sat in the covered outdoor area. The temperature was great. The view on East Brooklyn was vast but nothing like looking at the Manhattan skyline. The place wasn't too busy we are able to cobble two tables for the six of us. The waiter didn't write anything down and mess up most of our order. We ordered a pitcher of Sapporo for two of us and they brought out to pints. The girls order Wolffer Ciderbut they were out of that. We ordered chicken Gyoza and vegetable dumplings were given. They fix it and gave us the veggie ones for free. The tuna tartare was okay. The fish were cut into large pieces and it was served with blue, red, and white tortilla chips. Six drinks and 2 apps: $100 Total. \n\n$25 card minimum. \n\nUnless you are staying at the hotel, you can find a better rooftop.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-21", "description": "I was at this beautiful restaurant music was great food was delicious! I asked the server if she could fix the lightening because it is not conducive to someone who suffers from migraines. She told me she would speak to the manager; but of course she did not. Later that night I was so sick I couldn't get out of bed and started to throw up!", "author": "Kerry R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "Food: \nBulgogi eggs Benedict: BEST THINGGG ON THE MENU. it was so gooooood everyone was trying to  steal a bite off my plate. \nKobe beef burger: it sounds really good but really just tastes like a regular burger. \nChicken and green tea waffles: it was OK. Chicken was yummy. Waffle was interesting. The syrup made all the difference. \n\nOnly thing is the portions are really small. I Still felt hungry after finishing my meal and so did all my friends. I'd recommend ordering fries or some other side to help fill you up. \nService: \nI dont know if it was just that day they were short-staffed but the service was extremely slow. Our food came out first and our sides came out 30-40 minutes after we finish all our plates. They may have forgotten it but even after reminding them, they left out my friend's edamame. Water didn't come till after we finished EVERYTHING and asked for the check. Very disappointed in the service but food was not bad and the space was nice + there was a DJ which was pretty cool.", "author": "Jacqueline L."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}