{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Great atmosphere, roof top lights of the city all around. Great January day 68 degrees in Brooklyn.  They have Orion Beer the last beer imported from Japan!  Great cobe burger and sushi salad. Great night. Service with a smile. Thank you kimoto", "author": "Matthew O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-12", "description": "Worst manager and customer service, do not go here!\n\nI booked a 2h cocktail party but I had to cancel just 4 days before my event's date. I am in the events/hospitality business and I never had to deal with such a rude and inflexible manager. \n\nThey tried to charge me so many last minute fees such as (a $50 fee to pay with a cc, a $25 fee for me to bring in a cake,$100 administration fee). \n\nThey would only let me come in 15min before the event to set up some decorations which is not enough time and unheard of...\n\nAlso they told me the week before the event that their bar for the event was broken so my guests would have to use the main bar to get drinks (which defeats the whole purpose of having a private room). When I said that wouldn't work and I would need a waiter to get drinks from the main bar and pass them around the room they tried to charge me for it. So they have broken materials and I am supposed to pay for the inconvenience/staff? No that's not how it works!\n\nThey are a bunch of amateurs who know nothing about hospitality and customer service. They acted like they were doing me a favor the whole time when I was going to bring in 50 new customers to their place and pay thousands of dollars! \n\nI am so happy I changed the location for my event it would have been a disaster to host it there!", "author": "Coralie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Here again I can't get enough of this place, came here with my friends and they love it thanks to Armando Marin the bartender...", "author": "Jose H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-22", "description": "I had high hopes for Executive Chef Brian Tsao's Kimoto Rooftop, NYC's first Asian rooftop beer garden. While the beautiful Brooklyn views and extensive beer list were there, the food fell flat. My friend and I ordered the spicy wings (8 for $11) which lacked flavor and crunch. And when we changed our minds from the beef brisket sliders (3 for $16) to the bulgogi beef tacos, we were still served the sliders. Aside from the jalapeño on top, this dish was mediocre at best. I believe in a learning curve, but the service at Kimoto Rooftop was spotty and the food wasn't worth the high price.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "This place takes your normal idea of brunch and really infuses Asian cuisine into it. I had the green tea chicken and waffles and it was amazing. Most places would just make their food look like its green tea, but the waffles will have that subtle taste all green tea lovers would enjoy. The chicken was fried with a lightly sweetened batter and topped with sesame seeds; together with the waffles makes this is your prime example of sweet and savory. The syrup they give you isn't your typical maple syrup either. They have this marmalade like syrup that gives your chicken and waffles a twist. Personally, I was able to enjoy the dish without the syrup. I came to brunch with 5 other people so I got to try almost the entire menu, and I have to tell you, you can't go wrong with anything on it. Most places almost always cook their burgers all the way through when we ask for medium, but this restaurant is certainly not one of them. The have a great burger served with Wagyu beef which was perfectly cooked. They also have their own take on the eggs Benedict which were served on top of bulgogi that blew my mind. There's a light radish sauce along with your normal hollandaise sauce that tops off the eggs. I had a small bite of the shrimp and grits and it was nicely seasoned with a smoky flavor cooked all the way through. The truffle fries come with a light sprinkle of dry truffle flakes that you'd think wouldn't be enough for a single fry, but once you bite into it you get an airy, buttery, crunchy, best kind of fry you'll ever eat. I say these are one of the best fries I've had because you can still taste the truffle even on the fries that aren't dusted with the flakes. The mimosas come out with an orange peel inside a tall glass decoratively spiraled to give it a unique look. \nThe only issues we had was a long wait for our food along with the waitress forgetting our fries until we asked for them AFTER our meal. Pretty appetizers should be out first. \nThe location is a bit hidden, but perfectly located a block away from the train station. It's a great rooftop venue with an amazing view of Brooklyn. Would highly recommended coming for brunch and will definitely be back.", "author": "Alan Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "Great atmosphere but I went there when it was called Brooklyn Terrace so the views didnt change but the decor has changed.  I preferred the couches that they had before but the decor is nice.  The wings were average, definitely not organic wings but tasty.   They were ok.  The ronnito drink as well as the beer that I had was pretty good.  Complaint servers need to pay attention to the orders.  We wanted the side fries, got the cheese fries (or whatever its called with beef, etc) and luckly my date ate it because I was sending it back.  Then the server gets the side of fries forbme but $7 for regular fries...come on.  I'd go back if someone else is paying", "author": "Ronsheeka H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "The service was excellent, our waitress was extremely friendly, the food was delicious, and the drinks were exceptional.", "author": "Riley P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "Terrible service. My husband was charged double on his card. That was a very negligent and she wasn't the nicest. Would not recommend this restaurant.", "author": "Keanda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Great views! Nice ambiance and yummy drinks! We hosted a work event here a couple of weeks ago and the staff was accommodating and seemed to be easy to work with. Great happy hour specials!", "author": "Kristin F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Nice views not enamored with staff losing a tray of brownies after informing us of a$ 25 cake cutting fee After our event they claimed they couldn't find the brownies How does that happen? I'm sure the staff enjoyed them", "author": "Steve H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "This place is steps from new home and fantastic experience! Love their siracha wings! Our waiter Darrell (I spelled his name wrong) is amazing with his friendliness and fun!", "author": "Jenni Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "The vibes are everything in this space. I didn't have the opportunity to try their food as the kitchen is closed in between lunch and dinner. The views were nice and the staff were very pleasant. I'd definitely try this place again.", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-06", "description": "Where's the veggies? Smallest spring rolls ever. Had to send my first glass of red wine back because it was bad. Service was challenging even though it was slow. Then the hostess wasn't wearing a bra...awkward!?!? Food was ok and would have tasted better after a few drinks. Had the shrimp and tuna salad, sir chicken wings. Wanted dessert but they don't have any. On our way out we found the napkins and gave them to the table that was waiting to wipe off their hands from eating messy burgers.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "I recently ordered a simple basic drink (ameratto sour) at the bar.  It was unfortunately prepared by a heavily tattooed young woman, who for some reason served it luke warm, missing a garnish, no drinking straw and in a worn out glass.  Where did she go to bartending school??? Taste was blah!  Not worth my $14.", "author": "Blair C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "An Asian rooftop beer garden in Brooklyn? This is f-ing awesome! Came here with my boyfriend to see how the place was and it had such great vibes. I felt like I was in Manhattan instead... Minus all the traffic and no parking zones. \n\nDRINKS were on point! Yes, It took a little more time but it was definitely worth it. Try the one with lavender honey or the one with the fresh honey dew and ask for Victor (super nice and has shiny hair)! A lot of people here complaining about the time it took for their drinks to be made. Well, go to a pub/dive bar then! :( \n\nVIEW was amaaazing. You see the Barclays center, the Manahattan skyline, and even the Statue of Liberty. They have an open area and a closed area so it's good for all types of weather. They even have a big screen TV at the bar for all the boyfriends on Football Sunday. \n\nFOOD was sooo good. The beef tacos were everything I expected. They won on the Food Network show, Beat Bobby Flay, and Chef Brian was nice enough to bring them out himself when a waiter overheard me talking about them and told the chef.  He told us a little about himself and his journey as a Chef and he was just so down to earth and passionate about food.  Cool guy. The wings and summer rolls are must trys also. Everything had a bit of an Asian twist to it and that's what makes this place so unique. \n\nSERVICE was on point. Everyone was so attentive and nice. They even have their very own express elevator and someone to bring you up! \n\nDefinitely going back to this place again. It's a super hip yet classy place so please dress accordingly! It's an ideal place whether for a cute date night, a girls night out, or even an after work drinks place. Went to the bathroom and saw they had this cute semi-secluded party room in the back, and I might just have my birthday there next month. \n\nLOVE, LOVE...LOVE!  :) \n\nP.S. They have a DJ too! Music definitely sets the mood.", "author": "Connie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "Meh, is the right word. Mediocre service, food, and decor. Great views.... \n\nI ordered nachos which said they were served with cheddar cheese. In fact, it was cheese whiz, perhaps not shocking at ballgame but are real let-down at a place that's supposed to be somewhat upscale and has such a small menu. Take some pride in what you do, chef.  \n\nOn top of that, when I called the wait staff on the misleading menu, which stated they \"cheese,\" they played dumb and tried to convince this chemical food was actually cheese. I'm giving it one extra star because I was with a good friend, so the company was nice.... \n\nSkip this one. There are plenty of rooftops in NY that are FAR better! \nWAY", "author": "A E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "There is a $25 credit card minimum and the ATM downstairs in the hotel has a $4 surcharge. Impossible to stop in for a casual single drink.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I give five stars rarely, but the amazing waitress on Tuesday night (great vibe, super friendly, good recommendations) here was so on point that she won this place that grade. Good food (tuna tar tar, kobi burger, mini tacos) and drinks too.", "author": "H L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Found this place while looking for a good rooftop spot to grab a drink after work. It's a really cool space with great views. Flatbread pizza was delicious, and drinks were great. John the bartender was awesome! Good location too, right near Atlantic Terminal, though you might miss the entrance if you weren't looking for it, as it's actually the top floor of a hotel. Free carafe of hot sake with yelp check in.", "author": "A Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "A great view of Brooklyn compliments this quaint rooftop bar. There seemed to be some filming going on which was interesting. The staff was friendly. Be aware there is a 25 minimum on card charges for those who just want a quick drink. Access is a little unclear so be sure you go into the loft hotel entrance.", "author": "Ben S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}