{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "We've been here for an hour and got our drinks about 5mins ago. One drink was forgotten. Found our waiter chilling by the bar... he forgot that he never took our order.", "author": "Nikki L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Went here for a birthday party. The food was good, the drinks were nice, and the view was great. However, the hookah was way overpriced and terrible. They use cheap coals that burn out quickly, and have a very limited selection of flavors. Do not get hookah here!", "author": "Maroua R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Amazing food!! We got there for a birthday and once stated to the host they made everything spectacular. The server was really attentive, all the food and drink came out at the same time. Amazing view of BK and the Statue of Liberty. Will definitely back here soon!", "author": "Luis D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Great place that just opened in Brooklyn. This place has awesome views and great ambiance. There aren't many food options but everything on the menu is great! Service is friendly and timely. I highly recommend to everyone!", "author": "Phuong P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "I went here last night with big expectations. Didn't measure up at all. The drinks were very expensive and nothing special. I expected high drink prices because of the supposedly amazing view. The view didn't meet my expectations either. The side of the building that faces Manhattan is where they have the kitchen. You don't really see anything special from the bar. Maybe it looks a lot better during summer when they uncover the patio. The atmosphere was like kinda dead so overall not a fun experience. Also had to wait 15 minutes by the elevator which was slightly frustrating. Maybe will go back in the summer.", "author": "Bernardo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-12", "description": "The bartender didnt make it clear that the shot for happy hour was 13, not 6. Definitely not coming here again.", "author": "Ramda Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Came here with some friends for a day party last weekend. Nice scenery drinks were a little expensive and so were the shots. The DJ in house was cool he played alot of familiar classics an some current songs. Would definitely return but I would probably buy one drink because there so expensive!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "I stopped by Kimoto on Thursday and what a good night for a rooftop bar/lounge! The weather was really nice + the view was beautiful. The aesthetic-loving side of me appreciated the decor of the place - a mix of wooden furniture with a touch of grey in some of the couches for a little warmth. I find Kimoto to be trendy chic in a subtle low-key way but I also came on a Thursday night which wasn't super-crowded which is more my speed. Not sure how the weekends are. Truffle fries were extremely good! The only downside is that I live in the UWS so it's a little far from me but would definitely come back if I'm ever in the area.", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "More than meets the eye.  Despite the outside appearance, the inside of this place is clean, (very clean bathrooms, wife agrees) and the staff extremely attentive and friendly.  The drinks were very reasonable, with good local and int'l beer selection and full bar.  This was our first time in, and though it was with trepidation initially, actually a great place.  Excellent sports bar with good TVs, beers/drinks, prices, and service. We'll be back soon.", "author": "Debra A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "I came in to have a small meal and cocktail while staying in a hotel accross the street. I ordered and all was fine. There were a lot of people enjoying themselves. As soon as I ordered, the music was turned up to a deafening level. My glass of wine started to grow legs and dance its way to the edge of the table. The others around me who were having conversations started screaming to each other. I couldnt wait to finish my food and get out.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "View was excellent and the staff including Andy (the owner) were very welcoming and informative. The Bulgogi tacos are indeed tasty.", "author": "Mohammed D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "Overpriced everything. .This is Brooklyn,  not Manhattan!!! So my recommendation would be to go up the block to get a bite, a drink, there's many other places with reasonable prices \u0026 good quality food; then come look at the nice view, roof top view, order some Ice and chomp on it! lololol I'm so serious.", "author": "LA LA L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "Yeah, skip it, don't get fooled by the rooftop. Over expensive, way too loud, bland ambience, and we ran into a ton of surprise arbitrary rule-making when we arrived. Also, they neglected to mention when we made the res that that night was cigar night, which was exactly as unpleasant as it sounds. I know, I sound like an old person. But Just a bad restaurant...definitely better options nearby.", "author": "Aaron V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Awesome night here, really good food and an unreal view of Brooklyn. Ill definitely come back here and invite some friends. The food was awesome, i tried the drunken mantis and the Kimoto and wow ! Really balanced drink and the tacos are to die for !will reccomend this to all my friends", "author": "Arismendi D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-16", "description": "I really really wanted to like this place. On the surface, it has everything going for it: rooftop, proximity to transit, Asian food, cute graphic design, new-ness... However, the reviewers below who thought they were trying too hard are exactly right. I'm not sure who they are trying to cater to (well, maybe I'm being a bit disingenuous here) but I hope that anyone who comes here is really into that pretentious elevator door person thing and overpriced, uninspired drink scene. I went twice, once unfortunately on their \"private\" opening night wherein I was allowed up but repeatedly dogged by staff ushering me here and there (Just post a sign or turn me away! It was very uncomfortable and I left without ordering anything) and a second time where we ordered a round of sadly disgusting cocktails, looked at the lovely view, and left. They were well overstaffed, even on a Friday night, where there were perhaps 5 customers in the whole bar. Drinks are $15+, but I can't say anything about the food here and probably never will as I don't intend to ever go back, though I live nearby. Sad. \n\nI don't think that the issue is that it's a hotel bar, per se. Leaf Bar and Lounge in Flushing off the 7 is very similar in concept (rooftop hotel bar in a busy commercially driven neighborhood with an Asian theme), but the difference was night and day. You really can tell when the cocktail program has been developed with care and by people who know what they're doing. \n\nTLDR; if you have good drinks and good food, don't try too hard and keep it inviting, people will respond to that and keep coming back to throw money at you. Make it an unpleasant clubby bs thing, and you will be spending lots more money on fake exclusivity than you will rake in. Maybe I'm wrong, but it's hard to be excited about the prospect of more of these weird places popping up around here.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "This place rocks and I can't wait to go in the summer when the roof is open. I has the Valentines Day drink and it was yummy and strong. The service was top notch. Nice bartender and busser. My only complaint was the express elevator ran like the A train at 2am. But like the A train, once you're in you're in:)", "author": "Jai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great selection of Asian beers. And Victor had some great recommendations! First time I've had yuzu salt beer.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Its a nice place for after work drinks. Their food is not that great, but the drinks are solid. The times I've been it has never been crowded and we were able to get a table quickly.", "author": "Shea W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Not happy with the doorman. He was rude and very discriminatory. Make sure you wear at least 4inch heels to be permitted to enter.", "author": "Theresa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Once again, Chef Brian Tsao and Andy Lee have pulled it off. This Year-Round (yes! They have plenty of indoor space and outdoor heaters) Japanese Beer Garden is the perfect remedy for a long work day or change of pace.  The spicy wings are delicious and massive.  The loaded fries are amazing, perfectly cooked and not heavy.  But the icing on the cake here is the World-famous Bulgogi Tacos, paired with a craft Japanese beer, this is the next best thing in Brooklyn.  The service and waitstaff are attentive, and, more importantly, friendly and knowledgeable about the menu and drink selection.  Thinking of drink selection, Peat's Dragon and Enlightenment were distinct and different! The Peat's Dragon is an eclectic whiskey scotch drink that is unique and refreshing; perfect for a cool night or hot day.  Kimoto is the perfect blend of you're looking for a unique experience, great food, and better drinks.  It's staff make the experience even more valuable. Get here. You want to be a part of this new place in Brooklyn yesterday!", "author": "Michael C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}