{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Reasonably priced drinks and food for a rooftop bar.  Friendly staff and great ambiance", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Lived in Brooklyn forever. Now I go to grad school in the area. Love this spot for quiet, rooftop drinks early evening. But as the night goes on, the PARTY GETS PUMPIN'. This is my new go-to spot.", "author": "Rose B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Horrible experience!! First it's $10 for an entrance which is absolutely fine.. After like an hour when it started getting busy the hostess asked us to leave the table as they had a reservation, when we were told that reservation was not necessary. I also wanted to make sure and so asked if the entrance was $10 for my cousins. The girl said yes and after a minute or two asked me that it could be $10/20. Was my worst experience. We went somewhere else as we had to give our table and sit in the bar.. It was a awesome place! But had my worst experience ever", "author": "Kami P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Excellent service by the staff and management. The view is amazing!  My new summer location for great food and drinks!", "author": "Francisco O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "First off, this venue has the best view of Brooklyn Heights. Instead of paying Manhattan prices to enjoy a gorgeous view of New York, Kimoto rooftop gives a full panoramic view of downtown Brooklyn and even the Statue of Liberty. Chef Brian Tsao's delectable Asian fusion small plates pair extremely well with the selection of cold beers and cocktails. Definitely a great place to check out for happy hour. During the colder months, part of the outdoor rooftop area is enclosed, providing the nice view without the winter elements. Staff are all very warm and friendly. Bar is easily accessible from the city by subway. Highly recommended! Try the bulgogi tacos.", "author": "Lawrence L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "I have been looking forward to going here since I first heard about it some months ago. I've been a Downtown Brooklyn resident for 11 years and was excited about the craft beers and great views. Unfortunately, I didn't make it up because I wasn't dressed nicely enough. The bouncer was very nice about it and said sorry but that's what the manager wants. Dude...it's a beer garden...in Brooklyn..at 6pm. The only other place I've been to here that has a dress code is the River Cafe - one of the nicest restaurants in the whOle city. It's disappointing that this is the kind of attitude that people think is going to fly here. Hopefully, it won't.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "5 for the ambiance, great views and delicious tacos.\n\nminus 1 for the 14 dollar beers.\n\nminus 1 for the guy in the elevator with the walkie-talkie who told us they have a \"less casual\" dress code but he'd \"see if we can find you a table\"...only for us to arrive upstairs to an almost completely empty restaurant (there were maybe 6 people eating, the place is huge)...it was a wednesday.  unnecessary.", "author": "Sim T."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}