{"aggregateRating": {"reviewCount": 391, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "Chill rooftop spot , eating apps and drinking sapporo. Cool low key vibe here. Gets busy in the summertime", "author": "Tonya T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "Very nice employees very nice place lovely but no there is a BIG BUT zero management they don't follow  their rules everybody is with hat and sleepers  if you wanna have quite  dinner  this is not a place for you", "author": "Soner C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Came here on a Friday to throw my brother a little surprise 30th dinner with friends. The food was good, drinks were great, but the service was PHENOMENAL our waitress Gabby was so on point, always attentive, super nice, and was swift with everything. The food was good but the service was better so that's why I will go back. Rooftop views are fun too. My only complaint is that this place is not a place to bring your 70 year old aunt and uncle: the music was so loud I felt so bad for them but for us young folk it was what we are used to.", "author": "Renee L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Had a good time. The djs were good. I like the layout with the bar being away from the dancefloor. Street parking was easy.", "author": "Jan A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "I went here after work one night last week because this is the only rooftop bar near me NOT in Williamsburg. I wish their happy hour was until 8 and not 7 considering everyone's after-work commute. I had 2 drinks and they could've been stronger. Also, I saw someone with a hookah and asked about it. She must've been an employee, because the waitress told me they don't offer hookah until 9pm. You shouldn't let one person smoke it if no one else has the option. The first one was absolutely watered down. The view is great and the place is huge. Next time, I'll have to try their food.", "author": "Caitlin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "The food was spot on. The space was beautiful and had a great ambiance. Perfect for a dinner for two.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "Food was decent, drinks were alright... service? HORRIBLE. Everything took forever and they kept bringing peoples food to the wrong tables. After we ate and drank, we asked if we could get hookah. Our server moved us to the patio. Not only did the hookah take forever, but the hostess came and told us we had to move because a party was coming in. She moved us, the  our waitress came back and moved us to another spot. About 15 minutes after our hookah arrived, a bouncer came and told us we had to move for yet another party coming in. When we explained to him that we had been moved three times and that our waitress told us to sit there, he gave us MAJOR attitude. He kept repeating over and over, \"That's not my fault. That's her fault. You have to move.\" Then, as we walked out and said we would go to another bar, he insisted that we didn't have to leave and that we could go to the bar. He didn't offer to move the hookah or our full drinks. Do not waste your time or money. View wasn't even good.", "author": "Dana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I discovered Kimoto Rooftop when looking for a spot to grab some lunch around the area. Located on the 24th floor, they have a great view and some really delicious lunch selections. I asked the server,Andrew, if he could recommend a dish,he suggested the chicken teriyaki bowl which didn't disappoint, super savory and filling! Atmosphere was great and service was on point, Andrew was very attentive and friendly. This is the perfect spot to grab lunch or drinks with friends, will definitely be coming back!!", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "The idea of the rooftop lounge sounded better than it actually was.  I decided to dine here one night since I was staying at the aloft hotel right downstairs.  I sat at the bar and while they weren't super packed, service was really slow just to get a beer.  I also ordered the chicken gyoza and wings, which took forever and they weren't even that great.  The wings were really chewy and didn't have that much flavor.  The views are decent, but New York has much nicer rooftops.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "This place is so pretty, the views were so nice. It was cold so they put down transparent curtains so we could still enjoy the view but stay warm. The staff was friendly and accommodating. I got the kobe burger and it was okay, the meat was good but I was hoping for a lot more flavor. Liked the atmosphere, would go back!", "author": "Sadia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Food and drinks were on point. I had Spring Fling and Dragonite drinks and for dinner: Spring rolls and crab fried rice. Service could be improved. Very slow taking orders. I would definitely come back.", "author": "Shameeka M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Brooklyn is not a place I find worthy of venturing to very often. It takes a lot to encourage me to leave Manhattan - especially for food and drinks. But, Kimoto offers something unlike ANYTHING else in the NYC metro area.\n\nPeople tell me that 'Downtown Brooklyn is an up and coming neighborhood' all the time. If you have a friend in real estate, you'll understand that EVERYWHERE is up an coming apparently. But, Kimoto Rooftop might sway me to believe that the neighborhood is actually up and coming now.\n\nSitting above the Aloft/Sheraton hotels, you get beautiful views of Brooklyn, Manhattan, and even Lady Liberty!   \n\nHere's the tea:\nDecor: Incredible! Really gorgeous zen-like feel with beautiful light wood and lots of cute plants. Definitely transports you outside of NYC.\n\nSize: This place is huge. You can sit inside or outside. And ditch your friends easily if you want to do so.\n\nDrinks: Great selection of whiskeys, bourbon and craft beer. Typical NYC prices. If you're looking for a Corona or Heineken, go find some shitty dive bar, this isn't the place. \n\nService: Friendly staff whom are very accommodating and courteous. They're around when you want them.\n\nFood: Chef Brian Tsao - enough said really. Awesome plates for sharing - or eating alone (no judgement)\n\nI'll be looking forward to seeing what kind of events will go there for sure.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-12", "description": "I live in the building next door but I won't be coming again. Nice view but very indifferent service and shoddy fixtures. Not a classy rooftop to impress someone! This is a review for just drinks. We came at happy hour.", "author": "Tora S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "My second time here and this time had a bite to eat! The place is located on roof of the hotel. Not so big but very cute and the music is really good !! As for the food, the menu is small had the Kung pow chicken and it was a tiny piece of chicken on a salad and the sushi was good but it fell apart easily. But still had good flavor.  Drinks are good, but if you want regular soda it's $4. The outside is so cute and nice to see the view. Seats are limited and they don't serve you outside so if you want or eat it's only a few tables inside. Wish the food was more filling and more options.", "author": "Graziella O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "I celebrated my birthday here in early November.  It was definitely a great choice.  My friends and I were very impressed with the venue.  The view is definitely breathtaking (for the fast changing downtown Brooklyn).\n\nThe service was EXCELLENT.  I booked my party with the event planner, Kelly.  I had one phone call with Kelly.  We mostly communicated through texts and emails.  She always responded to all my inquiries (Thanks Kelly) and ensured that everything that I requested was present at the night of my party.  I was also very impressed with our waiter, John.  He along with the other staff ensured that the food came out on time and was replenished when needed and kept the tables clean.  They also made sure that the pitchers of beer and sangria we ordered were filled on the table.  We also had a open tab for additional drinks. There were 2 managers present that night.  I only remember Anthony though.  They both introduced themselves and occasionally checked in on us.\n\nI ordered several appetizer platters - nachos, 2 types of wings, spring rolls, dumplings. Food was great. Great music also. There was a live DJ that kept us moving. My husband and the other guys in the party enjoyed the different selection of beers here. I had a cocktail called Sensei. It was fabulous. Loved it!\n\nMy only regret is that I did not find this place sooner.  I, as well as my friends that attended, plan on returning to Kimoto Rooftop in the future (especially when the weather gets warmer).  Just have to let you know that the view is still beautiful on a chilly night whether you step out on the terrace for a few minutes or stay inside and look out the giant windows.\n\n2 thumbs up Kimoto!  Thank you for making my birthday a memorable one!", "author": "Raine K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Horrible service. We came here on a Saturday's night expecting to have fun and enjoy the night. The manager was kicking people out of their tables bc he wanted to make room but he did not do in a professional manner. He was using embarrassing body language and yelling at the bust-boys to do his dirty works. It seems like their was only one waitress on the floor service VIP table and had to wait over 30minites to put our order in. I would not recommend coming here in the future.", "author": "Corinthia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "I'm a sucker for rooftops and this one is no exception. Sleek design and ample bamboo makes for a zen like ambiance.\n\nBulgogi Beef Tacos, Takoyaki, Spicy Wings, Farmers Veggie Dip, Disco Fries were all delicious and more than enough food for 4 people sharing. My favorites of the bunch were the spicy wings and disco fries. Service is a bit spotty out on the patio so be sure to get your order in all at once. Nestled in the Aloft hotel, Kimoto is a hidden gem that's sure to impress your friends that don't venture to downtown Brooklyn often.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "Booked a roof top table for birthday celebration based on the reviews of the roof deck view and fun ambience . Upon arrival we were told we had an inside table in the corner in the back of restaurant as the roof deck was booked for a private party. Staff was very unprofessional and unapologetic , bordering on rude and condescending . We left . And thankfully found a great sushi place for our celebration . Would never go back!", "author": "Dear F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Excellent service great food great drinks atmosphere was excellent our waitress Gabby handled our big party great", "author": "Tony R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "Make sure you get your waitress skills out because you will have to carry your own drinks to the table.  You also have to go up to bar to place an order and don't forget to  grab a tag # for table.  I was running back and forth and I wasn't even on the books.  So tacky, I've never been in any establishment where I had to do such service.  Not to mention the receipt ask for a tip! If anything they should be tipping me for running like a busboy!  We were later escorted to another table because the outdoor tables was \"reserved\" like literally right after we ordered a bunch of stuff.  TACKK", "author": "Dat S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Kimoto Rooftop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1g9cY07z4nzuAypVR1s5zw/ls.jpg", "@type": "Restaurant", "telephone": "+17188588940"}