{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "This landmark downtown Brooklyn restaurant never disappoints us. My family and I have been coming here for years, and the food is always delicious. The white table cloth ambience and waiters with a napkin draped over one arm is a reminder of how much the restaurant industry is about service. We went last night after an event at Borough Hall, and had a great meal. I highly recommend a visit.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "Great location ,great food, , great service . We have been passing by this place for years wondering how it was inside , well we finally went in and was pleasantly surprised at how lovely it looked . We were happy that we chose to walk in and eat there. The music kept me company while I surfed the menu .If you like Italian , this is the place to go. I had the Salmon which was amazing .The Veal with truffles also a great choice . We will be back.", "author": "Denise F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "This place was FANTASTIC! Absolutely delicious!! If you are looking to go out for a nice dinner and are willing to spend a little extra, this is definitely the place to treat yourself. There is a little Italian man as the hostess and welcomes you to the Restruant. He was adorable. The staff was VERY attentive. \n\nI went with my parents on a weekend when the came to visit me here in Brooklyn. The dinner starts with a nice bread platter. Italian bread, wheat bread, bread with red sauce on it, and crispy thin bread sticks. For my entrée I ordered the chicken parmigiana while my mom ordered the carbonara and we split it. It was the best decision. The carbonara was mouthwatering and different than other places I've gone too. Very unique and left me almost wishing I had just ordered that. Almost being the key word, because my chicken parmigiana was just as good. \n\nThe flavor of the red sauce is great. My only complaint was they forgot some of my leftovers and I hadn't checked the bag before leaving to make sure all was there. There should have been two containers with some chicken parm and the carbonara but there was only one. I imagine if I had called they would have possibly given me a replacement or compensation but I wasn't going to bother. \n\nThere are many tables available with enough space between them to make seating comfortable. The lights were dim so I did notice a few of the older customers using their phones flashlight to read the menus, but it was a great atmosphere. I am excited to go back again.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "By far my favorite Italian food restaurant ever.  I cannot speak highly enough about the food or the service here!  Recommend to us by friends and needless to say it far exceeded our expectations.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-11", "description": "A quality restaurant. Had troubling sitting a large party even with reservations. Food was very good.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Old school Italian was what I wanted, needed and found. Clams Oreganato, beautiful , Chicken Scarpiello, great sauce. Could not pass up dessert. Had the Biscotti assortment . Delightful.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Classic old school Italian. I had fettuccine Bolognese that was very good a little too salty for my taste but still good.", "author": "Guy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Queen is as good as it gets for Brooklyn Italian food.  Part genuine Italian trattoria, part old school Brooklyn, beautifully melded.  I love this place and hope it never goes away.  The food is so good, and everyone is treated like family.  The prices are reasonable, the wine is great.  The service fantastic.  There are so many mediocre restaurants in New York or restaurants that are trying to do a twist on something, and Queen is NOT that.  Queen serves excellent examples of classics.   Everything we have ever eaten here has been excellent, and we have been going here for years.  I can't say enough good things about it!", "author": "Lmj_brooklyn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "My friend who moved away from the area came home to visit me and was craving \"some good Italian food like he had growing up.\" We decided to come to Queen and it did not disappoint​. Everything was perfectly executed. The chicken parm was the best I ever had and the ambiance in the restaurant was awesome. It is one of the few remaining establishments of it's kind, and the type​ of Italian restaurant I grew up expecting, but have gotten harder to find these days.  This is my go to place when I want to impress someone with the best Italian cuisine in the area. \n\nTo put the icing on the cake there Matre'D Frank is an older Italian gentleman who has obviously been there from the start. I hope they never change.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "The food here is  always amazing! I've gone to many \"well known\" Italian restaurants in Manhattan, and they don't hold a candle to Queen. \n\nThe appetizers are always knock outs and when I go I always get and highly recommend the shrimp alla fiorentina. The service is top notch, the waiters are very polite and well mannered. I am not sure how other reviewers can diss the service.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Went to Queen for dinner tonight with a friend that happens to live around the corner and it was great! My friend had already been to Queen considering she lives in the neighborhood, but this was my first time visiting. It's a homey classic Italian restaurant and it was pretty busy on a Sunday night. \n\nWe started out with an order of the fried zucchini. It was so delicious! It was basically skinny strips of zucchini and a very generous portion. For our main meals my friend ordered the bolognese with the fresh pappardelle and I had the veal parmigiana. Mine actually came with a side of penne and I asked to substitute red sauce on my pasta for garlic \u0026 oil. I was told it would be a little more, but I totally should've asked how much. I was charged $5 extra for just garlic and oil. It was all delicious, but a little too much extra for just oil and a piece of garlic on top. To finish off our meal we shared the chocolate tort that came with vanilla gelato and raspberry drizzle on top. The dessert was awesome! We both really enjoyed the tort. \n\nOverall Queen was excellent, but a little bit pricey for what we had. It's very clear that this classic Italian restaurant is a neighborhood favorite.", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "I was so disappointed.  The first time I went here was about three or four years ago and I liked it a lot.  We went there last evening with an out of town friend and I thought it was only fair.  The restaurant has been there for many years and my overall assessment is that it is tired.\n\nThe artichoke and fennel salad was overly dressed so that the fennel barely tasted. The artichoke was okay, but there were only two small hearts.  My wife had the stuffed artichoke which was only fair.\n\nMy lasagna was inedible.  I have no idea what it was made from, but it certainly was not layers of pasta with meat.  It may have been made with eggplant, but it was tasteless.  Our friend had salmon which was overcooked.\n\nDesserts were okay.  \n\nAll in all, it was expensive and not worth it.", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "4.5 stars. Great chicken parm. Lasagna good but chicken Parm better. Focaccia break superb. .", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Old school goodness and charm. Baked Penne with a rich, unctious, playfully-stringy, fresh Mozzarella baked on top. I'm usually not a fan of globs of Ricotta but this dish it was well-incorporated throughout the sauce, which was tomato-ey goodness. \nYou're greeted by a petite Gepetto-type of gentleman, who's definitely from Italy. He's well-groomed and a gracious host and gentleman. It was refreshing having him great, seat and explain some of my options to me. It seemed as if all of the other staff followed his lead.\nThe atmosphere is a tad antiquated but adds to the charm. \nThe House Chianti staved off my hunger pains. It wasn't too heavy but light enough to be the perfect first glass, while waiting for my food. \nThe fresh sesamed quarter loaf was fresh and hit the spot.", "author": "JL K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Doesn't get any better than this.  My family has been going here for over 50 years.  Made the trip from Long Island to meet up with friends from outside the city and everyone was blown away from start to finish.  Wish I lived closer, it would be a weekly visit instead of every few years.", "author": "Jim D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "If you like being treated like garbage, this is the place for you. My family waited an hour to be seated and we had a reservation. Sure, the food is good, but it's over priced and there are so many better places to eat in Brooklyn. We were upset about the wait, and the manager told us it wasn't his fault. No apologies, no offer to comp food or dessert. And, once we finally got our food, they kept rushing us, trying to take our dishes away before we finished. Completely ridiculous.", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "A local gem,beloved by the neighborhood and those from far \u0026 wide for generations. I haven't eaten at Queen in at least 15 years and was truly in for a treat. It's been renovated from my last visit all those years ago, but still has what I love about these old school Italian joints- spacious tables with tablecthoths.- love it.\nWhat spoke to me mostly was the food.\nNice bread basket w/ focaccia and crispy grissini w/ simple olive oil \u0026 a sprig of rosemary\nAte:\nArtichoke  w/ olives capers \u0026 parsley \nFilet of sole w/ cured.olives in a light tomato broth steamed veg on the side\nI asked specifically for no cheese or breadcrumbs on the artichoke and no flour on the fish. Both accommodations were provided and I loved my food. Best artichoke since Lilia's maybe partly better because they are so nice here. Nice piece of polenta w/ fish \u0026 al dente steamed veg. Old man runs the spot and you know this is a real well run restaurant where I felt like a Queen. P.S there is a three course prix fix before 6:30 for $29.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "The price fixe menu is more delicious and less expensive than at Barbetta in Manhattan", "author": "Dolores B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Itaty lives in Brooklyn. Classics expertly prepared, served well. A black pasta with scallops and shrimp and light fresh tomato sauce-seafood so fresh and expertly prepared with a delicate homemade pasta, finished with light Italian cheese cake made this morning, glass of reasonable and delicious Italian wine...I must be in Italy but no, I am in Brooklyn minutes from daughter's in Boerum Hill. This kind of quality and service seems long gone from Manhattan but lives with pride in this borough. I can't wait to try more. Thanks.", "author": "Ellen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "The fiancé planned a \"surprise\" birthday dinner here for me with my friends (11 people). They had a table set up for us that was still comfortable with someone sitting at the head of the table. \n\nI didn't know about their great bread plates that seem to consist of Italian bread (so fresh, soft and doughy with great crust texture), yummy focaccia bread with sauce on top (pizza focaccia?) and breadsticks. I definitely used up two plates of the olive oil myself and ate all the Italian bread slices and focaccia that i could tech.. Whatever, it was a dinner for me :) We also got a bottle of red wine, though I don't know which... But all Italian wine is good =D\n\nSo as for our entrees, we got multiples of the chicken parm (23.75), Pasta Nero Casalinga (27.75), Shrimp Fra Diavolo (27.50) and one of the appetizers with the very delicious fresh mozzarella. Everything was delicious! Even the bf really enjoyed his chicken parm and a good one for him is usually hard to find. \n\nWe didn't order any dessert or many appetizers because they had ice cream cake for me that we were bringing along to our next destination.\n\nThe staff was nice, food was yummy and came out hot and to the right people. If it wasn't so pricey, it would definitely be a place we'd frequent more often because like I said, it's hard to find a good chicken parm for the fiancé.\n\nI'd come back :)", "author": "Melissa N."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}