{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "We waited a little while for service, but the place was packed so I dont blame them for taking a little while. The veal parm was excellent, and the sauce used for the pasta was very good. I will be back, and recommend everyone to check this place out!", "author": "Yelp Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "Good service, friendly bartender, but didn't care for the lemon raisin cheesecake.  It was like a wet tasteless sponge that was inedible even after two drinks.", "author": "Morgan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "This place is the real deal! Our family loves loves loves it. We give it a hundred million stars. The food is off the hook!!", "author": "Michele M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Went to Queen after getting a recommendation from a friend. I was not disappointed. This is a no frills Italian restaurant. A lovely gentlemen greeted us at the door, we were seated at a small, but comfortable table. The waiters are all well dressed and wearing aprons, everyone working together like a well oiled machine. I had a house Rosso that was very nice. They brought an impressive array of bread and flatbread...I had to restrain myself. They have a very modest standing menu and this massive menu of special dishes that are changed every 5 days. I had a string bean and beat salad that was perfect and the eggplant parm. The portions are enormous!!  I had about a quarter of the entrée, very good dish and enough to feed you for the week. Everything they brought out of the kitchen looked delicious. I don't think you could go wrong with this place.", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "We went to this restaurant based on word of mouth and the good reviews it received here. \n\nOverall - Not a horrible Little Italy tourist trap restaurant, but also not the most delicious-from-heart of Italy food.  Great ambiance, service and desserts make it slightly above average.  Try their special dishes.  We went for more traditional italian fare (carbonara and alle vongole) and were somewhat disappointed.  However, we hear that that their specials are better and will go back to try them.  \n\nAmbiance - was great.  Felt very friendly and homey.  Especially because the host was a friendly old man who walked around with a smile.  Warning: if you don't like to sit close to people - you will sit close to people here.  We thought this added to friendly ambience because striking a conversation with your neighbor was very easy to do. Not a small place, but feels cozy.  \n\nService - was excellent.  Our waiter was very nice and engaged us in friendly conversation.  He was not helpful, however, when we asked him about recommendations.  \n\nFood - we did not go with the homemade specials.  Instead we chose the more typical italian restaurant fare.  She had the pasta alle vongole which was average.  Not bad but did not have the \"something extra\" that makes a dish outstanding.  And it was also not a disgusting Little Italy pasta dish.  He had the pasta carbonara based on a recommendation from the lady sitting next to us.  She said it was the best she's ever had.  It wasn't bad - but had better.  Again, lacked that something special.  \n\nDesserts - all desserts here are homemade and all seem absolutely delicious.  We went with the zabaglione and fresh berries.  The dessert is like nothing we'd have before  - absolutely delicious and we would definitely recommend.  \n\nCoffee - She had the cappuccino, he had the espresso.  Meh.  \n\nNotes - BIG servings for an average person so sharing is recommended.\n\n-Diego and María Paz", "author": "Diego-María Paz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Went here with my husband and his work bosses. . This place is absolutely divine! The ambiance, the servers, the little old Italian who checked on us a couple times during our dining. . \nEveryone enjoyed their meals. .from the appetizers to desserts. . Authentic Italian Cuisine!\nI will definitely be going back here!!", "author": "Tia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "Reason #44 to love Brooklyn- Queen Italian Restaurant\n\nWhen you find yourself standing in line at Popeyes puzzled over a three piece, two piece, spicy or mild and are really horrified that this is how you are going to spend Saturday night dinner, do yourself a favor and just get out of line. You can walk two doors down and have a perfectly decent, if not pleasantly surprised best meal of your life at Queen.\n\nIf you are wondering about Queen, it is Zagat rated and a popular spot for family reunions, birthdays, and baby showers. The space is actually large and no matter how many parties are going on, you will still be able to get a table without a reservation. The service is very good and even if you don't go the traditional route, you will still be treated like nonna's favorite grandchild. \n\nOne thing that should be mentioned about Queen before anything else is that they have an impressive bread basket. I immediately forgot about biscuits drenched in butter and honey and reminisced about the brunch bread basket at Bar Americain. The Queen bread basket had 5 different types of bread from focaccia to crackers and breadsticks. We ate the bread in the beginning and continued eating it throughout our meal. It was too good to be just an appetizer.\n\nI wasn't too hungry for a whole entree (hence a two or three piece dilemma) so I shared a bunch of mini plates for dinner. Queen changes their menu from time to time so if you see something that looks seasonably good, try it then and there. The figs wrapped in prosciutto drizzled in honey on top of ricotta cheese sealed the deal for me. Queen knows how to cook even when the food doesn't require cooking. The figs were gigantic as well. Our choice greens were arugula and apples with walnuts and a marscapone dressing. The dressing was thinned out and was the right balance to not overpower the fruit or drench the lettuce. The gnocchi tricolore rounded out my Italian tapas well. The ruby, green, and yellow-orange dumplings did not yield beet, spinach, or squash flavors but they were perfectly shaped and not overcooked. They also tasted great with the cream sauce. All of these dishes, although appetizers, were perfect for sharing and made for an excellent meal. If you prefer to go for the Hungry Man mega meal, the chicken parm is giant and with pasta. The breading is nice, the sauce is sweet, the chicken succulent and it does have that melty cheese. The chicken parm at Queen reminds you why Italian is always a safe and delicious bet.\n\nWe couldn't leave without dessert so we shared the warm chocolate tort with vanilla gelato and raspberry sauce. It's a pretty artful plate and very very rich. Share it! The Hungry Man chose a chocolate covered cannoli (1 giant one as opposed to three miniature cannoli). He didn't share. It wasn't a sign of selfishness. He just wanted it all to himself because he thought it was that good and we had our own dessert plate. I got to taste a little of the filling and honestly that was enough to let me know that the cannoli was better than the tort. I even heard the shell crunch... I wasn't envious at all. I just have really good hearing and am observant.\n\nSo the next time you have a hard time deciding whether you want mac n cheese, mashed potatoes or wannabe dirty rice, just think about how you can be eating raviolis, saltimbocca, and pasta to your hearts content instead. Step out of line, leave Popeyes, and go next door. Queen is your answer.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "If you just want a good meal I would suggest going here..its not a romatic jaw dropping restaurant and the location is right on the main street of Court Street very busy.. Its more of a quick lunch or quick dinner..NO Ambiance..at all.. they should try giving it a facelift. The food is pretty decent. I would recommend.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "We just happened to try this place because we were looking for an Italian place near where we were staying when visiting friends and were concerned some of the trendier places might be too packed. We also saw they had a price fix menu that was an amazing deal, coupled with the reviews it was a good option and we are SO glad we did. \n\nDon't let the sketchy exterior scare you off the restaurant is beautiful and clean. We go there in time for the price fix menu about 6:15p but did not see it on the menu, we asked the waiter and he called to the host who I assume is also the owner, to bring it to us and walked away. The service was sketchy honestly, the waiter was not friendly and they repeatedly could not get whose food was whose correctly. \n\nHowever, the food MORE than made up for that, the food was in a word AWESOME beautifully plated and just plain delicious.  I started with the Homemade Mozzarella Alla Caprese--OMG, fresh Mozzarella is amazing, creamy, salty, slightly warm. Delightful, I would go there for that salad alone. It was truly amazing. Others spoke highly of the Arugula salad and the string beans. Next, I ordered the Spaghettini With Shrimp Sauce, also yummy, nice big shrimp a nice well balance tomato sauce. It needed a touch of salt but other than that very yummy. Others also were equally satisfied with their veal, sole and risotto. I tasted both the veal and the risotto and both were delicious. Lastly for dessert I had the Chocolate Tortino, it was like a flourless chocolate cake, it was good too not as amazing as the rest of the meal but the gelato was great. \n\nOverall, food was awesome and we would definitely go back. If they tweak their service problems they will definitely be a 5 star worthy restaurant!", "author": "Rebekah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Old school Italian that never lets you down. Great wait staff and large tasty portions. A lunchtime staple around the courts.", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "Fantastic little Italian restaurant. \n\nI came here last night while in town for a conference. I got the recommendation from the doorman at my hotel and have to say that he was spot on. The fresh mozzarella was so good and I also enjoyed my scallops immensely. Would definitely go again!", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Consistent and reliable quality Italian restaurant - quiet/discreet place - an oasis in a sea of transient activity (Court. St.) The only negatives I have about the place is their foods are extremely rich (oil and butter laden) and the service varies depending on factors I have yet to determine.  The portions are good and the menu is quite varied and high in quality.", "author": "Carl E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-08", "description": "We were very disappointed. My husband and I had the salmon oreganata. It was simply not good. It didn't flake. It was mushy. It was chewy. It seemed like it was something that had been reconstituted, mixed with bread, or something. I would stay away from it. It is easy to cook great salmon. We do it all the time. We didn't complain to the other guests, nor they to us. I can't recommend that you go there, but it is my impression that you should stay away fresh fish and eat the meats and pasta.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "This place is GREAT!  Family run for generations.  It is an institution on Court Street.  They have respect for the old ways.  They don't chince.  They use the best ingredients and make everything so fresh.  The bread basket has to be one of NY's best and that's before they come over and give you the warm cheesy dough balls! \n\nI have been going here for so many years and I look forward to so many more.", "author": "Just S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "Great restaurant. \n\nI Was referred to the Queen by a friend knowing that I am a vegetarian. Surprisingly the Queen has many vegetarian options which are to die for. The mozzarella is the best I have ever had and the eggplant parm is equally as good. The sauce is  also just out of this world! \n\nThe wait staff is excellent and it is a family run restaurant which adds that extra little something to the experience and the food. \n\nI have been there twice now and both times had a magnificent meal. \n\nI will be back!\n\nOh and make sure you order a salad their lemon dressing is AMAZING!", "author": "Alfred V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "I came to treat myself after completing my yearly \"tax torture\", wanting to try the offerings in the area of my accountant's office.  Hell, I'd just shed my shackles from the foot roasting on the Judas Cradle (self-imposed!); I deserved a good meal and I didn't care if it WAS pricey.  Besides, I'd just found out I'm getting a fat refund.  There seemed to be a consensus on Chowhound that Queen Restaurant is one of the best offerings in the Court Street - Brooklyn Heights area, so I had to try. \n\nUnassuming from the outside with it's diner-like dated exterior, it turns out to be an elegant tablecloth restaurant inside, retaining it's 1990s decor and serving up Old-School Italian fare (first opened in 1958 at a different location).  All made with very fresh and fine ingredients.\n\nI started with the Acciughe Con Mozzarella.  This was seriously some of the best and creamiest fresh mozzarella I've had, short of the burrata type, and I used to live in The Italian parts of LIC and Hackensack, NJ (shhhh)  at different times, near the best fresh mozzarella makers in both places.\n\nThe presentation was beautiful, with the little mound of mozzarella in the center and wedges of tomato inserted into slices in the top.  The anchovies were scrolled around the sides of the mozzarella, and were plump and very fresh.  The marinade was delicious with a taste of olive a bit of tangyness to it.  You could taste a bit of basil weaving through this dish.\n\nI next ordered the Funghi \"Alla Brace\" Con Polenta.  This dish was out of this world; a large, soft disc of polenta topped with a delicate amount of melted goat cheese, a *touch* of pesto but not so much as to overpower the dish, and piled with a Lincoln Log stack of wild, rustic, woodsy grilled mushrooms, which were surprisingly fat and HUGE.  Meaty and very tasty, too!  I had to restrain myself from finishing the whole thing in order to preserve my diet.  (my new thing is saving half for later, so I can try more dishes without going off my weight-loss mission)\n\nThe service was stellar and very attentive.  It was full-service with different servers for different purposes.  The waiter seemed genuinely pleased when I told him how amazing the meal was.\n\nI'd really like to come sometime with friends for a full dinner.\n\nThis meal was so good, I'd long forgotten the rope burn from the medieval rack I'd endured just an hour before.", "author": "Katie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "This star is simply about the food - it just wasn't good. The service was excellent, the waiters and especially, the maitre de were so attentive and couldn't have been kinder. The food - my guy got the lasagna and I got the chicken florentine - was just awful. The meat in the lasagna tasted boiled and fatty and my chicken was just okay - for the price you can literally go just about anywhere in the neighborhood for better food.", "author": "Rosie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "Queen Italian Restaurant is an institution in Brooklyn, serving tasty Italian food since 1958.  I'm ashamed to admit that I'm a little late to the game, having recently eaten here after walking by countless times...  But better late than never, right?!  Classy place, great food, excellent service, and an archetypal NYC-Italian vibe...  Love it!", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "The regular menu when it's not Mother's Day is ok! Mother's Day menu was a big disappointment. Food was boring.... I felt like I was in a food mill. There was a Special Mother's Day menu not so good.... The dessert brownie was the be a part of the meal.... Sorry I can't recommend the restaurant and I will never return again...", "author": "Fermin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "We had a terrific time here the other night. The spinach gnocchi was out of this world. Yes, as others have mentioned, the decor could use some sprucing up, but I wasn't eating the wall sconces. The food is terrific, the service was great. We'll absolutely be back.", "author": "Deirdre B."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}