{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "When I worked in the area I used to have lunch there every payday.Many times I have had dinner there as well,as well as office group lunch or dinner.\nMy favorite dish is the Shrimp Florentine with a side of spaghetti.\nAfter getting married I brought my wife here for an Anniversary Dinner she also loved the food,service and decor.\nNow we make it a point to come back every year.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "Not a huge Italian fan, but Queens is amazing. From the service, to the food, and ambiance - you will surely have a good time.\n\nI stopped by for lunch, and it wasn't busy at all. I was seated immediately. I ordered Prosecco, and shrimp in a white wine sauce. So, let's talk about the shrimp with pasta. Absolutely decadent and rich! I wanted to hit the gym after - that's how you feel after eating this savory dish. The shrimp were huge and fried/baked with eggs. Now, that doesn't sound like a great combination, but it was executed well. The sauce was buttery, and did I mention rich? Definitely count this as a \"cheat meal\" if you're on a strict diet.\n\nService could have been better. I would have appreciated if the waiter stopped by a little more to ask if I was pleased with my meal. That aside, Queens is top notch - I would visit again!", "author": "TaNeisha J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-15", "description": "Valentine's day Hustle:\n\nI came expecting large portions for a somewhat reasonable price. I instead got a prix fixe menu \"special for Valentine's\" offering smaller than normal portions at much higher prices than usual. Their usual prix fixe is $32. So loving of them to increase this to $70 for the holiday. Maybe their usual menu is fair, but this was a rip off, and given their reputation of generous portions, I'd say a bait and switch. The food was generally tasty, but not outstanding or anything I'd be tempted to order again.\n\nMaybe on a normal day this place is reasonable, but if I walk in and all they hand me is a Price Fixed menu and no other options, I'm walking out!", "author": "Jay J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-23", "description": "Delicious proper Italian restaurant in NYC. The menu is definitely a bit overwhelming at first, but the food is spectacular and well worth it. More on the pricier end, but a great spot for a celebration dinner.", "author": "Paula B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "The best old school Italian restaurant in Brooklyn! I come here for my birthday every year just to hear them sing in thick Italian accents!! The food is phenomenal and just like in Italy. The chicken Parm is out of this world. Come here ready to unbutton your pants.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "This is one of the best Italian restaurants nearby that I have liked the most so far.\n\nWhen I was looking for an Italian restaurant, I saw the reviews and I decided to give it a try even when I thought it was overrated. I was wrong!\n\nWe got there and everyone was dressed very formal. We were casual and wearing sneakers but there were no problems about it and we got seated and treated nicely.\n\nThe menu has a lot of options to pick from. \nTo start, they give you a complementary plate of bread sticks, different types of bread and mini pizzas that are quite flavorful.\n\nWe ordered the mozzarella caprese to start, and pasta. Because we were craving a good basil tomato sauce with pasta and that's how we found this place.\n\nBoth sauces the marinara and Alla matricciana, were very good. Exactly what we were looking for. The portions are big, but we finished them all.\n\nThe desserts were so tasty and the portions were great for the fact hat we were already full and were able to finished them as well.\n\nThe place is very clean and cozy. Staff is friendly and nice. Music is so on point. The ambience I would say it's kind of romantic, but it suits for any occasion. \n\nI would definitely add this place to my favorites and come back with friends and family or when craving juicy pasta.\n\nA Must go!!", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "We arrived without a reservation on Sunday afternoon and they fit us in. We chose the prix fixe menu. Had the arugula salad, filet of sole and this super yummy chocolate cake. Everything was delicious and great service as well!", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "This is an old-school, white tablecloth spot for classic Italian food.  It also seems to be a great place to bring your family or celebrate a birthday, as many of our fellow diners were doing. \nBoyfriend and I lived in the area for years but didn't make it here until last Saturday. Service was very good, and we were seated immediately around 8:30 pm with no reservations.  Or, more accurately, we waited approximately one minute for a table, after which the sweet angel of a waiter apologized for the wait. \nThe meal started with a plate of bread that was delicious and fresh - Italian bread with thyme oil for dipping and a saucy focaccia were gone in about four seconds.  For our meal, we got veal parm, and a sole special with tomato, olive and shallot.  We were satisfied, and we will be back for sure!", "author": "Ann D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-09", "description": "The ambiance was great but I was not such a big fan of what I ordered. I had a seafood plate cannot remember the name and a side pasta. The workers were extremely nice, but I probably would dine here again. It just wasn't what my palette expected. I want authentic Italian I feel like I got USA Italian. Not the best but not the worst.", "author": "UpTop Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "Great service. Prefixe menu for the budget conscious. A little more seasoning would be great. Otherwise a wonderful ambience and meal.", "author": "Juice F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "As I descend further and further into old age, I find that my memory isn't what it used to be.* But maybe, Queen isn't what it used to be either. \n\nI remember it being the finest Italian meal you could have in Brooklyn, a special night out with food that is equal parts comfort and quality. I recall an abundance of old world charm, from the tiny Italian gentleman who hands you your menu to the massive men eating alongside you, who seem to have been doing it nonstop for decades.\n\nThe charm is still there but unfortunately, the last couple visits have taken some of the shine off the food for me. More and more, it seems a little more like a merely solid Italian spot sandwiched between a McDonald's and a Chase Bank, coasting on what was a well-deserved reputation. \n\nTo be sure, there are still flashes of brilliance. The bread basket is as wonderful as ever, the Cavolo Nero salad is an absolute favorite (kale, raisins, almonds and more with that stunning pecorino romano dressing), and no one is ever really sad about any of the gnocchi or chicken parmigiana. \n\nBut the Saltimbocca only made a half-hearted attempt to jump in my mouth, and no longer is every item on the daily special menu (nearly double the length of the regular menu) a certain winner. I recently rocked the fettuccini casalinga with a sauce of pancetta and duck confit, and somehow the flavor was just...lacking. To be sure, it wasn't BAD, but even at $28, it wasn't very good either. And that's unacceptable. This is either on par or a HIGHER price point than some of the finest pastas in the city,** and it doesn't quite measure up. \n\nI still have love for Queen, but unless they've had a few off nights that just happen to coincide with my visits, it's no longer my go-to for an extravagant Italian meal. Quite simply, I can't afford to drop this much cash on dinner unless it's truly spectacular.  \n\nAlso, someone spelled Broccoli Di Rabe as Broccoli Di Rape on the specials menu, and in light of all this Harvey Weinstein nonsense, I find it to be quite insensitive. \n_____________\n\n*Blame it on the alcohol. And by that I mean the four hour bar crawl we went on prior to the visit before this most recent one.\n**Lilia, Battersby, Barano, Scarpetta...", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "The food is absolutely fantastic! Great quality and generous portion sizes. Slightly pricey but not overpriced. I had shrimp scampi, sauteed broccoli and peach bellini  . \nBella Mangia!", "author": "Meiko H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Always a warm welcome by the host Frank.  You feel like your walking into your uncles home... that is if your Italian like me and have some Mexican in-laws. So the mozzarella they make fresh on premises is never a disappointment, the ravioli have to be ordered usually and the fried shrimp are delicious(never an iodine taste.)", "author": "Maria C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-11", "description": "Filet of sole rolled in plain breadcrumbs and totally over-cooked. Awful mess on my plate. First measure of any expensive restaurant is their mastery of fish. Queen failed on that score and went downhill from there. This place used to do it right, but now it's nothing more than a clip-joint for Brooklyn pols to hobnob. Stay with the breadsticks, or get a Big Mac next door.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Just incredible old-school Italian food experience. Don't be fooled by the curb appeal, it's a lovely restaurant on the inside with professional and courteous staff. The bread is delicious and the dishes are fantastic. It's HEAVY FOOD usually paired with red wine so be ready to need a long walk or sleep after!", "author": "Carrie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "My brother and I decided we wanted to stop by after the movies that's nearby and I'm glad we did. they accommodated us 2 considering the place wasn't that packed. \nThe bread for the table was topped with some type of marinara sauce that was delish. \nWe ordered beef for our main, he the filet and I the steak. Mine came out Medium-med rare and his came out medium. OMG the sauce was fantastic, we added a bit more salt but that was all that was needed. I literally can envision myself eating their steak every weekend.\nFor dessert I went with the vanilla bean gelato w espresso and the works and he went w the sorbet (that wasn't his fav). Him and I indulged in that gelato, man and that ended our meal so perfectly. \nWill be back.", "author": "Toya H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Great food, service, and atmosphere. Not a long wait to be seated. Wait staff was both friendly and attentive. Our server offered suggestions. We had the pasta y fagioli, carbonara, and gnocchi with veal. The portions are large. We took home most of the carbonara and we left no room for dessert.\n\nI recommend this place.", "author": "Frank T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "After attending a function at Brooklyn Law school, my family and friends had dinner the Queen Restaurant.  We  had reservations and were seated on time.  The service was prompt and friendly.   Everyone's food was A++,  literally cooked and prepared to perfection.  Great job folks, look forward to going to The Queen next time I'm in Brooklyn.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "This is my go-to restaurant for family occasions, birthdays, and special dinners. When I dine with my friends, they often ask \"is it ok if we go to the Queen?\" The answer is always YES. \n\nThe starters are delicious.  The mozzarella fatta in casa is a definite, every single time I go, and the octopus is also super fresh--not that chewy rubbery stuff that you get at other restaurants. And the tuna-flavored toast is also delightful--but that's a seasonal speciality. \n\nThe food is spectacular. I regularly order the chicken parm and the chicken francese, and both are delicious.  Their specials aren't to be missed, however; the pork scaloppine with hot peppers is to die for. If you're a seafood fan, the salmon and the sole are both superb. \n\nThe wine is also phenomenal--just ask Frank to recommend a bottle, and you can't go wrong. He's forgotten more about wine than most people have ever learned.  \n\nThe desserts...  Beyond delicious. Specifically, the torta di ciocolatta and the zabaglione are always my agonizing dilemma. \n\nThe ambience is warm and welcoming, the service is excellent.  See if they're serving the fried dough, its a unique treat and super tasty. Go. Eat. Enjoy. Try not to get drunk, but no one will judge you if you do. Trust me.", "author": "Laura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "I visited Queen for the second time when I returned to Brooklyn on business. I can actually say that is the very best Italian Restaurant I have ever been to in my life. The food, service and atmosphere offered the best of all worlds. I will make certain to return and plan to bring my wife next time to enjoy such a great experience.", "author": "Gibb S."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}