{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "I am writing this review about 5 months after I went there for dinner.  I can't remember what exactly I ordered.  But I remember it was something not that good.  I know it was rather expensive (dinner for 2 was around $75).\nIf you want to spend $75 on dinner for two, go somewhere else.  This place was loud and food was boring, uninteresting.  Something I can easily order from diner for much, much less.", "author": "H L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I had a chance to go here after a recommendation from my friends parents and they were right - the food was amazing - the homemade mozzarella was so soft and the squid ink linguini was superb.", "author": "Clara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Food is above average. My pasta was not al dente and still had water. The only Italian on the staff is the octagenarian owner who is friendly.  Enjoyed the broccoli rabe with sausage and the stuffed artichoke. Deserts are exquisite.", "author": "Lou V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "I just had a student worker appreciation lunch at Queen. Their service is amazing, the restaurant is pretty and the bread plate has some delicious marinara bread among other really good breads. I went for the prie fixe menu and for the first course, I  had the baby string beans, roasted beets and Gorgonzola. While I'm not a big fan of Gorgonzola in general, the roasted beets tasted especially nice. Has Dwight Schrute influenced my feelings towards beets? Maybe. But I digress. \nThe second course was Penne with garlic, oil and Broccoli florets. After a generous sprinkling of Parmesan and pepper, the dish is decent but has full pieces of garlic and was a little watery for my taste. \nYou'd wonder why have I given this place four stars- and I got one word for you- Dessert. \nThe delectable Chocolate Tortino stole the show and my heart. The vanilla ice cream was like velvet, the raspberry sauce sweet and tart and the Tortini itself was like biting into heaven. Needless to say, it was the table turner for an okay meal. I'd go again just for killing my diet with desserts.", "author": "Abhilasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "The food here is great. Traditional Italian classics perfectly made. It doesn't get anymore authentic than this.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "During restaurant week, it has been impossible to catch a reservation, however walked in on a tuesday, for lunch with my better half. She had stuffed ravioli I had chicken parmigian, oh wow mouth watering no complains, excited to eat at the establishment again..\nService was not 2 crazy about the waiter stood by our table holding a whole conversation, with another staff member.", "author": "Maritzabel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "I would come here just for their bread plate, honestly...\n\nI visited Queen specifically to try their prix-fixe menu special and boy was it WORTH IT! \n\nTried: bread plate (comes with your meal but still the best bread plate in my life maybe), minestrone (OMG), arugula salad (OK), raviolette with chicken and eggplant (YUM, and I don't even like eggplant), pork scaloppine (silence, because my bf wouldn't talk to me while he was eating because it was that good), and finally ricotta cheesecake + choc tortino. Desserts left something to be desired, but the meal as a whole was delicious.\n\n....AND THEY DELIVER!", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Was very pleased with this establishment! Decided to try this place after always bypassing it on Yelp! Glad that we did. The atmosphere was welcoming and overall yielded a good vibe. We started with artichoke. I'm a sucker for a good artichoke and was happy that it was on the menu. It featured roasted garlic cloves, capers, and anchovies. Simple but amazingly delicious. Gnocchi with braised veal and baby eggplant.... superb. Nero D'Avola was a good wine choice by the glass! Michael, our server was great, accommodating, and super sweet!", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "When we walked into this restaurant, I was really excited. I love old school Italian restaurants and had heard so much about this place. We were greeted by a humorous old midget Italian guy who told us it would be about twenty minutes, so we grabbed a drink at the bar while looking over the menu. Things looked promising - many classic Italian dishes on the menu. I was very excited about the vitello tonnato, as it's one of my favorite dishes that I've made many times from scratch during summers spent in Provence. We ordered it as an appetizer, along with fried zucchini. They told us just before our orders arrived that the tonnato sauce wasn't in stock and that they had made a lemon glaze in its place. I was disappointed but said OK, figuring they knew what they were doing. But no - it was horrible. The veal was sliced beautifully and paper thin, but the makeshift sauce was too tart and didn't blend well with the veal. The dish is generally made at least a day in advance to allow the veal, tuna, lemon and capers to meld properly. This was a crime against everything that dish should be. It was made haphazardly moments before and they should not have served this to anyone. They should have paid me to eat it, or even look at it. This place has been in business since the 1950s and has had plenty of time to know better. Inexcusable. This is a classic, beautiful dish. Whoever from the restaurant is reading this should get with the program and call a house meeting on this issue alone - vitello tonnato is a sacred Italian specialty dish!!! This was a travesty on my plate. Shame. Shame on you all for presenting this!!\n\nThe zucchini fries were crisp but should have had something else with them - a spicy tomato dipping sauce would have been appropriate. \n\nNext was my main course - eggplant Parmesan. Everything about this was incorrect and Marcella Shazan would have shit a brick upon just seeing it. It was a slimy blob on my plate -- too much cheese by a long shot. This is a sloppy, fat American version of eggplant parm. Shame on you all for serving this. The eggplant should be crispy, particularly at your prices. The sauce should have a kick and a zest that melds with the cheese and eggplant to form a perfect explosion of taste in your mouth. Your eggplant was slimy -- there should be no slime involved. This is a classic dish. An important dish. It shouldn't be a heavy bomb of cheese, slime and tasteless sauce. It should be MAGICAL. There is no excuse for this. None. \n\nNext was the other guest's main course, the chicken and sausage scarpariello. The meat was ok -- not tender enough but passable for a cheap American Italian. Unfortunately, you aren't cheap, so it's much less passable. The sauce was runny and there was far too much balsamic. It should have been thickened and a bit less acidic. This dish was the most passable of the lot, but still only a C grade at most.\n\nBut here is where you completely lost me. Sitting next to us were two very attractive young men. One in a t-shirt and shorts and the other in a tank top and shorts. Many other women were wearing tank tops and shorts in the restaurant, and yet you singled them out and told them to leave because of the one man's shirt. If the food wasn't far below average, I would have let it slide, but you cannot afford to lose customers, particularly beautiful ones who add to your otherwise middle aged to elderly and overweight scene. They were willing to pay for your mediocre food, and yet you kicked them out despite the fact that frumpy ladies next to them wore the exact same outfits and were left to enjoy their large portions of mediocrity. You need to adjust something - either fix your dress code to allow for both sexes to be treated equally, or adjust your menu to reflect a cuisine that was so top notch that it would give you leeway to behave like assholes. Either way, your restaurant needs beautiful people in it. This is 2016 Brooklyn, not 1958. Fix your food and get with the fucking program.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Came here before RNR Brooklyn to carb up. I am normally vegetarian the night before the race, so I didn't try the chicken parm (though I really wanted to!!!)\n\nWe had a reservation, but still had to wait about 10 minutes past our time. The Sicilian owner is such a charmer!\n\nWe were seated at a comfortable table. The décor is a bit dated, but that wasn't why we were there.\n\nThe bread plate was fantastic and better than most! The one with the sauce was delish!\n\nI had the pasta with the tomato eggplant sauce, which was delicious. Some eggplant dishes can be overpowering, but this wasn't at all, and was well balanced with the tomato, garlic and other ingredients in the sauce. I love that you can pick your cut of pasta (I opted for capellini).\n\nA little expensive for what it is, but the food was good and I enjoyed my experience.\n\nSkipped dessert (though I love a good cannoli). The charming owner made sure to stop us on our way out and thank us for our visit!", "author": "Briana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "We found Queen when we were out walking and decided to try it for Dinner the next day. We made reservations and were glad that we did because it was crowded. The owner led us to our table and came back a few minutes later with menus and wine list. A server brought a plate of assorted breads and a most excellent olive oil for dipping. We ordered a nice bottle of Tuscan Red wine and would have been happy if it ended there!! But of course it didn't! We decided to forego appetizers to save room for dessert. We both ordered veal parmigiana with a side of penne. Enjoyed it immensely! For dessert, my husband chose the ricotta cheesecake (excellent) and I had Nutella gelato with fresh berries (also excellent). The owner came over to our table several times and our server was very good! We'd go back the next time in Brooklyn.", "author": "Mary Ann U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "If you don't think Queen is great you don't know old school Italian food ( and watching the food network doesn't count ) this place has top notch food. Everything from the bread to dessert is amazing. The staff here is very accommodating and friendly. I'm glad to have this restaurant in the neighborhood. When I go I try something new each time. For appetizers the scallops are like butter. For entrees the pasta, fish and veal are all tender and will not disappoint. Whatever you order get the potato croquettes", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I LOVE THIS PLACE. The staff are friendly, ambience is perfect, and the food is fantastic. The service is fast too! The breaded clams are my favorite!", "author": "A S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "I traveled to Brooklyn to try this italian place. First off if you value service this place is not going to be a good option as they don't provide any. The food itself is great though. I had the spicy shrimp pasta and the gluten free clam pasta. The shrimp was very juicy and fresh and the clam sauce was delicious. The clam could have been more fresh.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Good food but horrific customer service. They tried to split our reservation for a party of 15 into two separate tables. The dinner was for a very special family occasion with relatives who traveled from near and far. We explained that we had a reservation for 15 people for many weeks and not two reservations for tables of 8. The manager argued with us as if we were in the wrong. Additionally, they jacked up the negotiated price per person on a whim. I have never experienced such deception from a restaurant in my life. What a horrible way to treat customers", "author": "Lynn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "We visited this restaurant on the recommendation of a friend and we enjoyed it very much.  The atmosphere was very nice (you'd never know it from looking at the outside), the food is delicious, and the servers are very friendly.   I ordered the Pre-Fix menu and had Mozzarella Caprese, followed by Gnocci with Veal and Pea sauce, and topped off with a chocolate torte.  Delicious!\n\nI'd have given them 5 stars, but my wife loves lasagna and at 5pm they were already out.  So on a Friday, if you visit and want lunch, get there early enough for the lasagna!  \n\nEnjoy!!", "author": "David I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "They are an amazing restaurant. Threw a birthday party here and they were nothing but PERFECT. From the moment I spoke to them on the phone, all the way to the event and till the end of the party, they were amazing. I highly recommend this place!  The food was amazing too! A WONDERFUL place to go and enjoy a nice evening out or have them cater your next event!", "author": "Joy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Overall I was very impressed with this spot. Authentic Sicilian food in your old school atmosphere, with old school service to boot. (You want to fold my napkin for me? Pull out my chair? Sure..any day!)\n\nThey still give bread before the meal and some good foccaccia with the mandatory olive oil. \n\nI caught the prixe fix deal which is totally worth it if you can swing in for an early bird special because its under $30 for 3 courses (Hey, I am a little old lady at heart!) I had a great beet salad, but I enjoyed the Caprese moreso because the mozzarella was really fresh. \n\nI had the veal with eggplant, it had fontina on it, but really just tasted like parmigiana, which was fine with me. Thinly pounded veal and a quality red sauce, which I have only found at a handful of places (snooty Italian, I know!). \n\nDessert was great, everyone I was with was jealous of my Tortino and regretted not ordering it. I'll admit, its confusing-Tartufo, Tortoni...but this one is basically a warm brownie with ice cream on the side , drizzled with raspberry sauce. It was the perfect sweet ending to a very satisfying meal.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "6 of us plus a child of 8 dropped in after the Brooklyn Book fest. We all had variations of pasta which was excellent. My 3* is due to the poor service and ridiculous wait time. \n\nWon't go back", "author": "Sokari E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Queen is a Brooklyn institution which is relatively unknown to the New Brooklyn Gentrifiers. I wonder why this is so? Certainly not because of the food, which is superb. All of the breads, pastas, sauces and desserts  are homemade and delicious. Their steaks and veal and seafood are expertly sourced. Certainly not due to the service which is absolutely professional and pleasant. Certainly not due to the price which is not cheap but offers extraordinary value. The Prix Fixe, offered SEVEN DAYS at Queen is certainly the best deal in Brooklyn, perhaps the best deal in The City.  Certainly not due to the location, which for years has made it the Go To for the Judges, Attornies and Court Staff who work nearby or its proximity to The Heights, Carroll Gardens, Cobble and Boerum Hill. No, the reason the New Brooklynites ignore the place is due to the decor! Yes, although the place dates back 60 years, it's most recent renovation was likely in the late 80s and the place does have that Miami Vice look which just isn't gonna cut it for the New Brooklyn \"aesthetes\" who tend to only frequent places where the \"look is right\" and the owners and customers all look just like them. Y'all need  to get over to Queen pronto before New York's old school Genuine Italian American standouts \nall disappear.", "author": "Antoine L."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}