{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "My husband and I had dinner at Queen Italian for our wedding anniversary, an amazing dinner it was! I had the Lasagna which was A+ my hubby had chicken parm which was A+!! EVERYTHING is delicious - thank you Vincent!! Des \u0026 Pat", "author": "Dez K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "This is an undiscovered gem of a restaurant!\nThe food is divine.", "author": "Bruce F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "Brought my boyfriend there for his birthday. The inside surprised me because from the outside it doesn't seem like it would be so nice. When I walked inside it felt like I was in another place. It is so beautiful. The staff is so nice and patient. Definitely a keeper. Try the sparking wine and the cheese cake. Its so fluffy. ;-)", "author": "Seraphim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "This place is amazing.  I walked across the Brooklyn Bridge, which was an amazing experience in and of itself, and then I went to The Queen for dinner with locals from Suffolk who come here every time they're in Brooklyn.  The service was fantastic and that for me is key.\n\nWe started with the fresh, homemade mozzarella which is the best mozzerella I've had in my life.  I then ordered the gnocchi alla norma (eggplant marinara sauce) which was excellent.  I was already full after trying 4 of the 6 different breads that were brought to the table - all 4 were great.  But I still cleaned my plate.  We finished with an Italian cheesecake and vanilla gelato, both of which were homemade, unique, creamy and delicious.  The food was better than I expected, the portions generous, the flavors satisfying and the preparation uniquely Italian.  \n\nI would definitely come back here and would highly recommend it to anybody.  A perfect way to end my trip to New York.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "I grew up going to this place. Not only is it the staple for all family celebrations, but it's the best Italian food I've had in the city.\n\nThey always start you off with a selection of homemade breads, and if you're lucky they bring out freshly fried pieces of dough rolled in freshly grated Parmesan. The wine list is decent, with a range across the Mediterranean region. I've never had a bad meal there, but some of my absolute favorites are:\n\nAsparagus with cheese and butter\nMozzarella Fatta In Casa\nBaked Clams Oreganata\nBocconcini Di Parma Casalinga\nGamberi Al Vermouth\nChicken Scarpariello with sausage\nZabaglione with fresh berries\nChocolate ravioli\n\nPart of the allure most definitely comes from the dark cozy atmosphere and FOB Italian servers. Frankie, the little Maitre d', usually makes every birthday celebration worthwile with his timeless rendition of the \"happy-you-a-birthday\" song. He could be a tenor if he didn't love working the downtown Brooklyn crowd so much. The Queen is a real throwback to how the area used to be, the fact that it has outlasted all of the other Italian restaurants (save Sammy's and Marco's) is a testament to its greatness. Check it out if you happen to venture into \"Manhattan's bedroom\".", "author": "Wally W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "okay. tucked into a non-descript building sandwiched between a mcdonald's and a starbucks in downtown brooklyn is this delightful little restaurant.\n\ni went there with my family not really knowing if it was any good, just looking for a something quiet and not too trendy for my mother and grandmother to enjoy a pleasant dinner out in my neighborhood while they were visiting the big bad apple. imagine my surprise when the waiter literally had to tear the plate out of my hands because i was licking the dish so hard i was reshaping it like so many years of running water on a stone ~ it was that good. i kid you not.\n\nthe restaurant isn't fancy in design or large in seating. the bar? tiny but serviceable but you don't go there for the bar, design or the room, you go there for the food. i had the carbonara. it was a delight. creamy sauce, crispy bacony pancetta bits and pasta so perfect the chef must throw it against the wall in the kitchen to see if it sticks. and boy did it stick. as in landing? the glass of wine was healthy in a glass half-full kinda' way. i wasn't really going there for the wine but i did enjoy it. the menu is traditional italian family. in other words, it has all the staples but doesn't explain what those staples are. like tony soprano ordering something \"to the back of the head\" ~ you don't have to ask because you already know what it is.\n\nboth my mother and grandmother enjoyed their dinners. i wish i could recall what they had but i can tell what they didn't have...a doggy bag.  yes. that good.\n\none day i will return to this queen italian restaurant but it's much deserving of an event despite it's humble trappings. never judge a book by it's cover and never judge an eatery by the walls that house it!\n\nenjoy!", "author": "Brian Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "It's really just ok. I've been a few times and it's fine. Average, and nothing special and overpriced. I was there for lunch last week and ordered the fish, it was obviously frozen and I just don't understand why the place is priced like a Manhattan restaurant when it is in a neighborhood where you would never go to as a destination and there is nothng about the food that makes stand out.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "This is one of the first restaurants that I visited when I moved to Brooklyn Heights. A friend of mine had gotten me a gift certificate here as a moving present which I was looking forward to using. \n\nThe first thing that I will note is how incredibly friendly the staff is here. They treated me as if I had been going there for years and made me feel at home which was really nice given I had just moved from the Midwest and was still trying to get a feel for my new neighborhood.\n\nI went here with a group of four and everyone loved their meals. I personally had the Alla Bolognese which is one of the simpler menu items, but it was absolutely delicious-would definitely recommend. The wine was great as well, which in my opinion is key to a good Italian restaurant. \n\nI would come here more often, however, its pretty pricey (especially without the gift certificate). I wish that I could be a regular here, but it is definitely more of a special occasion place for me.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "My go to place for great Italian food.  Consistently great.  The decor may not be fit for a Queen but the food certainly is!", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I have probably walked by Queen about five hundred times in my life but never even gave it a second glance. Truthfully, it's somewhat downscale exterior belies the superb restaurant within. My father invited me for a last-minute dinner here on a recent Tuesday night and I have to say I was mostly impressed from start to finish. \n\nThe restaurant itself is pretty average-looking as Italian restaurants in Brooklyn go, but the food and service are high above average. Upon being seated, we were offered a mixed basket of interesting breads and focaccia. I was pleasantly surprised at their creative and varied menu as one typically expects Italian restaurants to offer lots of red sauced, cheese-laden foods. This is certainly not the case at Queen. I started my meal a salad of arugula, grilled peaches and gorgonzola (with balsamic dressing), and it was a light, fresh start. My main was their chicken and peas dish which presented two large, lightly fried boneless chicken breasts in a buttery sauce mixed with Italian-style peas (I call them Italian-style because they're kind of a soft, creamy rendition which I see often at Italian food stores and such). Another pleasant surprise was the dessert course, where I ordered delicious almond-stuffed dates, sautéed in red wine and served with mascarpone. \n\nOverall, the thoughtful and fresh cuisine, paired with large portions and an elegant presentation made this a real winner in my book. Service was prompt and courteous. My father and I enjoyed a few glasses of white wine from their very satisfactory \"by-the-glass\" section. I'm not sure if there's another Italian restaurant this good in Downtown Brooklyn or the Brooklyn Heights vicinity, so definitely worth a meal here for lunch or dinner any day!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "Went here for Brooklyn Restaurant Week so stuck to the prix fixe menu. When you step inside you can't imagine that such a gem is tucked away on this ratchet street. Service is great and the food is good. I had the beet salad with string beans and the mushroom risotto. Risotto was good and the portion size was perfect. I'll definitely go back here to try the pasta though.", "author": "Ola F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "It seemed like a good old-school Italian restaurant, so I finally decided to try it. The start was promising: friendly staff that you would expect in a family-run Italian restaurant, good bread, and an expansive list of pastas. Unfortunately, the quality of the food did not stand up to the high expectations. The lasagna was loaded with too much cheese and meat. Maybe this is the regional tendency but it was too heavy for my liking. The lasagna sheets were also too overcooked and were a bit flaccid. The amatriciana was also just okay. The penne lacked stringiness and the sauce was a confusing, heavy mix. I really hoped this would become a hidden gem that I could go to on a quiet evening but it was not to be.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Long live the Queen. This is classic old school Italian at its best. Never been disappointed here in 20 years. Granted the interior and street front are nothing to write home about, but the service is impeccable, attentive without hovering, and professional. The food is consistently just what it should be for this cuisine. Not trendy. Perhaps the only restaurant in NY where they actually know how to pull a decent espresso, too.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "I love Queen's! I know it looks nondescript from street but do yourself a favor and go in, I promise the food is amazing.We are on a first name basis with some of the waiters and they are always very attentive. Highly recommend...", "author": "Kaitlin D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-30", "description": "Umm, why this place has a five star overall rating, I have no idea.\n \nThe Good: It has white table cloths and and if you dressed up you would feel like you are going to a classy place.\n\nThe Bad:  Went there for dinner  in 2009,  it was overpriced and not worth my time.  If you want an Italian Food Experience, do yourself a favor, cook up some pasta (following the directions on the package)  and follow any recipe you find online that uses canned tomatoes.  Add a good bottle of red wine candle light and you will have an amazing time.\n\nThe Ugly: You don't need to dress up!", "author": "violette c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "The food was pretty good. Very authentic old school style Italian restaurant. They serve you bread with olive oil on the side. I also ordered calamari with was very fresh and seasoned pretty well. For the main course I ordered salmon with vegetables and it was pretty tasty. For desert, I had Spuma Bianco ( a tasty desert with white chocolate cream and strawberries). It was so good!!! They had various wines to choose from and I opted for the pinot grigio. The service, however, could have been a bit better. One thing I hate is being held hostage while you wait for the waiter to come to collect your payment. Other than that, it was pretty good.", "author": "Coco B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-07", "description": "I can't actually report on the food here, beyond telling that my friend strongly recommended the spot and had dined successfully on two previous occasions. My husband and I met her on Saturday night and were told by the owner it would be 10-15 minutes and he encouraged us to sit at the bar (pretty normal occurrence right? Get a drink at the bar, pay for it, get seated eventually).  The owner taps my husband and says table is ready and gestures, but runs away. I pay for drinks, and we proceed to sit for 45 minutes, while successfully being ignored and/or given some b.s. reasons why we had to beg 2 waiters/bus boys for a menu and bread. We were eventually told there was a backlog in the kitchen, but seriously? We saw a couple seated AFTER us get served. We were at first willing to assume, 'hey it's Saturday night, it's getting busy. We maybe confused them because we have our drinks from the bar. We'll ask for menus and be positive.'\n\nLook, after we'd been there at least an hour all-told, a waiter finally comes up to us to grace us with his presence. But no, at this point why do I want to give this restaurant any money? I don't even feel we got genuine apologies for the bad service from the waiter or the owner. I'm guessing the over-priced Italian is good, but I'm not sure it's worth it to go back since the owner won't remember he promised to comp us drinks next time (not this time, and I'm just of a mind to say the service was beyond awful). We didn't really have a back-up in mind, but we were lucky to be seated quickly at Brucie (2 hours after this whole debacle started). I believe we actually saved money on dinner and the service was much more attentive. So, I don't know if the food is good here, I said that already. The bread? Perfectly serviceable. My friend swears her previous experiences were nothing like this, so I don't know what happened. I've honestly not had such blatantly poor service in my life.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "This place has the best mozzarella appetizer in NYC!!!  I'm surprised more people do not talk about it.  We found this when we moved to the neighborhood 2 years ago and have been going consistently ever since. The service is top notch, rarely are you treated this well anywhere else.  Its authentic italian.  Hope they stay around for a long, long time.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-05", "description": "I'm probably out of line with this one, but this might be the best Italian food I've had in New York. I've been here a handful of times and each dish has been awesome! The area is dead, but on the bright side I can get a peaceful walk in to burn off some of those deadly carbs!", "author": "Camille R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "I went last night and i was quite pleased.\nThe breads that they started off with set the tone.\nMain course: Pasta Nero Casalinga :Homemade, Seppia Ink Thin Pasta Tossed w/ Fresh Sea Scallops \u0026 Shrimp, Light Garlic Tomato Broth\nDessert : Tortino Di Cioccolata Warm Chocolate Tort Served w/ Homemade Vanilla Bean Gelato \u0026 Fresh Raspberry Sauce\n\nthe restaurant is located in a lively area of Brooklyn.  The inside is clean.  The service is excellent.  I shall go back!", "author": "Zaffar H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}