{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "Love this place... Every single thing I ate was homemade and super fresh. Started with the fig, prosciutto and mascarpone appetizer - I don't even like figs but this was simply delicious. I then moved on to the seafood pasta with spicy red sauce - absolutely love how everything is made in the back of the restaurant. It is obvious the pasta is homemade because it melts in your mouth. The red sauce wasn't too chunky nor to runny - it was made just right and the tomatoes used in the sauce are anything but canned. There definitely was not a shortage of seafood either - I actually finished the pasta first and had seafood leftover at the end - that never happens.  For dessert I had the chocolate homemade ravioli - not much to say there but ORDER IT!\n\nThe service is impeccable as well. My water glass never got below half full and the staff was attentive but not overly attentive. Will definitely be back in the future - most likely on a monthly basis.", "author": "Jammy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-15", "description": "\"Cooked in it's own juices....\" ha! That's how they sell one of their signature desserts, improper grammar and all!\nFor the most part, I agree with Jen, very tacky decor. We were seated at this awkward table in the middle of the joint... One of our party was seated first. Then I got there. And he and I waited. When I sat down, my friend had a salad in front of him. I asked him if he ordered... he said, \"No they just took pity on me and put it here..\" Yeah, turns out they actually served someone else's salad to my friend accidentally. Then I watched them try to serve it to another lady behind us! We were pretty much ignored by our waiter... I actually couldn't tell you what he looked like because I feel like he was hiding in the kitchen or at other tables most of the night. When our third guest arrived, the waiter came back... started taking our order and then walked away in the middle of doing so. We weren't even sure if we had ordered.\nThe food was good, it's kind of hard to mess up Chicken Parm and pastas... but Lean Cuisine makes some good chicken parm too.. so I guess that's not saying much. The chocolate ravioli were ok. The Limoncello tasted like soapy water... The bread basket WAS great... but the whole experience in general was... meh.", "author": "Jackie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "I live in the neighborhood and have passed this place a hundred times without giving it much thought - it's next to a McDonald's on Court Street and just generally doesn't look that interesting from the outside. But thanks to Yelp and NY Magazine, my husband and I decided to give this place a try last night with another couple and we were very pleasantly surprised by how delicious the food was and how impeccable and warm the service was. The inside is classic, white-linen Italian, but nice atmosphere and decent size space, so great even for larger parties. The portions were very generous and food was well-priced for what you get. But, most importantly, every dish we had - the apps and mostly pastas - were incredible and so satisfying and flavorful. If you want really well made classic Italian dishes, this place completely hits the spot. And the servers, owner, and chef could not have been more welcoming and gracious. They let us linger long after we'd paid our bill and you have the feeling they'll remember you the next time you come back - which we're definitely going to do very soon!", "author": "Elena S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "I really wish I can give a better rating.  The night we were there the air conditioning was broken, which is not their fault at all. Several members of the staff came by to apologize. The service was impeccable. But the dishes I ordered were overly salty and several members of our party said their dishes were salty as well. The wine was great as was the fresh cheese rolls they served us as we were waiting for our apps. Unfortunately I had to send my dish back as it was inedible due to the salt (grilled octopus)", "author": "Linda B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "This place is old school in the truest sense of the words: decor, service, etc. The food is decent, not life-changing. Glad we tried it but it's a little over-priced.", "author": "Whitney A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "My wife and I have been going to Queen for some time now (in fact we went last night for the first time in quite a while), and we absolutely love the place. As mentioned in some of the other reviews here, Queen is a family-run restaurant, has been in the family for a couple of generations. The decor is nothing to write home about, but the food is. \n\nAll the food is made in house, including their signature dish, the mozzarella. They make the pasta, the bread, the sauces and all the desserts from scratch. They have the occasional miss (what restaurant does not?), but on the whole, they put out some remarkable food. \n\nThe service can be hit or miss on some occasions, but again, on the whole it's better than average. There have been some changes in the waitstaff in the past year, but before that the waiters had been there for years. I think it says something about a place when waiters are there for 10 or 15 or 20 years. The Maitre D', Franco, has been there for years, and before he was the Maitre D' he was a waiter, and the previous Maitre D' was there for years before. \n\nThey always have a long list of daily specials, and we always order from that list. Last night, for example, for appetizers we had the white Sicilian anchovies with homemade mozzarella, and we had the bacala (on the recommendation of Franco). Those were two sensational appetizers. The white anchovies were large, firm and really tasty, especially with the creamy mozzarella. And the bacala, salt cod in a fried potato crust, was perhaps the best I've every had. \n\nMaureen had the Scottish salmon for her main course and ended up taking half of it home. I had a homemade sausage dish with tomatoes that I thought was great. We had some wine and we shared a dessert. All in all, we had a wonderful time and an excellent meal. Again. \n\nGo and pick something from the Daily Specials menu. Decide for yourself about this semi-hidden treasure in downtown Brooklyn.", "author": "George L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "I purchased tickets to see 2012 (which sucked btw) and had two hours to kill. My hot date and I were hungry so we stumbled onto the Queen Italian Restaurant. We walked in around 6pm and it was empty, but that didn't bother me since it was early. \n   Anyways, the hostess was very nice and the waiter was very accommodating. I didn't like the fact that since it was quiet all the waiters were bunched together at the bar. It felt like they were staring at us which was a little uncomfortable. \n   I first ordered the minestrone soup. It was quite pedestrian and had too much black pepper. It tasted like a can of Progresso soup. My main course was the Chicken Parmesan and it was delicious. They give you VERY big portions here, so come in hungry (my hot date ordered Eggplant Parmesan and it looked like it could feed an army). It was pretty good, nothing to scream at, but did its job. For dessert I had a decaf cappuccino and the tiramisu. The tiramisu gets an A+ for presentation (even though it was in a milk glass lol) and taste. It was a great way to finish off a meal. \nAll in all, on food only, the place gets three stars. I gave this place another star because of the hospitality. The owner came out and greeted us which I though was a VERY nice gesture. The staff was very nice and actually checked up on us from time to time. The presentation of the food was above standard (you know, cleaning the plate around the edges, etc etc). I would definitely come back to this place to try their other dishes.", "author": "Cisco R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "Food was absolutely delicious. I had chicken and sausage n it was to die for. Also, the waiter was very attentive and extremely helpful. I had the fresh cheese and some of the best I ever had. Highly recommend.", "author": "Eugene O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "Best Italian in Brooklyn Heights.  Home made delicious food.  Expensive and worth it!", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "A thoroughly festive and satisfying evening from top to bottom.  The service was smiley, warm, very attentive, and knowledgeable , and that includes ( what appeared to be) the owner, overseeing the entire place with a great sense of pride which carried over into the staff.  I ordered a very fresh salad of baby string beans, beans, and Gorgonzola, and also sampled the other salad of raw escarole hearts, red onion, walnuts, and ricotta.  For a main course, I had the Shrimp Fra Diavolo, which made my Italian blood QUITE happy in the beautiful balance of flavors enhancing on the tomato, garlic, pepper, and a generous garnishing of fresh basil. The bread basket was fresh, diverse, and the table included a plate of olive oil with fresh Rosemary for the bread. The energy and atmosphere in Queen, is very festive, bustling, but not ear splitting.  I highly recommend this restaurant, and will certainly return !", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "We spent Spring Break in NYC and stayed in Brooklyn for the first time.  When I lived in Manhattan, years ago, it was understood for the best Italian food you needed to get out of Manhattan.  Queen is restaurant friends had taken me to 25 years ago and it had been there for probably 25 years before I got there.  Queen did not disappoint, once again.  This is a classic Italian-American family restaurant. The food was sophisticated enough for the adults and simple enough for the kids.  Everything was perfectly prepared.  We had kids with us so we went early for NYC, 6 PM so we were able to take advantage of the early bird prix fix menu.  The service was attentive and not overbearing.  The only caution I'd give folks is if you are looking for trendy skip it.  This is a restaurant that has stayed in business because it knows who it is.", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "My wife loves this restaurant.  They've been around for years and the food is great.  Don't worry, you needn't be a lawyer to dine there.  Hay, I'm an accountant.", "author": "Bob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "Place rules.  They make their own fresh mozz in the back, as well as roast their own peppers, with a world class caprese as the result.  Balsamic chicken, which is only on the take out menu but can be ordered to stay, is amazing, as is the sole oreganata.  Basics like chicken parm, linguine with clams, etc. are also the best in the neighborhood by a wide margin.  Dessert they make their own nougat which they crush into gelato, which is first-rate.  great bar and bread basket.  usually get two entrees, a caprese and one or two drinks for around $85.  can't beat it.  Have had group celebrations there before, and they know how to handle large groups.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "Best Italian food in NYC in my opinion.  Best mozzarella possibly in the world, especially on the days they make it when it's incredibly fresh.   I generally order anything from their specials as it's always an interesting combination and does not disappoint.  I don't think there is any restaurant in NYC that can compete with Queen's bread either (except maybe the pretzel rolls at Le Bernadin!).   Always a nice place to go with consistently fabulous food.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-13", "description": "The staple of traditional Italian is located 2 blocks away from the Borough Hall Station in Brooklyn.\n\nQueen provides it's diners an offering of traditional and rustic Italian cooking.  Although the flare of the invigorating new age flavors in the application of different elements (ie: notables such as Batali and Burrell) have dominated New York, Queen holds true to it's innate Italian traditional application for which their courses are served.\n\nThe Ambiance:  Don't expect over the top wine glasses or superb qualities found in that of Architects Digest, the restaurant's decor is as simple as it's food.  Diners will find that the restaurants environment is based simply off white table close, sturdy wood chairs, and basic metal utensils.  The restaurant's vibe is that of simple humility.  Diners are here simply to enjoy a good traditional meal, without the flash of those found in its Manhattan counterparts.\n\nThe Food:  Go straight for the Pasta.  The Shrimp Fra Diavolo with Linguine entree is highly recommended.  Consumers of such a delight will find that the Shrimp used in the application is lightly sauteed, thus producing a mild encrustation, without overcooking.  The tenderness of the shrimp is greatly enhanced by both the olive oil and garlic used in the presentation.  The sauce used in the application is that of a basic traditional olive oil, white wine and tomato reduction.  Consumers will find that sauce (which is greatly enhanced through the use of Garlic, Salt, Pepper, Basil and Red Pepper Flakes) gives this richness that's found by few and far between.  Just one taste of the sauce will get any diner to ask for the recipe.  The pasta, cooked to al dente with minor hints of salt for seasoning, the pasta itself can be consumed either with or without sauce.  The texture and richness of the pasta is found rarely with mass produced creations yet Queen manages to produce such an original flavor that no additions are required for it's consumption.  Upon infusion of all items denoted, consumers will find that the harmonious balance from the spiciness of the sauce, combined with the tenderness of the shrimp, and buttery yet delicate texture of the pasta mends to produce an elegant combination of rustic flavors in Italian cuisine that's mirrored by none.  Although the entree is meant to be consumed by 3, patrons might find that the delight is simply too hard to split amongst party members.\n\nService:  Impeccable!  Traditional white garment waiters tend to every request of their consumer base.  Whether the request be as simple as an additional glass of water or have a particular menu option tailored, the wait staff is always attentive and accommodating to it's clientle.\n\nWhen in the neighbor, drop by Queen.  Whether the occasion be a simple desire for traditional Italian cooking, or for a celebration of sorts, Queen caters to all patrons with open arms.  The food itself is more than enough reason to commit a monthly pilgrimage to such an establishment.  With the food crave constantly sweeping over New York, Queen's traditional roots hold true to their fundamental cooking principles, thus producing a dining experience that's whole heartedly in both nature, and appetite.", "author": "C M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "I had dinner there with a group of guys before going to the Barclays Center. I've been to A LOT of Italian restaurants in my day and Queen holds its own. All the food was outstanding and the portions were generous. Their signature item is their homemade mozzarella. They make it twice a day and it was excellent. Perfect combination of creaminess and saltiness. I ordered the parpardelle with duck. The parpardelle were also homemade and the sauce was excellent. My friends ordered the veal stew and the seafood pasta and they were also pleased. This is a great spot if you are looking to have dinner before going to the new Barclays Center. It's a 5 minute cab ride.", "author": "R Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "i went to this place this past mothers day with my family and i loved the place. Its right on a busy street so it's hard to miss and the atmoshphere inside is very cozy and quiet. The staff is really nice and the food was great. The desert was even better the way that it was arranged, i think the prices were moderate, i didnt pay=) so i dont really know but for 6 people and everyone had a dinner and desert the bill was roughly $200. Some of the tables seem a little close together though, but that was the only bad thing about it, otherwise i think it's great.", "author": "Chrissa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "But close to 4 stars. Had lunch on a weekday. Service was decent, food was good but prices were pretty high. And portions are ridiculously big.", "author": "Tawn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "Fresh mozzarella is addictive. I get dinner from here just so I can get this appetizer. Chicken Parm is pretty solid, too.  I have only ordered delivery, so not sure about dining in, but we like everything we've ever ordered from Queen.  Their tomato sauce is flavorful and just the right consistency.  It's a little on the pricey side, but as I said before, I'd pay anything for that mozzarella!", "author": "Alia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "This was a total surprise to us - we made a reservation based on walking by the restaurant and it is worth going to and we would go back the next time we are in the area.  Food was good, service was good and was not expensive either - next time you are in Brooklyn you need to try this place", "author": "Aaron B."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}