{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "We have been to Queen another two times since our first experience; the only reason we don't go more is because I'm watching my figure!!!! ;) The food and service are consistently stellar. \n\nI went with 6 other people, which is seriously the way to go so you can try everything! I got Pasta Nero Casalinga for the third time (the pasta dish I couldn't name in my original review) and shared with my brother who got pasta something-or-other with duck and veal meatballs. To die for. Perfectly cooked pasta, flavor-boom mini meatballs and savory sauce.\n\nMy boo thang got a pasta dish with duck, which I was unsure about UNTIL THE FLAVOR EXPLODED MY BRAIN. Everything cooked perfectly, duck tender and succulent, sauce--once again--the standout of the dish.\n\nGo.", "author": "Jaime R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "This place is a to go place and completely worth every penny! I must say that this restaurant has provided some of NYC's best quality meals as well as service. I went to Queen Italian with my girlfriend, literally, and we were not looked at in any way of disgust nor treated differently. The manager inquired as to where we'd like to be seated and personally seated us. We appreciated this because it shows that it is a business in which the manager takes pride. The food was absolutely delicious and has some of the best tomato sauce I've ever tasted.  We will be returning.", "author": "Cassandra H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Our company booked a corporate dinner here for about 60 people, and the entire process was easy and convenient. I spoke to Pat, one of the owners of Queen, a couple of weeks before the dinner. He was extremely easy to work with and very hospitable. He even printed custom menus with our company's name for dinner that night. We ordered off the price fixed menu, and Pat selected a few wines that were in our price range (in addition to beer and cocktails). Everything was amazing - the food was delicious, the service was amazing and my wine glass was rarely empty. I was shocked that everyone's food came out hot and quick - even with a group of 60+ people. Our entire group raved about the food/service, and everyone enjoyed themselves. Thanks to Pat and Queen for a wonderful experience!", "author": "Kay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "One of the best Italian restaurants in Brooklyn...authentic dishes...great service...a pleasure every time.", "author": "Valon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Order the fresh mozzarella it is homemade that day. Also ordered the squid ink pasta with shrimp and scallops. The seafood was extremely fresh and cooked perfectly!", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Queen is by far the best Italian restaurant in the neighborhood. Their decor is old school.... the dishes are sophisticated. Don't be fooled by the location near fast food places and the store front look. This restaurant is amazing!", "author": "Ben R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "If a restaurant has been operating over a half century with three generations, and is still packed every time you visit, there must be a reason. Queen is located amongst other fast-food chains like McDonald, Popeyes. It's the best fine restaurant on the court street. Old school for families and friends and makes it very special. The food is absolutely delicious.", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "I will never come to this place again , I called to carry out and they told me that my food was going to be ready in 30 minutes but when I got there I had to wait more than 15 minutes for my food , when I got into my office I opened the cointaner what I saw was nasty , the food wasn't prepared properly , my chicken looked nasty with a bunch of oil and water , the pasta had too much oil and the sauce was too acid and it didn't have any flavor but this wasn't all , after 20 minutes I started to feel bad and sick , I called the place to make a complain and when I asked for the manager this person told me he was busy in a meeting , they took my phone number and they said they were gonna call me , after 2 weeks there's no response", "author": "Carlos Alfredo P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "Awful treatment!\n\nI live in the neighborhood, came here with my girl before a movie and thought we may find a new regular spot. We walked in and no one acknowledged we were there. We honestly felt like we were ghosts, about 5 waiters walked right by us and didn't even greet us. After 5 minutes we walked up to where the waiters were gathering and asked for a table. They said no problem they just have to clean one off. We waited another 10 minutes, during which anther couple walked in that knew the staff and were seated immediately. Shortly after, the owner came over and told us they don't have any more tables tonight (it was 7pm!) and ushered us towards the door. I mentioned that a waiter told us he was preparing a table for us and he said \"I'm the boss what I say goes.\" No apology. I get it if you're all booked for the night, but please communicate to me like I'm a human. Absolute disgrace, I will never go back.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "This place is a hidden gem! You just don't expect to find a fine dining Italian restaurant nestled next to a Popeye's and McDonalds. But inside is a whole different story. The menu is extensive, the service is amazing (the kind where multiple waiters show up at once to put down everyone's plate of food at the same time), and the bread basket is hard to keep away from. Everyone seemed to enjoy their dishes and the wine was flowing so I would definitely return. My only complaint was that it took awhile to put in our orders. We were a party of 10 so maybe the waiters thought we needed more time to decide.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Amazing  Food and  Amazing  service! Authentic  Italian food  that  you  can   taste in  each  dish! I love that  the owner  is  still very much  hands on  with  this  establishment ! Will definitely  be  back.", "author": "Sue D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Very, very pricey for what it is.\n\nThe decor makes it look a bit like a venue for wedding receptions or bar mitzvahs. The food here is pretty solid and the portions are large, but $20 for a pasta dish is a bit overpriced considering the other options in the area.", "author": "George Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Consistent, wonderful food and service. An old standard in Brooklyn Heights that serves up old world service and food. Warning: the servings are large and can easily serve as two meals. Order with abandon and plan for left overs. Win Win!!", "author": "AJ D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "Really really good.  If I lived here, I'd want to be close to Queen so it could be my easy go-to place for dinner when I'm too tired to cook.  I had great service and a delicious dinner.  The arugula with beets, olives and raisins was deeelicious.  And I had the bolognaise risotto... it was also really good.  Looking forward to next time I'm in Brooklyn.  6/21/14  I got to take my hubby to Queen for dinner.  I knew he would love it and he did.  And with another person, I was able to try more tasty items.  The minestrone was delicious; the peas, asparagus and leeks also were really delicious!  And the pasta fra diavolo... wonderful!  It's a great neighborhood place, but worth the trip from other parts of the city too!  Enjoy!", "author": "Sally B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-03", "description": "Overpriced, very tasty, unhealthy, fancier classic Italian. \nBeautiful tasting and looking food, I go back for the same dish regularly. But way way too expensive. And same price at lunch! $12 for asparagus in butter and cheese, albeit perfectly cooked. $21 for pasta alla norma, a simple vegetarian classic, again albeit silky and slammin every time. Also its old skool, spacious and no dress code but still stuffy, feathered cloth napkins and huge plates and overly attentive all-male wait staff and kinda smelly,  like where grandma makes you go for her birthday. But clearly the right dish is worth putting up with all that.", "author": "Deb C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "One of the best Italian foods around. From their different types of bread, to their fresh mozzarella!!! The meals are big and the desserts are delicious. Give it a try. Outside is much different than inside of the restaurant.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Classic red sauce throwback. One of the better Italian restaurants in NYC. Can't wait to go back and dig into the menu.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "I am definitely coming back! The staff was so friendly and accommodating. The bread basket and fried dough was a great way to start my meal. I ordered the Shrimp Fra Diavolo  which was amazing. My shrimp were nice and big, the portion size wasn't  small and it tasted delish!", "author": "Shaquanna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "What a great experience. The food was fantastic, from the mozzarella appetizers to the veal entree to the chocolate ravioli and gelato dessert, everything was freshly made and absolutely delicious. Not sure how I didn't know about this place before, but I'm glad I do now. Definitely the best old school Italian restaurant I've been to in my 13 years in New York. Will definitely go again.", "author": "Casey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "From the outside, this place looks like a dump. But it's one of the best Old World restaurants in Brooklyn. If you love Frost and Bamonte's, you will love Queen.", "author": "Bill D."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}