{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Food was quite good. Eggplant Parmesan was as generous as it was delicious. The drinks were inconsistent and the service painfully slow - and often absent.", "author": "Rene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Came here on a Saturday night after walking past it many times on my way home from work and considering stopping in. Definitely glad we gave it a shot!! Very great service and delicious, authentic food. We got a table for four immediately with no wait. Well-priced bottles of wine. Great little place!", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "For my 100th review I have choosen Queen. Why? Because I have been going to this place since I wore diapers. (And I still would if society didn't have such a problem with it) This place is amazing. Best Italian in all of Brooklyn as far as I'm concerned. My family always comes here at least once a year, Birthdays, Fathers Day, Mothers Day. It never gets old, not even my father's usual corny joke \"Getting the gnocchi again?\" It's gotten to a point I don't get it when I'm with my family but you better believe I get it when I don't come with them. \n\nLet start of with their famous bread basket which comes with olive oil (and butter if you awkwardly request it......mom). It's warm and delicious. I can't express enough how great it is. The best if the pizza focaccia bread. I patiently wait to make sure everyone has had one piece or until someone states they will not be having any, and then I pounce for more. There are so many great dishes. The veal baked with baby eggplant and fontina cheese is a must try. In fact this place specializes in veal and eggplant dishes. The risotto alla sicillano is superb. Of course the gnocchi is fabulous and is my favorite here. For dessert I almost always get the chocolate tortino, which is served with vanilla ice cream and a raspberry sauce. Ask them to make sure the tortino is nice and warm when they bring it out. \n\nIf you come before 6:30 you can get the price fixed menu for $28.50. Great deal.\n\nPlease come by and discover the wonderment that is Queen.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Fantastic dinning experience! Was able to walk in and get a table for two for a somewhat early dinner on a Saturday night. The restaurant was 3/4th filled and the host gave us a table marked reserved for two close to their bar. The host, a gracious man who reminded me of my uncle Sal, was welcoming and attentive throughout the meal. \nWe ordered chicken parmigiana  (comes with a side of pasta) and eggplant parmigiana as entrees. Their sauce was perfectly balanced of tangy and savory. The mozzarella was fresh and generously covering the large servings of both chicken and eggplant. They serve a a plate of all different varieties of breads and breadsticks with rosemary olive oil on the table and we wanted dessert, so we did not order an appetizer; however, the menu is expansive with all of the variety that you'd want to see on a good Italian restaurant menu. \nFor dessert we ordered the tiramisu. And it was delicious and creamy. Perfect balance of chocolate and espresso. The red and black fresh raspberries \u0026 strawberries decorating the plate were a perfect sweet and fresh addition. \nIf you enjoy Italian and are in/near downtown Brooklyn, stop here! Enjoy!", "author": "Christine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Visiting in Brooklyn, we found this amazing restaurant! We both enjoyed every bit of it! The salmon and presentation was one of my best, if not the best. I always order salmon. The presentation was amazing and so beautiful. My husband loved the eggplant parmigiana. He said it was the best he ever had the desert was heavenly. The place is so pretty! We loved it! Food was served fast and the feel there is nice!", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Exquisite cuisine! Came here with my friends! Love it! Family oriented Italian restaurant! Ran by family. Staff was friendly and classy. I usually do not come to Brooklyn but from now on, I will be coming to eat at this establishment!.The Vitello (veal) parmesan with penne pasta was great! I'm adding this place on my list of favorite Italian eateries.", "author": "V M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I have been here a few times over the years and I just Love, Love, Love their Penne la vodka and their wine selection.", "author": "Aurea G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "The food is salty, the service is not. Desserts are surprisingly strong, including the wonderfully light, delicately flavored cheesecake. 3.5 stars", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Wow, what a find!  Picked this on a whim, and we were rewarded!  Food, service, atmosphere all excellent!  Bread plate was great, especially the one with red sauce on top.  Next trip to the area, we are definitely going back.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "My wife and I were in Brooklyn for a long weekend and she wanted some local Italian food. When she asked the person at the reception desk at our hotel, we were very quickly told to go to Queen. She even gave us a map of the area and showed us the fastest way to get there. We were able to get a seat at the window so we could people watch. We both love lasagna and when we go to different Italian restaurants we eat it to gauge the restaurant against the many other Italian restaurants where we have dined. The lasagna was delicious. It had more meat in it than other places we have ate.  The service was excellent and one of the owners came to our table to thank us for coming. While he was there he gave us a history of the restaurant. I would recommend this place to anyone.", "author": "Jimmy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "This place was a big hit for my family. Great service, the food came out fast and we were all very impressed with our flavorful dishes!", "author": "G P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "This is one of those places where looks can be a bit deceiving.  If you are walking down the street and pass this place you wouldn't think much of it, but the food and the ambiance are quite nice.  I came here a while ago with my in-laws and the meal was very good.  I can't recall what exactly we ordered but I can say with confidence that everything that we ordered was delicious.  \n\nThis place has a very classic Italian feel to it.  The service is good and the ambiance is pleasant.  I'd recommend this place for a date or if you wanted to celebrate an occasion.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "We have been coming here for years, for me it's been over 13 yrs, my husband it's over 20.  We have our favorites like Linguine \u0026 Clams and Zabaglione.  But it's the service t\u0026 atmosphere that keeps us coming back. Tonight was another great dinner with our family.  Can't wait to come back.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Went to Queen last night and had a fabulous dinner. I made a reservation for 3 on a Saturday night at 8pm. We arrived on time and the restaurant was full. Our table was ready in less than 5 minutes and I overheard other guests being told it would be about a 30 minute wait.  It was my first time here and I chose it because it was very close to the hotel we were staying at. Well we were not disappointed. The house made mozzarella appetizer was delicious! We also went with a bottle of red wine that was on the specials menu, a 2009 Colpetrone Montefalco Sagrantino. It was recommended by the waiter and was perfect. I ordered the veal with mushroom...fantastico! My husband and son ordered veal parmigiana which was also delicious. We finished with cappuccino and shared the creme brûlée. The atmosphere was casual but romantic, there were several large groups but many tables of 2 and 4. The service was amazing! My son will be living in Brooklyn till May, I'm sure we'll be back!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Phenomenal choice if you're looking for a great meal and atmosphere. Very hospitable servers and excellent for a nice night out with your significant other. Highly recommend and will most definitely be back!", "author": "Dan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "My husband and I were visiting NYC for a weekend getaway and decided to stay in Brooklyn.  Our hotel suggested this old family owned restaurant. The restaurant crams a lot of tables into a small space. It was impossible to have an intimate conversation when the other tables were inches away from you. But, I think that is typical for NY. The wine and beer our waiter recommended was perfect for us. I was not blown away by the bread plate as everyone else seemed to be. It was bread... \n\nI ordered the squid ink pasta with shrimp and scallops and found it exceeded my expectations. The sauce was a light tomato garlic and really complimented the dish. This is not a heavy dish. \n\nMy husband had the chicken parm and it was a huge portion. He still ate every bit of it and said it was delicious. I wouldn't know because he didn't share a bite with me \n\nService was friendly and attentive. I would definitely eat here again.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "This is one of the best Italian restaurants I have ever been to. I am 100% Italian and I know good food. I always get the pre-fixe selection here - appetizer, entree, dessert. The bread, pizza, breadsticks and oil they give you to start are amazing. The food is authentic and the service is incredible. I always get the veal gnocchi and they are always fresh. The warm chocolate tortino with ice cream is a great way to end your meal. I even brought my family who owns an Italian restaurant and they were impressed.", "author": "Daniela Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "My boss has recommended this place to me for years but I never had visited. As part of a birthday celebration, my 3 friends and I (+ 1 child) decided to try it out and we were highly pleased. From the moment we walked in, we were greeted by ALL of the staff. The ambiance and décor of the establishment is very beautiful and relaxing; Perfect for a date or special occasion out. Our waiter was also wonderful. He provided immaculate service including great recommendations of the best wines, appetizers and entrees. He was also very patient with our choices for the child at the table, even recommending which dishes were ideal as finger foods. We began with a complementary platter containing a variety of breads with olive oil; all very fresh, tasty and robust in flavor. For entrees, I ordered the shrimp with fettuccine pasta in an alfredo sauce. It was the absolute best, I have ever tasted! The shrimp was so flavorful and the pasta tasted homemade. 2 of my friends had the chicken parmesan with spaghetti, which from my sampling was also good. The birthday girl started her meal with a salad that contained a lemon dressing (I don't recall the name), but she liked it a lot. The penne ala vodka is often recommended to me and the birthday girl ordered that and loved it as well. She also had a crème brulee dessert, to which the staff also sang happy birthday.  If you decide on dessert, please try it, it was delicious.  Overall, the food and service is optimal. I would recommend this place 100 times over to anyone!", "author": "Monique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Classical Italian food and great service -- as good as it gets.", "author": "Evan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "So happy I got to try this place. It came highly recommended from friends who live around the corner. Bread is always appreciated before the meal and they give a variety to choose from. I had the shrimp risotto special and my friends had the squid ink pasta (very good!) chicken parm and the house made ravioli. I love that their pasta is made in house and everything was fantastic. A little pricey but not too bad at all. The chef came over, thanked us for coming in and told us to stay as long as we liked. \nThe only reason this place didn't get 5 stars was the food and service was a bit slow and they wouldn't let me sub scallops for shrimp (even though the lady at the next table over had it). I probably could have pressed for it but not a big deal. I guess I'll try the scallops next time!", "author": "Jenny H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}