{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "So I'm from Rochester, NY. This restaurant, when I walked in and when I looked at half the menu, reminded me of the kind of restaurant you find in Rochester's west-side suburbs, e.g. Greece or Gates or something where the citizenry is mostly of Italian extraction. Hence typical Italian American food in a would-be upscale setting. \n\nLiving in Brooklyn, I was skeptical of spending my limited dining out budget on a place that looked just like tons of places I'd seen/been to. But my spouse loves Italian, and we live basically on top of this joint, so she prevailed on me eventually. \n\nWe walk in. It's quiet. They have a sign in the window advertising a prix- fixe special for the early-bird crowd (pre-6:30). The first employee I see is an elderly gentleman, and the same for the first patrons. \n\nThe big window upfront is covered with wide vertical blinds. There are 5 or 6 tables up front  along one wall across from the bar and the rest rooms, and then a wide space in the back with many more tables. It looks like the dining room of some kind of mediocre wedding hall. \n\nBut it smelled good. We sat down, and the staff was friendly. They brought this basket of bread, and the bread was good. \"Please stop me or I won't be able to begin, let alone finish, my meal\" good. \n\nThe regular menu of things they have all the time has the italian-american classics (spaghetti carbonara, eggplant parm, lasagna, ravioli, veal marsala, veal saltimbocca, shrimp fra diavolo, etc). I've tried a couple and they are very well executed. \n\nThe daily specials menu has even better stuff. I have had several iterations of a mixed \"grill\" of fried and baked food (clams casino, stuffed mushrooms, stuffed shrimp, etc.) and they do it very well. I had duck ragu over tagliatelle, and it was superb. Veal with prosciutto and asparagus was also very well done. My spouse has loved everything they've served. \n\nSo, the bottom line is I should not have judged them harshly in advance.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Had a few friends staying at the Marriott downtown, so asked  the hotel concierge to recommend a place within walking distance. He suggested Queen Italian. My goodness, what a mistake it was to listen to him. The restaurant was empty and the wait staff attacked us as if they were sharks. They were 4 of us and the sharks were hungry. They bombarded us with offers of  drinks, but drinks were so watered down and expensive it would take 10 drinks and a fat wallet to know you had a drink. The appetizer of chilled octopus was somewhat edible but a ridiculously small portion for almost 20 bucks! Mozzarella appetizer and I mean just mozzarella, not even a tomato with it was also almost $20. The girls shared a shrimp dish, that had 4, I repeat 4 small butterflied badly overcooked rubber-like shrimps in red sauce that was not enough to feed even 1 adult! I ordered their \"famous\" squid ink pasta with 2 shrimps and 2 scallops. Man, it was terrible. Totally overcooked black colored noodles with spicy extremely salty red sauce. Both  shrimps and scallops were pure rubber. An hour after the meal I got the heartburn of my life and had to google for a neighborhood pharmacy that was open to get some immediate relief or I thought I would die! My friend who ordered some pasta dish (forgot the name of it) was much smarter then me: he tasted it, hated it and did not eat it. I was stupid to eat most of mine. The bill for 4 people was $300. I guess it was a slow night and they got their victims.", "author": "glen b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "really good authentic Italian food.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Went today with my friends, just by \"accident\" as we were at the MTA museum.\nIt's a white tablecloth rest, very nice.\nThe short story is that almost every thing we had was good or really good! \nThe service was very good, though a bit slow. it took us 3 hours!\nBottom line, I recommend!\n\nThey have a pre-fix dinner if you come before 6:30.\n\nThe mozzarella was really quite outstanding, the salmon on the pre-fix was also pretty good. The chicken breast on the Pre-Fix was OK, not outstanding. The marinara pasta was really tasty, so were the shrimps.\nThe ricotta cheesecake was fluffy and awesome.\nCanoli was so so.", "author": "Sivan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Food was phenomenal. I had the scallops with peas and garlic. The service was fast and friendly. Ever in Brooklyn, do not pass it up.", "author": "Bob P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "If you go to one restaurant this year , it should be the Queen Italian Restaurant in Brooklyn Heights, NY. I have been going there for more than 30 years. I already thought it was the best place in Brooklyn but it keeps getting better all the time. \n\nYou must start with the Fresh Mozzarella. It is made twice a day by the amazing chef Pasquino Vitiello. You cannot  merely call it cheese. It is something much more divine. It is smooth and creamy and melts in your mouth. Whether it is paired with perfectly roasted peppers or tender asparagus , you cannot get better than this anywhere in New York.\n\nIf you were thinking about passing on the salad, you should think again. The arugula salad with pistachio nuts is my favorite. Any of their salads are a good choice. The greens are always the freshest possible and you will love their lemon salad dressing.\n\nThe last time I was there I had seared scallops with orzo. Absolutely the freshest scallops I have ever had and they were HUGE. Wonderful. I also love the grilled octopus. Perfect texture and delicious. \n\nThe pasta is house made and any combination will be a winner. I love the gnocchi and the lamb ravioli is scrumptious. My dinner guest had the pasta with the squid and claimed it to be superb. \n\nCan we talk about the fantastic bread basket!!? All the bread is home made, and what a variety! The focaccia is divine. \n\nYou cannot leave without having one of the many homemade desserts. My personal all time favorite is the Panna Cotta with Blood Oranges. It is lightly sweet , creamy and heavenly.  The pistachio cake is wonderful as is the gelato. Any flavor is perfect. Try more than one!\n\nThis is a place I will continue to enjoy as long as the brothers Vitiello continue to create their incredible food. The atmosphere is always good. Warm and inviting. I consider this place to be a real gem and I cannot say enough good things about it. \n\nGo and enjoy. It will be a real treat. You won't be disappointed.", "author": "LM L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Enjoyed my meal tremendously! The atmosphere is warm and friendly and the desserts were divine. I cannot wait to dine here again!", "author": "Cris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Ordered delivery to my hotel from here, and someone at the hotel took my food by mistake. The restaurant handled it so nicely. They replicated my order and delivered it quickly at no charge. The food was delicious. Will definitely order from here again.", "author": "Dorothy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "The Queen resteraunt is simply fabulous! Do not go to the queen and judge it from the outside, judge it from the inside. Try the pastas, the chickens, and the salads. I can assure you that you will be stunned by the quick service, and the wonderful\n food", "author": "Gianna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "We have been in NYC for 3 days, tried many restaurants. This is BY FAR the best meal we've had. The atmosphere, the attentive staff and the incredible food made the walk across the bridge well worth it. Great night!", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "When you picture \"A Little Italian Place\" in New York, you are picturing Queen.  Great food, great atmosphere.  Only negative, its a bit pricey for what you get.", "author": "Dustin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Warning! If you're a student, this may be way out of your price range which is what happened with my dinner party. It took us hours to figure out what we could afford to order. We weren't too pleased to hear that their lasagna is mixed with beef and pork. Who does that? They were very generous with their bread basket while we mulled over the menu several times and debated amongst ourselves. I eventually ordered a salad, yes a salad. It was the Rucola, Arancie E Pistacchio insalata which is arugola,strawberries \u0026 pistachio covered in mascarpone dressing. I enjoyed the salad but hated the dressing. For the small portion I was given, it definitely wasn't worth $11.75. Other guests customized their meals, but to their surprise the high price meant high quality. They enjoyed their meals. In the end that's all that matters right? I give the waiter and maitre D' a lot of credit for having patience with us. Word of advice, plan ahead and do your research before you go out.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "amazing italian food. You have to try the scallops", "author": "Gary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Dined at Queen while in Brooklyn just before Christmas.  (Based on Yelp reviews, and recommendation by someone at Marriott nearby.) Had such a great dinner that I returned the following night. Outstanding Italian fare - combination of some tried-and-true favorites and some creative specialties of their own. Great family-owned atmosphere. Excellent service. And to top it off: wonderful desserts!  Will definitely return.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "A Heights staple! A friendly waitstaff and good food are presumed. The tables are packed in tight, and the crowd noise can be hard to overcoming on busy nights.", "author": "Jason A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "If you like a classic, old school Italian restaurant them this is your restaurant. The fresh mozzarella is a must. A little on the expensive side, but it is 100% worth it.", "author": "Keith H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Came here after a birthday party. Luckily they're open until 11pm on Saturdays, otherwise I would've went hungry. The decor was very clean and inviting. I felt a little undressed but still was welcomed by everyone that was there. The staff was extremely attentive and observant. They were never intrusive or rude, it was as if they anticipated what we needed and wanted before we even said anything.The insalata mist reminded me of my grandma's salad, it was delicious and not to overwhelming in ingredients. My date had the mozzarella with eggplant, the cheese was so delicious. The entrees are abundant which is always a good thing when you're hungry. The linguine alla marinara is absolutely the best I've ever had. My date thoroughly enjoyed the chicken parm with penne pasta. We were too stuffed to even have dessert plus it was after 11pm. Next time for sure. All in all, it was a fantastic dining experience for such a late hour.", "author": "T S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-15", "description": "The best thing about this place was watching everyone on the wait staff standing around and watching as a fellow waiter stood on a chair and changing a lightbulb. The spectacle really begged the question: \"how many waiters does it take to screw in a lightbulb?\" \n\nI think my boyfriend and I just ended up here at an odd hour, but the huge dining room was completely empty when we first arrived. Twenty minutes later, the room was still empty except for us... I guess we looked lonely because the host decided to seat an elderly couple with failing hearing at the table next to us. It's hard to have a romantic date with light dinner conversation when all you can hear is old people discussing things that really shouldn't be discussed over dinner.\n\nThe food was good, but not incredible. For the same prices, we could have gone to a place with a million times more ambiance and slightly better food. Large, bright open rooms with a sea of white table clothed tables just doesn't do it for me.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-12", "description": "I ate there with four family members.  The appetizers we ordered were OK - mozzarella salad decent (but Fratelli further down on Court sells far superior and fresher mozzarella) but no better than good supermarket mozzarella; fritti misti - overfried, seafood tasted like it had been frozen; arugula salad pretty good.  \n\nOur entrees were pretty bad.  The veal scallopine tasted a little like Chinese food.  The cavatelle in lamb ragu was awful -- overcooked pasta, greasy sauce -- not recommended.  A capellini primavera (angel-hair with vegetables) was just OK.  \n\nThe bread plate served first was probably the best thing here.  The prices are much too high for what you get, and the atmosphere is cold and not particularly pleasant. \n\nI love Italian food but wouldn't really consider eating here again, even though it is right in the neighborhood and lots of people seem to like it.", "author": "Katharine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Queen is not so much a restaurant as a time machine.  Benvenuto al 1970 questo è il ristorante italiano tuoi genitori sono andati a.", "author": "Alan N."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}