{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "Average Italian and ridiculous prices served by pretentious servers.", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-31", "description": "This is the first time I have ever been here. I thought it looked like a diner from the outside but it turned out to be a very sophisticated actual restaurant. I had the roasted beets with baby string beans and Gorgonzola. Everything tasted of top-notch ingredients. However...thinking back, maybe I should have gotten a pasta dish. My friend ordered the medallions of venison which she loved and continued to talk about after we left the restaurant. I ordered ice coffee, but that probably wasn't a good idea either considering all the ice melted as soon as it reached our table. I'll stick with hot coffee next time? I would have liked to critique that, I'm a sucker for coffee. It is very expensive for the portions but that's the price you pay for specialty. I understand. Overall, it was a good experience but I wouldn't go out of my way to return. Nothing personal, just not my cup of tea but hey, I'm all for trying new things.", "author": "Bonney L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-04", "description": "This restaurant is perfectly fine, old school American-style Italian. The food is good, but incredibly overpriced, given the straightforward dishes, and bizarre ambiance, not to mention an abundance of excellent, inexpensive restaurants that I'd rather visit in nearby Cobble Hill, Boerum Hill, and Carroll Gardens. \n\nI've lived in the neighborhood for almost 4 years and was very much looking forward to my first visit. I was expecting to find a \"diamond in the rough,\" since I've read how the decor is, but how good the food is. Again, this place is fine, but lasagna should not cost almost $20 and other pasta dishes $25 and up and entrees close to $30. If prices were comparable to other fantastic restaurants in the neighborhood, I would have given 4 stars.", "author": "A S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-22", "description": "Best Italian I've had for a while. Service was a little slow, and probably only noticeable because we were in a hurry.", "author": "Leigh G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "I really love this place.  It's not cheap, but it's got character a-plenty, and I've yet to find fault with any of the food there.  I don't eat veal anymore, but when I did, I found some of the best here at Queen.  It's got an old-school vibe but they've kept the kitchen current, and they're able to dish out incredibly fresh and flavorful Italian dishes that always leave me stuffed to the gills.  Long live the Queen!", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-16", "description": "i had the lasagna - you can't go wrong with that right? well yes - it can. i think i had a better lasagna from frozen ones - you know the ones you get from the grocery store? the meat was weird and the cheese on top was weird. just weird. and the waiter - he was so insisting on us ordering more food and drinks. it was like if he was on commission or something. little pricey for the tasteless dish (my friend liked his raviolis) and inconsistency in the food makes it so unappealing to go back again.\n\nneedless to say - i got back to the hotel and threw it all up. i feel much better now.", "author": "Dot K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-01", "description": "Queen is the only place to get delivery from in Brooklyn Heights. They are on my speed dial. Brooklynites from other neighborhoods will find that it is the best place to spend your daily stipend while on lunch break from jury duty.\n\nDear Steve, I'm sorry your fiance did not like the lasagne. For the record, it is incredible but I understand that some people prefer hamburger helper.\n\nDear Katharine, I also apologize that Queen did not satisfy your tastes. I would also like to point out that Fratelli \"down on Court\" closed over 2 years ago. And that it is also no \"St Claire Diner\" which you enthusiastically rated with 5 stars (even though it deserves a 2 at best). But we all have different mouths.\n\nSo enough of the rebuttal, on with the review! Full disclosure: I've only ever gotten delivery except for once when I ventured into the dreary, low ceilinged dining room wedged between mickie d's and popeyes. . . \n\nBut for delivery Queen is like 3 restaurants in one. There are great pizzeria style options like the huge (everything is huge) veal parm, eggplant parm, or meatball parm sandwiches, all excellent. \n\nThen there is the take-out menu where you will find all the regular pastas which are above and beyond any other red sauce place on the court street strip. I love the vongole (with white sauce) and the carbonara. The sausage and peppers are amazing and there is this fried, fresh mozzarella that also hits the spot. \n\nFinally, there are the daily specials. These are fairly pricey ($20 for a pasta) but totally worth it. Just ask for the daily specials. The special apps \n are top notch too. They really are right up there with Babbo, etc.", "author": "brian a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "The Queen is about the food. The service is passable, a little too stiff.\nThe decor is do it yourself Italian. The food is wonderful. There are no shortcuts in the ingredients. The steak served in the Queen is better than most 'steakhouses\". The portions are generous. It is not cheap, but you get what you pay for. For my money this is the best value in Brooklyn.", "author": "BRIAN M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "We just love this place.  Decor is reminiscent of a 1990s suburban Italian restaurant on a less appealing stretch of Court Street in downtown Brooklyn, so we had some initial skepticism.  Our first few times there we tried some of their more involved pasta dishes, which we liked, but weren't wowed by.  Then we discovered their basics - very simple capellini bolognese and capellini marinara.  These.  Are.  My favorite pastas anywhere.  Anywhere.  They are so simple, so perfect, so unbelievably satisfying.  We are Brooklyn foodies and do that sort of thing often enough, but some nights, all we want is one of those two dishes.  Old school stuff that is... honestly, just the best we've ever had.  Love the bread basket and some of the apps as well, but if you want old world basic red sauce classics, I don't think there's anywhere around here that does them better.  (Let it be said my wife also loves the veal parm.)  Go.  (And don't order in - I would think you'd lose so much in the translation, and I agree that as good as this is, it's still pricey.)", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "The Queen is a hidden gem.  We came here from the Upper East Side for dinner based on a friend's recommendation.  Everything here is home made, from the bread and the mozzarella to the cannoli shells and the desserts.  The owners take pride in the food and the service and it shows.", "author": "NotJeff T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "EXCELLENT!! i can not stress that enough how great this place is! its in the middle of a mcdonads and a pizzeria but so worth the search. the food, service, wine, decor, price all EXCELLENT and worh the trip!!", "author": "Letizia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-26", "description": "oh goodness. stellar meals, service, and ambiance. what may appear to be a simple italian restaurant is really a haven for some of the best food you'll ever eat. the fresh mozzarella is, i assure you, unlike any other you will ever taste. a very friendly staff, and the old man at the bar is especially cute. good wine selection too.", "author": "Emmy F."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}