{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "This is my favorite Italian restaurant in the WORLD! I have been coming to Queen for my whole life and it never changes. The atmosphere is always calm and relaxed, the service impeccable and the food delicious. Hidden in the shadow of a McDonalds you would hardly think that such a spot was there from the outside. A great place to impress a date or to celebrate a special occasion, Queen impresses from the bread before the meal all the way through to the hand made desserts. Personal recommendations are the baked clams (small and crispy), gnocci, and veal parmigiana. The menu is extensive so I am sure you will find something you like. Places like Queen are rare today. The classic spot which has been there forever and keeps on cooking.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "the décor is outdated, but the food is fantastic and the service excellent.  perhaps the best restaurant in Brooklyn heights.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "This place is legit.  The fact it's on court street right next to places brought on by the movie theater development like popeyes shouldn't ward you off, its just a testament to how long Queen has been around.  It's in kind of a weird location for a classic Italian restaurant, but thats what it is through and through.  Buono cibo (good food), big portions, our waiter was friendly and humored us by letting some practice their broken italian.  It is pricey, but it's worth it for a nice family dinner now and then.  \n\nWent there once for lunch with my dad too during the week, wasn't crowded at all except for a few lawyers with napkins tucked into the shirt collar and I felt like I'd went back in time.  Manager always comes around when your done to ask how the meal was.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "I grew up in Brooklyn, but now live in DC.  I miss old-fashioned Italian restaurants that used to be on every other block, but now is rare.  Every time I visit Brooklyn, I go to Queen.\n\nI always order the same thing:  prix-fixe:  minestrone soup, veal with eggplant and fontina, and chocolate torte.  It goes well with a Sicilian red.  I wish DC had places like Queen.", "author": "Katharine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "Pretty expensive. The food is decent but I really don't see this place as being anything special. I feel like every time I come here I'm disappointed somehow. Furthermore, no one in my party was impressed at all by the sloooooooow service. Don't honestly think I'll be returning here.", "author": "Kristian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "We had spied this place a couple of times when going to the movies at Court St and told ourselves that we had to try it, after seeing the 24 for food posted in the window(!).\n\nIt lived up to expectations. I started with a shrimp/potato puree soup that was out of this world delicious and perfect for the rainy night we were there. Since I only eat fish, I only had a taste of sauce on the lasagne, which was just about perfect. Other sides were delightful, like the butter and cheese enhanced asparagus. My oyster pasta was fairly amazing. \n\nWe couldn't do deserts, but the menu looked good.\n\nThe prices aren't bad for the quality of food and you get some great old school neighborhood service. Although it isn't hip (by any stretch of the imagination), it comes through in food quality and service.", "author": "Brett W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "I might have given it 4 if I ate there alone and only had my entree. The Veal Saltimbocca was pretty flavorful and tender and the sauce, although I couldn't identify its ingredients, was pretty good. My fiance had the lasagna and it was pretty unimpressive. The meat tasted like high-filling meatballs or meatloaf. The rest of it was ok, but it's hard to get past not using basic ground beef in a meat lasagna.The bread plate was great and the service was humble and responsive. I would go back here and try something else, but definitely don't get the lasagna!\n\nThe price range is right on the cusp between $$ and $$$.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "Love, love, love the food here.  Always so fresh.  The mozzarella is fantastic.  Service is impeccable.   The prices are pretty steep, but well worth it.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-04", "description": "Mediocre food at a premium. Pricey dishes. Vegetables boiled and waterlogged like at a high school cafeteria. Pasta dishes good. Meat overcooked. Wouldn't go back.", "author": "M L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "This has such an old school Italian feeling to it, and definitely one of the better restaurants in this neighborhood! You can't go wrong ordering any pasta or fish dish here, and the older waiters are classic!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "This is excellent old school Italian in a beautiful setting.  The pasta is fantastic.  The sauces are rich and flavorful.  The service is good with a bit of an attitude.  The thing that will make us think twice about coming back are the prices.  It just seems high for what you get.  But if price isn't a big concern go to this restaurant!", "author": "Larry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "Another wonderful dinner with family and friends at Queen Italian Restaurant. We continue to be impressed with the service and food quality. Highly recommend this restaurant- worth the subway ride from Manhattan.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-30", "description": "Most of these review must be bogus.  The food was super salty.  Me and my wife split the linguini and marinara sauce, there oyster appetizer and the calamari.  My friends had the lasagna And cheese ravioli.  I think the only dish that was sort of up to par was the calamari appetizer.  For the price quality and taste I would not go there again.  I think Carmine's is way better and next time we are craving Italian we will head over there.  I was disappointed because I was expecting some really great food after reading these yelp reviews.  I am not a yelper but I decided to do this review in hopes that others do not have to go through the same experience.", "author": "Alberto V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Hotel Concierge recommended this restaurant.  The lasagna was excellent.  The service was good.", "author": "Greg O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "Brooklyn Restaurant Week lunch menu was great.  Three courses each served with care and timed perfectly.  My husband and I ordered different items and we were both very happy.", "author": "Esther B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-14", "description": "I stumbled upon Queen online when looking for the best Italian Food in Brooklyn Heights. On every website it was lauded as one of the best Italian restaurants in NYC, so we decided to have lunch here. I will start by saying that I am an Italian citizen and grew up around Italian food my whole life, so I have high standards when it comes to Italian cuisine. The bread they serve is very good, I enjoyed the variety and it was very fresh. My mom and I ordered the lasagna which wasn't very good. All I could taste was the tomato sauce it was drenched in. The meat was flavorless and dry. My brother ordered the chicken parmigiana which was tasty, even though not really spectacular. The portions are huge but the lasagna was so boring to eat that I didn't eat half of my plate. We ordered the panna cotta for dessert, which was spectacular. At least the meal ended in a delicious sweet note but I will not be returning to Queen unless it's just for the dessert. The food is overpriced and not worth the hype.", "author": "Leonardo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "What a great old school find in Brooklyn.  Just cheesy enough interior (very well kept and clean) to make for a kitschy experience.  Service was extremely attentive if not a bit cold.  Very good looking menu.  And the food we ordered was very very good.  Expect to spend a good amount of time here, it is not a fast service restaurant.  A must to check out.", "author": "James M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "Italian restaurants are located all around the New York City \u0026 Brooklyn area, but none of them come close to comparing to the authenticity and tastiness that Queen offers. After hearing many reviews of Queen, we drove from Jersey to Brooklyn to have an Italian experience. As soon as your walk into the restaurant you are welcomed by the extremely friendly maitre d', who offers you a seat at the bar, or one of the perfectly set tables. My friends and I first took a seat at the bar and were fully entertained by the nice bartender, who also can make a mean cocktail. Once finished with our drinks and already enjoying the evening, we were seated and ready for dinner. We each started out with the mozzarella dish which surpassed what I could have ever expected from a restaurant. Even at first look at the mozzarella over top a nice set of tomatoes, you can immediately sense that it was freshly made in house, and the taste only reaffirmed this. After all of us clearing our plates and also enjoying some of the complimentary bread offered on the table, we examined the menu which offers anything and everything that an authentic Italian restaurant should. I finally decided on the eggplant parmesan even though I was going back and forth on the many choices. I have never been happier with my decision. It was one of the best dishes that I have ever had, and by far the most amazing eggplant parmesan that I have eaten. The other dishes ordered were fra diavolo which was an assortment of seafood in a perfectly spiced broth paired with pasta, venison cooked rare and to perfection with a side of fried polenta that was so heavenly that we had to order and extra side dish, cheese ravioli, and we finished the night off with the Zabaglione. The smooth, creamy custard along with the assortment of fresh berries, matched with an expresso was the perfect way to end the night. If you have an respect for authentic Italian food, matched with a welcoming ambiance and assortment of people, then this family owned restaurant is perfect for a meal on any night.", "author": "Ashley K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "Classic Italian American restaurant. My parents and my grandparents ate here so it's been a standby for a long time.\nThe owner seats you, his son is the chef and the rest of their family is all over the place.  \nQuiet, with great good and impeccable service. There is nary a hipster in site...it is such a slice of heaven.  \nPeople who need music and lighting don't come back, but those of us who grew up in NY and remember these types of restaurants return again and again.  One side of the menu is classic dishes and the other is Chef created.  The \"chef's\" menu is quite good, but the classics are hard to not order. Their red sauce is the best in the neighborhood.  \nGod bless the Queen.", "author": "Bx L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "I dine out at fancy restaurants 2-3 times per week across the country - every week - for nearly 30 years.  This is literally \"THE BEST\".  The food is amazing and the service is amazing.  The servers anticipate every need you may have, the food is creative, innovative, but \"comfort food\" too.  I have truly been shocked that a restaurant like this still exists.  I only wish I could take them all home to Dallas.  Coming here on business is all worth it if I get a trip to Queen.  For a \"southern gal\" to feel like family is really special and I love the atmosphere and the food!  So fresh and lovely ambiance!", "author": "Laura P."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}