{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "This place is classic old school Italian food. Expensive for the price but the olive oil was great along with the squid ink pasta and shrimp and pasta. The desert was fantastic!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "My parents are from New York, love Italian food, and are seasoned eaters. When they came to visit from Florida, we ate here three nights in a row. It's that good.\n\nIt might be crowded when you get there, so reservations are a plus. One night we had to wait around half an hour, but they take care of you at the bar. An adorable, tiny, old Italian man will seat you at a traditional white tablecloth and you'll be given a variety of Italian breads with amazing olive oil.\n\nThe food was all delicious. Throughout our three nights we had squid ink pasta, linguine, risotto, scallops, lasagne, and a number of desserts. Everything was comforting, tasty, and great quality for the price. It's not the best of the best, but they stay in their lane. \n\nDecor is a bit cheesy, so I wouldn't personally recommend taking a date here, but if that's your thing, go for it. Get a wine with the meal and enjoy.", "author": "Erika L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "An old landmark in this neighborhood only gets better with age, need more like this one!\nI tried something new to me which was a most delicious and delicate entree. Highly recommend the baked veal scallopine with baby eggplant, the best tomato sauce and covered with perfectly melted  fontina cheese. For dessert I had the best ricotta cheesecake ever, light but with the balance of cheese curds and just the perfect balance of orange citrus. No, I am not a family member but wish I was.\nCarol G", "author": "Carol G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "I was really disappointed with my dining experience. We had reservations and still had to wait 45 minutes to be seated. We sat at the bar and ordered some wine while we waited. The wine was fabulous, I must say. We ordered a bottle of the Multipulciano (the one with the grape vine attached to the bottle.) The bartender was very friendly and knowledgeable.\n\nAfter we sat down, I don't think our server said more than two words to us. When he came to take our order he just stood there with his pad open without saying a word.\n\nI ordered the veal parmesan and my boyfriend ordered the chicken parmesan. They were huge portions which would have been great if they tasted good. Both dishes were overly breaded with the breading falling off in sheets when you picked up a bite. The chicken itself was fine but I cannot say the same for the veal. The veal was very very chewy which wasn't very appetizing. The saving grace was the side of penne. The penne was al dente and delicious.\n\nIf I was to go back, as this place was highly recommended and I can tell by this page many people like it, I would only get a pasta dish.\n\nOverall, this place is way overpriced for a mediocre meal.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "This place sits undercover on a typical busy Brooklyn street with electronic stores and fast food joints.  In fact its next door neighbor is Popeye's Chicken.  But don't let that deter you.  Inside is a tranquil oasis from the city.  The decor is a typical traditional Italian joint, somewhat dimly lit with white \"christmas\" lights and some cheesy decor.  But it's also filled with full and happy diners.  The crowd seemed to be an older crowd.  Many tables of 4 or more.  And the night I was there there was a famous boxer and trainer eating in the restaurant.  That caused slight commotion with a number of people asking for pictures and autographs.  \n\nThe food was very good.  I had the \"Gnocchi Casalinga - Sauce Of Braised Veal \u0026 Assorted Peppers\".  It was fabulous, but got a bit rich near the end and I couldn't finish it.  Part of that reason could also have been the feast of various breads and oil I was served while I waited for dinner.  There was at least 6 or 7 varieties of bread - hard and soft.  I sat at the bar and enjoyed the conversation and service of the Honduran bartender.  I didn't get his name but he is a super good guy. All the staff were friendly.", "author": "Jack S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "Reliable old school Italian-American food (meaning, heavy on saucy pasta dishes you will never actually see in Italy). \n\nAtmosphere is like a tacky wedding reception. \n\nPros: great, friendly service. \n\nIn the culinary twilight zone that is downtown Brooklyn, this place is actually considered good. Go figure. If you really want Italian food, walk over to Rucola or Brucie.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Two years ago, my family had the honour of dining at the wonderful  restaurant! \nWe will be returning again, without any hesitations in Oct. \nI felt like I was back in Italy as did my daughter. \nPlease do not pass up the opportunity to enjoy a real Italian experience in the heart of Brooklyn!", "author": "Brenda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This place was recommended by the staff at our hotel. It didn't disappoint. The best Italian food is in Brooklyn. To start, they bring a bread sampler and garlic/minced olive/olive oil dip. We ordered the jumbo shrimp appetizer, the arugula salad w/strawberries and pistachios, lasagna and spaghettini bolognese. Delicious. All of it. Reasonably priced, ample portions, great atmosphere. When in NYC, I won't miss an opportunity to to eat here.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "My husband and I came here on our one year wedding anniversary.  We were greeted by this adorable older gentlemen who escorted us to a great table.  \n\nThe place is very beautiful and intimate inside.  Unfortunately, I am not to good with Italian entree titles so I can't say exactly what we each ate.  We had a seafood appetizer that came with oysters, clams, scallops, and shrimp and each piece was perfect. \n\nTheir bread plate is an assortment of fresh and delicious breads and crackers.  \n\nMy husband had a seafood pasta entree and I had chicken and vegetable entree.  Both were delicious and very very well prepared.  \n\nService was great. \n\nDessert and wine were on point.  \n \nThe other patrons looked so happy and satisfied around us.  Many people were regulars. And the table beside us raved about the place to us before they left. \n\nMy only tiny little gripe? The candles are not real. But that's no biggy, I just thought it took away from the class of the establishment. \n\nI highly recommend Queen Italian Restaurant! They offer excellent food, wonderful service and", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Very old school Italian eatery.  Host would come and ask you how you like your food, and decor is very much white table clothed.  I loved my seafood linguine, and the fresh mozzarella cheese was so good!  It is definitely on the pricy side but I guess the old school warm and fuzzy feeling does come with a price tag!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "This place is the real deal for Italian food! Everything is always delicious here and the service is great! The decor can be improved upon but I don't think you'll care once you start eating :)", "author": "Saddia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "Loved this place. Came here with my dad and boyfriend and the experience couldn't have been better - I grew up with Italian food EVERYWHERE in my house (my grandmother is a Brooklyn Italian). This food was incredibly reminiscent of home, and it was DELICIOUS! Our waiter was one of the best waiters I've ever had, and the adorable maître d was wonderful as well. Kind of fancy, expensive, but well worth it. I am absolutely coming back! The only downfall was that the decor was pretty 1989 Italian place. But in a way, it almost added to the charm? ...almost.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "The owners are very nice and accommodating and the food is real deal Brooklyn \nWe have been eating here for more than 40 years\nTry it!", "author": "Eileen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "From the looks of the outside it should get a face lift but once inside its very cozy and the service is phenomenal. Last Sunday we went in and they offered specials that consisted of a choice of appetizer, entree and dessert for only $26.00. I ordered the minestrone soup, the gnocchi with veal and peas and for dessert the chocolate tortoni. Everything was super delicious! My favorite was the gnocchi!!!! OMG the gnocchi s just melt in your mouth because they're homemade. I'm coming back very soon!", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Authentic. They make you feel very welcome.  Great veal. And the dessert was awesome.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Came here for dinner on Saturday night with my boyfriend. \n\nComplimentary bread and olive oil was excellent! We both did the pre-fixed dinner. Mozzarella was yummy, so was the chicken raviolettes and the ricotta cheesecake. My boyfriend had the lemon sole and the chocolate tortini.\n\nWould recommend and come again when in the mood for Italian!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Didn't know this place existed despite walking by it numerous times. Perhaps it is the unassuming front that keeps this amazing restaurant a secret. Once inside, you would be surprised! The service is impeccable and our waiter, Antonio, particularly knowledgable. We took pretty much all of his suggestions and were blown away - the food was fresh, delicious, beautifully prepared, and everything house made (yes, mozzarella and ice cream included)!", "author": "Blaga S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Best Italian food I have tasted so far. Dine in the 1st time and loved it. Now I always order take out. Had their spaghetti and meatballs and lasagna. Did not disappoint me. You would be paying about $20. Good price and they give you a big portion. Totally worth it. Yummm!", "author": "Gege H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "Great meal!  We had a large group and our dinner was excellent. Everyone at the table was so happy. The Ministrone soup was excellent. I also had the Veal Parm... it just melted in my mouth on every bite. The side of pasta was cooked perfectly.\nI also had the chance to sample the Hanger steak and the homeade ravioli...wow!!!  The owner/chef came out to our table and seemed like a nice guy. He actually cared enough to walk around to every table and make sure the food was good. Great customer service!  It also happened to be my birthday and the staff sang a nice birthday song a delivered one of the best cheese cakes ever!!!", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "I went to Queen for the first time in 1958 with my Mom and Dad. My Dad was a physician  and one one the owners was his patient as was a waiter. I dined there at least once a week for years. When I went to college my folks ate there at least once a week for almost three decades. Whenever I came home it was my go to place. \n\nI've lived in the mid-west since the late '70s and rarely returned to Brooklyn. Yesterday my wife and I tried to re-live history. At as respects Queen, it could not be done. We were not bothered by the gentrification. The dining room is quite attractive. But the rest--ug!!! The greeter was at the same time rude and disinterested. When I told him of my history with Queen he was non plussed and  wouldn't ask the owner-whom I knew as a young man--to say hi. As for the food it was mediocre at best. The baked clams were clearly pre made and lacked any taste of the sea. The fried zucchini sticks were greasy and over salted. Our pastas can best be described as edible. No flair, nothing we cannot do better at home. \n\nThe service was passable but disconnected. When we asked for tobasco for our clams we were advised that they did not serve it. They serve tobasco with baked clams all over Italy. \n\nThe prices are New York for sure. $23-25 for a modest plate of pasta. \n\nOne cannot relive past treasures, I guess.", "author": "Harold H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}