{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Never disappoints. Delicious authentic Italian food. Service is very attentive, atmosphere is quite and intimate.", "author": "Leila J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "I had dinner with a group of colleague friend at Queen Italian Restaurant during my stay in Brooklyn and I was very impressed with the food, as well as the quality of service here.  It was a group of seven, and although we arrived at the restaurant at a prime dinner time and without a reservation, we were seated immediately.  \n\nMost of us ordered the meal from the Price Fixed Menu and we were very happy with the selection.  I began the meal with Homemade Mozzarella Alla Caprese which was out of this world.  The cheese was absolutely amazing and the salad was incredibly fresh.  For the main course, I had a wonderful Scaloppine of Pork, served with fresh rosemary and homemade sausage.  The rich sauce that accompanied the thinly-sliced and perfectly cooked pork chops was so amazing, I had to hold back from licking the plate clean.  The dessert was to die for as well.  The Orange Panna Cotta was velvety smooth and it was easily the best Panna Cotta I've ever tasted.  I had a bite of my friend's cannoli and that was very New York (translation: Delicious).  \n\nAnd be careful with the complimentary bread basket filled with variety of breads. Everything is so good that if you're not careful, you'll be stuffed by the time you order dinner!  \n\nWe asked the staff to sing a happy birthday for one of our colleague friends who celebrated his birthday a few days back and they brought out a group of almost professional opera singers with a plate of cannoli!  It was amazing!  I can totally see this place in old school Italian movies!  \n\nPeople often say that everything you eat in NYC is good and Queen Italian Restaurant definitely proved that theory to be correct.  I can't wait to go back for some more great Italian grub when I return to Brooklyn.", "author": "Hirono S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "In general I'm not a fan of Italian food - but a friend was visiting and wanted Italian and another friend suggested this place.  \n\nYou would never know by looking from the outside what this place was about....You walk in - the Italian waiters (how do i know they are Italian? they have accents!) seat you, give you an extensive menu of different dishes, and a variety of bread and olive oil. My friend ordered the lasagna (usually lasagna is very heavy and cheesy, so i passed), and i ordered the Raviolette Di Agnello Casalinga - Ravioli with lamb, peas, leeks in a lamb sauce. The plates came relatively quickly - and the food was AMAZING!!  I tried my friend's lasagna, it was incredible - not cheesy at all, and it tasted like real ground beef was used.... and my plate was just as good... The pasta on both is cooked just right, soft, and flavorful. For desert we ordered the cheese cake, and the brownie type desert ( i forgot the name). Damnnnnn so good. \n\nThe place is pricey but really the food is so good.  I think this place has definitely changed my opinion on Italian food.", "author": "Dew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Had a wonderful dinner with my daughter and friend.   Franco the main man took care of us.  He made great suggestions on wine and food.  One of my best dining experiences......", "author": "Frank N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "Great food and Gluten free pasta, awesome sauce, on the expensive side and long wait but well worth it.", "author": "Big Dog T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Look beyond the tacky-formal decor and treat yourself to some deliciously executed Italian basics. We were seated right away on a Thursday evening. We were greeted with warm, attentive service and I was extremely impressed by the quality and the food. I ordered the penne alla norma (eggplant and ricotta, in a red sauce) and it was superb. Even the basic salad that my husband and I split was fresh and was dressed in a nice vinaigrette. My husband's chicken parm was made with fresh mozzarella and he thoroughly enjoyed it. \n\nSure, there are trendier places with sexier decor, but this place just gets it all right and when I want amazing Italian food this is where I'll head!", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "Drumroll please......\n\nIt's time for my *100th* review!!! My first Yelp milestone! I had to save this restaurant's review for the special occasion:\n\nQueen Italian Ristorante! I have been going to Queen before I can even remember. My aunt has had her apartment in Brooklyn Heights before I was born and whenever I came up to NY to visit her, she would always take me to Queen. It has honestly become my favorite Italian restaurant of all time. Now that I live here officially, Queen has become my go to spot for special birthday dinners, celebrations or just the usual mixed Sicilian and Italian family get togethers that seem to happen more often than I would like. I mean, do you know how loud and obnoxious Italians can be?? Sicilians are worse. Yeah, imagine 30+ of them combined in one room... with alcohol... Exactly.\n\nAnyways, on to the food. From the beginning of your meal, the fare is delicious. Who can refuse Queen's famous bread basket? I love the pizza focaccia bread the most. Try to limit yourself to one or two pieces as they can get very filling. The appetizers, such as the frittura mista, baked clams oreganata and the fresh mozzarella, are delicious and made to perfection. I absolutely love baked clams and at Queen, you will find me happily sucking and licking out every last speck of breadcrumb and garlic from these little bivalves. I am also a huge fan of the simple yet savory house mixed salad and broccoli rabe sauteed with olive oil and garlic for appetizers. The main dishes are also expertly cooked and arranged to impeccable quality! The chicken scarpariello, the scallops, the cheese ravioli, the chicken parmigiana (just to name a few) - all completely mouth watering and wonderful! They also accommodate my need for whole wheat pasta and my need for an abnormal amount of cheese on said pasta. Yes, I bastardize my pasta with a lot of grated cheese. I blame my mother. Oh, and don't miss out on that warm chocolate torte of theirs... It's mighty damn fine. I'm drooling just thinking about all of it!\n\nThe decor has always left a little something to be desired with it's plain white tablecloths and mirrors but hey, the food makes up for it and then some. When it comes to the quality of food, I don't care if I'm eating off wooden crates wrapped in brown construction paper. I still find Queen to be very romantic though... maybe I'm just a sucker for candles and dim lighting? I mean, I adore the scene in Disney's Lady and the Tramp where they're eating Italian food in the alley off of a cheesy red-and-white, checkered tablecloth. So yeah, I guess I'm easy to please. Just so you know, I would be Lady in that scene. \n\nEven if you seem skeptical about going to Queen, you should give it a chance. Besides being blessed with extraordinary Italian/Sicilian genes with handed down family recipes, I've also been to Italy 3 times and let me tell you something- very few restaurants in the States can make their marinara sauce taste the same as all those wonderful little trattorias in rural Italy. I can't describe the taste but this place has it. It is pure culinary bliss and I hope you discover it while at Queen too! It is well worth the trip to Brooklyn especially since most of us can't make the trip to Italy with the economy being the way it is... Damn oil prices. So go, salivate, savor and reminisce.\n\nBuon Appetito!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "The food was excellent. Their olive oil was so good I plan on throwing all of mine away now that I know what I'm missing. The service and atmosphere were top notch as well.", "author": "Jake L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Wonderful and fresh! Homemade mozzarella daily. Octopus was amazing and tender. The risotto was cooked perfectly. A bit pricey, but always a wonderful meal.", "author": "Rich S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "I had the lasagna and it was ok. The server said it was a variety of meat but it was mainly veal. The veal/meat did not have much flavor? I don't know if thats how it supposed to be? But it just taste like meat. And it was a big serving, I could not finish. My boyfriend had a seafood blend with red sauce on black pasta, it did not sit well.", "author": "Sari P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "Love this place. I have been going to this restaurant for years and not only is the food great but the service is amazing as well. If you do make it out to Brooklyn and you 're in the mood for Italian, Queen is a must. I live the fresh assorted bread platter they bring and try the linguini with white clam sauce it's one of the better ones in New York I always order it in addition to my main entree.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "From the outside Queen looks nasty...in fact being in the neighborhood and passing it EVERY day on my way home from the train I always glanced and made a face like ewww...but people would tell me to try it, try it, try it its really good...and one day my fiance and I said WTF lets try it. \n\nWow- Queen is EXCELLENT, I would even say its in the top three best Italian in Brooklyn. The food is incredible, the ambiance is of a fine dining restaurant, the owner seems to be there all the time- on top of everything making sure his restaurant is making clients happy. he watches as waiters take your order and serve, he watches as bus boys do their thing and then he comes over and asks if everything is ok. I love when owners take pride in their businesses.  I guess thats why hes in business for so long.\n\nDo yourself a favor and try it- its a little pricey but well worth it! Excellent!", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "This place is a true gem!  Wonderful food great service!  The PREZZO FISSO ( price fixed ) was delicious and a great value $29.95. I would have given 5 stars but they they chased us out at 9:30pm when they closed at 10pm.", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "We have ordered delivery from here many times over the last 1.5 years.  I love the arugula, tomato, onion salad and the eggplant parmesan.  My husband loves their spaghetti with meat sauce and the side of bread that comes with the meal.  Delivery to our apartment usually takes 30-45 minutes which is not bad and its worth the wait. I definitely recommend this place!", "author": "Carey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "We've been walking by this place for years and one Friday night decided to check it out. It's very old-school fancy on the inside.\n\nThere's a cute little old man who greets people.  We sat near the front and I watched people come in... he knew a lot of peoples names.  Many gave him hugs\n\nThe food was excellent. I'm not usually a fan of Italian but this was a game changer. Everything was delicious. Even the bread basket.  The mozzarella was tasty. The polenta and fava beans.. amazing.  All of our entrees were so so good.  We even had the leftovers wrapped up to take home.. something we rarely do. ( I ate the lasagna for breakfast and it was still great) \n\nI guess the only con is that it's a little pricy. (but worth it) It's a good place for a night out but not a regular haunt.  \n\nWhat a lovely place. Wish we would have checked it out sooner!", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "This is our go to spot in Brooklyn when we come from Toronto 3-4 times a year.  You have not lived until you have the made in house Mozzarella - Our server Freddie knows how to wrap 2 balls to survive the flight home!!!\n\nThere is absolutely nothing to object to on the menu!  Choices range from traditional pasta to exceptioonal veal and fish dishes.\n\nGo easy on the bread basket.\n\nThe first time I was here, I was 16 (1974) and had driven up with my grandmother.  She convinced the waiter that it was her birthday (Lie) and she was turning 80 (Another lie) so that I could have a glass of wine with her - which I had.\n\nCan't wait til next visit.", "author": "Larry B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "This restaurant surprise me nicely. The store front looks like a neighborhood dinner and it sits right next to McDonald and across the street from True Value hardware store. Not a pretty street. Inside is simply decorated but clean. But the food is amazing. Portion is also generous. Service is just right. Will try this place again.", "author": "Paula C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Do not judge a book by its cover! From looking on the outside you would be amazed at what you encounter once you enter this place! ABSOLUTELY GORGEOUS! ROMANTIC! The service was great \u0026 the food was amazing! I will definitely be back a few more times! I finally found a favorite Italian place to call my own", "author": "Sliim G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "Came here late night with a co worker after a long days work and the staff here were great. Our waiter was very helpful and did not rush us even though it was 10pm. Food was great. My coworker got the lasagna and she said it was good. Resembled a stuffed manicotti versus a traditional layered lasagna but still good. I ordered a shrimp dish can't remember what its called but that was good too. The waiter was able to adjust my side dish to my liking which was nice. Our waiter warned us that the kitchen was closing so we quickly decided on dessert and canolis won. They were small but good. Good way to end a meal. Would definitely come here again.", "author": "Beatrice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Great food and fantastic service.  My colleagues and I come over from Manhattan to celebrate holidays and birthdays here.  You won't be disappointed!", "author": "Marianne H."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}