{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Wow! We walked in because this was close to our hotel and we won the restaurant lottery.  The food and service were fabulous. Even on a busy holiday evening, we were seated right away. Every table starts with a yummy assortment of breads, the foccacia is to die for (it is topped with a tomato sauce, tasted like pizza). My mother had the chicken parm, which was great, tender with just enough breading, she said the tomato sauce on the side of penne was perfect. I had the carbonara and it rivaled carbonara I had in Italy last year. They had a full bar and my mom got a mixed drink made special,  which came out great, and the creative waiter was even able to melt some chocolate and \"create\" chocolate milk for my two-year-old. Above and beyond in my book! For the location, the food quality, and the ambiance, I found Queen restaurant very reasonable.  Can't wait to bring my husband back!", "author": "Christy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "I went here recently with my boss and a client, after a long day at a health fair in the area. We had gotten a recommendation from the bartender at the Marriott the night before.\n\nWhen we first arrived, we sat at the bar to have a couple drinks and some appetizers. We ordered the fried calamari and the fresh mozzarella \u0026 tomato plate. I don't like fresh mozzarella OR tomatoes, so I stuck to the fried calamari. The breading was very light and tasty, and the calamari was fresh. They brought us marinara for the calamari and made it a little fra diavola - YUMMY! \n\nFor our main course, they moved us over to the dining room. I love bolognese sauce, so I ordered the fettucini bolognese. Well, slap yo momma in the mouth - it's dang good! I ate half of my order and took the rest home. After a 2 hour car ride back to CT, I was very glad that I had brought it home.\n\nThey also give you a wide selection of breads to enjoy, and like everything else, they're awesome as well!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "My boyfriend \u0026 I met in downtown Brooklyn. We had date night yesterday in downtown Brooklyn near where we first met. We saw a movie \u0026 decided to try out this restaurant. The food was great. Loved the shrimp fra diavlo \u0026 the creme brûlée. The service was wonderful. I highly recommend this restaurant. I could see why it's so popular. We look forward to eating here again.", "author": "Alicia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "My wife and I just had lunch. The fresh mozzarella was as advertised by other reviewers and a definite cannot miss. Service was attentive and quick. Pricing was reasonable. I am very happy we gave it a try.", "author": "Tim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "I took my son here on a very busy Friday evening. Clearly you need a reservation and we didn't have one, yet they still accommodated us. The food was great! the service was great! my son (8yrs old) thought it was fancy! lol I will say it is defiantly a spot you will walk past and not even think to stop in. I am guilty of that! lol Next time anyone wants an Italian spot I will recommend Queen, its genially authentic!", "author": "Alycia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Let me start by saying that I DON'T like food.  That being said, it really takes an amazing meal to make me happy.  Queen lasagne made me happy!  \n\nI had been really sick, and we visiting my daughter, who lives right around the corner from Queen.  I was just feeling well enough to eat something, and Italian sounded like a good idea.  Having walked past Queen a few times, I thought we should try it.  She went down and ordered the lasagne to go, with a small side salad.  It came with some bread also.  It was amazing!  I loved every bite.  The salad was simple, but with the dressing, it was killer.  And, the lasagne was the best I have ever tasted  And for me to say that, it really means something, because I really don't like food!  :)  \n\nIf you want something Italian, most any place will do.  But if you want some amazing lasagne that is worth every extra penny you spend, don't miss Queen's lasagne - to die for!", "author": "Margaret B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "We had our anniversary dinner at the Queen last month. The food was outstanding! I've read what other diners have said about the decor, but I Love that \"type\" of decor and ambiance! We enjoyed every part of the experience from the server to the food. My favorite part was the \"little old Italian Man\". (I forgot to write down his name, but he is Sicilian) He was so sweet! (I hugged him on the way out!)", "author": "Julie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "I'll get the cons out of the way because this place is amazing:\n\nThe only con is that this place is super expensive for the neighborhood it is in (and for Brooklyn in general).  The reason though is because all the ingredients are super fresh and very high quality.  If you want cheap food just go next door to McDonalds or Popeyes, which is *literally* next door.  Or just pretend you are still in Manhattan.\n\nAs I said, the food is deliciously fresh.  Try the house Mozzarella as everyone already said.  Also try the anchovies if they have them.\n\nThe waitstaff is *Extremely* attentive and knowledgeable.  Service is amazing.\n\nFinally, while the meal is on the expensive side, they give you a TON of food.  You can take home a whole extra meal with what they serve and have a free dinner the next day.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-13", "description": "Not sure about where all these bad reviews are coming from (some don't even sound like the same restaurant).  I just got back, and based on what I saw Queen is a top-notch Italian restaurant that tries to mix the old with the new.\n\nOne thing I will say first is that if money is an issue, they serve a pri-fix before 6:30pm thats only $26.  Since main courses here are in the $25 range, thats a big discount; but even so the quality of the ingredients, preparation, and presentation in the dishes makes it worth it if you have the money.  Regardless, I ordered from the specials menu and my friend got the pri-fix.  As far as the service goes, it was ok, but mainly I would've like it if the bartender hadn't been staring at us the whole meal (he didn't have much to do though).  The atmosphere was casual and nice, and as others noted the decor sucks.  But be honest: thats not why you come here.\n\nFirst off, the bread they give you is great; long thing breadsticks, sesame seed bread, sundried tomato bread, anise breadsticks, and crackers were all there, and I appreciate that they tried to represent bread from so many different regions of Italy.  For appetizers we had the fresh mozzarella and an arugula-ricotta salad.  The salad was good but wasn't that special in my opinion, though my friend loved it.  The fresh mozzarella was among the best I've ever had.   It had all the right tastes, as well as a level of silky smoothness that I've never had before.  I've had a LOT of mozzarella, so this was particularly impressive to me.  It was also well garnished with some tasty peppers, olives, and soppressata (which was weak but w/e).  We also had a house chianti by the glass which was great.\n\nI had the filet mignon and provolone ravioli (yes, I know) with leeks as my main course, and it was phenomenal.  It came in a delicious brown sauce that complemented the meat perfectly.  It was also well garnished with the leeks, all the flavors had equal time, and all of the different components combined beautifully.  My friend had a veal and eggplant dish which he loved; it was a much more classical dish than what I got, but everything combined in an equally delicious way.  That was the best part about this place; although it was very upscale, it stayed true to its roots as a simple Italian restaurant.\n\nFor dessert, my friend had an espresso and ricotta cheesecake, I had a cappuccino and zabaglione with fruit, and we also got a plate of zeppole sprinkled wth cheese on the house.  The zeppole was a nice gesture, and was lighly fried and tasty, even if I'm not a big fan of them.  The cheesecake was a little disappointing as it wasn't that flavorful, but granted I only had a small bite.  My zabaglione was amazing; perfectly light, with a nice mix of fruit.  The cappuccino could've used some Sambuca, but otherwise was good.\n\nOverall, as you might be able to tell, I liked this place.  It was definitely worth the trip and I will be back.  So many Italian restaurants either try for a gaudy \"old school\" theme where other try for a gaudy \"nouveu\" theme, and neither really works that well in almost all cases (themes in general don't work).  Queen tries to walk the line, and does a pretty damn good job of it in my opinion.  It is what it is, a fusion of old and new.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "The food is wonderful, just like my childhood, the service is also great. They were most gracious for my birthday. I very much enjoyed my evening.", "author": "Gilda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-27", "description": "If you are the in the neighbor for lunch or dinner, then I will recommend to come here.  Service is good, food is great, friendly environment and easy to find parking at the garage only a block away.  Street parking is good if you can find one.\n\nIt's not a bad place to bring your date, too : )", "author": "Ken C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Excellent Italian food!! The bread basket is to die for.  Had angel hair pasta with an exquisite traditional tomato sauce.  Tastes home made.  Great service.  Simple and elegant. The restaurant could use some background music.  Other than that, nothing needs improvement there!!!", "author": "P L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "Food, service, wine, atmosphere-- Queen has it all, and makes you feel like royalty, whether you're there for the first time, or the forty-first! Their eggplant parm is a must-try (and I'm not vegetarian!)-- Portions are generous, desserts are delicious, but do yourself a favor and order the Caprese salad (off-menu), made with their homemade mozz!", "author": "Lori P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Amazing bufala mozzarella. That's pretty much why I come here. The decor could use a little updating though (I feel like it's stuck in the 90s).", "author": "Jason G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Every time my parents come to visit me in NY, they always ask to come here.  Amazing food, great service - one of my favorite spots!", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Genuinely disappointed after reading all the reviews. I've been going to authentic Italian restaurants and had tons of great home cooking in Italian kitchens all over Brooklyn, Staten Island and NYC my whole life.  While the clams and linguini was pretty good, the veal marsala was chewy and tiny, smothered in a ton of mushrooms to makeup for it. The saltimbocca was incredibly salty. The croquettes were good, the bread tasted like store bought, and the foccaccia was incredibly disappointing. For the price, I'd rather go back to Bay Ridge or Carroll Gardens.", "author": "Jj D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "By far my favorite restaurant in Brooklyn, and Italian isn't even my favorite cuisine. First of all, the service is outstanding. My favorite thing on the menu, which is crave, is the artichoke. It's unexplainable how good it is. Last time I went here, they said they didn't have any ready, that they needed to be cleaned and would take so long. When I looked like I was about to cry, the waiter said as long as I didn't mind waiting, he would ask chef if he would do one for me. And he did. And it was the best yet. Salmon entree is the best cooked salmon I've ever had. Also, don't pass the shoe string fried zucchini or desserts!", "author": "Blair L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "A very gentile, sophisticated, yet low pressure environment to dine in.  Superb service, excellent fresh mozzarella (some of the best I have ever had).  Fine dining in Brooklyn Heights. Exfellent bread basket, wonderful gnocchi.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Lovely classic white table cloth Italian. Nice service good food, dynamite flash fried threads of zucchini and yellow squash.  I would definitely frequent this place.  I had veal in a very fresh red sauce w a touch of spiciness.", "author": "Deborah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "So authentically old-school Brooklyn.  Food is really good. Service is not the most friendly you have ever had, but the food makes up for that.  This is a real Brooklyn-Italian experience.", "author": "Stella S."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}