{"aggregateRating": {"reviewCount": 292, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "Food is really damn good- the taste is excellent, and it seems authentic.  The service is less than excellent, though, and the wait can be long...  but the food is worth it.  The scallop dish is to die for... HUGE scallops, polenta, beans with bacon... it is so good, and the scallops cooked to perfection.  Would definitely recommend, I've been here a few times, and haven't been disappointed yet.", "author": "V U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Excellent, lovely shrimp Diablo, Chardonnay and of course the cannoli . A true neighborhood gem!!", "author": "todd s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-08", "description": "I guess my expectations were too high for our Mother's Day Lunch. It didn't help that we were limited to a Mother's Day menu which was very limited indeed, and did not include any of the dishes other reviewers have raved about, nor dishes from the regular menu that I was looking forward to trying. I have had much better food for much less. The best item on our table was the dessert, which was delicious. Although this experience may have been specific to Mother's Day, Queen has lost me as a customer for the unforeseeable future.", "author": "dawn m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "This is one of my family's go-to dinner spots and has been for years. My dad has been coming here since the 1970s and says it has not changed a bit, including the decor. So my sister describes it as dated but delicious. I could not agree more. \n\nDo not come here looking for a chic environment that serves a modern wd-50 twist on Italian cuisine. Come here if you are looking for excellently prepared traditional italian fare with consistent quality. The service and the ambiance may not reel you in, but the food will. \n\nThe food is a little pricy but the quality is worth it, plus they have a price fixed menu if you come before 6:30pm any night of the week (app, entree, and dessert for only $29.50). \nI would say a dinner here would absolutely not be complete without the berries zabaglione for dessert! Every thing before that should be delicious also, but that is definitely the best way to end a meal!", "author": "Alana F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "Came here after calling and asking if there was a wait. I was told there was not. Showed up 8 minutes later and the older gentleman who was in a suit walking around, possible the owner, told us there was a 20 minute wait. This wouldn't have been a big deal normally but there were 7-8 open tables and the fact i had just been told there was no wait. I told him I had just called and he repeated there was a 20 minute wait. Ok fine, maybe there weren't enough servers or maybe the place was bombarded with customers in the time it took to walk the couple of blocks over. But then an older couple who were dressed up walked in and were immediately seated. The gentleman who told us about the wait then came over and said it would be another 10 minutes. We asked why they were sat first and he replied with a very rude demeanor and mumbled something that was incomprehensible but was not that they had a reservation. We were dressed down in jeans and were 3 younger girls. There is no other explanation for how we were treated. There is no reason to treat anyone that way who wants to support your establishment. We left of course and will not return.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "I am NOT a fan of Italian food, because I always feel lethargic and heavy when I eat it, but Queen Italian made me a believer. Don't be fooled by the location and exterior, this place is a gem! The owner is like something out of an old movie and the decor is classic. Their menu is overwhelming, but you really can't go wrong with a single thing. I don't even know where to begin. The ink pasta with seafood is a MUST! \n\nI wouldn't necessarily call it family-style dining, but you should take your family and dine the hell out of this place. I left fat and happy.", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "Pretty disappointing. I pass by this place often on my way to trader joes off the 4/5 and decided to check it out one night. The waiter overcharged us an obscene amount to change the mozzarella appetizer (just wanted tomatoes instead of peppers). Shouldn't have been such a significant difference in price. The entrees were just okay but the bread and wine were excellent. I don't think I'll be coming back, way too expensive for what it is. Comparable to NYC fine Italian dining prices.", "author": "Ally G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Excellent chicken parm! \n\nI came here with a party of about 15 for my gf's bday. The bread was deadly good as was the fresh mozzarella. Everyone got random dishes and all thoroughly enjoyed it.\n\nIt's really hard for me to find a good chicken parm and this place was easily a 4/5 on that. This is a repeat place but keep in mind that it's slightly on the pricier side.", "author": "Geoff P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "My girlfriend and I were really excited to try this old-school Italian restaurant. Having grown up in New York, I've always had a sweet spot for Italian-American places that don't attempt to be fancier than they are. \n\nQueen Italian thoroughly disappointed. \n\nWhen we walked in, there was no host to greet us, and waiters completely ignored us. When I finally got someone's attention, and let him know we had reservations, the man explained that it would be a few minutes, and eventually gestured to a waiter to bring us to our table. \n\nOur menus came quickly, but then there was a long wait until anyone checked on us or asked what we wanted to drink. Our drinks came out quickly, but, again, there was a very long wait for anyone to ask for our food order. \n\nAt this point we nibbled on what was a tasty bread basket filled with semolina, focaccia, bread sticks, and a darker-colored bread. The olive oil with infused rosemary was good as well. \n\nWhen the waiter finally came and asked what we would like to eat, we ordered the fresh mozzarella with grilled shiitake mushrooms as an appetizer to share ($16). I ordered the shrimp fra diavolo and my girlfriend the linguine with clam sauce. \n\nWe waited what felt like an eternity for the appetizer to come out. The waiter brought over a platter, broke the mozzarella in half, and served each of us a lobe along with the mushrooms, a couple olives and basil in a balsamic vinegar sauce. It was definitely tasty fresh mozzarella -- we enjoyed this course. \n\nAfter yet another long wait, our main courses came out. This is where things went downhill. The sauce on the shrimp dish was sorely lacking in flavor and really watery. There were also only a handful of shrimp, and the pasta was done well past al dente. Given the $27 price tag, I was really disappointed this dish wasn't better. \n\nThe sauce on my girlfriend's linguine was tastier than mine. It had a nice roasted garlic flavor. But the clams were really fishy, and didn't strike either of us as particularly fresh. We eat shellfish quite a bit, and found this to be quite lacking. Again, at $23, this should have been solid. \n\nIn a not surprising turn of events, it took some time for our dessert orders to be taken. We chose the zabaglione, which was tasty. The portion was definitely good for two as well. \n\nIt took at least twenty minutes and several attempts to flag our waiter down in a bid to get the check. \n\nIn sum, we both felt very disappointed over the service, quality of food, and price point.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Solid 4.5 stars (5 stars for Veal parm).\nAfter an incredible meal at Carbone on Friday I suddenly realized that in all these years I never wrote a review for Queen. Unlike Carbone this isn't trendy re-created authentic old school NYC Italian, but the absolute real deal (don't get me wrong, Carbone is fantastic, but Queen is every bit as good, and a few hundred dollars cheaper).  Yes the places is dated, but it is appropriately and properly dated in a way that an proper old school Italian joint should be (down to the old waiters in the traditional waiter outfit); it just feels right for the meal you are about to have. They should never change a thing.\n\nThey start you off with an incredible bread basket....but try to pace yourself as this place does not skimp on portions.\nWhile we have tried a wide range of dishes here, what brings us back again and again is the phenomenal veal parm.  It is ginormous and perfectly cooked every time...and oh that sauce..unbelievable.  It is truly perfection.  In fact it is so good that it has ruined all other places for me....including the $55 veal at Carbone which just couldn't match up.  The eggplant parm is equally good for those of you opposed to yummy veal.\n\nDamn, now I have made myself hungry and may need to go tonight!", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Lovely food and great service. This restaurant features a great menu and well executed food. I really enjoyed my calamari and shrink as well as the sole.  The restaurant is priced reasonable and the service was attentive.", "author": "Bryant R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "So I heard about this restaurant while chatting up with a lovely older couple in the neighborhood. They said it is the best Italian restaurant in the city, so I had to try it for myself. For the appetizer I had the baked clams and the homemade mozzarella with anchovies. The mozzarella is fresh and anchovies were definitely tasty, however the clams were on the ok side. The free bread was also ok, it wasn't anything exceptional, tasted a bit like store bought.\n\nFor the main we tried the lasagna and chicken parm. Both came in big decent sizes and lots of melted cheese, however the taste was quite bland, and it tasted like reheated food, not fresh. The meat of the lasagna looked kinda grayish and was lukewarm. \n\nThe service here is attentive, that being said it wasn't very busy when we were there, and all the waiters and bus boys were just talking on the phone or talking loudly with one another. It doesn't seem very courteous to the few customers who were dining there. \n\nI'm sorry to say but Yelpers you have confused me with this one!! I'm hoping this is just a one off kinda night!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-01", "description": "You might walk past Queen every day and not even notice it...but that would be a big mistake!\n\nThis restaurant seems so out of place with all the other \"hole-in-the-wall\" bars and fast food joints on Court between Atlantic and Borough Hall. Once you step inside, it's like being in Italy...you're greeted by an attractive and friendly host who brings you to a table in the surprisingly larger-than-you'd-think space. Waiters in uniform bring you menus, water, and an overflowing bread basket (try one of everything...trust me). The menu is massive, and very authentic with lots of Italian words, and some over $20+ per entree prices...but don't be turned off by that. The food is actually worth it! \n\nI ordered the Pollo Alla Parmigiana Served With Penne ($22) and an enormous piece of white meat chicken covered with the most delicious red sauce and still-bubbling cheese along with a side bowl of pasta was delivered to me. I thought I'd have to take at least half of the dish home with me, but no, it was SO GOOD that I embraced my inner beast and ate the entire dish. \n\nDessert was just as wonderful...my friend and I shared the Tortino Di Cioccolata Warm Chocolate Tort Served w/ Homemade Vanilla Bean Gelato \u0026 Fresh Raspberry Sauce ($8.50) and it was perfect. Just perfect.\n\nI really cannot wait to go back! Bring your friends, bring your family, bring a date...just go to Queen!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I have been eating at the Queen for 35 years. Their food is wonderful and fresh. Staff is friendly and helpful. I love their chicken scarpariello and their artichoke appetizer.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Whenever I'm in Brooklyn, I have to go to Queen. The food is so yummy. I love the man who greets you and seats you at your table, he is so sweet. The homemade mozzarella is the creamiest I have ever had. I've tried the chicken parm and the gnocchi. Both were super delicious, but I still think about the gnocchi months later. The service is really good and the atmosphere seems fancy, but they welcome everyone.", "author": "Kelly R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "Queen was recommended to my party of four. \n\nI was surprised to find an elegant restaurant almost next door to Popeyes.\n\nWe initially believed that we were going to be joined by friends, and so ordered a table that would accommodate four more -- a nice, large table for eight.\n\nOur other party did not join us, and a cute older gentlemen in a suit checked on us often -- are they coming? No? How about your party...are they coming? No? Okay, you call them and check if they're coming. \n\nEventually, Mr. Cute Older Gentleman gave up asking and it was not an issue, as the restaurant was not booked to capacity. Thank goodness for us! Because...there was an accident at our table. One of the waiters spilled coffee on one of us. HOT coffee. All the waiters freaked out, and I calmly asked for ice. They brought ice and napkins and helped with the cleanup. I could tell they were praying/hoping/panicking that our person did not receive a 2nd degree burn. \n\nOkay, so there was that.\n\nFOOD: The food was surprisingly good!  Very traditional New York Italian restaurant that give their food the respect of making it well before serving it to you. Everything...I mean, everything...from the bread basket, to the coffee (yes, even that), was delightful. Everything is created with respect and care. For this alone, I would return.\n\nBecause when we received our check, there was no deduction for the coffee accident. No complimentary dessert. Nothing at all was comped. I have to emphasize: the accident was VERY bad, but we did not want it to dampen our collective mood. We kept our conversation \"light\" and pleasant after the accident happened. Our hot coffee victim superhumanly kept calm ... she had just flown in from Paris and was staying a short while.\n\nThe waiter who delivered the check almost immediately returned to pick up the payment. We let him know that we had not yet provided payment inside the guest check folder, as we were still making pleasantries to make up for the earlier coffee scare.  And we told him nicely, with a smile, \"Not yet.\" His answer: \"Well, THAT'S NOT GOOD.\"\n\nSo we provided the payment and that was that. No final thank yous or apologies from the staff. \n\nAgain, the food is good. But a VERY HOT coffee spill on SKIN...you have got to adjust your service with your guests once you make a mistake on that scale.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "You can't really go wrong with pasta and a glass of wine. Queen is a nice spot for a date night. The food tastes very fresh, homemade and filling. The owner is the host who seats you when you come in, and he engages with the customers which is nice to see. The menu I feel is a bit limited though, and also overpriced for a casual restaurant. Good option if you're in the area, but personally I've had better Italian food elsewhere.", "author": "Katherine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Had an incredible night at Queen with family and friends for a rehearsal dinner.  Every bite we took was wonderful, and the service is fantastic!  I loved everything but highlights were the fresh mozzarella, chicken parm, veal and sausage, fresh fish, minestrone, and to die for desserts- light as air ricotta cheesecake with a remarkable fruit sauce on the side, chocolate cake with fantastic raspberry sauce, orange panna cotta... Thank you Michael Vittiello for a memorable meal!", "author": "Kate L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "Excellent service and amazing food. Everything is made from scratch right there in the restaurant. Fish delivered daily and cheese made there as well. This place is 54 years old and they are as authentic as it gets.\n\nI had the gnocchi and veal and the veal chop. It was amazing. I know I'm greedy.", "author": "Keyshaun S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Wonderful find in Brooklyn!  Everyone was so kind and concerned that we had a great experience. We had the cheese ravioli and the chicken with vermouth cream sauce. Oh my gosh....both were perfect!  Food, service, atmosphere and friendliness -- this place has it all.", "author": "Marty S."}], "servesCuisine": "Italian", "priceRange": "$31-60", "name": "Queen Italian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7Yhhz938vfSN-DOeMA6sIw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965955"}