{"aggregateRating": {"reviewCount": 81, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-11", "description": "Twenty cents extra for flat bread. Really?? Its not worth it. Subway has better flat bread.", "author": "Beverly R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "This was my first visit to a Potbelly Sandwich Shop.  Overall I like it... Decent sandwich and good price (not much to dislike)!  I also like that the bread is toasted.  Unfortunately, there just seems to be something missing that takes this place beyond three stars.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "I enjoy the meatball. You can reduce your carb intake by ordering it \"thin.\" They essentially take out some of the bread. The hot peppers are very hot so order them on the side. The ice cream sandwich is everything but over 1000 calories, so yeah I'll pass. A great bite if you want something quick and delicious and ok that it isn't the healthiest. Also I paid $6 for my sandwich. Where can you get something to eat for under $10 these days?! Oh btw, the oatmeal chocolate chip cookie is everything!!!", "author": "Sheryl W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "First time to a Potbelly and it was decent. I got the works and added mushrooms and cheddar cheese. Got all the fixins except for onions (not a raw onions fan). Overall the sandwich was good, but a bit too wet (I think I will skip the Oil and Mayo next time). The mushrooms were lacking, so I would suggest skipping the extra $ for that as well. I also got the sandwich with less bread and I didn't miss it, so if you are watching your carbs, definitely consider that as an option. \n\nSince it was my bday lunch, I splurged and got an Oreo shake but it had a very metal-y aftertaste (must have been the blender or something.) I think I will skip that next time. Overall, it was a good sandwich at a reasonable price. I am not a full fledged fan, but it hit the spot. I may give it another try.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "I pass this place on the bus all the time and never tried it. Today I stopped in around 12 pm and the line was crazy long but thanks to a waiter taking orders on the line, it moved pretty fast. I ordered a 6 inch tuna sandwich with pickles, tomato, swiss cheese, and mustard as well as a bag of Louisiana-style hot kettle chips. Meehhhh it was okay. I honestly could get a sandwich from the mom \u0026 pop bodega near me that tastes the same. I have to admit though, the tuna they used tasted so fresh. I have not had tuna like that in years. Anyway, the concept reminds me of Subway, just with a larger variety of chips and drinks. The music was pretty cool and I also enjoyed the vibrant colors of the place. Plus there were more than enough chairs to sit down and eat. Overall it has a nice vibe but when it comes down to it, its an average sandwich store with loud music and nice decorations. I wouldn't go out of my way to come here.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-10", "description": "I am a Potbelly pro. I know the drill, I know the menu, I know what I want. Other locations are amazing, but this one is absolutely horrible. The customer service is atrocious.\n\nFirst time I ordered here the girl doing the toppings had no idea what she was doing. I literally had to stand there saying NO MAYO, YES MUSTARD, NO LETTUCE, etc. I gave her the benefit of the doubt maybe it was her first day.\n\nToday I ordered again. All I wanted was Turkey with cheddar on thin cut white bread. Somehow it ended up as a FLAT, which I specifically told the iPad guy I did not want. \nThe guy doing the toppings was not paying attention and was talking to another employee as he was making my sandwich. I had to repeat several times that I dont want mayo or lettuce. SEVERAL times. What do I end up with? MAYO...tons and tons of MAYO, and no mustard in sight even though I specifically said mustard. The sandwich is absolutely ruined. It's not what I ordered at all because the employees are lazy and do not pay attention. \n\nI have never experienced such terrible service. Like I said above, other locations are amazing, attentive, they listen and care. It's part of the potbelly experience. This location is absolutely horrible. I will never come back here again. Manager, please fire everyone immediately and hire competent people.", "author": "Lena K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Definitely a friendly and enthusiastic crowd - They just opened, so give a few weeks before they turn sour.\n\nDefinitely chaotic and working out the kinks - They just opened, so give a few weeks before they spit your sandwich out in a matter of seconds.\n\nAbsolutely nothing to rave about - think a slight upgrade to Quiznos.", "author": "Christian V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "I have lived in New York all my life, and this is by far the worst value I have ever experienced in any sandwich I have ever bought.\n\nI ordered a meatball sandwich on whole wheat, with toppings : lettuce, onion, humus and red pepper.\n\nThe final price was $7.40.   For that I got about a tablespoon worth of tasteless meat, cheap ketchup-like tomato sauce, and the other toppings were not noticeable.\n\nThe only thing you tasted was the bread, which was like mushy, soft Wonder bread, comprising 99 percent of the sandwich - and this was after ordering the \"Thin\" which meant that the counter guy ripped some of the bread out of the middle with his hands.\n\nThey also put it through a rolling toaster ( like Quiznos ) which had no effect whatsover on the sandwich.  It was also slow to make, even though I was the only customer.\n\nThe punchline of this joke is that all their marketing boasts of the huge portions.\n\nI am astounded that a place this bad could stay in business in New York City.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "I was at a nearby travel meeting and this place was at The right time and place I got the chicken cheddar on whole grain they toast the entire sandwich then add the toppings u want it was delish the small one was big enough even as I was starved", "author": "Diana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "Always friendly service when I go in. The Mediterranean sandwich is awesome and I love a nice black cherry soda with my meal. The cheddar and broccoli soup is great as well. The cup was more then enough. No need to get the bowl. Stop in on your next lunch break.", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "I've never been to a Potbelly Sandwich shop before...and was thrilled to have a chance to try it today at their Oven Warming charity opening. The staff could not have been more enthusiastic or welcoming, and the food was fast and delicious. It's a cozy shop, and it couldn't feel farther from the hustle and bustle of Downtown Brooklyn. It was a little oasis of warm and friendly energy, AND, they even have a performer singing and playing guitar for everyone! What a great place for lunch out, or a quick take out!", "author": "Shira R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Food is excellent, service is subpar. I used to eat at the original Potbelly's in Chicago so this is long time favorite. What separates them from the pack is their exceptional bread/rolls, milkshakes and cookies (both sugar and oatmeal chocolate chip). Their salads are also very good. This particular store doesn't seem to be particularly busy which may contribute to the lackadaisical service. I walked in and the woman at the counter walked into the back room and proceeded to ignore me. Another worker walked by me and grabbed a cookie which they proceeded to eat while talking on the phone outside of the store. Having eaten at many Potbelly's throughout Chicago, this poor service is very unusual. Oh well. Still a good sandwhich. Total tab for a regular turkey with chips, shake and cookie is approx $10.50 before tax/tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "Friendly staff. OK sandwich. Clean appearance", "author": "Taina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "UPDATE from my previous review: So the delivery today for my sandwich took TWO HOURS to get here, the order was wrong, I was grouchy. I came on to write a scathing review. \n\nThen twenty minutes later? Delivery person comes back with a hand written note from the manager, a bag of their oatmeal chocolate chip cookies and vouchers for free food for the future. Apparently they were understaffed and the manager wanted to apologize for the delay. That is customer service right there. I've never gotten that kind of an apology and they win back my loyalty. Plus, dude, these cookies are amazing.", "author": "Shoshana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-30", "description": "The food is delicious here, but the delivery service is lacking. The first time I ordered, I ordered 5 sandwiches and only received 4. I had to call back and wait for the sandwich. The second time I ordered, I was told it would arrive between 1:00-1:15 pm. My order did not arrive until 1:55. When I called to ask the status of my order, I was informed that there was only 1 delivery girl during lunch hours making deliveries.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-17", "description": "I was excited to try Potbelly and decided to take a late lunch to avoid the line.  I believe this is their second day of being open.  I was highly impressed with the friendliness of the staff and the efficiency of the line - I really like the flow of the ordering process.  However, I have to complain because when ordering I specifically asked the woman taking my order if the \"mushrooms\" in the Vegetarian sandwich were portobello mushrooms and she told me yes... when I got back to my office and unwrapped my sandwich I was so disappointed to find that the mushrooms were white mushrooms, the kind you put on a pizza.  If I had known this then I would have ordered something else, as I'm not a vegetarian, I just love portobello mushrooms.  Disappointing.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "So this is my second time in pot belly. I think the sandwiches are really good; the service was better the first time.  My first gripe is today I watched another worker by the name of CaRRyAnne ignore customers when the entered the store, walked away when she was asked to assist with dressing the sandwich. She spent most of her time fiddling with a machine In the back room. Even when she finally came out front she was a ball of giggles. Clearly this young lady thought very little of her co workers or her job. My second gripe is there's too much hair around the food. They all had scarves on the heads but that defeats the purpose if your hair is hanging down your shoulders and back. I don't want to give up on this place but the owner really needs look at who is representing them. A big thank you to the young lady that took my order and made my sandwich from start to finish, especially since there was other customers waiting. I'm going to give pot belly three stars for food however; due to CaRRYAnnE you loose two stars.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "The food is decent, but they get the new flatbread and every time I order it, it's either not available or it's frozen (really?) at lunchtime.", "author": "Jean H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-23", "description": "Saturday lunch in an area that surely gets way more traffic during the week. That is to say, it should be easy to accommodate the small (six persons?) line.\n\nHardly.  I waited, and waited, and waited some more.  All told, I think I was in there twenty minutes for what should have been in and out, five to ten minutes max for a \"fast\" food sandwich shop.  They need more people working, or the people who ARE working need to be way more efficient.  This is ridiculous.\n\nMy \"toasted\" sandwich was cold and dripping with oil from the giardinara.  Total fail.\n\nOnly bright spot: the sugar cookie, which was just as delicious as the ones I used to get at my favorite Potbelly in Chicago.  I'll wait and go back to that one next time I'm in the Windy City and need a sandwich.  Never again here.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "My wife and I are huge fans of potbelly which is why we were very disappointed to find out that they are open longer on weekdays than on weekends. They close at 7pm on a summer Saturday night. Very, very disapointing that's why they only get 4 stars from me. I guess no potbelly in my belly tonight.", "author": "Orlando A."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Potbelly Sandwich Shop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UPHgxgq4a1IG7CquHjqeTA/ls.jpg", "@type": "Restaurant", "telephone": "+12128971872"}