{"aggregateRating": {"reviewCount": 81, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "The sandwiches are tasty, fresh and not too expensive.\n\nBut, alas, they are not a good value. For almost six bucks, you get a slightly over six inch hero that's not exactly overflowing with ingredients.\n\nToo bad. If I could only be assured that a single sandwich was big enough to sate my lunchtime appetite, I would be back often.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "This place reminds me a little of Quiznos.  No wait, a lot like Quiznos except better.  Why, well they have prerecorded music as well as live music at the same time.  Where else can you listen to two different songs at the same time while eating a sangich? \n\nThey don't have a huge menu which I like because I can't make my mind up to save my life.  I appreciate the fact that they have \"premium\" toppings but cucumbers are premium? \n\nAll in all the experience was great.  Loved the sandwich and the service.  Friendly and fast.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "It's become a tradition of mine Roast Beef ~ double the meat, provolone cheese. Add everything sans mustard.\n\nI also think that their ice cream sandwiches are a great deal.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "This is a solid choice for seamless delivery in the Downtown BK area.  The delivery person is always pleasant, it's pretty quick, and they never mess up my order.\n\nEmbarrassingly, I've tried every sandwich on the menu but my faves are the It's a Wreck or the PBnJ when I'm sick.\n\nIf you want something sweet go with the cookies because the milkshakes and  smoothies are horrible.", "author": "Monique H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Their Farmhouse Salad and Wreck Sandwich are my favs!", "author": "Taheefa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "Went here and they must've had a heating issue because it was so hot in there that I felt nauseous. Sandwiches were mediocre...but with how stuffy the place was, I couldn't even really focus on the taste because it was so uncomfortable in there. Not planning on going back.", "author": "E L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "It's okay I guess. I got the chicken salad sandwich with everything on it. The fillings were pretty good for the most part, but the bread was too crispy/burnt on the edges. meh I like the chips more than the sandwich. If I had to order from a sandwich shop, I'd rather have Subway.", "author": "Ani T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "This sandwich place is similar to the one in Wall Street (of course, they're branches of the same group!). I liked and enjoyed their version of roast beef sandwich with everything on it, which I had with black coffee. The interiors look neat and nice. They've got outdoor seats so I took one and had the chance to enjoy my sandwich with my friend. It turned out to be more fun as I saw a lot of very good-looking people passing by LOL....", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-13", "description": "I've never even heard of Potbelly's until it showed up downtown, but judging by the name, I figured I would be hit with all kinds of crazy sandwich, chips and drink combinations.  Not to say my experience wasn't good, but the sandwich selections were pretty plain and it wasn't big enough for me to have a Potbelly.\nThe customer service was great, and the chocolate brownie cookie was the best part of the meal.  I like the addition of toppings, but I definitely won't be running somebody over to have another sandwich here.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-06", "description": "A model of inefficiency.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-10", "description": "Don't come here for salad. At least 2 of the 3 salads are premade and in the fridge, chicken salad salad and wreck salad (lunchmeats). Even though they made my wreck fresh, the veggies weren't fresh. I'm rating it a 2 instead of a 1 because service was nice for fast food. I won't be coming back again.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-16", "description": "First time ever having Potbelly.. it was a mediocre experience. The opening was done well considering how chaotic the whole place was. They took orders fast and for the amount of people, the line moved along really well. \n\nBased on other reviews of Potbelly, the Wreck sandwich seemed like a popular choice. I went with that and a cup of chili to satisfy my love for all things chili. The sandwich was decent, the hot peppers was definitely a lovely addition for a little bit of kick. The chili.. it's just not my type of chili. I felt unsatisfied. I think Potbelly is a wonderful addition to the downtown Metrotech area but this won't be a place I frequent very often. I took a glimpse of the nutritional information on those sandwiches and taking in about 1500 - 2000 mg of sodium is just not going happen.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "this store has the worst customer experience i've ever encountered. i had been ordering online for delivery to work for over a year. then one day after receiving my food, i began getting a barrage of worried phone calls from their store, turns out they deleted my payment and needed to interrupt me to get my credit card info again. for my trouble, i was told to call the store next time and i would get a free sandwich. \n\nnext time i called to get my free sandwich i was told my address is out of their delivery zone. this seemed strange since i'd been ordering delivery online for over a year with no trouble. then today, when i ordered online, like i'd been doing for over a year, they called me over half an hour after i ordered and said they weren't bringing my food. EVEN though they owed me a free sandwich, and EVEN though i was hungry and had been waiting for them. EVEN though i was able to order online without any problem and it said my order was coming. AND EVEN though it was 3:30 in the afternoon and I know their store wasn't busy. the phone was passed around to 3 different people at their store, and i had to explain the issue each time. \n\nthis was clearly a new policy, and i understood. they didn't have the capacity to have their delivery people come out this far. BUT AFTER ALL OF THAT, they couldn't honor this one order? this one time? after they owed me so much?? that's all i was asking for, and to boot, the women i spoke with on the phone had a serious attitude. it was as if she was taking it all personally. \n\nthat is not customer service. they are ass holes.", "author": "Rachael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "I came in after a hard workout and couldn't make up my mind with a little help the staff happily assisted and also offered to buy my meal because it was my first visit. Great Job guys. I plan to visit everyday after my gym visit. Thanks guys!", "author": "Ty G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "Horrible customer service. Disinterested, slow and unfriendly. Don't really listen to customers and don't pretend to. As it is, i like potbelly sandwich shops, but this one is unfortunate.\nThis is in stark contrast with other locations (in the city), where the staff is very cordial and professional.", "author": "dulcinea t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Taking a lunch break from jury duty. Ordered Big Turkey on multi-grain roll with the works. Huge sandwich. Very satisfied. They even loaded on the hot peppers; spicy.  Again, Potbelly didn't disappoint.", "author": "Wintsun T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-25", "description": "Standard sandwhiches.  I can't understand why the lines are so long for this and the Maiden Lane location in Manhattan when there are so many places to get a sandwhich.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-02", "description": "The sandwich selection here is nothing special and the service is above average. It reminds me of subway when they first opened, you know, the novelty of a new sandwich shop that's supposed to be healthy.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "I ordered a sub from Potbelly and I guess my expectations were too high, the sandwich was the most boring and plain one I have ever tasted. I honestly think I could have made one better myself. \n\nOther than the not-so-good sandwiches,the staff was great and friendly, but I dont think I'll ever step foot in this establishment again as long as Subway still exists.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "First time trying this place and I can honestly say it was DELICIOUS !!!! Their chicken breast and cheddar sandwich was HEAVEN !!! Also their raspberry lemonade and chocolate brownie cookie was delicious too !!! I work up the block from it and always see people going there ! I will definitely be coming back !!!!", "author": "Gabrielle G."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Potbelly Sandwich Shop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UPHgxgq4a1IG7CquHjqeTA/ls.jpg", "@type": "Restaurant", "telephone": "+12128971872"}