{"aggregateRating": {"reviewCount": 81, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "Had to work around this area today and wanted to try something new. I have to say I was not disappointed.  For breakfast I had the egg sausage cheese sandwich and it was good tasting and filling for less than $5. Which in this area now a days is rare. \nI went back for lunch and had the pick your pair for $9.50 plus tax. This time I ordered the farmhouse salad and the tuna sandwich both were good. For the salad I did like the buttermilk ranch dressing more than the vinaigrette I had to begin with. Place is clean. My order was processed in a timely manner. \nWill return to try the rest of the menu", "author": "Ana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-20", "description": "Pickles are great. \nSandwich is similar to subways. I think subways gives more meat than this place. \nThe design of the restaurant is different. \nCookies are slamming. \nCustomer service at the register is blah. They don't really interact at all nor offer the deals.", "author": "Yajaida M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-13", "description": "Always consistent.  Good lunch spot.  \n\nThe line moves fast and I'm still a big fan of their hot peppers! Always a must on any sandwich. \n\nIf you're lucky to be serving your civic duty; this is a quick lunch spot and they serve a nice milk shake (for when you just cannot deal with that crowd down the block at Shake Shack). \n\nPSA: their sandwich size may have shrank... so go the big.", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-06", "description": "I was exhibiting at the Middle School Principal's Conference at the Marriott next door and came here for a bite to eat after packing up.  It appeared to me they were understaffed because there were a couple of people ordering and waiting when I arrived.  I placed my order, a big turkey sub, with one employee and started to tell him the toppings I wanted.  He stopped me and said I tell the next person what toppings I wanted.  \n\nSo I step a few paces to my left where I proceeded to wait about 5 minutes for the other employee to get to me.  She was preparing other orders ahead of mine.  I tell her I want cheese, lettuce and tomato.  I then pay and sit and wait.  \n\nI have to admit the wait was worth it.  The sandwich was hot, with toasted bread.  It was juicy and tender, excellent.  They really should have another person working to prepare sandwiches because if 3 or 4 people walk in with just the one, customers will have a wait on their hands.  However, I would return for the sandwich quality.", "author": "Philip R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Very convenient to the courthouses and the line actually moved pretty quickly at lunchtime.  Seating can be a massive pain to find if you're eating alone but I was fortunate enough to find some and didn't feel like I was being rushed out the door while I had my lunch.  It's definitely not the largest location but the food is pretty good and the staff was on top of things so my experience overall was good.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "I never understood why the counters are so high.\n\nPotbelly is like subway's older, more sophisticated distant cousin. The hot sandwiches here are really delicious. I always go with the chicken cheddar sandwich. It's tasty and fills me up. They also sell Voodoo chips! If you use the app, you can easily rack up points and perks.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "Well that was disappointing. \n\nI've worked in this area for what seems like a lifetime.  Today was the first time I visited Pot Belly since it opened years ago, and again I'm disappointed. I might have set my expectations too high, but their sandwich fell short. The quality was along the lines of Subway or Quizno's (are they still open?) with a hefty price tag. I had the grilled chicken and cheddar and it was just ok, for this area with so much competition I expected something more tasteful and filling.  \n\nOn the bottom of receipt they have a coupon for half off a breakfast sandwich, that deal doesn't even make me want to come back that's how disappointed I am in their food. \n\nIf you're in the mood for a sandwich save the time and money and keep it moving.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-15", "description": "Nightmare.  Cooler AND fountain drinks out for over a week, prob longer.  What an amateur operation at the top.  Ive found the people who work here fine btw.  This time I walked in, then walked out.  I used to go to the original location in Lincoln Park before expansion, my how this has devolved into a soulless operation destined for the garbage pile.  App is horrible and amateur.  Good luck with all that.", "author": "Jelly B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-12", "description": "I came here \u0026 had the cheddar broccoli soup in a cup ($4) \u0026 a turkey club ($7.50+$1.55) even though the soup is in a cup which is the smaller portion compared to the bowl, I just feel it was very small for the price \u0026 I can tell it was straight out of a bag. The sandwich just had turkey, lettuce, tomato, cheddar, mayo \u0026 bacon \u0026 I wasn't impressed at all. When I asked why is the $1.55 added the cashier stated \"because it has like more expensive ingredients\"...what's the more expensive??? Mayo or the tomatoes? The sandwich size was the original, but I felt compared to other restaurants sandwich portion sizes, this was smaller \u0026 definitely not worth $9.05. It was also weird the cashier didn't ask me if I was staying or going nor offered me a bag, but after I swiped my card he proceeded to hand the gentleman behind me a bag, before even finishing up with my transaction \u0026 I had to ask for a bag. I guess he expected me to walk out with a soup, drink \u0026 sandwich, in my hands?!? I definitely wouldn't return, nor recommend this to anyone.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "I got a sandwich here last weekend when visiting new york for the first time. Decent.", "author": "Tyler J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "This Potbelly is conviently located near the Metrotech complex where I work.  My co-workers and I have made Potbelly a staple in our lunch rotation.  \n\nThese aren't fast food sandwhiches like your local Subway!  These are honestly great, premium, lightly toasted, and inexpensive sandwhiches that never fail to satisfy our cravings.  My personal favorite is the pizza sandwhich which consists of meatballs, pepperoni, mushrooms, proviloni and a delicious red tomato sauce.  \n\nI always get a Potbelly cookie with every meal.  These are undoubtedly great homemade cookies with a soft middle and crisp top.  If there is any reason this review is getting 5 stars it would because of the cookies.  \n\nWe come here regularly and have received conistently high quality in the food and service.  As long as we work in Metrotech we will be coming back to Potbelly.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "I had been meaning to try Potbelly for a while but it seems like I only pass by them on weekends and depending on the location they're either closed altogether or close ridiculously early.\n\nI was at employee orientation around the corner and wasn't quite sure where to go for lunch...I always liked Hill Country Chicken (still salty they closed) and I didn't really feel like Shake Shack. I was gonna go Panera but saw this about 2 doors up.\n\nPotbelly reminds me of Quizno's in their heyday before they started sucking and most (if not all?) went out of business. I had the club and it was delicious...albeit a bit overpriced.\n\nI might come back again if I'm in the area at lunch but I think tomorrow I'm gonna try something else in the area.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "there sandwiches are  just great ..... i love there pastarami sandwich and there bacon sandwich......right convenient near the downtown brooklyn area (fulton street mall/city point shopping building) and right on adams street the path that leads you too Brooklyn Bridge (gets very busy around during the 12:00n p.m.-noon hours during weekdays ,because the courts house in downtown bklyn area and the retail stores sales-associate all seem like there go on there  lunch breaks around the same time) its block away from the biggest Marriott hotel in brooklyn and this restaurant right across the street from brooklyn borough hall, there have a next potbelly sandwich shop in lower manhattan near the wall street area there pretty good as well too i've been there as well\n\n\nthe B41,B38,B25,B103  buses and etc buses lines go here to this potbelly brooklyn location !!!!!\n\n\n2,3,4,5,R -trains stop here at the Borough hall station one block away from this restaurant.\nA,C,F -trains stop here at the Jay street /Metrotech station,under the Marriot hotel pathway bridge.\nB,Q,R-trains stop at Dekalb avenue (but it's a good walking distance from the Dekalb avenue station, i advise you get off dekalb avenue and transfer to the R-train  across the platform  and take the Manhattan bound R-train to Metrotech street/Jay street) which is closer to this Potbelly location !!!!", "author": "L L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "I'm sorry $10.50 for a 6\" sub with no meat and 1/2 the iced tea ((Arizona)) for $2.30\nNot worth it. Friendly??? Not here too busy talking to each other and it's 3:30. \nFood was ok just way overpriced", "author": "Ron K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "Got a \"BIGS\" pulled pork sandwich.\nThere's nothing big about this sandwich. Barely any meat and almost no vegetables. $10 and not even remotely close to satisfied. Felt completely ripped off.\n\nThe flavors are okay.", "author": "Anton D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "I ordered a pizza sandwich and it was delicious, they also made it pretty quick. The staff was friendly and the restaurant clean. \n\nOn the receipt there's a $3 off a sandwich or salad for the next day, super tempted to return.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "I ordered salad from them TWICE AND BOTH TIMES my chicken salad turn out to be no chicken, no dressing . Each time I need to go back there and ask for the chicken to be put in. I don't understand this. Last time this happened I could go back.. but I can't the second time since I'm literally 2 hrs away from the store. This is ridiculous. \n\nThe picture below is their Mediterranean Salad that comes with chicken. They out croutons in there but NO CHICKEN and NO DRESSING.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Ever since I first had my belly in Washington DC several years ago I hardly ever pass up a chance to enjoy it.\nThey make great sandwiches and the atmosphere is excellent and very friendly service and very fresh food. Today I enjoyed a big wreck on multigrain. Such a nice accent to my trip to Brooklyn a rarity", "author": "Barry H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "This was my first time trying anything from Potbelly and I can say I was quite surprised, I got a mixed berry smoothie and it was amazing. Malik was super helpful by informing me the flavors \u0026 his patience because I'm sure I looked like a lost kid in a store. I did go back again to actually try the food and the chicken salad sandwich was pretty good and different compared to the other sandwich places. It is quite pricey tho but I don't really mind since I'm a light eater.", "author": "Devinnesha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I was so happy to find Potbelly half a block from my hotel. They have delicious breakfast sandwiches and lunches.  The staff was very cheerful and helpful. Even dealing with a group of  30 teenagers and 10ish adults after our flight was canceled the night before. If I ever find myself in the area again I will make sure and stop hy for a meal.", "author": "Tabitha R."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Potbelly Sandwich Shop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UPHgxgq4a1IG7CquHjqeTA/ls.jpg", "@type": "Restaurant", "telephone": "+12128971872"}