{"aggregateRating": {"reviewCount": 81, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "This is probably one of the nicest egg sandwiches I've ever gotten, especially in Brooklyn. Clean and neat, but it smells a bit bad inside.", "author": "Max S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "First time here. My tuna sammie is delish!  Really fresh and full of fixings.  I also took advantage of that fresh chocolate oatmeal cookie. Soft warm and amazing!!!  Totally worth it. Trust me.", "author": "Ife M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "There are so many other great places to eat in downtown that are cheaper (they just RAISED their PRICES) and far better quality. Forgers in Dumbo offers a far better sandwich for just as much as Potbelly. They are not even remotely the same quality. Potbelly is similar to Quiznos which is pretty much gone. Raising prices and coupons are not going to help you. I won't be coming back here.", "author": "Mi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Started working in the area in May. Have gone two-five times a week since starting(unless I bring food from home). The app and coupons are amazing and the staff there are extremely friendly and helpful. Anytime there has been some sort of issues regarding the buy one get one or the free item the manager does not argue or try to belittle you. He makes sure the customer is mostly right and that's important. Will continue to keep going back", "author": "Steven A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "A! M! A! Z! I! N! G!\nGreat service, great food. Thought it's gonna be a junk food type of a snack but was wrong! Recommend it", "author": "Maria S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "Customer service had the nerve reach out to me without offering a reimbursement or coupon since I didn't get what I ordered. Won't be returning. :)", "author": "Tish B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-15", "description": "The good: \n\nDecor is nice.\nSandwich with chicken and cheese was ok. Macaroni and cheese was mediocre - would not order again - the cup I ordered was not filled full.\n\nThe BAD:\nEmployee attitude: all had a \"I am having a bad day and it's your fault, so don't bother me\" attitude; not attentive to customers - spent time on the phone while customers waited in line. Service was provided with an facial expression of a jail guard - all the three employees. I wanted to get something else after finishing my meal but decided to just leave instead of getting more of \"you owe me money\" attitude.\n\nI would not recommend this place", "author": "Saiat S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-19", "description": "Today I was in the mood for a good veggie hero I could of gone to another chain but I thought potbelly would know how to make a good sandwich.  The bread weighed more then the amount of veggies they put on the sandwich, plus it did not have cheese put on it.  It cost over eight dollars.  I would not recommend coming here for lunch if you are trying to find a compromise place to eat with a friend that eats meat.  The veggie portion should embarrass them.  I posted a photo", "author": "Bill T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Staff was extremely friendly!  Place was clean and the food was good.   I do wish they had chicken noodle soup.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "This was my FIRST experience at a Potbelly Sandwich Shop and trying out their food.\n\nI had knew a Potbelly Sandwich Shop was coming to Downtown Brooklyn for a few months now and was excited to try it, since I've heard friends talk about it. I came on a gloomy and rainy Friday afternoon, hoping there wouldn't be a long line of customers. \n\nThe interior has an interesting decor. There's a lot of photographs of New York City \u0026 Brooklyn hanging up on the walls and the sandwich shop has a very comfort food feeling to it. It's very spacious, with lots of seating indoor and outdoor. The staff is friendly and cheerful.\n\nFor my lunch, I had a roast beef with provolone cheese and lettuce, tomatoes, and onion on a regular bread. The cost of the sandwich is inexpensive, but smaller than your usual sandwich. The sandwich was well composed, fresh, and tasty! The roast beef was tender and especially tasty with the provolone cheese. For a side, I had the coleslaw which was sweet and tangy! I didn't really want soda with my lunch, so I had an amazing Mint \u0026 Honey Organic Green Tea and it was just pure heaven!\n\nHonestly, I feel Potbelly is a slight upgrade from Cafe Metro \u0026 Panera \u0026 Au Bon Pain which is within the same vicinity. All 4 of these places are well known for soup and/or sandwiches. However, Potbelly is a great alternative if you're looking for a simple. quick, and fun restaurant to eat.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "This has become one of my new favorite spots for lunch. I went in and had absolutely no idea what to get. I knew I was in the mood for a sandwich but not sure for what. I usually do turkey and cheese, healthy and yummy so why not right?\n\nI was definitely overwhelmed with the menu. Not because it is endless but because the combinations are a little different and I panicked easy. I don't know why but I did. Anyway, I told the person that I was not ordering only my friend and thanks anyways. The associate responded \"Not even soup?\" He told me how they have good soup if I'm not in a sandwich mood. I told him I wanted a sandwich I was just unsure of which one to get and I did not want to hold up the line. He told me don't worry about the line and take my time. I WAS SO IMPRESSED WITH THIS. \n\nHe gave me his recommendations...which I didn't listen to and got the meatball original sub with marinara and provolone. AMAZING. The wheat bread was great. The sandwich was fresh. It was enjoyable.\n\nI love the people who work here they were engaging and kind. I will definitely go back to try his recommendations now that I am feeling more adventurous and know the quality of their food.\n\nMUST GO!", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-18", "description": "The sandwich I had was terrible. I would never eat here or any other potbelly location again. The food did not sit well at all and wasn't even that good. I wish I avoided it.", "author": "Yasmin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "This shop is amazing! Everyone working there was so friendly, the wait time was short, and the sandwiches we got were delicious. We ordered the Grilled Chicken and Cheddar sandwiches - recommended!", "author": "Roshni -."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "I placed a catering order for 35 people. They were very helpful and concise when I placed the order, making sure everything was taken care of. Delivery arrived on time with a smile and she helped us set up. They had all napkins, plates and utensils I had asked for (many others in the area didn't bother to give us napkins or utensils - Chipotle, I'm looking at you). \n\nMy only gripe is that they gave us 3 containers of peppers but only 1 of pickles.\n\nI've also ordered personal sandwiches before and the sandwiches are always good and a great value in the area. \n\nI once had an issue where they double charged me. I went back the next day and the manager was very apologetic and took care of the issue right away. \n\nGreat place to eat, always clean and great customer service.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "Slower then regular potbellys but still good food.", "author": "Zak K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-26", "description": "The servers were very friendly.\n\nI was surprised that it took so long to get a sandwich.  \n\nIt wasn't until I was having condiments added to it that I realized my sandwich had been toasted.  I have nothing against toasted sandwiches, but when given an option, I generally decline; in any case, I like to know beforehand.  I'm not a fan of heated cold cuts. \n\nI don't remember reading that the sandwiches are toasted; but that could have been an oversight on my part.\n\nThe sandwich was small.  Tiny, bordering on adorable.  The quality seemed OK.\n\nWhen I finished my meal, I was still hungry.  It was not worth the money it cost.\n\nGood service.  Average food.  Bad value.", "author": "Dick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Ordered the clubbie, with ham bacon turkey lettuce, tomato and ranch dressin' \n\nThe cookies are great, the workers are nice and they know how to handle the lunch rush.. no compliants", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-28", "description": "I've been to Potbellly a handful of times. Saturday for lunch I tried their turkey bacon and cheddar flat. You request condiments and different add-ons. The toasted flat bread made this sandwich a standout. There was even acoustic music for people dining in. An overall step above Subway.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "This Potbelly location was really at the top of their game. It's not terribly often I review chain-restaurants, but I felt this one deserved the praise. We went in at the peak of lunch hour and had sandwiches in our mouths within ten minutes. Staff was friendly and on-point, sandwiches were as delicious as they always are at your local Potbelly shop. Also, highly recommend their frozen raspberry lemonade - scrumptious!", "author": "Melody P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Solid DoBro (yes, I'm the second person to ever actually use that realtor slang) Potbelly with the usual suspects.", "author": "George C."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Potbelly Sandwich Shop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UPHgxgq4a1IG7CquHjqeTA/ls.jpg", "@type": "Restaurant", "telephone": "+12128971872"}