{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Stumbled upon this spot by accident while wandering around the Brooklyn Bridge area. The decor is fabulous and the Yola's Pantera just might be one of the best cocktails I've ever had!", "author": "Rashid D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "It's a little pricey, but Gran Electrica definitely has some of the best Mexican food that I've had in the city. Everything from the chips to the tacos was delicious. The outside area is surprisingly nice as well. In terms of atmosphere/ambiance it's relaxed, but still refined enough to be suitable for a date night or a dinner with the parents. I didn't really get a chance to look around the inside for too long but it seemed to be on par with the outside area. Service was pretty good, though a little slow. Overall, solid place to get food in DUMBO and not too far from the water if you want to walk by the bridge after you eat.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Gran Electric is one of my best mexican restaurants so far, i used to be a fan of Casa Mezcal but Gran Electrica won me over. The food is fantastic and very authentic, their salsas are one of a kind, their drinks are perfect and they have a great variety of Mezcal. There is a good vibe in the space, the only think i can complain is the music, i feel that their music does not really go with the concept of the restaurant. It feels more like a launch. Besides that i am definitely coming back. Their pork tacos and black beans are just on point.", "author": "Tere G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "Elizabeth was literally phenomenal. So nice and attentive. It's rare to find someone like her", "author": "Cecilia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Had to downgrade to 1 star due to the hostess and her attitude or personal problem. \n\nWe came here on a Thursday night around 6pm, bar area was packed and we put our names down for a table. There were two hosts there, the male host welcomes us with a big smile, while the female hostess just stared blankly at me without making any facial expression. OK you hate your job, not my problem. \n\nAnyways, it's over 95 degrees out there, and near the door where we were waiting the AC really wasn't working. I felt a lot warmer than normal due to pregnancy so I started using their menu as fan to cool myself down. To be fair, it's not the best use of their bar menu, but it's clipped on a hardboard so I was really using the hardboard to provide a little breeze without really touching the menu. Then for 1 min I put down the menu to check my phone, the poker-faced hostess made a point to walk over and put up the menu against the wall. Is she trying to tell me not to use that as a fan? Unfortunately that's my only resort and I ain't gonna give it up. Look around, do you not see people are sweating? If you want people not to use menu as fan, maybe turn up the damn AC?? \n\nWe were seated promptly after all parties arrived. Their dining room felt a lot cooler, and our waitress was amazing. We got the usual, chips and salsa and guacamole, fish tacos, lamb barbacoa. We were just starting to enjoy ourselves, the hostess, who came into the dining room to seat some other guests, tapped on my shoulder and asked me to move in my chair so people can walk. I looked around, everyone else's chair was as far out as mine, and none of the waiters/waitresses have bumped into my chair since we sat down. I told her there's nowhere to move and showed my preggo belly. She rolled her eyes, and walked away. Maybe she still couldn't get over me using bar menu as fan, but sorry lady, do not ever ask a pregnant woman to do things that are unreasonable, it would never work! \n\nApologies for the long description, back to food. I only get fish tacos here because some other dishes I've tried before weren't as great. The lamb barbacoa was a bit on the dry side, but flavor was good. I was pretty satisfied. To the restaurant: (1) train the hostess better, or replace her. Clearly she doesn't like her job and holds grudges against whatever that doesn't even make sense. (2) TURN UP the AC by the door on a hot day.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Awful hostess. So awful that I finally created a yelp review account just to share my experience.  \nArrived at Gran Electric at 5pm on a Saturday for food and drinks.  Lots of open tables both inside and out in the back (around 10 open tables in the back). When we asked to sit in the back, the hostess said it was for dinner service only.  We replied and said \"Great!l\" And that we wanted bites and drinks. Looking forward to our margaritas on a hot day.  She asked again to see what we wanted to eat specifically, stating this is full dinner service only.  \n\nIs it any of your business if I want chips guacamole and ceviche for dinner?  We're ordering food and drinks, and there were handfuls of open tables. After telling her what we wanted to order, she told us we had to eat at the bar if that is what we were going to get.  \n\nOf course, we walked out.  You don't deserve our $100.  The hostess should think about how she greets customers. You can't run your business like that.", "author": "Caralyn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-16", "description": "Gran Electrica is a great brunch spot aesthetic wise. The locals in Brooklyn really seem to like it because maybe perhaps this is the Mexican fare that they're accustomed to, but it's by no means mind-blowing. We ordered the chips and guac to start and while the portion is indeed small, it is very flavorful and I thought the spiced pepitas added a really interesting but complimenting texture. My counterpart had the chilaquiles which went unfinished because the \"simmered\" corn chips ended up becoming too soggy to the point of separation. I had the chorizo con juevos and while it was \"tasty\" for what they were trying to present, I wasn't impressed. As a Texas native, surrounded by and eating Tex-Mex establishments in every corner, the flavors here almost appeared to be dull to me. The chorizo lacked any color that would resemble real chorizo and the spices were just missing. Thrown together with an egg and some avocado slices, this is a dish that you could have easily replicated at home but made better by twofolds. But dining out is a living and learning experience, though one I will not make again at GE. It's a great place to show off to your friends, but unfortunately for me it just passes as another hipster establishment in Brooklyn. The prices are steep and the food barely manages to be passable. I probably wouldn't stop by for a second visit.", "author": "Darton N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Tucked away in Dumbo, among picturesque cobble stone streets and under the bridgescape lives Gran Electrica. Should you elect to take the 2/3 to Clark Street and walk over, you can work up an appetite passing streets named pineapple, orange and cranberry. I had forgotten about this little gem as it's been a few years since my last visit. The margarita electrica remains dangerous in that it's so delicious and refreshing that you don't notice it's strength. It's all too easy to have more than one, perhaps just set a cap for yourself at two (or, three?) The guacamole is fresh and full of flavor although I'm not a fan of the pepitas sprinkled on top. The entire menu lends itself to sharing quite easily. This fact, paired with the delicious cocktails, leads me to declare this place an excellent locale for a small group catch up. Highly recommend!", "author": "Christin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-17", "description": "Bartenders are a pleasure here - so friendly and funny. Food was great too, I love coming here for a good brunch date. However, the red head Caucasian waitress is the worst waiter I've encountered in my lifetime. She speaks as if she's doing you a favor by blessing you with her presence. My group has dealt with her twice on two different days and it's off-putting that they have such bad service staff. I don't think we'll be returning anymore.", "author": "Brianna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Hey there. I figured I'd write this while the experience is still fresh in my mind and belly. I popped in here on a whim. I had just completed my gift for my parents at the Osprey for their 27th and decided I needed to eat. I see a taco sign and I'm hooked. Originally I wasn't meant to be seated at a table, but the hostess was so awesome that she gave me a table for a reservation that was meant to be coming later with the caveat that I be finished before they arrived. I knew I would be so i acquiesced and took the table. On to vibe-- I loved the ambience in here. It was low light, super calming and amazing for a date night should one choose to go here. I had the Chicken Tinga tacos-- 2 for 9$. I wasn't particularly hungry, so I knew this would suffice. Add a side of what I will now refer to as 'crack plátanos' and I was good to go. The plátanos (maduros I should say) were sweet, with a garnish of sour cream. Mouthwateringly good. As a drink I had the 'Me quedo'-- a spicy manhattan for my libation lovers. To top it off, my waitress Shannon was beyond sweet. A smile goes a long way. I will be back and you all should give it a visit. \n\nAs always, happy eating. Marie Madeleine.", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "OMG I could not love this place more.\nFor starters, their guacamole is super fresh and has a nice consistency. Their ceviche was also very tasty but the Berkshire pork carnita tacos and the Suadero, the slow cooked dry-rubbed beef were to die for.\nThe pork and beef are very tender, tasty and not fatty. This has quickly become one of my favorite restaurants. Also, don't miss their Margarita de Toronja picante. It is somehow spicy and refreshing at the same time. Enjoy!!! This place is two thumbs up!!! Love it!!!", "author": "Elisabeth P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "\"Table for 5 please.\" \"You do know this is Mexican Food, right?\"\n\nHad I known this was the exchange before we were seated, I would have taken the hostess to task and took my business elsewhere. It is a shame because the table waiting, serving and food was good.\n\nI hope management reads this because I think someone needs retraining on how to greet and interact with clients. Who ask such a stupid question when you are running a place that caters to diners. I hate to think some stereotyping occurred here but I have no other explanation.\n\nIf I were present when that exchange occurred, I might have trolled the hostess and then took her to task. Something along the lines of, \"Mexican?\" \"Wait you don't serve Hunan food?\" I guess if you don't look a certain way you are not going to have Mexican food.\n\nOkay, enough of my soapbox. The food was tasty but the portions were small. Expect to drop a few hundred dollars if you are taking kids with you because the small portions will leave them hungry for more.\n\nThe waiters were very nice and I complement the one gentleman who took the time to determine for us that there was no danger of cross contamination with peanuts since one of our dinner guests was allergic to nuts.\n\nI love Mexican food and this place would be a winner if it were not for the ignorance of that hostess.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "This review is LONG OVERDUE! We stumble upon this place, because we really displeased with the previous place we were trying to have dinner. I found the rustic \u0026 cozy gem, on Yelp! Ol' reliable! At first we walked past it, but it took us less than 3 seconds to realize because we saw all the busy foot traffic coming in \u0026 out of this place. As soon as you walk up, your greeted by the lovely host, who is aware \u0026 attentive. We had the pleasure of sitting right next to kitchen, in this cozy nook directly across from the bar. From that view you really have the pleasure of soaking in the intent and creative flare that Gran Electrica is going for. Rustic, meets Modern with hint of Romanticism. Waiters dress in modern take on industrial aprons and simplicity from the black and white worn, down to the black rubber gloves worn. We had the pleasure of having Teddy( I believe), as our waiter. His is the epitome of customer service (being a customer service specialist myself for 9years), professionalism and all around awesome personality! Made us feel comfortable being in a place! \nShortly after, we had the opportunity to really connect with Andrew (I believe that was his is, the manager) really expressed how important it was for them to be have true authentic Mexican cuisine, and highlighting the spices and sauces curated specifically for Gran Eléctrica. EVERYTHING IS MADE FRESH!!! YOU CAN TASTE IT!!! We had the Mariscos al Mojo de Ajo, but I believe that day, it was a special that Teddy recommended because it had a New Orleans twist on it!!! It was delicious, succulent, earthy and down right mouth watering! I had the pomegranate margarita and my bf had 7 points beer. Finished our dinner with a decadent, lush  chocolate pudding  By far, one of the best restaurants I've been too! We will definitely be back.", "author": "Rasheeda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "This is one of the best Mexican restaurant I've been too! The ambience was amazing, loved the soft background music and greenery in the outside seating area. The service was prompt and waiters so nice. The portions are slightly small for the price but if you're going to splurge everyone once in a while, I would recommend this place. They also have two bars, one on the inside and outside stocked with a variety of drinks", "author": "Bridget K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Came here on a Saturday night around 9. We had no wait time and were served quickly. The actual sizes of the meals are very small and very overpriced . The chicken tacos were decent, but not the best .  The salsa was terrible lol tasted like it came from a Tostitos jar. The queso fundido was good but is definitely more of an appetizer than a meal. Overall the place is not bad and the ambiance is very nice, It could just use work in terms of food quality, especially considering the prices", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "Yum! I love this place every time I come here day or night. It's or usual pre or post St. Ann's Warehouse spot as it's just a couple blocks away. Jalapeño margarita is my personal favorite along with the tacos. Great brunch too. Love the rock and roll vibe.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "If I was on a deserted island and I had to pick my last meal, I would without hesitation tell you it would be tacos and tequila. Simple guy. \n\nGran Electrica is by far and away the undisputed best all around Mexican restaurant experience you will find in the city. \n\nThe ambiance is out of a movie, with incredible wall paper on the inside portion and the combination of the brick, neon signs, ivy, lighting and the hum of the city from the Brooklyn Bridge above is next level. \n\nAndrew the General Manager is as easy going and well spoken as they come, Kiki and Teddy are quite perhaps my favorite waiters/waitress I've ever had, and this will be in my top 5 recommendations for years to come. \n\nWell done. 10/10 would recommend tho.", "author": "Tommy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "So we've eaten/had drinks at Gran Electrica a few times before we decided to also hold our wedding reception there. This review is two-fold:\n\nRegular dining and drinking: \nEach time we've gone we've had consistently delicious drinks and great service. Everyone has been professional and has offered recommendations on their favorite drinks. If you like mezcal, there are usually quite a few options for their speciality cocktails. For me, there are plenty of options for fish and veg without feeling like I'm missing out on \"the good stuff,\" since it's all equally well-made. One time we were standing outside waiting (got there too early) and the skies opened up with a massive downpour. Instead of making us wait outside they opened up the doors early and rushed us in to get us out of the rain. That's kind on it's own, but they also didn't make us wait to sit down for service and were super sweet about all of it.\n\nFor the reception:\nOh man there was so much food! Kate was wonderful in helping us to plan, including a backup rain plan when I was too overwhelmed to do it myself. I'm so thankful she was there the day of too. We didn't need any table decorations or anything crazy because the space is just so beautiful on its own. Billy was fantastic about keeping my drinks full and making sure we were eating. Our families were raving about the food, and how unique of an option it was for a wedding reception. It's an amazing value for how great the service, food, and ambiance are. We probably went the lowest-key route, but I have no doubt that Kate and her team can work with just about any request. We are so thankful for their whole team, they helped make our day perfect.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "General - I thought the food was great, and the drinks were great as well. Very solid spot! Service wasn't bad, but not impressionable. We wanted to sit outside on the patio, but it was raining so we didn't get to do that. Definitely try to get a patio seat if weather permits! I would definitely come back - fun spot for a group of friends! \n\nWait Time - We made a reservation - didn't have to wait at all. \n\nAtmosphere - 4/5\nGood for fun dates and for groups of friends! A bit small inside, but the outside seems really nice. \n\nService - 3.5/5\nNothing special, but not bad. Nothing really to complain about or compliment. \n\nFood - 4.5/5\nWe were really happy with everything that we ordered. We ordered Chips w/ Guac \u0026 Salsa, Tinga de Pollo Tacos, Suadero x2, and Platanos - all for 2 people. We started off with one of each, but ordered suadero again and another order of chips \u0026 guac because they were SO good!! They add these sliced red chilies on top of a couple of the items, and we asked for sides of that twice because those were so good as well. \n\nChips + Guac + Salsa (4/5) \nLove the chips \u0026 guac - salsa was okay. I would've just done chips \u0026 guac with no salsa if I had known!\n\nTinga de Pollo Tacos (4/5)\nPulled chicken tacos - super juicy and well seasoned.\n\nSuadero (5/5) *MUST ORDER*\nSO good! This was the highlight of our meal. Super juicy and tender, so well seasoned, and just so delicious. \n\nPlatanos (3.5/5)\nI'm not really a fan of plantains, but this was pretty good. I think if I wasn't biased towards not liking plantains, I would've giving it a higher rating. It was nicely caramelized. \n\nOverall, great neighborhood spot! Super solid - would love to go back with friends.", "author": "Ang L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The only way I can describe this food is INVENTIVE!  The combination of flavors and incredibly fresh ingredients give this Restaurant a leg up. I had a quesadilla appetizer that had, among the highlights artichokes and micro-greens.  The tacos I had were filled with green veggies that were perfectly cooked, and the Pepitas gave  them just the right amount of crunch in the midst of the soft corn flour tortillas. I didn't have any alcohol due to work, but I looked at the menu and watched the tequila go by me in waves; I could see how absolutely beautiful the drinks are. I definitely want to go back for some of the original cocktails.", "author": "Emily C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}