{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "Superb Location. Spectacular Staff. Phenomenal Food \u0026 Beverage! Gran E has just earned themselves guaranteed repeat guests WHENEVER in NYC!!!", "author": "Sergio F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Great Mexican in DUMBO can be found here. The drinks are great, had their pepino Margarita and their house Margarita and both were lovely. The atmosphere is really nice and its a good intimate place for a date or even a dinner with several friends. It's on the smaller side so wouldn't recommend for huge groups but 4-6 ok. Liked their food not overly salty and well spiced. Their guac was great and then they gave a selection of spicy sauces that came along with a Quesadilla, I went with a vegetarian and both of us had a good selection of food to choose from.", "author": "Victoria E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-07", "description": "I'm not a fan.  The space is nice and they have a good back garden but my experience was not good.  We walked in and had to wait almost 30 minutes to be seated.  When we were finally seated we realized there were a lot of open tables.  Why the wait?  Then we ordered the guacamole.  It was very bland and basically seemed like pureed avocado.  The chips were kind of thick and full of oil.  As for our meals, we split the chicken tacos and the huevos rancheros.  Both of those were good but we definitely left feeling unsatisfied.", "author": "Casey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "We came at an odd time (the afternoon) but they were extremely friendly and accommodating. The margaritas and guacamole were delicious. Also loved the ambiance and decor. Will definitely be back!", "author": "Karen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "5 stars for this place, I came here with some friends and had a fabulous time, we ordered guacamole and salsa, the chile relleno, lengua tacos, and aguachile as starters, the chile relleno was amazing, as main course I had the short rib, one of my friends had the steak, and my other friend had the fish, we were all happy with our meals, but the three of us think that the fish was OUT OF THIS WORLD, I can't describe how good it was, we try all three desserts and our favorite was the churros,  the service was excellent, from the moment we arrive the bartender was attentive and fast, the server assistant was also very attentive and courteous, the waitress Pauline, did an amazing job. Great food+ great drinks  + great service= 5stars", "author": "Ulises M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "great bar - went at night after opera - great scene, hang out by the car, back garden closes at 10 but should try and sit - need to order food.", "author": "Jerome Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Our original Valentine's dinner reservation was a bust... Long story... Called on a whim and Gran Electrica was able to accommodate us last minute.  And everything was absolutely perfect, just what we needed.  I wish I knew the server's name, she was so attentive.  My fiancé doesn't like onion, and there was onion in almost everything on the prix fixe menu, but she was able to get onion omitted from some items.  The tacos were to die for, and the 4 hot sauces were absolutely delicious.  We will definitely be back!  The chef heard that my fiancé is from Mexico and he came out to say hi.  He said he regarded a compliment from anyone Mexican very highly.  Very sweet.  Also special shout out for the very cool Day of the Dead-themed wall paper.  Cannot wait to come back when it's warm and check out the backyard.  Those tacos saved our Valentine's Day!", "author": "Heidi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Went here for dinner on a busy Saturday night a few weeks ago and it did not dissapoint.  Started out with a few margaritas, the one i had was with cucumber juice and various fruits, very refreshing.  My girlfriend had one of the spicier ones with mezcal and loved it.  Our waitress was awesome and super helpful in steering us in the right direction with the dishes (I have a few food allergies and one of our friends is gluten free).  We got the enchiladas with the mole sauce, really great dish and would definitely order again.  We stuck around for a few hours to drink and chat and didn't feel rushed at all.  Will definitely be back!", "author": "Greg L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "I loved everything about this place, from the low key bar to the food to the great wallpaper. The margarita's were very tasty and well done, they didn't taste like cheap margarita mix, but more like an actual drink with real ingredients. We loved the food here as well- the fish tacos were probably the best around in NY, the scallop ceviche was mouth watering and the chorizo quesidilla was so tasty. The one dish I did not like was the chili- it was not very tasty and pretty pricey for the amount they give you. Other than that, everything was great, will definitely go again.", "author": "Letitia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Consistently amazing. Great neighborhood spot with strong drinks and great guac. Mushroom setas and chorizo quesadillas are the best. I also love the picante toronja margarita - perfectly spicy.", "author": "Jen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Drinks and apps were fantastic (we already had dinner plans elsewhere). The garden has a wonderful vibe and the staff was friendly, funny and accommodating. Order the guacamole and carnitas.", "author": "Charity S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-09", "description": "I'm not sure about the tacos here. Seems twice as pricey with half the portions I could've gotten in Greenwood, BK. Which is fine because I didn't order any food. My friends did. \n\nAlthough you want to try a mean cocktail, get the Margarita de Toronja Picante. \n\nClosest thing to getting your throat ripped out.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "After enjoying a nice walk through Brooklyn Bridge Park, we stumbled across Gran Electrica and thought it would be a great place to have a drink and some snacks. We were excited when were sat in the lovely garden. Unfortunately, it all went down hill from there. My wife's margarita was just \"OK\" but for the price charged, should have been a lot better. I had some sort of attempt at a bloody mary, but with beer instead of vodka. It was pure hot sauce, with a beer float on top. Yuck. Again, for the price paid, the quality of the drink and care with which it was made should have been much higher. The small plates (and I do mean SMALL) were also just \"OK\" Food and drinks aside, the service was very attentive and friendly. As I said earlier, the garden was lovely. Other than that, this place really does not have much going for it.", "author": "Christopher H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Nice back garden but a little steep in price for what they offer... The food is good, but not that great. The waiter was a little pushy too when he realized we really only wanted drinks.. We made that clear to the hostess who said it was fine to\nsit at a table... We felted forced into ordering something... Probably would not return.", "author": "Candace R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Came in for an app and cocktails and had two really nice drinks and great chips guacamole \u0026 salsa. Nice ambiance and plenty of room at the bar. The under-bar also has coat/purse hooks, enough said. Why some bars don't have hooks baffles me.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Good cocktails and delicious guacamole, but that's about it. The dinner portions are ridiculously small, and extremely overpriced. The outdoor section is okay - if you can get seated in it. Otherwise, very loud and cramped. Service was good, but the food has been subpar every time.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "They have a good happy hour the margaritas are different and refreshing the guacamole was yummy, I had the chorizo which was good as well, it tasted like authentic Mexican food.", "author": "Jessie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "I've been to this restaurant a few times -- brunch, happy hour, afternoon drinks -- and it's become my favorite place in the area. \n\nFirst of all, the drinks are delicious and strong. My favorite is the habanero margarita. \n\nSecond of all, the food is very yummy. I really enjoy the carnitas tacos and the guac.\n\nThird and the most important of all, the service is superb. They are always nice. However last night we popped in during the DUMBO arts festival. The restaurant was  crowded and the kitchen could barely keep up with orders. The wait staff was AMAZING. This especially goes out to the girl with brown hair and a pretty necklace, she literally made our night with her service. \n\nOh and also, the wallpaper here is badass.", "author": "A K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-09", "description": "I used to really love this place but something has changed. Maybe they got a new chef or perhaps stopped caring. The food is so mediocre. Guacamole tasted like mashed up avocados--nothing else. Cilantro? Lime? Onions? Tomato? Nope. Fish tacos were bland as hell. Tostados also lacked flavor and the order only came with a single one for $11. Everything is just so below average. It's sad really. Service is good, but they need to step it up with the food. Simply not good enough. Too many other great Mexican restaurants in BK to just settle for this.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "Stopped by on a Saturday night and had a great experience. We had excellent service, and our server was very thorough in describing the concept and different elements of the menu. The lengua and fish tacos were delicious, especially with the different sauces they served. The scallop ceviche was amazing with a bit of a bite. The margaritas (orange and grapefruit) were excellent too--not too sweet, which is great for me.\n\nAnd love, love, love the wallpaper! (Look closely...)", "author": "A S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}