{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "I rolled into Gran Electrica on a rainy Sunday feeling like the ass end of a wet dog. It doesn't take much hospitality to make a gross, sopping man want to live again, but GE easily exceeded that threshold with a warm wait staff, soft lighting, and an artfully designed interior. The GF and I decided to sit at the bar and order drinks. And that's where the problems began. \n\nI believe in the essential goodness of humans and their intentions so I like to yelp from a place of deep and enduring calm and optimism. I like to find my happy place. But some establishments cover my quiet beach with crappy driftwood, industrial runoff, and beached whales. Gran Electrica was never that bad, and I wish them all the best, but pretty much everything we ordered needed some serious revision. \n\nI've never been much of a tequila fan. Maybe I burnt out my taste buds on plastic bottles of \"tequila\" with seemingly random permutations of the names \"Don,\" \"Julio,\" and \"Roberto.\" I decided to take a chance on the Batanga ($10), consisting of tequila, hot sauce, lime, and Mexican coke (no not that kind Scarface). Instead of a thinner hot sauce like Cholula or Tabasco, they used something thick and gelatinous that did not play well with the other liquids. And there was no sweetness from the coke to kill the very unpleasant flavor of tequila and hot sauce. The second drink I got was a hella fruity margarita ($12), but though the description claimed St. Germain and of course tequila, all I got was Campari. The bartender was a really nice guy and seemed with it, so maybe these drinks just need some critical rethinking.\n\nThe GF had a glass of red, the Agricultura, which was really quite good. I'd recommend beer and wine here. We also got the fish tacos ($10) and the hongos quesadilla ($4). The fish tacos were small, with a well meaning but tiny hunk of bass covered in slaw. The avocado that was supposed to accompany it must have decided it had something better to do because it was nowhere to be found. You think you're better than me avocado? The quesadilla was a far sight tastier, filled with meaty and flavorful shrooms, but it was very small. \n\nOn the plus side, our food appeared almost instantly and there must have been a lot of tequila in my drinks because I was tying on a pretty good buzz by the time I left.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Amazing!  From start to finish. Staff was great, srvc. Was on point. Food was great, drinks, we're on point.", "author": "john s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "The drinks were great and the bartender (Evan) knows his tequila. If you like tequila or want to learn how good it can be I highly recommend this place.", "author": "Alvin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "Why Come Here? Try a large and very good assortment of Mexican snacks and small plates, laid back, rustic atmosphere\n\nI love Mexican Food. There's just something very satisfying about eating it. I especially like it when it's cheap and good. Gran Electrica may not be super cheap, but I found it quite enjoyable for the price and ambiance. The place boasts an impressive pair of chefs - Sam Richman (Jean Georges, The Fat Duck) and Brad McDonald (Noma, Per Se) - preparing a variety of Mexican dishes, some familiar (tacos and mariscos) and some not (raise your hand if you've heard of garnachas and tlyacoyos?)  It's all small plates style and many dishes come in under $10, with only a handful over $15. So if you're into Mexican snack foods, it's a great place to indulge on a large number of them. The ability to do this in a rustic, laid back ambieance just under the Brooklyn Bridge makes this a place worth coming back to.\n\nSince everything is served small plates style, we had a lot of different things. Note that most things are improved with the addition of the four salsas you receive with your meal. Below is a rundown of my favorites. For more photos and reviews, check out my DishEnvy page.\n\nPollo Garanchas: Sort of a thicker, less crunch version of the tostada. The marinated cabbage adds a unique element not usually seen in Mexican cuisine.\n\nChicharron Gordita:  Cheesy, creamy and fried in pork fat you definitely want to give this a try.\n\nAguachile Mariscos: A very refreshing dish and a nice way to break up some of the heavier fried dishes on the menu. The raw scallops are thinly sliced and top notch.\n\nChurros: These might be my favorite churros of all time. Crispy and cinammoney on the outside, but the dough has almost a cream-like texture on the inside. Don't miss ending your meal with these.", "author": "Jay Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "I've been here a couple times for drinks. On the weekends, the bar gets packed, but the delicious, flavorful, vibrant cocktails are worth every minute. It seems that the drink menu changes -- I've had a tequila cocktail made with carrot juice, and another made with beet juice. Both drinks were delicious, but seem to not be on the menu right now. Regardless, I've tried the Ay Papi! (made with smoky mezcal) and loved it. Definitely planning to come back to try the food.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "A most magical place with cozy decor, and a lovely hidden garden right under the Brooklyn bridge will set the mood right for yummy Mexican with Margaritas in the company of good friends. \n\nBut it will not save you from the sticker shock once the bill comes in. If you don't mind paying extravagant 'sushi prices' for simple (albeit lovely and well executed) Mexican fare, then sure, enjoy. \nThe dishes are small and, for what they are, way over priced. Even a regular sized portion of guacamole with a small basket of blue corn tortilla chips will set you back a whopping $13. Folks. It's guac. Not truffles. \n\nWe went for brunch and walked away hungry $70 later. And that was without drinks. I would love nothing more than for this place to rethink the pricing and focus more on creating a strong following of regulars in the local hood. It is much needed.", "author": "Susanne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-07", "description": "As you walk by, do not be deceived by the visible crowd in the dining room \u0026 bar. This is what happens whenever a new spot opens in a genuinely desperate neighborhood. It does not reflect the quality of the food (without qualities), atmosphere (baffling) or service (handsome, helpless).\n\nThe messy Mole Verde would have been insulting at any price ($17) and brought to mind that \"...and the portions were so small\" punchline, especially being from the Grande section of the menu. My traveling companion fared no better, though he had the wisdom to stick with their self-described strength \"street food.\" I did not sample his meal but know we both left dispirited \u0026 hungry.\n\nI don't feel it is it is too early to pass judgment on the menu. In this case there's nothing *but* room for improvement. How does this earn them a second chance?\n\nI gave Colonie about a month to settle in, but found once enough. I've never been back \u0026 don't see it happening in this case either, unless they completely re-conceptualize. Maybe they should just bring back Five Front.", "author": "Ada A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "I am super happy we have this place in dumbo. The drinks are fantastic, the ambience totally relaxed, and there is a nice selection of food. I found the hospitality of the staff to be impeccable. I really loved the local ambience; check out the wallpaper of local dumbo spots made up of skeletons.\n\nAnd I agree with some of the reviews as far as the actual food and menu- need some more veggie/vegan entree options, and some more flavor in the dishes. A caesar salad doesn't count as a vegetarian entree. I am hoping this gets worked out in the weeks to come.\n\nI wish I could come here more, but the prices are a little steep for nouveau mexican food. You think you are getting alot for your buck, but the dishes are small; and the drinks are $12 and up. You probably won't leave here without spending $75+ for 2.\nAlot of other places have opened in dumbo with high prices, thinking the yuppie locals could afford it- those restaurants are not around anymore.\n\nI do love this place, and I hope many great things for it in the time to come! Maybe locals only prices or nights ;-)", "author": "Layne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "3.5 stars.\n\nGran Electrica serves wonderfully delicious haute Mexican cuisine.  I can definitely see what people are saying with the portions being small.  However, since I wasn't ravenous when I dined here, I was fine with one of their small plates.  I chose the crab tostada, and my boyfriend had the brisket tacos and chicken flautas.  Literally everything was delicious, from the precisely concocted margaritas to the perfect amount of spice to each dish, all with super-fresh ingredients.  And if the dishes aren't spicy enough for you, Gran Electrica provides you a set of 4 homemade salsas ranging in spiciness.\n\nService was great, ambiance was gorgeous - i.e., what you'd expect from the owners of Colonie, where we eat at least 2 a month.\n\nI'll definitely be back, and hope to increase my rating due to consistency of meals... since prices don't seem to be going down.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Came here with my girl, she had the cemita and I had the torta Milanesa and it was delicious, we also had salsa and chips and then guacamole and chips, both were perfectly made. Awesome experience.", "author": "Henry Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Hostess was super sweet and friendly. She helped me with recommends. My pork taco was so salt that I almost cried. But I loved my husband's pork quesadilla. I was eating some of his. The mozarella on that pork quesadilla was so fresh. Loved it! Waiter was attentive and kind.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "I took the ferry from Williamsburg to Dumbo. I lived in San Francisco for a long time and really miss good regional Mexican food. Oaxacan food has a wide range of flavors and Gran Electrica did not disappoint.\n\nI ate tacos, had good salsa, and a nice mole which had amazing flavors. After a nice Margarita I was enjoying a beautiful warm night in June. The bar was packed and the restaurant was really busy too. I ate at the bar and we met some interesting Brooklynites from many different neighborhoods and backgrounds.\n\nI do not mind paying a fair bit for a good margarita and interesting food. The atmosphere and food are both worth coming and checking out if you are looking for a good destination. You can walk around the park or eat some chocolate down at Jacques Torres too.", "author": "Greg O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-14", "description": "After such great meals here this past year, my experience two weeks ago was a disappointment. My family was visiting from Hawaii, so I thought I'd take them to my favorite restaurant in Dumbo. While the food was lovely as usual, the host put a damper on the whole experience. When I told him I had made a reservation, he told me that I had made it for four people instead of five. Trusting his word, I apologized. He told us that this was an \"extreme inconvenience.\" My dad rolled his eyes at me, as the restaurant was three-quarters empty. I looked at the email containing my reservation, and it turns out that I had not made a mistake; I HAD made it for five people. We followed the host, and all he had to do was literally push an extra table five inches closer to the other two tables. The \"extreme inconvenience\" took about four seconds.\n\nThe food was great (try the carne asada or carnitas tacos!), and our servers were fine. Unfortunately, we had to pass the host on the way out. He completely avoided eye contact and did not say good-bye to us as the rest of the staff did.\n\nI expect bored, incompetent people who hate their lives to work at chain restaurants in Times Square, but I expected more from Gran Electrica.\n\nTo whoever was hosting at noon on Saturday, January 3, 2015: You should be ashamed of yourself. I assume you are racist (you have no other reason to be so rude to my family and me). Please move back to whatever Middle America town you grew up in where bigotry is accepted.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "As a resident of Dumbo, someone who eats out probably too often, and, as someone with an F\u0026B background, I have to give four stars to one of the better restaurants in this price range to entire the neighborhood.\n\nGreat staff and environment, welcoming to children even during a Saturday night rush, everyone was gracious and hospitable;  I would say professional.\n\nPer the food, we have eaten here twice and ordered only drinks and from the center portion of the menu which mainly consists of Mexican tapas.  All of the cocktails on the menu are great/well balanced and interesting; especially the beet and Campari based drinks.  Per the food, it was very good; not excellent but with props going out to the fish and beef cheek (face, not butt) tacos.\n\nWe pressed the staff on the menu choices and were told it is evolving as the chef determines the guest profile of this location.  What this means is that any review in the early stages, including this one, is probably moot as the restaurant needs to figure out it guest and hone its operation before they are ready for real critique. \n\nIn the mean time, I say this place is off in the right direction and so four stars; fingers crossed.", "author": "E. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Great food, great ambience wish their menu was bigger but all in all would come back.", "author": "manny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "This has quickly become my favorite Mexican restaurant.  First, I love the decor of the place--I am totally into that Diego Rivera/La Catrina look.  The back patio is gorgeous and adds to the ambience of the evening if you are lucky enough to be seated out there.  The guacamole is incredible and my favorite dish is the carne asada.  The steak is seasoned and grilled perfectly.  On one trip, our food came out and my friend and I started eating.  A few minutes later the chef came out and apologized that our steak portion was so small, and gave us another whole steak (unbelievably, it was even more delicious than the first!)  Another thing to note--the drinks are amazing.  They have a spicy grapefruit margarita that I have tried several times to recreate at home.  The only reason I am not awarding 5 stars is because certain items are a little pricier than they should be.", "author": "Megan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "I've always really liked Gran Electrica b/c of it's really good spicy margaritas, cute backyard, well-designed decor and pretty good food. But last time I was there, I had to ask if they got a new chef b/c despite it being mostly the same things on the menu, the same dishes were a total step above the last time I was there. The food is now amazing!  The ceviche was so densely full of fish---not filler and watery--just amazing. The memolitas (sp?) where very yummy and the fish tacos just had a lot more flavor...I think a better fry batter or something. All around, phenomenal.  And the spicy margarita and the Ay Papi drinks are both so delicious. Service is also fantastic and personable.  I'm so lucky to have this in the neighborhood.", "author": "abby s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "DUMBO has been in dire need of a new place- and Gran Electrica didn't disappoint.  For libations, we enjoyed the Gran Margarita or the Tempernillo on tap immensely.  Our fave dishes were the Chorizo Quesadilla, the Chicken Grandita, the Scallops and the Cesar Salad.  Do NOT miss the Coconut Macaroons; they are served warm from the oven.  Amazing!", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "After talking a nice afternoon walk across the Manhattan Bridge, I decided to go to Gran Electrica - a nice little mexican spot right by the Brooklyn Bridge. \n\nIt's a Friday night so of course it was crowded.   They played nice music and had a little garden in the back.  I sat at the bar and ordered a Sandia Fresca - not a tequila fan, but it was okay.  Then I ordered tacos with carnitas and Chorizo con Papas in a quesadilla.  Their servings were smail, but the taste -- excellent -- and the prices are cheap!!  Friendly and fast service, too.\n\nOverall, it's a good place for \"appertizer\" servings.  And there's no line to get into the restaurant -- like the brick oven pizza place around the corner... LOL!", "author": "Sally M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Gran Electrica serving great authentic  Mexican cuisine.  Salute to the chef!    The taste and contrast in every dish is a clear indication on how the menu was thought out menu.", "author": "Miguel U."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}