{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "My favorite spot to get Mexican. Best fish tacos I've ever eaten. The tribute to the skulls / day of the dead theme is very cool and enjoyable to look at the walls. Very cool for a date setting too", "author": "Douglas V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Stop what you are doing and go here! Why this place isn't a 5-star rated restaurant is beyond me. The staff and service were amazing. Since we're new to the neighborhood, we didn't realize we probably needed reservations but they had a cancellation and were able to accommodate us. If you can, SIT ON THE PATIO! It's awesome. So romantic and cozy. \n\nGo with a classic margarita or the spicy grapefruit. The queso fundido with chorizo was out of this world. We ordered the carnitas tacos and finished up with the chocolate mousse pudding dessert (can't remember what it was called). \n\nAll I can say is that everything from the food to the service was 5 stars so don't pay attention to the rating here. We're normally kind of Yelp snobs but in this case, I'm glad we overlooked the rating and we'll be back here A LOT!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Tucked around the corner from the continuing white-washing of DUMBO, coughShakeShackcoughLukesLobstercough and long-ass lines for Grimaldi's is a wonderful little Mexican place. \n\nThe Día de Muertos vibe welcomes you to this small restaurant with a lush, green patio in the back. On this particular day, it was, as the weatherman would say, hot as balls, so we opted to sit indoors. \n\nSplit a guacamole, which arrived quickly. It was topped with pickled jalapeno and quite tasty. It's that time of year where guacamole is so rich and full of good fats. Nom nom nom. \n\nI ordered the ceviche, which, while not at the level of some Peruvian spots, was cool and satisfying. It was a rather small portion, but it was filled with yummy fish. It wasn't too lemon-y or onion-y, so I was happy. \n\nOh and fucking Kanye West was playing on the stereo. Like College Dropout, classic beats. 5 stars. \n\nKatie ate her pork tacos hella fast. She's a self-proclaimed slow eater, but something about Mexican food makes her ravenous. She was digging the food and the space.\n\nI'm sure we'll be back in the fall to sit outside.", "author": "Shibi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "Tiny portions, over priced, over rated\n\nThe best thing about this place was the outdoor seating, gorgeous\n\nTheir liquid nitrogen chilled coffee didn't really taste any different from iced coffee\n\nCeviche had too much fish without enough other ingredients or flavor and the cuts were too thick\n\nGuac bowls were too small, overly puréed, and you can't really see the other ingredients in there. Personally I like a chunkier guac\n\nThe quesadilla bread was too oily and chewy", "author": "Ali S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "My husband and I walked by this place when in DUMBO. I remembered hearing about it when it first opened by kind of forgot about it. Upon walking in, I was struck by how....cool it was inside. For lack of a better word. It felt out of place in DUMBO; it felt more like a Williamsburg vibe, but not pretentious. For starters, you must be beautiful to work here. Seriously, the hosts, the servers, the bartenders, all stunning. There is a wall of greenery behind the host stand along with a neon sign for the restaurant. Neon was located very strategically and simple throughout the restaurant. It was a more modern twist on 80s chic (which, yes does exist people).\n\nThe bar takes up the entire front room and has a very active bar scene. The space utilizes the decor from the past very well and incorporates it into the restaurant seamlessly. There are a few tables inside in the next room, but majority of the seating is located outside; which is so lovely. There are string lights above all the tables and trees and greenery throughout the space. There is a brick wall in the very back that blocks the sounds of the harbor and downtown well, so your dinner will not be interrupted. \n\nMy husband and I each got one of their margarita cocktails and they were INCREDIBLE. I got the margarita de pepino. It was DELICIOUS. Just a hint of spice and extremely refreshing. When my husband took a sip he said, \"It's like jumping into a pool!\" My husband got the margarita de toronja picante which was just incredible. Gave you insane brain freeze though because it made you suck down a lot at a time because it was so tasty!\n\nWe split the guac, which was very flavorful and fresh. It could have used a bit of cilantro and could have been a bigger portion, but we were not disappointed. I ordered the veggie tacos and was blown away. There was small summer squash, caramelized onions, peptitas, microgreens, and some sort of creamy queso sauce. Just incredible. I could have eaten another order. My husband ordered the tinga de pollo and inhaled it basically. He just loved it. Each plate comes with 2 tacos, and I think a bigger person would probably need 2 orders of tacos. I was very satisfied after, but my husband was still hungry. Prices are very reasonable so this is doable. \n\nThe service here was impeccable. I want to say we had between 4-5 people attending to us all the time. I felt like I was at some super high end establishment, just without the pretense. Our every need was taken care of and done so with a smile. I loved this place. I would absolutely come back.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-27", "description": "Went on a Sunday night. Had to suffer through dinner with a DJ absolutely blasting hyper-vulgar hip-hop (I'm no prude but every other word was m-fer, etc) so loud that I had to yell to my date sitting across from me. Waiter disappeared for 10-15 minute stretches. Food is consistently ok if a bit pricey, drinks are better, but I didn't go to Gran Electrica on a Sunday night because I really wished I was bumping and grinding in a club. Oh, and there was some employee who was super excited whenever the DJ would play something he'd like, this guy would screech at the top of his lungs and jump up and down. It was just a really annoying scene that had no place in a restaurant. I get that it's part of Gran Electrica's \"vibe\" but it was way over-the-top and ruined the whole experience.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "Cute spot! Best recommended for drinks. Don't bother to order the slightly overpriced chips/guac/salsa because the chips taste like they've been sitting in the kitchen since 1992. Fish tacos are pretty good. Capirotado is delicious! Service is EXTRA. I believe our conversation was unnecessarily interrupted without so much as a, \"pardon my reach\" to fill our water glasses after every few sips... at least fourteen times, zero exaggeration. Our waiter even asked to \"clear these papers\" within seconds of us signing for the bill. Lol. Final recc: pop in for a drink and a taco or two at the bar if you're in the area.", "author": "Britt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Amazing authentic Mexican food with a NYC twist! Staff was amazingly attentive and actually seemed to like their workplace and fellow employees.  Drink menu had lots to intrigue me, including spicy margaritas and a great sangria. Patio in back is shady and dog-friendly, and bathrooms were spotless. \nMy favorites...fish tacos and crab churros! \nAlso a spicy pink grapefruit margarita...\n\nAs we were leaving I noticed a growing line of non-locals waiting to get in to an Italian place next door...silly tourists! Go to Gran Electra for a much more memorable meal!\nCan't wait to go back, it's worth the trek. (oh, and there's a parking garage a few steps away and great amazing views of the bridges...great walking area!)", "author": "Ann G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "I was in dumbo Brooklyn and we decided to try this place to grab a quick taco and drink, we didn't order any entrees but each taco order came with 2 tacos for $10, I've had better tacos for less but it wasn't bad just not sure if if I would come back since I've had better elsewhere for cheaper", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "This was an impulse stop, but some at Brooklyn Distillery raved so we went. The appetizers were good, but the mains (beef that I can't remember the name of and tacos) were excellent.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Food: 4.5\nDecor: 4.5\nAmbiance: 5\nService: 4.5\nValue: 4\n\nThis place had a great vibe. It also had very good food (especially fish tacos), and the best margarita that I've ever had. We didn't get to sit outside, but the back deck under the Brooklyn Bridge looks amazing.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "The atmosphere is nice. The service was quick . I ordered the grapefruit margarita .. Pretty good! The guacamole was ok , however their fish taco was really good! I saw that they have backside patio seating ! Can't wait to try it out on the next time around.", "author": "Diana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "Gran Electrica has a nice vibe and a great backyard space. The guacamole was good but not great. Churros were fantastic. Unfortunately everything else was three, or even two stars. We were told we had to wait one hour for a table outside, and were happy to, but it ended up being a 90+ minute wait. We sat at the bar for about 45 minutes, ordered drinks and guac, and the guac took about 30 minutes to come though we asked about it several times. The servers looked exhausted and it was a busy night, but it would have been great to get a little bit more attention.", "author": "Anshu S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "OMG! The atmosphere is so cute. Eat outdoors if you can. There's more space and the ambiance unsuitable for an intimate dinner with bae or a casual lunch with a group of friends. \n\nI enjoyed the special of pork belly w. Tortillas on the side. Yuuuuum! The corn was good too. It's a spin in the traditional Mexican treat, instead of a cob of corn, you'll get a bowl with the toppings sprinkled atop.\n\nFriends of mine had chicken tacos, carnitas tacos, the sangria rose, and a few tacates. Great!", "author": "Nicohle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "1 star only for ambiance and waiter was nice, however, food was terrible no taste and the size portions were bite size.  Everything we asked for on the menu they did not have or ran out of.  The drinks were not strong at all and when we asked for a cosmo it was the worst cosmo ever.  Guac and salsa orders are the size of little saucers, no taste \u0026 get this $16 bucks.  Owner new we were not satisfied and just ignored it.  Save your time, money and don't visit this spot, total waste of money...How can you ruin Mexican you ask?  Well they sure did!!!", "author": "Jeanese S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Gran Electrica is so charming. We came here on a detour on the way back to our car while spending a day at Brooklyn Bridge park.. and I have nothing bad to say about this place. They take reservations (it was around dinner time on a Sunday evening). We sat down at a table by the bar until the hostess alerted us that a table would be ready for us in the backyard. \n\nWhile waiting, I tried two delicious margaritas. I had the Margarita de Pepino and the 20/20 Margarita. Amazing. Also tried the spicy Margarita de Toronja Picante after we were seated. \n\nDefinitely will be back again! Perfect on a summer night or crisp autumn afternoon!", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "This was a Mother's Day treat! Luscious rosé on tap, a table for two, guacamole perfectly spiced and yummy quesadilla and grilled chicken tacos.\nTerrific vibe and super service even though it was a busy day.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Fantastic service! Delicious drinks, the guac yum and the lengua tacos mind blown a must try!!!", "author": "Helen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "I LOVE this place. Their patio is unreal in the summer - super romantic and lovely. \n\nDefinitely make a reservation if you can - it can be pretty packed inside. I had my birthday dinner there last month, and they were super accommodating of our group of 9 (if you have 10+ people, be aware that you'll have to go with a pre fixe menu). We were seated basically immediately and service was quick and friendly (and our amazing waiter did not complain when we handed him 8 credit cards at the end of the meal). It can be a little dark inside, so it's not a place I would take my grandparents, but great for dinner or drinks with friends!\n\nI get the fish tacos every time I go, and am the actual happiest person. The fish is crispy, the slaw is excellent, and they're filling. I usually hover between 1-2 orders. (I think it's 2 tacos to an order? I usually end up eating 3 total tacos). \n\nTheir drink options are also wonderful. I got the Ay Mami at my birthday and loved it. Highly recommend this place as a date spot, but like I said, go in the summer and try and sit on the patio.", "author": "Zoe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Overpriced for what it is. Would only recommend coming during the summer when you can sit in their beautiful backyard. The tacos and guacamole were just ok, nothing special. The cocktails were nothing special at all, and the beer selection (obviously since it is a Mexican restaurant) was limited. This place is slowly becoming a tourist attraction due to it's great location.", "author": "King K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}