{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Gran Electrica Restaurant...July 2014 - 5 Stars: oo oo oo this place started right up there at five stars, and stayed there all night. Stuck way down in the shadow of the Manhattan Bridge, this was probably the nicest find of our trip. The building looks like an old three story brownstone...with three doors in front - one on each side leading to the upper floors, and the center door into the storefront entrance of Gran Electrica. We walked up the couple steps to enter, and were promptly escorted the length of the building to the backyard patio outside. It was beautiful...a dozen tables with awnings, lights strung among the tables (yes the lights all worked), a small bar in the corner, and a larger tent like covering to make sure inclement weather did not disturb. Even though we were in busy Brooklyn, this was a perfect getaway spot - warm, inviting, quiet, and romantic...all depends what you were looking for.\n\nThe food here was Mexican but brought up a few levels...sort of like what Rick Bayless tries to do at Frontera Grill in Chicago. The object is quality, not quantity. We started out the way any Mexican dining should - guac/salsa/chips/margaritas...the guac was fresh made and you could tell by the nice tender chunks of avocado...homemade chips, not greasy...fresh chopped salsa also. Just enough heat all around to remind your taste buds they were out on the town. Margaritas (Pueblo Viejo tequila) were small but potent. We also finished off a couple of glasses of Godello (Rafael Palacios) Spanish white wine - very nice even though just a 2010.\n\nOur meals were an assortment of plates - sopa de frijoles (antojitos), camarones (a special that night), carnitas (pork tacos), enchilada, sides of plantains and more frijoles, and a second order of guac and chips. For my taste they really rocked the (1) pork tacos...nice tender chunks of pork shoulder with a bit of cilantro and onion...perfection and (2) the guac and chips...all fresh. \n\nAnd now I know what the neighborhood acronym DUMBO stands for - Down Under the Manhattan Bridge Overpass - see pic. This place is a winner ... it is a bit pricey but worth it ... and we'll be back next time we are in the New York area.", "author": "Rick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "This is one of those reviews I'm afraid to write because I love this place so much, I fear the secret will get out.  On a nice day the back area is idyllic - large and tree-covered with great music, it's the kind of place you lose track of time. The service is always warm and the food always outstanding. Fresh delicious ceviche, creative spicy mains, and margaritas...oh the margaritas. Great space inside for for a fun group dinner or a chatty date. And the location in DUMBO is perfect for daytime or date night activities before/after. A million stars.", "author": "COQUEDdotCOM C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Came here with my friend who just moved to the area and we had a great time here on all counts.\n\n#1 - the venue itself is lovely. We came at night for dinner and sat outside in their back patio. The decor is warm and romantic. There was a good crowd for Friday evening, but it wasn't too packed.\n\n#2 - the staff was great. The hostess sat us right away without a reservation and were very nice. Our server was Kiki and she was totally awesome. She easily made good recommendations for the menu and helped us pick out tasty margaritas. When she learned that we were new to the area- she was kind enough to recommend other great spots to check out. She really went above and beyond.\n\n#3 - we loved the food! Started things off with some yummy chips and salsa and then moved on with serval small plates to share. We enjoyed it all and look forward to trying more. \n\nNot sure why this place doesn't have a higher rating- our experience was wonderful and we will definitely be coming back. Well done! :)", "author": "Kimi I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "After a long bus ride sans lunch I was starving and looking forward my first night on the town in NYC. A group of us went to Gran Electrica for dinner at the suggestion of a DUMBO native. We had to wait a few minutes for a table outside to be ready, so we headed to the bar to order a round of micheladas. Before the bartender caught up with the rest of his orders, it was time for us to be seated. So, they served our drinks to the table after closing out. The michelada was spicy just the way I like them.\n\nMy boyfriend and I shared three orders of tacos--the pescado estilo ensenada, the tinga de pollo, and the carnitas. They were all very tasty, and I liked them all equally. However, I would suggest ordering two orders for yourself because they aren't that large or filling.\n\nI enjoyed my meal at Gran Electrica, and the back patio was a nice place to dine.", "author": "Alexandria T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Very cozy and vibrant in the heart of DUMBO/Brooklyn. An excellent choice to spend a good evening in a pleasant and positive atmosphere, especially if it is Taco-Tuesday. The staff is very friendly and ready to attend you needs.", "author": "Riccardo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "Interesting experience here recently.  First, the service was good.  The staff was attentive and friendly.  Questions about the menu were answered, course selection suggestions were provided, and overall everyone was friendly.  The setting is warm and inviting, the bar is attractive, and the restuarant is close to the waterfront and St. Anne's theater/warehouse for those who are seeing a performance.\n\nThe food itself is tasty.  However, entrees, although well priced, are appetizer portion size.  I was taken aback at how small the dishes were.  Also, it seemed that given that the weather was rainy the evening I attended (and a large portion of the seating is outdoor), the staff did not know how to accomodate the patrons or where to seat them given the oncoming rain.  Ultimately, it took about an hour before I was provided with my entree.  As stated, the staff was good and friendly, but there must have been some organizational issues that evening.", "author": "Rebel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I have eaten there once and the food and cocktails were amazing. The octopus was particularly delicious.", "author": "Craig N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "We've never bothered coming here even though we live about 10 minutes away: the reviews didn't make it sound worth our while. We finally did last week and I was really pleasantly surprised. They have a lovely little patio area at the back, the service was fast and friendly, and the food was very tasty.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Big things come in tiny window packages. Lol Popped into this \"speakeasy\" bar/restaurant and when I first walked in I was majorly impressed by the DJ spinning those house tunes. We had no idea what we're getting ourselves into when my date and I  sat at the bar. This place is effing huge! This won't be a food review because I didn't eat here but a review of the aesthetic of the venue (from the bar) There is seating galore. Gran Electronica may look tiny from the outside looking in, even that narrow entryway; but boy was I wrong. We realized there is more seating down the bathroom corridor and behind the bar. If that isn't enough for ya, there's even outdoor backyard seating as well. Perfect for the summer time and Sunday brunch days with the girls or crew. And did I mention the cute sugar skull like wallpaper everywhere? I mean even on the bathroom dryer! Lmaoooo. Like... where they do that at!? The staff was so friendly as well, even all the mixologist (not bartenders). They took their time crafting our drinks with all these fancy ass shakes and swivels. lol I'm definitely coming back here. This one is a must visit bar in Brooklyn and I will try the food. Quick tip make Rez cause this place was packed!", "author": "Kheeda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "What a great find!!  People standing in line for hours for pizza two doors down. Meanwhile this cool gem is sitting next door with excellent food, sangria and excellent service!  All in an enchanting back yard setting. We will totally be back!", "author": "Linda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Had an overall good experience. Came here for a work dinner. The prices were a bit high fit the Orion sizes but the food tasted great overall. The chorizo queso fundido was delicious! We also ordered the guacamole and chips which came in a little bowl not really worth the $11. I also had the fish tacos and platanos which were both enjoyable. The waiters were a little stalkerish but not really an issue.", "author": "Ruth D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Went here for brunch this past weekend. Food overall was very good, but maybe a tad bit on the pricey side (EX: my grapefruit margarita cost $13, two small tacos are between $7-$10). \n\nWe sat at the outdoor patio which was very lovely and the staff was friendly and attentive.", "author": "Meagan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Really fun trendy place to grab some food and empty your wallet in a few cocktails.\n\nWent here with a few friends for dinner. We grabbed a few margaritas from the bar which were around $12. Not crazy expensive but it felt alittle over priced for what you got.\n\nWe eat out back which was absolutely beautiful.  If you are looking for a intimate date spot this is your jam.  The lighting is dark but gives the area a great feel in addition to the ivy that's creeping up the brick. The seating is positioned almost under the Brooklyn bridge giving the area a very unique feel where you almost feel like you are seated inside.\n\nThe may is limited and portions are small.  The prices are proportional to the serving size but you will need to order taco plus an appetizer per person if you are looking for a normal portion size.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "Went for my nieces 25th birthday. The decor is lovely and the music sets the vibe, we went on a Sunday for brunch. Once the whole party arrived we waited about 10min to be seated in the outside back patio. The bar in the front of the restaurant had lovely bartenders and one who made me a mocktail so I could fit in with my party since I'm 9 months prego lol. So from what the party was told my niece set up a pre fix menu for the whole table which was for about 12 people.. Now when I think of pre fix the party gets a sufficient amount of food family style served to the table to share which is fine .. What I didn't like was that the more expensive the product of food was the waaaaayyyy less we got, let me further explain.. We got guac and salsa first which I loved both but they gave us bottom of the bag tortilla chips so we had to keep asking for more chips ...Our first meal was a cabbage salad with jicama for that we got about 7 full plates everyone got and we even had more left over ... to make that salad it cost about let's say $6 then second course huevos rancheros... we got 5 plates of it to share with 12 people mind you only 2 eggs on each plate now huevos rancheros is probably $8 to make ok fine.. Next  there were 3 types of tacos that were up next to come out chicken tinga ground beef and beer battered fish tacos..tell me why we got only 3 fish tacos and 3 ground beef no chicken... I'm sorry there's 12 people here lol half of didn't try any of it .. I got lucky cause being the prego one people made sure I got whatever I wanted but still it wasn't right.. I'm sure they use grass fed grain fed hand caught meats lol so of course the more pricey food was given sparingly they also gave us a ton of sweet plantains which cost 4 for $1 at my grocery store so no big deal right then the dessert lol which was chocolate pudding and churros our table got 4 churros and like 6 chocolate puddings lol my sister had gone to the restroom to wash her hands and came back like where's the churros she was pretty upset she couldn't try one but I got one of course and it was nothing to rave about seemed under cooked on the inside and tasted super eggy.. Ladies on Roosevelt avenue in queens probably have way better ones and longer .. Which I tried to tell her but considering the bill she still wasn't happy about it we asked our waiter who was sweet but forgetful if they could bring more than just 3 churros came back saying we don't have anymore . This place made my niece sign and fingerprint a contract for her reservation and that if no one should up she would be charged $1,500.00 lmao like what?!!!! So you know a huge party is coming yet don't have sufficient amount of food for any one ??? The bill came out to $1,100 lol half of us were hungry still plus for the price of the pre fix the total should have been $600 fine but where did that extra $500 come from?!?! def not from the drinks only ...I noticed they had a lot of add ons and unfortunately I didn't have the patience to go back and forth with anyone.. We paid and left but never again food wasn't crazy delicious to say I'd come back to fight for parking and pay hefty bill for something a Mexican food truck could give me way better taste and price. Nice place though", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Wow! Growing up in Texas, I had a lot of Hispanic food but this was amazing. I had their vegetable quesadilla and I ate every last bite. My agency took our client here and he was very impressed with his dish as well. \n\nThe service was very friendly, kind and helpful. I would highly recommend going here and I will be back when I'm in the neighborhood.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Backyard ambience is on point. Food is subpar. Drinks ok. This isn't racist but, all the darker skinned help was amazing. Everyone else, eh.", "author": "Frenel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Soooooo Goood!!! The fish tacos were the best tacos I've had, the texture and combination of flavors were just right. My boyfriend had the chorizo quesadilla and he also loved it. Make sure to get sweet potatoes on the side with CHIPOTLE MAYO. Can't wait to go back!!", "author": "Natalia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "What a lovely way to kick-off the weekend and bid farewell to the work week. I ordered a spicy margarita (or two), and enjoyed far too many chips with their amazing guacamole.\n\nIt's a shame I had to leave for an appointment, I would have loved to sample more of the menu! \n\nI'll just keep craving the chips and guac for now...", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "Been here a couple times, once with a group of 8 where we sat in the backyard, and once where we were sat at the bar for a quick drink. The backyard is actually pretty cool. Nice space to just chill with drinks and food. I've enjoyed the margaritas they have here even though they're a touch too strong (or maybe because of it). Hasn't been more than a place we've stopped at while en route to somewhere else, but it's a pretty cool space. A great option to have near Brooklyn Bridge Park.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Such a fun outdoor patio directly underneath the Brooklyn Bridge. Cute outdoor bar and friendly staff. And the food was great too! Must get the CARNITAS TACOS - so good. The SANGRIA ROJO was amazing too and came in a cute pitcher with fresh fruit pieces. I was also obsessed with the custom wall paper designs - I'm a sucker for the skull designs.", "author": "Monica S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}