{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Food was delicious, although not massively filling. The service was good. The outside area was a little loud, as was the inside area, but for the most part it was a great restaurant to go to.", "author": "David P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-15", "description": "I've got to agree with the other negative reviews here. Cute concept, terrible execution. Formerly Pub One (possibly the worst restaurant in the world, see my old review) this spot has lots of charm: warm decor, nice long bar, a decent sized dining room, and most importantly a large sprawling back patio nestled away in the back. BUT- it is so expensive, the food is boring and under-seasoned (yes, the tacos are way too small and had barely anything in them, we had sweetbreads and beef), the ceviche had no punch and barely tasted of anything other than lime juice, the guacamole portion was a joke, and the salsa had some kick but miniscule portions put a damper on my efforts to spice up my dinner. The one thing that was worth the money were the drinks. We sat at the bar on a busy night, the place was totally packed with a 30 minute wait for a table and we managed to grab two seats. Our bartender was fast, friendly, and mixed excellent cocktails. We tried several margaritas and the spicy one was perfect, he also made a mean michelada. So thank you bartender! I've lived in Dumbo for 4 years now, and was so thrilled/excited/desperate for a new restaurant, I really had my fingers crossed that this would be a goldmine, but it was as big of a letdown overall as others here have suggested. I also have several friends who have gone here since and were also disapointed. It's busy because there are really only 6 other restaurants in Dumbo, and most of them are terrible! With all the new condo developments and young couples with kids, there is really no where to eat. Tragic given that the hood is so great in all other respect. But I digress- We spent $100 for a dinner and drinks and left hungry. When we got home my husband made a microwaved pizza. I would go back for drinks in the summer but would never pay for a full meal there again. I hope that the owners- who I have read about extensively and who seem passionate about food and their restaurants- will take some of these reviews seriously and implement some positive changes!", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "We ended up here after walking across the Brooklyn Bridge and discovering that the line at Grimaldi's was a hundred people deep.  We ended up at Gran Electrica, on the outdoor patio in the back.  There's a limited menu out there - different types of soft tacos, some other small plates. It's also CASH ONLY outside.  We had the pork tacos and the seta (mushroom \u0026 potato) tacos,a plate of the pickled vegetables, the guacamole, and the scallop ceviche.  All of it was delicious and had some kick.  Good selection of beers \u0026 a delicious michilada (good + spicy + ice cold!)  Inside there is a huge selection of tequila (amazing selection of sipping tequilas)  - they rim the glasses with their own specialized salt blend depending on which tequila you choose.  (Our friend who is a total tequila snob was in heaven.) There was a DJ mixing up some great tunes, which added to the atmosphere of being at a very cool afternoon garden party.  We will definitely be back - for more time in the garden and to try the main restaurant!", "author": "Piper E."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}