{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-29", "description": "My first few visits to Gran Electrica were wonderful (summer 2012), but my last two trips have been pretty \"meh.\" The flavors were unremarkable (bland!), the execution seemed substandard (store bought chips?), and the menu was less interesting (I miss those chicken livers!). What happened? Go back to whatever you were doing before!", "author": "Kristen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "My friend and I planned to have a fun day in the city by walking across the Brooklyn Bridge and then getting pizza. When the line for pizza was down the block, we decided to wander a bit and found this place. The tacos were delicious and I loved the skeleton decor! Also excellent margaritas. I definitely recommend this place if you happen to be in the area.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "This is definitely a great place for drinks. Refreshing and tasteful. Been here with a small group of friends, twice (we sat at the bar) we ordered appetizers: guacamole, salsa with chips, tacos and quesadilla, they were all decent. Overall had a nice time. \n\nLost stars because my husband and I came here for dinner since we agreed the bar atmosphere was pleasant. We started by ordering drinks and appetizers, they took a little long but nothing compared to our entrées, literally over 45 minutes. The waiter never acknowledged the fact that we were waiting so long. Some lady approached us to refill our cups with water and said our food would be out soon, (we still waiting a while). When we finally got our entrées, I ordered meatballs that were salty, not my favorite. Husband had the steak, it was good. We ordered sides: rice and beans. It was literally white rice with some sprinkled cilantro...seriously. I don't even remember the beans, only the fact that we paid extra for each. I was about done with this dinner, until we looked over at the couple sitting next to us who were leaving, when they actually arrived much later then we did. \n\nWe still left a nice tip. We don't plan on having another dinner here. We'll stick to the bar.", "author": "Belinda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Had a really nice outdoor dining experience here over the summer.  Located literally right below the Brooklyn bridge.  Chips and guac were great along with drinks before the meal.  The entrees were served relatively quickly given the crowd and everything tasted great! Had to walk a few blocks to catch a cab after dinner, but other than that I cannot complain.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "I was dead-set on a slice of Grimaldi's Pie...but I didn't believe the hype on the line situation. \n\nWe walked around for a bit looking for a back up plan, and found an absolute GEM. Didn't notice too many people at first, which is never a good sign, but we were brought out back to a very cool and cozy courtyard with plenty of space (between and on the tables). \n\nThe website calls it \"the sexiest backyard in Brooklyn.\" \n\nThe drinks were awesome - I had the Mi michelada and was not let down. They let me sub out a preferred beer over the one listed on the menu with no question. Awesome. \n\nMenu is simple, but very tasteful and seems authentic to me. Someone wrote a review that there were no chips and salsa, but when we got the (awesome) guac and chips, and then our entrée, they brought out four different (one very unique) salsas to go with. \n\nHad the fish tacos (as usual) and was very happy. Everything else sounded really good.\n\nHad to ask twice for some extra chips, which was a little embarrassing, but the service otherwise was great. Friendly and attentive but not on top of you. Never had an empty glass of water. \n\nOverall, very very pleased and would definitely like to return.", "author": "Matthew W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-25", "description": "You cannot top the location of this place. After a margarita or three, you can stumble out into the spring air, skip across the cobblestones, and gaze at the magnificence of the Brooklyn Bridge and the twinkle of the city.\n\nMargaritas were tasty and boozy and New-York-City-priced. You should have at least two.\n\nAnd then you should leave.\n\nDon't eat the food. Seriously, don't.\n\nI am generous with my love for tacos. I like 'em all, from Taco Bell to Old El Paso in my mom's kitchen to food trucks in LA to a roadside stand in Nevada. I really, really like them. So I'm not sure how Gran Electrica managed to mess them up so abysmally. My friend and I split the chicken tacos, which were so dry that they were barely edible, and the special, which was steak tacos. The steak tacos were *so* spicy that they hurt me. My lips and tongue burned for an hour afterward. I almost couldn't finish my taco, but I managed to scrape off most of the pico de gallo, which seemed to be the offender. You'd think that would come with a warning, as we couldn't be the first people that night to have that complaint. I think it's safe to assume that gringos can handle low to medium levels of spiciness, and if your food has more than that, it should come with advanced notice. This was just cruel.\n\nTo start, we had the guac and chips. You know when you're having a party and you're too lazy to make fresh guacamole, and so you buy that weird, yogurty-textured fake crap from the grocery store that has no chunks of fresh anything in it and is eerily smooth? Yeah, that. For $11. \n\nCLIFFS: drink, be merry (don't eat).", "author": "Miranda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "I've been here a few times and I've had a variety of experiences. The first few times were great and then I had a few times with not so great service. Tonight was very good. We got there for happy hour drinks. I had the picante margarita, which is amazing if you like spicy things. My friend had an Ay Papi and that was really good too. The guacamole is great as well as the salsa. I'm Mexican so I really appreciate a well made and spicy salsa and this was up to my standards. I had the special which was skirt steak tacos. It did not disappoint. Very flavorful and yummy. My husband had the carnitas tacos and he loved them. My friend ended the dinner with a coffee and I was impressed they served it in a French press. I love the environment. I can't wait to come back in the Summer to enjoy the great outdoor area in the back. The only thing I didn't like was that when the waiter gave us our check he couldn't wait to get us out of there. He kept lingering by our table to grab the check as soon as it was signed. I don't like to feel rushed or hurried at the end of a meal. Other than that, I do like Gran Electrica and will definitely return.", "author": "Vicki K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "One of the better dining options in the Dumbo area if you're tired of eating pizza and shake shack. Whether you're inside or on the back patio, this place gets an easy 5 stars for ambience - chill/sexy enough for a date, yet lively enough for a group. Service is also always top notch - of the 15+ times I've dined here, I've yet to have a poor experience. I see a lot of reviewers hating on the food - have never tasted anything here I haven't liked. We usually go with the tacos, all of which are killer, but I would recommend the suadero, carnitas and any of the specials. The setas quesadilla is also a favorite of mine. Other reviewers have wined about the tacos being too small. Simple solution here: order more tacos. Wash those tacos down with a few cucumber margaritas and you'll leave smiling and satisfied.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Cons: Gets crowded and really loud. They messed up our order (only slightly), but instead of taking that dish off the bill, they gave us free dessert...which isn't necessarily a con, but I'd rather have the bill be cheaper than get more food :P\n\nPros: The guac was great. The drinks were strong and super tasty. The other dishes we shared (a variety of tacos and other entrees) were all good, but the best was a delicious delicious seafood tostada-like dish. Great service as well.", "author": "Taraneh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Margaritas are fun though a bit small.  Food is delicious though!  Try the fish tacos.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "I and wife went here on a Friday night. After a long 'but to be expected' wait we were seated on the open patio. It was lively and the environment was absolutely great. \n\nI had the much hyped fish (fried cod) tacos which were bland and mediocre and my wife had the chicken tacos which she thought were average. However, on the bright side, the guacamole was plentiful and very, very good. \n\nThe service left a lot to be desired as it was extremely slow and the server was quite forgetful. But i have a feeling that was just him and am not holding it against the restaurant because the hostess was the mostess.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "Went here on a Friday night as a walk in. We waited longer (45 min total) to sit on the outdoor patio. The patio is very cute and would be great for a fun night out of drinks with the girls. The inside is actually really cute too, and in terms of decor, you cant go wrong inside or out. \n\nOutside of the ambiance/decor, the rest of the experience was so-so. The food was hit or miss. We got the guacamole, and rice and beans to share. Rice was really good- had flavors i had not tasted in rice in other locations. Beans, not so great. I ordered the chicken tinga tacos. They were good, not great. My husband had the fish tacos and said they were not good. Our server also wasn't very good. He was slow, and not very attentive. We had to ask other waiters for water, napkins, our bill, etc. Our waiter walked by often but wouldn't stop to check on us. I agree with other reviewers that the prices are high for what you get. For example- no sides, even rice and beans, come with the meals you order. AND, we had to order the rice and beans separately from each other. So 2 tacos were about $11, plus $5 for a small rice, and $5 for a small order of beans.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "New to Dumbo, a friend brought us here for a late dinner and we left absolutely satisfied. The taco portions were perfect, I recommend the carnitas. House margaritas (wonderful) and great gauc. Lovely outdoor atmosphere and pretty good service. I am a huge fan of contemporary Mexican and this place did not disappoint.", "author": "Alli Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "Pretty underwhelmed with this place. Not sure how you mess up grilled corn, but it was inedible. The backyard was the only plus.", "author": "Damien C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "I love this place.  The spicy grapefruit margaritas are the best I've ever had. The food is all super fresh and delicious.  I could eat a dozen of those brisket and carnita tacos.  A nice change of pace from the cheese-drenched food at your typical Mex place.  It's more like La Esquina or Empellón Taqueria, but better IMHO!  Inside is warm and cozy. And the backyard garden is huge -- highly recommended when the weather is nice!\n\nJust rated \"Best New Mexican Restaurant\" in Time Out Magazine.", "author": "Edmundo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Good service and authentic food. Tacos and chorizo con papas were both great but serving size was small. A great alternative to waiting in line for pizza just around the corner", "author": "Corinne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "This was an excellent experience on a trip to NYC,  the staff was extremely friendly from the time we walked in,  working with us to find a table in a busy night of reservations,  and letting us have a quick dinner without ever feeling rushed.  The food was great,  and the prices seemed to be on the spot.  Servings were a little small,  but the tastes served to overcome.  I would highly suggest this for a casual trip in Brooklyn.", "author": "Nate F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-05", "description": "Not thrilled, waited 1 hour for 2 orders of skirt steak which both were cooked at the wrong temp. Seriously! Then waited another 25 minutes just for it to come back burnt ? Really skirt steak $24 which takes 5 mins to cook.  You can also twist your neck looking for any staff personnel to help. I won't return nor do I recommend,  far more better places out there.", "author": "Henry C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-28", "description": "Overpriced and underwhelming, yet knowledgeable service. Food was good, at least the \"brunch\" tacos served out in the garden, but $8 for two palm-sized tacos with a spoonful of something inside was just too much. $90 for 6 tacos, a tiny torta, and \"guacamole\" that is$13 and Is basically just avocado, and 4 drinks. Won't return.", "author": "mickey i."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "Came last weekend for a quick dinner with my honey. We had 2 delicious margaritas to start the meal. Highlights were: Mexican shrimp/clam cocktail, Guacamole with fresh chips, Ceviche ( forget the name, but it had crab or shrimp on a tostada with avocado) and both the fish and beef tongue tacos. Loved the ambiance and the food was yummy and authentic Mexican street food. Can't wait to come back to this Lil gem.", "author": "Sarah C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}