{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "This is a very cool Mexican restaurant in DUMBO. Its easy to walk past the nondescript entrance. The restaurant is across the street from a truck parking lot and auto shops. Old Brooklyn meets New Brooklyn!\n\nThe decor of the restaurant is homey AND cool at once. The wallpaper in the bar area is so unique and fabulous that I have to comment on it. The bar is stocked with various Mexican liquors and friendly bartenders.\n\nThere are 2 small dining areas. The dining areas have wooden tables and chairs and the Mexican decor that gives it a very warm feeling. There is also an outdoor patio which I plan to return to when it gets warmer.\n\nWe chose to eat at the bar rather than wait 20 minutes for a table. I ordered the Bengali IPA, which was an excellent beer. I also had 2 tacos which were small but scrumptious. My friend had a chorizo quesadilla which  he seemed to enjoy. We received 4 types of salsa/sauces with our meals. They had vibrant flavors and ranged from mild to spicy.\n\nI will definitely return to this place for a full meal in the dining area.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "If you're in the mood for slightly precious Mexican food (along with the precious price tag), Gran Electrica is the place.\n\nThe food is good. We had the mackerel ceviche, which was quite nice--very fresh balanced with pomegranate seeds, and some solid ultra fresh guacamole for starters.\n\nMi esposa bonita had the market fish which was Dorade, served whole with the head (and sent back to the kitchen for a quick decapitation), served with some wonderfully scented and spiced rice.  I had the carne asada, ultra juicy and flavorful, cooked exactly to order, and rubbed with a coating and charred perfectly. This was served with tasty non-greasy fried plantains, and a good Mexican slaw.\n\nI had two cocktails, the apple flavored picso, which though small was good, and a picante margarita, which put some additional hair on my chest while nearly burning off my lips, but hurt so good.\n\nWe were praying churros would be on the menu for dessert, and our prayers were answered.  Served with both chocolate and dulce de leche dipping sauce, they were good (though Five Points is still my all time fave).\n\nWhy four stars and not five?  The food is quite good as well as that service, and I'll be back, but it didn't open up the heavens for the angels singing.  Perhaps it was the ridiculously high noise level that drowned out the angels singing?  It makes me think I'm getting too old for NYC \"hip\" dining when a table of faux hipsters half my age are yelling at the top of their lungs is supposed to add rather than subtract from the experience.\n\nI've lived in the area through at least six different restaurant incarnations at this location and Gran Electric is in the top two.  I look forward to coming back when the weather is warmer to dine in the back garden, which may mitigate the wall of sound inside.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "3 star food and 2 star service with a smile!  I'm feeling inclined to round down at this moment, so soon after my experience, but i suppose it could go either way.\n\nThe food: \nbefore ordering drinks and soon after being seated we were asked \"would you like guac and salsa for the table?\"  \"Sure,\" said the two unsuspecting babes i was with. FIFTEEN DOLLARS.  Yeah, it was dece.. but guac is ALWAYS DECE.  NEARLY TWICE THE (tiny plate of two underfilled) TACOS PRICE (roughly $8-$11).  Salsa was mildly spicy tomato soup.\n\nMy brisket tacos were a bit spongy (read: not dense and lean, not fatty and savory.  how?!) but edible.  My companions enjoyed their tacos a bit more, but i heard no particular praise.\n\nThe kicker:\nI had two diet cokes, each of which i'd finished nearly as soon as they'd been served to me.  Each came in a glass i'd estimate to be of about 6oz capacity filled with 3oz of ice.  They were 3 DOLLARS EACH.  I was NOT informed that there was a refill charge for these miniscule glasses, only asked if i'd like another comically small DC.  After finishing the second and being asked if i'd like one more, i asked if i could have the next in a larger glass.  The waiter balked then answered \"maybe, but i think that might cost more.\"  \n\nI'D ALREADY BEEN UNKNOWINGLY CHARGED $6 FOR 6oz OF SODA.  Does $12 per can sound reasonable? Brotha was thirsty!\n\np.s. patio is lovely.  nice spot to hang out if you're not particularly hungry and would like water or beer.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Love the intimate and upscale feel of this place. Bonus points for having nice bathrooms.\n\nMexican 75: Strong and tasty, as expected of a citrusy cocktail.\n\nCeviche: I think this was my first time ever having ceviche (after watching countless competitors make it on Chopped lol). The fish was tender, and the dish was overall fresh and yummy. It only came with two crispy tortillas, though -- definitely not enough. We ended up spooning it over our tacos, which was also good.\n\nGuacamole: No complaints about the guacamole. The chips are the thick kind (think Stacy's pita chips), so whether you like them depends on your preference. I personally prefer thinner chips, but whatever. We also ended up having more guac than chips so we used it on the rest of our food too. Yum.\n\nTacos carnitas: Tender, flavorful meat.\n\nTacos lengua: First time (knowingly) having tongue. I expected it to be lean and a bit tough, like jerky, but it's actually quite mealy and rather dry. Not sure if I'd recommend it for non-tongue-aficionados.\n\nCarne asada: Our waitress didn't ask how we'd like our steak, and it ended up being cooked medium. It was quite juicy and chewy. The accompanying plantains were nice, and I loved the pickled shredded salad or whatever it was that also came on the side.\n\nFish: Don't remember what this was called, but it was under the Grande category. (I don't think it's quite the same thing that's on the menu on the website since our fish was steamed, not roasted.) Anyway, the fish was tender and good but a bit bland; the underside that had been sitting in the broth definitely tasted better.", "author": "Laura L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "This was one of the best little know secrets in DUMBO. We thought about going into Grimmaldi's because there was no line and at the last minute we came here instead and I'm so glad we did. Cute little bite plates and the food was delicious and I definitely recommend the beet margarita!", "author": "Sunny D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-24", "description": "Decor great, garden lovely, drinks fantastic, food tasty - though some portions way way too small for the price point -- but overall, too expensive for Mexican food.\nExample : small gauc and side of blue chips $13\nThat is simply highway robbery .\nDon't expect to get dinner and drinks for under $65 per person\nLunch has tiny plates  $8-$18 range and these are too small to fill your tummy with just one. The prices are more like Nobu but minus the expensive ingredients.\nGran Electrica, we are locals that would love to eat at your establishment more often -- please lower your prices.", "author": "Julie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Gran Electrica hosted my Wedding Ceremony and Reception this past weekend. The entire process was fantastic. Kate, the woman that handles events at Gran Electrica did such a great job. She asked all the right questions and made the process very easy for me. The food, drinks, and service, were all on point. All of my guests had only nice things to say about the venue and the people that worked there. The kitchen handled the special dietary needs of the Vegan, Vegetarian, and Gluten Free guests with ease. I can't say enough complimentary things about my experience. Thank you again Gran Electrica for making my wedding day so special.", "author": "Anne H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "My boyfriend and I went here after hearing about it some time ago. We we're both craving tacos and Mexican in general. When we arrived we were seated quickly, which was nice. \n\nI would give this place 5 stars for the decor and ambiance. They have this really cool Dia de Los Muertos (Day of the Dead) wallpaper all over. There's exposed brick and a beautiful patio with a great amount of seating. \n\nWe both ordered two beers, the fish and beef brisket tacos and the skirt steal main dish. First off, everything, including our beers took a very long time to get to the table. Our waitress also failed to share the specials with us, as we kept seeing things not listed on the menu brought to other tables. The food was simply flavorless. Nothing was cooked improperly, but there must be flavor somewhere. We were waiting for something spectacular and it never came. \n\nOverall, I would recommend going here for a drink, but certainly not the food. Not if you want authentic Mexican.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "Very cool vibe at this place, and their outdoor patio is beautiful.  The inside has a big sweeping bar with a very lively atmosphere even on a Tuesday night.  I'd give the ambiance 5 stars.\n\n4 stars for the food quality, but I had to knock a star off for the extremely small portion sizes.  If they were going to be a tapas restaurant, I wouldn't mind so much, but the high prices of each dish were a big deterrent to ordering enough to feel fully satisfied.\n\nThe 3 star rating really came down to the high cost of the bill and the mixed drink quality.  We ordered $12 margaritas that were in small, stout glasses and tasted like lighter fluid.  Kind of had to psyche myself up for each sip, but they definitely got the job done.\n\nMixed bag with this place, but worth checking out for yourself.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "Great Mexican food in Brooklyn!\n\nFood: I like the combo of authentic Mexican dishes and seeing items such as tongue tacos and chicken liver. You'll also find less \"adventureous\" but equally as finger licking items like the fish tacos (Pescado Estilo Ensenada).\n\nCocktails: Tried the Margarita de Pepinom - a seasonal cucumber, cilantro, lime margarita. Yum!\n\nDecor/Ambiance: Modern industrial. The place was full but you didn't have to yell to have a conversation. Great for an intimate dinner as well as with a group of friends. Loved the wallpaper that combines Day of the Dead imagery with Brooklyn snapshots.", "author": "Taline E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "Pretty good tacos. --Loved the tongue taco! --Good chips an guac as well.\nUse the outside seating when possible.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "First I would like to mention the wonderful staff starting with the manager, Christina. It was my first time @ Gran Electrica \u0026 I felt very welcome. There was a space @ the end of the bar where the wait staff usually pick up drinks..I was able to find a stool \u0026 I was in no one's way..in fact several of the staff conversed with me in the hour that I was there!\n\nThe margaritas? Outstanding!! I usually never veer from traditional margaritas but the Margarita de Romolacha (made with fresh beet juice) \u0026 the Margarita de Pepino (made with fresh cucumber-cilantro juice) were other-worldy prepared by the 2 skilled bartenders that were on last night,\n\nFish tacos \u0026 the vegetarian taco option were delicious \u0026 were accompanied by 4 sauces that varied in flavor \u0026 heat intensity. I will return ASAP. As I do not live around the corner it will not be as often as I'd like but if you live in Brooklyn, Queens, Manhattan..or the Bronx for that matter, get on over to this little gem. I heard that they make a margarita with carrot juice in the summer. I hope this place goes the distance....the warmth + great drinks + yummy food make this place a true winner!!", "author": "Cee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "FULL DISCLOSURE:\nI applied for a job here once. I went in for an interview, and was thoroughly impressed by the back-of-house operation \u0026 the food coming out of the place. I wound up not taking the job, but still wound up adding the joint to my list of favorite places to go in BK. \n\nI normally don't make a point of reviewing places I've applied to work at, trailed for, or places I've actually worked unless I'm thoroughly impressed with the operation. \n\nThe Cocktail \u0026 Margarita menu is fantastic, the garden in the back is stunningly beautiful, and my wife \u0026 I both obsessed over the interior decor (The wallpaper is brooklyn-day-of-the-dead themed and it is absurdly and cute at the same time) \n\nThe food is rather fantastic too - \n\nThe Chile Relleno isn't battered and fried like I'm used to, but the pepper was fantastic and the cheese melted just right. \n\nthe Aguachile (Essentially a scallop ceviche) has just a slight bit of heat, and a wonderful fresh scallop texture. It comes with a whole fried tortilla, which we couldn't get enough of.\n\nAlso the Pozole: You have to try it, at first I thought it was a little underseasoned - but the dish comes with a plate full of things to add to the stew - pork rinds, rock salt, avocado - the works, and it was quite possibly one of the most filling stews or soups I've had in the city. \n\n\nI'm the kind of guy who loves the food carts in Jackson Heights or hole-in-the-wall Mexican joints, but this place shows the cuisine cleans up pretty nice. \nSo there you go. It's all really good and hopefully soon I'll have the time to go back.", "author": "Bryon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-06", "description": "The ambiance was great. The worst guacamole I have ever had, the ceviche was tasty but the portion was very small for the price. The carnitas tacos the meat was good but it lacked other ingredients that would have made them wonderful.\nI won't return", "author": "Benny G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "I have been to this place a couple of times now. First experience was strange....getting salsa with my chips and guac was for some reason very difficult. It wasn't like I was asking for spaghetti; this is a mexican restaurant clearly you should have salsa. Needless to say, the second time I came to eat here I did not not encounter that problem. Maybe they changed their policy of no salsa with chips, or my server the first time was completely incompetent. \nFor my third trip, I came for a late lunch with my parents, who were visiting for the day. It was a beautiful fall day with lots of people out and about in Dumbo. We show up to the restaurant only to be TURNED AWAY because the ENTIRE restaurant was taken over for someone's wedding. First off let me say that is completely pompous for a couple to just take over a restaurant on a Saturday and good luck on your divorce. People and their weddings have gotten completely out of control....You can't even take a walk through Dumbo without seeing some cheesy couple taking engagement photos or some assholes who are getting married and think that for a day they truly are the most important people on planet earth. \nI just want to say to the people running this restaurant that it is BAD BUSINESS closing down your establishment for an entire Saturday.  Instead of just saying no to two people you had to say no to every person walking in. Because of this I don't think I will be coming here ever again....mainly because who knows they will probably be closed for a wedding. I'm sure the wedding paid a pretty penny for the restaurant for the day but it was at the expense of losing future business from everyone they turned away that day.\nSo if you do end up coming here while walking through Dumbo on a Saturday and they are closed for a wedding, let me give you some advice.....GO TO PEDRO'S!!!!\nPedro's was the silver lining and perfect fix for my Saturday Mexican craving. They are only a couple blocks a way and a few minute walk on the corner of Jay St and Front St. It was just a lovely surprise with great food (tofu burrito for vegetarians) and they will make you an amazing fresh margarita without margarita mix.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Cool little spot in the DUMBO area of Brooklyn with delicious guacamole and spicy margaritas.  I'll be back!", "author": "Paul H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-21", "description": "Mediocre. Was excited to go here for their advertised all-day Cinco de Mayo celebrations, but alas there was no DJ to be seen or heard, which immediately put a damper on my party mood.\n\nAfter an expected annoying wait, we decided to just eat at the bar. On the plus side, the bartender was pretty attentive for a crowded scene and she poured us some mean margaritas. I highly recommend the Margarita de Toronja Picante if you can handle the spice (ingredients include habanero-infused blanco tequila, jalapeño syrup, and spicy grapefruit salt). \n\nThe food on the other hand, was seriously lacking and for the most part, ridiculously over-priced. The guac we had to start had ZERO flavor and the fish tacos I ordered were only salvaged by loading it with their hot sauce. Oh, and at $11, I really thought I'd get more than two TEENSY tacos that I finished in a grand total of four bites. \n\nStill hungry, I ordered the pancakes, which thankfully at $10 were very well priced. Two to an order, they were thick, fluffy, and delicious, BUT...they did not have syrup!!! How do you not have syrup at a restaurant when you have pancakes on the menu?? Yes, they were served with some dulce de leche, but when you have some dense pancakes like that you really need some syrup to moisten them up! Luckily our bartender came to the rescue with some agave she had on hand. \n\nI might come back for some of those yummy margaritas but only if they up their food game!", "author": "Nameeta K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Staff was friendly and the atmosphere was good. Everything involving the food was below average. Meat was dry, salsa tasted like marinara, and tacos were in the same standard.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "It's funny to see so many positive reviews here from other Californians. Having lived in San Diego and LA for most of my adult life, I've learned to avoid most Mexican restaurants on the East Coast. Until Gran Electrica, my only exception was Tacombi by Chef Aaron Sanchez (the maize y poblano tacos are ridiculous, and right-priced). \n\nAnd like many of the Cali reviewers, I agree that the fish taco at Gran Electrica is legit; Chef Sam Richman has captured pure Baja goodness and elevated it only slightly by putting a superfine shred on the sweet, white cabbage. I mean, why mess with perfection? \n\nWe were seated immediately (a midweek evening) on the twinkly, romantic patio. It was as if we had arrived on vacation. I like that they didn't plop down a giant basket of chips fried in days-old oil and bowl of jarred salsa. When we ordered the guacamole, the house-made chips were divine -- and even though we had to ask for it, the salsa fresca was great. The four salsas are a must; the tomatillo being wonderfully fruity with a subtly warm, sweet heat. \n\nGood selection of beers and wines but the margarita was a standout. Not a syrupy saccarine slurpee but a sophisticated sip that is as gorgeous to look at, served in a roomy tumbler with a delicate disc of lime.\n\nWe had them cut one order of corn in half and that was plenty. Not a hard recipe to make at home but always happier when someone else does the work, well. While we splurged and split a few dishes, I'd easily go for a couple of tacos and drinks and be in and out under $50. A great neighborhood addition!", "author": "Georgina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "I absolutely loved this place! I reserved for a table of 10 and for some reason some people decided to cancel last minute but the server didn't mind. Very attentive and nice people. This place is small but they do have an outside patio which will open Cinco de Mayo, so I'll have to come back to check it out. The food is excellent and they have a wide variety of tequila which I did not try but will do so next time! There's also a bar area but again, not a big place so keep that in mind!", "author": "Melissa L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}