{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "Really delicious and a very helpful waiter who dealt with our large group heading to St. Ann's Warehouse with a perfect plan for dinner and totally kept us on schedule.\nGreat wine \u0026 drinks too.  A keeper...", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-09", "description": "The truth is, we wanted to go to Governor.  We trekked all the way to BK to go to Governor.  And they were closed from the hurricane.  Apparently they suffered quite a loss and are yet to open?\n\nAnyway, we decided to walk back toward the subway and along the way we saw this cute, quaint little Mexican/latin-esque spot that I had heard of once or twice and decided to give it a go.\n\nThe food was OK.  The chicken in the chicken mole was a little dry, but the flavor of the enchiladas was pretty good.  And the salsa varieties were fun.  Overall, a not bad and yet not outstanding experience.  I love Mexican food (LOVE) and this was a solid average spot for it.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-18", "description": "I don't usually like margaritas. In fact, they're usually the last drink I think about getting at a bar. So it's to Gran Electrica's credit that not only did I really, really want a margarita, but that there was more that one that looked good to me.\n\nI ended up with the spicy margarita (a last minute decision, I was originally dead set on the beet), and it was, true to it's name, SPICY. But in a good way, with some grapefruit to tart it up and cool it down. The food we saw other people eating (we just got drinks) looked good too, but small portions. I imagine Gran Electrica is a great spot for low-key drinks and snacks, but I'm not sure I need to come back for a full meal.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "By far the best fish tacos I've had in New York so far, and having that as my first bite of Gran Electrica set good expectations.  A good fish taco is what I miss (almost) most of food back in San Diego, so seeing one in the style I'm used to was most welcome.\n\nTheir food comes out with an array of four salsas arranged in order of spice.  Fresh made, well seasoned and with a fair kick for their categories, you can tell the kitchen works to be refined and focused with their flavors.\n\nAlso noteworthy was the horchata, fresh made in house.  They use a bit of dairy, but its light and refreshing.  With every shot of tequila they'll give you a shot of sangrita as well, which can be comparable to a spicy bloody mary mix concentrate.  It's like a pickleback done if you traveled to the state of Oaxaca, Mexico and happened upon a local hipster bar, at least that's the way I imagine it.\n\nWith all this said, I'd call Gran Electrica an imperfect restaurant.  As of now it's only four months new so things may change, but from where I sat inside the restaurant the ambiance may have been too bright with music that kind of stood in the middle of nowhere.  It's neither hip nor boldly authentic Oaxacan/Mexican.  The other dishes that came out, while tastefully crafted and well cooked, didn't take me anywhere.\n\nI'd still go back, but without a doubt make sure to do it on a weekday (unless you enjoy crowds) and take a seat in their beautiful patio.  Brick, christmas lights, and the Brooklyn Bridge as a hovering roof gives it great character, so bring a date there.  You'll get good drinks/cocktails, decent food (sidebar: the churros we ordered for dessert were well done/crispy, and made me long for the ones at Disneyland), and the prices won't kill you completely.", "author": "Wes H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Great service from Matty. We ordered the Jerk Chicken sandwich and Dee Liner cocktail and they were both amazing! A great place to go if you're looking for a Williamsburg restaurant that isn't totally overrun by hipsters and is affordable. Great music and Caribbean atmosphere as well.", "author": "Aubrey P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "Fancy Mexican. Decent food. Terrible service.\n\nI really wanted to like this place, but I couldn't. We went for brunch and although we were seated right away, service was terrible and the good merely okay.\n\nThe waiter took forever to get to us (which can happen) and then repeatedly took forever to do anything from refilling water to taking orders. He was also kind of a jerk by snarkily correcting my date's pronunciation of the order. Then he brought out the wrong items. \n\nThe food itself was pretty good. Sort of a gussied up Mexican cuisine. We had Huevos Zapateros (soft poached eggs, spicy chile de arbol tomato broth, epazote, warm tortilla) and Huevos Rancheros (blue corn tortilla, sunny-side up eggs, roasted tomato jalapeño salsa).  \n\nIf I already wasn't so salty from the waiter, I probably would have liked it more.\n\nFrench press coffee was a nice touch.\n\nPrice was fine ($10-$15 per person for brunch).\n\nI wouldn't go back, but I might suggest it to someone else. Terrible service can be sort of random.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "The boys from Colonie opened this authentic Mexican joint at the beginning of the summer which leads me to claim that this is officially the year of the taco and Mexican restaurant movement to New York City. Gran Electrica's design is quite unique. The indoor dining area is separated into two rooms because an apartment complex splits it down the middle which is pretty cool to see. However, don't miss the opportunity to sit outside in the backyard at the pinic style wooden tables. The service outside is pretty quick but almost too quick. On a nice summer night, this is one of the most peaceful experiences you can obtain in New York, especially if you walk over the Brooklyn Bridge as the sun sets. \n\nSurprisingly, what's most impressive about the food is not the talked about Mexican fare but the extreme freshness of the seafood. The Peeky Toe Crab Tostada tasted like it was just caught and thrown off the boat and onto your plate. The combination of the crunch with the avocado, tender crab and lime is so refreshing. Although it's a perfect appetizer to share, its hard to part with the second half, so you might want to solo order this. The Sweet Maine Shrimp which could be compared to a ceviche was also my favorite, and I loved the salty homemade chips. Sadly, I thought the fish tacos were overly dressed in sauce and not something I wanted to continue to force down my throat. The manager Mikaya rules.\n\nLet's be real. If you aren't familiar with DUMBO,  you'll get lost walking the quiet streets in search of a dining destination, so thankfully you can now add Gran Electrica to your list and skip Grimaldi's Pizzeria -which isn't even worth it.\n\nCheck out my blog on my profile for food photos!", "author": "Alexandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Loved this Mexican place in DUMBO. I was in town from Paris visiting a friend living in NY and we found the place by luck on Sunday aternoon. There was quite a wait for a seat in the dining area so we decided to eat at the bar instead.\n\nWe ordered to start some guacamole to share, ok a little expensive at $11 but very good and served with some nice crisp nachos. Then for mains we ordered chicken tacos which at $8 seems reasonable. Very good and not to heavy either. These were served with a set of sauces and the waiter explained which each one was. The food seemed pretty authentic to what I had in Mexico a couple of years ago. \n\nThe staff were great and very attentive. The guy working at the bar was really friendly and even managed to make us a Pisco Sour which is some random little known Peruvian cocktail. \n\nI also loved the deco in the place and the skeleton hipster wallpaper was really cute.\n\nIn all for two Tecates, a guacamole, two plates of tacos and the cocktail we paid $50, which I thought was very reasonable. Hope to visit again next time in town!", "author": "Kate E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "1. Great interior and ambiance. \n2. Guacamole and chips, fantastic. It's a no frills guac, very avocado-y. \n3. Carnitas. Honestly, these are heaven. It's a sin not to order these. The tortillas are thin, but strong enough to hold the yumminess together without breaking (no need to double up like other restaurants do)\n4. Whatever the fish taco is, its fried. Did not expect that, but damn, it was hella good (dare I say perfection).", "author": "Grace P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "Food is fairly tasty, especially the scallop ceviche and guacamole. The beet margarita was very interesting. Everything else was \"meh\". Service is fine, not terribly friendly or overbearing, but the waiters can have an attitude. \n\nThe main problem was the price point. Everything seemed way too expensive for what arrived. Honestly, I can't put my finger on it, but I wasn't that impressed and the bill was way too painful to walk out feeling completely nuetral about the meal.", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "The mezcal selection is amazing, the mezcal coctail I had a was delicious, the service was great and the food was tasty. My only complaint is that the portions were quite small. Nice atmosphere. Give us bigger portions!!!", "author": "Galway M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Serendipitously found this place in DUMBO one night after an event in the area - literally as I said \"I feel like Mexican,\" we saw the welcoming glow of Gran Electrica, peered at the menu, and lo and behold, found ourselves seated in the fantastically lovely garden minutes later. It was a dream come true - the craving for Mexican sated, along with a last chance to enjoy the twilight of summer without the humidity and crowds.\n\nThe chips were crunchy, the tacos fresh and tasty, pozole verde was delightfully homey and fresh, the service friendly but not smothering - the only charming flaw was that they forgot my spoon. I also love that they serve Coronitas, the junior beer for a pint size drinker like myself.", "author": "Crystal W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Food good. Service good. Ambiance really nice. The portions were a little small. The wine selection by the class was limited. Overall A okay.", "author": "Nimita L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Great margaritas and fantastic tacos! Service was good and I loved the music mix on the patio. Thoroughly enjoyed our dinner", "author": "Philip R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "I love this place. Attentive wait staff. Cute and delicious tacos. Yes, it's pricey, but I like to splurge on this one. \nYou need to order more than one taco dish because they aren't huge. They all come with little bowls of four different salsas - from mild to uber hot. We like the beef brisket tacos and the carnitas, but I wouldn't say we are super adventurous. There are plenty of crazy things on the menu if that's your thing. \nI wish I knew the name of the waiter I really love. He works the front section against the wall. \nDo not go early. Yes, you will have to wait the later you go. But the earlier you go you  will be faced with children. Who brings children to this place? I have no clue. But regardless, you'll have to deal with their strollers and screaming.", "author": "Heather A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "I believe our bartender was named Ascencio (not sure of spelling).  He was really cheerful and really nice, by far one of the best bartenders I've ever been served by.  This place was packed to the brim with people, the extra foot traffic most likely due to the Festival of Lights going on nearby.  Though it was a little tough to navigate due to the number of people in there the patrons were polite and so were the waiters.  I'd like to come back and try dinner, their menu looked pretty good.", "author": "Dalhea K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "I went to Gran Electrica expecting a nice Mexican brunch, what I got was a sad thin tomato soup with two swimming poached eggs and a tiny Bloody Mary... The so called huevos zapateros (poached eggs with a spicy chile de arbol, epazote and toasted bread) ended up being not even a satisfying starter - definitely not brunch worthy - unless you expect a gazpacho like tomato broth. My girlfriend ordered the chilaquiles and asked if she could add chorizo, the reply was \"no we're slammed right now\" which was funny because there were about 3 empty tables. Her chilaquiles were also quite sad, no salsa verde at all, she had to ask for extra for her pile of dry chips with two fried eggs on top.\n\nThe ambient is very nice but I expected much more. Even the Bloody Mary was small and rather lame... A sad experience.\nI can not recommend this place.", "author": "Carl H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "Restaurant is amazing. Food was out of this world good. Service was impeccable. I brought a crew of 5 people and they treated us like royalty. \n\nA+ all around. Theyre doing great.", "author": "Nigel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-26", "description": "Mucho Gusto!\n\nThanks to another site (nameless, lest my review not be posted) that I use in combination with Yelp when trying to find new and interesting places. They described the fare are classed up Mexican street food. Another review called it a taqueria. The menu is primarily tapas sized bites of things like gourmet street tacos, gorditas, empanadas and the like, though there are a couple meal sized items to choose from.\n\nWhile traveling for business, I typically try to pick a new place every evening. Gra Electrica was good enough to be a repeat customer AND get me to visit Colonie, a sister restaurant.\n\nOn my first trip, I stayed with the small dishes and had gorditas, suadero (shredded beef gourmet street tacos) and of particular note the Tlacoyo. Ever eaten cactus? battered and lightly fried, topped with crema fresca, cilantro and onion and accompanied by a quartet of tasty salsas, this will not disappoint.\n\nOn my second trip, I had the mole verde. There are different kinds of mole, from the chocolate chile version to this verde version. Being raised in the southwest, I have  had my share of moles. The chicken mole verde is one of the best of any mole and certainly the best mole verde I have had.\n\nBeyond the playful menu, there is an extensive tequila and mezcal selection. While the signature dink list is short, the drinks on the list are unique and packed with creative flavor combinations. Take the current cocktail trend and give is a south of the border flair. \n\nAs some reviews mention, the Gran Electrica is not a bargain restaurant, there are no chihuahuas hawking these gorditas! The atmosphere, friendly staff and fantastic food quality make this a great place to choose when you want to treat yourself.", "author": "G M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "We ate at Gran Electrica after having some drinks at nearby Superfine (and not wanting to pay $13 for a damn grilled cheese there). We were rolling 11 deep and honestly, didn't expect to be able to all sit together but after a surprisingly short 15 minute wait, we were seated at a long table in their back room which was a bit chilly, but for being in such a large party and seated so quickly, I  wasn't going to complain. We had the most patient, attentive waitress (tall, Afr American woman with a beautiful afro-ish 'do) who didn't get annoyed (at least outwardly) with our requests, questions, etcetera. \nThe food was good. I had the rajas tacos (vegetarian) with a side of delicious black beans  and my boyfriend had the chili relleno, which the waitress described as \"cheese city\" and she wasn't wrong. It was basically a flattened pepper with a bunch of melted cheese in the middle. It was good for dipping chips into, but I wouldn't necessarily just want to eat that. But, everyone else seemed happy with their food and the drinks kept coming at a nice pace. There was even a complimentary dessert with candle for our birthday boy of the group. \nAt the end, all one check, as was to be expected, but she took as many cards as we wanted to use, which was helpful. A lot of places balk at that. Service goes a very long way for me and means maybe more than the food quality, so while the food was tasty enough (no socks were knocked off), the friendly accompanying hostess and the patient waitress are reasons enough for me to go back Even if I chose not to have a full dinner, I would definitely pop in for a drink at the bar and snack on some nachos and guac because the ambiance has a good vibe and skull toile wallpaper is nice to gaze at.", "author": "Rebecca D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}