{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "Now I VERY rarely award 5 stars and I grappled with this one but I seriously could not find a misstep with my experience at Gran Electrica. This was my first trip to Dumbo and it renewed my faith in all my friends that rave about BK. We made a reservation on Saturday night at an early 6:30 because we were going to see a show at St. Anne's Warehouse. Meis Julia, a must see. We walked in and the place was pumping even at that hour. The Hostess was all smiles and sat us at a prime booth in the back of the bar area. Everyone that works here is happy and knowledgeable about the food and the drinks. Our waiter was excellent. We asked him for suggestions which he happily gave both for drinks and food. To start I went with the Margarita de pepino which has tequila,combier,fresh cucumber juice,lime and cilantro syrup. I was going to go with the margarita de toronja picante as I like em spicy but our waiter felt it would dull my taste buds for the food. Alrighty then, cucumber it is and it was great. My date had a glass of the Rioja and it was fine. We were hungry and everything sounded interesting so here's what we went with. Garnachos con pollo: masa cake, chicken,chilto and queso fresco. This was basically 2 open face mini chicken tacos that were fabulous. Next up the pescado estilo ensenada, market fish, cabbage and avocado taco. This was 2 large fish tacos, the fish was battered and fried and my date loved them.  I thought they were OK so I let him have the majority of the dish. We then tried the setas quesadilla: oyster mushrooms, epazote, jalapeno and quesillo cheese. This was also a great dish and I'll have to say the common theme running through all the dishes is that the ingredients are super fresh, interesting combinations and I'm not sure if I'm right on on this one but everything looked and taste healthy. For a main course we shared the Pescado al Mojo de Ajo which was a whole roasted porgy, toasted garlic, lime served with rice. I thought this was heavenly. The fish was moist and just cleanly presented. My only tiny complaint about my experience was the size of the pour on the wine. I ordered a glass of the Vinho Verde, which by the way I was not a huge fan of, and the pour was very stingy. I realize that a 4-5 oz pour is appropriate but this almost looked like a taste. For my second glass I tried the white blend that was on special that night and although it was much better, it was the same measly pour. I definitely would come back to this place whenever in Dumbo and would probably make a trek across the bridge to visit anyway. The vibe is lively, service perfect and the food spot on. Yay I'm a fan!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "Average quality, somewhat high priced trendy restaurant serving Mexican food underneath Brooklyn Bridge, next to some ``icons`` (or turist traps, depending on how you see them) like Grimaldis.\n\nSat in the backyard with a group.  Serving staff was outstanding.  Food was hit and miss.  I agree with some posters that portions are small.  You know, the \"tapas\" style restaurants have really found a way to make money.  Server says, \"just order 2-4 plates per person\", but you forget that it will cost an astounding $12.50 per plate.\n\nAs for dishes, I loved the cow tongue tacos.  As an Asian, we have cow tongue a lot.  There is lean cow tongue, and fatty cow tongue.  The one served at Gran Electica was fatty cow tongue.\n\nMy main dish was OK.  It was some chicken leg quarter in reddish sauce with some beans.  Very average dish, in taste and quantity.\n\nDrinks are ok-to-expensive.\n\nThe back patio is good, but infested with mosquitos, especially on a hot summer night.\n\nWith many restaurants in the New York metro area, I won't return to Gran Electrica.", "author": "Artemisia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Took a spontaneous Friday night trip to Brooklyn seeking good Mexican food and a good outdoor dining spot to take advantage of the gorgeous weather. Gran Electrica totally fit the bill.\n\nThe staff was so incredibly friendly and helpful. The outdoor garden was PERFECT - just what outdoor dining should be. Twinkle lights strung overhead, greenery, and a glimpse of the Manhattan Bridge overhead. \n\nFood was awesome. Small plates so you can order a couple of things, which is nice to really get a sampling of the menu.\n\nHusband got 2 orders of the chicken garnachas and loved them.\n\nI had the fish tacos and they were PERFECT. Some of the best I've had so far in NYC.  perfectly fried fish, shredded cabbage, some kind of creamy guacamole sauce. Wanted more.\n\nAlso had the Requeson con Nopal - a little baked pocket of ricotta cheese topped with diced cactus and queso fresco. It was good, but would have preferred more fish tacos. \n\nHusband tried 2 of the margaritas, I had cava.\n\nFor dessert, the Pina (fresh pineapple and mango slices topped with chili salt) and a flan. All wonderful.\n\nThe only reason this didn't get 5 stars from me was because I am allergic to onions (always a big challenge at Mexican restaurants) - and I couldn't order most of the items on the menu because the waitress said they were already prepped, so they couldn't do a special order of something with no onions.\n\nOtherwise, this was a total respite from the typical busy sidewalk outdoor dining most commonly found in the city.", "author": "Kathryn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Always a good eat, tasty drinks and pleasant service.", "author": "Karl M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-11", "description": "i reviewed gran electra a year ago (i think) and returned hoping for better, sadly its still overpriced, small portions, and staff is just ok.  guess i won't be back for another year, or ever.  it stinks because the owner's other restaurants are so good, and they let this one lag, and i'd love for it to be on my monthly list of places to visit, but just can't do it for tiny tacos for $12+ and slow uninterested staff.", "author": "Clavius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "This place was really good. Guacamole blew my mind, then again I was REALLY craving guacamole. Perfect amount of seasoning. Just great. Tostada appetizer, which was good. Cevince appetizer, ok. Carne asada meal. Great. Tres Leches cake, yummy. Very cool ambiance. The price was about $50, which seemed a tad steep for what you got.  Definitely not the best value, but the no complaints on the food.", "author": "Gene E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-22", "description": "I really want to love Gran Electrica. DUMBO needs all the restaurants it can get, the garden is charming, and some of the food is quite good. However, the portions are small, given the price, and the service is all over the place. I've had some great serves, and also had a server who was completely nonchalant about the fact that it took our food over an hour (!) to come out at brunch. We were still waiting for our food when tables that were seated well after us were paying their bill, and the only explanation was that the kitchen was backed up (which, given that other people had been served, made no sense). The waiter seemed very put out that his nonsensical explanation didn't satisfy us, and stopped speaking to us altogether once we asked for the manager. The manager did offer and apology, and reduced our bill quite a bit, but that doesn't really make up for the waste of time or overall unpleasant experience.\n\nBefore this, I was on the fence about Gran Electrica -- sure it's overpriced, but occasionally you get an excellent dish, and sitting in the garden is just lovely. We would go when a guest wanted Mexican or we were just plumb out of other ideas. Now I think I'll stay away.", "author": "elizabeth g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "great staff, great drinks. didn't eat their food, but by the looks and smell of it, it's great!", "author": "Laura O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "Margeritas great * we sat in the courtyard in the back * cute and cozy it was a beautiful night * service was very nice.  We were served chips and guacamole instead of salsa, tasty surprise. We enjoyed the place, and recommend it .", "author": "anna m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Even from the outside, you know this place is going to be awesome! Such an impressive facade and right under the Brooklyn Bridge...Super Sexy! I later found out from the bartender that the building is the oldest standing office building in NYC....pretty damn cool.\nSo on to my review:\nFood - delicious, cheap and authentic. Ive been to Mexico a bunch of times and i can genuinely say that these guys have their @#$! together.\nAmbiance - Nice! a massive improvement from the ugly Pub One interior that was there before. Apparently its the same owners as Colonie, so you can see some of their style showing through. Exposed brick, garden wall, and candles as far as the eye can see. The backyard is amazing, and i know where i'll be spending my summer afternoons drinking margaritas. The bartender also told me that its set to open on Cinco de Mayo.\nService - Top notch! Just what you want....friendly, efficient, knowledgeable and fun. Not what you would expect from a Mexican joint, but a very pleasant surprise.\nOverall my date and i couldn't fault this place. Its only their second week and they are already killing it! \nDon't be fooled by the haters out there.....Definitely highly recommended....so get there before the masses and the tourists find out....", "author": "johnny b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-14", "description": "I ate in the recently opened garden, which was beautiful.  But that was about the only real benefit of this spot.  The tacos were so overpriced and underwhelming, it was almost offensive.  And I was really bummed at the lack of options in the garden.  Apparently they severely limit the food AND drink menu in the garden.  Bummer, I was hoping this would become a summer staple...", "author": "Alina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "Loved this spot!  We had dinner plans at another spot but were told the margaritas here were tasty, and since it was such a warm day in NY we decided we had to sample some.  I loved how creative the margaritas were- the beet one is delicious!  My husband liked the mole flavored margarita.  They are getting ready to open an outdoor area in the back, which looks like it will be incredible!  I wish that we lived closer so we could visit this spot more often!", "author": "Carisa D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "My friend and I went because we both work in the neighborhood and it's new. I get small plates and the whole \"Pay a lot / Get nothing\" concept, but it would be different if the food weren't so mediocre. Really nothing special at all. The service, as others have noted, is very INTENSE, bordering on INVASIVE. We paid $40 each and still had to go get a slice of pizza afterward. You should come here is you like throwing money away for no reason.", "author": "Scott T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "My husband, grown daughter and I enjoyed a meal at Gran Electric shortly after it opened. At 6:00 it was already crowded, so we were glad we made a reservation! Our waitress was very knowledgeable about the menu and gave us excellent guidance. She highly recommended a couple of dishes that were truly tasty, especially the ceviche.  The service was excellent and we always had something on our table before the main course arrived. The home made tortillas were exceptionally good. One chicken dish with green sauce tasted much like an authentic chicken dish we had eaten in Guatemala.at the house of a tea plantation worker, but it was not exceptional after tasting all the other flavorful foods. The atmosphere was lovely, with much of the character of the older building retaining its charm, but with bright copper accents, long wooden banquettes and those trendy metal chairs. Don''t miss examining the Day of the Dead wallpaper, which the owners commissioned.  It features all local landmarks, including the Brooklyn Bridge and the restaurant building itself!", "author": "Perry-Lynn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-23", "description": "Extremely limited menu in the garden. $13 for a basket of chips with guacamole. Beer served in a can with a lime on top. No chicken tacos, but you can get tongue or mushroom ones! $8 for a very small serving. Disappointing and overpriced.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "look--it is a nice place--however for the money we spent we could have gone somewhere nicer.  The food is reasonable, but the drinks were small and expensive.  The dishes vary in quality.  The ceasar salad was excellent, but the quesadilla was greasy--not fine dining.  So if you are going to eat and don't plan on drinking much this place is a nice choice.  Otherwise look elsewhere.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-26", "description": "well....\nthe drinks were good,  guac was good, garden looked nice,\nfood was meh, nobody finished their apps let alone ordered mains,\n we had a crazy sweet, ceviche, was like a desert,\na way overly salted crab on a tortilla thing, nice idea but so insanely salty,\nand fried fish tacos, average\n\nmaybe a better drinking place than an eating place, pricey too", "author": "S F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "We recently had our wedding reception at Gran Electrica.  It turned out really beautiful and was a lot of fun.  We bought out the entire restaurant for the night.  While certainly not cheap, it was a really reasonable option compared to so many other spaces in Brooklyn.  The space and vibe is really well suited for a lovely and lively event with minimal creativity or effort required on our part.  The highlight of the space is definitely the garden, and we were so lucky to get beautiful weather on our day.  The food was great and so much more fun than a typical catered wedding.  We had been to the restaurant previously and also did a tasting, so we were able to figure out which dishes were the best (at least for our tastes!).  I don't know anyone else who has ever had margaritas at their wedding, but if you want a slightly offbeat but still beautiful reception, this is a great place for it.  The service was also amazing -- I thought that we were just getting spoiled as bride and groom, but several guests told us that the service was extremely attentive to them as well.  The events coordinator, Liz, was a pleasure to work with and was very detailed; pretty much everything worked out as planned.  We've also been here for dinner a handful of times and it's a fun spot for normal dining too! :)", "author": "B. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-24", "description": "So happy to have this pretty little spot in Dumbo. Love the cocktails, they are delicious. The tacos are great too, everything we ordered was tasty! The service was really nice and very knowledgeable, even on their first week open. Comfortable space, and lively atmosphere. Such a great win for the neighborhood! Can't wait to go back and try the outdoor patio once it's open. Only drawback is that it can get a little pricey after ordering a few of the small plates. Wish they had guacamole. Love the handmade tortillas!", "author": "E C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-28", "description": "Staff was incredibly rude. Food was awful, I had the chicken mole..it was disgusting. Do not go here. I also would have expected better prices especially for Brooklyn.  Avoid at all costs.", "author": "Court g."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}