{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "I was in the area and decided to try this place since I was craving Mexican food, but this place came in as a disappointment. We ordered for guacamole which is for $11 but the portion size didn't even equal to half a avocado. Plus the guacamole was just mashed avocado topped with some seeds. We called for carnitas and chicken tacos both of which lacked flavour, and the portion sizes are tiny. The servers try to rush you to order and start clearing up the table. Don't go there with any expectations for good food it's just an overpriced restaurant serving flavourless food.", "author": "Maansi A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-31", "description": "We were here yesterday and had high expectations as we have heard about the place in Sweden and also read some reviews and articles in Swedish press. I've been to the sister restaurant Colonie on Atlantic a couple of times and really like that place. \n\nUnfortunatelly it wasn't as great as we hoped for. The food was OK, nothing special but OK. Service was OK, same here...nothing extraordinary. The place was nice and really cozy though!\n\nWhen the bill came in we paid bith with cash and card and gave a 20% tip in total, standard tip.\nBut what happens? We have all been to NYC a lot, one live here, so we know how to tip...\nThe waiter runs after us, claiming we hadn't tiped him at all.... And we became surprised and embarrassed as we thought we had made a mistake. So we gave him 40 USD extra... \nIn the cab home we calculated again and yes, we had been correct with the amount of tip in the first place... I guess the waiter took a chance as we are Swedes, and he succeeded. He got a nice amount of tip. 90 USD for a dinner that cost 215....\n\nWell, we will not recommend the restaurant as you may understand! Sad as I really like what the owners have done, the story behind and the sister restaurant Colonie!", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Delicious margaritas, specially the spicy ones. The food was really good too. The flavors, the portion and the place is really nice. The outdoor seating is a nice place to enjoy. I really recommend this place.", "author": "Jose T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Went there on the recommendation of Harpers Magazine. Had dinner reservations and requested the patio which is first come, first serve. We arrived around 6:00 so we easily got a seat on the patio. The entire wait staff was absolutely awesome!  The food was fantastic. Of course, we had chips and salsa. I had the veggie tacos which were phenomenal!  It is definitely worth the trip down from Manhattan. The restaurant is situated underneath the Brooklyn Bridge. The patio atmosphere is wonderful. We then walked back over the Brooklyn Bridge back to Manhattan. Wonderful experience!!  BTW - this is my first review on Yelp. It was so good that I wanted to take the time to post.", "author": "Jan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "I've been to Gran Electrica twice and enjoyed my meal and the service both times. It has an upscale yet warm feel, and the food follows that theme. Both visits started with the guacamole and chips, which is creamy and super fresh. On my last visit I had the chicken tacos which were juicy and full of flavor--no dry meat in mine! I do remember getting a drink during my first visit but didn't have one recently--it was strong and well made. The servers really know their way around the menu and are quick to offer suggestions and answer questions. Looking forward to more tacos here.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Came here for an impromptu dinner with friends after spending the day at Brooklyn Bridge Park. We were sat out in the lovely backyard area.  Servers were friendly and accommodating, as one of our party hadn't yet arrived but we were seated anyway. \n\nThe food was pricey, but very delicious. I ordered the carnitas tacos, and they were the right combination of crunchy and cilantro-y.  We also had black beans with queso fresco and avacado, and guacamole with chips. The guac was chunky and delish. I would definitely come back!", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "Dont write many reviews but The general Manager Andrew iced a bad one.\nNegatives: food except the ceviche which was actually very good.  other then that  the food was mediocre cold tacos under cooked french fries chicken torta with chicken thin as a piece of cardboard and fried to a crisp.  meh all the way around. Service others in the dining room who sat down after us finished there food before we got ours.  They apologized and brought us salsa and chips to tide us over a decent gesture but then it still took long with more diners getting food before us we got frustrated finally our food came. I ordered a torta which turned out to be a fried chicken sandwich.  not an item i normally would order or eat.  I said to the Manager I did not know it was fried ( on second looking at the menu when he brought it over to prove me wrong it said crumbed (i thought it said crumbled) chicken pretty vague)  He told me you should have inquired if you wanted to know more about the menu Item.  Pretty rude then he thanked me a couple of times in a really passive aggressive way and finally made it clear that he comped us the salsa another thing i normally wold not order or want. we ate it cause we where starving.  (also just cause you charge 7 for it dont make it worth it or good.)  Pretty underwhelming  hospitality and service not sure if the owner knows this is his attitude.  needless to say will not be back  and with all the options in the area i would stick to others.", "author": "William G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "I really wanted to like this place more than I did. I don't know that it's even Gran Electrica's fault, maybe they're just not really catering to people like me. \n\nWe walked in after having come off the ferry - just looking for a place without an insane line to stop in and have a drink. When you walk in the decor is dark and cozy, while still being inviting. The majority of the interior is taken up by a large bar. Between the decor and modern menu, I thought \"what a cool bar/restaurant\". \n\nAlas, it was not to be. The floor was littered with strollers, and the few tables inside were cluttered with families and small children. Outside they have an amazing patio space with a cute tiki bar...that is completely non-functional. I mean, there was a girl making drinks there, but you couldn't actually order drinks from her if you wanted to hang out outside. If you didn't have a table - forget enjoying the patio. And again, I looked around and saw that the place was 99% populated by families, the kind of people who probably want to sit down and don't want people loitering near their table like they're, I don't know, in some sort of bar, and I realized I wanted Gran Electrica to be something it's not.\n\nSo families, welcome! 20-somethings looking to have a fun boozy afternoon...go elsewhere.", "author": "Leilani D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Great place. Love this place. The staff is attentive and respectful. We stopped in after our walk across the Brooklyn Bridge. We were greeted by a lovely male who took my name for a table. He texted me when our table was ready. We were seated quickly. Our water glasses were never empty. We started with the chips guacamole and salsa. I had the chorizo quesadilla. It was delicious. I also had the cucumber margarita, very refreshing. I plan on coming back here really soon.", "author": "Valencia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-07", "description": "If I could, I would give this place 5 stars for ambiance and friendliness, and 2 stars for the food, margaritas, and speed of service. Perhaps I had high expectations and set myself up to be disappointed?  \n\nThe true highlight is the outdoor patio space. It is a gem. A friend and I met here for margaritas and tacos. We started out with one of their salsa/guacamole combos \u0026 chips, and after eating a few, we concluded that the salsa tasted like a jar of tomato sauce. The guacamole was also leaning to mediocre, unfortunately. Not much flavor, overly blended, no chunky factor. Not the end of the world, but could have been better. Let's order another round of drinks.\n\nI had the fish tacos, which I had hoped would be grilled fish but I instead got a single piece of fried fish that was almost perfectly rectangular shaped. It reminded me of fish sticks. It didn't taste bad but wasn't what I expected. Shame on me for not asking. My friend ordered the carnitas, and there seemed to be more morsels of fat than meat. Disappointing. Let's order another round of drinks.\n\nSo all these margaritas that we ordered? Took forever to receive them. In fact, we were sitting for quite a good amount of time with empty glasses. Yikes. I will say that our waitress was really apologetic about this and the fact that she was aware of the problem lowered the annoyance factor. \n\nI've definitely had better margaritas elsewhere and I'm glad the tacos were relatively inexpensive. If they could improve the food to meet the atmosphere, they would have a winning combo. But for me, food is the primary factor and it was definitely no bueno.", "author": "Kathleen H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "Enjoyed the place somewhat. Quite quaint. Not the best of foods for the price. I'll come here to hang and chill. Won't definitely be for the food. It's New York!!  I expected more in terms of flavors and creativity.   :p", "author": "Charlie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "A friend brought me here after a volleyball game in Brooklyn Bridge Park on a Monday night.  I think Monday/Tuesday might be my new go-to night for dinners because you get amazing service and zero over crowding.  We started off with some specialty cocktails and I loved my cucumber/cilantro margarita!  It was really refreshing and had nice spring flavors.  We also ordered the salsa and guac which I highly recommend.  The salsa was really good-not your regular fare; it had sesames which brought it to a whole new level.  The guac was fresh and tasty although not as creative as its counterpart.\n\nFor our main course, between the 3 of us we decided to get 5 different tacos.  The pork and the chicken were the biggest hits, followed by the beef and the veggie.  I didn't try the fish taco but apparently is was pretty bland.  If the tacos were slightly more creative or flavorful, this place would easily be 4 stars.  Unfortunately, I wasn't really that impressed by any of the flavors since they were pretty unexciting and didn't have contrasting ingredients. Definitely got the job done, but when I get sesame seeds in my salsa, I'm hoping for a better end game with the tacos.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Stopped here for a cocktail after a Saturday brunch trip to Dumbo. I ordered a caipirinha with prickly pear juice. I truly enjoyed it. Great amount of tart factor without that drag of sugar that many other places drown their drinks with. \n\nThis restaurant has an outdoor area. It's cute, spacious and deserves to be visited again by me. The staff was friendly as well. I can't wait to come back and dine. The one downfall is that we would have considered ordering more snacks for the table other than guacamole, but we arrived at 4 pm and they weren't serving any food then.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "The surrounding was nice, I sat outside but I don't know if the hostess was having a bad day or this is just her general attitude, um the food was extremely tasteless, would only recommend for the chips, guacamole and drinks.. other then that it's not a place for a date or birthday putting AT ALL", "author": "Imani M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "Atmosphere on patio was nice and in the heart of Dumbo. But food was overpriced; small portions for only mediocre Mexican food. Tried the guava margarita for $12; good flavors but very weak for the price.", "author": "Kristina N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "This place can be a mixed bag.  \n\nFirst time we went, we fell in love - the drinks are awesome - the guac is incredible - the little plates are interesting, the mussels are yummy...the churros were easily the best I've ever had.  SCORE!\n\nSecond time we went, this time with friends, the margaritas were amazing, the food was meh, but nothing horrible, but WTF?  they don't serve churros in the backyard area?  \n\nWe demanded to speak with the manager - this was insane - why the hell would the churros be for the inside crowd only??  He apologized and brought us an order as \"a favor\" but I still don't understand it.  You do two things really really well - margaritas and churros.  Why would you limit that to where you choose to sit?  Maybe they have two kitchens or something?  not sure.\n\nSame owners as Colonie and Governor - I like this place better than Colonie, but it's nowhere near as good as Governor.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "AMAZING patio and unbelievably good tacos. Didn't love the drinks (we had a pitcher of sangria, and it didn't taste quite like true sangria), but highly, highly recommend. Great date night spot or place to meet friends. Highly recommend making a reservation, especially for the patio (we ended up getting someone else's when they didn't show).", "author": "Zoe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Delicious, high quality ingredients with complex flavours. Tinga and carnitas tacos were rich and alive with taste and yet felt healthy. Satisfaction level extremely high. Patio was beautiful but there was a long wait, so we sat in the back room, which has a nice view of the patio. Service and staff were friendly and attentive, even despite the restaurant being very busy. Only issue is that drinks at the bar are cheaper during happy hour, but you can't order them from your seat after you sit down, which seems like a bit of a ripoff.", "author": "E. G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-20", "description": "I figured that maybe Brooklyn would have a delicious Mexican restaurant, but I was just giving myself high hopes. \nFirst bad sign: The restaurant looked more like a country cottage...where were the Mexican decorations?\nNext, no chips and salsa\nFood was ok, but lacked a lot of Mexican flavor I am used to, so it tasted a bit bland. I tried the torta, which only consisted of some meat and onions, no other toppings like peppers, avocado, and the bread it came on was closer to a french baguette. It was weird. \nI will give the establishment credit for their polite service staff and their well appointed back patio area. \nI don't think I will be back though.", "author": "Sara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Great service, Margaritas and food. Nice atmosphere. Hope to return when back in Brooklyn.", "author": "James C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}