{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-04", "description": "I'm known for the weird comment or two (or a billion, so what?) but this review will take the cake on weirdness because I don't know how i felt about my meal at Gran Electrica. \n\nThe wait staff was friendly and didn't forget about us. They gave us suggested and always had a smile on their faces. That was good. The portions were small but the bill wasn't. That was not good. So it pretty much boils down to the taste of the food, and that's where the weird part comes in. I chose a soup that they had on the menu because it was a really cold day and when i tasted it, i could tell that it had a lot of flavorful ingredients but I really couldn't taste the flavor. It seems as if they but so much flavor in it but my tongue just couldn't get it. I have never experienced this while eating before and it was a bit perplexing. I do have to point out that my friend paid 12 dollars for a drink and when she got it, it looked a shot of something in a really tiny glass. Two sips and it was done. Not cool, not cool at all. You know how much jack Honey Tennessee I could buy with $12???? More than two sips. It just so happened that Anne Hathaway was filming SNL at the time and stopped in the restaurant so that bumped up the review one star. \n\nIt wasn't the most horrible place i've been to, but I don't see myself recommending Gran Electrica.", "author": "Al E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "Awesome tequila cocktails and yummy tacos all at a fair price.  Can't beat it! I will return once again.  Only problem was there is like absolutely no cabs late night so good luck -- maybe call one in advance.", "author": "C C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "What a joke!  If you like paying out the nose for tiny portions of subpar food then by all means Gran Electrica is the perfect place for you.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-23", "description": "Been there twice now in the past two weeks, primarily because I'm bored/disappointed with the other places in the hood. \n\nFirst visit: I quite liked the food--I thought the selection and portions were good. The cocktail list was somewhat limited, but they had this amazing beet-infused one, which they inexplicably removed from the menu the next time I went there. Fortunately, on 2nd visit they had an even better one.\n\nNoise level: kAraZy loud\nStaff: friendly\nServer: explained menu nicely, showed up only when truly needed. Like!\n\nSecond visit: still ear-shatteringly loud, one order screwed up, food not as tasty as on prior visit, and though the staff was still friendly, the server and busboy were quite nightmarish. CONSTANTLY milling about to refill my glass of water, bringing clean cutlery, reaching over to pick up empty glasses or plates, asking if I'm enjoying my food, drink, or whatever. The interruptions, in mid-sentence, were never-ending and at some point I seriously thought John Quinones was going to show up any second and tell me this was all a set-up. Not like! \n\nUnless I make eye contact with you or speak up or get up to help myself, I don't need you at my table.", "author": "Mojgan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-15", "description": "A friend and I ventured out to Dumbo on a rare warm day this spring hoping to enjoy some drinks and fish tacos on the patio I've read so much about. Unfortunately, the patio doesn't open until the end of april (which I don't exactly understand since the tables and chairs were out there) and the restaurant was extremely warm and stuffy inside. My first impression was that they really don't  care about accommodating their customers as when we asked to sit near a window in the back we were told no...those tables are only for patrons ordering food. After informing the hostess that was our plan she agreed to seat us there. \n\nMy boyfriend has been raving about their fish tacos for quite some time, so I've been eager to try them. Unfortunately, our fish tacos were more like cabbage tacos with a fish garnish. They were good, but at $11 for 2 tacos I expect more fish than cabbage. The chorizo quesadilla was not great, but the churros we ordered for dessert allowed us to end on a positive note. Those were delicious! \n\nI'm not eager to run back but wouldn't mind having drinks and apps on the patio if I was in the area.", "author": "Jen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-10", "description": "Really interesting experience- impeccable service but confusing food. We ordered the fish tacos and carnitas tacos and found that the base flavors were nice, however slightly bland. My party agreed that both the fish \u0026 carnitas had perfect flavor and texture but the tacos as individual dishes needed some pizzazz to be really exciting. The best drink we had was the classic margarita with various tequilas- put the mixed drinks to shame. Probably won't go back, but not sorry we went!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "Omg. The prices are big and the plates are small!!!  The tacos were good but for $10, I shouldn't feel like I didn't eat at all. Not ok.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "Get the guacamole and the house margarita-you'll be happy you did!", "author": "Bee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-15", "description": "Food was good, although we kept ordering more since the portions were pretty small. \nVery loud, but overall a good experience. Finally, a good place to eat in DUMBO.", "author": "Ludovica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Guacamole was tasty as were the dipping sauces.  Fish tacos were AMAZING!  Had a really great margarita, but then the bartenders changed and the quality wasn't consistent.  Really lovely outside dining area with stringed lights.  My friends and I had a great time and really enjoyed everything we tried.", "author": "Renee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Why does this place only have 3 stars? NONE OF YOU KNOW WHAT YOU ARE TALKING ABOUT.\n\nI consider myself a taco connoisseur. I never met a taco I didn't like, but then again, I try not to eat shitty tacos. \n\nThe décor inside Gran/Eléctrica is pitch perfect. The tables are cute little wooden numbers, the chairs are those metal seats that seem to be everywhere today. The wallpaper is some of the most incredible wallpaper I've ever seen. Obviously customized, the scenes capture the Dumbo through Day of the Dead skeletons: there are hipster skeletons on bikes, skeleton models with skeleton dogs in purses, skeleton parents with skeleton babies, and skulls pouring from the tunnels of the BQE bridge. THIS PLACE IS SO SEXY I CAN'T STAND IT.\n\nFor drinks, I ordered the Margarita Eléctrica, which was the smoothest margarita I've ever had.  The simple syrup must have taken away some of the harsh flavor from the tequila. Date ordered something with mezcal, almost like a Mexican version of a Negroni, with campari and vermouth; if you're a Negroni fan, apparently it's quite good.\n\nFor dinner, we ordered three mariscos, two tacos, and guacamole: the scallops, the peektoe crab, and the special raw beef, all served on or with crisp tostadas. For tacos, we had the fish and the beef brisket. Our mariscos reminded me just how good raw meat and fish could be. The scallops were smooth and delicate; their flavors blended perfectly with the cilantro and lime, giving insight to the their true flavors. If you've ever had lightly seasoned seared scallops and noticed their specific taste, you should try raw ones; it changes your perspective a bit. I wasn't keen on the crab, but I also feel like it was probably cooked; maybe this is just my knowledge \"california roll\" misguiding me. The beef was stellar; sharing this one was no easy feat.  We doused it in lime juice and basked in its raw tenderness. The fish tacos were some of the best I've had; a lightly fried and topped with a very light aioli and white cabbage. They barely needed anything apart from a little lime. Our brisket was good, but certainly not the most memorable part of the meal.\n\nThe guacamole was probably the best guac I've had in NYC - almost buttery, creamy, just the right amount of spice and jalepeños, and if memory serves me, the blue tortillas are homemade. For anyone who usually passes up guacamole in restaurants, this is not to be missed.\n\nI was impressed the appropriate use of salt in everything. I really appreciate a place that gives you multiple salsas without asking: a light sesame based salsa, a traditional red salsa, a salsa verde, and an extremely powerful habanero  sauce graced our plates. \n\nGran/Eléctrica is proof that Brooklyn is the new home for foodies. The best of the best of the best. \n\nSee you soon, Gran/Eléctrica. \n\n(now I want to go to your sister restaurant Colonie and devour all that American goodness)", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "Had dinner in the pretty garden. Very good beef brisket and fish tacos, acceptable guacamole (could have used more acidity or bite) and delicious chorizo quesadilla - not too cheesy and just savory enough. Friendly service, excellent salsas to choose from so you can add to whatever you are small plating. Nice addition to DUMBO.", "author": "Brigita J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "A good place for catching with friends over brunch. Went on a Sunday, was busy but not packed. Service is good, food is okay hence the 3 star rating.", "author": "Carlos M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "The staff is knowledgable and warm, and I love their guacamole. However, nearly every person whose opinion about food I trust agrees with me on this one: you can get better tasting, more satisfying tacos from an array of small, cheap joints all over the city. In fact one night after nibbling on Gran Electrica's itty bitty selection of dairy-free, vegetarian taco options, I rode home to my neighborhood, where I was tempted to pull a fat-kid move and load up on the unabashedly delicious tacos from the tortilla factory near my apartment. A whole plate of them would have been $5 (Tortilleria los Hermanos, review to come). Sigh! Anyway, Gran Electrica's saving grace is their delicious selection of fancy, tongue-numbing margaritas. Campari AND mezcal in one margarita? Yes please! \n\nIf you go here expecting to be wowed by the food you will be disappointed. The tacos are too expensive and underwhelming. Do go if you're in the neighborhood and want to quench your thirst with a tasty, inventive drink.", "author": "Jess T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "Finally - something on the MEH list.    Such a nice vibe.    Great cocktails - well, great margaritas.  Chill bartender and friendly staff.    But alas the food.  So meh.   Chicken overlooked and beef and pork meh.  Just not good.    Fish tacos - ok, yes.   But those are easy, and ahh, the days of mexico and one dollar bad fish tasting the same.     So come here if you will, but don't expect much.", "author": "Hugh G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-17", "description": "This place has delicious drinks, and a super cool interior (I dig the skull wallpaper),  but the food is unappetizing, tasteless and insultingly overpriced. Also, how can you not serve chips!??? You are a mexican restaurant. Stop being too cool for school and give your customers what they deserve. At $50 a person I think you can serve each table a side of chips, even if they are just ordering your expensive drinks.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "I like cocktails, and, since I talk really loud and am basically a complete attention whore, I deeply enjoy when bartenders make me feel attractive and witty. Here I say, well done!\nThey're still tweaking the cocktail recipes, so they are more than good but not quite excellent. \nWhenever I go to an upscale nouveau Mexican restaurant I can't eat anything because there are simply no vegan options. In situations like this, it means I get louder and drunker even faster and then spend less money because I have to leave to eat. (See above for why that would sadden me!)\nAs a Mexophile who travels regularly throughout the fine nation, let me explain: I can get vegan food in Mexico. In upscale restaurants.\nOur American obsession with authenticity means we're doing it wrong. And that bugs me. Because if we were doing it right we'd be eating bugs. But we're not.\nIn other words, add a goddamn vegan taco to your menu. It's not that hard, and it's not like Mexico is going to come and revoke your cooking license.", "author": "Renee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-08", "description": "The ambiance here is pretty cool... The back patio on a breezy summer day (is summer finally here??) is a huge plus. The drinks were good (margarita with cucumber is awesome) and the service very attentive but the food is only so-so. The pork shoulder tacos, the ceviche (bomb!!), and the guac were good but a few of the other dishes my friends and i shared (plantains, fish tacos, the chorizo quesadilla, and the dessert) were overpriced and not very flavorful. I'd say this is a nice place to come should you find yourself  in DUMBO and want to grab a drink, but thats about it. Hopefully they make some improvements.", "author": "Gennady K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-15", "description": "I am a Dumbo resident. I was ecstatic when I found out there's new restaurant in the neighborhood especially a Mexican restaurant! But I am sorry, really sorry...this restaurant sucks. Too overpriced, too small portions, too tasteless, too long to wait for a table...Very cute place, cute staffs, cute customers but the hype can only go so far. Have they had Mexican food before? I am not even being sarcastic. Can they season the food?  I really don't get it.  We left hungry and much thinner wallet. I always told my friends that Dumbo don't have many options for dining but almost all of them are rock solid! Errr....this is the exception. I would choose a greasy hole-in-the-wall over this cute wallpaper joint any day.", "author": "Charlie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "Love this place, it had delicious Guacamole and  pretty good beers on tap. The service is very friendly and knowledgeable. They have a cool garden outside with an awesome ambience. I def recommend this place.", "author": "Tamara P."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}