{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "Extremely bland and subpar food for the price. We went a few times because we live around the corner and absolutely love their outdoors - otherwise it's not worth the money at all. \nThe cocktails are actually very delicious so I would highly advise to come for the atmosphere and a drink. Avoid the food! \nThe service is great! Without realizing it, I dropped my napkin (which slid off my lap) and a waiter noticed it happen from across the room, ran over to pick it up and immediately replaced it with a new one. Very sweet attentive gesture. Everything from drinks to food was brought promptly. No complaints there. \nCome on Gran Electrica, step up your food game! Mexican is not a hard cuisine to mess up! At least learn from your sister restaurant Colonie.", "author": "Nova S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "I had to stop and think to myself, \"Am I giving themselves five stars because Meryl Streep was dining there the night I was there?\" or do they really deserve five stars?  The answer is, they really deserve it -- both for wonderful food and outstanding service.\n\nTheir guacamole may be the best I've ever had -- it has a little kick to it, which I like but tend not to get at more standard Mexican restaurants.  I also loved that they bring four different salsas of varying heats, each of which was delicious. I had the carne asada, which definitely was the best I've ever had.  It came with plantains, which I'm usually not a big fan of, but they cooked them in a way that didn't use too much oil as is the case with many other restaurants, so they were very soft and flavorful.\n\nIt was a busy night, but the service was very attentive.  What I really give them credit for was that my dining companion ordered something off the menu and didn't catch that the meat in the dish is raw.  When it came out, we asked whether she could have it cooked or whether that would negatively affect the taste; the chef said it was the latter, and instead made her something else.  Not only were we not charged for the original dish, even though it was our fault for misreading the menu, but when the check came out and we saw the credit on it, there was a little \"sorry!\" printed on the receipt.  Wow -- how often do we see such strong customer service in this day and age?\n\nParking is a bit of a pain to find, and the place is a bit small (my friend knocked over stuff on the neighboring table on our way in, and I knocked some silverware out of a waiter's hand on the way out -- a balanced experienced!), and it does get loud, especially with their popular bar.  But don't let that dissuade you from having a truly amazing, reasonably priced dining experience!", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Love the atmosphere, decor, music. Decent service as well--however, the food is forgettable.\n\nIf you're craving Mexican and you're in the DUMBO/Brooklyn Heights area, this place might satiate you, but there's just something lacking. The guac is very decent; however, the tacos leave something to be desired. I had the carnitas tacos, and they were just a bit...much. The pork was definitely good, and so was the salsa, but somehow the combination of everything in it felt too heavy for the tiny little taco. \n\nI do, however, have to praise the layout of the restaurant. Tucked unassumingly on the corner of Front St, you could easily mistake it for a storefront or someone's house. The inside, however, is cozy, inviting, and there is a great backyard bedecked with lights and umbrellas that make this a great date spot. Just make sure you have a few margaritas in you before you start on the food, or hope your date is so enthralled with the space that he or she isn't paying too much attention to the flavors.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Went to this cozy Mexican restaurant for a date and absolutely loved the setting and architecture of this place. I anticipated the food was going to be amazing due to the artsy vibe that I loved so much. Sure enough the food was excellent, especially the guac!! Chips with guac were addicting!!! Hostess and waiters were nothing but full of smiles whom had excellent service. I would definitely come back.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Chorizo con papa was amazing! Def a must try. The Esquite (corn) was pretty flavorful. The ceviche was not something I would try again. It tasted like nothing more then orange juice. But the presentation was definitely pretty. Service was pretty quick. Scenery is beautiful with the garden and lights. The music is diverse and entertaining. A bit of everything for different crowds. Would recommend for a first date although it is not authentic Mexican food.", "author": "Jennifer Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "My last review had to be taken down by request, but I had to make sure I wrote another one since this spot cannot be kept a secret. Gran Electrica is amalagmate of Mexican culture and DUMBO swag. The mood is set just right, even on a Tuesday night (I didn't mean for that to rhyme). The lights are dim enough for you to see the beautiful and ambivalent artwork on the wall, but bright enough so that you know what you are eating. \n\nOk straight to the food - I had the carnita tacos, and the black bean thing. I forgot the name of it, but it was by far the best black bean thing I have tasted! Mexican food is my pallets forte, so I know a good mexican dish when I taste and Gran Electrica is the spot to try new things. Their foods are locally harvested and delivered to you by extremely courteous staff that are super happy to serve you. \n\nTheir margaritas are so sweet with just the right amount of everything - the bartender definitely deserves 5 stars for that. It is a bit pricey, but if you are willing to spend the dough for a good night - Gran Electrica is the spot. \n\nAfter dinner, make sure to take pictures by the bridge. It is an amazing view!", "author": "Iris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "We came here for my birthday this year with a group of friends. We had a party of 12 and my boyfriend had already organized for a prix fixe menu. They have a requirement that parties of 12 or more, they need to have a prix fixe menu, which was a 3-course menu for $50. You can however customize the many according to you and your guests' tastes. We definitely needed to do that due to dietary restrictions et all (primarily mine!). This place is super cute, trendy, and intimate, has dim lighting, and exposed brick walls. \n\nWe had the party here when the festival of lights was happening in Dumbo so this place was super crowded. However, even though our entire party hadn't arrived, they got us seated pretty shortly. One of the things that I loved about this place is not just their margaritas (they are by far my favorite drink of choice) but that they had interesting varieties of it. I got the one with carrot juice (20/20 margarita) while my boyfriend got the one with beet juice. Both were lovely! No way to make you feel better than mixing alcohol with freshly squeezed juice - I am just saying... We had other interesting varieties around the table - a friend got the mezcal drink with tamarind (Ay Papi!), while another friend got the one with grapefruit (Margarita de Toronjo Picante which was sweet, spicy, strong - delicious!). \n\nFor pre-appetizers, we ordered a round of guacamole, which comes with chips and salsa. I really liked the salsa - it was smoky and really flavorful. I liked it so much that I put it on top of my tacos too! For appetizers, I got the tacos de rajas which had poblano chile, onions and crispy potatoes. I really liked it! For my entrée, I got the chile relleno which typically comes stuffed with cheese but since I am vegan and gluten free, they were able to make mine stuffed with vegetables. It was really good - I am not really a squash person, but the quick on the squash was so good, just slightly sweet but cooked down so well  it almost felt like I was eating a piece of marinated firm tofu. The others liked their meals too - one of my friends got the carne asada which she liked, while my boyfriend got the chicken enchilada which comes in a mole sauce. For dessert, they served it family style - and served flan, churros with chocolate sauce and tres leches. Everyone loved the dessert but their favorite was the tres leches - sweet and moist! They bought me some fruit for dessert, but I wasn't even able to finish that because I was so full from the meal.\n\nI typically don't frequent Brooklyn that often but we have been coming here more often to try out cool spots as such! I would recommend coming out here - either for a date or with a group. Its good for either, the food is goof and the drinks even better! Also, if you come in the summer they have outdoor seating.", "author": "Akrati J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Excellent cocktails, good food and very friendly and courteous service. Wonderful staff! Attended a wedding here and we had a great time! Very cool atmosphere, good food and drinks.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Beautiful backyard and great food! Not to mention the drinks were tasty and strong. It may be right next to Grimaldis but you can usually get right in without a wait", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "Went for brunch on a Sunday, sat in the back room, and had a good experience overall. Came back on Cinco De Mayo for dinner and the same room was completely empty with set tables. However, I was told it would be over an hour wait and that room was \"not being seated tonight\". \n\nYou'd think a Mexican restaurant would be fully staffed and ready to handle a crowd on Cinco de Mayo. Telling a potential customer to wait an hour when there's a visible room full of empty tables is utter bullshit in my opinion. Will not be returning.", "author": "Alyson P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Stopped in on a whim hoping it wasn't going to be packed on a Saturday. Their garden out back is super chill for a lazy lunch. Umbrellas help keep the sun gods at rest. So yea get the Badass tacos!!  For real get the fish taco and the brisket taco. Hands down.", "author": "Lorenzo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "I ordered tacos, which were kind of small but very savory. The atmosphere of this place is a bonus, for we got seated in the back where the candlelit dinners were being prepared. The bar was kind of loud, but overall this was a nice place to dine before heading over to the Brooklyn Bridge Pier.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "stumbled upon this place trying to get out of the NYC heat...got seated right away by friendly staff, and received awesome margarita recommendations. \n\nfirst we went with the traditional margarita. then we we went for the spicy grapefruit marg. after that we tried the beet root marg, followed by a jalepeno marg and cucumber cilantro one. let's say there wasn't a shortage of tequila around here. \n\nevery single margarita was DELICIOUS. \n\noh and we tried the guacamole / salsa and chips: very tasty....\n\nthis place is a must try under the bridge! \n\nhappy drinking!", "author": "Michele M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Came here twice, always inside. I had delicious guacamole and tacos (with radish on the top).Love it! The place is small, perfect for a date! Definitely wanna come back to try different Margaritas.", "author": "Lilia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "I absolutely loved the ambiance at this restaurant.  The margaritas were perfect, I only had three!!  They were not too sweet or too tart!  The food was fantastic and the portions were great!   I would definitely recommend this restaurant!", "author": "Ketti M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "I rarely ever write reviews; however, I was extremely unhappy with this place. I've been to my share of bad restaurants in NYC, but this was pretty terrible. Especially when a place charges so much, my expectations are a bit higher. They masquerade this place as an upscale restaurant with nice decor, however the food is mediocre and the drinks are terrible. We suffered through dinner without AC when it was 90 degrees outside. Definitely don't go for the price fixe menu as it is a complete rip off. Would probably say to skip this place altogether as there are so many better options in Brooklyn.", "author": "Amrita S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "Came here with work friends and we had a reservation. I was sort of confused what you get with a reservation here-- there was an entire room with table seats that was empty and closed off. We were seated in the main room at a high table with stools right across from the bar. It was a tight fit with five of us there. We planned to get food, too, so I feel like the seating was a weird choice, and was bummer since it made it harder to hear each other talking. \n\nDrinks were interesting, and strong. My friend got the beet juice cocktail that was really different; not my cup of tea, but if you're into beet juice, go for it! Food was also good, though on the pricey side. I had the fish tacos, which were delicious, though it was a small plate and I would not call it a meal. \n\nService was really inattentive and slow. We had to stop the waitress every time we needed something or had a question. She never once checked on us on her own, even though our table was right next to the kitchen door and she walked past us numerous times.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Beautiful outdoor seating, reasonably priced. All of their food is shipped and grown locally. Good guacamole ( don't order the salsa). The beef tacos were good, but the fish tacos were super greasy. \n\nDownside: our waiter forgot our order of corn and the salsa is mediocre at best.", "author": "Jon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Foods are so delicious. Staff is so kind. They have a beautiful garden . I definetly recommend Gran Electrica. Love the atmosphere. I really didn't understand why they gave 3.5 star! It's not fare.", "author": "Burcu M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "This review is for the one margarita I downed there last night. It was very, very delicious! I went with the classic and told the bartender not to kill me with the tarty tart citrus. He added a little extra agave for this girl and it was great. Not too sweet, not too pucker punk, nice healthy rim of salt and a juicy slice of lime on top. We commented how the lime perfectly fit the glass like it was made for the drink. Let's just pretend it was. Also, for $13 I was curious if this margarita was going to be worth it. It was. My walk to an event around the corner felt light as a feather. Thanks Gran Electrica for helping me take the first step of crafting a beautiful buzz on a Thursday evening. Hooray.", "author": "Leah L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}