{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Absolutely love this place. The margaritas are great and tacos are fresh! Backyard is great for this time of year (I wonder what they will do in the winter ?) We tried the short rib, pork, and fish tacos and they were a big hit! Chorizo quesadilla was one our faves too. The locations is great for walking in the area and exploring, Loved this place and can't to return!", "author": "Katherine I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-21", "description": "I really enjoyed their guacamole!  I had the chorizo quesadilla and my husband tried their tacos.  They were not superb, but solid good.  We sat out in the backyard area and it was really nice.  We'll go back for our neighborhood Friday dinners.", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Food was excellent and service was prompt and friendly.  The ceviche and the fish tacos were especially tasty.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I am so into Brooklyn right now and one of the reasons is the existence of super fun restaurants like Gran Electrica. With super cute fancy tacos and lots of fun cocktails and free chips and guac. AND an amazing back patio which is like someone's back yard if I had a friend who made totally kick ass Mexican food and cocktails and served it all with four tiny bowls of salsa. Uh, yeah right. I suppose until I meet someone who does that, I will keep coming to Gran Electrica.", "author": "Barb B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-09", "description": "This place wants to be high end Mexican food with high end prices.  While the prices succeed at doing this, the food does not.  This is average Mexican food at best.  The portions are small and the quality can be found at any average Mexican place in NY.  Dos Caminos has better tacos...and I don't even like Dos Caminos.  But you get two rinky dink tacos for $9.  The Al Pastor was dry and unflavorful.  Go to Snack Dragon if you need some quick tacos.\n\nThe biggest FU to the customer is the price of the Tequilla.  A shot of Don Julio for $15.  Seriously!?  While the Decor and setting is nice, I am not interesting in getting ripped off by overpriced drinks, poor service and average at best food.\n\nSo many better places in NYC for Mexican.  Screw it, for these prices just fly to Mexico City for a weekend (a really fun town) and go feast, party and explore.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-28", "description": "Don't bother. Overpriced and just not very tasty. \n\n\nGot chips and guacamole, a torta sandwich, and a carne asada plate. \n\nThe half-order of guacamole was the best part and it was average. $8 for a rather small amount of chips and a decent size of guacamole.\n\nThe torta came on a plate that had a lot of sauce on it. The bottom half of the bread was completely soaked in this sauce and when you went to pick the sandwich up, you couldn't. The meat (pork) was flavorless and save for a few lackluster onions placed on top of the bread, it wasn't much of a sandwich. \n\nThe 'plates' at this place don't come with tortillas. You have to pay extra for tortillas here. $1 extra per toritlla. (Shady)The carne asada plate was just skirt steak, a bunch of fried plaintains, and a small amount of cabbage. It was quite pathetic. Got the steak medium-rare and it was tough when it was served.\n\nThe staff was really friendly and the water glasses were always filled. \n\nI guess if it wasn't so expensive it would be okay. Or if the food taste better it would warrant the prices. What I'm trying to say is whatever was the second option you were considering for dinner tonight, I would just go with that one and skip this place.", "author": "Ari K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Good spot in the neighborhood.  Summers are great as they have a large garden area to dine and drinks.  The Ay Papi is the must have on the drink menu.  Food is above average and I generally feel satisfied.  It can get crowded on the weekend nights so call ahead for a reservation so you don't have to wait around.  Overall, a solid spot that I tend to find myself at once a month.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "Went on the later side of a monday night and there was no wait.  Fish tacos were hands down the best thing on the menu, and the guacamole was pretty good too.  Everything is a little on the pricey side (esp. the $9 bowl of black beans!) but over all food was good, and attractively presented.  The cocktails were tasty if not very effective.  Our waitress was fantastic, but service was in teams and the rest of the team was a little haphazard.  I would say good if you're in the neighborhood, but don't bother making a trip.", "author": "Carla C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "Really cute place in a great location in Dumbo, i so wanted to love this place especially b/c my hubby loves mexican, but overall they really need to use more salt in their food. Standouts include the drinks and the fish tacos but it still needs a lil' salt", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-09", "description": "Food is over-price for limited menu. Portions are small. Wish they would embrace Mexican flavors more. Was disappointed in the mole chicken. Cocktails are great -- but we were taken aback when their servers tried to get us to order their special (and more expensive) drinks. Felt like bad form.\n\nAmbience is pleasant and well-appointed. Fun to hang out at the bar.  I really want to like this place.", "author": "Tina N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "The restaurant is beautiful and the staff attentive and friendly. I loved the day of the dead wall paper. The margaritas were delicious. However, the food is overpriced. $13 for a small bowl of tasty guacamole and chips is a rip off. The chicken mole verde was good and interesting, but again overpriced . .. $17 for 1 chicken leg and sauce. Although the food was too expensive, I have to say it came out of the kitchen at the speed of light, so I'm not sure why we waited about 45 minutes for a table. The garden looks lovely as well.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "Went here for dinner a few weeks ago. Food was decent, but nothing to write home about. Portions are kinda small, as other reviewers have noted, so this is definitely a place where you order a few different plates to share. The guacamole was kinda bland and the chips not too fresh...but the gordita was a solid dish, as were the fish tacos. The margaritas were delicious and very strong. Overall, it is light years above that horrid place on Jay St, but isn't going to be on any top 10 lists anytime soon.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Delicious! Lovely garden seating. Very attentive and friendly staff. Will be hanging out here for the summer!", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "Went back there this past summer, and after the first bite I asked if they had changed the chef. They had, I KNEW IT! The fish tacos were not the same anymore. What a shame. Not being back since.", "author": "G. P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-08", "description": "My enchilada was covered in melted cheese and cold. The chips were the fried Mexican style tortilla chips if you like those.  Would definitely not recommend for food, the attraction here is there outdoor space but there are plenty of nice backyard spaces in brooklyn.", "author": "Si G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "Nice setting for brunch with a small group. I liked the decor. It was rainy, so I did not have the opportunity to check out the outdoor seating, which I have heard is nice. I ordered the pork tacos. They were good, but definitely not the carnitas-style meat that I'm used to. The pork was cooked well, crispy on the outside and moist on the inside. I ordered the chorizo con papas, but when it arrived, there were no papas. The waiter tried to tell me that they were just really small. He left and came back, then offered to take it back because the chef really wanted to give me a new one. The new dish, had very visible potatoes. It was obvious that they did not put them in there originally, and the waiter should have really taken a look and listened to me, instead of just brushing me off. I also had a regular, house margarita. It was good, made with fresh lime juice, so it wasn't too sweet. I'd call it refreshing. So, overall, the food and drink were tasty. However, after $34, I still had to go elsewhere and get a second small meal to finish filling my stomach. Going back is a toss up.", "author": "El L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-11", "description": "We came to this restaurant looking for a trendy Mexican restaurant with inventive food...which is what this place attempts to espouse. Now I understand and appreciate when a restaurant is appropriately pretentious. If the food and service are awesome that its understandable ....on to our experience. When we arrived we asked to sit outside and they complied. The outdoor space was 99% empty yet we were immediately faced with the hostess's lecturing us on how we cant stay in this table too long as they have a reservation. We said OK even though we did not understand why they just didn't seat us elsewhere. When the waiter came over he seemed nice enough.  Two of us were interested in the veggie tacos. Since the menu did not specify we asked if it came with anything...he abruptly said no just the 2 tacos. We said OK but can we please have rice and beans as a side (to have a complete meal). He said sure. He later came back saying that they actually had no rice (unusual for a Mexican place) and that there were no beans. We said that the people next to us have beans why can't we. He said its part of their dish and that they chef \"won't\" do it. We asked again that there was no way that they can get us beans so we can have a complete meal. Even though we were clearly upset he said no. The dish that eventually came was 2 tiny soft tacos with 5 half dime sized pieces of vegetable and nothing else. It was embarrassing especially that we could not even pay to supplement the dish with rice and beans just because the chef wanted to be a jerk. This place has no claim to pretentiousness . Lastly, they ignored a request to leave peppers out of another dish", "author": "Adam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "The dark-haired host acted as if we were crazy for wanting dinner last night (it was a busy Saturday at 8) and said we could \"TRY to order a drink at the bar,\" but we most likely would have to wait a while.  Luckily the female hostess chimed in and graciously told us she was about to seat a big group and also pointed out some people at the bar that were paying their check.  As everyone else has Yelped, the drinks are great.  The food is OK, but the salsas are excellent.  I'd go back... on a weeknight though. The female bartender was very busy, but friendly.", "author": "B F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "Such a fun night! The Mackerel ceviche is to die for as well as the beet margaritas...fun twist on Mexican cuisine.", "author": "Victoria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "great happy hours drinks... margaritas for $7. i had a spicy margarita and it was excellent. the bartender really knows the drink menu and is helpful if you ask for suggestions. the drinks ACTUALLY TASTED LIKE DRINKS as well! not watered down or basic.\n\nthe waitstaff was extremely attentive - we sat outside in the back patio which was very charming - got bit by mosquitos but they even have bug spray you can use!\n\nthe food was excellent - we all had small plates that we shared. the chorizo quesadilla was AMAZING!!!!\n\nthe only thing is is that when you sit down they ask if you would like to order \"guacamole and salsa\" normally in my experience salsa is included but i had a funny feeling about it and we changed the order to just guacamole instead. good thing we did because \"guac and salsa\" is $15 which is more than just the order of guac so be careful and do not think it is included!", "author": "N P."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}