{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Walking in this place and you already know that it must be good due to the crowd that it draws in. Trust me, it is worth the wait. From the freshly made guacamole and great taco selection with homemade tortillas to the very friendly host and amazing service. Five stars to the great find in DUMBO, a must visit.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "My boyfriend and I came upon this place this weekend. They had a sign outside for National Taco Day , I think. We were greeted by a nice hostess and we were given the choice of dining outside which was a perfect decision. \n\nThe outside dining area is so nice.\n\nWe were bought menus and we quickly ordered two beers and guacamole which was so good and I love the thickness and texture of the chips. The two sauces that are put on the table were amazing. We especially loved the red.\n\nI ordered the fried yucca and scallops. I guess I was hoping for bigger portions and for the scallops to be cooked. I wasn't expecting them to be prepared and served ceviche style.\n\nMy boyfriend ordered the Mussels Quesdilla which was delicious, a little hard to cut through and once again small. He has a huge appetite and was a little disappointed. He also ordered the rice which was so disappointing. I'm not sure if the rice they used was even long grain. I didn't like the flavor. For 5 dollars and a small dish of bland rice, i was upset. \n\nI had to give 3 stars because the ambience was so nice but the portions so small. However, I would come back again if I want drinks, guacamole and yucca.", "author": "Amber C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "I wish I could give it 3.5, because it does deserve that. The service was good; they gracefully accommodated a party of 12 even though our reservation was for 8. So good on them.\n\nAmbiance is great, especially if you can get a table in their back garden. Good for groups or a date, very romantic and intimate. Drinks are great. We had:\n\nWhole fish (wonderful)\nSopes de carne adobada (ok, not spectacular)\nAlbondigas (very good)\nSuaderos tacos (good)\n\nThe highlight, though, were the desserts. Totally surprised us. The flan might be one of the best I've ever had, and the chocolate pudding was fantastic. Churros and tres leches were good, but not as good as the others.", "author": "Seisei T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-05", "description": "Ugh, my experience here was pretty awful. We sat outside and in sum, it was loud, hot, slow, and uncomfortable. \n\nIt was a busy night and there were a ton of children, so that's what made it so loud. Because of the way the buildings ar,e and the fence is, around the outdoor space, its really impossible to feel any draft. \n\nAnnoyingly (!?) there are a lot of ways the restaurant could improve the experience. They should consider getting some fans. The service was pretty slow, and since we were kind of eager to leave pretty soon after sitting down, it wasn't cute. \n\nTheir chairs are insanely uncomfortable. We sat along the edges of the space, where one side sits on a bench, and the other sits on chairs. The bench is too high for the table (knees touch the table) and the chairs are too low for the table. Unbelievable...?\n\nThe menu immediately reminded me of La Esquina's, but the food was much worse. \n\nI wouldn't go back again, for so many reasons.", "author": "Andrea Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "Came here on Friday Night. It was peak happy hour and we had a party of 8 so our wait was 40 minutes. Not a big deal so we hung out at the bar. That's where the problems started.\n\nPositives: The Chips, Salsa \u0026 Guac was good. Very tasty. They replenish the chips frequently so that was nice. \n\nNegatives: The food was meh. My pork was super chewy. My friend's chicken was super dry. The margaritas were good but are too expensive at $12.00 for a whisky tumblr size serving. Lobo in Carroll Gardens (not exactly a cheap place to live either) has double the size margs for $15.00. \n\nHuge Negative: Because we were standing at the bar and it was sort of crowded, we were sandwiched in between the side of the bar and two high top tables. The space was limited but we didn't have a choice. As a result, at one point, I turned around to go to the bathroom and bumped a waitress. I said \"oh sorry about that.\" Her response: \"Okay. Maybe it's not obvious that the kitchen is there (points to door) and there are tables back there (points to back of restaurant) but I need to do my job.\"\n\nI'll give it three stars for the food/drinks but knock it a star for the not-so-friendly waitress.", "author": "Nate P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "Beautiful decor, great outdoor patio, really great sonic branding with the musical selections, amazing guacamole with pineapple in it, and decent fish tacos. What more could I ask for besides Adriana Lima to be the waitress. :) \n\nThis place is beautifully done, from the decor inside and the bar to the color schemes of the staff outfits and the layout. Service was excellent, our waiter made sure to tell us about the special and the low price on it; we didn't order it, but it sounded great. \n\nThis will become my go-to whenever I'm in Dumbo and need a drink, some nice ambiance and a few good Mexican bites.\n\nTry the shrimp tostaditos, although for $11 they could give you 3 instead of 2, they are still one of the better small bites I have had here.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Came here during happy hour -- the margaritas and plantains here are really scrumptious. It's a bit pricey and out of the way, but it has a great atmosphere and is a great place to hangout. Haven't been here for a normal meal yet so I can't comment too much on the food.", "author": "Cathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "This place has a gorgeous courtyard - perfect for balmy nights. Inside is quirky, great vibe and dimly lit. Food is divine, all of it! Been here several times and plan to return. Cracking find.", "author": "Zoe W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "It was...okay? A little worse than okay? We really wanted to love this place, as we're always on the lookout for Mexican spots within walking distance from our apartment.\n\nFinally made it to Gran Electrica and our hopes were high. We were seated promptly (had a reservation on a Saturday night, and the place seemed reasonably busy) by a friendly host, so off to a good start. But from there, it really went downhill. Our server took maybe 20 minutes to bring us water and take a drink order. We skipped the margaritas (although maybe that was our fatal error! I've heard they're awesome) and went for wine -- it was watery and just...not good. Two glasses of wine took about 15 minutes to get to our table. Ordered guac, salsa, and chips. Guac was fresh but so, so, so bland...we actually sprinkled table salt on it to get a bit of flavor. Same with the chips. Salsa was watery and flavorless. Like a mildly spicy tomato soup. We then went for chicken tacos, veggie tacos, and a mixed salad. Tacos were t-i-n-y and mediocre...salad was maybe the best part of the meal.\n\nThroughout dinner, service was friendly but exceedingly slow. That would've been fine, if the food had been stellar, but it just wasn't. Maybe Gran Electrica was having an off night, or maybe (because the ambiance is great) it's just a better spot for a few drinks rather than a full sit-down meal.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "The guac and chips. I am a fan. I got the chile rellano, which was quite good. The bf got the market fish, which was amazing.\n\nRidiculous wait, good drinks.", "author": "Amelia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "my fiancé and I recently had dinner and drinks here on a muggy Tuesday night to celebrate our recent engagement. we were skeptical because of the mixed reviews but I know well enough by now to not always go off of that. the hostess and gentlemen who showed us to our table were both extremely friendly. the patio is absolutely adorable. ivy growing up the brick wall made it feel so romantic and like we weren't in Brooklyn. the food was absolutely delicious to say the least. we had the ceviche, which I had read reviews saying there was too much fish in it.... uh that's what you pay for and the best part, and it was scrumptious. two blood orange margs, fire. I had the pork \u0026 beef tacos and both were outstanding. my fiancé had the fish \u0026 pork tacos and loved them both. needless to say we had an amazing night, the service was incredible and the food was truly delicious. we actually haven't stopped talking about it and will be back ASAP!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Deliciousoooooo!!!! Fresh fresh fresh, amazing ambiance and decor, the food was awesome. I recommend the 20/20 margarita which is a heavenly combo of carrot juice, ginger agave, and tequila. The chile relent was also amazing, as well as the sopes. Will definitely be back.", "author": "Sophie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "$7 happy hour margaritas with coworkers? A great way to see the true nature of the people you work with. Quickly.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "As you walk past the long lines at Grimaldi's and Julianna's, you'll pass this nondescript rustic restaurant front. Despite a seemingly empty restaurant front on Sunday afternoon, we were led to a quaint sunbathed backyard. In the words of my companion: \"This feels like the a neighborhood backyard picnic\".\n\nWe managed to squeeze in the last brunch orders - they serve brunch until 3pm and we managed to put in our order a bit after 2:30pm. As an avid bruncher, I'd say this place is charming due to its casual laid back vibes and attentive but down-to-earth staff. If you're looking for a lazy Sunday brunch, Mexican-inspired egg options and some strong tequila-enfused cocktails, this is the place for you!\n\nWe had the Chilaquiles which was hearty but slightly too rich toward the end of our meal. The Huervos Rancheros had a great balanced roasted tomato salsa base. In terms of the cocktails, if you're not a fan of super-sweet cocktails and looking for an alternative from the typical Bloody Mary, the Margarita de Toronja Picante was on point. The grapefruit juice lent a refreshing kick to the drink without the over saccharine of agave syrup.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Went for early dinner on Saturday night. We luckily got a table right away even though we were walk-ins. We started with the Guacamole and chips, which was really good and creamy. We also tried the special salsa of corn and heirloom- it was luke warm and not my favorite.\n\nWe also tried the beef tongue tacos! They were delish!! The meat was so tender and very flavorful.\n\nThe staff was VERY attentive and friendly. It was a great dinner!", "author": "Sam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "HIGHLY RECOMMEND sitting outside in their backyard.\n\n\nThe service is at its PRIME.\nthe food is the BEST\nthe prices are on point for the quality of food, ambiance and overall level of professionalism this establishment has to offer.\n\nA must try place", "author": "A V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "Over priced. Over rated. A small basket of chips and ramekin of guac $14!!! This is the type of thing other restaurants would give for free while you wait for the kitchen to open. The waiter recommended the crab tostada special, a tablespoon of crab on a silver dollar sized taco. After paying the $90 bill, we went elsewhere for dinner.", "author": "Anne F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "The service is wonderful, and so is the guacamole, but the rest of the menu is seriously lacking. I had the carnitas tacos and they were the driest tacos I've ever had. Just pieces of pork shoulder, a few wisps of onions and some cilantro sprinkled on top. DRY!\n\nThis place tries to hard to be artisanal Mexican food and is seriously missing out on the opportunity to make tacos that keep people coming back.\n\nThe outdoor seating is great.\n\nGod bless this place. Every time I come here there's a different restaurant at this location. Hopefully this place can last longer than two years.", "author": "Elle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-25", "description": "2 stars, because I LOVED the ambiance, the beautiful patio, and the waiter looked like one of my nephews. The cocktails were good too...\n\nFood was average, and portions unbelievable small. We had to ask for napkins, utensils and plates....\n\nBut, hands down, the worst was the hostess: young, cute girl, but yet bored looking, annoyed to no end, inattentive, overall bad attitude....weird beyond belief.\n\nShe needs to step away from the podium. Bad for business and a terrible first impression for 1st time customers....", "author": "Scarlett P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "I moved to Dumbo last August and my wife heard about this place. We tried it out and was great the first time. Tacos were good, menu always changes, drinks were pretty interesting (albeit expensive). Other dishes include brisket, and other mexican staples. We even took the in laws there but slowly noticed after 3-4 times that food was just going downhill.\n\nAtmosphere is GREAT and cozy. It's right next to Grimaldi's if all else fails. The last time we went back two weeks ago, there were some hairs in the tacos and the fish in the tacos tasted like soap. We split three orders of tacos and had two drinks and the bill was close to $75. It's fun and all to go out to dinner, but this left much to be desired and I probably will hesitate to go back again anytime soon. Try Al Mar, Grimaldi's, Noodle Pudding.. all nearby.", "author": "Arun J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}