{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "My friends and I stumbled into this bar while walking around Dumbo and the atmosphere was exactly what we were looking for. Great drinks and good music. They had some really interesting tequilas. My favorite was the Tequila Ocho. They can serve it anyway you want it. The bartenders are quite skilled in their craft. I would definitely go back.", "author": "Brenda N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "I would give this place 4 stars, but I have to give it 2. We are local Dumbo residents and come here often, but realize that this establishment does not prioritize the customer experience and overcharges for just about everything. They charge $7 for chips and salsa (!), and while the salsa is good, the chips are not and taste like they're over fried. When we ran out of salsa we asked for more so we can finish our chips, they wanted to charge us for another salsa!! Are you kidding me?! Most restaurants provide this for free, but when we place an order of $7 chips and salsa, we should receive a replenishment of salsa if we still have chips to finish at the very least! And the serving of salsa is so tiny to begin with! The bartender refused and when I pushed back, she asked the manager and the answer was still no. Unreal. Come here for an overpriced experience with blah customer service.", "author": "Kimberly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "Made a res at Gran Electrica to celebrate my bday with a group of friends. Without getting into the messy details, let's just say there was a pretty big miscommunication on my end. The staff at Gran Electrica had every right to hold us to our mistake, but instead they were INCREDIBLY kind and accommodating. We ended up having an excellent time, food/drinks were great (we had mostly tacos and margs), and we were never rushed. A++ Special shoutout to GM Andrew and our wonderful server! Thank you again!!!", "author": "Laura B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "We were searching for some real food in the area that didnt require too much of a wait on a saturday. We basically waited for about 10-15 minites without a reservation which wasnt too bad.\n\nThe menu is basically cheese, cheese, and more cheese. I got a pot of cheese with chips which was delicious. \n\nThey have an outdoor area that is beautiful and I love that our group was not rushed despite their popularity.\n\nIt's a great date spot or place to hang out with a small group of friends.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "This place is so cute! What a great outdoor area, definitely recommend everyone check this out in the summer!\n\nI got a margarita and it was delicious! We also ordered the chips, guacamole and salsa which was good. We also got the ceviche which was very refreshing, and also ordered the chorizo quesadilla. Only thing is it didn't seem like a quesadilla, more of a large taco. \n\nWould be back for happy hour and more food.", "author": "Tahima B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "It sucks that I had a bad first experience at Gran Electrica. I love the Brooklyn Bridge Park Area close to Dumbo so I was hyped to finally eat at Gran but- it was absolutely DISAPPOINTING.\n\nI've ate at Gramdalis and Pedro's around the area both are pretty okay but Gran Electrica stands out so beautifully you would think it's four-five star dining but it's truly not.\n\nI went with my best friend and as soon as we sat down our waitress greeted us and gave us a menu. Long story short- the LADY WAS RUDE. Just out right miserable. She forgot my friends drink. Looked annoyed when we asked her what she would recommend, not attentive at all to us really. Which idk maybe they need more waiters \u0026 waitresses? Anywhom.\n\nFood was ok. Just ok. Pretty pricey for Ok. \nDon't like their salsa. Tacos pastor was just pernil on a soft taco shell. Salsa tasted like marinara sauce. Chips were salty.\n\nMargarita was way too strong (I know what you're thinking how is that a bad thing) but the mix they put in was very sour didn't help out the tequila. Not a good balance. Just didn't like it. Oh and when I asked for a straw for my drink they didn't have straws.............. hmmm okay? \n\nI think my rent here is done. One star guys.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Decided to spend part of July 4th in Brooklyn by walking around Brooklyn Bridge Park. The sun was out and the heat was up and there's only one way out of that situation: HYDRATE.\n\nWe were in the mood for a cocktail, so the Yelp app led us here to this gem. I was immediately charmed by the exterior of the venue as it was clearly in an older building that had likely been there for well over 100 years. Walking in, the space was dark except for dim lighting and natural sunlight. People and one family with their little baby were leaning over the bar awaiting their drinks while others took up some of the smaller tables. I was hoping the space would be bigger since it's hot and no one wants to be immersed in body heat. Despite the little crowd, we were offered a table for two either outside or in. Wanting to be outside again - it might've been hot but it was just gorgeous out - we ultimately made a great decision. Walking towards the back gave us a tour of the venue essentially. Before stepping out onto the patio, there's a larger space for people to sit by the window to enjoy the light but stay perfectly cool. Walking out, we looked down to see a lush, green space with flowers, umbrellas and a small outdoor bar. Going down the stairs it felt as though we were walking into someone elses yard - a yard filled with tables to accommodate several friends who would at any moment drop by to have a meal or drink.\n\nSitting down, we were facing the back of the building and other tables that were quickly filling up with other thirsty patrons. All the servers wore immaculate black and white uniforms but had very cool attitudes. Our server was particularly fun, offering us their special which was a discounted frozen drink in either a small or large size that could be shared with 2 or more people (or just 1 with no judgments). While we waited, it would seem a reservation would absolutely be necessary so we counted ourselves lucky! Not feeling paricularly peckish, we decided to have snacks. I had two tiny Tinga de Pollo tacos (roasted tomato-chipotle braised goffle road amish chicken, queso fresco, crema, cilantro) and B had two tiny Carnita tacos (heritage berkshire pork, onion, cilantro, lime, salsa verde). None were spicy or terribly mind blowing but they were packed with flavor and truly hit the spot. To be honest, our drink was the star and I would say come here for the drinks and nothing but the drinks - unless your blood sugar plummets then that's when the tacos will come to save the day. And don't hate me, but I don't remember the name of the frozen drink but it comes in a trademark, chic copper pineapple shaped cup. It was the perfect size (small) to share between two people and it was utterly delicious - like having coladas on the beach and leaving your OOO notification to answer your e-mails for you. \n\nFour solid stars for the location, ambience, service and drinks! I can't wait to come back when I make the journey to Brooklyn again!", "author": "Anna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "A group of my friends and I went to Gran Eléctrica for dinner and drinks yesterday evening and had an amazing time! Although there was an initial hiccup with finding our reservation, the staff was quick, friendly, and accommodating. \n\nOnce we were seated, a server came and checked in with us to make sure that we were comfortable. After quickly perusing the menu, we settled on a mix of margaritas and sangria (our group highly recommends the Margarita de Toronja Picante and Ay Mami!). \n\nEach of us tried a different plate of tacos, had rice, beans, and plantains (which were a real hit!). All the food was wonderful, fresh, and flavorful. Everyone loved what they ate (especially dessert - the púdin de chocolate was delicious)\n\nThe service was outstanding, and the whole mood and ambiance of the restaurant was fun and welcoming. \n\nI've been here many times before, but this visit was one of the best. We look forward to coming back in the summer and drinking margaritas in the garden area!!", "author": "Samuel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "What a gem! I loved everything about this place: the food, service, decor, lighting, music, and over all vibe. It's hip without being douchey, and high quality without being pretentious.\n\nMy friends and I stumbled in on a busy Saturday night. The host/manager was super kind and helpful in getting us set up at the bar and said he'd have a table for us in 30 minutes... we were at our table in less than 20. \n\nOur margaritas were perfect. (I had the Pepino, a margarita with cucumber and cilantro in it.) We shared the queso fundido with chorizo to start, and that was really tasty. I'm glad we were sharing it, or I'd have eaten that whole bowl of melted cheese and chorizo. I really wanted the guac, but my friend hates avocado. (Who the hell hates avocado???) I ordered the fish tacos, which were delicious. Good fish tacos always remind me of being on vacation in Mexico. My friends and I shared the plantains and black beans, both were well-prepared and really satisfying. \n\nOur waiters were attentive and sweet, which can be rare toward the end of a shift, and even though our food came out fast, they didn't rush us out. \n\nSo that was our late-night snack. I can't wait to go back for a proper dinner!", "author": "Marisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Solid place! Great drinks and the quesadilla and pollock tacos were great!! Great service also!!", "author": "William K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Great customer service. I had the best experience ever. So glad I found it I will be back! The food was so good fish tacos are a winner.", "author": "velvet l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "I love the Day of the Dead theme they have going on here.\n\nMy friends and I back in late March were visiting Brooklyn for the first time. And to be honest, we stumbled upon this place because we needed to use the restroom (which they definitely have!) after walking across the Brooklyn bridge. This place is really close to the Brooklyn exit (about ten minutes!). \n\nAnyway, I'm so glad we found this place. Cute restaurant, extremely friendly staff, and delicious food! We only had some coffee and snacks. I ordered drip coffee and they made it in a french press! As one who worked at a coffee shop, I'm normally picky with brewed coffee, but this was great!\n\nIn terms of the snacks, we ordered their churros which were AMAZING. Definitely recommend. I'll certainly come back someday (especially since I'm moving to NYC in a month )", "author": "Aaron G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "This was the most horrible experience.  The food was disgusting, the drinks was discusting. That was not Mexican food. I will never come back. The nerve of charging $16 beyond small guacamole butter dish. Highway robbery.  I wont recommend this place to anyone. Tasteless. We put salt on everything. I have to brush my teeth to get the taste out of my mouth. And rinse with mouth wash.  And I was left hungry because the appetizers as meals. The reviews were done by the workers. It was not the customers review.", "author": "Lourdes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "It sucked that their happy hour only is for the bar and not the patio but OMG the patio....\nIt blew me away....so much so that I forgot I was upset about full priced drinks. It's right under the Brooklyn Bridge and the service was just wonderful. I loved it here, and the food was PERFECT as well. Will DEFINITELY come again.", "author": "Lydia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Great Mexican style brunch at a fair price in a cozy atmosphere right by Brooklyn Bridge. The staff was extremely nice and the dishes right sized and delicately prepared.\nExcellent service. Awesome experience.", "author": "Ander C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "Don't come here expecting to get your money's worth. Expensive for no reason! First, they wait until I ask for not one but two items from the menu, the Al Pastor and a drink that has passion fruit, guava, etc and they respond they were out. Why not state that in the beginning before orders are placed. When our food comes out the portion especially the rice is served on a dish small like the ones used for small sauces. Smallest servings of any French or tapas restaurants I've ever been to. Too bad bc they have a nice decor.", "author": "CC M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Gran Electrica hosted our wedding ceremony and reception. It was perfect! The outdoor space is ideal for a wedding. Our event coordinator Kate did a great job of getting everything ready prior to the event and working through all logistics to make sure our day was special. Kate will make sure to cater the event to whatever you are looking for. We did a tapas option rather then sit down dinner and it worked great! The whole restaurant staff the night of was fantastic; Joe and his team went above and beyond to make us feel special and make sure we endless food \u0026/drinks. Even when rain threatened to ruin our evening, the team did everything they could to make sure we were all set either inside or outside. Food won't disappoint either - pork tacos were my favorite! Can't recommend GE enough for a private party or wedding!", "author": "Jake A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "My husband and I are obsessed with Gran Electrica -- so much so that we decided to host our wedding reception here!! Kate (the event coordinator) and the entire GE team were wonderful to work with, responsive throughout the planning process, and provided incredible service the night of the event. Our guests loved everything -- the delicious food, incredible drinks, and most of all, the great service. I would highly recommend hosting an event here -- or at the very least, stopping by for dinner :)", "author": "Grace S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "Underwhelmed -  three folks in our party.  We ordered the salsa and chips (4 oz or so) $7.  Chicken, tongue, and pork tacos-  no real flavor.-  the chicken is super fresh-  just lacks layers-  more \"tomato\" than chili flavor.   Try a food truck.", "author": "Dawn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "Make a reservation! Especially on weekends when dumbo is insane. \n\nThe margaritas are spot on excellent. Could have sat there all day just drinking them. \n\nThe food was good but not absolutely brilliant hence the 4 not 5 stars. My kids both had the quesadilla. It came out with no side of guacamole. Not a huge issue but it was tiny. About half the size of any other quesadilla I have ever ordered. An odd choice\n\nI had a brunch item which was tortilla chips soaked in green salsa and then fried eggs on top. It was good but had too many tortilla chips wadged together to make the bowl look fuller. I would have preferred less, to have had it served on a plate and then to have some salad or\nSliced avocado on the side. Just a thought. I really liked the first few mouthfuls but stopped half way through as it was just too much. \n\nThe garden opens end of April and I think spending a long afternoon sitting in it and drinking margaritas could be a perfect way to spend a weekend day. Enjoy!", "author": "Erika T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}