{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "Sometimes the best places are the one you find at the last minute. This time the choice was mine to make and although I've frequent other spots in the area, I wanted to try something different. As it has done many times before, YELP saved me. Gran Electrica won the day. \n\nGran Electrica seems to be quite popular and so I would highly recommend that you make a reservation. It's a small place but absolutely charming. This night I was dining with a friend and so I guess reserving a table was easy. Although they have seating on the inside, we opted to eat out on their patio. I'm glad we did. It doesn't have much of view but the ambiance it provides is cute. \n\nThe staff was excellent. I didn't catch the brothers name that served us but he was definitely on point and our tip reflected that. As for the food, I wish they would add another taco. Most places give you at least three. The two fish tacos were superb but two left us wanting more. The salsa and guacamole and margaritas were equally delish. So, if your in the area, make a reservation and enjoy.", "author": "Percy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "Gran Electrica reigns supreme as both a dinner or brunch spot in the summer months. I've been here before for dinner and had a great experience, so when friends recommended this spot for brunch on a sunny Sunday, I was in.\n\nGarden seating is where it's at. I had only ever dined there at night but it's equally as beautiful in the day.\n\nThe drinks were spot on. I went with the Pepito which was extremely refreshing. My friends tried the Paloma and the Sangria which they raved about as well.\n\nI will say that the portions are pretty small for the price, but the ambiance really makes it worth the splurge.", "author": "Cristina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "This review is specifically for the bar.\nAfter walking the Brooklyn Bridge at night, a friend and I were looking for a little place to sit, have a drink, and maybe munch on something.  We had heard that this place had great churros, and we could get a drink too, so we thought we'd try it.\n\nFirst of all, the churros were NOT what we expected.  See my picture if you're interested in what we got.  I don't know what we were expecting... but it wasn't this.  They seemed like they had been packaged.\n\nAnyways, the churros aside, the drinks and bartender were great.  We enjoyed just sitting and taking in the atmosphere.  I really did like the decor and our bartender was attentive, but not too attentive.  It didn't seem like this was too touristy. The feel was local, but it could have just been the evening. \n\nI would probably come back, but I wouldn't order the churros.", "author": "Joley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Came here with a friend to get drinks and catch up. Dumbo has become pretty touristy but this place keeps it cool. When we got there around 5:30 pm it wasn't that busy and we stayed for a looong time. Sitting at the bar, the bartender never rushed us to leave and even as it got really busy they stayed attentive to us. The drinks are also reasonably priced. We ordered all the margaritas, the cucumber (pepino) margarita was my favorite. The grapefruit marg was only a bit spicy, with I nice grapefruit flavor. \n\nWe ordered the sangria tostada, I thought it was awful. Not the bartender's fault because they make it in batches before the day. Neither of us liked it and a couple girls next to us also ordered it an complained of the taste. This sangria has a very strong flavor of mezcal (smoky) but with the fruitiness it's just not a great combo. I ended up returning it and getting another margarita.", "author": "Melinda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "It would be hard to think of Gran Electrica as anything less than a 4.5 star place. Occasionally, the host area doesn't live up to the standard of the restaurant, but that's about it. Literally this place is awesome. The drinks are my favorite in the neighborhood. There's a particular mezcal cocktail that's not to be missed - reminds a little of an old fashioned. I've never had less than a great dish here, the food is simply incredible. Really love the stuffed pepper in particular. Service, great any very personable. Huge fan of this neighborhood gem.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "I walked in with a friend and asked the hostess if they had happy hour, she said yes then proceeded to seat us at a table, then our server came and told us happy hour was only at the bar, so we had to sit by the door because the bar was full.\n\nOnce we finally got the bartenders attention the margarita electrica was very nice, and we ordered chips and salsa. Chips are cold but salsa was spicy and great.", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "New York. Tacos? Brooklyn. Tequila? Dumbo. Mescal? I'm in love with Brooklyn already. Forget the City. Well, you don't have to because cross the bridge and you are in the heart of it anyway.\n\nAll I know is that this night was about meeting one of my besties from DC who resides in the area now and we were staying within walking distance of Mexican food. Our hotel recommended Gran Electrica. It's small, intimate and has a fun decor. Similar to our ethnic haunts of restaurants and bars in the District and Virginia (where we spent time during our 20's and 30's). We had electric soul then and we have no reason to give it up now!\n\nBoth of us married and husbands in tow, tonight was about great company and good food. The word Gran fits more with our age now, but thank goodness you can sit in a room and have a conversation at an appropriate noise level. My meal consisted of a Agave cocktail (wait for the punch line) with a sugar rim that was superb. Of, course I got the tacos and a side of rice. Forget the signs outside (on this night, although they will make you laugh), the tacos won and no need for tequila as the only people we were texting this night were in our own group. \n\nMy friend and I have dined at George Bush's (senior) favorite restaurant in Falls Church, VA, so intrigued our friends purchased us ALL the Bok Choy plants in the restaurant to decorate my new place at the time (and struggled to get them home safely), we attended Shaquille O'Neill 21'st birthday party at Lulu's in DC (before anyone really knew who he was) and these are the tame experiences of our existence. We had MANY coincidences, more than any two people probably could have, which no longer make things a coincidence. Perhaps, it was just meant to be. I love my homegirl and Brooklyn. Our husbands area pretty amazing too. \n\nAnother reason to eat at Gran Electric. Napa! We will have to visit the NorCal location on our tour of Jam Cellars and BottleRock.\nGran Eléctrica create cocktails that give back to charities, such as Black Lives Matter, Red Nose Day, The UN Refugee Agency, etc. \nPrior to our trip, the son and daughter in-law recently discovered a bat in their home in New England and had to bring in an exterminator. \nGran Eléctrica has a line of \"bat friendly\" agave spirits (I sure hope that's the one I tried). Apparently, there would be no agave without bats. So the punch line is...when life gives you bats, it's time to make agave! Cheers to the perfect Halloween to be treat!\n\n#BrooklynDumbo\n#TacosandTequila\n#NoBatsNoAgave\n#ElectricSoul\n#MeantToBe", "author": "Elle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "Nice atmosphere but average food. Food is a bit on the pricier side and the restaurant does not offer complimentary chips and salsa. I ordered the Carnitas tacos ($12 for 2). The taco was good but on the dry side and did not come with any sides. The restaurant was very lively on a Thursday night- a great atmosphere to socialize with friends.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "It was a rainy Sunday, my plans were stymied, so I knew only tacos could save the day. Gran Electrica not only provided delicious food but great music.\n\nIt's dimly lit, so this place makes a great date night spot. I really like the design of the restaurant; it's intimate, romantic, and carefully curated. I came with 2 other friends, and we were seated rather quickly. I ordered the fish and pork tacos, the plantains, and the churros.\n\nThe fish tacos were my favorite thing, I had to order another one! It was perfectly fried, and the flavors surrounding it were perfect. I enjoyed the pork tacos, but they didn't give me as much joy as the fish ones. I loved that the plantains were covered in cheese, and they were perfectly ripe. I loved the churros; they gave chocolate and caramel sauce, and the caramel sauce was my favorite. I will definitely be back again to try the guacamole and the short rib entree.", "author": "Renee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "I come here every time I'm in New York, and the experience is always amazing. Located right in Dumbo, it's a really great location. Good vibes throughout the entire restaurant, and has a nice aesthetic. I love the candles and the lighting, the bar set up is also super cute. \n\nI usually order the fish tacos, and they're always delicious and fresh. They're very filling and a great value for what you pay. Also, their guacamole is so delicious. A good selection of drinks, and the servers are always great for providing recommendations.", "author": "Athiang M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "One of my favorite spots EVERRRR!!!! Third time here. This time came to meet with an ex who wanted to get together *insert eye roll emoji here* Cozy. Intimate. candle lit. The ceviche is to die for. Their margarita electrica is superb. Late spring/Summer months the back patio is open so you'll definitely enjoy that. Treat ya self", "author": "Tavia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "Super cool tequila bar in DUMBO which we enjoyed thoroughly! Great put very petite guacamole and salsa for $16 which is pretty steep considering how tiny the portions were but totally cool place! I would definitely come back here for happy hour and more cocktails and ceviche next time.", "author": "Elisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "I was wandering through Dumbo and found this little spot- It looks like a hole in the wall but it's FAR from. Once you get inside the atmosphere is comfortable and chic. I sat at the bar and I had wonderful service and incredible food. More than happy to return when in the neighborhood.", "author": "Mallory G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "Host, staff, food and location are amazing. What more could you want?\n\nI first came here about a year and half ago with a Mexican friend who recommended it to me as authentic Mexican food. And it was certainly delicious.\n\nI came back again tonight and the experience has gotten even better.\n\nReally enjoyed, thank you!", "author": "Paula F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Very cute and cozy place in Dumbo with a great menu. If you enjoy Mexican food I will definitely recommend this place. \n\nMind well, their menu was small but can cater to all types of diets. Everything we tried was delicious. If you like spicy food then make sure to ask for their two house made sauces. The staff was very friendly, patient and accommodating. Must try!", "author": "Purvi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-27", "description": "Walking around DUMBO. Found this great place by accident. The store front is a door. The GEM is the patio in the back. GREAT FOOD, GREAT SERVICE, GREAT PRICE. Being from Arizona we know Mexican Food. Give it a try!", "author": "Eugene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "I've been meaning to come to Gran Electrica for years and for one reason or another have never made it. Finally I changed that. Knowing they have backyard, my fiancé and I decided to pop in for a light dinner on a nice night. \n\nThe good: the food was tasty, the service was attentive, and the backyard was pretty.\n\nThe bad: I should have guessed when I noticed we were surrounded by tourists and not locals that Gran Electrica wouldn't meet the hype. I hate when it's happy hour but that doesn't extend to certain parts of the restaurant. Always feels a little sneaky. Unfortunately we were unaware of this until we sat down. Had we known we might have just stayed at the bar. The food was very overpriced for the small portions. Chips, salsa and guacamole for $16? They came in small bowls with a laughably small amount of chips. Not worth the money at all. Finally, within an hour of eating both my fiancé and I had terrible stomach pains.  Of course we can't know for sure what caused it but the food at Gran Electrica was the only thing we had together that day as we were both coming from work. \n\nIn general, I can see the appeal but Gran Electrica isn't for me. I left feeling like I had been fooled a little. On paper it sounds perfect - good food, service and atmosphere - but the other details negated those things.", "author": "Liane C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-23", "description": "It's fine. Not mindblowing, not disgusting, just fine. The Pescado Veracruzana was decent but could've been more tender. The Verduras was a bit bland. I did enjoy my Margarita de Pepino, but you can get good margaritas anywhere.", "author": "Josephine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "If you're in the area \u0026 looking for your Mexican food cravings to be satisfied, this is the spot. The location isn't too bad either, located in Brooklyn but closer to the bridges so you're really just a hop on a subway or walk across the bridge from the beautiful city of Manhattan. \nThis spot is the perfect cross between the cultures in the city of Brooklyn. The flavors will give you a feeling you've never experienced before. Savor the lengua tacos \u0026 enjoy the delicacy of the beautiful surroundings.\nThe venue is really nice. The wallpaper screams art literally. You're surrounded by a wallpaper design of sugar skulls in different settings. \nPlus, the servers always make sure that your cup is full.", "author": "Janine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "My friends and I were walking around Dumbo on a Friday night, and saw this place under the Brooklyn Bridge. We went in, and we're so glad we did! This is one of the coolest bars I've ever seen! They take great pride in crafting their cocktails, and making sure your drink is exactly how you thought it would be. This isn't your typical bar, every cocktail is handcrafted by organic Mexican spirits.  \nThe bathrooms are very clean, and very big. I didn't order here, just had a couple drinks with my friends. The bar area is amazing, and we were treated very well by Everyone we came in contact with! I would definitely Come back to this place in the future!", "author": "April C."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}