{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Great outdoor space and ambience. Food is great, but serving is on the smaller side vs portions at other Mexican restaurants.", "author": "Idyl M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "Appalling, inedible food. What a shame. It's a beautiful space (albeit way too warm - no AC), great atmosphere and music, pretty good service, but the food is extremely terrible. \n\nWe ordered chips and salsa + guac. Chips were very stale and had no trace of salt (wtf!). Salsa was incredibly bland and watery, and the guac tasted like mashed up avocados. What happened to the salt, lime, and onions? Chips \u0026 guac might as well be called \"chips and mashed avocados with soupy salsa.\" From there, I already wasn't expecting much for the rest of the food to come. \n\nI had ordered the oyster + crimini mushroom quesadilla. And um, I wouldn't even call it a quesadilla. First of all, the tortilla was so hard and stale. Secondly, the filling had absolutely no flavor even with lime juice squeezed all over it. I could barely eat it. Plus, it was placed on top of brown paper, which was totally unnecessary and made it hard to cut the quesadilla. I just ate all the filling to sustain my appetite (and likely pieces of the brown paper...). \n\nAnother reason why I wouldn't recommend this place -- it was extremely hot in there. I don't get why they didn't turn on the AC. Everyone in my table was sweating. At one point, I started to feel nauseous. I think the waiter overheard us ranting about the warmth, so he brought over water glasses filled with ice. Okay, why didn't you do that from the start!? Who in the world serves still no ice water during the summer!? Jeez. \n\nOh, and the chocolate pudding (someone else ordered it, and I tried a spoonful) was very disappointing, too. I didn't know that you could go wrong with chocolate. The pudding, like everything else, was bland and had no flavor. \n\nBottom line: don't come here if you're looking for Mexican food, are sensitive to heat, like flavorful GOOD food, and if you like to eat.", "author": "Lin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Nice food and atmosphere, very pleasant service. \nDelicious drinks!\nChile Relleno should have been better :(\nTried tons of other dishes and was pretty happy \nWill probably come back in the summer because garden looks awesome!!", "author": "Valerie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Good place to brunch in open garden behind we are just under the  Brooklyn bridge\nThe Mexican food is good and service too", "author": "Arno V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "This place will always be near and dear to my heart: it's where I went on my first date with my boyfriend. We came back recently for our year anniversary, and it was still great.  Solid tacos, awesome margaritas, and a gorgeous outdoor seating area...only downside is that it's smallish portions for the price, but, that's DUMBO. We also love their Dia de DUMBO wallpaper...look closely. It's some of the best wallpaper in town.", "author": "Erin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "Gran Electrica is a mexican place that advertises their tacos and that was open on a Monday night, on a street with only pizza options.\nIt isn't very big but I didn't feel like I was sitting on top of other people. \nThe menu had a lot of choices, and one of the most interesting vegetarian tacos I have seen-with pumpkin.\nI had the fish tacos, grilled instead of fried. You get two tacos per order, not sure if they indicate that, but it probably wouldn't be enough for a proper dinner. It's more of an appetizer size. Not the best deal, but everything was done nicely and service was good. \nThe vibe here is very relaxed and a decent choice considering there isn't much on this block, unless you want to deal with the whoel Grimaldi's thing...", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "Fast service and good drink menu but I certainly wouldn't return for the food.\n\nFish tacos were totally lacking in flavor, guacamole was bland, and the chorizo quesadilla was basically a big grease bomb. The maduros provided a glimmer of hope on a very underwhelming dinner.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-25", "description": "Very disappointing. I loved the space and no frills storefront, but the food was a major let down. I got the impression the chef just didn't know Mexican flavors well. My fish tacos were standard tilapia in under seasoned batter with very little flavor imparted by the sauces. I wanted to say it was understated, but it was just bland. The chorizo skillet with sunny side egg was better than the tacos, but still rather underehelming. \n\nI also felt it was over priced. We paid $60 + tip for guacamole, 2 small tacos, a small skillet of chorizo, and a margarita. If it were above average food, I wouldn't complain, but it just was not worth that much, especially during lunch time.\n\nI'm sorry to say that other than the backyard, I would not really recommend this restaurant, and I will not be returning.", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "The garden at Gran Electrica is incredible at night. It was the perfect setting for some excellent drinks (we had the spicy margarita and the mescal mole cocktail). \n\nThe food was good but nothing too spectacular although my boyfriend thought the brisket tacos were outstanding. I preferred the fish tacos. \n\nBut really, this restaurant gets my vote for their cocktails and for the garden. Also, the waiter was sweet and gave us a free flan when he forgot to bring one of our ordered dishes. Always a nice touch!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Had a FANTASTIC time here. We rented out their private room for our post-wedding dinner. Kate manages the restaurant's private events and is such a breeze to work with. Our friends and family had a lovely time. This place will forever hold a special spot in our hearts!\n\nThank you again!\n\nNatalie Brady", "author": "Anita B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "Ok Mexican place, nothing special.. Lacking flavored here for sure.. Started with the salsa and guac, the salsa had this intense sesame flavor, not something I enjoyed.  The guac was super creamy which I also disliked but that might be personal preference.  tasted almost store bought.  The fish tacos were also lacking in flavor, the highlight of the meal was the salad for sure. Would not be back any time soon.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Went on our honeymoon, and this place was amazing. The cocktails... wow! The food was delicious, bartenders had the time to explain the drinks and food with a smile and laugh. It was a stand out of our week in NY.", "author": "Casey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great food and good drinks!  Service is friendly! Location uniquely,  great back garden! 10 min from the  Brooklyn Bridge! Going defenetly again", "author": "Sabine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Excellent cocktails and we had amazing lamb entree. The space is a bit cramped which is the only downside.", "author": "Campbell C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "I gave 2 stars only because of the nice wait staff and cute outdoor setting. Otherwise, it was AWFUL. The guacamole tasted like it was out of a jar, the salsa tasted like cold tomato sauce, and the chips had no flavor. The ground beef tacos were dry and tasteless and everything else was just bland as well. VERY disappointed, will not be coming back!", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Judging from other reviews I was expecting delicious food in a unique restaurant. I must say I was highly disappointed. The only appealing aspect of this place is its proximity to the water. \n\nAmbience - on a hot and humid day the only cool areas were up front and in the bathrooms. The outdoor patio seating is beautiful but the door is kept open, thus bringing in the hot air, not to mention bugs flying around. Sitting towards the back by the door was not ideal. \n\nFood - The menu is very limited. We ordered the chicken tacos and the chicken was so chewy! Very disappointing. The drink selection wasn't much better. The only decent item was the guacamole!\n\nThank god I had great company to laugh at the experience with.", "author": "Blake G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "Okay, so I'm having trouble assessing my experience. Let me explain and maybe you can help me out. \n\nI want it give it 4-stars for the excellent margaritas. The rim is sprinkled with salt and sugar. I loved that touch - solid cocktail.\n\nI want to maintain or even add a fraction of a star for the ambiance and decor. \n\nAND THEN, I want to viciously subtract all the stars for miserable bar tending service that we dealt with for almost the entire time. \n\nBUT THEN, I want to add a bunch of stars because this brilliant Mexican bartender swooped in and changed the game. He was working on HIS OWN holiday, Cinco de Mayo!\n\nBasically, if you're at the bar,  the bartenders completely neglect you because drink orders from the seated tables keep spitting out of the machine. Not a single person acknowledged our presence for 25 minutes. We were VERY lucky to get three free seats at the bar. A lone woman sat next to me, she was waiting to ask for a menu but couldn't get a word in. Until, I got seriously frustrated and we ended up having to shout for someone's attention, and I said, \"Could you please get her a food menu, too?!\" \n\nWe were there for three hours and got two rounds of margaritas. It was uncomfortable watching hopefuls come up to order just one beer thinking they could get in at the end of the bar. No one cares about you here, dear sir or madam. I heard lots of complaints all around. They should have expected the rush for cinco de mayo, come on. Anyway, when Acé came (not sure how to spell his name) the unthinkable happened. He asked if I needed to be helped AND he made drinks at lightning speed!\n\nWe thanked him for working on his holiday and promised to come back, so I will! In the meantime, I'm giving this a three. \n\nP.S. I really liked the crowd here. It seemed like everyone around was super friendly. I sparked so many conversations with strangers. Someone said Anne Hathaway was here, but we didn't catch her. Womp!!", "author": "Priti K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "This place is a wonderful spot in Dumbo! The ambiance is great and the food is excellent. We've been here twice now and I have to start with what is usually the last part of the meal, dessert. The churros are a must have. They are sweet, crunchy on the outside and soft on the inside covered with a delicious chocolate sauce. \n\nFor the starters, I am not a huge fan of the guacamole. I like it with the pepitas (toasted pumpkin seeds) but it seems to always lack salt and have a little too much lime. I tend to like my guacamole spicier. They did have a really good special the other day, a spinach and cheese gordita which was really really good! \n\nI've tried a few different mains, the chorizo con papas quesadilla is a must have. It is cheesy, the chorizo is very tasty and the green sauce they serve with it is really good. The Suadero tacos (brisket) are excellent, they only give you 2 per serving and you'll want to order 2 more they are so good. The chicken tacos were also really good but the quesadilla and suadero tacos stole the show for entrees. As a side I highly, highly recommend the crispy sweet potatoes. They are served with a chipotle mayo dipping sauce and I would definitely go back for those. \n\nBuen Provecho!", "author": "Lily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "The best food in this area, which mostly caters to tourist. Those who complain about portion sizes are just expecting americanized portions. Keep in mind tacos are mexican street food y'all. One of the more authentic Mexican places in the area. Ambiance was great, service was great, food was delicious. The ceviche and fish tacos are a must!", "author": "Estefany S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-15", "description": "One star is too generous. This place was awful. The food was terrible, the guacamole, salsa and ruce tasted like they came from a can/box!  The sangria was a sad version of watered down arbor mist, but the absolutely worse part was the waiter's superior and snobbish attitude, he seem upset to be asked to serve. I wish I could have my time, my calories and most definitely my $ back. Never again!", "author": "Carolina R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}