{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Went here last night with a friend and was so happy we chose to try it! We sat in the garden/patio area in the back and, although it was a little tight, everything else made up for it. The food was great, drinks were fantastic, service was good (despite being packed), and the decor throughout the whole restaurant was so different. Awesome meal. This also would be a great date spot!", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Went to Dumbo to explore the area and stumbled upon this place for an early dinner. The back patio is great. The service was prompt, drinks were amazing, and the food was great too. I recommend the asparagus kale quesadilla!", "author": "Emilie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Cute space. Tacos were very yummy!! The meat was so juicy and tender. I also appreciate that many ingredients are organic or sustainable. But the price for 2 tiny tacos is outrageous. Also I was not so impressed with my specialty margarita.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Great place!! Good food and awesome margaritas. The fish tacos and guacamole w/ chips are to die for...\n\nI highly recommend every margarita on the menu. \n\nMy favorite spot in DUMBO.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Very good food, great service, fantastic environment, and interesting variety of margaritas. Highly suggested if you are in the Dumbo area.", "author": "Garrett B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "Decent is the word that comes to mind about this particular spot. Beer was cold and the patio out back is perfect. Went here on my birthday last month and nothing about the food was memorable besides the guacamole. Took the waitwrs recommendation on main course and disappointed to say the least. Salsa was boring and bland as we're the entrees. Good spot for a drink out back on the patio but most likely will not dine here again", "author": "Blake R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-18", "description": "I love the space very cute, great decor and awesome patio, but 8 bucks for dos tacos...no bueno.\n\nThe Lengua : Tongue, onion, cilantro, radish were very supple and had good flavor.\n\nThey are the same size as what you would get at any taco truck or place in Queens, but three times as much.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "I don't like this place at all. A lot of dishes are out of order but I was not told when I was waiting for the table. So basically I waited for 45 min and didn't get what I want to order. Will not go there again.", "author": "Mengxi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Really great vibe, service, and delicious ceviche and margaritas. Desserts are also great. Three stars because the rest of the food is fine. Come for the atmosphere and drinks", "author": "Laura L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Nice little place for a couple of drinks with a small group of friends. This is next door to Grimaldi's, and probably the closest bar we could find. The bartenders are quite adept with the cocktails they concoct, definitely worth the $12-14 price. Decent choice of beers and a friendly ambience.", "author": "Sid W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Decent Mexican cuisine using locally sourced ingredients. Great bar with extensive Tequila menu. Open air dining in the back yard is cool for family get togethers or dinner with friends. Clean, friendly and the food is always good. Fish taco is not to be missed!!", "author": "Simon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "I think this is one of the best restaurants in Dumbo. The food and service are both consistently good. In the summer, they have a beautiful garden, the perfect place to enjoy a premium margarita or michelada.\n\nWe had dinner at Gran Electrica on Saturday night. There were 2 of us and we didn't have a reservation. The friendly host quoted us 30 minutes, which seemed reasonable. We proceeded to the bar to have a drink and enjoy the convivial atmosphere. This place has the \"best looking\" crowd in Dumbo (but also a nice mixture of mature couples and young families). A minute later, the hostess came over and told us that we could sit at one of the two \"bar tables\" which was fine by us.\n\nWe ordered the whole fish, bean tortas, mixed salad, and ceviche, all of which was extremely flavorful and satisfying. Don't miss the whole fish, I think it's the best thing on the menu.\n\nThere are 3 reasons I didn't give this 5 stars:\n\n1. I love micheladas but don't particularly enjoy the addition of Clamato. It tastes like I low-grade tomato juice, which I'm not a fan of. The best micheladads in town can be found at Tacombi, Barrio Chino and Pulqueria.\n\n2. The guacamole portion size is offensive at $11 per order. We've made the mistake of ordering on past occasions but never again, which is a shame because I love chips and guac. I wouldn't mind paying $11 if the portion size consisted of more than 3/4 of an avocado (1 avocado = $2.49 at Peas \u0026 Pickles). I know the Mexican Drug Lords have a strangle hold on avocado importation but come on.\n\n3. We watched in dismay as our first course was served to the table next to us (the only other table in the bar). Clearly the couple hadn't ordered the ceviche, but proceeded to eat it anyway. Each bite was excruciating. A moment later the server came over and removed it from their table, which provided me with some satisfaction. In retrospect, I came to terms with the fact that the server should have just let them enjoy it on the house. \n\nShortly after correcting the runners mistake, the server came over and offered an apology, which we casually accepted. \n\nWe will definitely return and I would recommend this restaurant for others. Dinner for 2, with 1 drink ($11) each amounted to $80, which is fair in my book for trendy, yet quality, Mexican cuisine.", "author": "Ray Ray P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "It is such a cute little restaurant. Great atmosphere. A little overpriced for the portion of the food and guac. Drinks were deliciously prepared but also a little overpriced for the amount.", "author": "Aliaa Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "Not the best choice for brunch in brooklyn, there are many places that are more accommodating and at a better price.\nAlso, like many of the review here say, the portions are too small and not necessarily amazing.\n\nAlso, there are not options in the brunch/breakfast menu with seafood or white meat. They all have beef or chorizo and they do not offer the option to change or add food to the plates! So folks if you do not eat red meet, is a no go!", "author": "Stephany A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Got here a little too late for brunch, but had a GREAT time nonetheless.\n\nWe were immediately seated outside in the garden, which was a quaint and homely atmosphere with a small bar situated near the stairs. Our waiter was extremely friendly and recommended things that fit our tastes/desires.\n\nWe started with the Bloody Maria and the Picante Margarita. The Maria was a decent take on the bloody mary, but I think it could have been a bit fuller/spicier. The Picante Margarita was AMAZING and a perfect level of spice/flavor.\n\nThe two of us split the mushroom quesadilla, which appeared to be lightly fried and made with quesillo cheese (hadn't had it before, but it's like a thicker version of mozzarella, tastes like string cheese) and came with a green sauce/salsa. This was good, but not as good as the presentation, which was excellent- wanted a more flavorful salsa and/or seasoning on the mushrooms.\n\nFor my main dish, I got the Cemita, which was pretty awesome. Before digging in, I tried each individual ingredient, which I'd say were good to great, but together it all worked out in perfect harmony. I tried a bite of the Rajas tacos as well, which were good, although the tortillas were more grainy/hard than the soft ones I have had in Texas, that I still wish were present in NY tacos.\n\nOverall, the presentation was A+++++, the ingredients/food were fresh and in combination were excellent, the drinks (especially the Picante Margarita) were great, the prices were reasonable, and the service was super friendly. Would come back here again, no doubt.", "author": "Vinay P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "Understaffed. Slow drink service. The best part of this restaurant is the vibe. Good for a casual dinner or getting together with a small group of friends. My biggest complaint is that I waited a long time for a table only to find out there were many open tables. By the time I was seated there wasn't enough time to order and eat before the restaurant closed. This restaurant is mismanaged and needs to hire more waitstaff. Some of the staff was also surprisely unfriendly.", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Great drinks! Really crowded but nice helpful staff. Becomes a bit noisy but overall a nice place", "author": "Niclas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Get your Margarita here! Our party of four sat at the lounge table by the bar. The Ai Papi margarita is my favorite so far. Smokey Mezcal pinapple and jalepeno. Not overly spicy. A traditional Margarita makes the cut as well at this Urban Mexican spot. The Steak tacos on special were flavorfully saucy with a little heat. Wish we had ordered more of these as the Chorizo Quesadilla left a lot to be desired. Dry and boring. The guacamole was a hit however.  Will definitely try this place again as the service was attentive inspite of how busy the bar was and they kept our waters filled (necessary with spicy foods and drinks)", "author": "Asonya R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "Hmmm. \n\nThis place has a very nice ambiance and the service was just fine...but the food was really just OK. We got the recommended guac, fish tacos, and both the chorizo \u0026 mushroom quesadillas (better than the chorizo) and all of them solidly meh in flavor. I think my favorite item was the beet margarita. So yea. Umm...go for drinks?", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Came here recently and realized I have not been reviewing. I came, I ate and it was stellar! Loved the ambiance and flavor of the food. Drinks were flavorful and delicious!!", "author": "Tim T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}