{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "The drinks are awesome, super friendly bartender. The food (the oyster quesadilla) was amazing. I came here for a company party and it was a great space. Pretty intimate.", "author": "Celine I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Not a bad place to eat.  We did the guac and salsa which both were very good.  There was a huge portion of guac.  We could have used more chips however I think we would have been charged for the.  The entrees were small, however the sides are more than ample.  I got the Tinga de Pollo. I got the plaintains which were very good.  .  My bf had the Ay Papi which was so smokey tasting it was nearly undrinkable. I had the Margarita Electrica which was just ok.  I thought the service was very good though.  This place is very loud and not good for conversation.", "author": "Todd R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-29", "description": "This place has improved. But. \nI go to the bathroom - there is a line. I wait.  Our waiter exits the bathroom. I enter. \nI use the bathroom.\nI try to wash my hands. No soap. \nI leave the bathroom. I tell our waiter- \"no soap in the bathroom\". He says, \"thanks for telling me\". \nSo, yuck.", "author": "Britt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-08", "description": "While this place has a charming back yard, I was underwhelmed by the food. I would still come here if I'm in the area, but I wasn't blown away. Fish tacos and guac are a solid choice.", "author": "Olga T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Love having Gran in the neighborhood. Its' comfortable, familial and always has innovative and authentic mexican food gracing the ever-changing menu. Tip - Order the 1/2 of Guacamole! Save room for a churro.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "We ate here on a weekday. Very noisy. Slow service. Food not up to the mark. Not a great value for money.", "author": "Chinmay N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "Wonderful atmosphere with great outdoor seating and a live DJ playing ambient music. The wait staff was very attentive, friendly, and knew the menu. The food was absolutely delicious however the portion size was very small. Had I known about the sizes prior to ordering I definitely would have gotten a side or appetizer. Also, the person next to keep ordered the same dish as me and it turned about to be s8gnificantly larger than mine. The discrepiseny was large enough to mention it, nearly twice as large as mine. I would definitely come back but with the mindset of ordering more food.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "Hipster Mexican in DUMBO.\nNow, the long version. We got the salsa, guac, and chips appetizer, which was about the same size as the usual Mexican restaurant's (free) chips and salsa. The quality of the chips, salsa, and guac was excellent, but there was no spiciness at all in either the salsa or the guac and I feel like what we got wasn't worth over $10. For entrees, we got the vegetarian tacos and the ground beef tacos, both of which were quite tasty but small (tapas / appetizer sized \u0026 priced). They had a lengua taco on the menu as well, which is cool (though not my thing). We also got a side of the black beans, which came topped with avocado and queso, and was also quite tasty.\nService was unfortunately slow. We would have ordered dessert, but it took them 10 minutes after we finished eating for them to clear the table and ask us about dessert. By that time, our show time at St. Ann's Warehouse was too close and we had to pay and leave.\nAlso, the music was turned up way too loud, We kept having to lean in across the table to hear each other! Please, please, please turn down the music, at least in the dining area!", "author": "Jon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Nice vibe. Authentic Mexican cuisine with twist.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Personal geography is popular. Places bear the imprint of our lives and this is why savoring food is often perceived as an empty hobby. We laugh at foodies. The community of friendship the once prevalent rules of aristocracy and human order make meals about more than flavor. \n\nMy friend and I sit in the communal area, the garden large and communal exposed to the breeze and a couple other people dining. One a woman with a man of frightening strength like a balloon of discrete blown up muscles. Light wood and a breezy hipster Hepburn girl serving and recommending fish tacos. Earlier I cloistered myself in the Vermeer window an inside seat with a sill. From the inside skeleton themed wallpaper I watched the waiters and gamines and diners. Vermeer's 'Insecure Bedraggled Woman Eating Tacos.'\n\nSopes\n\nFriendship makes it hard for me to concentrate on the small pinwheels of sopes they bring out to my friend and I , greasy but tender beef with a tang of pickled onion and sauce that my friend enjoys and I find too greasy. The corn tortilla like patty underneath is tender porous and worth trying. Cute and small, they are complete in flavor but don't stand alone. We talk family and career. \n\nAguachile\n\nI force my friend to share another plate that a cute top knotted waiter recommended to me earlier when I spoke to an ebullient older couple, a woman journalist of a torrid divorce and fabulous life, wildly sitting barefoot on the bench with her dress falling off her shoulder like Sonia Braga, telling me stories of Barnard and serial monogamy and one expensive condominium scandal I googled. The man next to her two rungs (or leagues) below and I couldn't see the appeal at first, until he spoke with voluble neurosis and compassion and I could see this was a man of endless interest and complexity. Woody Allens persona is a man of interest so. Eating alone focuses the celebration on the food because all else is colorless and the hunger bleeds into conversation and one off connections. The desire to consume and numb and make momentous. I bring stories of this couple to the waiter as bait and with hints of after hours deep set intensity of eyes he recommends the aguachile and closes his body away. \n\nAguachile is a long somewhat inelegant plate of raw scallops in a tangy green sauce. It has a similarly pleasant shocking but less memorable flavor. My friend enjoys and has never had raw scallops before. \n\nShe gets a call. My friend feels stress and our meal numbs and dissipates. I rifle through my Rolodex of ways to clown for a friend. We share a tangy tamarind margarita and my friend smiles and asks me about me. \n\nTacos\n\nThey bring us our small plates of three tacos, a fresh battered fish enlivened by a chipotle mayo like sauce and greasy tender pork which is heavy despite being small. My friend valiantly tries all. We like but are not blown away. Our minds are far off. My friend is told that all is well and we pick ourselves up. She is able to remember the taste and I pale again.\n\nMeals and food pale against the backdrop of community and human relationships. The dinner table plays out what unites us. We are torn apart and hastily reassembled over sopes.", "author": "Dian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Awesome!\nThe margaritas are reason enough to put this place on your list! Inventive and flavorful!!\nSmall plates make this a great place to go with a small group so you can share!! Home made tortilla chips and guacamole were awesome as we're the varieties of tacos!! Will be back for sure!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "Good food, I'd have to agree with other reviewers that the prices are a little steep for the portions you get - fish tacos were $11, you get two small tacos and no sides or accompaniments. Garden area is absolutely beautiful, definitely a preferred dining spot.  Guacamole was spot on, though I will venture to say also a small portion for what you pay for, not to mention I'm spoiled by table-side guac prep at other locations, so I was bummed we didn't get that here, just a small bowl. Had 2 of the Habenero Margaritas, delicious yes, but at $13 a piece, you're rivaling prices in Manhattan.", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "Gran Electrica really should consider changing it's name. And, if they were to ask me, I'd suggest Gran Margarita! You see, the margaritas really are the reason to come here. Sure, the guacamole is good and the serving is generous, the chips are crunchy and thick (if you like them that way, perfection) and the service is pretty damn good. The fish tacos and quesadillas are a-ok. The backyard is one of the best around, and the crowd is energetic and fun. But all that pales in comparison to the margaritas. Inventive. Strong. Delicious. Gran Margarita for sure.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Last night we had an amazing dinner with friends after the fireworks. Dinner \"al fresco\" In the outside patio. The guacamole was delicious, thick and creamy. We tried the sopes with carne adobada and they were to die for. Will definitely go back when in DUMBO.", "author": "Camille O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "I hosted my sister's baby shower at Gran Electrica last weekend-- and it was absolutely LOVELY.  I cannot say enough positive things about working with Liz Boothroyd and co. The space was perfect (25 guests), the food was DELISH, and our waiter, Christian, was fantastic. I could hear guests saying as they left: \"I  am going to host a party here!\"\n\nI've also been here several times just for the spicy margs and guac! \n\nHighly recommend!", "author": "Missy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-28", "description": "This is just another overpriced, small portion, unauthentic Mexican restaurant trying to pawn themselves off as Mexican food. The guacamole and salsa is terrible and it didn't taste fresh at all. What Mexican restaurant manages to screw up Guacamole and Salas! Save your money and go anywhere else. The staff was unimpressive and it can't imagine this place will last more than a year. Hopefully when they close a better restaurant will take over the lease....", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "I love the chilli rimmed, spicy margeritas at Gran Electrica! Paired up with fresh guac and sopes at the bar and its a great night! \n\nI also love their brunch. It so nice to spend a Saturday by the Brooklyn Bridge eating delicious Mexican food.", "author": "Dipa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-09", "description": "Cocktail (tequila, grapefruit etc) was delicious, and food was OK. \n\nPortions were too small and a little underwhelming despite the interesting descriptions. The scallops were delicious, but too many of the other dishes lacked..something. Fat? Sauce? Just something?\n\nHusband and I are big Colonie fans, so we'll be back to see if Gran Electrica irons out some of the kinks.", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "Pros: Lovely garden seating area in the back.  Waitstaff was attentive the night we were there.  Pretty good guacamole.  Four mini-bowls of salsas ranging in spiciness were fun.  \n\nCons: Just too expensive for the small plates you get.  The prices looked reasonable on paper,  but the small serving sizes changed my mind.  Probably the proximity to the Brooklyn Bridge accounts for the price.  Couldn't help but think about the amazing carnitas tacos I've gotten from street vendors for half the price... no, they weren't made with locally sourced pork like those at Gran Electrica, but damn were they good compared to what I got here.", "author": "Heidi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Roasted tomato salsa was amazing. The atmosphere was great, service was great. However, PRO TIP, always make a reservation to be seated in the garden patio.", "author": "Noriel M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}