{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Looking for a chic Mexican restaurant? Look no further than Gran Electrica in DUMBO. The nice decor is accompanied by very friendly and upbeat service. The dishes are skillfully executed- quality is emphasized over quantity here. The ceviche is delicious. Moreover, the pescado estilo ensenada (battered cod, chipotle mayo, and pickled red cabbage) must be the best fish taco I've ever had! The fish was perfectly battered (not oily or greasy), and the taco itself is flavorful and perfectly balanced. \n\nWith such superlatives, why not 5 stars? On the day, the wait between ordering and getting our food was quite long (our server kindly apologized for this).", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Gran Electrica is an amazing place after a walk over the Brooklyn Bridge. It's one of the nicest walks I've ever taken getting there. We took the downtown 4 train from Grand Central and got off and Fulton St. From there we had an amazing walk  through lower Manhattan and over the Bridge. After getting off the bridge it was a short walk to Gran Electrica. We got a seat after a short wait on their patio that has absolutely beautiful views of the bridge. We were quickly served drinks and ordered a few tacos that were really good. We went around sunset and the sky view from the patio is second to none. It was really one of the best experiences I've had in New York!", "author": "Michael J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "I really liked the ambience. It was very nice inside and they also had an outside garden, which was too overcrowded to enjoy. Their pastor tacos where amazing and very meaty. Unfortunately, that's the only good I can say about Gran Electrica. Our waiter was rude. She didn't pay much attention to us and when we asked her suggestions, she gave us a bland answer. We waited over 20 minutes for our drinks and another 20 just to get our order taken. It was also extremely over priced while just falling short. Another overhyped restaurant in brooklyn.", "author": "Shantal W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Food: got the guacamole, ceviche, beef taco and carnitas taco.  Everything was delicious, and tacos were especially juicy, flavorful and the shells were the just the right amount of crispy.  Also enjoyed the Syrah-Grenache -- funky wine with a lot of personality.  Overall, this was one of the better Mexican meals I've had in NYC\n\nService: waitresses and hostess were sweet and prompt and very eager to accommodate our questions, seating requests, etc\n\nAmbience: got on the patio on probably one of the last days the weather will be tolerable for an outdoor meal.  It was a casual-romantic vibe, with the underbelly of the BK bridge overhead (without the noise!), strings of lighting, and an ivy wall, all contributing to an urban secret garden vibe.  Excellent spot for any date, but especially a first date.  The Fela Kuti remixes made for a cool mood\n\nAnd as an aside -- we thought it was a great idea to donate % of profits to Black Lives Matter and enjoyed our drinks all the more so!", "author": "Gabi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "This is a quaint little Mexican restaurant / bar. Came in from the sweltering heat for an ice cold margarita. Wonderful ambiance. This place did not disappoint.", "author": "D H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "Really wanted to like this place. This set the tone of the evening. I don't feel there is a place for your political or social views on a menu.", "author": "Brad P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Came here yesterday to celebrate my friends birthday. Service was very good and the food was good. What I really did like is the out door patio to eat.", "author": "Joseph O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I went here last night right before talking a walk across the Brooklyn bridge with my boyfriend. I'm glad that I wasn't really hungry, but my boyfriend as usual was starving. \n\nThe food was good but beware, the portions are very, very small. We ordered chips with salsa \u0026 guacamole. Both were very tasty and they do offer more chips if you finish the ones you had. The salsa had corn in it, it was a bit spicy and seemed to be the type that is a cooked salsa.  The guacamole was very tasty I believe it was garnished with toasted pumpkin seeds.\n\nI ordered a crab tostada and the waitress warned me that it was very petite. My bf ordered a chorizo quesadilla. Food was brought out right away but when I saw how small the portions were I knew we would be ordering something else.  My tostada was good. Fresh, flavorful with a kick. My bf said his quesadilla was good but he was still hungry.  We had to order two chicken tacos and those were tiny as well. We wound up getting two more. My bf loved their salsa verde and kept saying how delicious the food was, hence my four stars.\n\nService was very good. The waitress was friendly, knowledgeable and attentive.  The place is a little loud with music playing and seating is a bit cramped for my taste.\n\nWould I go back? Probably not. I like to eat when I'm hungry and this place felt like a tapas restaurant. I'm glad I wasn't hungry cause we would have had to spend way more than we did.  I'm sure there are better places to eat close by.", "author": "Kat R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I read the Reviews and it looked like a lot of people were saying the food was so-so, but I stuck to the cocktails and loved it! Snagged 2 seats next to da h other at the bar and enjoyed the ambiance while we sipped our drinks. A little on the pricey side but worth it", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Pricey but they use quality ingredients. Service wasn't the greatest, we had to ask for some items quite often and the girl looked a bit annoyed. I wish I got the guys name he was the one we kept asking because he was on it! The platanos maduros are delicious! I would probably just go get some of those if I lived nearby.", "author": "Jacqueline F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "My original plan was to go to the city for Mexican food but traffic was not my friend. Stopped off to go brooklyn bridge park area instead and to my surprise first place after parking my car was Gran Electrica . Only waited about 2 mins for a table (outside was a 45 min wait ) . Waiter was great and food taste amazing , ordered the fish tacos and beef tacos . Would suggest trying the chips and salsa.", "author": "Earl J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Cool spot. Good happy hour. Easy to linger. Great salsa and guacamole. Solid food overall. Optional outdoor seating. Good stuff!", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Excellent service. Fun place for dinner with large groups. Food is amazing. Mexican cuisine you can share. Enjoy! Great addition to the neighborhood.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Hard to find great mexican joints in nyc.. no arguments there. But Gran Electrica stands up there with the other few bests in the city.\n\nThe carnitas tacos were bomb, gauc was solid, fish tacos and stuffed peppers were great as well - will be back for their margaritas!", "author": "Sung K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-22", "description": "Had a couple of lovely tequila cocktails and shared some small plates. Fun atmosphere, and definitely my favorite Mexican joint in Brooklyn so far. Staff was friendly. Only downside was that it smelled very strongly of fish (in such a way that I would not recommend ordering any seafood dishes there).", "author": "Kiah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Love love love it here!!  The food is amazing! Everything is perfectly seasoned! Great atmosphere and the drinks are delicious! Best margaritas around! Wish I lived closer to come here everyday!", "author": "Justine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "The food was incredible and the staff were top notch. We tried the full taco lineup and each one was fantastic. The carnita tacos were my favorite. It was an all around great experience and I can't wait to go back.", "author": "Casey N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Never going back again... Not worth the cost, service, atmosphere, hot air conditioning, loud techno, or the food. If you want to eat at a over priced Mexican restaurant with loud music, so you can't even hear the people next to you talk, then go to this hole in the wall. To pay and be treated with terrible service for $22 for a tiny bowl of Al Pastor with a scoop of rice and no tortillas without being charged extra for what turned out to be 3 tiny corn tortillas, is ridiculous and insulting to any customer. This place won't last and is just taking advantage of a high trafficked tourist location to charge extra. It's a night club turned into a small overpriced, overrated Mexican restaurant, with what should be called tapas. This is not a good New York locals place to recommend to out of towners. They will leave only feel taken advantaged of and disappointed ultimately leaving New York with a bad sense for how wonderful the food is here in the city. Utterly disappointing.", "author": "Jesse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "We went here for cinco de mayo.  If possible, try to sit outside.  Their outdoor seating area is really nice.  There food is also very good.  Only thing is that the taco's are pretty small for the price.  That being said, everything we ordered was excellent.\n\nDrinks were also very good.\n\nDefinitely would recommend.", "author": "Jake B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-14", "description": "Likes\n- Lovely outdoor seating and bar\n- DJ playing soft beats on Sunday evenings\n- Good service\n- Tasty food, and yummy drinks\n\nDislikes\n- Very small portions\n- Expensive dishes given the amount of food\n- Pricey cocktail for volume\n\nI guess one would expect to pay $11 for a small amount of guac and ~$10 for two mini tacos or two wedges for a quesadilla in DUMBO, but I prefer to get a little more bang for my buck on the food side.", "author": "Jen D."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}