{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "What a beautiful space! Loved the ambiance. \n\nI had two drinks \u0026 loved both. I tried the grapefruit margarita \u0026 it had a spicy rim, loveddddd. I also tried the cucumber margarita \u0026 would def order again, so refreshing! \n\nI chose the chorizo quesadilla as my entree \u0026 enjoyed it. It had a crispy shell \u0026 the marriage of all of the flavors was perfect. Def recommend!\n\nI will absolutely be back!", "author": "Natalie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "This is a beautiful backyard restaurant.\n\nThe salsa is unique.  It is almost like a vodka sauce.  That was different and unexpected, but it was decent.  The guacamole was good.  \n\nThe ceviche was really good.  Much better than I expected.\n\nThe brisket tacos were small. They were tasty.  Jackson Heights has spoiled me and while they were great tacos, the price point left me homesick.\n\nOur group of five had quite a long wait before sitting and had to steal a fifth seat from the table next to us.\n\nMembers of our group raved over the pork shoulder special and the pork shoulder meatballs.  The chicken taco was good as well.", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "I came here on Mother's Day, a beautiful Sunday. The weather was fantastic so we opted to sit outside. The outdoor area is super laid back. I love it. \n\nWe ordered guac \u0026 chips as a starter, which was very good. I had a cucumber mixed drink (can't remember the name) and it was VERY watered down. I downed that one and ordered another round hoping it'd be better, and still very watered down. We ordered a mix of taco \u0026 quesadilla dishes that ranged from $12-15 per plate. Once those tiny tacos arrived, my jaw dropped. They were the teeniest tacos I have ever encountered. I don't mind paying $15 for a taco dish, so long as it tastes good \u0026 fills me up, but these did neither. The only dish that was OK was the shrimp appetizer which was served on a crispy cracker of some sort and that was the most expensive dish at our table.\n\nWe did dine during their lunch hours, but if these are the prices for baby dishes then I can't even imagine the prices for dinner entrees.", "author": "Shirley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "its actually pretty large, but the lines and waits will make you think otherwise. the whole place is lit with candles, and while the inside is charming, the back patio is their hidden gem. the ground beef taco and house margarita are well done classics here", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "This place truly is the best. They made our wedding day truly special and always felt we were taken care of. Thank you Gran Electrica!", "author": "Kevin V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Beef Tacos: These tacos were super dry and bare - absolutely nothing on it. These tacos had to be mini-tacos, because they were so tiny.  \n\nDrinks: Not sure what was going on with the bar but the drinks were horrible. My date had to order two drinks, both tasted disgusting - i ended drinking them so it didn't go to waste. \n\nOther: Took extremely long to bring out condiments. We weren't aware that when the waiter asked if we would like a basket of nachos before our food comes out, that it would cost us $18 ($11 for just the guacamole and $7 for just the salsa). Btw both the guac and salsa were nasty.\n\nI'm not one to leave a bad review but this place earned it. If i wasn't on a date, I would have contested the bill. Would never recommend this place to anyone.", "author": "Mac E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-11", "description": "I heard great things about this place....BUT when I\nfinally stopped in to try it, I was pretty disappointed.\n\nI had the guacamole, pork, chicken taco and the almond cake. ( I don't remember the \"menu\" titles) \n\nThe guacamole was decent. Nothing spectacular. \n\nOne thing I have realized... once you start adding  \"additions\" to a basic dish you're covering something up! A taco is a taco... meat and a few garnishments to enhance the flavor but the meat should be able to stand on its own. The meat here  can't stand on its own! \n\nThe pork in the pork taco was dry, flavorless and tasted old.  I needed salsa verde and hot sauce to continue to eat it.  As for the chicken, it was moist more flavor than the pork but the sour cream overpowered the dish. \n\nThe almond cake was great, they smothered it in a chocolate whip cream and diced apple sauce, neither enhanced the presentation or taste of the cake. The toppings actually turned me off (presentation wise). It was very sloppy! But a good cake! \n\nOverall, they only way I would come back is if I'm\nIn the neighborhood and wanted drinks and dessert.", "author": "Shea G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "I have been here twice. The first time I had dinner was a 4 star experience. When I came back, I was really hoping for a 5 star wowzer show! \n\nThe menu was tiny. Not physically, but in options. I live all foods, so I love this because I just want whatever they cook best. However, I didn't see anything that sounded interesting!! So we orders some \"stuff\" and got some stuff, but nothing was memorable. Some good tastes here and there but an unsatisfying menu killed it. \n\nDefinite room for improvement on the menu. I appreciate the low prices, but please add some quality protein options - instead of just well priced corn products. Hard to have \"dinner\" at a place that has one fish and one meat option for mains, while everything else is a bar snack. And, being out of one of those 2 dishes is completely unacceptable with no other options. \n\nService was 4 stars and atmosphere and drinks were 5 stars.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Five stars for one of the BEST fish tacos that I've ever had and an awesome outdoor space in the back that is decorated very nicely (I wish I had a pic of it but go see for yourself).\n\nI'll definitely be back when in BK", "author": "Joseph F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "If you like beautiful backyards, a spectacular range of mezcals, and Mexican food, you'll love Gran Electrica. Unfortunately, we only experienced the first two since it was an after-dinner stop, but we did have some chips and guac, which were good. Came here on a Friday night, and the backyard was pretty full around 9:30. The host told us we could stand off to the side where there was a standing bar and order drinks until a table opened up. Luckily, that only took a few minutes, and we were able to get seated right in the middle (there were about 8 of us). Service was quick, and our waiter was really passionate about mezcal. Also, they have the coolest painted hand dryer in the bathroom!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "Came here for a bite after going looking at the sunset at Brooklyn Bridge all evening. The place was super loud with music playing and a lot of people talking. We had to wait about 30 mins and didn't get to eat till 9:30pm. The ambiance is nice but it was so dim I had trouble reading the menu! We ordered some food and it was quite nice, tapas style in general but we were full. The food was pretty tasty but it wasn't anything particularly spectacular.", "author": "Queenie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Been going here for years and gotta tell you: they hire the best people, but the food and drinks are awesome too!  Great location right next to two great pizza places and the River Cafe under the Brooklyn Bridge, #dumbo area. Enjoy!  Oh, look up Pedro's too!", "author": "James O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "It was just alright. Had its good points and its bad ones. The drinks were great! So I would recommend it for that. The tacos I had were less than to be desired. I got the chicken tinga and boy was my meat tough. Which is the worst when you are eating a taco and they can be kinda messy and you're struggling with biting through it. My beans were delicious. I loved the seasoning choices. And our desserts were really awesome too. Flavorful and perfect way to end a meal. We got the flan and the Mexican chocolate pudding, both would highly recommend. \n\nSo top marks for drinks and dessert. So if you need a bookend to your dinner elsewhere I would recommend this place. As for Mexican dinner fare, there are many other places I would choose instead.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "Good cocktails but mediocre food, small portions, and inconsistent service. Irritating policy of refusing to make any accommodations to food. Want chicken on your salad? Out of luck. Have a vegan friend who would like a dish without cheese. No dice. You are not a five star michelin restaurant -- you are serving simple Mexican food. Get over yourself.", "author": "Quay X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "+1 Great drinks\n+1 Yummy food\n+1 Amazing (and large) outdoor space\n+1 Ideal for date night or a girls' afternoon\n\n-1... Portions are on the small size for the price you pay, unfortunately. (Not terribly shocking for DUMBO, though)", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "SUCH a cute place for brunch! Came here after walking the Brooklyn bridge and I will definitely be back. No wait, beautiful outdoor seating area. Potions were a little small but still very good and affordable! Plus service was amazing.", "author": "Cherrilyn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "Ambience is cool on the outdoor patio. Food is just OK and decently priced.\n\nIf you're looking for a cool patio brunch spot, this is worth a visit. We went on a sunny Sunday afternoon for a quick bite. The vibes are really cool outside on the patio, but the food I'd say was just okay. I ordered some kind of fried pork sandwich with a fried egg on top for $12. It was good, but I'm not raving about it. Also ordered chips and guac for starters cause I read on Yelp the place had great guac... eh. Not worth $9 for it. \n\nOverall, if someone asked for a brunch recommendation in the area, it wouldn't be my #1 pick for food, but a great pick for the outdoor patio vibes.", "author": "Jacqueline V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "We spent 5 days in NYC and had the most delicious meals until we got to this restaurant! The host was gracious and kind, but the waitress was the worst one we had during our stay in NYC. She was rigid, unfriendly and not very accommodating. We were not allowed to substitute anything on the menu, and we were not able to order from the dinner menu, even though it was given to us by our waitress. The food was ok, but not cooked the way we had requested it. Our meal was less than a mediocre one. For all the fabulous choice of restaurants available in the city, I would certainly not waste my time with this restaurant... not surprised it was empty during the lunch hour! The food upset my stomach and I've not felt well since then. Drove straight to Blue Bottle for a decent cup of coffee!", "author": "Ana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "Worst Mexican taco place ever. Service wasn't great and food was terrible.portions were small and took forever to get our drinks and menus.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "I had the Al Pastor plate, pork ribs with rice. Not bad so many peppers it was too hot for me to enjoy. Their 1/4 of drink menu was pretty good. I like the classic margarita right on point. They also have veggie option on the menu for our non meat eaters and they taste great. Chip and salsa needs some help. Salsa just a smooth puree of smoked chipotle. Service was good. My biggest disappointment they didn't have my drink. Although they had a full bar they was unable to make my drink.", "author": "Danny P."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}