{"aggregateRating": {"reviewCount": 447, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "Nice interior.\n\nI would have liked to stay at their outdoor area but it was not offered to us even if it was not full because we got there early on a Friday night.\nThe wait staff was quite friendly except for our waiter who was pretty gruff. Must have been having a bad day but........don't take it to work with you!\n\nThe tequila drinks were very good. You can tell they use good quality tequila, not the usual brown stuff served in most bars.\n\nNow to the food:\n\nGuacamole - 4 although we have had much better in smaller Mexican restaurants. This is creamy and tasty but it was like toned down a bit, less tangy than we would have liked.\n\nPescado - 4 the fish was fresh and was cooked really well. \n\nChilaquiles - 5 fresh, tangy, with just enough heat\n\nQuesadilla - 3 the cheese nice and chewy. The chorizo was tasty. However, the corn tortilla was  very tough, especially at the edges. It was difficult to chew.\n\nWould I go out of my way to cross the river again. No.", "author": "Rico R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "Fabulous margaritas!!!  Everything at Gran Electrica is done right.  Great atmosphere and food.  Excellent service.  Guacamole and homemade thick tostadas are simply perfect.  Patio should be opening soon this summer ;)  Ahhhhh", "author": "Bianca R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-01", "description": "Dumbo needs new, great restaurants in the area and this is does not fit the bill! To start, we tried over half the menu including the beef check tacos, mushroom quesadilla, gorditas and a few other forgettable dishes. They were all TINY portions better suited for a kids menu and exceedingly tasteless. After eating the main dishes, I realized that tasteless was as good as we were gonna get. The pozole was a thin soup with a strong chemical taste. It was served with some accoutrements that neither we or the guy sitting next to us thought made any sense to be served with soup.The mole was a piece of unflavored, boiled, Third World chicken on top of green slime.  \n\nOn a good note, the decor is cool, the magharita was tasty and fish tacos were good; however, those are not pros that are singular to the area. Superfine (a few blocks down) offers up a similar bar scene with great food (including fish tacos) at a more economical price point and a generally upbeat atmosphere. \n\nAll in all Gran Electrica is a GRAND disappointment.", "author": "Abbey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Great food at decent prices in a prime location.  Very nice patio and excellent service.  Try the grass fed beef tacos.", "author": "Jay P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Great ambience, great appetizers (get the Mexican corn appetizer, unreal), 5 star-playlist of Latin music. My only complaint is that the chicken tacos were bland, but the people I was with ordered the quesadilla and loved it.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-30", "description": "Where's the flavor?  That's what our entire table said to each other - where is the flavor in the dishes.\n\nWe ordered the Mole Verde chicken entree as an appetizer for the table - the chicken is a whole chicken leg on the bone in Mole Verde with undercooked white beans.  Interesting concept, but just lacked any real deep rich mole flavor.  The best thing about the dish was the 4 accompanying salsas.\n\nWe then all ordered tacos: tongue, beef cheek, and pork - and they all begged the same question, WHERE'S THE FLAVOR?  We had to ask for more salsa just to add a bit of something to wake our tastebuds. 2 tacos come per order, ranging in price from $7 to $10.50.... Perhaps since we had just traveled to Mexico no more than 2 weeks ago, my expectations may have been too high where you can get the most flavorful street tacos for $1 a piece.  \n\nServers were friendly, there are a few kinks to work out, but they were all very friendly.  I would go back for drinks at the bar and might give the tacos a second go if I get really hungry - just hoping for, yes, flavor.", "author": "Allyson B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-20", "description": "So disappointing. \nI'll start with the one positive- the cocktails.  They were excellent.  Unfortunately they were not a sign of things to come.  \nI'll condense the negatives for a quick read:\n\n-serious attitude problem with the staff\n-we got scoffed at for asking for chips. they \"don't do tex-mex\".\n-completely TASTELESS food\n-managed to make a fried fish taco taste like cardboard.\n-tray of \"homemade\" hot sauces we asked for in an attempt to make the food palatable all tasted exactly the same, and not one was the least bit spicy.  Like not at all. \n-Dinner for 2 where we both left hungry but didn't want to order anything else because NOTHING was good, was $95.\n\nYou could go to pretty much any other Mexican restaurant in all of the 5 boroughs  and get better food (chipotle inluded, and I hate chipotle), so skip this unless you're only drinking.", "author": "Anna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "Very, very good. Not a chips and salsa kind of plate.  Its more of a mexican small plates type -- get a bunch and share.  Everything was really well done.  Went for an early dinner and there were a lot a couples with kids there -- so go later to avoid any brats.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-28", "description": "Really wanted to like this place since its close proximity to work and along my route home... but with a sub-par happy hour menu and a selection of bland, small-portion dishes I don't know if I'll be running back anytime soon. Guac was pretty meh (and i certainly love my guacamole), as were plantains- which required seriously dipping in the various salsas to achieve adequate flavor . The size of taco dishes for around $8 was disappointing as well, although the carnitas were probably the best thing I ate.  Still for a wednesday night, the place was pretty packed, so maybe I am missing something.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "The drinks were good and the atmosphere was nice home ever, the food tasted awful and they were sold out of guacamole which is what I came there for originally! Two tiny soggy tacos for $13, ew!", "author": "Darya K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "They currently serve the top branzino in Brooklyn as far as I'm concerned. The margaritas and micheladas are top notch and the tequila selection is outstanding ! Order a round. Wait staff was delightful and attentive.", "author": "LL L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "This was my first visit to Gran Electrica, and I am sold! Run, don't walk!\n\nFor the details: I went on a Sunday afternoon for lunch, around 1 p.m., and found the restaurant mostly deserted, which was vastly preferable to the line at Grimaldi's stretching down the block. The atmosphere was relaxed and welcoming, complete with clever wallpaper mixing traditional Mexican Day of the Dead-style skeletons as and around NYC landmarks. I sat inside. My waitress was quite friendly and helpful. Service was quick and attentive but never in the way. I appreciated that a pitcher of water was left on my table so I could refill my own water glass as I wanted to; more restaurants need to do this.\n\nThe food here is gourmet street food for the most part. That being said, you will not find street food of this quality in the, well, street. The tacos are not gargantuan, though not tiny either, and come two per order. After a conference with the waitress (and myself), I ordered two taco plates: the fish tacos ($13) and the pork shoulder tacos ($7). I didn't order a cocktail, though there were many on the list that piqued my interest. The menu for lunch in small, but still varied and interesting.\n\nFood arrived in very short order, piping hot, and with a selection of four salsas. Only the sesame salsa didn't do anything for me; I would much rather have more of the other three--traditional red, tomatillo, and arbol chile salsas. The fish tacos were excellent: hake, a white fish, lightly beer battered and fried, topped with an avocado sauce, crema, and a heap of shredded cabbage atop corn tortillas. The batter was not heavy, and gave the outside of the fish just enough crunch to contrast the wonderful, soft interior. The addition of a squeeze of lime and a spoonful of salsa completed the dish perfectly. The pork shoulder tacos somehow managed to top even the perfect fish tacos. The pork was cooked exactly right--the meat inside was softy, juicy, and tender, and the outside was crispy and just salty enough. Chopped onions and cilantro finished off the flawless presentation. Seasoning was spot on throughout the meal.\n\nThere are no additional sides that come with the tacos such as the rice and beans one might find at a more typical Mexican restaurant. A small accompanying bowl of house-stewed or refried beans might have been a nice touch.\n\nIncluding tax and tip, I spent a little under $25, which I felt was reasonable for city eating. Expect to pay city prices for cocktails, most of which start around $12, but also contain many homemade ingredients--one in particular that I noticed was a habanero-infused tequila. \n\nIn response to some other reviewers: this is not a taco truck, it's a restaurant. If you want gobs of greasy food for cheap, go to a taco truck. But that's not why you go to a restaurant like Gran Electrica, and you shouldn't penalize it for not being a truck if that's what you really wanted.\n\nI am interested to return here for dinner and sample the more extensive menu.", "author": "Wesley L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "the small plates are certainly small, so you have to be a slow nibbler to appreciate it all. the service is patient, if a bit slow. sitting in the beautiful back garden, my friend and i were given plenty of time to deliberate over our choices before... halfway through our bottle of rose... finally decided on what to get.\n\nwe ended up picking three antojitos to split:\n\n1. the aguachile (scallops, herb puree, jalapeno, cucumber and red onions) which had a thin spicy green pulp serving the ceviche juice. served with a single fried tortilla piece, which seemed more decorative than edible\n\n2. pollo garnachas (shredded chicken and queso fresco, cream, and onion) on top of a fried, slightly thicker, corn tortilla. pretty good, but nothing remarkable, definitely added my fair share of salsa on top. (2 garnachas)\n\n3. fish tacos. awesome. fried but with plenty of fish to back up the crisp exterior, some cream, some pureed avocado, and fresh fresh cabbage. with a squeeze of lime juice, you didn't need to add a thing! (2 tacos)\n\non the expensive side but a nice atmosphere, both inside and outside in the garden. \n\nyou walk away with enough of an appetite and JUST enough money for a scoop of dessert at the brooklyn ice cream factory", "author": "Minette Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-01", "description": "The drinks are amazing, creative and fresh. If this was just a bar I would be sold. Unfortunately the food is just okay and when you're having tequila drinks you need good food to boot. Mexican food or fusion is hard to get right with the limited ingredients in the area. I had the fish tacos and they were uneventful. The thing about Gran Electrica and Colonie (same owners) is that the ambiance and the decor is fantastic in both locations, but the menu needs rethinking if you want to become well known for your trifecta: food, drinks and ambiance.", "author": "Ana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "Fantastico!\nA much welcome addition to the neighborhood. Last night was the second time we ate here and we have nothing but high praise to pass on....from the moment we walked in we were greeted warmly by the hosts and found a spot in the bar to have some cocktails while we waited for our table-- it was a happy, lively vibe with great music and a friendly crowd....we had a bit of a wait but it was just fine..the hosts kept good track of us and consistently updated us on the table being prepared....once we\nwere seated we had quick great service and once again our meal was delicous.\nwe ordered at least 6-8 small plates to share between the three of us-- the carnitas-\nfish tacos, beef tacos, pickled vegetables, and more....all yummy...made more spicy/tangy by the four choices of salsas brought to the table...\nGo! To! Gran Electrica. : )", "author": "Ever T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "The atmosphere is really cozy and cute, we got a seat by the window. The service was friendly and helpful and the food was really yummy. The only problem is that the portions are very very small. I also had sangria which was really delicious I would definitely recommend it! So if you're looking for a dinner go elsewhere but if you're looking for a cool place to have drinks and appetizers this is your place!", "author": "Alison G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-30", "description": "I really wanted to like this place. I love Mexican and like to mix it up and see what's new, but left extremely disappointed last night. We tried 3 things - including 2 suggested by our server as \"signature\" dishes. The fish tacos has ZERO seasoning, the garnachas were limp, flavorless and I had big globs of chicken skin on mine! (yuck), and then the Tlacoyos had an overwhelming taste of raw masa. They just weren't cooked through. And had big chunks of raw onion which always bums me out, and very little else it seemed. 4 little bowls of salsa couldn't kick up any excitement for our taste buds either.....\n\nAnd unfortunately after discussing our less than great experience with our server, he said he couldn't take off anything from our bill. Which of course didn't improve our impression with this place. Pass on this.", "author": "Deborah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-13", "description": "Hats off to this place for creating a good looking...I dont do well with Mexican joints because I dont eat pork and I dont drink Tequila.  But the diversity of this menu and the funkiness of the crowd makes this place worth seeing", "author": "Mel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "I came here for a late lunch on a Sunday, but I can see myself coming here for dinner any night, and dinner and drinks on Friday/Saturday as well. Decorated really well and with very friendly wait staff who made eating there a pleasure. It was a bit hot so we stayed indoors but regretted it after to took a look at the garden. Very beautifully done. I plan to make myself a regular here. \n\nOn to the food. The wife and I ordered the seafood taco (that day it was shark) and the brisket tacos, with a Mexican Coke. My god, it was delicious. The brisket is moist and fatty, just the way it should be and the shark was amazing. I could eat ten of those (each order comes with 2). We liked it so much we ordered the carnitas, which were also excellent. The salsa they make fresh were also amazing. \n\nOther reviewers are right in that it is on the expensive side. Price definitely prevented me from ordering the 13 dollar chips and guac. They mentioned they are still figuring things out and will expand the menu, so hopefully they will drop the prices somewhat.", "author": "Nia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "i'm always excited when something new opens up in dumbo.  this place is pretty nice but i think overall it's too expensive for the quality.\n\npros:\ngreat margaritas.\ngood service.\nfish tacos are amazing.\ncool wallpaper\n\ncons:\neverything else we ate was not good (empanadas, churros, other tacos, seafood mixture cup)\nexpensive\ngarden drinks and food menu very limited\noften crowded", "author": "Valerie N."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Gran Electrica", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "5 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QeUN8242jpWpejF_hMFUuw/ls.jpg", "@type": "Restaurant", "telephone": "+17188522700"}