{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "Shelly Watson brings down the house every Tuesday hosting karaoke.  First 4 singers get free drinks.  She's hilarious, personable, and an amazing singer.  Starts at 9pm, $2 pbr.. GREAT night out.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-22", "description": "Not many choices to choose from but the food was pretty good.\nThe service was beyond horrible. Sat at the bar because the wait was long for a table, then waited 10 mins for menu and at least 20 for ordering. If I did not say something  I would have waited longer. Waited another 25 mins for the food. the toast was dry luckily I was sitting at the bar and helped  myself to the butter behind the counter. Then my bf asked for a glass of soda and waited a good 10 mins for that. I asked for the bill as quickly as possible because I knew my bf was about to blow a fuse. The bill was wrong even corrected it was wrong. Like I said food was good service sucked big time. I detest bad service!!!!!!!!!!!", "author": "Paula R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-08", "description": "NEVER go to this place on a Saturday night!! I've been here twice on said day of the week and both times I've walked in and right back out.\n\nI live a block or two from Mo's so I pass by it every day, and it's always looked like a cool, chill neighborhood bar. During the week I've seen live bands playing and DJ's bumpin old school r\u0026b and neo-soul, so I've wanted to check it out for a while. The crowd always seems diverse, neighborly, and professional. However, on the weekend the vibe of this place totally changes and the pretense is way too high!\n\nThe first Saturday night I went, the small venue was so crowded that my one friend and I could barely find any standing room. Once inside, there seemed to be a lot of large groups of friends disinterested in meeting new people. I'm new to NYC, and unfortunately I got quite a few \"you don't look like you're from this neighborhood, so what are you doing here?\" stares rather than the welcoming environment I'd hoped for. However, I also figured it could just be the crowd that night so I didn't immediately write the place off.\n\nTonight, another Saturday night, I went to Mo's after a few other places and had a similarly unwelcoming experience. The crowd tonight seemed a lot less professional or chill.  The music was disappointingly old, poppy/hip-hop club songs from the early 2000's (ie. Miss New Booty...seriously??)...like, songs that took me back to when I was 18, immature, and enjoyed grinding on random strangers to those exact same tracks. To my surprise a couple of people were actually dancing and grinding...literally about 2-3 of them.  Everyone else, if not engrossed in deep conversation with their friends, sat around and looked bored or rudely stared down other patrons. The room was crowded so my friend and I found a spot along the wall on the steps only after another group of guys who had been standing there decided to move along. A waitress walked by and asked if we wanted to order drinks, and we told her \"not yet\" thinking we'd try to get settled and decide how long we would stay. Not even a minute after the waitress passed, another bouncer/security guy with dreds who had been right behind her told us that it wasn't a good idea to stand on the steps. We started looking around and discussing where else we could move to in the super crowded place.  However, after a MERE 30 SECONDS (I wish I were exaggerating, but I kid you not), the same bouncer came back and said more aggressively to move off of the stairs. Well d*mn!! Can we even get time to process what you said the first time?? Do you want to push me off of the stairs yourself because it's that serious?? He needed to chill out!  We immediately left the place, feeling again anything BUT welcome. It seemed like we were being kicked out for not buying drinks from the waitress when she asked, but can we get settled and be there for 10 mins without getting harassed? If you were smart, you would realize that being unnecessarily aggressive and pissing off possible customers actually loses you money in the long run.\n\nThe worst part is that I really wanted to like this place so badly, but I'm disappointed. I'm even tempted to give it one last try on a weekday only, when the place is probably lower on business and not so apt to be rude. But as for Saturday nights with their horrible music, pretentious-without-a-cause crowd, and condescending/money-hungry employees......I'll certainly pass.", "author": "Kay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "I used to come here back in the day when it was Moe's, I noticed not much has changed though. Its still pretty crowded, similar crowd of folks coming through. Bartenders are nice, they sure do know how to make a drink. It's was way too crowded for my friends \u0026 I to stay long so we left after about 45 minutes or so.", "author": "Sandrine E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Great for an afternoon nip or a happy hour special. A cool vibe and chill staff make Mo's a nice stop on any day.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "It's the new Moe's! They took the \"e\" off for ... Savings maybe? Basic layout of this bar is the same as the old place to my memory, though there have been renovations. Basic clientele is also the same -- that especially glamorous and beautiful fort greene crowd. Good selection of tap beers (sixpoint crisp available), and an ok selection of spirits. We were brought a bowl of little crispy veggie chippy things as a snack (kind of like hot fries but made of good things). My only negative would be that this place is, at least for the moment, cash only, so make sure you bring some.", "author": "casey h."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-28", "description": "I've come here a couple times when I've been in the neighborhood, and it's an okay place to lounge when it's not packed to the gills on a weekend night. I was put off though when I saw them making my margarita with cheap, off-the-shelf mix. C'mon. And at $8, they're not doing you any favors.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Great, friendly neighborhood bar. They have happy hour every day from 4-7 I think, 2 for 1 beers and well drinks. The place is well decorated, and has lots of places to sit. The bartender was a bit flustered, but we still got our drinks. The drunk people next to us broke a glass, but they were having a good time. All in a day's work for a good bar.", "author": "Jude D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "I've been going here for years (like back when Mo's had an \"e\"). Mo's has a great staff - they keep it real and if you play nice, they'll play nice.  The food is delicious and perfectly seasoned and portioned well for a bar snack or dinner depending on the size of your appetite.  The happy hour special is a must and they play the sound for major sporting events.  I prefer to go earlier before the crowd gets there, but every now and then i stick around for the DJ.  Note: It's cash only. It gets crowded after 10pm on the weekends, and you need a drink to go upstairs to dance. But you can also two step downstairs if you choose.  Just don't be a jerk and you'll have a good time.", "author": "Danielle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-25", "description": "if you click on the link to your website either from here on yelp or google, its all japanese??? no pictures or anything, just kanji", "author": "Alan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "Visited this spot a while back when i was living in BK....it was great! Went recently and was a bit disappointed. WAAAAAY to many dudes! It seemed like they never stopped coming in! The place isn't big to begin with and things got real tight real fast. Heads up that its a cash bar so no running tabs on the Black Card! The DJ was 50/50. He hit on some records but he also had his \"WTF\" is he playing!? moments also. Bartenders were cool. Worth another look so I'll go back and give it another shot to see if it's a different vibe.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Definitely a great bar all around.  Check in on Facebook and get $3 off any drink?  Yes please!  I'll take that $2 hefeweisse good bartender!  Cool atmosphere and a live DJ to boot.  Nice dark interior with some good window seating and comfy chairs (loungy old chairs - stylish).  This is a solid bar here in this here place we call Fort Greene.", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "Preface: I remember when Moe's first opened. I was a senior at Brooklyn Tech,which is right around the corner,  and for some reason I thought it was a jazz bar. I used to pass by it all the time and peep the energy, vowing to enter one day. Many legal drinking years later, Mo's became the go-to spot for friends and I who didn't care to venture across the bridge on random nights.  I've brought in the New Year there once or twice, I was there when Obama was elected and the energy was incredibly unimaginable, I remember hugging and crying with a reporter and being in the street with my Moe's drink in hand shouting, \"Yes We Can!\" with other patrons who spilled out into the street to rejoice. It was incredible. I remember singing  karaoke  with friends on  Tuesday's  or just popping in for a random drink. Moe's had a diverse crowd, chill vibe, unpretentious, and friendly(for BK at least) energy and GOOD drinks. \n\nNow: I went in last night with some new friends and a friend who was a regular joined later. It   was our first time since it reopened.  I was well aware of the change in ownership and the alleged \"renovations\". We went to have a good night but we walked out, twice! \n\nThe doormen are still there and still cool. The crowd was thick and it was a sideway walk to the end of the bar. I greeted a bartender who had her D's on display, but no smile or what would you like? Did I offend you by coming over to hand you my money? Wait, what? Bad attitude! So I ordered drinks for my friends, Patron Margarita and Vodka and cranberry=weak! $13 and $9  for juice and water. I tasted, and did not order. The attitude turned me off to begin and the weak drinks confirmed that I ought to hold on to my twenty rather than waste it. Sadly, Moe's... Excuse me, Mo's...  is still  a cash bar. We exited the  bar promptly after the juice and water were done and a man tried to hit on my friend who sat on her stool higher than he stood. Done!\n\nWe went to eat at Mullane's and returned to Moe's when my friend joined us so she can judge for herself. \n\n Again, friendly doormen, thicker crowd, nowhere to stand or dance, the Dj was all over the place with the tunes. This time we headed up the stairs. Big screen tvs replaced the PAC man games?  There are new stools and tables but the worn out couches and chairs remained and the energy was still ... Blah...Too much was going on for us. Can't bust a move or do a sidestep because there are people jammed on both sides. Fire hazard? We left after 5 mins. Headed to Franks until we heard $5 cover and saw our aunties and 'em in the window and our uncles were outside. No. We kept it moving down to BK Terrace and stayed there.\n\nI was rather disappointed in Mo's  last night but I will give it another chance. Fool me once...", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "Beautifully appointed space, rustic and charming, fits right into this trendy neighborhood. The staff is friendly and knowledgeable, the atmosphere is full of good vibes. Different music different nights of the week, so choose your flavor accordingly. If you're a sports fan, watch boxing or football on their flat screens. I live in Washington Heights, and travel all the way out there, so that should tell you something!", "author": "Regina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Ok, lets be clear about something This is the best brunch in you will ever have in fort greene, in Brooklyn, and beyond!!! Now the prelude to your meal is this Beautiful, Alluring hostess, with somewhat of a Neo-Soul / Creole flair. Wow, she's Amazin!!! She (as well as the wonderfully Rustic decor) greets you with an enchanting smile that Illuminates this establishment with a glow that's often replecated, but Never duplicated. Your escorted to a table and seated. All the waitresses \u0026 waiters, are pleasent, accommodating, and truly Nice people. The menu host several Brunch favorites. Chicken \u0026 waffles (excellent), eggs benedic (great) served on an english muffin, not a \"biscuit\" as stated in another review. Shrimp \u0026 Cheese Grits (excellent as well), and a host of other favorites. I've been there for brunch at least 10 times, and everytime, everone is exactly the same. Nice, approachable, accommodating, and helpful. Excellent job guys, Hats off to you all. I will be there this weekend, and the weekend after that as well, and so on, and so on, and so on............. :-)", "author": "Jeffrey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "I'm at mo's on Tuesday night enjoying karamoke night!", "author": "Luders L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "I enjoyed this little pub.  The bar tender was cute and attentive.  The atmosphere was chill.  Check in on Facebook or twitter and get $3 off your drink.", "author": "BEN K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "My summer hang out, I come here to get great vibes and the energy is great, love the people love the vibes", "author": "Zaraida G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "I saw posters in the window for a Burlesque show- MO BETTA BURLESQUE. Brought a bunch of girlfriends! Good thing we came early, b/c it got packed! We ALL had a really good time. The hostess, Broadway Brassy brought down the house! I laughed and hooted and hollared. It was sexy, but still tasteful. I havent had that much fun out in Brooklyn in a long time! Can't wait for next month!! Oh- and it was FREE!!! Yay Mo's!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Went on a Sunday to watch football. Was able to bring in food instead of ordering. Not too crowded, great music during commercials and at halftime. Lots of fun. I recommend it.", "author": "Andrew A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}