{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Excellent neighborhood bar that attracts a great crowd.  Expect laughter peppered with dancing.", "author": "Paddy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Mo's is a great spot to grab something to eat, watch the game and grab a glass of Brooklyn Lager.  They play a lot of hip-hop and R\u0026B which sets up a  lounge type of  atmosphere. They have a full bar and the staff is courteous and welcoming.  If you're in Brooklyn and you're looking for a cool spot to chill, I definitely recommend Mo's....also it's within walking distance from The Barclays Center.", "author": "Ian E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "If I could give this place a  negative zero I would The manager of this establishment was a little bitch. This place was unbelievably boring. The music was sub par at best and the manager was rude. Last time I checked the customers make the business, you can't make money if ppl don't like your establishment. I don't get how the manager thought he could cut in front of me for the bathroom, and got mad at me because I stopped him. I wouldn't go to this place ever again.", "author": "Ma'jorie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "The old Moe's was one of my favorite Brooklyn bars. I was always impressed by the eclectic mix of people that it attracted- artists, business people, hipsters and thugs. Welcome to Brooklyn! Shift in ownership , changed staff, a few renovations, yadda, yadda, yadda...and now we're at Mo's without the e. \n\nThe first time I went after the new Mo's first opened the bartender told me about the pricing structure which was based on the shelf level that the alcohol bottle was on...except for bottles on the end of the last shelf that had a separate, higher price. \"So you basically just nullified, the shelf  levels = pricing tier thing\". Kinda made no sense to me. I suggested- if this tier system is so important, build a 4th shelf and create a 4th tier rather than getting frustrated when a customer asks why their drink price from the 3rd shelf doesn't match any of the tiers that you just spent time talking about. This totally left a bad taste in my mouth, so I was happy to see that references to the tiers are now completely gone when I returned last night. Thanks- it didn't make sense anyway. \n\nThis last time, I came on a Saturday and the crowd wasn't too heavy or light. It was easy to breath and if you hung out for a bit, you'd definitely get a seat. The drinks are always good and the bartenders are pretty nice. There was a DJ on and lots of dancing in the upstairs part, but the volume was not overwhelming in the front, so it was easy to hold a conversation. Just be sure that if you come, you bring cash. No credit cards here kids. There is an ATM conveniently placed right outside though.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "I've been coming to MO's since I was about 19 years old. I've been an avid \"MO's goer,\"spending almost every weekend there because I loved the atmosphere.Ever since the change in management and staff the customer service has been unprofessional and aggressive. I recently visited with a group of my friends as had an unpleasant experience. The seat that i was sitting in was too low. There was an available chair adjacent to where I sitting, I decided to move it over and use it. Although I understand that some establishments like to keep their set up a certain way I still thought it was ok to move. A si have been coming here for years and have seen this done on multiple occasions. A man walks up behind me as I'm sitting and says \"did the chair look like it needed or could have been moved.\" He never addressed me or identified hisself. I look at him and replied saying I didnt know it was a problem, then I proceeded to move the chair back. As I was moving it he said \" oh no, it's fine you can leave it there. I just continued to move the chair back, he aggressively grabbed the chair and said I'll move it in the manager. Now I know I was in the wrong for moving the chair without asking however he could have walked over to me, addressed me and nicely explained the policy. I would have been more than obliged to move the chair back. It just wasn't a good experience and will be my last.", "author": "Nafeesa J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "Venues like Mo's always try to do too much. \n\nMy first visit to Mo's was so cool and chill. I ignored the cheesy Hennesy based cocktail menu and enjoyed the nostalgic 80's and 90s R\u0026B/Hip-Hop music. The couches were comfy and I could have easily ended my night there.\n\nHowever, on my second visit they played a game and the place was loud and crowded like a sports bar. I can't say I'd intentionally visit Mo's again. I like my drinking establishments to have a solid purpose and identity.", "author": "Brandie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "Love it. One of the best places NYC has to offer if you know what time and day to go. \n\n-Happy hour is fantastic (3PM - 8PM) if I'm not mistaken. \n-Bill is always ridiculously low!\n-Great service (LOVE YOU RAQUEL!)\n-Delicious food (herb seasoned burger after a few beers, anyone?)\n-Really cool crowd\n-Karaoke nights on Tuesdays! \n\nI would imagine that this place would get pretty crowded on weekends. But, if you're in the mood for great deals on drinks and food after work during the week, this is definitely your spot. It's also conveniently located LITERALLY next to the G train Fulton St. station. \n\nCheck it out!", "author": "Emily S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "In the late 2000s, I posted a review for Moe's, the bar that used to be in this spot, until new owners took over and dropped the E, which brings us to its current name, Mo's.  I have been to the new Mo's a couple of times since then, and frankly, had you not told me anything had changed, I wouldn't know the difference.  It's still the beautiful place it always was.  There are reviewers here who will say otherwise, but they're basically nit-picking and letting the perfect be the enemy of the good.  Mo[e]'s is still beautiful as ever.\n\nWith that said, here's my original review of the pre-ownership change Moe's.  Frankly, every word I wrote before still applies.\n\n===\n\nI have a weird life that puts me in New Jersey 2-3 days a week (despite living in Baltimore), and I'll routinely make the trip from there into \"the City,\" and sometimes Brooklyn also.  (I also used to be a resident of the latter, some years back.)  A friend of mine, a former Brooklynite, introduced me to Moe's in 2004 or so, and even now that I've moved down to Baltimore, I make the effort to go whenever I can.  And if I can meet up with a friend or two in NYC, chances are very good that we're going to pop up at Moe's at some point during the night.\n\nThere's something about the mix of folk who frequent Moe's that is near impossible to match outside of Brooklyn.  I find it hard to put the place into a box for this reason -- musically and demographically, this really is the mix of people from all walks of life that America is supposed to be about but in reality, rarely ever is.  Suffice it to say that an American-born person of Indian descent, hanging out in a up-until-recently-primarily-black-but-rapidly-­gentrifying area, one who was raised on '80s and '90s R\u0026B and hip hop and thinks hip hop died after ca. 1995, who doesn't quite identify 100% with White America (TM) or Black America (TM), basically qualifies as an \"average\" customer here.\n\nRiding the cultural fence as I do (because face it, there's no such thing as an \"American-born Indian person bar\" in America), I can tell you that Moe's is the first watering hole I've been to where I really feel a sense of connection.  You may think I'm a little too obsessed with identity politics, but look, \"feeling comfortable\" is a HUGE consideration in how you rate a bar, lounge, etc.  And what's great about Moe's -- or maybe this is more a commentary on Brooklyn itself -- is that it's a place where you can set that baggage aside for a while and just genuinely enjoy the company of other people, forgetting the silly, distracting stuff and just being able to get to know them as human beings.\n\nAnd really, isn't that what it's all about?", "author": "Dheeraj V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-05", "description": "Met up with a girlfriend at Mo's to watch game six of the Knicks/Boston series.  Since there were no seats at the bar, we ended up in the back - which turned out to be just fine.  The fans were fun,  the food was good and though the service was a bit slow (the pretty waitress seemed a little dazed and confused) the back room host was attentive.  \n\nI ordered the Twin Lump Crab Cakes which is served with a lovely salad.  I enjoyed my meal.  I also indulged in one of their ginger infused cocktails - well I actually indulged four times - which was delicious.  Unfortunately for some reason (perhaps the aforementioned 4 cocktails) I can't remember the exact name of the drink.  It was delicious though.  My friend sipped several kettle ones and soda (and wished the bartender had been a little lighter on the soda and heavier on the K1) and snacked on the Lobster Quesidilla which she enjoyed.\n\nOnce the game was over (YAY THE KNICKS WON!), the DJ started spinning and the Friday night crowd started to trickle in.  The DJ spun old school, which made me happy, but unfortunately, they ended up turning off the second game (WTF...it's OKC for goodness sakes), and I promptly lost interest in staying.  The bill was reasonable but parking was a challenge (that said, both the A and G lines have stops in stumbling distance).  Also note it's cash only (booooo, though they do have an ATM).  \n\nThey have lots of events throughout the week.  I'm going to check out Karaoke Tuesdays, and I'll definitely be back to watch a few more Knicks games this season.  Good times...", "author": "Brandi G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-31", "description": "Came here after having brunch nearby on a Sunday afternoon in January. We got to relax in the front corner area with wooden benches, comfortable chairs and a tree stump coffee table in the middle. It was a nice place to gather around and discuss the ridiculous happenings of the night before, although I never got to take my jacket off with the door continuously being opened next to us.\n\nThe warm apple cider with rum in it...mmm mmm mmm! It was the perfect post-brunch mid-afternoon drink. It got me ambitious enough to try their wings, even though I was ridiculously full. It was a bad idea, because they were no good. It tasted like they were sitting out for a while. I hope their wings aren't always like that, especially on free wings night!", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "I went back despite having previously deciding to boycott the place.  \n\nThe cocktail waitress was not as personable as my girlfriends and I would have preferred.  The service was extremely slow around 8:30-9 pm on a Friday night.  It took me a very long time to get a drink.  \n\nI initially ordered a drink at the bar, waited nearly ten minutes as I also waiting for my friends to arrive, before finally finding a seat and ordering the same drink with the aforementioned waitress.  the table service idea is new, but from what i can see, not that great.  it took at least 15 minutes for our drinks to arrive, and this is before the place was that crowded.\n\nDespite the poor service and lack of customized drinks-- when my friend ask the cocktail waitress for a recommendation or if they have any specialized drinks, she had nothing to tell her, not even a suggestion-- my friends and I had a good time.  \n\nThis \"new\" Mo's remains one of the few places to get a drink and dance to a DJ playing good music.  I also liked the crowd, which is slightly different I think than the last crowd.  Still diverse, but a tad more on the young professional side.  There were a lot of women that night-- though another night I popped my head in, there were mostly men and the fight was on TV (another new aspect-- TV, and sports).\n\nI would go back, but it's not what it once was... though it's too early for me to say that it won't ever be.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "This is probably the most un-PC review I'll ever write, but whatever. I liked Moe's and I like Mo's because unlike many other bars in cool (read: hipsterfied) parts of Brooklyn I can go and not feel like a speck of pepper in a sea of salt. The drinks are decent, they have a good happy hour, great events: live music, comedy, karaoke. TVs to watch the game, and hetero ladies if you come sans date you can usually find a gentleman to keep you company, if you're into that sort of thing, but there's a pretty big (and cool) bouncer if you're not into that sort of thing. As Renje G. said the guy:girl ratio is pretty good in our favor, ladies.\n\nI was there one night and I ran into Jeffrey Wright (from 'Basquiat', and Peeples from the 'Shaft' remake...\"Tiger Wooo\") and he was so funny and down to earth, I just love that I can have that kind of experience in a neighborhood bar. \n\nSo on any given night you can come and maybe run into an chill unpretentious celebrity,  listen to a band called The Bodega Pimps Quartet (seriously that name is totally badass), have a $6 hot apple cider (post-Happy Hour), and not be the only brown person there.", "author": "Loren H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-15", "description": "why do i keep coming back to moes or mo's?\nwhy?\nits like the most abusive relationship ever.\ni keep going and drinking i thinking im having fun\nuntil it gets crowded with creeps \nand the bar takes 5 years.\nand the kitchen makes your clothes smell like chicken.\nand its hot.\nand the atm breaks.\nand they have weird \"bouncers\" like it s a club.\nlots of i am not my hair girls\nand guys from Canarsie post barclays patron shots.\nand there i am again.\nbesides these things.\nthey have Laguanitas on draft which rules.\nyou can charge your phone everywhere.\nbathroom lines go fast.\nyou can dance.\nand the karaoke host is hilarious. \nits close to my train \nand its fort greene.\nso,\nitll have to do.", "author": "Lauren Paige R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "Mo's is one of my old stomping grounds while living in BKLYN. They are located on the corner for South Portland and Lafayette. A few of us went there last Saturday for a few drinks. The laid back ambience is still the same.  The service is still great but when it gets crowed, it could be a little difficult to order. \n\nWhen I was a patron of Mo's, I only recall it being just a bar by day and it turned into a night club after hours. Now they serve food, play games, karaoke and etc. That sounds really good. I can't wait to sample their food whenever I am in BLYN again. \n\nI will be checking Mo's out again.", "author": "Erskine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Breakfast was fresh and tasty.small but not  crowded.great\nFor group of friends dining. Ambiance is hippy but cool.the service was quick and staff were polite.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "Some friends and I spent a Sunday afternoon meandering between different Fort Greene spots, Mo's being one of them.\n\nLoved the old-school R\u0026B and hip-hop music. Loved that happy hour was in effect and that I received two extremely strong vodka seltzers. Loved that I could move around because it was earlier in the evening. Other times, Mo's is a fire hazard waiting to happen.\n\nOnto the food: The Creole wings were just hot for no apparent reason. The homemade corn chips with guacamole (overly acidic) and salsa verde (fine) was kind of disappointing. The chicken fajitas with grilled veggies was VERY delicious, but a very small serving. The serving sizes generally don't seem to fit the price.\n\nAnd it's a cash-only place. Mo's, I'm always torn about you. You've got a lot of good, but there's definite room for improvement.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-10", "description": "I made the mistake of purchasing a brunch Groupon, and while it was a good deal, it was the worst brunch I've ever had in my life. I ordered the eggs benedict, and my entire plate looked like it was once frozen and then thawed under a heating lamp or something.\n\nThe potatoes were way too perfectly cut, so I assumed those were once frozen, and they tasted terrible. The biscuit underneath my egg was really chewy and it did not cut easily with my butter knife. \n\nThe food was not piping hot -- it was luke warm at best. They also advertised \"fresh squeezed orange juice,\" but it was straight out of the carton. \n\nMy husband ordered the chicken and waffles, and post brunch, had major stomach problems for the rest of the day.\n\nAlso, they had the fan on for some strange reason, and the wind was not pleasant on my face, considering it was 30 degrees outside and raining. I asked them to turn it off, and as soon as we were leaving, they turned it back on. ;-/\n\nI think this place is cool as a bar, and the service was really good (that's why I gave them two stars)... but they should just stick to serving drinks and forget brunch. I'll never stray from  Pillow Cafe for a delicious brunch...", "author": "CT T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "Came here on a Tuesday night with my good friend and a group of her co-workers about 3 weeks ago. This place was packed for a weeknight. We made our way to the back about 9pm, wasn't so crowded then but by 11 the back karaoke area barely had room. The host was awesome, definitely entertaining, she can also sing. \n\nThere are a lot of regulars here with great voices. Mixed crowd, Good drinks, Only 2 mics, small stage but hello its just the back of the bar. I though this place was a really cool spot, definitely would go back. Didnt try the food, but its nice for a casual week night out. \n\nYou do have to buy a drink to sit in the karaoke area. \nThe songs with the \"videos\" are not the music videos lol, in fact they really have no relation to the song which was kinda funny lol.", "author": "Allysa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-14", "description": "I used a Groupon for brunch here yesterday. The first I'll say is that the food was great,I had the Eggs Benedict and the best part was the option of the smoked salmon in place of the Canadian bacon. My cousin had the Maria French Toast and it looked so good, she left her plate clean so it must've been! Also the Mimosas were good and cold. \nThe service how ever needs improvement. Different people served us and each time we had to sort of flag them down. When I asked for ketchup I got a giant squeeze bottle that must be used in the kitchen. The person who gave me the check was confused about how much I had to pay and in the end so was I, which resulted in me way over tipping (annoyed at myself for that). The 3 Mimosas I had didnt help. It's cash only and to me that's always a drawback.\nI'd try it again though because the food was really good.", "author": "Tiffany I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Awesome space, cool people and cheap drinks, especially during their happy hour, which is practically all day. Def worth a visit and I will be back!", "author": "Dalton D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}