{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "My first time in NYC, a friend took me to Mo's. I loved the whole vibe of the lounge. It was very chill, a great variety of music, the drinks had me feeling lovely which means the bartender definitely is not stingy. The crowd is awesome, I went on a Saturday, it became crowded after 11pm which was not a issue, everyone was dancing in their zone having fun, the people were extremely friendly. When I visit NYC again Mo's is definitely a must! I would definitely recommend Mo's to all walks of life.", "author": "Cassandra C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "They advertise food, but don't have a kitchen. Signs all over the building advertising food.... but there's no kitchen.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-18", "description": "Lazy Bartender!  I asked to the Caucasian bartender with a beard for a Mojito last night (Mojitos are on their menu).  He responded, \"I don't really fell like making that right now.  What about another drink instead?\"  There were other bartenders around so I asked, \"Well, can someone else make me it, if you don't want to.\"  He responded,  \"No\" and then offered to make me a rum punch.  Turns out he just didn't feel like crushing up the mint leaves.  Worst bartender experience ever and very bad for business!", "author": "Shawna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "I'm very disappointed today with Moe's.\n:(\nLast time I was here I was severely harassed by the bulldog doorman about possibly having a drink while out side in the back smoking a cigarette. I didn't have one on me. In fact I told this person that I don't do that. He did not apologize for the inconvenience. He left with his grumpy self. The next day, literally, I arrive with my girlfriends to  enjoy a peaceful drink over poetry night or something like that. I look to my left outside area, and guess what I see??!! People drinking in the outside area. I spot this and alert the \"infraction\" to the same doorman/harasser, and guess what he does?! Absolutely NOTHING! \nI will definitely think twice about coming back to this locale!!", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "In the area for the ice hockey and went for a wander to find a bar to pass the time pre game and found this gem of a local bar\n\nGreat friendly relaxed atmosphere inside with a couple of large tv's showing the sport above the bar. Only poked my head in the next room but it had the walls lined with some retro style Art Deco thing happening \n\nNice range of local beers on tap and a range of cocktails too. I went with the beer. \n\nClientele friendly and up for a chat. Has wifi.\n\nNext door is a subway stop on the Q line", "author": "Mark C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "I've been to Mo's a few times over the years, most recently last night. (When did they drop the \"e\" in Moe's?)  I've always found it to be a pretty good time. Nothing particularly standout about it, but unlike some other people's experience here, it's always been consistent for me: nice bartenders, a nice, chill vibe, and good music (90s hip hop and r\u0026b the last few times I've been here). Haven't been here on one of the \"sports\" nights, so I can't really comment on it there.\n\nThere are some nice cozy chairs to sit in near the front, which makes it more welcoming. There's always an eclectic mix of people here, and diversity in the crowd is always a huge plus for me. Last night, my phone was dying by the time I got here, and even though it was SUPER busy, I took a chance and asked the bartender if by some chance he had a place where I could charge my phone. Before I could even finish my sentence, he took the phone behind the bar and took care of it--he was so sweet about it.  It's the little things!", "author": "Shana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-13", "description": "EXPECT TO BE ROBBED BY HUGO\n\nOn Friday my friend and I decided to go to Mo's for happy hour since we both have summer Fridays. I got there earlier than she did and Hugo (if that's even his real name) the bartender was very welcoming and nice. He told me about the happy hour specials and I sipped on a margarita while I waited for my friend, during which time he came over and checked on me. Very nice. \nMy friend arrives and we stay awhile, both having about 4 margaritas. Mo's is cash only, so I went to use their ATM. The total came to $20. I took out two $20 bills so I'd be able to get change to tip Hugo. Now, I'm pretty small, so I don't know if Hugo thought I'd be too drunk to notice, but he never gave me my change. My friend calls him over and tells him I'm waiting on my change. He says, \"you only gave me $20.\" I say, \"No. I definitely took out $40 and gave it to you.\" I even look in my purse to make sure. There's no $20 hanging around in there. Hugo says he'll go check. He walks over to the cash register and comes back and says again that I only gave him $20. I pull out the receipt from the ATM and say I even have a receipt here that proves I took out $40. Suddenly without even looking at the receipt Hugo whips a $20 bill out of his POCKET and slams it on the bar and says, \"You know what? Here!\" and walks away. \n\nMy friend and I look at each other. It became very clear that he thought we were drunk and he was trying to pocket that 20. Why would you check the register, but then whip it out of your pocket? He knew he was caught. I went to the restroom and then asked his name before leaving JUST so I could leave this review, so other people would know to beware of Hugo. \n\nI've been to Mo's many times before and never had anything like this happen, so this is the only reason for the extra star.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Love, love Moe's. I have been coming here for years and even came for New Years and had a wonderful time. Great vibe, great drinks, but most important the dj plays great music. From hip hop to reggae you always know you are in for a good time. My only recommendation is to get here before 11pm because the place has a tendency to get very packed.", "author": "Demar P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "3.5 stars.\nI have fun here.  The music gives it a hip-hop atmosphere but the decor is more hipster. \nThere beer selection needs some work but there are good drink specials.\nSaturday nights this place gets packed. Everyone is dancing and they stop letting people in if it gets too crowded.  \nWhen there isn't a dance party, there are comfortable lounge seats in the front and in the back. \nThe food sucks.  It's also cash only.  I will keep coming here though, as it is very close to my hose.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "I'll start with the positives: the space is very cool. There is a lot of interesting seating and a great area in the back by the DJ that seems to be popular for dates and larger groups. There is also some bench space out front.The crowd is really diverse and the DJ played good music every time I've been there. When I'm at the bar, the service is good. If I'm not mistaken, their happy hour lasts until 8 which I appreciate. \n\nThe bad: They stopped serving food. Their food was actually really good and the food menu was pretty unique. I drink margaritas almost exclusively and theirs are mediocre. I'd have one for happy hour before going somewhere else. Otherwise I've had way better for a lot cheaper in the same area.\n\nThe last time I was there the service was poor. Two of my colleagues and I took a table in the back on a Monday night. The waitress took a long time to come even though it was far from busy but that was fine. When we ordered a second round she brought my friend's margarita and I waited for mine for at least 10 minutes. We watched her serve mixed drinks to other tables so politely reminded her that I was still waiting. My friends both finished their drinks before mine ever came so we just paid and left. \n\nI'll probably end up in here again eventually but it's far from my preference, especially when there are so many options in this neighborhood.", "author": "Shaks R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "Mostly I want to recommend the Bleu Cheese Burger...effing delicious (a dense patty infused with bleu cheese and diced sun dried tomatoes and garlic topped with an onion jam...incredible). \n\nReally great food, though it's a little tight and the service was a bit slow.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Now they have new owners I'm still satisfied when I go there. I had a good time on Kareoke night. Pics r on my #ig under @superhru", "author": "G.a. D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Mo's will always have a special place in my heart. I had worked in the area way back when. After work everyone would go to the same bar all the time. It was nice, but sometimes you need to be different. Sometimes you need to let loose. You need to do something different. You need to steal a dog from a little kid and sell it on the black market..... no wait that's going way too far. I'll just try a different bar in the neighborhood. \n\nMo's was the perfect alternative option. Instead of being around a bunch of co-workers who weren't going to come out of their shells, Mo's had a more local crowd. Yeah sure there was always a pimp or two in there but that should not reflect the place. The clientele is always awesome. Great bartenders. They have an amazing happy hour, buy one get one free. Full bar and a pretty good beer selection. \n\nMost recently I came here for a Nets playoff game. Place was packed and filled with people. We we're ready to kill a Bulls fan in the bar. I'm joking.......... We'd only torture them and remove a few limbs. Killing would be too much. \n\nIf you can grab a spot by the couches and have a crew with you, you should be able to have a great time. It's a great option when in Fort Greene because it's just outside the visibility of the Fulton Lafayette triangle, thus not having so many random foot traffic patrons that will only pack the place.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Went to Mo's on a Saturday Night. Always a friendly environment there. Glad to see they are still doing well since that neighborhood has changed so much. Drinks are reasonably priced although I would suggest avoiding their rail drinks.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "FUCK THIS PLACE\n\nWe are equal I don't care what color you are you should be able to roll. These motherfuckers talkin bout suddenly you gotta be 25? My little brother 23 travelled from mh to see me and they won't let him in talking bout he under 25 so he don't got money?? It was pretty obvious they on some racist shit suddenly coz my little brother is from Thailand. I don't fuck with places like this. You wanna suddenly make up rules you best have a large ass sign  saying that bullshit. I won't advise anyone to come here. \n\nWe are all in this game together so treat everyone with the respect you want and not that bullshit. Fuck mos  I'm mad I have to leave one star coz I really wanna leave none\n\nDon't give your money to racist prejudice establishments like this. They built on hate and we don't need none of this in this world.", "author": "Mo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Mo's is exactly what you want New York to be if you're an idealist. Black, white, Asian, biker dudes, characters who have stories to tell, and so many others crammed into this cute bar on a nice block. Great beers on tap and people are friendly, so don't be surprised if strangers smile and say hi.", "author": "Madhu R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Me and my best friend decided to check out this spot on a Friday evening. This is a great place to chill and hear good music. Happy hour is until 8pm. No food is served but they allow you to bring in your own food or have food delivered to you. The place gets crowded around 8pm and basically turns into a mini club. Get there early for some cheap drinks and a spot to secure seating. Can't beat $5 margs in a lounge setting with banging music!", "author": "Stak A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "Dropped by here Sunday afternoon,  got their happy hour special ($5 well drinks until 8pm), listened to some good ol Hip Hop \u0026 RnB, and charged my phone! Seriously a life saver with outlets next to the loungey area in the back. Good spot to chill, hang out. Later on it gets packed though, the dance floor was rockin when I went back after 9pm. Not really my scene but looked like people were having fun!", "author": "Karen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "My favorite bar!! I love the great mix of music old and new r\u0026b and hip hop. The mix of ppl. All ages 21+ of course and races. It's clean. The decor is nice and the drinks are good.. not expensive either. The food was okay! And the staff is nice. The bouncer is funny! I think his name was mike!", "author": "Mia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Have been here several times for their brunch only. Of my three brunch experiences here I have always enjoyed the food n service the shrimp n grits r to die for so is the chicken n waffles omg so good drinks r pretty standard and when I went they only accepted cash hence one star off maybe it has changed since I last been", "author": "Zena M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}