{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "Nice decor.Place is too small,takes forever to get a drink when crowded and crowded is fifteen people at the bar.", "author": "Lucius J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "Wish I could have given more stars but it's not the case! I Ask before hand if they took cards, the bar tender said yesss. I had a open tab purchased 4/5 drinks which were good. Towards the end of the evening the bar tender said to me she was leaving and wanted to close out. I didn't mind since I was done drinking ... What upset me is the same bar tender who said they took cards turned around and told me the card machine doesn't work !!!! There were so many people in and out I'm sure she knew this way before she mentioned it (assuming she didn't lie to me ...) anyway now I'm scrambling to find cash. She never apologize for not displaying this info nor did it seem to phase her. Because I felt bambozzle I won't return nor would I suggest this place to others !", "author": "Bridget N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "I miss the old place but the new set up is quite sexy. It's a great place for a date. A little intimate.. lounge feel. One of the managers always remembers me and stops to chat.\nMy dates always think i'm a regular, though I'm not. It's just that they are so friendly and welcoming that it feels like home every time I'm there. \n\nGreat drinks, food, and nice huge flat screens to help keep up with your sports teams if you're venturing out alone. i recommend this place 2,000 percent.", "author": "Nairobi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-30", "description": "New management? Please. It's just as bad as it's ever been. How do you have one server on a Friday night for like 60 people. Tried to give it another go but I won't be returning if there isn't a seat at the bar. And the only good things on the food menu are the quesadillas and fish tacos. Spend your money elsewhere.", "author": "Stacey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Had a Groupon for this jjoint it was purdy darn good!\nThe cheesy Grits were great and the Bacon was wonderful yet SMALL!\nWent with my wife and 2 friends we were all very happy with our meals!!,,,,Happy meals..I made a funny!!", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "I'm an out-of-stater who has been here 3 times and only made it up to the dance floor once, finally this last visit. My city is one where the party starts at 10 and ends at 2. So whenever I come to NY, it's a bit tough for my internal clock to deal with the late partying hours. I sound so old XD\n\nAnyway, I'm not a huge fan of this place in all honesty. The first two times I visited, it was super crowded and difficult to breathe, let alone try to get a drink at the bar. We left not long after getting in, having had minimal fun and not even able to get to the overcrowded dance area. This third time we arrived around 10:30, so it was much less crowded, but still quite packed, if that makes sense. As in, if you were trying to get to the bar, the arrangement of the 1st floor is such that you're definitely going to be pushed and squished forward by those trying to either get to the bathroom, dance floor, or to the bar themselves. It is a very cramped space for how popular a spot it is. I would caution someone on a date or just not in the mood to not sit at the bar because you'll have people leaning over you and their arms constantly reaching over and between you and your seated companion to pick up drinks. \n\nAdmittedly, I enjoyed the music the DJ played for the most part. It brought me back to my college days, where I would actually willingly grind on guys. I'm not at all interested in that now, but the music was fun. The guys are a bit creepy, but some are nice. The whole standing around on the sidelines just watching people dance will forever be weird to me, but to each his own I guess. \n\nI highly dislike having to buy a drink to get on a dance floor. There is only one other place I've been to that does that, and I can't stand that place. The drinks are pricey, but I'm from Philly, so that's to be expected I suppose. I would suggest staying with a beer, since my long island was weak and wack, but I got it free so meh. The dance floor can get crowded, as it's pretty small. People have parties there it seems, but unless you like being crowded, I would not suggest this place.\n\nOverall meh.", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "I would give this place negative stars if possible. It is just awful! We went there after a wedding, hoping to get a drink and were antagonize and even threatened by the terrible staff.  The best advice is DO NOT COME HERE. We tried to get in and while waiting patiently outside the bouncer was rude for no reason at all. All we wanted was to get a drink and the staff were total assholes   the tipping point was when the bouncer threatened to \"pop\" one of our friends,... for no reason. He then made a racist remark about one of our Asian friends.  Most disrespectful and offensive staff and bar ever. Do not patronize this place unless you wanna be treated like shit, threatened,  and overall have a terrible time.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "Went to have couple of drinks and a good time with my friends a Saturday night...and the security guard wouldn't let 4 gentlemen inside at the same time...wanting to let us in 2 at a time as we had to wait for 2 random girls to come in before he lets the other 2 gentlemen....don't recommend this place to anyone", "author": "Hg fh V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-19", "description": "Met with friends here for a drink last night. Drinks were good and bar staff was very friendly. There was a server who took my drink order and took so long I actually forgot I had ordered it...and it didn't come with the lemon I had asked for. She was pretty rude but I guess at the end of her shift so a new server took over who was much nicer but still pretty slow service. My husband and I split a burger that tasted like meatloaf and was way over cooked. I was too hungry to send it back and the curly fries were good. \n\nThe atmosphere is definitely cozy and nice. I would've been perfectly happy if I had kept ordering drinks at the bar and not gotten food.", "author": "amanda w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-12", "description": "Came in here to watch a Heat - Celtics game, and it was an alright time. Lots of people had the same idea as us, but we did manage to find a spot at the bar which was nice. It took a while, like, a WHILE to get a drink. It seems like one of those bars where everyone knows each other...locals only sorta thing. The strange part about that is, I had to wait for everything, including wait to pay for my own drinks. When it was time to leave no bartender came over to me for like 10 minutes! I could have just left if I wanted to. I paid, and left. I don't even think the lady came over to get the money that I left...so weird. Ah well. It was an alright time, and the drinks were good.", "author": "Clint H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "I went to Mo's for brunch with a Groupon. I was skeptical a firs because it is more of a pub then a restaurant.\nBut: food was very very good. I had shrimps with a kind of polenta, waffels and my friend had eggs and bacon and we were very happy with the food.\n\nThe waitress was very attentive and friendly. Good experience, I'll surely go back at night if I am in the area.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-30", "description": "*Disclaimer*\n\nBefore Moe's closed, it was my favorite bar in the whole city. It was the place where you can go and hear the BEST old school hip hop and r\u0026b. The DJ would switch up and you would hear some good classic reggae and then oldies from Teena Marie and Earth Wind and Fire. It was spacious so people created their own dancefloor and would be getting down. There was a big screen in the back where they would play 80's movies (usually muted) which added to the old school vibes.\n\nThen, they closed.\n\nPeople were saddened about the news of their closing but some were surprised that they re-opened. At first I was even excited.\n\nBut after going back three times since their closing, they might as well have stayed closed.\n\nThey have a video DJ and the music is the same sh*t you can hear at 99% of other bars in the City. It's mostly Top 40 crap and dance stuff. One night they actually attempted to play old school stuff and the DJ couldn't even mix. He was preoccupied and hardly stayed at the booth! What kind of DJing is that. Plus, the drinks are weak.\n\nPoint is, this bar lost is character and as a result, lost a loyal former patron.", "author": "Michele G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "Mo's!! The music and people on a Saturday are some of my favorite things.  Great spot for actual dancing to old school hip hop.", "author": "Kelli S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "Vibes, beats, beautiful people. Packed, fun and I'll always love it there.", "author": "Maria H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "Breezed through for a couple drinks on a Friday night.. DJ spinned a lil old school hiphop and some R\u0026B.\n\nThe crowd was mixed...some laid back, some a bit on the \"rough\" side. Some older, some younger...The dance floor was packed and everyone seemed to be extremely inebriated and having a blast when we got there.\n\nFull bar of course, but they had NO Chardonnay. :(  ...So, I substituted with a glass of Pinot followed by 2 shots of Patron! Yikes! =) o_O\n\nThe bartender was friendly, attentive and quick.\n\nMost of the patrons were a bit on the rough side..not really my type of scene.\n\nBut it's a cool spot overall...nothing hellish or horrendous took place...!", "author": "Jewel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Awesome Dive-bar!!!  Usually there on Friday or Saturday night DJ are always fabulous! The bouncers are the best in Brooklyn!  The waitress can be bit much no, no rude is a better description especially Dee (attitude for no reason) so go straight to the bartenders they know how to pour + very friendly. \n\nThe crowd is usually a diverse mix which is likely due to the neighborhood; with young/old ranging in age from varies backgrounds and cultures-- it's cool.  Every visit with the exception of the wait staff is always \"good times\" it's definitely one of my fav's.", "author": "DeAnda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "I have previously written about the ownership changes between the old \"Moe's\", and the newest incarnation, \"Mo's\" and the changes in the vibe between the two bars. The new Mo's was okay to go for a drink, but I was not too thrilled as the atmosphere seemed to change.\n\nI recently went back a few times recently, most recently with some co-workers and have to say that the place is showing signs of improvement. There is now a better flow with the staff as opposed to when they first opened - I was surprised that Stephanie the bartender still remembered me even though I have not been around in some time! The ladies I were with enjoyed the sight of the male bartender working that night as well.\n\nThe crowd is now a bit more upscale, urban, lounge-type, but I have to admit that people there were cool for an early evening Friday and was represented by all shapes, colors, ages, genders, and orientations emitting a cool vibe. I was also surprised that Mo's now serves small plates, some of which are quite tasty. I do not know where they manage to squeeze a kitchen and chef in the basement, but the food is not bad!\n\nThe only drawback is that the plates tend to be a bit pricey, the beers not quite as cold as I like, and some of the drinks can get up in price as well, but for an adult scene with nice decor where you can definitely meet someone it is an nice spot to come through and it is improving.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "Mo's has been my go-to spot for years now. I have never been disappointed.  I come alone, I come with dates, I come with friends. I go during the week, I go on the weekends. You can't go wrong with the drink specials and the food has always been a hit. \n\nWhat I like most about Mo's is the atmosphere. I'm really skeptical about where I place my energy, especially if I'm drinking. I always see a familiar face, the bartenders don't give me anxiety and I'm comfortable. I never feel like an outsider like one can feel at many places. \n\nDefinitely come to this place, grab a drink and zone out for the realness of Brooklyn.", "author": "Kari S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Its about damn time! A pub with some diversity. Their drinks did the job, vibe was cool. Honestly I may be bias because my company was amazing", "author": "Valéry P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "I've been here a few times. It's a nice local place. The people are very friendly. they dont take cards, that's my only issue. But the music is on point. Beautiful women. I always have a good time when I go there. enjoy!", "author": "Jeffson G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}