{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "We went here for brunch with a groupon and though it was a little expired, they honored it anyway (very nice). We had the coffee, chicken and waffles, organic eggs breakfast with a side of cheese grits and apple sausage. All of the food was good and our waitress was sweet. The chicken and waffles came with 3 pieces of chicken which was generous! My only complaint was that the cheese grits and the chicken were a little too salty. Once you took the skin off the chicken it was fine but we really couldn't get into the grits like we wanted too. Would definitely go again!", "author": "Azuree M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Chicken n waffle should be the only thing on there menu the rest could be improved but would go for waffles anything", "author": "Jerome B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-02", "description": "I had a good time here at Mo's, however they really need to get a new DJ!! No transitions from song to song. The DJ Didn't know how to move the crowd. \nNice mix crowd, I would go back hopefully they will have a new DJ because I like to dance.", "author": "Kristian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "I love Mo's and you should too.  The owner has made sure to hire the RIGHT chef for a most delicious menu.  He \u0026 the wait staff take special care of the \"regulars\", those of us who have been in the neighborhood and frequented Moe's before it became Mo's.  \n\nChange is a good thing, the food is phenomenal, the two for 1 happy hour is tops, the interior decor step up adds a nice touch.  \n\nMo's is the perfect spot for:\n\nGood girlfriend and sista friend gatherings\nA cozy spot for you and a boo\nGreat food\nGreat atmosphere\nGreat ownership + leadership\nGreat to watch games (as long as the game is not competing with Karaoke, actually the karaoke I could do without totally, would change that for a hot DJ or some occasional live jazzy soul performances)\nIt's SOUL.  As long as Mo's retains it's soul then all will remain good in the neighborhood!", "author": "Una K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-26", "description": "They earn the second star because the price is reasonable.\n\nOur waitress was pretty slow and very forgetful on multiple occasions (probably because she would take orders from several tables at once without writing anything down.)\n\nThe food was sub-par. The menu advertises their chips as \"homemade,\" yet they were the most store-bought chips I've ever tasted in my life. The cheese was hard and tasted like they pumped it out of a gas station in New Jersey and drove it all the way to the bar in a refrigerator before serving it to me.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-19", "description": "Way less diverse than it use to be.  I had high hopes for making the pilgrimage back to the \"new Mo's\" but in all honesty this shit is super basic.  Too many wannabe thugs, \"old school playas\" and people who looked like they were hanging out with their \"black friends\" that night.  Things use to mesh effortlessly in this place but now it just seems like it's trying too hard.  I was here on a Saturday night and its totally feasible that other days/times may be better.  I'd consider it for after work/happy hour but definitely not a late night spot.", "author": "Ivory W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Spacious and good bartenders. This place is a blast. I've avoided going here when it gets cranking late at night: I prefer the mellow neighborhood bar vibe. And, this place offers a great vibe. I sat in on an impromptu Trivial Pursuit match that the bartender started \"just because.\" Winner got a shot on the house. Good deals on beer and a great selection. Plus, in a city with limited seating and closet sized bars, this one has plenty of room to stretch out.", "author": "Timothy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-30", "description": "This place is too small and the service was not good. The bartender seemed very easily distracted and needed more training. This overly developed bartender seemed to be more focused on collecting tips rather than serving drinks. \n\nOne bartender constantly stood behind the door texting while I was trying to get a drink and occasionally would stare at the sports game on tv. \n\nAgain, the place is too small for a dance floor. I was kicked out because I accidentally knocked over someone's drink.\n\nThis is not a place to hook up. The crowd seems to be regulars/stand off ish locals from the neighborhood.\n\nThe music was very good.", "author": "Jae B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-30", "description": "Great neighborhood spot to chill and chat.  The Parole Punch was tasty.  I'm not sure it is cash only in 2013 but...whatever.  The food was decent, nothing to write home about but, it is a bar.  Strange that they played NASCAR on the TV all night in a mostly urban crowd, that likely wouldn't want to watch it.", "author": "Alycia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-08", "description": "Love friday nights with DJ Hard Hitting Harry playing best hits - hip hop, reggae, soca, dance... It can get crowded! Tried to eat here one week night evening, but sat waiting outside for waitress for ~15 min after I waited a while at bar to be told to wait at table outside. Too hungry to wait. I should have just been able to order at bar. Went to Pequena next door instead.", "author": "Veronica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-08", "description": "I first went to Mo's when it was Moe's. Fun times both times though I think I like this version a bit better. Fun, nice place. The food is meh but the drinks are stiff enough and it's great that you can get table service. I gave the waitress a ten and she didn't bring my change back. I had to ask for it. Not cute.", "author": "niesha d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-22", "description": "As a 10+ year Brooklynite who frequented the old Moe's, I was very skeptical of the \"transition\".  After all, I thought the new owners could have at least come up with a new name!  While I made no plans to go back, I decided to give it a try last Sunday night b/c Soul Summit was having a party there.  The venue had overlapped their booking, so when I showed up the comedy show was still going on, although no one seemed to be laughing... Everyone was standing around waiting to boogie.  Eventually the music started about an hour late and the place was fairly packed.\n\nMy main criticism is that the new owners barely gave the place a facelift.  The cushions in the back are were the same old, smashed cushions.  There were some small new booths across from the bar, but I have got to give the new owners a D+ for effort in decorating a \"new\" bar.  They put in little to no effort in the remodel aside from gluing album covers to the wall.  Putting in a couple flat screens is not a remodel...\n\nThe bartenders were responsive and the drinks were decent, but the apathetic and lackluster remodel leaves me disappointed.", "author": "Tadd W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-21", "description": "Mo's is a good spot! Great music! Great staff! It gets crowded!  No cover!! Casual dressy.. Anything you can wear with a wedge or heel! I wouldn't wear flip flops but if that's what your comfy in.. Go for it! You will have a great time! The food isnt bad but this is a spot I go for drinks and a good crowd!", "author": "Miss G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I'm about to give this place the most flattering review I've written thus far. This is only in reference to the brunch. I bought a brunch groupon a few months ago because I live nearby, but upon reading the reviews about this being a great place to pick up women or get drunk not far from home, I was apprehensive to say the least. Generally pub/bars/clubs don't do next-day brunch well and I was worried the place would be dirty from the night before and the food would be sub-par frozen bagels with philadelphia cream cheese. Not the case at all! \n\nThe food was amazing, especially for a place that's known for being a bar. One of the best brunches I've had in a while. The bagel and lox plate was everything it needed to be; the fried chicken(respectable) and waffles(banging!) plate was on point; I even loved the cheese grits and I don't really like grits in general! The place had a good atmosphere and was clean enough. We sat by the window on a rainy, lazy Sunday afternoon. It was just nice and laid-back. The one drawback: the service; the waitress was a little spacey, would just disappear for a long time and kept trying to memorize our order, but it seemed like a challenge, though she did get about 95% of it right. I wasn't that bothered by it, I was just enjoying the food and my company! \n\nI like Mo's so much, I just got another groupon. Oh, another thing, I don't know about this place at full price, but I felt like it was a really great deal for the quality, taste and portions of the food!", "author": "Carla M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-10", "description": "The Indian girl that works at Mo's it RUDE RUDE RUDE ! I have never had a pleasant experience at Mo's when she is working there. She intentionally poured beer on my shoes. She turned the beer bottle upside down over my shoes and the remaining beer in the bottle got on my clothes and shoes. She then had a weird snicker on her face after she did it. If you go to Mo's, DO NOT HAVE HER SERVE YOU !!!!", "author": "roni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "The first time I went there I had a groupon - they didn't skim out nor did they give me any service issue... Ever since then, I've gone back to Mo's 5 other time and they never disappoint....  They have the best chicken and waffle ... Portion was nice and service was great....  Also love their french toast and chicken sausages....  \n\nI can't comment on dinner - I've only tried their brunch..... \n\nWill certainly go back.", "author": "Honest R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-21", "description": "Went in for brunch.\n\nCoffee was warm but not hot. Took over 5 minutes to get a new cup that was reheated in the microwave and served in a cup with a crack in it.\n\nOrdered Breakfast potatoes which were extra since none of the brunch items seem to come with a side. The potatoes never arrived even after being told by our waitress they would be right out. Server was very apologetic but I'd rather have been told up front they weren't available so I could have ordered something else. \n\nGrits were greasy.\n\nThis was the first and last time I would eat here. Food was good but not great and brunch items should come with a side. The server was nice and as I said very apologetic but with a more experienced server all these issues could have been avoided.\n\nMaybe I'm showing my age here but the hostess was texting while standing at the front door. It wasn't busy but still it looked really unprofessional.", "author": "Gregg C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-02", "description": "I had so many good memories of Mo's until this past 8/31/13 when I encountered the rudest, most disrespectful security. People go to lounges and clubs to dance of course and a dance floor would be relatively packed but I guess this bouncer felt like he was the King of Ft. Greene this night, I arrived with my friend from Canada for the holiday weekend. We were able to get into the place no problems (and no cover which is a great plus for this location), able to get to the bar with no real long wait and not over crowded. We had about 2 rounds and proceeded to the dance floor where we were stopped and told we could not go up. I looked at the crowd and was like \"ok I understand we will just wait a moment\". Then about 5 min later a group came in and went to the bar (I know because they were right next to me ordering) then proceeded to the dance floor without being stopped. Me and my friend (a female I might add) approached the dance floor again and again we were stopped with the security saying \" I control this and I am not letting anyone up there\". I looked at him with such disdain but said to myself \"it is a beautiful weekend and there are plenty other spots to go\". I am only writing this review in hopes the staff at Mo's tighten up. I know it is a populated city but this place is for locals and regulars so there is no need for staff to act posh and uppity especially if your only a door man.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-09", "description": "Crazy owners just let one of the best DJs in Brooklyn walk because they didn't want to pay him more money, even though he was the reason so many people showed up. After years of patronage I'll be headed elsewhere on Friday nights.", "author": "Tomika L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-19", "description": "This place is the worst Brooklyn  experience you will ever have. It doesn't have nearly the same charm as the original Moes and tries so hard to be something it's not. The service is terrible and it lacks any charm or personality whatsoever.", "author": "Billy B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}