{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Hi Calvin. Anyhow, I am writing to you to thank you for hiring such a wonderful and personable staff. We adore Stephanie, Sasha, Tyler, Raquel and everyone else who has made us feel welcomed and at home. After a long stressful day, we really do appreciate how your staff takes the time listen and to give feedback and to make us feel so much better. All of this while still catering to your other patrons. We have not been to another bar in quite a long time and that says a whole lot about the quality of service that you expect and provide. Again, we couldn't do without Stephanie, Sasha, Tyler, and Raquel. Even your barback (Deshawn) is super cool and welcoming! Anyhow, thank you for hiring such incredible people and for such a wonderful daily break from everything else. Good night Calvin.", "author": "Robert T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "moe's used to be the coolest, my favorite bar in the neighborhood. \n\nthen they sold the bar and the new owners dropped the e. and then changed the scene/vibe completely. now it's interior looks like your average cheesy lounge.  at nights, it's an urban club that blasts hip hop music and it's blah. \n\nvery sad! i miss the old moe's :-(", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Mos sucks!!!!! Definitely NOT what it used to be!  We were there for 2 hours, ordered drinks \u0026 food \u0026 my girl went downstairs to the bathroom \u0026 they wouldn't let her back upstairs.  The bouncer \u0026 the manager were both ridiculously rude, claiming they were at capacity. Even the waitress was apologizing to us for the crazy.  Then when all 6 of us females said peace out, we're leaving, they got all nice \u0026 said she could come upstairs. 20 minutes of drama for no damn reason! NEVER again!!  Management \u0026 security are complete idiots!!! Do yourself a favor and go somewhere else!!!!", "author": "Margarita P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Great loungey atmosphere. Might be biting off more than interested in chewing if you head here on weekend nights, it gets live. Otherwise, great design, good drinks, reasonable pricing. Never eaten here.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Came for a comedy show, it was pretty good, reasonble price drinks and good food. The experience was overall pretty okay. I would check it out again on a Friday or Saturday night", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-02", "description": "I go here with friends at night. Like the 90's hip hop music, good for the 80's baby's. Gets a little tight in the back ( small dance area). Everyone is usually friendly. Train near by but I think its the G train so might as well have no train near by.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Older crowd but the music was everything! 90's vibe -will be back! Drinks were cheap. Bartender was friendly. Great night with great friends.", "author": "Nandi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "I foresee myself becoming a regular here. The place is laid back, the music is on point, the drinks..WOOO! Haven't tried the food yet but the menu items sounded good. And they have Karaoke?!? It's onnnn...", "author": "Brooke M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "I went here last Friday with my friends/ coworkers. We had a great time. We went there after eating....had a couple beers and danced our butts off. It got crowded like a night club by midnight but the crowd was tame and all about having a good time. I will go back again.", "author": "Kimberley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "Love love love this place!! I've been on a Friday night and a Saturday night. If your looking for a chill bar where you can dance the night away this is it!! Played good hip hop, and reggae....drinks are pretty good too, the rum punch will get you!", "author": "Coralie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "This is a really unique place, a great neighborhood bar. Love the multicultural clientele and the friendly vibe. Definitely one of those rare places that reflects the diversity of the neighborhood in which it is located. You can always find someone to chat with here. The prices are reasonable and they have a variety of entertainment including dancing, comedy and karaoke. Don't take credit cards, but there's an ATM just outside. And now they have food!", "author": "Tony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "Visited Mo's with my boyfriend Sunday, 4/29/12 for an afternoon Bloody Mary... ooohh la la so glad we did.  Happy Hour prices.. 2 drinks for $6~  We had 3 each \u0026 Bloody Mary Buffalo Wings.  Yummy.  Not the best Bloody mary I ever had, but after the 2nd \u0026 a request to the sweet bartender to throw some olives in there they were better!  \nCan't wait to go back! GO MO!", "author": "Toni F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-17", "description": "I came here years ago with some girlfriends and didn't care for it that much. Recently, I past it it with one of the same friends and decided to give it another try. She said that it was under new management. We stopped in to use the \"bathroom\" and scope it out. It was pretty empty with a few people watching a soccer game. No DJ spinning but I cleary saw a space for one. The back walls are decorated with old school records from Chaka Khan to Michael Jackson. We decided to come back because it was early in the night. \n\nAround 12:30 midnight the place was jamm packed. Now I am by no means a crowd lover when it comes to parties or social spots but for some reason, I didnt mind. The crowd was nice and respectful. Everyone was just having a good time. The DJ was on point spinning Hip Hop, Reggae, Old School, Dance, just about everything with a video to go with it! I love DJs that have that! \n\nI danced all night at Mo's and had a blast. I didnt drink though so I dont know their prices r how good they are. Maybe next time but as much as I had fun, it woudnt be a place I would travel to go to. It is something in the area to pop in or possible end your night at.", "author": "Tasha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "After hearing my complaints after dinner, the manager was nice enough to show me some excellent service.  The music was pumping and the frozen margaritas were on point for $5...It was a very pleasurable experience and I recommend a drink or two at the cozy and personable environment", "author": "Edward P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "At mo's it is so packed it's not funny ..., when r they going to stop taking people this is ridiculous  .. About to leave after 20 min. Of being here oh we'll maybe next time", "author": "Seanda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "Went here on a Friday night around 5:30/6 for drinks. I didn't hate it. But I didn't like it either. Casual place to hang out with a bar and some table in front and couches and benches in the back. First off, the service wasn't great. Took me a long time to get a drink every time. It was moderately busy. Their happy hour is 4-7 $4 beers, 2 for $6 well drinks, and $5 margaritas. Drinks are really small so I'd recommended doing a double for $6 rather than two. The food...although it looked good I didn't order bc it was overpriced for what you got. 3 tiny crab cakes for $12. The tiniest wings I've ever seen for $10. I'd recommend trying out one of the other bars down the street to be honest.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "Went on a Saturday night\nCrowd: Diverse and people come to have fun. As soon as the dance room is cleared of a few chairs people dance without any hesitance. \nFood: Bar food with veggie friendly items. All good.\nService: Server (Ashley) was great. Very accomadating and fast. \nEnvironment: Open area bar that leads to a lounge like room that has a dance floor. \nAfter a certain time you cannot enter the lounge without security requiring something. \nDJ: spins mostly 90's hip hop, r\u0026b, soul, reggae, a little house\n\nI would've definitely given it a 4 but one of the security/bouncer's has issues communicating with humans.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "Kara-MO-ke rocks! Great vibes!\na great Tuesday night!", "author": "Scarlet R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Aye...love this spot the crowd is pretty much decent crowd food is ok music as well good place to hang out with friends", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-13", "description": "This place is a meat market on weekends, but in a really obnoxious, not-fun way.  You can cut the machismo laden atmosphere with a knife it's so thick.  The doorman seems bipolar - one time I asked him about a football game and he got really pissed.  Other times he seems laid back.  There always seems to be a different cornball in a blinged-out SUV outside this place with a bunch of low-IQ girls flocking to him.  Also, this place smells like a Hallmark store.  It's not bad, just kind of strange; it's a really strong potpourri scent.  In a nutshell:  The guys here all seem to bench press in their spare time, and the women are the fake nails type.  Seems like a match, I guess.  Also, how hard is it to make a gin \u0026 tonic?  I don't think they even have tonic at the bar.  They're subbing lemon-lime soda for tonic, as if there's no difference.  Come on man.", "author": "Oscar H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}