{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-16", "description": "Cash only...annoying! They no longer serve food :/ (fish tacos \u0026 wings used to be really good) Their drinks are mediocre, nothing special. This place is affordable and can be fun with a group however the crowd ranges from 20s- 40's sometimes even older which can be weird. I liked Mo's circa 2010-2013 nowadays it's just blah!", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "Love this place. Very diverse,mellow kind of place in Brooklyn Historic District. I was impress with the Urban Style Bar. Atmosphere was great, loving the cool vibe. I was invited by Comedian Dave Lester for there Mo's Sunday Comic and laughed all the whole time i was there. Drinks are reasonable and food looked great, didn't know they sold food until it was time for me to go, but so loving this place.", "author": "Nora C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Love Mo's great karaoke when they have it.  great people.  Good drinks.\n\nThey take care of you in there.  It's a great alternative to Habana Outpost when you're not in the mood for the Brooklyn \"mix\" and seeing everybody you haven't seen in ages and don't want to see.\n\nGotta go to Mo's Mo Mo's", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "Ok the music was jumping.  The crowd was beautiful. The bouncers friendly.\n\nThe drunks at the bar not soooo nice.  In about 15 minutes this narrow, galley bar got super crowded causing minor anxiety in this gal.\n\nExit stage left.  Yea I'm too old for this ish.", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-16", "description": "It was like 1am and I was trying to get in this bar. I hadn't had a any drinks and was alone and I definitely look of age (full beard). I had gotten off work late and wanted one drink before heading home. This is a bar I have been too before btw... \n\nANYWAYS, the young Charles Barclay lookin bouncer looked at me and made some excuses and then told me I had to be 25 to enter. I don't think that is a thing...that's a lie. \n\nI know bars can refuse anyone but this reason was BS. One star.", "author": "Luke R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "So I was at Mo's for brunch with a groupon. I was surprised that for a place (according to the other reviews) that turns into a pretty packed bar at night, they manage to create a very relaxed and comfortable dining experience on a sunday morning.\n\nPros: While we did sit at a more lounge type couch with low table, I was with my SO so the ability to be close was nice. There were real tables as well if that's more your thing. The food was also very good. I'd recommend the French Toast, it had a delicious hint of vanilla. \n\nCons: Service took  awhile and the wait staff was a little absent. However I was having a nice time relaxing and enjoying the drinks (our waiter also gave us a free round of Mimosas for the wait). And hey, isn't Sunday brunch suppose to be languid? \n\nAlso, there are large TV's throughout the place which were playing football. We didn't mind as the sound was off, but as we were leaving they turned the sound on LOUD. This would have been a big con if it had been on the whole time. \n\nOur total (without the groupon) for two entrees, two sides and two alcoholic drinks would have been a little over $60.  Though I think you could get away without the sides, the entrees were plenty filling on their own.", "author": "Lydia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "Never again in my mother fucking life will I come to this bar!!! How do you give someone's credit card to someone else??? How??? How does that's happen?? How??? We as a group was already annoyed by the fact that they felt we were with too many men (all law abiding men) Yet, we were kind and polite!!!! These unprofessional ignorant disgusting individuals have the nerve to give my poor friends credit card to another person! They showed no remorse! Never again will I go there! NEVER!!!!!!", "author": "Penelope B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "If i could give this place 0 stars I would. I just left this establishment for karaoke Tuesday and as I was leaving with my friends I was told next time I come I need to drink liquor. The gentleman who spoke to us was very nasty and rude! If it was necessary for me to drink then that should have been stated prior to walking in. I am not a fan of bad customer service and will never step foot back in that establishment again.", "author": "Natalie E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-12", "description": "Mo's a small spot but I love their brunch and wings. I use to frequent the place often but not anymore since they changed management. It's not the same without Xavier :(", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "I randomly visited this place on a Sunday evening for my friends birthday. We wanted to have a shot at midnight and this was the closest place in the neighborhood. The atmosphere is really cool, I call it the \"house party\" because it looks like someones house (In a good way lol) We got there alittle late for the comedy show so we only seen the last act. But even the host helped bring in her birthday with the crowds participation. After the show they played music and we ended up staying the rest of the night! I'll be back again!", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "A friend was kicked out for confronting a man who was sexually harassing her and her friends. Management was unresponsive and disrespectful. Service is also objectively terrible, regardless of the incident.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "While visiting some friends in Brooklyn for Memorial Day Weekend, I decided to stop into Mo's. I instantly loved the place. Something about the atmosphere reminded me of home. There were records on the wall and GREAT music playing (Motown). Went there on Memorial Day to find that happy hour was until 8 PM. 2 for $8 well drinks and $5 drafts. I was pleased. My friends and I stayed there for about four hours. It was my last night in town and Mo's made the experience great. I'll definitely go back when I'm in the area again. Good service, great prices, nice drinks. Can't go wrong with that.", "author": "Ty W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "Doh! Too crowded.  Another miss-categorized spot as this also came up in a \"Dive Bar\" search.  Mo's is more of a hipster lounge than a bar.  As we walked through, it seemed to have a great cast of characters.  Everyone was trying not to be trying to be edgier, cooler, more stylish than the next person.  It reminded me of all the hipsters who started wearing glasses and argyle sweaters many years ago to show they were \"different\" and \"weren't trying to conform\" only to find all other hipsters were doing the same thing, which made them all the same. Very cool decor here though.  We didn't eat here so can't speak on the service, only of my impression of the atmosphere and people.", "author": "MandA R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "I have lived in Brooklyn for the last 5 years and never experienced a more horrific place. We had a wedding at the Brooklyn Academy of Music and wanted to go there for tge after party. Its not only theor racist behaviour thats appalling, its the bouncer who litterally said, \"do you know who I am, I pop you\" when I wanted to sit down 50 yards away on a public sidewalk. world's worst place.", "author": "Kristoffer T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "i went to mo's a few times so i could safely generalize what a typical friday/saturday night is like here.\n\nsmall space, always crowded, hard to get a drink sometimes as everyone is crowded against the bar.  the drink prices are a bit cheaper than manhattan but still pricey.  i can't speak for the happy hours here as i never been.  there is a dj that plays good hip hop and r\u0026b.  the crowd is mostly african american.\n\nthere's a back section but you need to have to at least ordered one drink to get there.  i don't see the big deal, its just another crowded space but i guess you could \"dance\" there.  but its always so crowded that you can't even really move.  i like to spin on my head on a piece of cardboard.  is that so much to ask for?  here you could barely two-step.\n\nthe last time we came here, we did encounter a bathroom problem.  my friend was waiting for the bathroom, which always has a wait, and a girl inside took her sweet time putting on her makeup as everyone outside waited for like 10 mins.  so my friend and her had some words and a fight almost broke out.  later on, we see the girl trying to recruit guys and pointing at her.  luckily i had some friends who could bench SUVs.  so noone stepped up.  but i was ready to pull some hair.  \n\nthen later on, that girl came up to me and we had a nice conversation about her day and what she does for a living.  what a sweet girl.  then when she walked away, she grilled my friend and things almost escalated again.  i'm so confused.  \n\nbut we left without an incident.  great place to chill, good music but a bit too crowded.  oh and they DO accept credit cards.  the doorman, upon entering, told us cash only and i read some other reviews here that said cash only.  but they do.  i paid by cc and saw many other too.  i think their cc machines are new.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Happy hour tap beer and shelf.  , happy hour is good from 3-8. A lot of space in the back of the place . A lot of tvs . Cool music as well. The best day to go is on a Tuesday. Taco Tuesday is crazy. $15 pitchers and all you can eat tacos for $12. Can't beat that.", "author": "Tyson S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "Dope spot, cool place to hang a good time during happy hour.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "i literally made an account JUST to make this review. I came in to mos on a saturday night, music was good and all, everyone seemed to be having a good time. the bouncer was RUDE snatching my boyfriends ID out of his hand. the bartender there short african american woman took my order and as i was turning around asking my boyfriend and his friend what they wanted to drink, she yelled out at me \"YOU HAVE TO TELL ME ALL AT ONCE !!! IM BUSY!\" excuse me ? her attitude was unbelievable ! i didn't even want to stay for another drink but my boyfriend insisted to ask the other bartender at the end of the bar. Spanish gal who i thought would be nasty with me too but she was actually sweet and SEXY ! so anyway my boyfriend stepped out to smoke a cigarette, i received a phonecall from him telling me they would not let him back inside because it was \"too crowded\" after he was already in !!!! drinks and music are good, but that bartender and bouncers ?? ill never go back.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Love this place! Went with two of my friends for happy hour on a Wednesday. It wasn't too crowded and the bar tender was great with making the drinks. Would definitely return as I hear they have brunch on the weekends and jazz on Mondays!", "author": "Laser S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "I really love this place. Good drinks and a good crowd. I went on a saturday and planned on going to another lounge after but just decided to stay because it was definitely a party!", "author": "Aisha M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}