{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Having not been to Fort Greene in sometime, I decided to walk around the old neighborhood to see what changes have taken place. I walked up Fulton Street and during my walk saw some old timers who lived around the Ft. Greene Place area. They gave me the 411 on how things have changed diversely. \n\nDecided to cross over to S. Portland and ran across several restaurant bars and chose to walk into Mo's as I couldn't resist the lively energy. It was a great choice, as the Nets were in the playoffs, and being shown on the few flat-screens along the back of the bar. On a normal day, I could see that the bar is fairly spacious with high-tops along the opposite side of the bar, with enough space for food orders. But on this particular day, it was a tight squeeze just to get to the middle bar area. Everyone I encountered were pretty friendly, someone actually put in my drink order for me. The atmosphere was pumping with the game and the DJ playing hip hop in the background. During commercials they'd turn the music up and people would start grooving and the game would come back, then they'd concentrate on the game. Sports, plus a dance party? My kinda atmosphere. \n\nThe DJ has an actual DJ booth set-up and is located in an upper room towards the back of the restaurant. The walls are lined with album covers and there are comfy chairs and bench seating all around. I ultimately ended up staying back in this room, having my drinks and listening to the music. \n\nI didn't eat so I can't describe the food, but for my time here I enjoyed myself.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-19", "description": "Recently went to Moe's. Me and my friends sat on one of the benches in the back with a small table and apparently there is a \"two drink minimum\" to sit in these seats. This is what our sever told us. Though I planned to order a drink when I was READY, the server came to us twice asking us for our order BEFORE she told us about this \"policy\". It made me not feel thrilled to order anything at all. I don't completely blame her because it seems like this was instilled by management.\n\nAbsolutely a thumbs down in service. We did order drinks but even after this, the check was brought to us immediately. We didn't even have time to think of a second round (not that we really wanted one regardless). I give two stars due to the good music. If that's ALL your looking for, then come here.", "author": "Tiffany P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "In my six years of being a patron here I have never felt so disappointed in management. I went to have drinks to celebrate my birthday with a few friends, as we were behind the front gate that separates it from the public sidewalk a random gentleman came asking us to quite down for his neighbors. We were completely caught off guard but after letting him know it wasnt a problem for us to respect his wishes,  even though were at a bar and didn't know who we was we kept our cool as we didnt see the point in being rude or attempting to argue with him especially since it was my birthday. We then simply asked who he was trying to introduce ourselves and engage with him  being friendly.  He then began to raise his voice and state how long he had lived in the and how he was the owner etc.This was a black Male speaking at black young professionals who were simply trying to turn a weird encounter into a good one. As we began to explain to him we were just asking with intent to have a conversation, another patron came out stating how he is always rude to black people. He then threatened to call the cops on us for simply trying to go on with our night. After stating to him in a respectful tone and manner about how we did nothing wrong and have been patrons before they had weekly events, a dj, and cash bar and we had never experienced a bad situation he began to back off. Of course before he walked off he just had to Express how he appreciates white patrons over black people. I will never support this establishment and I will be reporting this establishment.", "author": "Justina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Mo's is a cool little neighborhood bar/lounge in the Fort Greene section of Brooklyn located not too far from Atlantic Terminal/Barclay's Arena. Been here a few times. Best night to go is Saturday where it gets turnt up. Up-to-date variety of music, nice full bar selection and cool urban decor.\n\nDecent to go to for a nice bar date, happy hour or if you wanna come with a group of friends on a weekend night to let loose.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Literally saw a man punch a woman in the face at this bar and no one did anything or call the police. Oh yeah, also saw a woman give birth at this bar. Wild.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "I used to love Mo's. I've been a frequent visitor since 2007. Always been a cool spot to get drinks, dance and meet cool people any day of the week. The last few years they have gone down hill. The security treats people so badly. They're rude and way too aggressive. It's a bar not a club. Relax. The last time I went I wasn't feeling it at all. I met a couple there who also decided to leave because their security checked them like they were criminals. So not cool and because of their unprofessional security who thinks their correction officers or cops searching criminals, I'll be finding a new spot. Just because the neighborhood is now gentrified doesn't mean you should mistreat people who have supported your business for years. Peace out Mo's so disappointed in you!!", "author": "Miss P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "Do you accept international visitors? Someone with an international ID wasn't accepted to this establishment because their card was expired two months prior. The country has not renewed IDs because they are rolling out a new ID system. The card still shows her age. Her age has not expired. Her age is still the same. \n\nI will not be returning. I live in New York and host friends here all the time. This was my first time but it will be my last.\n\nThanks to all the other clubs with bouncers who were understanding to her plight. Will be sharing same with all my friends and sharing this review on all platforms available to me.", "author": "D A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "They finally accept cards!!!!!!!\n\nOne of my fav go-to bars for years. The music is great and the drinks are reasonable. The staff is always friendly and they have a great happy hour. Would definitely recommend.", "author": "Kahlia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "Mo's seems to be a happening spot, particularly on Friday nights. Yes, the patronage heavily skews black, but they're welcoming to everyone as long as you follow the strict dress code listed on the front door (no sweatpants, flip flops, tank tops, du rags, hats, etc.). They take the dress code seriously (like way too seriously). The place itself is split between a lounge area with couches, a tiny dance area in the back, and a narrow bar in the middle that makes it difficult to move around or stand. Decent whiskey selection and reasonably priced.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "Just came to Mos 30 min before closing and noticed they were closed. Asked to simply stand in the doorway waiting for my Uber that would arrive in less than 2 min and the make shift fat bouncer/security named Max who was afraid to tell me his name,  tells me no that they are closed and leaving in 2 min. News flash fatty, I left before you all left and also you all shouldn't be closed! Per your hours, I guess they don't want all the money my pretty friend and me were going to spend. Trash!", "author": "Sherry F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "When I first started coming here I really loved it. The vibe was right, the drinks were great and the atmosphere was cool. \n\nNow, I really can't say the same. The fact that I have to order outside food is really insane to me. A bar with no food in Brooklyn, like why? I personally don't understand it. Can I get 1 wing?\n\nAnyway, their drinks are also absolutely trash! I literally came from another to restaurant to them, ordered the same drink and almost threw up. \n\nDefinitely not coming here again.", "author": "Valerie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Love This place. Been going here for years! It's a go to spot for me and my friends when we want to just chill and talk. Nightlife is even amazing. But if I can be honest and give this like 3.5 stars, I would. I don't know if it's because of new management over the years I want to say 2014/15 this place kind of just fell off. Stopped serving appetizers and entrees and woke of the waitress and bartenders have off days( and granted we all do) but I don't get it how they all having it at the same time. But when they not having that off day it's a good time there. I don't know, maybe bring back that guy with dreads under his management things was calm. But I still recommend this place especially for afterwork happy hours. Just bring your own food lol", "author": "Zane M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "I don't think Mo's like money, a group of friends (mix of guys and girls) and I went there on a Saturday night to have drinks and hangout. We invited some more friends to come hang with us. The bouncer turns them away at 9:30pm! His reason too many guys not enough girls. Now we're inside shocked because the place is empty. Definitely no more than 20 people. We asked security about the policy we were just met with super aggressive attitudes. So then we asked the bartenders and waitresses, like do y'all not want to make money. She's like yeah why? I'm like why is security turning away patrons we've been here spending plenty money and invite more friends and they're getting turned away cause there are too many guys. Even they were shocked and said that's totally BS.", "author": "David W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Went there w/ co- workers recently and was disappointed..  Lack of wine choices, no kitchen and I had to step on a large water bug.  Do not recommend if you a taken significant other...\n\nJoe", "author": "Joe R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Every night I've been here it's consistent - good music, cool bartenders and a well priced happy hour. Did I mention it's black owned. For those use who are conscious of keeping their money in the black community, buy drinks here. I've never had the food. \n\nThe crowd is mostly black but there is a decent mix. After work the vibe is chill. You can definitely grab a seat at the bar or in the back. On weekends, it gets pretty crowded.", "author": "Melia P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "Sat down outside only to have a drunk regular start a fight with a pedestrian. Few minutes later he starts shit with me. Staff are completely ok with this and prefer his business.  Good to know", "author": "Derek Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Sitting in \"Mo's Bar \u0026 Lounge\" with a shot glass filled with the \"Den of Thieves,\" one-of-a-kind sipping whiskey helped soothe my hump day jitters. And just like clockwork Wednesday's \"Hump Zinger\" commenced. Our host for this event is the comedical legend Dave Lester, with cohost Dara Jemmott. This tag team duo has taken their time aligning an array of comedians from various walks of life to bring the daily political and nonpolitical undertones into a cozy, romantic, comedical setting of pure unadulterated woosah. \nI personally recommend that all people in the tri-city area, of the New York City metropoli, whose officially trekked their way through yet another humpday without coming thru \"Mo's Bar \u0026 Lounge\" to witness Dave Lester and Dara Jemmott's \"Hump Zinger,\" then your doing your malleable slightly docile incoherent funnybone an injustice.  Come on thru in the heart of \"The Den of Thieves\" and have some gut-busting laughs with us.", "author": "Lance A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "Not impressed or disappointed. For me, it's a decent spot with okay drinks and a rustic feel.\n\nI've learned that a certain bartender can't mix a drink to save his life. Scroll through the pics, you'll see a white guy next to a beautiful Asian DJ.....THAT'S the guy you want mixing your drinks. TRUST ME!!!\n\nThe drinks that night really kept me there but that was about the best part of my experience. I plan to give it another go, maybe even today...who knows.\n\nCash and credit accepted.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-08", "description": "I am sure for some people this place is a good time. Not for me or anyone I've ever gone there with. Basically it's like they don't care that much. Drinks are no so good. Place is it so nice. Some people might call it a dive bar but it's not fun like that. I just find the place a little sad but certainly someone else is having a good time in there. Personally for a later drink I'd rather sit at one of the find restaurant bars on the hood like No 7 and of course Miss Ada.", "author": "Marco B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "\"I want to go back!!!\"\n\nI came here with a couple of people after having margaritas at another place. I will say that I had a blast. Although this bar seems to be frequented by Blacks and Latinos, there was a nice variety of folks and the place is pretty laid back and chill. One has to admit with the changing racial make up in Brooklyn, I have noticed that many bars pretty much segregated - not like Jim Crow segregation. I did not really experience that here. Plus, the people, no matter the background, seem cool and easy to talk to.  The bartender, whose name that I forget, working on sunday (Nov 8th) was really sweet and cool. I would order drinks from her any day. I cannot say too much about the place because I had only 2-3 drinks, which is about 45-60 minutes when I am already drunk. I did like what I saw and I definitely want to return.", "author": "Kwame S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}