{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "Mo's is your standard neighborhood bar--good for different reasons for different people at different times. I came here with a group of friends after getting dinner in the area and we were pleased to find our well drinks were $6. The music was fun and there is plenty of space to sit, and two bathrooms. A fine option for a low key drink.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "Mo's is great if you want to get groped by a dude and you speak to the manager about it because the dude isn't listening to you or your friends and the manager kicks you out but the dude gets to stay. super fun!", "author": "Same S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-18", "description": "I live in the neighborhood and walk by this bar everyday.  Today I was yelled at and  cursed at by a man sitting outside of the bar.   I went in to speak to a manager and I was told by the bartender the yelling man is regular and is known to harass  people, she apologized. This is a neighborhood bar and they need to put more effort to keep the neighborhood safe, I wasnt even in the bar just walking by.  \n\nDo not go to this bar unless you want to be harassed, the bar will not protect you .", "author": "Tessa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "I used to dig this place back in 2011 but I'm bored of it now. With all due respect to the 90s, it is dead and gone already. Yet, for whatever reason, the DJs here insist on playing old school hip-hop for majority of the night. Ugh! Like dude, can we come back to the present even for a few minutes? I was waiting for some turn up music or NEW dancehall/soca music to be played at least once and it didn't happen. I guess it is understandable because the crowd is in mainly their 30s to 40s (from what I see anyway). However, there are twenty-somethings who come to this spot and we like to hear more updated music. I find this happens a lot in many of the lounges around this neighborhood as well as the Clinton Hill/Bed Stuy area btw. Like, no...I don't want to hear Mary J. Blige or Biggie on the dance floor AGAIN. Just because of that Mo's gets three stars revoked lol.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "This is a solid local bar. The DJ playing is usually pretty good. The drinks are fairly priced, especially since the area is  \"changing\" so much. \n\nThe bartenders are very attentive and there's a nicely mixed crowed. \n\n*VERY IMPORTANT* - Cash Only! \n\nNice spot to go when you want to go out but don't want to REALLY go out. Lol.", "author": "Tristan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-12", "description": "Updated review of Moe's! I've been here since I was legal to drink. This was the first time in 2 complete years that I visited. I was in school and focused. Now I'm a graduate with a job.\n\nFirst of all, that light skinned HOODLUM with the crew cut has to go. How do you tell people you can come unless you get a drink, then you get the drink, then he says the list closed, and then he lets some dudes in with bucket fitted and a sideways hat on the low. \n\nMy experience was memorable before. But idk anymore.", "author": "E O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "This is a great spot to lounge, go on a date and chill, it can get packed... I've been going there for a little over 4 years now, and since the management has changed DON'T EXPECT TO EAT BEFORE YOU DRINK BECAUSE THEY DO NOT SELL FOOD OR APPETIZERS ANYMORE! The DRINKS ARE GOOD THO AND AMBIENCE IS LIT.... I love the conscious rap, neo soul, old school hip-hop \u0026 r\u0026b and again the drinks....", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-16", "description": "Would give this dumpster 0 stars if I could. Another pretentious bar with RUDE and NASTY bartenders. You're not doing me a favor by pouring me a beer. I'm doing YOU a favor by paying $6 for a beer that cost $1.75 at the deli. \n\nCame here on a Saturday night. Approached the bar. The bartender, a female, saw that I was waiting for a drink. Rather than greet me or say \"What can I get for you?\", she just glared at me as if to say \"Well?\". I ordered a drink and tried to pay with credit. \"Cash only\" she says, apathetically. So I walked out. Last time I'll be coming back. Don't need the attitude, and I will go to another bar and spend as much as I want with my credit card. Thank you.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "So it's a friday night and we decided to give this spot a try. When we first walked up there was a line which was nonsense. I can tell the neighborhood locals go here weekly or just  those like me and my friend who needed a night out. It was packed on the main floor part  by the bar, extremely tight. We went up the stairs and it had a loung vibe. People were standing up but the good thing about it is they have seats around the wall area. The dj was playing the latest hip hop when we first walked in and after a while I was over it. He then went into some r and b, reggae, old school hip hop, a little bit of everything, he had a good blend. I would recommend a friday night here for sure. The drinks were watered down though. Non the less if your looking for a friday night out with friends or just your boo this is a good spot to come chill have a drink and relax. The crowd is mature but not old I'm 36 and I waa happy. I will be going back prob a sat njght.", "author": "T H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Came here last night with my boyfriend and had a great time. We chilled, drank, ate and watched the World Cup.\n\nThis place has a nice vibe. Young (30s) black crowd. \n\nI had the parole punch, catfish tacos, and sweet potato fries. It was great. The parole punch was strong and sweet. \n\nThe waitress was attentive and took great care of my and my bf. I will definitely be back.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Haven't been here in a few months but ambience is amazing and the DJ is always spinning cool tunes in the background . Definitely gets crowded but they have good beer on tap and they don't water down the whiskey . My kinda place !", "author": "Chiquita C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-18", "description": "Came here for a quick drink before our dinner and the place has a lot of character. It was very cozy.\nThey dont accept credit cards.", "author": "Isabel J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-18", "description": "I went with a couple of friends on a Saturday night. It wasn't quite packed yet, which I was pleasantly surprised about because I've been here before and I know it can get crazy. \n\nWe went to walk upstairs but the security guard stopped us and said we had to have drinks to sit there. I was surprised since I've never been told that before and I asked \"wow since when?!\" He said \"since now!\" Wrong answer. \n\nWe just wanted to grab a seat then come back to the bar to order drinks but after that we just decided to get club sodas. As we were waiting to order at the bar we saw several people go up the stairs without drinks.\nThe club sodas came pretty fast but they charged us $3 each! I've never heard of any bar charging for club soda from the soda gun...ever!\n\nWe took the \"drinks\" upstairs and more of our friends came. After awhile another security guard asked us to move seats because he wanted to put our chairs outside. Odd, but no problem since there were plenty of seats. We stayed awhile, our friends bought real drinks and danced a little (the music was good but they were the only ones dancing). \n\nWhen we went to leave we tried to go out of the side door that said \"exit only\" we were blocked and told we had to go out of the front. Which means we had to squeeze past all of the people in the front section, that just irked me. \n\n2 stars because there aren't any lounges in the area and the bartenders are fast. Minus 3 stars for insane VIP-esque sections, rude staff, and charging for carbonated water.", "author": "Renee H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-27", "description": "MO's is typically a go to neighborhood dive bar.  I'm here right now actually, but good lawd who's the waitress with the red hair???? This chick sucks!!!!!! First she's too busy dancing and twerking to service the customers.  Then she gets our order after we chased her down only to forget us and almost walk away with my friends drink still on the tray.  Is she drunk?!?!  Then we place another order.  This chick walks away and never comes back.  Finally she comes back empty handed and asked us if we were OK.  Umm where the fukk are our drinks?!!! I swear she's drunk...  wtf I gave her my credit card and I'm scared.  It's probably in the bathroom or something lmao oh did I mention she asked me for another credit card after I gave her the first one? Yeah MO's ... nah.  Just nah!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "I absolutely love this place. The atmosphere is so quant. It is one of those bars where you can mingle and socialize. No, food but you can have take-out delivered. They also have a folder of take-out menus if you need it. It can get a bit loud, but the music is mainly hip-hop and r\u0026b. Waitresses continuously walk around and take your order. No long line at the bar because of it. Bathroom a bit small, and unclean. Overall a nice place to hang with friends.", "author": "Chasity F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "It saddens me to write this poor review. Ive been coming here for the past 6 months with no problems until yesterday. Apparently you have to pass the paper bag test for entry. If you dont know what that is please look it up. I was literally told that i was \"too dark\" to get in by the bouncer. I wont be coming back here.", "author": "Ayida V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Went on a Thursday night.  Nice atmosphere, and for drivers more importantly - easy to find free parking. DJ was cool. Drinks solid.  Only downside was no table svc upstairs after a certain time.  But small price to pay for the chill atmosphere.  New fave in Brooklyn!", "author": "Mel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "How packed can a place get on a Saturday night? This is not for the claustrophobic.\n\nThey really do pack as many people as they can into this small space. Don't be surprised if you get a drink spilled on you, or get yelled at for standing in front of the waitress station (even when there's nowhere else to stand)\n\nThe plusses are that the bouncer was nice and colloquial. From our brief interaction I feel he really wanted me to have a good time. And the beer was a typical 6 dollars, which isn't bad by NYC standards. I was happy to not be paying $9 for a Corona.\n\nI forgot to mention, if you're a guy, don't go looking to find yourself a piece. The guy:girl ratio is insanely high.\n\nI want to go during the week, to get the full effect", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Dope spot way dope and I only stayed for 20 minutes smdh I'm coming back though for sure", "author": "Tavalyn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "This spot is pretty dope.  We started off at Mullane's to watch the playoff games last weekend but it was too got dang packed.  49er fans were out in full force.  We moved over to Mo's because they had TVs and lots of comfy and mostly empty seats.  We were in the back lounge which was the perfect place for me to take advantage of the Sunday night happy hour.  I got the $6 martini special and some wings and that's all I remember. Then I woke up in bed.  \n\nGood place to catch a game or relax with friends.  The back seating is perfect for groups.  The food I tried was typical bar food but tasty nonetheless and our server was attentive and quick.  I could see myself back here.", "author": "Nisa N."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}