{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Love this place, cool little spot to hang out with friends. big fan of the Blue cheeseburger!!!", "author": "Chanel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "great to be back at mo's and we were generally well taken care of by the staff, but WTF is going on with the ID swipe at the front door? they say they just check your ID and dump the data 24 hours later but they can apparently get much more and aren't necessarily wiping the data afterwards. VERY CREEPY! (then again, i still opt out of the TSA bodyscanners so that tells you something.)", "author": "alexander r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-12", "description": "The weekend party scene. They mix horrible drinks I ordered a Kettle one vodka with a splash of pineapple juice and I got juice I went to the bartender who looked like this was her first gig mixing drinks to have it adjusted and she literally argued with me over it the manager tasted my drink and said the next he will mix. Also they let people in there with Guns don't believe me. On fathers days night there was a guy in there being super loud pretty much looking for shit all night No one addressed him as me and a friend was leaving with some girls we met here comes the same guy walking up the block on the opposite side yelling these niggas with these bitches this and that its a good thing we paid him no mind because moments later he pulled out a huge chrome semi automatic hand Gun fired 5 shots in the air. And to think that he was in there with that gun unstable. They don't search at the Door. Major mistake!", "author": "Jeán-Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "i often enjoy the after work and weekend vibe here.  definitely the place to be for good bar food, drinks and a welcoming crowd.  this am we came in for brunch - WOW.  this was the tastiest flakeist (yep, i made up that word) french toast.  EVER.  this came with a side of chicken apple sausage.  mmmmmmmm :-)   i ordered the bloody mo's and sipped on it with pleasure.  don't sleep on this brunch or you'll miss out!", "author": "c m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "I have been going to Mo's off and on for years and the experience keeps on deteriorating. I went to Mo's last night and they had these ridiculous bouncers like its a club that scan your drivers license into a phone app, which seems crazy to me. Mo's what are you doing with all of my personal info now? You really need my name, address and date of birth just for me to by a drink? Really? The bouncer can't do the math in his head to determine whether a person born in the 80's is over 21? The identity jack coupled with the cash bar (Ft. Greene isn't Williamsburg) have soured me on this place. On plus side DJ was good.", "author": "Flint M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-04", "description": "I went to this restaurant for Brunch on 3/3/2013. I stumbled across a Groupon deal, for this place, and although I didn't purchase the deal I went anyway to try it out. I went with my boyfriend and roommate, and the first impression was decent for us. The spot is really cute and trendy, they played great music.  The waitress was some lady, I can't remember her name, in fact I am not sure she told us her name. But she looked like Hannah from Girls if that helps, lol. we sat at a cool little spot in the back and ordered our food and drinks. I had the french toast with a side of eyes, my boyfriend had the chicken and waffles and my roommate had the Eggs Benedict. The food was great and the mimosas (which aren't unlimited but $6) were great and pulp free which was another play. Everything was going great for a while, we finished eating they cleared our plates (which looking back now, I see that they were trying to rush us out. They keep coming to our table the moment we put a fork or empty water glass down), we paid our bill and continue to chat even though we had paid. My boyfriend was still drinking his mimosa and my roommate was trying to finish up her coffee before we left. The manager or some black guy came up to our table and said \"I usually don't do this but we are really busy (which they weren't), so can you guys finish up and leave\" I was shocked. Such a BAD business call, a paying guest should NEVER be rushed especially if they are still enjoying their coffee and mimosas. I understand being busy and wanting to turn as many tables as possible but to ask your guest to leave is crazy and rude. All three of us were instantly turned off although we started with such positive things to say about Mo's. The moment that happened we were immediately turned off from that place. As we walked out he had the nerve to ask \"how was the food\" I just gave him a side eye and kept walking. All in all its a cute spot, but I don't do rude people.. And I'm giving three stars for the food ALONE... For service and experience I would give two stars.", "author": "Ari J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "Love Mo' French Toast meal for Brunch!  Awesome!", "author": "Racine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "I went on Valentine's Day and I spent the time doing more talking than eating. The atmosphere was very relaxing and just makes you want to kick back and relax. the food was ok, just ok but I would return to try their brunch. The service was decent. NO debit card - that was annoying but at least there is a ATM machine on premises. I look forward to visiting again real soon.", "author": "J W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "Came here for Sunday brunch with a Groupon coupon for 2.  EXCELLENT service and food.  Very generous quantity with this coupon too; 2 drinks, 2 entrees and 2 sides.  I was pleasantly surprised that all the brunch dishes tasted amazing: the bagel with salmon, scrambled eggs, the waffle and the cheese grits...yummm.  This was our first time eating here and will definitely go back.  Our waiter was very very nice.  Bloody Mary's were OK.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "im giving it five stars because i went there on super bowl in 2012 when nyc was playing and won. they had a incredible spread two montors and 3 dollar pabst blue ribbon. i never go to suepr bowl but i was there in hood and had nothing to do and went. spare ribs like three kinds devil eggs and corn bread hot dogs all free . all night. and thing was hwo civilized peple were. like noone was killing for free food. \n i dont eat meat and i did that night. it was crazy... and we won.", "author": "Guygone G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "I was back home in NYC, visiting my family for the Christmas holiday and one of my friends recommended this place. I told her that I didn't mind checking out different spots, but I don't like paying covers, lol....I guess I got kinda spoiled from living in Charlotte for the last few years. Anyways, got here around 10:30-11pm on 12/23, to be exact. The music when we first got there was some old school soul music and it was definitely on point. From looking at some of the people that were there, my initial thought was it was a 40+ kinda spot, but that changed as the night went....guess the older heads left as it got later. Overall, a pretty diverse crowd, and I really liked that. Had a pretty funny experience at the bar. The lady bartenders were looking very good. There was this Laz Alonso looking dude that was working the bar too and when we got draft beers from him, he was charging $6, but when I got my beers from the ladies, they charged me $4.....hmmm, what's wrong with this? Needless to say, I kept getting my beers from the lady bartenders, lol. Overall, people were friendly (not so typical of NY'ers to talk to strangers) and me and my cousin talked with a nice group of ladies that kept getting hounded by some old school dudes....it was pretty funny. The music switched up throughout the night to some recent hip hop and a little bit of soco/reggae. We were able to get some seating near the front. Overall, I had a pretty good time and it was nice to not have to go somewhere in Manhattan to enjoy nightlife. If I was living back in NYC, it would probably be a nice Happy Hour spot for me. Would definitely visit again whenever i'm back in the city.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-08", "description": "If this was Moe's I'd have given it 5 stars. But as this is now Mo's (new owner and all), it's getting 3. I used to go to Moe's--named after Springfield's favorite tavern owner, and with political art such as George W. Bush with his pants on fire. It was a great lounge spot, a nice place to go after the party, a eclectic chic spot with a diversity of people, and a dance spot in the back with a DJ that was always spinning something nice. Since it was revamped as Mo's, the decor has gotten both more chic (wood cut furniture) and sadly typical (flat screen tvs). The crowd is still okay, and I like the new DJ format with the many vinyl album covers along the back wall (though I miss the large projector screen that could be showing Anime or Blaxploitation flicks), but there's a different feel. Moe's music used to range from underground Hip Hop, to 70s Soul to reggae to funk--at least most times I was there. When I last went to the new Mo's, the DJ was mostly spinning anything I could have found in a top 40 list--very disappointing. So yeah, I'll go back to Mo's as a place to stop by if I'm in the area...but the old Moe's will continue to be missed.", "author": "Joey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "I can't rate the actual bar, but I did come here for brunch and it was phenomenal. Like another reviewer, I came with a Groupon, but they weren't confused by it at all. I obviously mentioned it as we were seated, the girl said it was fine, hit redeem, and was very nice about it (I always feel bad using Groupon's, but she was very polite about it!) Everything on the brunch menu looked great, but my friend and I both opted for the chicken and waffles (he got the chicken sausage on the side and I got home fries). When I ordered I joked with the waitress about the size of the waffles (having used to live in Brooklyn and moved out to Manhattan, I saw a drastic decrease in the quality of chicken and waffles) and was definitely incredibly satisfied when I saw them come out. Three pieces of chicken that were the BIGGEST pieces of chicken I have ever seen. So much meat, so moist. And the waffle - buttery, fluffy, perfect. I was so incredibly full and couldn't even finish, when normally I am a huge fatass at brunch. I definitely recommend this place - the mimosa's were pretty good as well and it is right by the G and C lines. Very cute couches to eat at in the back, definitely a fun place for brunch as it is a bar.", "author": "Nikki K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}