{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I love this place. To me, it's such a special part of the neighborhood. If you're looking for  a cool lowkey no frills place to chill, Mo's is it.", "author": "Nika C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-27", "description": "If I could go lower than a 1 I would. The bouncers are horrible and disgusting. I've been coming to this place off and on since 2006. Boy how times have changed. The bouncers have no higher than an 8th grade education and bouncing at Moes is the greatest accomplishment they will ever have. Be prepared to deal with nasty attitudes and any excuse to put their hands on someone.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "They FINALLY take credit/debit. Yay!\n\nMo's is really hit or miss with several things:\n\nThe bartenders vary in skill/drink mixing -- so sometimes you get a really strong, well made drink... other times it's weak or poorly mixed.\n\nThe waitresses are usually friendly, but there just aren't enough of them. Usually there's only 1 when the place is packed.\n\nThe DJs are usually pretty good, but sometimes it seems as though they don't watch or pay attention to their crowd. When the music's good, it's good and people dance the night away on a rather compact dance floor.\n\nI've never had the food, so I can't comment on that.\n\nThey have a decent number of TVs if you're there to watch sports.\n\nThe crowd is interesting. Usually the crowd is mostly late 20s to early 50s African-Americans. More often than not there are several creep 40-50 y/o men with few manners, looking for some youngins, which is just NOT ok. I've seen a lot of couples here on dates, so I suppose it's an ok date spot. Also, there are a lot of regulars.\n\nOverall the experience is never BAD, and there's never a dull moment. I keep coming back b/c it's in the neighborhood and it's just an overall chill spot to go.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "MO's is a great low key spot if you want to go have a drink with a small group of friends with ample seating available. Mos has happy hour everyday! Well drinks and drafts are nicely priced too! The DJ played a variety of music, mostly old school hip hop from the 90s, but it was enjoyable nonetheless . I will definitely come back after work to grab a drink here.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "Bouncer abusive don't go here!!!!!!!! Bouncer snatched my ID out of my hand and threw it in my purse. Proceed politely and tried to talk nicely too him. However he keep screaming and yelling at me until\nManager had to come outside and break it off. He was being verbally abusive. Have been going to this place for year never been any issues. Had to call the police. If you go here come during early hours not night time they have rude and disrespectful bouncers that will treat you like dirt on the floor. Also keep in mind I'm a small woman and he is a 6 foot plus big bouncer.", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Three words: Blue Long Island. I had two and I'm wishing that I only had one\n\nI have no beef with Mo's...the drinks are strong and there's plenty room to sit comfortably.  The music is great as well. I will be back!", "author": "Aziza W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Went to grab drinks with friends on a Saturday night around 9ish.  This was my first time going and had no idea what to expect and I had heard mixed reviews about this place.   There are two sections to this establishment which includes the main bar area and then a back room which has seating and where the DJ spins at.  My cocktail server, Desi, was attentive and was on top of her game.  The DJ was rocking and I had me moving all night.  He was playing some current hip hop and some classic.  He had awesome control of the  crowd and I will definitely be back again for the tunes and drinks.", "author": "Dominek T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "My first and last visit  occurred February 4th during the end cap of Happy Hour. My friends visit this place often and invited me out. At first, we were having a great time and our initial bartender so friendly and accommodating. \n\nOnce he left and as we were getting ready to leave, two of the staffers thought it was appropriate to laugh and participate in the insulting language started by two patrons at the bar regarding my body type and my outfit. \n\nThe situation escalated to the point that we involved management and he told us that there was nothing he could do and that he wouldn't apologize for the behavior of his staff and mentioned that we were interrupting his lunch break and insinuated that we were being paranoid, even though myself and my friend heard the words that were being exchanged. He was so belligerent that he made my friend angry to the point of tears and at that point, we left. \n\nI am a small business owner and I prefer to patronize small businesses. With the plethora of bars and lounges in the city, I have a choice on where I spend my hard earned dollars. Unfortunately, that will no longer happen at this establishment.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "So Tuesday Night all roads lead to MOS!  If you looking to croon on some tunes or just have a good time - Mos is the place!!! People are fine, music is on point and everyone is in a good vibe coming out get your Karaoke on!!!", "author": "Orlando R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Mo's is a great place to go if u want a chill night out at a bar. Good vibes, wide music selection, STRONG drinks! Happy hour is 3-8 mon- fri.", "author": "Bianca B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Sat down for 25 minutes and the waitress never even came over to offer me a drink. Talked to the manager about that experience and he seemed less than caring about fixing the problem. When the waitress finally did come over it took her another 10 minutes to bring me a water but the\"tables\" full of people all around me got wonderful service as she kept coming up the stairs to bring them drinks and offer them more drinks continually.\n\nIt's rather unfortunate because the DJ was incredible and the ambiance is also. Just wish the service actually was about serving people", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "We went to get a few drinks after dinner on a Friday night. The music was good (hip hop, r \u0026 b, old school). It's hard to find space to hang out so go prepared to stand an hold your coat. Around midnight there was a line to get inside. \n\nNot a place to go on a Friday night if you want to be low key and just sit somewhere.", "author": "Jordan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "Moes is a good spot to grab some after work drinks, if you work in the area. (Catch the happy hour specials while you're there )\n\nAnother plus is that you can bring in food from outside bc they don't serve food anymore. Or maybe they do..  Idk..\n\nLate night is ok. Sometimes it's jumping. Other times, it isn't. It can seem a bit packed on weekends due to the size \u0026 the 1 drink requirement to go upstairs; where the dance floor is.\n\nThe drinks aren't the strongest. Not to mention that one time I was served a round of watered down patron shots!\n\nAll in all.. Moes is the ideal place to catch up w/ friends after work. Or a pit stop on a night out bar hopping.. While you're already sauced. Catch a little whine \u0026 dip.", "author": "Keima J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "During a day trip to NYC - My friends and I stumbled into this bar and 4-5 hours later we had thoroughly enjoyed everything they had to offer us. \n\nHappy Hour - BOGO and 5.00 margarita's ***** 0 Complaints\n\nMusic - Nas, Biggie, Lost Boyz, Method Man...****** 0 Complaints\n\nDope atmosphere, seating, and beautiful people on a beautiful late summer afternoon *****0 Complaints \n\nWe met a couple of the investors who came and introduced themselves, the customer service was great and I would definitely go back!", "author": "Hsia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Mo's has been our clutch spot for years. Hip Hop, fun crowds, good drinks. Always clutch.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Great spot in FG, super friendly and healthy pours. Looking forward to stopping by again the next time I'm in the neighborhood.", "author": "Comrade T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "For those of you who work at the hospital, this is a great place to go after work or between shifts. The atmosphere is Friday night, but even on Friday night it's not over crowded.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Good People. Good Vibes. All around. The Daily happy hour is clutch and the crowd is always on point. Mo's is by far my favorite spot in Brooklyn since 2010(Moe's). 7 years and I'm still going back weekly!", "author": "Rob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "I was initially going to rate this place a 4 but with the word that they are now taking credit/debit I had to give this place a 5. The ambiance is never overwhelming and I always have a good time, even brought the New Year in here.\n\n I've had the wings and they were pretty good. One of very few bars that will actually walk to you to take orders even during happy hour. With their BOGO specials, my night out on the town normally begins here when possible. \n\nMusic has never been an issue in this place, crowd is very diverse. \n\nNothing but good things to say about Mo's.", "author": "Barry G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Nice looking bar neslted right in fort green amongst man others. \n\nA friend recommended we link up and she choose this place. I liked the feel of it. I felt real comfortable in there. And the bar maid was real helpful. Told us we had 30 min left of a special sunday happy hour which surprised us. So back to drinking we went. \n\nI have no complaints about this establishment i will return.", "author": "Anthony C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}