{"aggregateRating": {"reviewCount": 233, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "Last night was my first time ever there. The environment was definitely cool on same calm vibes. The DJ was playing the tunes too, easily able to jam to every song with enough room to dance near the DJ. It was spacious as well on some two sublets type of floor plan. The drink was good, I don't prefer the cash only bar though..especially being a millennial I usually don't have cash on me luckily that wasn't the case last night. Overall definitely a place worth starting the night (having a few drinks \u0026 getting into party mood) and/or ending the night (chill night cap vibes). \n\nCon: One thing I didn't like was two staff member hugged up..when one was supposedly was the waitress as said by shawty herself. \n\nOther than that small hick up, it was all good and i enjoyed myself.", "author": "Loren S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "Drinks are decent price. \nNeighborhood bar and dance place that I would go to if my night was cut short or if I'm just bored. \nPlace is full of people who just stand around. The speakers at the place really kill the music. But it's a whatever place with no expectations.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "Very unprofessional staff!!! Avoid this place at all costs! \n\nUnfortunately, this might be the worst bar in New York.\n\nI had family and friends from out of town that I wanted to show a good time in Brooklyn. \n\nWe had a mixed group of men and women, I arrived first with the girls, the doorman checked our I.D.'s and we walked in with no problem.\n\nStrike 1: Tried to walk up to the dance area and we were denied. We were told that we had to buy a drink from the bar in order to go to the dance floor. We came to drink anyway so not a problem at all and we proceeded to buy drinks.\n\nStrike 2: The rest of our friends arrived (4 guys). The doorman refused to let them in because there were no girls with the party.\n\nStrike 3: We sent the girls out to show the doormen that we were altogether, and the doormen told us ok, but they still have to wait. We asked why and he lost his mind! He began shouting, making threats, calling names and using very offensive, derogatory and homophobic language to my friends and family in line. \n\nOf course we all rounded up and left. A total of 10 people, all ready to spend money! \n\nToo bad the doorman was extremely unprofessional and rude. Better training needs to be provided to the staff.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "Came here after a shyte time at Milk River and i loved the change of vibe. The decor was dope and the crowd aas even doper. People drinking, dancing and having fun always makes for a good ass time! The bay window in the back instantly became my favorite spot in the whole place and I cant wait for the weather to get nice so that I can really enjoy it and take it all in.", "author": "Tina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "Went here to watch the NFL conference finals.. the drinks are good and the bartenders super nice and attentive. Jeff and Lexi are AMAZING!!!!  They have food now and it's GOOD! Food stops at 1130 but happy hour is until 8 pm weeksays and 12-4 on weekends. They have a live DJ and the energy is great here!", "author": "Adeshola A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Had a great time here ....in the Heart of downtown Brooklyn...working here for years \u0026 went w/ some friends here drinks \u0026 service was awesome.....we danced, drank then danced \u0026 drank some more ....music \u0026 the vibe \u0026 ambiance \u0026 the whole place I felt so completely comfortable there great night always", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "This is a type of place I would go to for a very specific reason. I like the music, bartenders were very friendly. It's a good space for lounging around as well as dancing. However, I am really not feeling the cash only thing. It's just such a turn off and it was without warning. Apparently this is a newer thing because a friend of mine who drops by from time to time said she hadn't seen that before. In any case, consider yourself warned. They were decent enough to install an ATM by the bar, so I guess it's not completely inconvenient. I ended up only getting one drink because I only had about $12 cash on hand. As a general rule, I refuse to pay to withdraw my money and avoid outdoor ATMs.", "author": "Charisse S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "One of my favorite bars in Brooklyn is located across the street from Mo's so I usually go there to meet up with friends. However, I have been to Mo's a handful of times but my most recent visit the experience was simply phenomenal. \n\nNow when I say phenomenal I mean this place has the most laid back vibe during happy hour. It's a great place to meet up with a friend for some drinks and listen to some good tunes. I was very impressed with the variety of hip hop and r\u0026b that was played while we were here. The bartender was friendly and attentive. There was only 1 television in the front bar area which can be problematic if there are multiple games of interest on at one time. Nonetheless we had a great time hanging at the bar, listening to music, and of course people watching. \n\nI have also been to Mo's a handful of times\non weekend nights. This place gets incredibly crowded. Like literal sardines in a can but it's a fun place and lots of dancing goes on here on weekend nights if that's your thing. \n\nI wound definitely recommend this place for \ndrinks after work. I know I will definitely be back very soon!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Currently my favorite place in Brooklyn but I am starting to see the changes.\n\nGoing to give yall five stars because I used to love you. Going to point on the changes I see in hopes that you will abort mission.\n\nBLACK PEOPLE. BLACK MUSIC. YES. BROOKLYN.\nYou get the vibe: if Biggie was an MTA worker he would go here after work. Its like the best afterwork chill spot there is. \n\nNo food but you can bring in whatever you want! \n\nThe DJ's play music as if you are in a club and you often find yourself losing control and asking yourself why am i grinding at 7:30pm?\n\nHere are the changes being implement that are just completely wack: \nMEASURED DRINKS! - that makes no sense. This is a black dive bar. So what is your Gin \u0026 Tonic is a little extra strong? I don't get it. Horrible\n\nNew Bar Staff - seem VERY square. I like the black girls who never learned to bartend in their life and overpour. Bring them all back now. \n\nOne Drink Minimum to enter the dance floor!! HAHAHAHAHAH I'm just gonna laugh at that one. Dancefloor!? Its two steps higher than the main bar!! One Drink!? ONE!? No comment.\n\nI love mos but its changing. Its one of the few bars that feel like Brooklyn slightly, still. Go quick before its fully gentrified.", "author": "B. L. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Mo's is a great spot for week day happy hour and vibes! I can't believe I was so late on coming here. They have a great happy hour from 3-8 p.m with 2 for 1 well drinks, drafts and margaritas. The DJ spins good tracks (mostly 90s R\u0026B/hip hop/ African etc) , and they have very attentive servers. \n\nSince there is no kitchen I highly recommend walking over to Fulton after and grabbing a burrito or pizza... or eat before you come. Don't expect to sit down and eat, come for nothing less than good drinks and jams.", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "After seeing food reviews on all these posts, I met a friend  for happy hour and went hungry. The waitress said no food is served, just drinks. So not sure if reviews are out dated or if food is only served on certain nights.\n\nHowever, if you like to drink this spot is for you. A steady crowd came in and out and they have an elevated dance/lounge area towards the back.\n\nGood place for convo after work.\nNote: TVs has issues  on the evening I went, which could have impacted the experience of someone trying to view the games, while tipsy. lol.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-29", "description": "Went to Mo's as part of ladies night and besides the fact that it's cash only bar service after 8pm, some drunk youngin zeros in on our table. He felt I was rude upon his approach and thought we all needed to share his disappointment in my unexcitement of his existence. This dude returned to our table at least 5 times and tried to engage us all (including me) in conversation. The \"so-called\" bouncers stood about 15 feet from our table and watched him aggravate us. When we finally had enough and told the youngin  to leave us alone, a shouting match ensued between us (4 Women), the youngin and a bouncer who felt we were being aggressive to the dude (who clearly was a regular). Needless to say after that the rest remains a blur other than another bouncer stood at our table as we gathered our belongings and voluntarily left (as if we were the problem).  Once outside all the bouncers stood to the side as the argument continued with the punk who was now outside.  Clearly the support of regular customers outweighs the safety of women who frequent this establishment.", "author": "Tamara W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-10", "description": "Wow great bartender there!  Great pour and friendly quick service.  This is a neighborhood watering hole with lots of locals in it.  The drinks are pretty cheap at happy hour as well.  \nOkay, now for my rating.  This place is the ultimate in dive bars.  The bar stools have no padding.  They are ripped and repaired with duct tape.  They are sticky.  You get squirted with beer when they pour a cold one.  The bathroom smells and has a two inch crack in the door so people can view whether the bathroom is \"occupied\" or not.  I think I will stop there.", "author": "Douglas A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "Cash Only when they want to be - which is clearly chosen during times of high traffic and volume. The atmosphere is chill and laid back. There are DJs some nights and also Karaoke. No food is served here (though they did serve years ago). Decent Happy Hour specials and the drinks are typically strong. It's cool...for a local spot.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Great time with my peeps! We made a birthday stop at Mos for cake and drinks. Asif was fun and attentive, Chris help set everything up in advance, these guys are awesome. The ambiance and music fit our old school hip hop theme. Great spot for events and an any day hang.", "author": "J G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "Got there to celebrate my sisters birthday at about 11pm. Food already was done being served. When I got there, it was a nice size crowd. My friend informed me that you have to buy a drink to get to the upstairs (dancing area). I'm not the biggest fan of there because I like to come in and see the environment for about 5 minutes and then head to the bar, not be forced into it. So I bought a drink (Johnny \u0026 coke) and there was barely any alcohol. This was the same for the next drink (Long Island Iced Tea). So since the drinks were disappointing me I opted into beers and straight shots. But the bartenders were VERY polite and some also came up to you when your drinks were low and asked if you wanted another. There was a fight that took place that night and it was broken up and the people were pushed out immediately. That was a plus because the night went on as if it didn't happen. I'd definitely come back earlier because I want to taste the food. If I come back in the night then I know what I'll be ordering in advance.", "author": "Kiara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "This place is interesting. Bar vibe. Dj plays a good mix of music. It's a chill vibe. Pretty basic drinks. We were not even given a drink Menu, but was meeting with friends and just ordered a jack n ginger. This is my second time here, but this isn't a place I'd put on my calendar to come to. It was cool, but nothing stood out about this place.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "The bouncer is a racist.  Wouldn't let my older white co worker in because she couldn't find her ID.  She obviously over 50 years old and we were going there after an event for a nightcap.  He had a bad attitude. We were upset, To make matters worse...one of the bouncers friends tried to start a physical fight with my boyfriend outside.  Never again!", "author": "Carla L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "I frequently go to Mo's Bar and always had a good time. However last night I went to Mo's Bar with some friends, I sat on the couch and moments later a huge roach was crawling on me. Another huge roach was crawling on my friends purse. That's completely unacceptable for a bar that frequently has customers coming in, yet has unsanitary conditions where bugs are crawling on people.", "author": "Jimmy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "So we (Me and my good friend) went to Mo's twice in one weekend.  We went Friday night around 11:45pm and stayed till closing.  It was busy.  We went again the following night around the same time and it was more crowded then on Friday.\n\nAtmosphere:  small space,  cool low key type of place.  Wooden seats on one side of the table and bar stools on the other.  A few couches around too.\nBar is long enough and had additional seating. There were  Two  TVs.\n\nService:  real good.    We were waited on two petite ladies.  They were cool.  No problem with the bouncer or dj\n\nDrinks :  A two drink minimum to sit at the tables.\nOur drinks (mango Margaritas in a small glass) were $8. \nStrong Drinks.\n\nFOOD:  There isn't any.  Eat before you come. \n\nMusic:  perfect mixed of old school hip-hop and new stuff.  I think the dj likes kendric lamar lol.  Loved the music. \n\nCROWD:  EVERYBODY Comes here. The\nyoung,  old, black , white,latino, classy and a some ratchetness.  Lol\nWe made some new friends \n\nI am coming back here", "author": "Milly C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mo’s Fort Greene", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gWNAyO54PZsXVdE6-pxgKA/ls.jpg", "@type": "Restaurant", "telephone": "+17187972849"}