{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Drinks on point. Food on point. Atmosphere on point.  Service on point. Can't go wrong here kids.", "author": "Nikki B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "By far best restaurant in downtown Brooklyn!\nThe service is amazing and the food is behind incredible. \nThe manager is always aware of everything, makes you feel special. \nI love the  brunch here it's the best in the city, although I've been going for dinner lately and it as remarkable as I expected. \nI highly recommend it.", "author": "fabio s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Look no further than Colonie for your next (small group) brunch in Brooklyn. I don't even know how to begin describing the biscuits. SO GOOD, even in all caps, doesn't do these beauties justice. The Biscuit Benedict, therefore, is out of this world. We sat at the chef's counter and watched the magic take place, and were not at all deterred by the ingredients or cooking methods - which is saying something for a southern-comfort style breakfast. The Duck Hash was incredible, and we had the fluffy cast-iron baked pancakes to share as an appetizer. \n\nDrinks are delicious, too. Try the cucumber refresher martini and the blood orange margarita. You will thank me (and Colonie)!", "author": "Brielle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "My visit here didn't start off well-- we waited for about 30 minutes, even though we had a reservation.  Finally, the hostess said our \"table\" was ready, and ushered us to the bar stools by the kitchen, whic were clearly not our table, as they had been empty the whole time.  (Plus, just after that, a table opened and she offered us a seat there.)\n\nIn spite of the rough start, I really enjoyed this place.  The seats by the kitchen were pretty cool.  Nice to see the meals being prepared.  I was surprised by how simple the set up seemed to be.  \n\nI enjoyed my wine and the meal.  We had brussels sprouts and burrata as appetizers.  The brussels sprouts were more of a salad.  Not what I was expecting.  Decent, but probably wouldn't order again.  The burrata was great.  \n\nFor dinner, we had bavette (yum) and burger (pretty good).  Even though we were stuffed, we had the donuts for dessert.  Is there anything better than a fresh donut?", "author": "Candis D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "A slice homespun old south meets middle eastern-ish. The shrimp and grits and polenta both we fine but were too soupy. Def try again tho as the service was jovial and the cocktails looked amaze balls.", "author": "Jas. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "If you find yourself in this part of town, you must swing by Colonie for brunch. Scratch that - no better reason to venture to the Brooklyn Heights area. \n\nPhenomenal meal with my favorite type of seating - chef's table overlooking the kitchen. The shrimps and grits were TOP (I don't think I've ever had them with mushrooms!) and the dessert doughnuts can't be skipped. They serve my favorite brunch cocktail as well: a Mezcal coffee mix. Sounds bad, tastes great.", "author": "Morgan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "Nothing they serve here is good enough to warrant the terrible service.\n\nReserved a table, showed up and they said they didn't have a table and instead sat us at the \"chef's bar\", aka in front of a 400 degree oven with 5 guys running around frantically preparing food. Exactly the kind of romantic, relaxed atmosphere you want after a day's work.\n\nThis neighborhood deserves better than bait \u0026 switchers. Don't support this garbage.", "author": "Shah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Great brunch but quite pricy. The duck dish is my favorite. I'm always tempted to order the doughnuts as they are delicious.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Return - Absolutely, BEST restaurant in this neck of Brooklyn (Cobble Hill/Carroll Gardens/Bklyn Hgts/downtown Bklyn/Boerum HIll area)\nAtmosphere (4) - Nice bar, cool greenery in the dining area, nice farm tables. Can get a little crowded in bar area during happy hour. Went there on a Friday with no reservation and got seated in about 45 min (2 people). Mixed crowd - 20s to 60s\nService (4) - Very friendly, attentive\nFood (4/5) - Oysters (4+ - nice pepper sauce), beets (5), burger (4) w/ fries (4+), duck egg (4), halibut (5), heirloom tomatoes (4), pork chop (4+)\nDrink - $8 draft (evil twin), $11 white wine\nCost - $90 before tax + tip.", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Enjoyable time dining in this low-key but classy setting. \n\n-  Bay scallops: Amazing! 5 stars! The seared citrus and green chile coating is innovative and supremely flavorful.\n-  Spring pickles: Bit too pungent for my taste. \n-  Blistered duck egg (with arugula and lots of mushrooms): tasty and good vegetarian option; egg was good but not the best I've had).\n-  Spaghetti in squid ink with rock shrimp: good amount of shrimp and very hearty; sauce certainly didn't lack for flavor, though may be too salty for some palates.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Believe the hype. Colonie checked all the boxes for a great brunch spot. Beautiful space: check. Great food: check. Good service: check. And as a bonus, you don't have to sit on anyone's lap or worry about knocking over your neighbor's table when you stand up. They've done well not cram tables into every square inch, making a smallish space feel rather large. They don't take brunch reservations, but the wait for two on a busy Saturday was only 30 minutes. We ordered the duck hash, which was decent, but lacking flavor. But the real star was the Turkish eggs. They were incredible. We topped it off with the doughnuts, which I would highly recommend. We'll definitely be back to Colonie.", "author": "Alex T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "This place can be summed up in one word - Burnt. The toasts we ordered were burned and it was the bad tasting type of burnt. The burger and bun were burnt and it ruined the taste of otherwise good quality meat. The anchovies on the anchovy toast were the cheap slightly slimy variety - not nice plump white anchovies that would be a no-brainer to any good chef as the type to use (compare with the anchovy toast at Frankies 457).  And the toast was topped with a huge smear of unsalted butter - another incredibly poor choice. The burrata tasted like sour milk. The pork chop was good but the kale it was served with was burnt and it ruined the dish. Colonie is a hit or miss establishment. There are many better restaurants close by: try Beasts and Bottles, Long Island Restaurant, Habino etc.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "The weather was getting nice again, which means Sunday brunch! The wait at Colonie was about 45 minutes, but it was well worth it.\n\nWe were a group of five, and they sat us at the counter in front of the open kitchen. I spent most of the meal marveling at all the things the chefs were making and how delicious it all looked. From my time at the bar, I can tell you that the shrimp and grits were super popular, as was their burger (special of the day). They also bake their biscuits and burger buns in house, which is cool.\n\nSpeaking of, get the biscuits. Just do it. Comes with fresh churned butter and jam. Flakey, buttery, yummy. An order comes with two.\n\nFor my main, I had the duck hash. If you're hungry, you won't be after this. In addition to the potatoes, which are filling, they give you a TON of duck and a poached egg. Spiced just right, very delicious and reasonably priced at around $15.\n\nService was great and quick.\n\nThe only thing I'll fault them for is their coffee. Whatever beans they're using don't seem particularly good.\n\nCan't wait to come back for dinner!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "Three-ish words: Egg Nog Riot.\n\nAnd brunch. And spelt foccaccia. And yogurt and granola. And awesome staff, beautiful ambiance, great wine list, spicy margaritas.\n\nOkay, lots of words, but none of them bad.", "author": "abby s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "From the reviews as well as being noted by Gayot as one of the best restaurants for brunch in the city my wife and I stopped in on a Saturday early afternoon. We really liked the decor and the tenor of the room. Taking a queue from the reviews we ordered the Shrimp \u0026 Grits and I tried one of my favorites the Salad Lyonnaise. We each had a cup of hot coffee and shared an order of the biscuits. The service was adequate but because the room was so busy sometimes we felt abandoned. \nOf the two main plates the grits were by far better especially with the addition of the egg and the wood ear mushroom. The grits were creamy, the shrimp were not over cooked and the mushrooms added a special touch. The salad tuned out to be a little over complicated. The beauty is the contrast of the escarole with the poached egg and the lardons. There was a generous portion of duck confit topping the greens but I just found it got in the way. This may just be my own prejudice in play.\nThe biscuits were a little dry however the butter and delicious fruit preserves made them so much better. My biggest complain was concerning the coffee. Each of us were given a press container which I assume should hold at least a cup and a half if not two. We barely got one regular cup each and the brew was slightly harsh perhaps because not enough water was used. I would like to come back again when things are a little less hectic to see if our experience might be different.", "author": "Martin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "great food, service and ambience. prices reasonable. raw bar fun and cheap. what's not to like?", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Had such a wonderful experience! Front of house was such a pleasure. Sat at the chefs counter and could not say enough wonderful things about Ashley. She was extremely personable and absolutely made our night! The must orders : heirloom tomatoes, the fazalotti blue crab pasta and the sticky date -- WOW! Will definitely be back again for the staff, food and overall experience.", "author": "Bea I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "Mediocre, over-priced brunch places abound in Brooklyn, especially in the Atlantic Avenue / Cobble Hill / Carroll Gardens area. Colonie is not one of them. The interior is truly gorgeous, the cocktails were spectacular, and the kitchen was churning out solid brunch staples at an impressive clip - I know this, because we were lucky enough to be seated at the bar overlooking the open kitchen (highly recommend). We shared a perfect eggs Benedict and a cheese plate while we watched the cooks prepping ultra-fluffy pancakes, goey monkey bread, and serious chicken sandwiches. Everything looked amazing. And their prices are on-par (if not better) than some of the less appetizing options in the area. It's remarkable that $14 can get you either runny eggs and stale croissants at a lesser establishment, or, if you find a spot like Colonie, a truly spectacular mid-day meal that just happens to be called \"brunch.\"", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Had an amazing experience! \nMichelle was our bartender and we had an amazing time! \nFood was delicious, service was phenomenal ! \nWe had oysters, ricotta crostini, focaccia, Brussels sprout, cavatelli and fazzoletti pasta's. Got drinks we recommend the blood orange chili margarita!! \nMichelle was great and we had a great time ! \nDefiantly recommend the place!! \nWill be back soon !", "author": "Yotam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "We recently visited, for the first time, after walking the city and Brooklyn Bridge! Great location for ending your walk. \nThe four of us had a reservation at one of the two front bar tables but we got there early prior to seating and settled at the corner of the bar and stayed there. The bartender was engaging and a true ...mixologist!!! Made the NIGHT interesting! \nWe had the$1 oyster special, lost count. They oysters were fresh and sweet. Our entrees were all good. Fish was creative and excellent. \nWe will return. All though I'm not sure we will make it to the dining room... we had such a great time at the bar. \nRecommend without a doubt!", "author": "Martin B."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}