{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "I like the Gibson here. Crowd tends to be on the mature side of 20/30s. \nWait times can be long but a bar seat is just as fun. \n\nI recommend this place for a cozy drink amongst friends.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "very small place you would not think to go in. However your wrong it's a great spot to have a dimmed light dinner enjoy a beer I personally like Alagash and my favorite date cake.", "author": "Joseph G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "First experience at Colonie.   Not the last. The menu doesn't reflect the flavor combinations. You can only gets so much flavor out of a price of paper so don't base your decision on reading the menu on yelp. Had the whole fish and watched chef Andrew cook it. The broccoli and arugula is possibly the best green vegetable dish I have had.  Not enough room here to give proper credit.  Best part. Staff knows their food, wine and hospitality.  You will not be disappointed.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "Delicious brunch. Normally I like to declare that all brunches taste the same to me because it is essentially the same thing everywhere (fancy eggs and toast) but Colonie managed to make theirs a little more special with dishes like Duck Hash with Slow Poached Egg and Fingerling Potatoes (this was a big hit at our table). \n\nThe biggest problem is that some of the dishes like the above mentioned Duck Hash were way too small and left us feeling hungry enough to order another dish. This in addition to the $4 coffees makes brunch a significantly more expensive meal than it is meant to be. So while I loved the food, I probably won't be back for brunch for awhile. Stay tuned for a dinner review though.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "Extremely underwhelming! I kind of hate when they fancy Brooklyn tries too hard and epically fails but colonie has joined that list.", "author": "L G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Great service but food is just average. Very cozy spot for a date, has a really nice and pleasant atmosphere.", "author": "Tamara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Great staff with great drinks. We sat at the bar and had small plates, and it was great. Not having TVs is a nice change of pace. I found it to be a great atmosphere perfect for socializing with great seasonal dishes. And ask for Brian. He's a great bartender with a welcoming personality.", "author": "Jessie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Went here for dinner with a friend and really enjoyed it. We sat at the chefs counter and watched them cook all of our food which is always fun. The service was great ; because the chefs were right in front of us they were consistently checking in to see how the food was. Our waiter was also attentive and helpful.\n\nMy friend and I really enjoyed our meal. We ordered octopus, liver crostini, brussel sprouts, steak, and doughnuts. The octopus was well cooked, not overdone, and served with potatoes. The brussel sprouts were crispy and served with bacon and dried cranberries. They also had a nice brightness to them. The crostini was good. The steak was cooked perfectly and seasoned simply (but deliciously) and who doesn't love doughnuts?!\n\nThis is a great date spot, it's cosy, the drinks go down too easily, and the food is great.", "author": "Jessica Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "We went to colonie on a Thursday at 7:30 and got seated right away at a table (yes, they are a little close together).  The interior is impressive, warm, comfortable - really well thought out.  I am not a huge fan of open kitchens, and would have declined a seat at the kitchen bar, but it was kind of fun to watch the chefs from afar. \n\nWe had a nice fresh baby lettuce salad: crisp, refreshing, well dressed if a little unexciting - could benefit from some interesting garnish. The roasted cauliflower: very good, big portion, love the capers and sauce - the croutons were unnecessary and strangely very sour. The bass: good - but the nettles and other ingredients creating the \"bed\" the fish was on were sort of muddled and also very sour - way too much vinegar. My steak was very good. The steak sauce was really special. I wanted to lick my plate.\n\nThe date cake desert was delicious - the vanilla ice cream it came with was too salty.\n\nOverall very good but with some flaws that I really hope they can work out b/c I want to love this place. Wish I could give 3 and a half stars.\n\nPrices are a little high for what it is, but if you are celebrating, I guess its worth it.", "author": "Nora P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Absolutely love this spot!  The food is delicious, the service is excellent, and it has a really great atmosphere.  Expect a wait around brunch, but it's worth it!\n\nI love to sit at the chef's counter and see all the goodness they cook up.  You have to try the brunch burger with duck egg.  So scrumptious.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Order the biscuits and thank me later! Had duck hash sans the egg...tasty...initially looks like a bowl of potatoes but there is more duck in there than appears. Still a lot of potatoes so I'd recommend this as a dish to share...especially if you're like me: over concerned about getting your protein...you will not get enough protein in the dish!", "author": "Kameelah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-29", "description": "Okay, I debated between 4 and 5 so just know that although it's not a five, this place is seriously good. Also, this is all based on memory because it has been quite a while since visiting the restaurant (I moved cities).\n\nFirst off, why it can't be a 5 is mainly due to the layout. I went with my friend and her family (all foodies and restaurant people), and we discussed this when they seated us to the side near the window. If they had reorganized some of the seating, there could be room for more tables or maybe overall cleaner space.\n\nThe food is excellent. We got almost everything on the menu and split it between 4 people. The highlight for me was a pork chop. Cooked amazingly, which is a real treat because some places seem to overcook their pork to a point of undesired dryness. The desserts were all delicious, and whoever mentioned the doughnuts, amen. There was even one dish with a side of homemade mayo. My friend despises mayo and even she was able to eat it (it tasted more refreshing and less like you're being punched in the face with a sauce that should taste 100% like mayo, if you get what I mean).\n\nThe service is nice. I don't remember our server's name but she was friendly, not pushy or overly accommodating, and she recommended a good wine when we asked. \n\nOverall, I really cannot wait to go back when I'm in the city. And you should do the same!", "author": "Aya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "I'm not quite sure why this restaurant has such great reviews. I went there last night and ordered the oysters, which were delicious, the mushroom pasta, ricotta crostinis and the brussel sprouts with bacon. Everything was just ok. Based on the reviews we probably should have ordered a meat but the pasta is homemade and brussel sprouts are usually super tasty. The Brussels were over cooked and very dry. The mushroom pasta had a good sauce on it but it was nothing spectacular bc it was pretty much a vodka sauce. The crostinis with ricotta were fluffy and the taste was super subtle. I don't think I'll go back again but if I do I would definitely go with a meat dish rather than a pasta! I sat next to a guy who order the pork chop and he LOVING the cabbage.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "The best food I have had in a long time. Had brunch here. Absolutely delicious! April our server was great!", "author": "Anne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-21", "description": "Colonie is a tasty brunch and dinner spot.\n\nMust complain about service, however.  The most recent time we came the waiter was acting a little odd.  I asked for my eggs scrambled on my favorite duck hash instead of poached, as they are in the menu.  He seriously told me that I wasn't allowed to have them scrambled.  That they had a new *rule*!  I looked crestfallen, and said I'd had the dish that way before.  Then I said I needed more time to pick something else off the menu.  At that point he agreed to bring the eggs scrambled.  Culture shock - I live in the New York of \"Please make my latte with soy milk and half a sugar\" or whatever so I felt really annoyed.\n\nAnyway, the food is good, although the room is loud.  Be prepared to stand up for yourself if you get this waiter and you are particular, like me.", "author": "Kari T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "what beautiful ambiance at this atlantic ave spot. there is a bar with seating in the front windows available, tables in the back and bar style table that overlooks the kitchen. candles, exposed wood, plants and greenery abound. truly lovely. \n\nthe food however, while mostly good, had a few miss steps. \n\nthe first being the crostini. costini was served on fresh bread - not toasted bread. if this was a new trend, i wasnt a fan. \n\nthe second being the $17 cheese plate that came with three mini slices of cheese and a few broken and crumbled flatbread crackers. the cheese was amazing (clothbound cheddar, a raw sheeps milk cheese and the humble pie which was creamy and sweet) but at the price point and considering the vehicle and accompaniments (or lack thereof) made it feel not worth it. \n\nthe kale salad with green goddess dressing was good however was served as massive leaves of kale that you had to cut yourself. this fact really just meant that there weren't enough bites that included all the other good stuff in the salad -  the almonds, the grains - which just collected in a lonely way at the bottom of the dish. a far superior kale salad to similar restaurants in the area but with some tweaking could be much better.\n\nthe snap pea salad was fresh and refreshing - the mint and lemon really shining through on a beautiful seasonal dish. \n\ni loved the roasted veggies - another gorgeous presentation with the roasted carrots with candied garlic and yoghurt.  \n\nthe drinks were great - check out their speciality cocktails.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Great food. Great service. Always fun to sit by the open kitchen and watch the chefs navigate the narrow kitchen. Their pastas are always incredibly delicious and unique and they use high quality ingredients across the board.", "author": "Meredith M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "This place is excellent. The desserts are always superb. The drinks are too. Anything with duck is very good. The steak is always cooked properly.The head chef looks very very young- impressive! The staff is the best in the city, I've never had better service. I know many of them have been working there for a long time (some for two years) which is really unbelievable for service industry. \n\nGo there. Go there for dinner and drinks and then go to montero bar for some karaoke.", "author": "Sofia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Went here for dinner with a group of 4 friends for dinner. Restaurant is bustling and lively with great music in the background, kitchen is open for all to see. Drink menu is extensive and there's something on (or off) the menu for everyone. \n\nThe vibe of the place was certainly lively but not overwhelming. It was a pleasant sort of energetic that you feel at a place like ABC Kitchen, Perla, etc. I suppose the cuisine is very similar to a lot of upstart NYC restaurants, but the dishes are a little more adventurous than most. Food menu is a little small, I suggest looking at it prior to going in case you are very particular. \n\nThis sounds dumb, but when you eat here you really feel like you're in Brooklyn and away from the touristy/bro-y/annoying/be seen types of atmospheres that most trendy Manhattan restaurants have.\n\nOverall - food is excellent, service is great. It's similar to a Vinegar Hill House, but a little less kitschy. I'll definitely be going back.", "author": "Arun J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Went here for brunch the other weekend. My husband and I arrived when they opened, there was immediately a line, but the wait was only 5 minutes. I ordered a sparkling rosé to drink and he had the bloody mary (unfortunately that was terrible). We shared the crostini with ricotta and honey, HOLY YUM, and for our mains had the duck hash and cured trout. Both mains were super delicious! The food was absolutely fantastic, and the service was pretty great too. I would have to say, everything there was awesome except for the bloody, which is so so so disappointing; I hope they change the recipe for that.", "author": "Ariel S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}