{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "One of my favorite brunch places in NYC. love the interiors and atmosphere. Had an awkward waitress on one occasion but otherwise great service. Everything on the menu is great and not overpriced. Coffee was amazing, comes with a French press. Fresh ingredients. Open kitchen. Check. Seriously this is what brunch is all about and colonie NAILS it. you'd think considering NYC is such a food capital that there would be more fantastic brunch places but Colonie really sets the bar and other places need to take note. Definitely worth the trip to Brooklyn!", "author": "Ulla L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-10", "description": "They had a very solid brunch.  Had the Duck Hash and it was awesome; however, my being the lard-ass that I am, I sorely wished for 2-3 more bites when my plate was empty.  It made me terribly sad, and as a group, once we were done with brunch, got fish \u0026 chips from ChipShop a few doors down.\n\nI'll say it, I'm not ashamed to actually want to EAT at brunch.  I've also noticed the smallness of the dishes is a recurring theme amongst other reviewers.  Hm, at least I know it wasn't us!  Or maybe we're all just turning into huge fatties...\n\nAnyways, the place was super cute, and PACKED.  I think it could be a good dinner date option.  I'm willing to give it another try.", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-06", "description": "Came here with my boyfriend, and was seated at the bar. It wasn't too comfortable, but I can't blame them, the place was hopping.\n\nOrdered:\n\nCauliflower - Definitely tasty. Cauliflower was sweet, and the sauce went well with it. The anchovy didn't add to it though, and you have to like capers.\n\nOctopus - Did not love, which was disappointing, because I love a good grilled octopus. The meat was tender to the point of being mushy, and the sauce that came with it did not really mix well. Did not finish.\n\nCassoulet - Solid. Very hearty and flavorful, pretty filling.\n\nDoughnuts - Was alright, a little bit anti-climactic. \n\nBurger - I enjoyed more than my BF, though I like beets and sweet better. Solid, but a little messy and certainly not the best burger I've ever had.\n\nGelato - Pistachio gelato was outstanding. Rich, creamy and nutty.\n\nOverall - Food was ok, enjoyment level varied, but everything ran on the rich and heavy side.\n\nService - Was ok. Food was a bit slow (especially dessert... they took a long time with the doughnuts and the gelato was melting by the time they brought both out). Servers were nice enough.", "author": "Levi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-31", "description": "this place is decorated really cool, I love the vertical landscape on the wall and the open kitchen.  I give it three stars, not because the food was bad, the food was quite good.  But the portions of the small dishes were very small and very pricey.  My friends all ordered two small or vegetable dishes as their main meals and although the food was really good, they left hungry.  I had the large pork dish and its was excellent.  And the burger looked really tasty as well.  The carrot cake desert was fantastic and had little pieces of carrots sprinkled on top!  I hear the brunch is pretty amazing, so I would go back to try it.  Not sure if I will be returning for dinner though.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "I've been to Colonie twice now and been wowed both times.  This past Friday, I held a surprise birthday dinner there for my husband and it was truly lovely. \n\nElise was very responsive via e-mail and helped me selected the perfect wines for prix-fixe dinner, which was great for a large group. She answered lots of questions and didn't make me feel like a pain in butt at all...quite the opposite, in fact.\n\nI would recommend this place for celebrations, large groups and for their all around awesomeness.  We will go back again and again, as there are still a whole bunch of things on the menu I want to try. The date cake was to die for! xoxo", "author": "Erin F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-15", "description": "Literally just walking out of this place and am disgusted by the service we received. Our waitress Courtney refused to take my friends dish off the bill, which she did not even touch. When my friend asked why we were still being charged, she said her manager said she wasn't allowed to take it off the bill since she offered to replace the dish. I done out every night and have never, in my past 7 years in New York received this kind of service. Good luck to this spot!", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "The food is good but I'm giving a bad review because of the service. When I ordered a burger... I asked for the meat to be cooked medium. I finally get the burger and it's completely red.. pretty much rare which is gross. So I asked the waiter to take it back and bring out a medium cooked burger... I cut open my second burger and it's completely red again so we call over another waiter and ask them to cook it well done. At this point everyone at my table is done with their meal. My original waiter comes over and starts to clear off our table and doesn't realize that I am still waiting for my burger. He is completely appalled and says we should've notified him earlier. I'm sorry but isn't it the waiters job to come by and check on his table?!... Well now he knows. So finally they got my third burger cooked just right.. and it was delicious because I was starving but never will I come back to this place again. I would've flipped out if they screwed up a well done burger.\n\nNever again will I come back. It's unfortunate for a nice place like this..,", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "If I lived closer to here I would come here more often! \n\nI came here for brunch with a couple of friends and ordered the Shrimp and [heirloom] Grits. I must say. Full of flavor and aaaaamazing. I was hesitant in ordering because I've never had heirloom grits before but I was really glad I did! They were bigger in size and if I remember correctly doughy in texture. The shrimp fresh and very well made. My other friends got the Duck Hash and Asparagus \u0026 Gruyere Scramble both amazing as well each with its own unique amazing seasoning and flavor.\n\nI love the atmosphere of the restaurant. The open kitchen was very nice and clean. The entire wait staff was very inviting \u0026 courteous. To boot the guys were cute! (what can I say I'm single right now). We noticed that the back end is very fitting for a large party (making note that it will be good for one of our birthday's coming up). I think this restaurant would also have a great night ambiance maybe for romantic dinner or date with girlfriends. \n\nYum.", "author": "Shirley Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Not an A, just OK. \nFirst time my man and I went there, we ordered a few plates to share, thinking they were small enough to do so. All the plates -about six, came out at once and were plonked on our table, filling it completely. Totally inappropriate and almost crude. My husband didn't feel completely inundated as I did. All the waiter had to do, was to take note that we had plenty of food to keep us occupied and quite happy for a while, and then maybe bring the rest later. No such luck. \n\nThe food has the potential to be amazing. A couple of small changes could make the world of difference. Less seasoning - ie, we had an octopus dish that was ridiculously salty. Also EVERYTHING was unusually rich. It was almost as if the ingredients weren't given a chance to stand up for themselves -like everything was just anointed with too much oil, or...? For example, we went a month or so later for a 2nd try. This time we just ordered an entree each. I had the scallops which had beautiful flavours accompanying them but they too were just unnecessarily rich and again, way too salty.", "author": "PJ I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "I waited to try this place a few times before reviewing. I live really close to Colonie and I want to love this place, but I feel like the food is inconsistent. The first time I went, my husband and I shared a few things and overall were really disappointed. We shared a pork belly dish which was all fat (I don't think that this is on the menu anymore), a meat \u0026 cheese plate which was delicious and had a good mix of flavors and a fish dish which was not memorable. We also both got a stomach ache later that night after dinner which kept us from going back for a while. \n\nTheir menu changes constantly so when I've visited again, I've had better experiences. I went for brunch and had the duck hash which was tasty and went for dinner once more and tried the soft shell crab special which was good. The service here is always great and I love the interior especially the little area that they call the garden, which is a bar counter that has a wall of plants that goes to the ceiling.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Love the oysters and the shrimp a la carte. The place is simple and beautiful. We need more of this in Brooklyn. : )", "author": "Michele N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Wow, I mean wow. Colonie delivered everything I expected and more. The atmosphere is the best I've found in New York. I love No. 7, Vinegar Hill House, and the Farm at Adderley, and I found Colonie very similar in that it was warm, friendly, and deliberate in every detail. \n\nWhile the wait was a little on the long side (45 minutes on a Saturday night), we were kept abreast of our seating status on a very regular basis and never had to hunt for the hostess to discern how much longer we would be sipping our delicious drinks at the bar. The cocktails list was small, each drink highlighting a different refreshing component, yet not pretentious in the least. I enjoyed the Cool Hand Cuke. It was a little on the bitter side, but it was so crisp, chilled, and beautifully garnished, I scarcely find it prudent to mention this slight criticism. \n\nUpon being seated in the rear of the restaurant, our waitress approached. She had great recommendations but never an overzealous upsale. She suggested an amazing Rose, and I think Roses are tough. I like very few, but she hit the nail on the head with this one. She offered each of us some suggestion or slight alteration to what we ordered, and each was satisfied with the end result. \n\nTwo of my dining companions ordered the hanger steak and neither left a bite to share. The other had a chicken dish, and she gave it a full endorsement calling it \"not too chickeny\", tender, gently seasoned, and well complemented by its delicate sauce and side vegetables. I ordered the ricotta, honey crostini with basil; a small cheese plate with watermelon preserves, blueberries, and crisp poppyseed crackers; and an AMAZING corn dish. Prior to Saturday night, I had not met a hushpuppy in NYC that even approached \"good\" or even worthy of the name. The two I was served at Colonie, surrounded by cheesy creamed corn, were different than any hush puppy that has ever passed my lips, but I can't imagine one that could be any better. The density was delightful, the sweetness was spot on, and the crispiness highlighted the total delectability. As a serious hush puppy connoisseur, I'd say Colonie took my breath away with their version of one of my favorite treats. \n\nThe amount of attention paid to us by our waitress was perfect. She seemed to know exactly when we needed her, yet she did not hover. It's a difficult balance to strike, especially with the house busting at the seams. I was thoroughly impressed with her ability to keep everyone happy. \n\nThe lighting at Colonie was incredibly lovely. It showed off the rough hewn hardwood floors, the beautifully crafted furniture, and the attractive people that seemed to be everywhere you turn. On a rather hot August evening, the temperature in the restaurant was even perfect, and we were toward the back close to the open kitchen. \n\nAll in all, I'm hard pressed to find anything I didn't find impeccable about my dinner at Colonie. To say I look forward to my next visit would be a vast understatement.", "author": "Brooke Augusta W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "My wife and I had dinner here and were completely blown away. Firstly,  incredible decor. The space is timeless elegance but kinda cool. The service was brisk and polite. All the staff seem to really know their stuff and that's rare these days. The music rocks. Seriously, I asked about the playlist several times  it was that good. Combined with all this greatness comes the food. The menu is so creative. Incredible flavour combinations I can't even begin to imagine how one thinks this stuff up! We really had a great night. I just wished we lived in NYC so we could come again", "author": "Duane F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-15", "description": "Went here for brunch on Sunday. The restaurant had a great ambience, solid menu, and decent wait time (~20 minutes at prime brunch time).  The biggest concern was around their treatment of food allergies. My boyfriend is allergic to eggs. He explained his allergies to the server and ordered the burger without the bun and without the fried egg. When the burger came out it was bunless but was still served with a fried egg. Mistakes happen, but instead of bring out a new burger, the server simply took the egg off and brought out the same patty. Luckily, we noticed bits of egg still on the plate and were able to get a new one made, although that took an additional 15 minutes. \n\nOtherwise, the food was fine. The pancakes and burger are both solid options but not spectacular and not worth the $18 price tag. The coffee was very good, but the main draw is the feel of the space, and unfortunately not the food or the service.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "I live in the neighborhood and Colonie is a favorite. Full disclosure: I'm a pescetarian so can only speak for veggie/ fish dishes. I've heard good things about their meat dishes. \n\nTips: \n-Get there before noon for brunch or wait 30-60 minutes. \n-It's fun to sit at the counter for brunch (or dinner if you have to) and watch them work magic in the kitchen. Sometimes this will cut down on your brunch wait time.\n-Donuts are their \"signature dessert\" but are kind of greasy and not the best\n-Dinner favorites: Gnudi (as a starter), Scallops \n-Brunch favorites: Gruyere Leek Sramble, Cheddar Grits, anything baked (Monkey      Bread, biscuits, etc.)\n-New Year's Eve Prix Fixe/ tasting menu isn't a great value- yummy but left us needing another full meal\n-The music is weird (Hall\u0026Oates) and loud", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "Came here for a lovely friend's birthday brunch on Sunday and had a great time.  It took a while for our table to be ready, but once we were seated, we had such a nice time.  The open kitchen full of beaded chefs was certainly a plus! :) I had the duck hash - - - after a few weeks of eschewing carbs, it was worth cheating on my diet!  And not-huge portions made it feel like a special meal, not a hangover-greasy-spoon  joint.  My friends raved about the shrimp \u0026 grits (and egg!).  The date cake?  Awesome.  The donuts?  Awesomer.  Seriously, I was still thinking about them later in the day.\n\nOverall, great atmosphere, great vibe, very sweet server.", "author": "Anna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "I love this place! Great food, great service! The wine selection is not great, other than that no complaints! We had the squash pasta, Brussels sprouts, beet salad, cheese plate and the steak, everything was delicious!", "author": "Claudia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "3-stars means solid in my book and that's exactly what Colonie is - solid. Actually, they're a bit above solid but I can't give them half stars (as in 3.5 stars) and they don't merit 4 stars...so...\n\nThe service, food, ambiance are all exactly what you expect for the price you are paying. For your stomach to be satisfied you'll need to order at least 2 things off of the food portion of the menu: a salad/small/vegetable + a large. Most of the dishes actually would probably work well to share - although we didn't do that.\n\nThere were 3 of us in our party and we ordered: \n- to start: mushrooms/hens of the woods, wax bean salad and brussels sprouts\n- large: scallops, halibut and steak frites\n\nOf all the dishes the brussels sprouts really stood out although everything was cooked well and had great flavor.\n\nI don't know that I would frequent Colonie but I wouldn't say no if someone suggested having a meal there.", "author": "Jackie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "I went for brunch.  I had the duck hash, which was great.  I had a piece of someone's pancake and that was yummy as well.   Great are made with care too.  It's not a cheap brunch, but you are in downtown Brooklyn/DUMBO.  Kind of par for the course.  I'll be back.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-16", "description": "An interesting experience. We went here for brunch on Father's Day. I was surprised we did not have to wait, however we were seated no questions asked at the Chef's Open kitchen/bar in the back. As a vegetarian it was not the most pleasant atmosphere to see bacon and duck hash and ground beef being formed before my eyes.  Don't they usually say is a seat at the bar ok?  \nAnyways, atmosphere aside,  I can say the buttermilk biscuits are delicious!- and decadent- I expected a little more from the red roasted potatoes and was not a fan of the Beet Ketchup (way too sweet). \n My husband had the burger and loved it. He was actually happy we were seated at the bar, as the regular tables are super close together and it looks like you are on top of your fellow diners. \n Read the very 'noveau American' menu carefully- he ordered a strawberry daiquiri, , not noticing that it was habanero infused tequila  and It was awful -like drinking a glass of Tabasco sauce.  \n The service was attentive but not overly welcoming.  There is not much on the menu for veggies unless you want pancakes that look like you might as well sit on them- portions are that big.", "author": "Tara K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}