{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "One of the best brunch in Brooklyn. \nBeautiful open kitchen, we were sitting at the chefs counter and the staff was friendly and very professional.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-06", "description": "The cocktails and atmosphere is phenomenal.\nThe food looks yummy too and my friend enjoyed her meal.\nSo you are wondering what is the problem?\nWe called ahead to find out if they were gluten-free friendly and they said they had lots of options. WRONG\nThey were not very accommodating and I left hungry.\nI don't expect every place to be able to accommodate me but don't tell me you can when you can't.", "author": "Elisabeth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-19", "description": "Ate here last night and can't say enough about how great it was. Food was fresh, innovative and delicious, the menu unique and presentation beautiful. Had 3 of the vegetable smalls and every one was a favorite. Obvious chef cares about about every aspect of what he puts out. \nStaff so welcoming and waiter soooo knowledgeable, professional and nice. Great recommendations and added to a wonderful dining experience. Going back for Chefs Counter experience.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Delicious.  Great meats and cheeses.  Good cocktails and excellent service.  The entrees were wonderful.  If you have a chance, plan a date night here!", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Got there by chance no expectations! Loved this place for brunch. We had the Turkish style eggs and it was splendid! The burger was extraordinary! The pancakes were a bit dry but overall it worked!\nLoved the simplicity of the menu, the French press, the Brooklyn vibe! Will stop there again when around this area for sure.  Go go go!", "author": "sara s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Playful and intimate atmosphere. Was seated by the bar without a reservation. Food was delightful (cheese and charcuterie platter and brussel sprouts) and the margarita was surprisingly Wonderful! \n\nCheese is sourced from saxelby cheesemonger from Essex st market, which sells American farmstead cheese(cheese produced from milk collected on the same farm). Love that the restaurant is supporting local businesses. \n\nColonie also serves orange wine (you'll have to try it yourself). This has gotten popular lately - it's the second restaurant that I've seen on the menu. \n\nBrussel sprouts were light and very refreshing. \n\nWould recommend.", "author": "Sophia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "One of my favorite restaurants, not only in Brooklyn, but in all New York City. Great location, fantastic open kitchen, attentive staff, and delicious food. My personal recommendation is to start with a dozen oysters, enjoy a small plate, followed by an entree and you absolutely MUST finish with the sticky date cake, it's mind blowing.", "author": "Erik T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Great! Went for a late dinner with my boyfriend and we enjoyed everything start to finish. We began with a meat and cheese board, which had a great selection of each to choose for a board of 3 or 5. He then got steak frites and, after asking our bartender which pasta I should go with, I had the campanelle with escargot. He was pleased with his entree, and while I didn't love my campanelle flavors, I thought it was still a great dish. Just wish I went with another that my palate would appreciate more. ;) \n\nThe ambiance is lovely, and the restaurant is fairly spacious. Would love to go again to explore the rest of their menu.", "author": "Elyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Came here for brunch on a rainy Sunday with 2 guests. The establishment has a lovely decor with exposed brick and lots of natural lighting. Space-wise, it's cozy but nice. The three of us sat at a long table shared by other diners. \nI started with a Bloody Mary which came with a big fat olive and was delicious; nice kick to it. \nFor my entree, I ordered the duck hash and we opted to share the Toffee Monkey Bread for dessert. The duck hash was huge; lots of potatoes, delicious duck, poached egg, and frisse lettuce. I also tasted some of the turkish eggs which were phenomenal - definitely something to think about for the next visit. \nThe Toffee Monkey Bread was a nice finish to the meal. It was very rich so the three of us shared it and it was a perfect portion. Washed it down with french pressed coffee.\nVisiting for brunch? Make a reservation.", "author": "Monique R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "A table of 11 for New Year's Eve, with 2 guests with extreme dietary restrictions, and everything was fantastic! Service was top notch, food was spectacular, and everyone had a ball!!! Thank you!", "author": "Breanne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Went here for happy hour and had a great time. Good drinks, nice wine selection and raw bar. The bar area is small but really nice and relaxed for a Friday night. Waitstaff and maitre'd were friendly. Definitely recommend.", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "We live 39 yards from Colonie. I can't say enough about the chef, the menu or the atmosphere. It's the kind of menu that you can dress up or down, like a good blazer. We went last night. Ordinarily My wife gets one of the pastas (Braithwaite is a master pasta chef) and I ordinarily get seafood. Often I get a fish or the amazing scallops. But last night was different. I ordered a Mountain Medicine cocktail made with Rittenhouse Rye and a pasta topped with saffron and (I think maybe tuna). My wife ordered the branzino. It came covered in what I think were perfectly cooked Shashito peppers and--get this--a cup of shrimp bisque. Just poured over the top. It was phenomenal. \n\nWhile we were waiting for our main course we asked for the Brussel Sprouts and an order of the fries that come with the burger. Not disappointed at all. Because we live so close we've had a full year of the chef's menus to enjoy. I can't recommend Colonie highly enough. It's a pleasure every time. \n\nPictured, the doughnuts.", "author": "Stewart V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Turkish eggs and cacio e Pepe scramble were absolutely delicious! Will come again. We are at the bar and didn't have to wait.", "author": "Robyn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "Apparently there's limited brunch options in Brooklyn Heights, that's the only plausible explanation for such a mediocre restaurant being popular and having long waits over the weekend. We got the duck hash, shrimp grits, and buttermilk biscuits. Our waitress forgot about the biscuits, so we had to ask where it's at. Both main dishes were okay, nothing special, nothing amazing, shoutout to shrimps in shrimp and grits, with a strong ammonia aftertaste that indicates unfreshness. Biscuits were terrible, super dry and fell apart easily, accompanied with frozen butter that I absolutely hate to have at restaurant. What do you expect me to do with frozen butter, put it in microwave?! \n\nLuckily we came in around 11:30 and didn't have to wait.  By the time we left, the line was long and ppl were waiting outside on below 30 degree weather. Personally it's not worth the wait at all, and don't think I'd be back.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Where to begin. We put our names in at 8 and were told that it would be about an hour wait and that they would text us. We went next door for drinks and came back well over an hour later to check the status of our table, never having received any update from the restaurant. To make a long story slightly shorter, we didn't end up being seated until 10:30 pm and didn't get our food until 11:15 pm. \n\nThe service was friendly but completely disjointed and uncoordinated. No one took ownership of our situation or acknowledged that anything was amiss or that they could/should have done better. While waiting, half our group was offered a glass of champagne, but only because they mistook us for a different party of 3 who had also been waiting for a table.\n\nThe food was good, not great. The burrata was heavily laden with some kind of crunchy grit, completely obliterating what should have been a fresh, heavenly texture. Similarly, the cavatelli was topped with the culinary equivalent of a shower clog - a giant mound of chili threads whose flossy texture made it difficult to swallow. Thankfully these were easily removed and set aside, vastly improving the dish which was otherwise good.\n\nBy 11:45 pm the space had naturally emptied, yet we still had to ask two different people for the check. A second server came over to ask if we wanted desert --completely oblivious to how desperate we were to just leave-- and the entire table groaned \"no!\" with what little strength we had left after an unnecessarily long and exhausting evening.\n\nThe coup de grâce came when we discovered the restaurant had automatically included the tip on the bill, which allowed them to conveniently escape the consequences of this soul-draining evening and the false expectations they set for what should have been a normal dinner outing. I understand the practice of doing this for \"large parties\" (6 people?) but it made the entire evening feel like a scam.\n\nMy advice to management: if you can't accommodate a table of 6, simply say so. If you have no system for properly estimating table wait times (give or take a half hour), simply say so. And when you mess up, maybe throw us a slice of bread or an appetizer on the house? Or better yet, a simple \"sorry\" would have been great.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Brunch on a Saturday. We arrived before it even opened and there were people waiting outside. My entire party was not here yet so they said they could not seat us until everyone was here, which is understandable. We were a party of five pregnant ladies. They ended up seating three of us. \nThe server recommended the chicken sandwich special to us. It was good. Portion sizes were good. I ordered the duck hash, filled with tons of duck meat and potatoes. We also ordered the pancakes to share. The pancakes tasted like corn bread. It was good. \nWe enjoyed the ambience. The virgin bloody mary were delicious as well. It took us awhile to give up the table even after we paid. We greatly appreciated that they did not rush us out and continued to fill our waters. Usually, this kind of service is not available during Brunch hours at any restaurant in Brooklyn when there are people waiting for a table. I will come back for dinner to try the dinner menu. We had a good time here.", "author": "Cheny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I really like the interior design of this place. It's really cool and hip. The food is awesome, tho the portion is for single only (not for sharing). Cocktail drinks are good too. I really like my strawberry margarita!", "author": "Cris A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "While an enjoyable experience at Colonie, the food itself did not quite live up to expectations. My friend and I came here on a Sunday and shared the Grass-fed burger and Shrimp and Grits. The presentation of the food was beautiful but the taste was slightly off. The grits had some unique and flavorful ingredients but was overwhelmingly salty. The burger was surprisingly a let down as well as it was overly drenched and too wet. The service and atmosphere of Colonie was lovely but the taste of the food was average.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Colonie is my go to brunch place. I have probably been here at least a dozen times and it never ceases to amaze. \n\nI will be singing their praises for a few minutes, so let me get the minor negative out of the way: they get busy! Which means you may wait if you go with a party larger than 2. With that out of the way, let me tell you want I love: mainly the style and ambiance. The kitchen is 100% exposed with a bar wrapping around it that you can sit at and eat while you watch the chefs at work. If they aren't overloaded, they will even chat with you. They were nice enough to answer questions about what they were making and their technique (in case, you know, you decide to cook at home instead of going out all the time, like me...). The wait staff is friendly and extremely attentive. It seems like everyone who works at Colonie is dedicated to an excellent experience for all their guests, and they never fail to delight.\n\nOk, the food. Its great! Not sure how else to say it, I gave this review 5 stars, didn't I? I've had the Leek \u0026 Chevre Scramble, BIscuit Benedict, Shrimp and Grits, and Burger. All were amazing, always cooked well and from watching the chefs, seemingly at ease. I feel like there isn't much on this menu that isn't good. One thing I will add, my favorite cocktail here is the Empire State Sour, which is no longer on the menu, but can be asked for. I feel guilty when I ask for a drink off the menu, but the bartenders here are awesome and always accommodate. If the Colonie team is reading this, please put it back on the menu and alleviate my guilt!\n\nMy recommendation: go, Go, GO! Stop reading and go. You will not be disappointed!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Cute little place. Went here for bunch on a Saturday with my friend. Got there at 1 and didn't have to wait. Waitress was very friendly, kept refilling our water and didn't care that we talked for another half hour after she gave us the bill. Didn't feel rushed.\n\nFood and drinks are expensive (normal for the area though) and high quality. We both had the Turkish eggs and they were great. Unique combination of spices and the yogurt and bread that went with it cooled the spicyness. Really good dish. Had a mimosa also, tasted mostly like orange juice but it was definitely freshly squeezed. \n\nI recommend for brunch to catch up with a friend! I want to go back and try dinner.", "author": "Marisa M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}