{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "Colonie was a solid B restaurant. My wife and I both ordered the Eastern Parkway cocktail but it had a strong herbal liquor flavor that we didn't enjoy. We started with cheeses and the mushroom pate which were both great! We also had the fried hen of the woods mushroom which was good but nothing special. Last we had the pork chop which was cooked perfectly but was way too salty! Service and decor were very nice. So all in all it was a nice night but don't plan to return.", "author": "Vic M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "So so so good. Another reason why the Brooklyn restaurant scene makes a trip across a bridge a waste of time. Enjoyed the meats and cheeses, loved the pork chop, craved the lamb -- all with attentive service.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Great place for a date night or a dinner with friends. We went with another couple and shared a bunch of different dishes which was great because we could take advantage of the great menu.\n\nFood Highlights: Sea Bass Crudo, Toasts (ricotta and sardine), Lamb Belly, Heirloom Tomato Salad, and Spicy Squid Ink Spaghetti. Would reorder all of those items in a heartbeat!\n\nAmbiance: Perfection. Great lighting, open kitchen, buzzing scene but not too loud or crowded.\n\nHighly recommend and will 100% revisit.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Such a cute restaurant and great for Sunday brunch! Awesome bloody Mary's with just enough spice. Try the shrimp and grits!", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "This was my first visit to Colonie. It was a Sunday, minutes before noon. I had just finished running a half marathon race nearby.  I took a seat at the bar in the very crowded restaurant. Stephanie provided me with the menu/placemat. Soon after, all seats were taken, with a line forming for tables.  I received a glass and a jar of warm water once I sat down. I ordered the grassfed burger which came with bacon and eggs on it with a small side of fries and pickle slices. There was no tv but I enjoyed my meal while watching the hustle and bustle of a busy establishment. There was music playing which seemed to have a rapid beat but it was too loud to hear much of it. The burger was of the small but thick variety. It was enough to satisfy me. The taste was fine.  I noticed many empty nearby restaurants on my walk after.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "My absolute favorite spot in New York City!  Service is always top notch and the food beyond words -- in a very positive way!!\nI love the interior design, from the open kitchen to the stylish bar.  The play urban music here so although they have a fancy style it's still a place I'd feel comfortable going to in flats.  The crostini with ricotta cheese, mint and honey is DIVINE! \nI'd move in here if I could.  I absolutely love Colonie", "author": "Frida G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "I had an amazing experience after not being back for so long. Don't get me wrong I live in the neighbourhood but all the times we've been there the hostesses are mostly arrogant so why should I be spending my money there? This time though, Christine the hostess was so warm and friendly, really sweet. We were looked after by Kyle as well who was ever so attentive. Told them we would be back sooner because they made such a difference to our night. Food was incredible as always! My favourite was the squid ink pasta, it blew my mind and the rest of what we ordered, was great too except the scallops could use a little less salt!! Thank you again Kyle and Christine!!", "author": "Rina O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "It is a very crowded restaurant. We waited 40 minutes to get a table for 5 + 1 kid in cold outside for Sunday brunch. There are a couple of other famous restaurants just by its side but we religiously waited. \nI ordered a dish called Dandelion with anchovies and ... to share with my daughter who ordered a burger for share. Just to let you know Dandelion dish is real dandelion leafs. I called waitress and asked why no anchovies, who pointed to the dish and said the powders were anchovies. \n\nThis is a restaurant for young people who make lots of money who use to boasting of \"unique\" dining experiences, not for people who look for homey and hearty food. Prices are hefty for what you get. Portions are small. Dandelion leafs are for $12, small burger $19, and a dozen of raw oysters $37. Don't miss understand me, foods are great and delicious. It is just not the Restaurant for me.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "Colonie is finally living up to its initial promise. \n\nEverything I said previously is still true: the space is absolutely lovely (the open kitchen an excellent touch), the cocktails are superb, and the staff is excellent (although, my waiter did try and convince me that rye was bourbon for some reason).\n\nThe food seems to have improved leaps and bounds, however, to the point where it matches the rest of the restaurant. You're certainly paying for the privilege, but more than a few dishes are worth the cost. A few favorites:\n\nThe Smoked Ricotta Raviolo. Raviolo is not a typo: you are only getting one, but the flawless, yolk-filled pasta could indeed be worth $14.\n\nThe Scallops. If you've never had sunchokes, this is the dish that will make you love them. \n\nThe Spaghetti Squash Carbonara. Deceivingly listed among the vegetables, this is no side, but a vegetarian main. Hidden underneath a mountain of foam, this could almost serve as an entire meal, and if all vegetarian dishes were this good, I'd give up meat. (OK fine, it has bacon in it.)\n\nPerhaps it's a bit too pricey for a regular evening out, but Colonie has become a fine choice for a special occasion; I only wish I had a few more where I wasn't responsible for picking up the check.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-22", "description": "The service at Colonie my last visit (this evening) was very slow and poor.  We were seated at the front of the restaurant and seen only 3 to 4 times over the course of 2 hours by our actual waiter.  After waiting over an hour and receiving only a small salad which we had asked for as an appetizer, we asked for bread.  This was after hearing the restaurant offered bread complimentary.  Upon asking, we were met with an incredulous look by one of the other waitstaff.  Another waiter brought our 'toast' to the table, which was literally and visibly burned to a crisp.  Prior to even receiving my food I had decided I would not be dining in this restaurant again due to poor service and an unacceptable attitude towards the customer.  I will give credit where due that the food was decent; however I am absolutely intolerant of insulting and passive aggressive behavior towards customers.", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "I enjoyed this place. One of the best restaurants I've been too. I was memorize by not only how good looking the chefs were but seeing them cook. I always enjoyed seeing a man cook. hahaha ANYWAYS! The food was amazing, I had the 1/2 Dozen Raw oysters, Whole Brook Trout, a glass of Rose and for dessert the amazing Chocolate Cremeux.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "One of the best restaurants in Brooklyn! Good scene, good food, a bit pricey. We have seen celebrities here on 2/2 visits!", "author": "James T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "Brought my mother here she's in town for her birthday from Florida .... \n\nThe hostess told us an hour and 20 min wait (it was Friday night at 745pm). Okay, since there was no room to wait at the bar we went next door to a different spot for a drink.  They then called me 30 min later to say table was ready and was I coming back. \n\nSat at table in the front by the window and basically was forgotten about by the awfully rude waitress. Literally had to get up and go to the hostess several times to ask for a server. We explicitly stated we were going to order cocktails and small places first and then order large played after. .... Only server never came back to take our dinner order ! After observing her drying dishes with a towel on the other side of the bar (?????) I got up and went to the hostess and requested a server because we had been sitting there with empty plates, no water, and certainly no cocktails.The server then came back over with dessert menus. No, we didn't even order dinner yet!  \n\nFood was OK but majorly too salty. Watched my feet swell as I walked home last night and woke up with swollen eyes.  \n\nHad the rigatoni pasta, kale salad, burrata. The kale salad needed to be massaged - tasted like grass. The burrata was not soft as it should be, but the spring peas were great and loved the mint, as it added another flavor element. The Rigatoni was unbelievable. \n\nOrdered the duck egg and burger for dinner plates. The duck egg was more mushrooms than egg and gave me an awful stomache; the burger was extremely tasty, perfectly cooked, although the bun was a cop-out and tasted like a Martin bun.", "author": "Rae R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "What a cute brunch spot! Let me preface this by saying that only half our table ordered correctly (50% of my party would most likely give this 2 or 3 stars). The burger is not to be missed (their housemade beet ketchup is unreal!), as are the house ricotta crostini and monkey bread. The biscuits are delicious. I would recommend the Benedict, as one of our guests loved it.\n\nOn to the drinks. You can't go wrong here. If you're looking for a little spice, the chili margarita is delicious, but if you are craving something light and Spring-y, don't miss out on the Cool Hand Cuke- it's to die for (more like a silent killer).  \n\nThe disappointing plates were shrimp \u0026 grits and leek and gruyere scramble. They lacked in both flavor and portion. We also ordered a couple baskets of donuts which only contained the seasonal custard inside and were displeased with both the size and flavor. We were hoping for nutella (as the menu promised). \n\nOverall, I gave it a 4 because I ordered right (burger/cool hand cuke) not to mention the service and ambiance were off the charts. I think we'll all be back, now that we know what to order.", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "The only reason I didn't give this place four stars is the TIGHTLY packed tables/noise level.  It's already pretty loud in here, but the problem is compounded by having only a two inch gap between tables.  I couldn't hear anything the waitress said and had to strain to hear my dining companion.\n\nThe space is very pretty and the living wall is gorg.  The burger was maybe the best I've ever had and the cocktail list is extensive.   Honestly, I may be back to check out their dollar oysters  at the bar, but I can't see cramming myself into one of the tables again.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Thoroughly enjoyed this fun spot, although the food is not exceptional. \n\nColonie is a very popular spot. We loved the atmosphere - lively, friendly, casual. The bar up front is bright with a standing area with a counter to set drinks down on  in addition to the bar with seats. The dining area in the back is dark and bustling. Staff was very friendly both in the bar area and dining room. \n\nThere were six of us so we were able to sample much of the small menu. The small plates, crostini, cheese and meat platters and salads all work well for sharing. \n\nThe food was fresh and fun, but like other reviewers have said, not extraordinary. The beet salad was particularly pretty as the photo shows. We also tried the curly kale crostini and the chicken liver crostini, along with wellfleet oysters, burrata and assorted cured meat and cheese plates. All were tasty, if not standouts. \n\nFor mains, we tried the Blistered Duck Egg, Brook Trout, and several pasta dishes. Pasta dishes were tasty, probably a better choice than other mains. \n\nCocktails though were great, particularly the refreshing Cool Hand Cuke!\n\nOverall, although the food was not exceptional, we thoroughly enjoyed our evening there and would return.", "author": "Linnet T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Has brunch at Colonie on a Sunday afternoon and the place was packed (waited 30 minutes for a table). The food was very good - both the Duck Hash and the Shrimp and Grits were very flavorful and the Pancake was more like a cake but was excellent. The donuts were also good but wouldn't rave over them like some of the other reviewers.  The hostess was very friendly but the service was otherwise a bit rushed.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Excellent neighborhood spot. Had dinner at Colonie and sat at the high tops overlooking the chefs. Cucumber martini and watermelon margarita were superb. I won't get the proper names of the dishes so you will have to consider that if you go. We had stratiacelli (?sp) with barrata, peaches and tomatoes-  excellent.  Also had a great pasta dish and shared the trout. Homemade gelato for dessert. \n\nNY prices but you get what you pay for. Worth the money.", "author": "Laurie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Can't recommend this place enough.  Everything from the food to the ambience combine to form an experience that will have you looking forward to your next visit the instant you take that last sip of coffee or that last bite of pancake.  Colonie is the perfect sanctuary!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "One of our favorite local brunch spots.  Its on the more expensive side but the food is always great quality and delicious, the cocktails are great too.\n\nIt can be a bit of a squeeze if you sit at the open kitchen but its really cool to watch the chefs cook your brunch.\n\nAll the dishes we've tried have been fantastic, my husband loves the duck hash, I have had the scramble, pancakes and burger a couple of times, the monkey bread is to die for and the doughnut basket is heaven.\n\nTry the Cool Hand Cuke, its a really refreshing and different cocktail!", "author": "Erin F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}