{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Place with a lot of character and space. Great waiters and meals. Oysters are a little bit expensive and meals are not so big but I'm a big eater and also a big runner that's maybe why. In few words, you can go without doubt for a date, with friends etcs. It's a great place.", "author": "Steve A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-20", "description": "The WORST dining experience of my life! After waiting 40 minutes to try a meal from this limited, yet enticing menu, we were informed that 3 of the 4 items that we tried to order were out of stock. Interestingly, the lack of preparation for what should have been expected to be a busy Sunday brunch was the least of my problems with this restaurant. We politely address the issue of the sold out food with the manager, which led to the appalling response, \"then leave!\" The food inconvenience may have been something that we were capable of overlooking, but this kind of disrespect caused us to leave immediately. On my way out I slipped on a pile of water in the middle of the floor -- the icing on the cake! It's safe to say that you could not pay me to ever go back to this restaurant, let alone recommend it.", "author": "Leigh W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-19", "description": "I went there for brunch and it was bad! My friend ordered the duck hash, which was good but super heavy and I ordered shrimp and grits. If you want to get a heart attack definitely eat here. There food is start to finish simply butter...no taste, no flavor just butter galore! I didn't enjoy my food at all...loads of butter and that's exactly what I consumed. The service was terrible so needless to say I will NOT be dining here again and if you'd like to live a long healthy life please don't either.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Great spot, had happy hour drinks. Gets crowded but you can still have a conversation. I sat at the bar and people were crushing the raw bar.", "author": "R N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "The brown paper had been in the windows for months.  The lettering alone, along with funding from Kickstarter.com, promised bespoke gentlemen in vests with waxed moustaches, serving Prohibition cocktails under Edison bulbs.\n\nThere are some Edison bulbs, but the big rafters, wall of ferns, and open kitchen offered more.\n\nWe didn't have a reservation, but apparently it was opening night.  We waited for 45 minutes, and eventually were sat in the back after 9pm.  The service was warm and thorough.  They were already out of the rabbit lasagna, wild mushroom crostini, and oysters--all on the list for our next visit.\n\nTo start, we had the ricotta crostini with olive oil, honey and mint--good, particularly so because we were hungry.  We also had the octopus, with fennel, mizuna, apple, and citrus-pickled onion.  The octopus was perfectly cooked, with a smoky flavor, balancing out the bright salad--definitely worth ordering again.\n\nOne of our main courses was the carbonara, with tonnarelli, guanciale, parmesan and egg.  The guanciale (pig jowl bacon) elevated the house-made pasta with bright apple and pepper flavors.  We also ordered the pork, with mustard-apple sauce and buckwheat spaetzle.  Perfectly cooked but underseasoned, the pork was the strongest part of the dish--the spaetzle looked burnt and was much drier and smaller than the Hungarian variety I've had in the past.\n\nWe ordered the fois gras donuts with cherry sauce for dessert--a high-end twist on a zeppole, the fois comes through as a delicious, subtle note.  A great ending; if only there had been actual cherries in the sauce.\n\nEven though there were some missteps, this place shows serious promise and is a welcome addition to the neighborhood.  The full bar and ambience makes it one of the nicer, more elegant choices when taking a break from Pete's or La Mancha.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Try and get kitchen seating. It's more fun and can be interactive. Chicken is a really strong dish as well.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "We've now had a few stellar meals at Colonie - it's become one of our go-to's in the neighborhood when we're looking for a nicer meal.  The food is delicious, the service gracious, and atmosphere perfect whether you're celebrating something or just looking for a nice dinner.\n\nMost recently, I can't say enough good things about the fig crostini or the donuts for dessert.  I've been pregnant the last few times, so while I've had to eye the cocktail list longingly, my husband reports that his samples have been tasty, and the wine list quite good.  I've enjoyed that they leave a water bottle on the table...\n\nWhat I love most about Colonie, though, is sitting at the bar in the back.  Sure, you're a little cozy with your neighbors, but watching the ballet that is the kitchen preparing meals is a ton of fun.  Seeing all those plates just made me want to try everything... We'll certainly be back.", "author": "Kelli N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "I don't think words can describe how phenomenal this place is so let me break it down for you. My sister had been dying to try this place, so after watching a movie at the nearby theater this past Sunday we decided to try Colonie for dinner with our husbands. We weren't starving for dinner yet and wanted to have a few drinks down the street at another bar. Though the restaurant does not take reservations, the hostess Chelsea offered to take my sister's cell phone number and call us in about 45 minutes to let us know how busy the dining room was getting. I honestly didn't expect her to call, but low and behold exactly 45 minutes later she called! She told us that they were now on a wait and it would be approximately another 25-40 minutes for a table. No problem. We decided to stay at the bar and have another round of drinks since Chelsea so graciously offered to call us again 10 minutes before a table would be leaving to give us time to get over to the restaurant. And what do you know, maybe 15-20 minutes later that sweet Chelsea kept her word and called us to let us know we could head on over. We walked back over to Colonie, were greeted with warm and friendly smiles and hellos, and were seated promptly. Chelsea, I'm seriously considering calling up your restaurant and speaking with a manager to let them know how amazing you were. You went above and beyond front of the house expectations. We hadn't even stepped foot inside the restaurant yet and I could already tell this place was going to be great! On top of that, every person in that restaurant was just as courteous, prompt, and friendly. The service that night could not have been any more perfect.\n\nOk, now for the food and drinks. The four of us ordered signature cocktails which were delicious and packed a punch. I had the Cherry Oh Baby and oh baby would I drink it again. The ricotta crostini and clam crostini were so scrumptious that after we devoured them we ordered a second round. My sister, my husband, and I ordered the steak, while my brother in law ordered the fish entree. He devoured his, though commented that it was a slightly smaller portion than ours. The steaks--oh my lord. Perfectly cooked, perfectly seasoned, and the fat melted in my mouth. The homemade fries were divine and I'm ashamed to admit that I ate my entire little bowl of garlic aioli. The baby greens topped with vinaigrette was the perfect addition on the plate as it cut through all the richness of the steak and fries. As for dessert, my husband and I shared a strawberry tart and I'm still bitter that I just didn't order my own because, well, it was that damn good. My sister ordered their seasonal cherry clafouti, and being half French myself it may not have been the clafouti my own grandmother made, but it was warm and gooey and decadent. My brother in law ordered the sticky toffee cake and one bite had me blown away. Seriously, the entire two hour meal we had consisted of oohing and ahhing over the service, the ambience, and the exceptional food. I don't live in Brooklyn, as we were visiting from eastern Long Island, but my sister and brother in law eat out at fine dining restaurants a lot and they both exclaimed how this was probably the best restaurant they've ever eaten at in Brooklyn. Colonie, I can't wait to come back.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "The food is very good and the cooks do a great job behind the open kitchen. The wine from Long Island is also quite good, but wouldn't go for the international selection which is average. The deserts are absolutely worth it. One negative - the service. Just not nice.", "author": "Margarita I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Hands down the best restaurant in Brooklyn Heights.  Great scallops.  Great beet salad with ricotta salata.  I probably get it every time I go.  Honey ricotta crostini is also amazing.  As is their soups.  And brussel sprouts.  \n\nAnd at brunch, get their toast with eggs and mushrooms.  It's so so good.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "A great edition to the neighborhood, this new American gives a funky edge to seasonal home cooking.  The place has perfect atmosphere: gorgeous setting, vibrant people, and terrific music.\n\nI went there for brunch on Saturday, and again for dinner Sunday night.  Both times, the place was packed (even at 11pm).  People were eating at tables and at the counter, and drinking an laughing at the bar.  Service was gracious and prompt at all times,\n\nThe Food:\n\nNew chef Alex Soronson is off to a great start, serving familiar flavors in a new, vibrant way.  (By the way, the brunch eggs deserve an award form Wylie Dufresne).  Unfortunately, there are still some kinks to work out.  Alex isn't sure how to let the food speak for itself, and perhaps isn't confident enough to send dishes out without a clashing accompaniment.  The sauces are a particular problem (texture and flavor), as are the ubiquitous addition of a single misplaced ingredient (dill, really?).  Overall, none of this detracts much from a thoroughly enjoyably dining experience. \n\n I expect this place to keep packing 'em in for years to come.", "author": "Buckner G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "*I am vegetarian.  That might be why I liked this place less than others.*\n\nMy friend and I tried Colonie about a week after a glowing NYTimes review on the place.  Consequently, it was jammed with 20-30 somethings - some on dates, some alone, some in groups of 4 or 5 or 6.  Nice people, no complaints about the crowd.\n\nWe had to wait for a table and contemplated watching soccer and having a pint next door but opted to walk down to the Brooklyn waterfront to check out the newly opened section of Brooklyn Bridge Park with a Manhattan skyline backdrop.  The sun was just setting.  We made the right choice.\n\nThe poor hostess was doing a good job of trying to keep all of the clamoring parties aware of their place in the queue and sipping beverages while they endured a bit of waiting.  She was good at estimating the wait time - uncannily good.\n\nWe sat overlooking the kitchen, which I recommend.  These line cooks are the picture of quiet amidst a storm.  Nobody was in the weeds, not even for a minute, not even with the pressure of a glowing review to uphold, not even amidst a night in which the place was swamped and not even because the space they were in forced them to behave like a moving human jigsaw puzzle.\n\nI am a vegetarian.  This is a place that serves most dishes with meat.  I got the kale salad with radishes and cherries, the potato leek gratin, the ricotta crostini, and the sticky date cake dessert. Here's how that all broke down:\n\nRicotta crostini:  the ricotta is excellent, pillowy, fresh, not too heavy.  I could have used more sweet, but then, I have the biggest sweet tooth ever.\n\nKale salad:  as expected, except for the cherries which I'm not sure I liked with the kale.  Needed something acidic to offset the heaviness of their sweetness, at least.\n\nPotato leek gratin:  This is served with bread crumbs on top.  It was far too buttery - it appeared that there was about a quarter cup of melted butter swimming around at the bottom.  The cheese-breadcrumb layer was gummy rather than crisp. I realize gratins are going to be buttery and I generally don't order them. But as a vegetarian who wants more than salads, I didn't have much else to choose from.  I didn't finish it, not even close.  \n\nSticky date dessert:  this is served with creme fraiche ice cream and burnt caramel.  It is a five star dessert.  I highly, highly recommend you leave room for this. Even if you only have three bites of room left, order this and have your three bites.  It's worth it.", "author": "Laura N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-26", "description": "I lived three blocks from this fabulous spot and glad to say this was my last \"stay-cation\" meal in NYC. All of the food is excellent [though I wish I had more healthy options on the menu]. Fried brussel sprouts and tomato salad were delicious - I personally loved our tile fish and papardelle pasta. Good ambiance and clean bathrooms. Don't bother with bloody M - go straight for the vino here.", "author": "Heather F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Came here Thursday at 8:45pm with a friend and was told there would be a 45 minute wait.  We walk maybe 7 minutes down the road, and they call saying there's seat at the kitchen.  It was a bit hot there, but it was fun figuring out who was on garnish, expediting, etc.  \n\nWe got the sweet corn over polenta with lime and hush puppies.  It needed a bit of heat, but it was flavorful.  The hush puppies got a little soggy, but they were authentic.  The ricotta gnudi were pillows of heaven with what is the first time I have ever tolerated olives and sweet tomatoes. The octopus was great with fingerling potatoes, but a little too heavy on the capers.  Once again, the menu was a little misleading.  Chorizo was listed with the octopus, but it was in the form of a broth.  I thought it was wonderful, but not expected.  \n\nThe music settled down by 10:00, but was still loud when I first walked in.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-13", "description": "Went for Brunch, actually got too much food, so I'm not sure which plates are the \"too small\" plates. I had the eggs benedict on a biscuit and my boyfriend had the duck hash. Both were delicious. I also got coffee, which I enjoyed out of a personal French press. \n\nIt was a bit awkward when we first walked in, the hostess was a bit nonchalant and looked at us like we might be tourists and wasn't it cute that we wanted to eat there. (We actually live around the corner - maybe it was because I was carrying an umbrella..?) She asked if we wanted the \"kitchen counter\" or a table and, being confused by the \"kitchen counter\" situation I just said table. I was glad, because the folks sitting at the counter seemed to feel a bit awkward.\n\nThis is one of those places where you end up sitting very close to the other patrons because the tables are close together in a small space, but I don't really mind that. \n\nIt was a bit expensive, but we enjoyed the food, did not have any trouble with the music being loud (it seems like every Brooklyn restaurant has reviewers complaining about \"thumping\" music at all hours of the day...not sure what that is about!) and we really loved the decor - lots of greenery. \n\nWe have considered going back for dinner a couple of times but the menu seems very limited and quite pricey.", "author": "Kaitlin U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "I was excited my friend randomly called me to go celebrate her recent promotion at La Colonie. I had driven past it multiple times and always wanted to try it. \n\nLa Colonie was a fantastic place to got to for an impromptu celebration on a Monday night.  The food met my expectations, the ambiance is nice and comfortable, and the service was on target.\n\nFood:\nSt. Simone Oysters: You can't really go wrong with a delicious salty burst in your mouth, but I must say they were nicely shucked.\n\nAppetizer:\nDuck Egg: This was actually my least favorite item we ordered. The turnips were pickled and didn't go with everything else on the plate. \nOctopus:\nDuck Rillette: One of my favorite things we ordered. It felt rather light and refreshing despite the fact the meat is cooked in its own fat.\nRaviolo: Another hit! The egg yolk pulled all of the other ingredients together. The pasta itself was nicely cooked. \n\nMains:\nScallops:\nSkirt Steak: Cooked perfectly rare. It was a bit sweet but the meat was tender and delicious.\nBrussel Sprouts:\nCauliflower: Romanesco cauliflower is beautiful. We suggested that they say it is Romanesco on the menu. The anchovies and caper added the right amount of salt. \n\nA bottle of some affordable Gruet and some wine....\n\nI will definitely return!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-03", "description": "It is just not good anymore... Poor staff, rushed,food cooked at wrong temp.  Just not worth it - too many other places around...", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "Yum! Drinks, apps, entrees, bread and butter and radishes - it's all really good. And the service and atmosphere are great too.\n\nThe above was meant to describe Governor (sister restaurant to Colonie) but since I can't edit the restaurant name here- you should know that Colonie is awesome as well. Highly recommend their brunch...", "author": "Little R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "I just don't know. I really want to love this place but I just can't. The cocktails were awesome and so was decor. I would say the food was great but it took an hour just to get our cheese dish and then another half an hour just to get the appetizers we ordered for dinner. I maybe would understand if they were making a 3 course meal but to wait that long for such small, simple dishes was upsetting. Waitress and manager couldn't be more nice but I doubt I will ever come here again. Too bad.", "author": "Jena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "It's so charming here. A nice big bar area in the front and an open kitchen in the back this place feels welcoming, clean and refreshing. \n\nThe food is basic meat and vegetables and that exactly how the menu is set up. Raw, cheese, meat, salads, entrees, vegetables. The steak was full of flavor and served with yummy fries. On a more recent visit we had the gnudi was amazing, full of cheese, light and creamy served with tiny little tomatoes. Chicken is really good too, served with a great mustard barbq sauce.\n\nThis is the perfect place for a date or to bring out of town guests.", "author": "Kitty B."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}