{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Beautiful restaurant with high ceiling and one wall covered in greens.  Great food prepared with TLC. Attentive yet non-intrusive service.\n\nWe only came here for brunch and sat by the bar.  If you are a foodie and enjoy watching how food get transformed by the kitchen staff, I would suggest you try the bar table.  You will have a much more appreciation for the plate sitting in front of you.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Amazing food, drinks, and service. April was the best! I recommend the portobello crostini...you won't forget it! The chefs are extremely talented and creative. Can't wait to go back!", "author": "Victoria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "5 stars for a spontaneous dinner out last night. This place has great decor, great drinks, and really great food. The service was just a bit slow, but that didn't deter me from still giving them a 5 star. They were packed on a Tuesday night, but were able to seat is very quickly. \nI had the snap pea salad and octopus small plate. Both were delicious but the octopus stood out. I stole a bite of my brother's mushroom ragout, and my boyfriend's burger. It was all delicious. I can't wait to try the rest of their menu.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "The pork chop changed my life. I will weep daily knowing I live in LA and this chop is so far from me. The creamy polenta it rested on was outstanding. Foodie heaven. Cant say enough kind words about this place. \n\nGET THE PORK CHOP! \n\nOk, I am done. \n\nPORK CHOP!!!!!!\n\nOk now I am done.", "author": "Pamela W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "Damn, my neighborhood is sexy and sophisticated! Not only because I ooze that stuff (obviously... not really.... nope,) but because of places like Colonie.\n\nCame here on a Saturday night with my sister and had a brilliant time. We walked in and I immediately felt a sense of calm. The ambiance is classic but trendy; the kind of place you go to if you want to impress a date. All the tables are candlelit. Yet it wasn't annoyingly pretentious (save for the hostess*). Aka, my kind of place. \n\nOh, and the cocktails are great, too! I ordered this cucumber-infused number. Will have to try one of their \"orange\" wines next time (apparently that's a thing) and the food. \n\n*Unlike the bartenders who were super friendly, the hostess was very pretentious and almost seemed bothered by our presence. Maybe she was just having a bad day?", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-04", "description": "January 2015:\nAVOID unless you are a vacuous trust fund kid for whom novelty is more important than quality.  Why you need to be vacuous too?  Because the noise level is so ghastly that you can't even talk to the person 6 inches away from you never mind the waitstaff who fein a preposterous air of self-importance and think ignoring you is their way to salvation.  Of course in their defense the tables are so close together that getting near a patron takes enormous agility and cunning.  The good news is that you cannot hear anything the waiters say and can thus blithely ignore the absurdly overpriced specials - can a burned trout really be worth $36 or a perfectly ordinary hamburger justify an $18 price tag. And yes you have to wait 5 minutes for a waiter to appear whom  you can then beg for ketchup\n\nThe place is modeled on economy class airline seating. If you enjoy sitting in the lap of the patron next to you, this is the place to go.\n\nThe food? a pompous menu offers little choice - 4 entrees when we visited. Yet even so, the food is mediocre and seems largely based on grilling dead things in oil till their skin turns black.  The entrees are \"modestly\" sized and a few florets of some cruciferous vegetable will add an extra $9 to the price.  The $9 side salad had 15 very small leaves of some greenish thing(s): the local green grocer sells the same leaves for 99 cents.  Did I say AVOID?  Good, that's what I meant.", "author": "Dean K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Colonies was a real treat even with a blown A/C making the chefs counter a bit warm. A perfectly prepped/cooked meal at a very reasonable price. Tonight started w/ a refreshing Persian cucumber salad, a perfect reply to the NYC summer heat. Our main was a squid ink gemelli w/ burrata \u0026 mint and a sumptuous grilled pork chop w/ jersey peaches, shishito peppers and spoon bread. The meal screamed summer and my full belly screamed no mas! Local NY wines balanced with a splash of rarer foreign picks (i Germán Pinot Noirs) was a great compliment.", "author": "Raiford C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Really enjoyed our dinner at Colonie.  We were time-pressed and ate at the bar -- which, like the rest of the place, was beautifully furnished.  The bartender, Nathan, was super-nice, and knowledgeable about the menu.  Food was excellent: we had the mussels, the Cresta Regate pasta, and the burger and all three were very good.", "author": "Joel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "One of my all time favorites. Great atmosphere and décor, warm and friendly staff, great food. I love their vegetables, especially the spaghetti squash when in season. Tasty Cucumber Cuke cocktail as well. I love that it's in my neighborhood now, but I used to come here even when I lived in Manhattan. We frequently recommend this place to friends. Never disappoints.", "author": "New Yorker N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Excellent food, very nice staff, comfortable atmosphere, and a good value.\n\nThe menu is not extensive, and doesn't have a lot of exotic dishes - by New York standards - but it is interesting, and we enjoyed everything we had very much, Which one exception being the cavatelli... Which was okay, but not as good as everything else.  All the desserts looks great, and the sticky date pudding was excellent. After that, the octopus was probably the best dish I tried.\n\nPortion sizes were pretty good on most of our dishes. Also had good prices on drinks, and a couple of excellent looking cocktails.\n\nStaff was very friendly, though probably a little bit in formal for my taste at times.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "Horrible. I wish I could give it a 1/2 star. My tongue is still swollen from the salty halibut. The octopus was soaked in a greasy chorizo juice. In 12 yrs of NYC dining, this is the bottom.", "author": "Vomit C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "If you want to go somewhere else for brunch besides cafe luluc, you need to come here.   Get the duck hash and your morning is complete.  I came in on a Saturday around 1:30, not crowded but there was a busy buzz.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "You'll find me there almost every weekend - best brunch in Brooklyn! Obsessed with the smoked trout and the Benedict, plus the spicy margs. Usually have to wait a bit but always worth it.", "author": "Meryl H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "I was seated in the back of the restaurant by the open kitchen with a group of friends. I got up and walked a few feet and suddenly slipped. Luckily I was able to grab on to the back of someone's chair and picked myself back up and quickly walked to the bathroom. I came back to my seat and still none of the staff approached me and asked if I was fine. I know they saw me bust my a$$ and no one had the courtesy to approach me. One of my friends said it looked like you slipped on cream. How could I have slipped in ankle boots? If my boots were the issue, that means I would have slipped the moment I walked in. Thankfully I only had a bruised knee but still stunned that they pretended to not see anything.", "author": "Zhou G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "Don't bother making a reservation. This place could care less.   Had a 6:45 pm dinner reservation for 9/22/17.  We arrived a little early but since happy hour was still going on, we were told we could not be sited.  When it was time and with plenty of empty tables in view, we were told no tables were available. I informed them that this was my wife's birthday but it did not help.  Maybe it was because my wife is black and I'm white. They must have realized what they did because about a half hour later I did get a call from the restaurant that a table was available. The damage had already been done.", "author": "V C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "This is one of my favorite local spots.  Because it's so close, we probably come about once per week.  The servers and bartenders are extremely helpful.  We come so often, that we can typically get our favorite table.  \n\nWe tend to be pretty complicated with our preferences but the servers are friendly and helpful - always willing to help with the meat and cheese selections.  We tend to always start with a glass of Gruet and their oysters.  Their burger is probably the best in the neighborhood.  We love this place!", "author": "Maya A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "We've been to Colonie several times, and the food has been consistently excellent. The pork chop and steak are among the best we've ever had. The date cake is AMAZING (and this is coming from someone who rarely orders a dessert that does not contain chocolate.) Ask if you can sit at the bar around the open kitchen to watch the action.\n\nMinus one star for the service--last night we went and our waitress seemed really rushed. She didn't give us the specials and then disappeared after taking our order. It had been a tough week and we definitely would have had a few drinks, but the wait staff was largely MIA so we only able to order one glass of wine. This, however, is a small complaint considering how wonderful the food is, and we will definitely be back.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "I should never have gone back... \n\nThe first time I went with my wife for dinner and had a lovely time sitting at the back bar and watching all of the cooking. \n\nThe second time I had an undersized brunch, served cold, paired with a too-small and uninteresting bloody Mary.", "author": "BIG S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Solid 4 stars for brunch (may be a 4.5 on next visit)\nFor some reason the menu just never intrigued us enough to stop in Colonie; however, when in desperate need of brunch and not wanting to walk any further we finally took the plunge today.  \nDespite being packed a table freed up and we were squeezed in.  Tables are tight and it is insanely loud so don't expect to have much of a conversation with whoever you are with, but nonetheless, it has a good vibe. \nOur waitress was awesome (Kristin I think) and really set the tone for meal.  She was really good at answering questions with not just an answer but guidance.  When my wife was curious about the iced coffee she said it was awesome and \"came from a keg\". Sure enough it arrived looking like a beer and was perfection.  Strong but not too strong and not too bitter. \nWe went with the eggs Benedict on biscuits and and the duck hash.  \nPresentation was perfect and the dishes looked impressive and were a generous portion size.  \nThe eggs Benedict was very good but the biscuits were seriously undercooked.  I am sure they would have swapped out, but we decide to just eat as was. \nThe duck hash was the real standout. Great flavor and a ton of duck. In the end we ended up splitting our dishes as they were the perfect combination together.  A little duck over the hollandaise was delightful as was mixing in with the hash. We are definitely getting this combo again and just splitting from beginning. Only criticism of hash is that they need to give you two eggs.  One is not enough and leaves the hash dry in the end. \nOf course we so wanted the basket of made to order donuts but will have to save for next trip....which may be next Saturday or even tomorrow night!", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-11", "description": "I had brunch on Sunday, and although the staff was friendly and attentive, the food left something to be desired. I had Eggs Benedict served on a cold stale biscuit, which arrived 5 minutes before my wife's food, which was scrambled eggs with a cold side of potatoes. The side order of Berkshire bacon, was nothing more than bacon chips in 2 inch diameter cup. Also cold.\nTo top off everything, lukewarm coffee in a less than a single serving French press. I don't care what's being served for brunch, if the coffee is not hot....game over!", "author": "Roc R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}