{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "The burger was definitely something special. It was so fresh and cooked to perfection. The chocolate mousse was unbelievable, the kind of thing you work to eat slowly. The donuts were good, but not unbelievable. Even though the place was busy the service was friendly and efficient and the ambience is so warm.", "author": "Molly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "VERY delicious food - hard working staff/chefs.  Would def recommend shishito peppers for a light start, if they have them.  Gemelli is very galicy, which ends up tasting salty, as well - but very tasty.  Pork chop was perfect.  Cauliflower with anchovy a bit salty, but that's to be expected.\nWatermellon margarita was yummy.\nWatch when you bite into the donut - pretty messy for a date night.\nPanna Cotta, which I have NEVER enjoyed was sweet with honey, nuts - pretty good!", "author": "Gail L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Cute restaurant on Atlantic avenue. The brunch was great. Good presentation and service. The leek scramble was done very nicely as the eggs were fluffy and savory. The sausage add on was nice too as it was house made patty like. Duck hash was delicious with the poached egg on top. Def will go again.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Delicious! I was wondering why the menu was so short but it's because everything is made in house. I ordered the buttermilk pancakes and a side of bacon. Seriously some of the best pancakes I ever had. Crispy and fluffy. The bacon was so fresh. The butter homemade. My husband had the biscuits Benedict with a side of sausage. Everything was perfect. We had a great little\ntable in the back so we didn't feel cramped at all. I love this place and I can't wait to go back!", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Waffling between 3 and 4 stars because I wasn't wowed, yet I really enjoyed myself and will likely return.\n\nI went with a good friend who had it in here \"list\" for quite some time.  It was freezing out, so luckily we found a parking spot right in front.  Opened the door and the place was packed!  We were told to sit at the bar - great seat where you can watch the chefs in action.\n\nWe shared the kale salad, I had the burger and then we shared the doughnuts for dessert.  The burger was the star of the show.  Kale salad was bleh and the doughnuts were A-OK.  I've had better fancy doughnuts.....\n\nService was fine - maybe a bit awkward, but certainly not bad.  Staff was attentive in general and again, that burger was very good.  They put together the right mix of toppings so I recommend that you leave it as is.\n\nI'm a fan.", "author": "Li J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Went on a Saturday for brunch with a group of 6 friends.\nThe restaurant isn't very large and they don't take reservations. \nWe waited about 20 minutes to get seated. \n\nI really like the ambiance and decor of the restaurant. The bartenders and servers are all very cool and laid back. There's a beautiful vertical garden in between bar and dining room.\n\nOne negative thing about eating there on a hot day is that they have an open kitchen right in the main dining area. It can get a bit warm but its totally cool watching the cooks in action.\n\nWe ordered the breakfast basket ($7) to share with the table. It comes with a cherry scone, carrot muffin and doughnut. All the pastries tasted freshly baked and still warm but the size of it was a joke. They were mini versions so we basically shared a bite and it was a little overpriced to go for a second basket.\n\nEveryone really enjoyed their entrees. Portions are not large but the food is fairly rich in butter and fat so I guess its just as well. I had the duck hash which is prepared with roasted potatoes and meaty chunks of duck with one poached egg. I think 2 eggs would have been more standard considering that it was on the smallish side.\nHubby got the pancakes and declared it the BEST he's ever had. They were super fluffy and really crispy on the outside-- I presume from being cooked in an obscene amount of butter but my guy was very content.\n\nService was also very good as we were attended by our main waitress as well as other runners. \n\nOverall a really nice place to have brunch in Brooklyn Heights.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "I had a very pleasant meal yesterday evening at Colonie.  I enjoyed the market fish which was prepared, and filleted, expertly. The wine list is large and varied and we enjoyed a vignoier. I also I joyed the pate. I think that the food was reasonable for the price and I would definitely return.", "author": "Bryant R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "We love this place, the service is consistently great, and the staff will always go out their way to make your visit a pleasant one. Well done for maintaining such high standards for so long. Long may it continue!", "author": "Yadu K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "So Colonie is good, but not amazing. The decor is minimal, urban-rustic-chic, I went for brunch but imagine the evening lighting makes for a romantic space.  \n\nThe bread basket was tasty and on the smaller side, yet large enough for our 4 top to sample each of the breads and the especially lovely donut. I ordered the flavorful beans and eggs, perfect if you want a lighter brunch item.  I sampled the shrimp and grits, good, flavorful yet not stupendous and was told that the biscuit benedict was delish..it looked as much and the portion was sizable.\n\nOverall, Colonie is A-Ok if you happen to be in the neighborhood stop in, I'm sure it will be enjoyable, however, it just didn't hit that 'must return' mark for me.", "author": "Kim L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "really? NO! why does this get good reviews? there were a couple marks it hit but overall, very disappointing food. (I will say the restaurant has a lovely atmosphere, and the bartender was extremely nice and did a great job.) the mimosa was the best i've had because it was clearly fresh-squeezed orange juice and so was nice and tart, not sweet grocery store stuff. and the desserts were totally delicious--the basket of donuts and the monkey bread. \n\nEverything savory was seriously sub-par, as were the other cocktails. The bloody mary was absolutely tasteless, no spice or salt. The fries were kind of soggy, not well-seasoned. Very unappetizing. And the burger was so overcooked it was kind of unbelievable, on an unimpressive, dry bun. just no! I do not often leave restaurants so dissatisfied and annoyed. After waiting an hour for a table....I just wanted to go re-do brunch somewhere else.", "author": "Bronwyn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "Our first time having brunch here, and it was amazing.  I had the Duck Hash and a Bloody Mary.  The Duck Hash was made with fingerling potatoes cooked to perfection, just the right level of crunchiness on the edges, and and the duck was soft and shredded (right amount of salt).  I would highly recommend this dish!  The Bloody Mary was SO smooth...", "author": "Amy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "I'm not sure how this place is a star short of perfection on Yelp reviews. \n\nI walked in on a Sunday night and was greeted by a very amicable host and served by a friendly waitress. I was blown away with the lighting and decor- great ambiance. \n\nAs an entry I had raw goat cheese and a homemade terrine de camagne- both delicious. \n\nMy partner and I shared the beet soup, cucumbers (with salmon) and the Colonie Burger, for dessert we had the carrot cake. \n\nEverything about this place is homey- especially the food. It all tasted like something you could make yourself at home, if you're a good cook that is. \n\nI read a two-starred comment stating that this place was over priced- I'm wondering if we went to the same restaurant? My bill added up to $82 for the previously mentioned dishes and a few glasses of blanc de blanc sparking wine. Not bad at all- especially considering how delighted I was with the food and service.", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "Not sure why this place gets such a high rating. New to the area and I thought this was just average. Bloodys were average and the duck hash was more like a bowl of potatoes. Won't be back which sucks as I heard good things.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "I'm really bummed about this, but unfortunately I can't stick with my original 5-star review - Colonie has proven too inconsistent over time in both service and food prep.  \n\nI've received undercooked chicken from the kitchen - blegh. And this past weekend my *medium* burger came out completely raw in the center - it was literally cool to the touch, mushy, bright red and frankly not something I felt comfortable eating.  The server never came over to check how everything was, so even though I contemplated asking for it to be thrown back on the grill a tad, I never got the opportunity.  Interestingly, my partner had ordered his burger medium rare, and yet I saw them take my burger off the grill well before his (and also saw it sit there for 10 minutes before it was brought to our table, which explains the cool temperature).  \n\nThe service is very inconsistent - sometimes it can be great, but when they're busy (brunch, weekend nights) it often sucks (looooong waits, multiple forgotten items, no check-ins, etc.).\n\nI'm sad.  I wanted to love this place, wanted to recommend it to friends and feel comfortable taking guests here, but I can't count on it to always do the job.  I'd still give it 3 stars, and will still sometimes return on weeknights (there isn't exactly a ton of competition in the immediate area) but meh. \n\nThe sticky date cake is still really good.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-20", "description": "My friend and I walked into Colonie after an arduous spinning class at Equinox, looking for a relaxing and rewarding Sunday brunch. We were drawn to the spot by numerous positive Yelp reviews and delicious descriptions of their menu. When we walked in, we were immediately delighted by the rustic decor and how packed the place was. We both figured this was THE place to treat ourselves for bunch. Our hostess took down our names and informed us that it would be about a 10 minute wait - not bad for the type of crowd they were drawing. We sat by the door and chatted for a few seconds when two other women walked in and were seated immediately before us with ZERO wait time. Now, maybe they had called ahead and were put on a waitlist that my friend and I weren't aware of - who knows - but, that was definitely strike one for us and our experience at Colonie.\n\nStrike Two. The service was extremely slow and not attentive. We don't expect to constantly be bothered with questions each second about how our food tastes, but the servers were nowhere in sight to even wave over when we needed to ask for quick, simple things like condiments or a refill on water. When my friend was able to get the attention of one of the waiter's, he didn't respond to confirm he heard her or stay long enough to hear if she needed any other accommodations. We all get that hipsters don't want to work, but at least pretend to care if you want a tip.\n\nStrike Three. The most important reason for me deciding to write this Yelp review. The food really was not that good. Okay, maybe. When you go to a brunch spot, especially in New York, you expect to have a mouthwatering experience. The flavors were underwhelming to say the least and the temperature of the food felt like it was sitting out for a half hour. The best part of the meal was looking at it.\n\nColonie may have taken some people by surprise, but it left my friend and I with a bad aftertaste.", "author": "R N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "What a refreshing change of pace - a brunch place with a wonderful menu, where you don't need reservations and there's no wait!\n\nAND they serve lambrusco by the glass!  Woooot!\n\nYes, its in Brooklyn. But honestly, its worth the trip.  And I can highly recommend doing what we did on a beautiful fall afternoon - walking back along the promenade, admiring the views of Manhattan, stopping off a Jacques Torres for a warming cup of hot chocolate before braving the crowds on the Brooklyn Bridge.\n\nAnd you'll need to walk home to burn off the bowl of 4 doughnuts that you ate.  You'll have to get the doughnuts - trust me!  Lightly sugared and filled with jam or nutella or salted caramel sauce - these precious little pillows are not strictly necessary after scrambled eggs or duck hash...but do yourself a favour and round out your meal with an individual french-press coffee and some deep-fried doughnut deliciousness.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "So much I want to love about this place - the food, the ambiance, the proximity to our home - and yet every time we've been here we've been horribly disappointed. Simply put, the service is beyond terrible. There's more attitude and entitlement among the staff than the chicest restaurants in NY. After our food took more than an hour to arrive, the waitress Sara, and Manager (blonde woman in her mid 30s), became extremely rude and defensive and argued with us over when we placed the order. For the record, we were the 10th group to be seated on Father's Day, and we were there with our toddler. We ordered an appetizer, two coffees, and two main dishes. We sat patiently for over an hour while large groups all around us received their meals, finished, and paid. When I asked the waitress if she had an eta 30 minutes after we finished our monkey bread, she became flustered and defensive, saying she's doing the best she can and didn't know when it would come. 10 more minutes passed and we gave up. I brought my credit card to her and just asked for the bill and the food to go. 10 more minutes and out comes the manager with our plates of food (no bill or credit card), and she immediately starts in on how it was our fault for the delay and that she looked at the tickets and it was only 10 minutes longer than normal. I again asked her for the food to go as our toddler was getting tired, and she rolled her eyes and said fine. 10 more minutes and she brings us a $66 dollar bill and our food without so much as acknowledging that we had a poor experience. Honestly, 15 years in New York and I've never been treated so poorly. The least she could have done was comp the appetizer or offer us a gift certificate for another time. Instead we left with our food and a $70 bill and will not be coming back. I live around the corner and will make it my mission to share our experience with our friends in the area. Colonie owners: this is a friendly neighborhood, please please train your staff to provide better (at least less argumentative) service. You have good food, but at these prices, we expect more. Unfortunately you've ruined our Father's Day and taken our favorite local place off our list of go-tos.", "author": "Megan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "EXCELLENT food and EXCELLENT service! My husband and I came here for brunch, and I can't wait until we go back. I had the scrambled eggs that were cooked with this delicious cheese, and my husband had the eggs Benedict, which were amazing as well. This place is a must for anyone in the area looking for brunch!", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Love this place! Always a good scene. Everything I've had on the menu has been delicious - don't miss the sticky date cake!", "author": "Arielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Stumbled upon this gem after a city bike through Carroll gardens. Ambiance and crowd was incredible and they have a great $1 oyster happy hour. Music was great service was great the design of the space is also great. 5 stars all around.", "author": "Michael A."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}