{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Since my last review, I've visited here a couple of more times. Unfortunately, it wasn't as great as the first time I visited - the prices are fairly high and the food is very salty. That being said, the decor is impressive and I still enjoy the vibe of the restaurant (i'm sure it's a good time for a round of drinks during brunch).", "author": "Marc L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great cocktails and the Tagliatelle was light and perfect for a summery evening. Unpretentious ambience and friendly staff make Colonie an unquestionable destination in Brooklyn Heights.", "author": "Guilio Ñ."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Great staff. Great food. Heirloom tomatoes and capellini pasta are my faves. Cocktails are made really well. Bartendars are really good with a nice selection of creative drinks and wine list sure to please everyone.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "I was lucky to be there first in the morning or else I had to wait in line and that i can't do anymore...been traumatized by lines everywhere in Manhattan and scape that and came to brooklyn. Lovely Duck Hash, very friendly servers.\nlove the personal French Press coffee. Excellent service and love the decor.", "author": "mayita g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Venue: Lovely rustic look and large space with an open kitchen where you can sit and watch the chefs at work. \n\nBrunch: Everything is good and portions are large.\n\nService: Slow.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "Too many little things made this place a place I wouldn't visit again. \n\nMy inlaws, great uncle, sister-in-law, fiancé, and I arrived at 11 when the place opened but every table was already full so we had to sit around the open kitchen. I didn't mind because it's pretty cool to see the system of setting up plates. \n\nThe layout was odd since we were far from each other, and the waitstaff had to awkwardly get close to us to hear anything since the loud hip hop music was blasting. Not brunch music and not at 11 in the morning. Lower the music. \n\nI ordered the Cool Hand Cuke after ready countless reviews saying this was the best cocktail. Maybe it's my palate but this cocktail was not great. For $12 about 1/3 of the glass was empty, I tasted no mint what so ever, and it basically tasted like bad pickle juice. I was disappointed. \n\nNow onto the food. My fiancé ordered the duck hash and I was quite impressed. Every element on his plate worked in harmony. My mother-in-law was not very pleased with her eggs benedict. She said the poached egg was undercooked and the hollendaise was thin and weak. We ordered the donuts and the one I had was good. Peanut butter mousse inside a freshly fried donut? Yeah, they were good. The biscuits were also very good. Now my entree was a complete bust. I ordered the shrimp and grits. I also added the fried egg for an extra $3. The grits tasted pretty good but were cold. The mushrooms that topped the grits were chewy and spongelike. The shrimp were a serious issue. I'm all about paying for good food and I don't mind if a place is a little more expensive as long as the food is worth it, but this meal wasn't. 2 of my shrimp were overcooked while 2 were undercooked. Out of the ones I received 1 wasn't deveined. Are you kidding me? I could barely eat anything on my plate and it was almost $20. What a waste. The fried egg was overcooked and rubbery on the bottom and the whites were barely set on top. My dish was mostly a bust. \n\nThe kitchen moved quickly but I would have much rather waited for hot, cleaned, well cooked food.", "author": "Shira F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "This was one of the most delicious, subtle, interesting, attentive meals I've ever had!\n\nHighly recommend.\n\nWe had:\n1. the oysters (so fresh and the light sauce they come with was perfectly prepared),\n\n2. the ricotta and honey crostini (perfectly prepared, the honey was just subtle enough to enhance the flavor of the ricotta, but not overwhelm),\n\n3. the leeks with almonds (I was worry about the almond part of this dish, but they were whole, not sliced, and perfectly seasoned, the leeks were soft and juicy and flavorful)\n\n4. the scallops, oh the scallops, those big fat juicy slightly toasted on the outside, and perfectly delicate and soft, but cooked on the inside ... if you are a scallop-chaser, such as myself, you must eat here. And the sauce and baby carrots were incredible.\n\n5. date cake with cream fraiche ice-cream (you would never believe this was date-cake. I didn't expect to like it, and ended up loving it).\n\nScore for individual French-press coffee!!\n\nThe plant wall and overall decor may have contributed to my LOVING the food. \n\nThe Hostest is incredibly knowledgeable on the wine list, ask her to assist in ordering!!\n\nI can't wait to eat here again ...", "author": "Frances G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Awesome restaurant with an energetic atmosphere. Went here for bunch and sat up at the bar that was overlooking the open kitchen which made for a really entertaining experience. Ordered the duck ragu and the eggs with leeks and gruyere. Both were cooked to perfection however if I did go back, I'd probably order the burger after watching about 20 of them plated throughout brunch!", "author": "Kathleen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "I came here for brunch and really enjoyed the drinks. The bloody Mary's were one of the best Ive had, I really enjoyed the one with clam juice as well.  The food was also very good.  The only thing is they don't take reservations so be prepared to wait if you go during the weekend like I did.  They do allow you to start ordering drinks while you wait so that's a plus.", "author": "Diana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "great food, great atmosphere.  My mom and I went here for dinner and ordered the mushroom toast, squash, and special fish entree.  The squash was cold, which i wasn't necessarily expecting, but it was good.  The fish and mushroom toast were both delicious.  I would definitely come back.", "author": "Mekenna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Good place! The ambience is nice. The kitchen is a part of the dining area so very visible which I thought was cool. Awesome cucumber cocktail. My fish was good but I loved my friends lamb chops. Amazing! \n\nOverall I would return but the menu is limited.", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "If I call ahead and you won't take my name, won't take a reservation, and won't tell me the wait time then it doesn't matter how good your food is (it's pretty decent!), I'm still giving you 1 star. Also, one time I was sitting at the bar and the bartender was talking about how his roommate was currently hospitalized with meningitis. I gtf'd outta there.", "author": "Jeremy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-22", "description": "Colonie. Peter D. summed it up pretty good: \"Colonie does everything right. Sort of.\"\n\nI want to like you. I really do. We've been a number of times, but it's just not taking.\nThe main reason: there's no love.\n\nLet's say we sit at the kitchen bar and enjoy the view of the kitchen staff. Let's say they flip some water or something onto my wife's plate, napkins, placemat. Oh, and let's say we both go, \"Hey!\"\nWe realize you are a chef and working, but you also have people with money sitting there who pay your salary and you just slapped water on us, so you need to actually acknowledge that. There isn't a magic forcefield there. We know you can see us.\n\nOr how about a waiter that lets wine glasses stay empty way too long? We watch him chatting with the staff across the restaurant.\n\nWhat kind of oysters are these? No one tells us? Odd.\n\nThen there's the food in general. It looks nice and is put together lovely, but apart from the date cake for dessert, it's pretty unremarkable. Granted, it would be great if I could give them constructive criticism, but I can't remember anything from our last meal there (a mere 6 days ago I think) apart from an egg salad crostini (nice) and the oysters and the date cake.\n\nThis sounds a bit too cranky. Like I said, I want to like Colonie. I've spent money there. It's handsome and the host has always been very nice. But when I think of eating out in the neighborhood, Colonie is just increasingly getting bumped down my list.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "So good! Bloody Mary was perfect amount of spicy. Eggs bene on biscuit was delish. We ate at the bar. Everything came out quickly and the bartenders were very nice and attentive. Will be back.", "author": "Kristin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Had a great birthday dinner here last night!  My boyfriend told them it was my birthday when he made the reservation, and everyone we came into contact with wished me a happy birthday.  They even gave us free bubbly at the end of the meal!  I had the squid ink pasta, which was delicious - highly recommend.  Beware it does get loud in there.", "author": "Ariana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "One of our favorite spots in the neighborhood, hands down. We always take visiting friends and family here for a gorgeous, upscale, low-key, and delicious dinner experience. The atmosphere always feels warm and cozy. \n\nWe love that the menu is always a bit of a surprise with go-to dishes re-invented to make the most of local and seasonal favorites. \n\nSeriously, one of my favorite pork chops I've ever had. My husband and I get one to split every single time and every single iteration has been amazing.\n\nColonie never disappoints.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Writing this review 2 weeks after the fact. \n\nNathan the bartender was amazing. His hospitality and passion for good food and drink shine through. \n\nSome of the best cocktails I ever had. Balanced and well crafted.  All of them were 5/5\nTheir spring version of a old fashioned was great.\n The fresh ground mint cucumber cocktail was memorable. It had \"bitter truth\" elder flower liquor over St Germain which IMO made the difference. \nAlso was introduced to the Oaxacan old fashioned here. (Repesado tequila) which is a new favorite. \n\nNathan's favorite cocktail was amazing but I can't recall the name for the life of me.\n\nAte at the bar. \n\nCauliflower dish was amazing. 5/5\nBurger with the fried egg anytime 4/5", "author": "Ghazi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Exceptional service with farm to table fresh ingredients to make ever bite full of flavor", "author": "Kayla P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "We came here for brunch and the food was decent. However, I really couldn't stand a business that doesn't care about customers' dietary preference. I ordered a duck hash and it comes with a poached egg. I explained to the server that I'm pregnant and preferred my egg to be fully cooked instead of runny. She did explain that there will be extra charge of altering the menu. But come on, honestly, most restaurants would be willing to accommodate this kind of simple request. It turned out the extra charge was $3 more to turn a poached egg into a fried one. It was really frown upon. It's like, \"oh you have nut allergy, I need to charge you $3 for taking off the nuts on your salad because you are altering our menu!!!\" For that kind business model, I won't go back no matter how good your food is.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Colonie, I did you no favors by not telling you how nice your staff and service people were to me and my wife last night. You were attentive, courteous, and knowledgeable about the food. Our waiter was thoughtful about his suggestions on the menu, the wine list and even the beer. Your food was outstanding, well presented, and with just the right amount of timing between dishes --FYI, your pasta selections, fab. To say nothing of your ambience is to betray your restaurant. Your rear room is cozy, warm and energetic. Crowded house last night! The touches of brick combined with a modernist, country aesthetic are hard to pull off, but you did it. I dined with you a few years ago and I am glad I stopped in again. Your chef and staff are still on top of their game. Thanks for bringing style and substance to this part of Atlantic Ave.", "author": "Gif A."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}