{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-06", "description": "This used to be my favorite neighborhood restaurant.  It's beautiful- woody and rustic. Sadly it's quality has gone down significantly since last year. The kitchen can't handle the crowds. The past 2 times I have come, our food has taken forever (forgivable) and is very undercooked (unforgivable).  I am sad by the slip in quality and hope they can rectify it before losing customers. \nI gave it 2 stars instead of 1 because the staff is very nice and the drinks are still very well made.", "author": "A W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I am writing this review for one reason: I want Colonie to be around for a good long time. Walked in late last night, sat at the chef's table and had an amazing dining experience. The Bavette with ramps was crazy. The brussels sprouts brought my taste buds new life. The pork chop...the farro...the carrots...everything we had was exactly what we would have wanted it to be -- and then some.", "author": "Calla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Great vibe in there. Perfect date spot. Eating at the bar was cool - Erin was great. Catch her before she goes to Hawaii in two weeks. Had the burger, which was out of control. Wish it was bigger as it felt a little small. Fries were great too. Get the salted creme fresh scoop of ice cream. It's a small scoop which is a bummer, but it's damn good. 4 stars feels accurate for Colonie. I'd recommend.", "author": "Reed E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Simply amazing!!!! My son and I had a delightful lunch/brunch this afternoon! Went to Brooklyn this afternoon with no real agenda other than to hang out and possibly find a great spot for lunch! We felt like we had stumbled into a foodie heaven!\nWe started our brunch with the beet salad w/ricotta cheese, mixed greens and pistachios, divine!\nWe had such a hard time choosing our entrees, but after much consideration we chose the cheeseburger with frites and the pork belly entree with grits. Both were done perfectly!!! \n\nI love this place! We will definitely make this place one of our family traditions when we come to NYC!!!", "author": "Renee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "Wonderfully satisfying!  The octopus and ricotta crostini were both well prepared and surprisingly good.  The crostini had a very light mint sauce that left a delicious taste on your tongue.  We had the scallops and tilefish for the main course, both were well prepared, tastefully presented and tasted very very good.  I think the scallops may have the best, but it was a close call.  For dessert we had the Sticky Date Cake which was surprising and delicious, and the doughnuts which were also scrumptious.  \n\nAll in all, there wasn't a thing we didn't like and were impressed with everything we had.  Colonie has definitely put some thought and expertise into their menu and how the flavors come together.  The only thing I could have asked for was a bigger wine glass!  They delivered above and beyond our expectations \u0026 will be going back for the brussel sprouts that the table next to us had and to sit at the counter and watch the cooks in action (would be great for a 1st date).", "author": "Kay E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Tasty!\n\nCame here for a bday party of 10 last night and had a great meal.  With such a big group we had a chance to try a little bit of everything on the menu.  All items besides their cheese dishes were design to have a complexity of flavors.  It left our taste buds very satisfied.  Definitely want to come back for brunch!\n\nThe only drawback of the place are portions are small for the price.  Still an excellent dining experience.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "Colonie does it well, so damn well. Spend your cash on that duck hash.\n\n I'd be a regular if I lived closer.", "author": "Katherine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "We went to Colonie for dinner for the first time the other day. We had the ricotta crostini to start and the burger and Tagliatelle...Everything was wonderful. The food was delicious and the service was great.  We enjoyed what we ordered but we both agreed that we would try something else next time: just to see how everything else is. Can't believe we lived a few blocks away for over a year without trying this place!", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Friendliest staff ever! I've sat at the bar for brunch and drinks on 3-4 occasions and their bartenders are the best. The food and drinks are superb but the service is what has gotten me to return. Keep up the great work!", "author": "Lepeep K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "A fabulous dinner in a gorgeous restaurant!\n\nWe walked in around 7, had to wait for our table for 4, so we stood at the bar and ordered a round of drinks. I got the Full Sail lager ($6), a light, decent beer. Looking around I noticed the exposed brick walls paired with wooden floors and wooden white-washed cabinets, all lit with millions of candles. And then the living wall. What a place! After being seated I realized they had an open kitchen, and had used a mirror to make the restaurant seem more open (and it definitely helped).\n\nWe finally got seated and ordered up a feast. Of that, I tried the following:\n-raw oysters with cucumber mignonette (a zesty salsa)\n-ricotta crustini with honey and mint leaves\n-wild mushroom crustini with chives and Parmesan\n-fried brussel sprouts with bacon and cranberries\n-skirt steak with chili aioli, fries and braised winter greens\n\nThe oysters: first time I've ever had oysters, and I figured this was the geographical area to start my adventures. I would recommend this dish to anyone who loves oysters and to anyone who hasn't had them before. Not fishy at all, and pleasantly fresh.\nThe ricotta crustini: just get it, you'll love it.\nThe brussel sprouts: it was a night of trying things, and so this was also the first time I've had brussel sprouts. Interesting taste, made wonderful with the bitter cranberries and rich bacon.\nThe steak: the waitress said it was recommended that it be cooked medium rare, but I got it medium. I still thought it was a little undercooked, but it was still good, and the aioli was a great addition.\n\nExpensive, gorgeous, delicious and worth it.", "author": "Kristen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Get. The. Duck. Hash.\n\nThat's all, folks.\n\nOkay, I lied. I have a few more things to say, but you really just should just go to Colonie for brunch and order the duck hash.\n\nIt's Saturday and you want a Brooklyn brunch. You want fresh-squeezed OJ with a frothy cap on top, or a lovely French press brought to your table. You want the aroma of potatoes and bacon in the air from the open kitchen. You want adorable hipster toddlers and friendly hipster servers, and more than anything else...you want good food. You want Colonie.\n\nColonie has a short brunch menu, but they do what they do extremely well. My dad had the almond granola with Greek yogurt - small, but the perfect amount if you're not that hungry. I, however, had just gone on a long run. My dad was taking me out to brunch. I was taking no prisoners: I ordered the duck hash.\n\nNow, up until this point, I've been \"meh\" on duck. I had a questionable experience at a French restaurant which perhaps gave me an unfair impression of the meat, but Colonie did much to reverse that opinion. The duck is silky and shredded, clinging in savory little strips to the red bliss potatoes. The poached egg floats lovingly over the potatoes and duck and provides the perfect complement to the flavor of the duck. It was just the right amount of food, and I left full and happy.\n\nI'd like to try Colonie at some point for dinner, though that duck hash will be hard to beat. The place is super tiny, and the brunch rush was insane. But hey, it's Brooklyn on a Saturday morning, so I'll stop stating the obvious.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "Went to Colonie last night for my boyfriend's birthday with his parents - excellent dinner!  I had the Cool Hand Cuke cocktail, which was AMAZING - refreshing, not overly sweet, smooth.  Definitely worth the price for the deliciousness, although I wouldn't go here to knock back 3 drinks in 10 minutes.\n\nTo start we shared 3 cheeses (Humble Pie, Pipe Dreams, and Marieke Gouda), all of which were delicious.  We also shared the Ricotta Crostini and Roasted Fig Crostini - they were both totally bomb.  The ricotta was slightly lemony and light like a cloud. Yum.\n\nFor dinner I had the scallops and my boyfriend had the tilefish.  His parents had the pork chop and squash soup (which was chilled, not hot, but apparently wonderful).  I didn't get to taste the soup or chop, but both plates got great reviews.  The scallops were cooked perfectly and the combination of hazelnut and tarragon was perfect.  The tilefish was also light and flaky, well-paired with kale and a broth that had a bright lemony or other acidic flavor in it.  \n\nFor dessert we had the sticky date pudding and the brownie sundae - the sticky date pudding was perfect and the salted caramel ice cream it comes with was a great compliment.  The brownie itself was eh - I've made/had better, but the banana ice cream, peanut brittle, and chocolate sauce that accompanied it were all really spectacular, so the brownie was more of a vehicle for those.  I was fine with that.\n\nAlthough the plates were not very large (except for the chop, which wasn't small by any means), we were all filled at the end and everything was wonderful.  Colonie will definitely be a go-to special-occasion spot for us from now on.", "author": "Lily E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Food was excellent but I was really turned off by how loud and noisy it was inside the restaurant. I had to shout my way thru the entire dinner and my voice was horsy by the end. Also doesn't help that this place had a 1.5h wait, although I guess it was sat nite after all. \nPlace offers lots of small plates, great for sharing with friends. I like the cucumber vinaigrette that comes with their raw oysters. They also had grilled octopus that was very tender. Their beet salad was also well prepared. The beets just melted in your mouth!\nOverall, I would suggest trying the place on a off night otherwise, prepare to have a shouting match during dinner.", "author": "Nancy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "My wife and I love Colonie. We've celebrated repeated anniversaries and birthdays there as we feel it is a special place. Last night (11/3/16) We went there to celebrate another anniversary and everything was great: apps, wine, service, atmosphere etc. until my pork chop arrived. I always get the pork chop. I dream about it. I write poems about it that I recite out loud. Something was amiss. First, there was about 1/3 the meat that the pork chops of the past had. Second, it was cold. I didn't send it back because i was hungry and my wife was ready to dive into her pasta (which was great!). Third, the meat had already been cut away from the bone and cut into smaller pieces. Why? So it could get cold and lose any juiciness? All for $28 too. In the past, the cut of meat was so big that I usually couldn't finish the side dishes because I was so full. Colonie, I beg of you bring back the old style of the pork chop entree. I miss it so. This newer chop provided only a modicum of the splendor I once derived from my favorite Colonie dish.", "author": "teacherman t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "This meal was outstanding.  We started with ricotta gnudi and a fig crostini, then followed with scallops and steak and sides of sprouts and cauliflower.  Also tried a few of their fancy cocktails.  Everything was fantastic, but the sprouts, steak, and gnudi were all something special.  With all the new places in NYC to check out, it's rare that I say this, but I can't wait to come back to this place!\n\nStaff was also super friendly and enthusiastic.\n\nNote, sitting at the kitchen bar-type seating in the back is 100% worth it.  Made the night  more of an experience.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Brunch here was really good. Don't be discouraged by the price scale here, brunch is regular $$ price, not $$$. For brunch I got the duck hash, which was really good. For dessert, I got the sticky date cake, which was amazing. Definitely recommend this place for brunch.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-09", "description": "I came here with my room mate for dinner on a late Fri night. Wait was 45 min but we were given lots of options on tables to speed it up, e.g., sitting at the kitchen bar. We opted to wait for a table and got seated at one of the two window nooks.. cute! \n\nI loved the living wall unit that installed by the bar. Reminder to include one in my TBD house in the TBD future... \n\nThe wait staff was very helpful (knowing nuances of wines \u0026 the menu) and pleasant. There was also A LOT of staff. And a lot of wines, on tap! \n\nAC was lacking for the really humid night.. I was OK but I felt bad for the waiters with the visibly soaked through shirts. \n\nThe two of us ordered everything to share: \nDuck Rillette: Loaded high with duck meat, really good\nBeets: opposite of loaded.... but still tasty. What is it with beets? It's the gourmet trend that won't end and I LOVE IT. Especially the colorful ones. \nHanger Steak: sizable piece, flavorful, and well made\nStriped Bass: This we got for free bc someone ordered an extra. Also, delicious and well cooked. \nSticky Date Cake: too many spices, but good texture \n\nI would say most of the meal leaned towards very flavorful in ! mark. SALTY! SPICE! I wish they toned it down a little more...", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "not great.\n\nwe went a couple of weeks after they opened, and were expecting good things, but the food was JUST okay, yet insanely overpriced.  I remember spending $18 on 3 mediocre scallops.  sorry guys, you just can't charge those kind of prices for mediocre food.\n\nI also remember there being like 8 servers doing everything but wiping our asses for us - seriously, it was borderline creepy.  I had to wonder if my insanely marked up $18 scallops went straight to overhead.\n\nI would probably try it again just to see if it was a fluke, but not anytime soon.\n\nGranElectrica is their other place - Mexican, can be a bit of a mixed bag\n\nGovernor is their other other place - REALLY good, awesome food, had a great experience there.\n\nColonie just didn't wow me.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Hands down the best iced coffee I've ever had. Came here for brunch a couple of weeks ago with my husband. The food was solid, if a little expensive, but I really loved the overall feeling of the place. My husband had the donuts to finish off the meal...amazing!", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "My latest restaurant adventure was Colonie, for dinner. Having been there for a lovely brunch back in October, I arrived with expectations high as an elephant's eye. The dinner fell a wee bit short of that though. But I digress. Let's start with the brunch I vaguely recall.\n\nI and three friends ordered the bakery baskets. Amazing pastry, corn muffins, and little cakes so adorable my teeth hurt for weeks after. Definitely try everything with the sweet cream butter. I was channeling Paula Deen that day; I think I spread it on my finger while waiting for the main course. The bite wounds are just healing, thanks for asking.\n\nThe meal itself was also very scrumptious. I ordered the biscuit benedict. After deciding the mimosas weren't sparkly enough (2 parts simply orange, 1 part Andre I'm guessing), I switched to their amazingly refreshing version of a Pimm's Cup; I downed 2 or 3. The cucumber stick really ties the flavour profile together.\n\nI left Colonie fat and happy, unlike my wallet. All (or most?) of their stuff is local, organic, and all that crap that hippies ask about; understandably, eating better drives the cost up. I will say though that there are items for less elsewhere, which taste just as yummy, and that are equally as grass fed and cage free. \n\nNow, then, we come to dinner. We were seated straight away, though much to my chagrin closely sandwiched between two other tables; still, having been in New York for this long, I am grown accustomed to it, and quickly forgot about the leopard-clad eurotrash girl's elbow jabbing me in my love handles. \n\nOur waitress. Dear god. I am sure she is a lovely person, but I am not clear why it took her 20 minutes to realise she had a pair of thirsty (and hungry!) customers to help. I guess she was too busy plaiting her hair intro dreadlocks and ordering every shirt from Etsy.com. We got our drinks (I went for the Pimm's again, it came in a lesser amount than for brunch, boo.) and then it was time to assuage the hunger gremlin in my stomach. The she-leopard next to me had settled into her meal of cage-free, hand-raised, mozart-playing, shakespeare-reciting chicken and ceased her emphatic gesturing so I could enjoy my steak frites. \n\nMedium rare, of course. The steak was slightly over salted, and the frites too. But the sauce was good and the portion of steak was sensible. Not the tenderest cut of meat though; I expect more from a cow that wiles the day away languishing on purple velvet divans on 40 acres of birch woods in upstate wherever. But still good! \n\nWe splurged and ordered the donuts with the curded caramel filling; I followed my donuts with a nice Tokaj. Great way to finish a meal, in my opinion. \n\nFunny enough, the clearing of the table and bringing of the check were as speedy as anyone could hope for, and our waitress, forgetting any social grace, retrieved and open the signed check to see her tip while standing a mere stone's throw from the table. I had to chuckle.\n\nOverall, Colonie is a good place to eat. The layout is interesting, the decor (replete with barnwood and a \"living wall\") is charming, and the food is generally tasty. I had to knock it down a couple pegs for the price and the waitress, but I don't think it would take a whole lot of convincing to get me back there. I think I'd stick to the brunch though; I'm more easily plied with promises of butter and a pimm's cup the size of my head.", "author": "Michael N."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}