{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "The atmosphere and ambiance were definitely A+, intimate with an open kitchen. The food, however, let us down a bit. We had the tiniest crostini along with a plain salad (heirloom tomatoes if I recall properly) and a gazpacho that was good but nothing extraordinary. Don't get me wrong the food was good/ok but we found it overpriced for what we got!\nMaybe we should go back for their oysters?!", "author": "Marie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-20", "description": "This place seems to have gone downhill. I haven't eaten here in a while and was very excited to return. In the past the duck hash was just about the best tasting thing ever. This time it was meh. The potatoes weren't cooked well, the dish was a bit bland, the egg was overcooked, and it was rather ordinary. None of the other dishes we had were anything special. Combine that with the long wait for food (kitchen issues, waitress apologized) and I don't know if I would return.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-12", "description": "I've been to Colonie before and had great meals. Today was not so great. We were seated at the chefs table where I had to watch the chef handle raw hamburger meat with his bare hands then pick up fresh salads with the same hands and finish plates off. I ordered the eggs Benedict. One egg was cooked fully through with a hard yolk and the second was undercooked with runny whites. A new chef came in and took over as we were finishing and the first thing he did was put gloves on to handle the burger meat.... Very inconsistent meal and service.  The atmosphere is always great but I don't think I can eat there again if that same chef is there.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-23", "description": "Brought the children here for brunch on a Sunday afternoon today. We are fairly familiar with the various hot spots to have brunch on the weekends, and we've heard great things about Colonie. \nI had the Biscuits Benedict which was visually appealing, prepared very well and tasted wonderful. The reason for the poor review is because I had ordered the pancakes for my 2 children. We know pancakes in Brooklyn, and were really looking forward to the wonderful deliciousness as they were well prepared and plated very nicely precut into quarters with a side of whipped cream and maple syrup. They were very excited, but unfortunately found that they oddly tasted very salty in a few bites. After tasting myself and confirming, I was wondering if somehow the chef mixed up fine salt with powered sugar. I let our waiter know and after checking with the kitchen he was very kind enough to replace the order, but they children's appetite was already gone. \nI'm hoping to give this place another chance as I've heard so many good things, the ambience is very nice and they are in a great location. \nUntil then, I'm hoping to be able to write another review.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Cute restaurant in Brooklyn, nice atmosphere, packed with a lot of customers. We had a great Sunday brunch.", "author": "Lulu S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-22", "description": "My boyfriend and I finally tried this spot on Saturday night. We weren't sure whether or not reservations would be required but we figured after the snowstorm it would be ok. Big mistake. Even with the bad weather the wait was over an hour for a table although there were probably 6 spots open at the bar. Luckily we were able to snag seats and sit down for our meal.\n\nThere was kinda a mix of a setting and a jerky guy that was sitting next to me at the bar who was on a \"I'm on a date and gonna talk about what hot shit I am\" type of vibe. He rubbed me the wrong way - but that's not the restaurants fault, its just unfortunate it drew that kind of crowd to an otherwise chilled out neighborhood.\n\nWe started off with the 3 cheese plate and an order of meat. Delicious and good portions.\n\nNext we got the grilled endive salad, fluke entree, brussel sprouts veggies, spaghetti squash.\n\nSalad and squash were all good but nothing that blew my socks off. Honestly, the presentation was more impressive than the taste. The Fluke entree with kale was tasty but again - didnt blow my socks off, specifically for $25 and the fish portion was quite small.\n\nNow to the brussel sprouts. Albeit - its my fault that i didn't read that they were fried, but still, no big deal. I love brussel sprouts anyway its served. What they failed to detail was these brussel sprouts were FRIED TO DEATH. like death. death death. like so burnt and fried that it ruins your palette for anything else. even 3 hours after my meal all i could taste was the bitter burnt taste. which is such a shame because i didn't even get the brussel sprouts flavor.  i'm definitely not one to ever complain at a restaurant or send food back but i wish my boyfriend hadn't eaten so many because i really would have sent it back. \n\nTo end on a good note, their cocktails were AMAZINGGG. i tried the Blaire's Pear which was tart and sweet and delicious. Not huge for the price and I gulped down the whole thing pretty quick. I also tried the Cucumber cocktail which was sooo good. Tons of other people were drinking it so i figured it had to be good. It was.\n\nMy recommendation - skip the overpriced food and come for cheese, cured meats and delicious cocktails. You'll be more than happy and won't have a $150 bill for two at the end of the night.", "author": "Jen F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-20", "description": "This place was ok.... It wasn't bad but I have certainly had better food than this. \nSelected colony for brunch as my boyfriend raved about it. \n\nWe ordered the bread basket which had a yummy lemon ginger muffin, a doughnut, and a scone. The muffin was good but the rest were just average. I selected the poached eggs with ham on a biscuit.  I liked that the meal came with a salad but overall it was incredibly bland with the food being drenched in hollandaise sauce. My boyfriend ordered the duck which was much better. Overall the portion size was great. The food is very dense and filling. I didn't order any cocktails as the mimosas looked too pulpy and the specialty drinks didn't appease me.  \n\nFor the price I don't understand what everyone is complaining about. It's not outrageously overpriced at all. I think in this case the food could be great for some and not others which doesn't make Colonie bad. \n\nThe service was a bit slow and the waitress did come to apologize that the kitchen got backed up. No big deal but since the kitchen is out in plan view it looked like they would do a bunch of plates at once then send them out. Not make orders continuously.  Otherwise that staff was very nice and friendly. \n\nOverall the restaurant is not bad. It just did not blow me away.", "author": "Elyssa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "I came to Colonie for a lingering Saturday brunch. From the second I stepped foot in the door, I knew I would love it. The interior is well done; a Brooklyn standard of white and wood with antique metal accents, completed by a central wall of green foliage. It was a beautiful haven from the outdoor elements.\n\nThe coffee was served in individual french-preses which we all know makes us squeal with delight (even if some of you complain about practicality). Needless to say; this made for some excellent coffee. The bloody mary's were the perfect Saturday afternoon combination of strong liquor and not-so-spicy-that-I'm-going-to-regret-my-Friday-evening-ventures tomato; a palatable drink that I feel I'm left craving. The oysters were monstrous and delicious (I can't remember where these hailed from), and the meal amazing as well. I stuck to the basics and ordered the leek and gruyere scramble and I have to say the eggs were done very well; cooked just enough to remain a bit soft, but not in the least bit watery.\n\nFrom the hostess to the wait-staff; everyone was attentive without being pushy and very very kind. Not too shabby on the eyes, either.", "author": "Erica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Very nice bar/brunch/restaurant. I just came in for drinks but the food looks amazing and I will definitely go back to taste. Deco ++ and the drink list is pretty packed. I will go back for sure, to taste the food and maybe adjust my review :)", "author": "Charlotte G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "While there's no shortage of \"American (New)\" restaurants using ingredients from organic, locally sourced foods, there aren't necessarily ones you will feel the desire to revisit again and again and again. \n\nColonie is it. The menu consists of mostly familiar dishes; brussels sprouts, cauliflower, oysters, duck; there's a few not so familiar: Kohlrabi? (a German turnip), Farro? (a grain), Gnudi? (a type of gnocchi). But however the menu reads, and it reads clear and simple, it is the taste of the food that is so perfectly balanced in taste and texture, so delicious, so pure...  it will leave you wanting MORE MORE MORE.\n\nPlease order: \nEgg Salad \nBrussels Sprouts\nCauliflower\nCod (entrée)\nSkirt Steak\n... \n\nIn fact, order anything you may want to try. Judging from our own spectacular experience, existing reviews, and a full house on a Sunday at 9p, I implore you to go at your own risk ;)", "author": "Kelly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-19", "description": "This place is beyond obnoxious and pretentious.  \n\nI went here for brunch and they were out of all of the duck dishes and the pastrami -- some of the more popular dishes.  Even though we had come there specifically for the duck hash, my friend and I decided this didn't matter and we'd try something else.  She tried to order the burger.  The burger comes with a \"beet ketchup.\"  Since this is a little bit of an unusual thing she asked for the burger without this or to have it on the side. The restaurant FLAT OUT REFUSED and did so in the most obnoxious and condescending way.  First they said that the chef \"absolutely would not make any substitutions on his burger\" and then they back tracked and said that it was \"too confusing\" for the kitchen staff to accommodate special requests.  Seriously??\n\nI get that complicated substitutions are hard for busy restaurants, but it seemed overly pretentious and ridiculous that they couldn't leave off a condiment, especially given that many major items on the menu were not available.  UGH.", "author": "Katie O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "This place rates a 4 star review only if you're reviewing on the more charitable \"Brooklyn scale.\"   Compared to Manhattan it's a 2 star place.  The menu's uninteresting.  It takes a LONG TIME to actually get your entre.   I was told that I should order an appetizer because it would take a long time for my entre to arrive. Fair warning, but should it take an hour to get a pork chop?", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-27", "description": "Colonie does all the things I like... just not particularly well (except for the service, which the best I've experienced in a long time).  The ambiance/decor is very charming,  and just slightly different than the usual \"Brooklyn\" decor. \n\nThe Ricotta crostini was delicious, but everything else -- the duck egg with mushrooms, octopus with chorizo and potatoes, and the steak frites -- were way underseasoned.  It's so disappointing, because you've had better incarnations of these dishes (all my favorites!) and they just fail to match up.  It was a pleasant enought experience to try again, but I wouldn't go out of my way for it.", "author": "Carla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "I went to Colonie with a coworker last week for dinner and had a phenomenal experience! We sat at the Chef's table and had a chance to chat with the head chef, who was very nice and even gave us some complimentary donuts at the end of our meal! We started with Oysters and bubbly, and they were some of the best oysters I've ever had, fresh and so delicious! I ordered the Monkfish entree which wasn't even on the menu, but the Chef was nice enough to prepare it for me after I was oogling at it's preparation for a large/special party. My coworker had the chicken which she loved, and the portion was huge! Everything was perfect - service, food, decor. Thanks for a wonderful night, I'll definitely be back very soon.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Really poor experience from start to finish. Slow service, drinks not mixed well, poor service as they never checked in. Then it got worse. The veggies were saturated and the trout was smothered in some green vinegar sauce. Never have had fish drowned in that much sauce before. We sent it back and were then served a trout that was raw inside. When we finally got the attention of wait staff about this, they simply picked up the plate with no apology.  After asking for the manager, he informed us that they typically don't check in after delivering their food bc their food is so good that no one ever complains.  He then tried to make us feel guilty for sending the first fish back as it was so wasteful.   It was a surreal experience and not in a good way.  Never again!! I think the chef must be a smoker and ruined his taste buds. And the manager is arrogant and delusional.  Not a place I would recommend even getting a drink at.", "author": "Tanja O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "Had the privilege of sitting at the bar overlooking the open kitchen and witnessed the chefs cooking, grilling, and plating the entire length of our dinner. What a wonderful sight it was and definitely kicked the overall dining experience up a few notches. The decor screams brooklyn, with the hype and vibrant crowd to boost. Bricks and candle lights everywhere else, makes for a great hype trendy place to hang out. \n\nHad a few small plates and shared an entree. Started with the rabbit terrine w/ toast, which was very flavorful (almost salty) and the \"gnudi\", which was foreign to me but it was just their delicately made ricotta balls with heirloom tomatoes. This was a surprise, gave off a delicate aromatic cheesy flavor. I really loved the fried Brussels sprouts, mixed with cranberries and top grade bacon. I practically finished off the entire bowl. And finally had the scallop entree, which was four large scallops (i watched them cooked batches and batches of these), which were very tasty, but really no different than other top quality scallops i've had before.  \n\nHeard great things about this place and definitely was not disappointed.", "author": "Martin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Food was excellent drinks were great mixed it up and had four different types of cocktails all excellent... Ricotta and duck crostini were phenomenal can't wait to go back and it pleased my lady lol", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "The only problem with this place is the fact they don't have a expresso machine otherwise I'll be here every weekend for brunch", "author": "Ronnie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "I had an amazing dinner at Colonie. Reminded me of the grand bistrots parisiens. The food was great, from beginning to end. The setting is very nice. Open kitchen, which is always a good sign. I was lucky not to have to wait as it was during the week. I HAVE TO GO BACK FOR BRUNCH.", "author": "Aissatou Marie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "I've come here for the brunch which is really good. \nHowever, this review is for dinner.  I didn't make a reservation so we were seated at a bar table by the window.  It was surprisingly comfortable for a small triangular table for 3. The cocktail menu is very good and the ambience has a cool vibe to it. My dinner guest pointed out that their drink menu is quite extensive with specialty liquids. \nFor apps we had a the liver mousse crostini and duck egg farro. Both were very good with taste and texture. \nFor entrees we had the pork chop - seasoned very well but very slightly overcooked and scallops - average. The scallops were one of the specials of the night. It was very fresh and perfectly cooked. However the dish lacked texture and flavor. It was disappointing bc the portion was also too small to fill me up. $27 for 5 scallops wasn't really worth it. The the roasted Brussels sprouts with dried cranberries  did make up for it though. \nThe restaurant is full of ambience and food is very good. I will definitely return to try other dishes and would recommend to anyone looking for a trendy new American restaurant.", "author": "TIFFANY C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}