{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-28", "description": "Agree with a lot of the reviews here. The atmosphere is good, the food not so much. In my case it was not edible. Hard and dry octopus with (2, tiny) old, stale potatoes. Both my friend and I got the same thing and although we left what wasn't much food to begin with in our plates the waiter took them back without asking if there had been anything wrong! Strange, no? Tried dessert since we were still hungry, mediocre pie special for me and my friend got a cheese plate with one tiny little piece of cheese...$80 later we had to look for a place to eat...it was not my first time here but it will be my last. Friendly place but following that all too familiar and predictable pattern: portions getting smaller, prices higher and quality just not there. The 1 star is for atmosphere.", "author": "magda p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "Food:  Very well executed.  Personally, the cutting board presentation was not my favorite.  \n\nService:  Spot on.  Except the manager/owner never followed up on my observation of the cook doing something not nice on the line.\n\nAmbience:  Marvelous.  I have since recommended many people to this restaurant.", "author": "X X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "After using Yelp for some time, I felt compelled to post my first review after eating at Colonie this evening. The food was spectacular - easily the best meal we've had in the neighborhood since moving to the area over three years ago. The ambience, food, cocktails and service were all fantastic. I can't recommend it highly enough.", "author": "Jaime P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "My new favorite restaurant in an area otherwise deprived of decent choices. \nThe vegetable dishes were savory and large enough to suffice as main courses (perfect for vegetarians). The charred brussel sprouts were DELICIOUS.\nMy fish was flavorful and simple, yet surprisingly filling. We had the date cake and creme fraiche ice cream for dessert and it did not disappoint. The cocktails were fresh and original too. \nAside from the food, the wait staff were nothing but genuine and friendly (they make that extra step without being too invasive). The ambiance was comfortable and hip and though I laughed at the description of the plant wall they had on their website, it was a nice touch. \nI also enjoyed the fact that the restaurant itself felt quite spacious despite the fact that it was nearly filled to capacity. \nI will definitely be coming back and I don't often feel that way about the often too trendy and fleeting NYC restaurant scene.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "Check in finally on Sunday night. Place is crowed, nice vibe and cool people. Unfortunately we couldn't get a set at the kitchen counter, but the table are cool. Food and drinks are very very good, too bad they take forever to arrive!!! Seems to me there are too many people working in such a small kitchen, plus I order the cheese at the end and nobody bother telling us what they were! I'll defiantly go back, let's see!", "author": "Jonnhy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Always come here for brunch when I'm in BK. Great menu, awesome open kitchen and really tasty drinks. Not always consistent for brunch, but also satisfying.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-18", "description": "A friend and I dropped into Colonie last night (Wed).  It was superb in all respects.  We went just after 6:00 and sat at the corner of the \"kitchen bar\".  A perfect location to watch the chefs do their magic, talk and see the restaurant.  The food was a 10 out of 10.  \"The Egg\" was fantastic.  The pork chop was perfect.  I highly recommend the crostini with duck.\nOur server, Sara, was top-quality - she was attentive and guided us through the entire menu.  Place your entire meal in her hands and you won't be disappointed.", "author": "drew c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "Cool set up inside, surrounded by lovely yupsters.  Food was good, price ok, waitress some what clueless.  Overall good experience with a great group of people.", "author": "Dmitry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "My boyfriend and I came here yesterday (Saturday) for dinner and everything was wonderful. The food was amazing, the cocktails were amazing, the decor, music, service, etc. We had to wait about 20 minutes for seats but it was worth it. Can't wait to go back there!!! Some people on here have been complaining about the \"overly enthusiastic service,\" well we LOVED it. Very thoughtful, accommodating, friendly- that combined with the quality of all the food and drinks made the price well worth it.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "We went on Saturday night at 8pm (prime time) and they were able to seat us at the counter. This was great because we were able to watch the chef's masterfully prepare the meals. The food was AMAZING, decor is gorgeous and service was excellent. We had the doughnuts and sticky date cake for dessert and both were heavenly. I highly recomment this place!", "author": "Pallas K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-07", "description": "I was very disappointed, as food is mediocre. I heard they changed chefs since the place first opened and that may explain it. Braised escarolles just tasted soggy, octopus with chorizo had so many potatoes which really takes away from a supposedly delicate dish, heirloom tomatoes with ricotta were awfully tasteless and finally the homemade sausage were crumbly and boring. I didn't even try desert after that.\nService was good though, and of course great ambiance. \nI'd go back for a drink at the bar, maybe try the brunch, but nothing more.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "Far and away one of my favorite dining experiences. The menu is wonderful-- its easy to create a meal of small and large plates (the egg salad crostini and gnudi are especially tasty) and the cocktails are awesome. (They put like, real strawberries in the strawberry margarita. What a novelty!)\n\nThe service is warm and very knowledgeable of the menu with no hint of pushiness. This is truly a neighborhood  restaurant-- affordable, friendly, and delicious! Worth a trip to BK if you don't live there already. Head to Floyd or Henry Public afterwards for a nightcap.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-11", "description": "Never got to taste the food.\n\nWe called to make reservations for 4 but they only take reservations for 5 or more.  So we went early around 7pm, put our name on the list.  They said about an hour or so.  Came back around 8:15 to see if our table was ready.  They said probably another half hour.  We left and came back around 8:45/9pm.  Again they say another 30 to 45 min!  \n\nWe left  and ate at Lunetta, food was wonderful and the staff unpretentious. \n\nDon't think I have too much time for Colonie nor will we ever return or recommend them.\nToo  many other Great Restaurants in the surrounding area that don't have selective seating and are actually considerate", "author": "maria k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "I'm kinda confused what all the hype is about (and this is probably a testament to the fact that this area really doesnt have that many good restaurants) but i will revisit my review once I try them for dinner.  I only had brunch at this place and while boasting cute decor this place was obnoxiously overcrowded (I'm still scratching my head as to why?) and I spent a good 30 minutes at the bar waiting for a table.  The brunch menu, in my humble opinion, is limited and expensive ($14 for a small burger? R we on the upper west side all of a sudden? Last time i checked this was still brooklyn, Atlantic Ave no less).  Anyway we had the two types of crustini, the duck confit and the riccota, both good, and i had the burger (for lack of better options) and my husband the eggs benedict.  His eggs were basically raw where the white part of the egg was not properly cooked through, and sat atop some greasy (as he describes them) and not tasty biscuits. Also we each had a cup of french press that ran $6 per person, c'mon even starbucks doesnt charge those kinds of prices! Overall I think this place is a little too \"hipstery\" and a lot overpriced. The food may be better at dinner but I cant really say, the brunch is a hit or miss but for the two types of crostini (4 pieces total), two cups of coffee and the burger and eggs we left $85 poorer (oh yes we also had a bloody mary and a mimosa both were just eh).  I will not be coming back here...for brunch anyway.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "One of the top Brooklyn restaurants and thank god they came to my starved neighborhood of Brooklyn Heights. I've probably been about 15 times since they opened and its always great. Super busy on the weekends but the hosts are always very accommodating and happy to take a phone number if we choose to get a drink at Floyd's while we wait. Owners are incredibly good looking too....whats up with that!", "author": "johnny b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "Great food, already been a dozen times, the kitchen runs well except on weekend nights they don't handle the crowds that well, the food was not as good then. \n\nThe service is great, best in the neighborhood. \n\nThe decor is the best.\n\nTe music is eccentric not exactly fitting the mood, more playing for hipness but way to loud, they need to turn it down. I have asked them twice along with many others and they just totally ignore the problem. It is always what is wrong with NY restaurant, loud music so everyone has to scream to be heard and you loose your voice.", "author": "ashley f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "I have been here twice and have had two exceptional experiences. The first time we went with an out of town guest, and were treated fabulously. We had the most incredible food, and had foie gras donuts which are pretty much what they sound like: the most addicting and decadent thing I could have done to myself.\n\nThe second time we went there, it was for our anniversary. We both had a busy week with work and had not managed to plan anything. When this occurred to us, we decided to go to Colonie, because of our past experience. This time, we were really \"wowed\". \n\nWe started off, sitting along the edge of the kitchen, which at first was a bit warm-BUT TOTALLY WORTH IT MY FRIENDS. The team in the kitchen was such a delight to watch, the are so well orchestrated, and it is so neat to watch all the plates come out. \n\nMy husband and I watched everyone in the kitchen as we shared our bottle of wine, (and experienced the most fantastic duck crostini... topped off by the highly crave-able pickled shallots), and just enjoyed each others company. \n\nAs our entrees arrived (pork belly for myself, and steak for my husband), the CHEF HIMSELF comes over and offers a carving board, \"You guys seem really interesting, so I wanted to offer you something that is not even on the menu yet- you are the first guests to try it here, Head Cheese.\" [At first, I was afraid of eating something called head cheese, but do not let the name put you off, you need to try it.] \n\nI was so astounded by the generosity of the chef and staff (they had no idea we were celebrating anything, and we are by no means, regulars), it really impressed me. Every person we have come in contact with who works on the staff has been an absolute delight. Not to mention, every thing we have tasted has been incredible.", "author": "Alisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "The food was eclectic and absolutely delicious. The staff was the real shining star, though - they were super attentive, friendly, and so knowledgeable about every single item on the menu. Will definitely be going back!", "author": "Meredith Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "After reading the menu online, I went in with high expectations.  While I loved the atmosphere, and the staff were lovely, unfortunately I thought the food was only okay.  If I go again, I would sit at the bar and get crostini (which were very good) and a drink - although probably not wine by the glass - I tasted three, and they were all pretty mediocre.", "author": "Claire J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "This place is super great!!!! I really love the athmosphere \u0026 decor...it's exactly what we are lacking here in the neighborhood...so tired of hoodlam bars around! The place is very inviting \u0026 warm, not really casual, but I didn't feel it was a problem for me to go there in jeans. And they also have my favourite wine on earth - Moscato!!!! Yey!!! Can't wait to try the food!!!!", "author": "Maria F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}