{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "This place has a lot of hype, so I was excited to try it. I sat down and went straight for the wine list, told the gentleman at the bar we were interested in something natural with a bit of bottle fermentation; I threw around phrases like carbonic maceration, etc. He sort of smiled at me and told me they focus on natural wines, and then pointed out what seemed like a very interesting choice, from a place I've never drank wine from, made with some indigenous grapes or what have you. Anyway, it was good but he ignored what I was actually asking for in the wine and just went for what he saw as interesting/sellable. Whatever, it will do.\n\nThe starter was nice: cauliflower with anchovies, tons of citrus and butter flavor with the caramelized vegetable. I wish we stuck to the small plates, but we decided we should try some meat, and opted for the most grand option: a steak (bavette cut to be exact). I've had a lot better, and for $32 I expected a lot more. It was overcooked, and it had a really bad charred flavor, none of the smoke/fattiness you would expect from a grilled piece of prime beef. It came with a handful of fries and about 4 leaves of red mizuna. Unfortunately I felt pretty disappointed about it.\n\nIt's a great space, and the menu looks promising, but I was unhappy with 2 out of 3 things. The service, though perfectly attentive, was incredibly pedantic -- I actually heard the same pitch used over and over again at people sitting all around us and it began to echo with annoyance. \n\nI might go back, but only if someone else is footing the bill, there are a lot better options for their price point.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "I thought Atlantic Ave might be far enough away from the absurdly bad food scene \u0026 crowd that is Brooklyn Heights, but I was wrong. After seeing a lot of good reviews my wife and I walked into Colonie last night to find a beautiful space. It was crowded, but we got two seats right at the bar. It went downhill from there. The guy who made me a martini was nice, but the martini was weak and half filled (which is tough when you're charged $14 for it). We ordered the picked vegetables with cultured butter to start and got vegetables so saturated with vinegar it burned our palates so badly that we couldn't eat it. When we told this to the female bartender she said \"Okay\", and took the plate away annoyed. We were so turned off by this that we just canceled the rest of our order and left. They ended up taking the vinegar \u0026 veggies dish off our bill, but that won't get us to come back.", "author": "Peter Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Came here on a whim on a Sunday right as brunch was ending. We were happy they still stayed open during that brunch-dinner timeframe, as many restaurants sometimes close for a bit. And are we happy that we ventured in.\n\nI'll start by saying the ambience and natural decor is perfect - the living plant wall is alone enough of a reason to go if you have any plant-nerd in you. The bar is in the front of the house, and the open kitchen and dining area in the back. You can actually get seats at the bar by the open kitchen - looks like it would be incredible (this is where we are planning to sit on our return trip for brunch and/or dinner).\n\nThe staff was all very friendly and laid-back, each of the three bartenders we talked to were interesting and good at conversation (from whiskey to scotch, to music, and to really knowing the menu). We simply got some \"bar snacks\" and drinks, since the full menu wasn't available. The meat and cheese plate is the way to go with drinks - all the rich and varied flavors go very well with drinks. We ordered the Moses Sleeper (cow) cheese and the Sqaure (goat). The Moses Sleeper was like a mild brie, in texture and flavors - it went well with nearly everything on our board. The Square was a more flavorful goat cheese (not chèvre) and it went perfectly with the quince and honeycomb. Two excellent local (VT) cheeses! And then as far as the meats, we had speck (classic smokey and salty flavor), the soppressata (little bit of spice, equally delicious) and I'm forgetting the 3rd but it had delicious pepper and fennel seasoning - that was my favorite. We did order the fresh oysters as well, and they truly were fresh. Excellently chilled and with their characteristic oceany flavor. You also will get a delicious savory onion jam, mustard, grilled bread and flatbread. Try the cucumber mignonette - it's a nice twist on that classic vinegary accompaniment!\n\nAll in all, we were impressed by all the local items on the menu, the freshness and flavorfulnpess of all the \"bar snacks\" we ordered, and the staff was great. Sometimes it's just nice to sit at the bar and have a calm and laid-back afternoon vs. sitting in the dining room!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-02", "description": "I booked a 17 person dinner, far in advance for my birthday. Why not right? I heard the chef was proper, he was on the show chopped.After my family arrived, it took an hour for our first course. Does it really take an hour to serve some bloody oysters? Needless to say, they smiled when they handed the check for over $3000. Our food came super late, the pasta was all cold. They sent us a bunch of burned bread. By far Colonie, worst possible dinner at such a high price. Upon speaking to the Chef Jared about why it took so long he stated \"Next time, the oysters will come right away\" Must of been a similar excuse to why he failed on Chopped.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Good drinks, good service, great drink selection.  We had some apps and the pork chop, which was cooked nicely.  Would go again.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "I'm a huge pancake and waffle lover (it's even written in my twitter profile - i love waffles). So, when i saw that Colonie had Buttermilk Pancakes on their menu, I was certain it would be something special. Besides, my friend (and sometimes running partner) Pete had just been raving about the pancakes last week, and I trust him, mostly.\n\nWhat could possibly go wrong? I mean, from the moment you walk in, Colonie appears to have it all covered. Gorgeous interiors - high ceilings, with a mix of exposed brick and hardwoods. Lovely staff - smiling, friendly, celebratory. An eclectic beverage list, including a delicious Rose that we got for my sister-in-law's birthday. And, besides, it's freaking pancakes - and these people clearly know what they're doing. Right?\n\nWellllllllllllllllllllllllllllllllllllll ... as it turns out... their version of \"pancakes\" is just one pancake. One Gigantic Pancake. One Gigantic Doughy Eggy Pancake with an ultra-crisp shell. When I tell you this pancake was about 2\" thick, it is NOT an exaggeration. It was just too mushy. Had it not been my SIL's bday, I would've sent it back.\n\nI'm all for \"modified\" or \"modernized\" versions of classics, but this just wasn't made that expertly. I ended up cutting all the edges off (the more \"done\" parts) and those were great. But the rest (about 80%) was bad mush. \n\nI'm giving this place 4 stars regardless of my dish though, as the Baked Goods Basket (scone, muffin, doughnut for $7) was some of the BEST pastries I've had in Brooklyn, and I've lived here for 10 years. The scone in particular (sour cherry) was fantastic. And my friends all enjoyed their plates too. \n\nAvoid the pancake.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "Food is good, if overpriced for the area. Beware the 10.30 kitchen closing time and bitchy bartenders who won't take your order at 10.34 if even if you come hungry af. Check out Chez Moi next door, way better vibe and a later closing time.", "author": "Andrei L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Great vibes! I was very pleased to be here for a date night. People were in variable dress so if you were dressed up or more casual you felt comfortable. We had oysters which were delicious! I loved their market fresh fish stuffed with fennel and herbs. My boyfriend had casta rigante which was good, but nothing really special. It was a heavier taste than expected. The service was good - our waitress was very concerned that everything was delicious and enjoyable. They didn't ask to take our coats, and could have checked in more, but did quite well considering how busy it was. It is a noisy spot with music and clustered tables, but that's typical of this area (as a NJ person). Creative cocktails - yummy. I had the antique roadshow and he had a winter in Oaxaca that were both yummy. Great spot! Will come again. Several groups that seemed happy having larger group dinners.", "author": "Elsie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "What to say... ok, Loved It ! Went for brunch- had the biscuit Benedict with sausage- this was light and scrumptious.(yea I used that word).  I sat at the counter and watched the guys as they worked and was very nice impressed with their detail, communication and oh yea.... Great food. I'll be going back for dinner as I can see it'll be a fun place to hang and chat and enjoy music and eat and drink and be merry....", "author": "Ron J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Everything was spot on here. My drink was delicious n strong, a cocktail called talent scout, like an old fashioned with extra orange. My friend's burger was the best, I stole a share of that. The barman was great, and the place looks lovely. There's no reason to drop a star!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Have been to Colonie a few times for brunch and just once for dinner. Usually not a bad wait for brunch, which is a rarity these days. The staff is very efficient and professional - one waitress was very patient \u0026 helpful with one person's dietary restrictions (GF, DF).  Good atmosphere, although the tables are a bit snug together so you totally know what the others are eating, saying, etc.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "Most amazing lovely warm place with excellent service and yummy food!!     Like beautiful and excellent!    So why the three stars??    Because it is just way too expensive and you leave hungry!!    I hate those places where you spend 424 dollars and then have to get pizza after!!!    They charge you for a few pieces of focaccia bread!     The pasta is 24 bucks but it is an appetizer portion!!   Come on.     Brussels are tasty but not cooked and with four Brussels cut up and a squirt of lemon - that is 79 cents last I checked.   I know this brooklyn place is expensive and fancy but please - where's the beef??    Increase the portions and decrease the prices and we got a deal!!   \nI love you guys, but feed the bear!!", "author": "Hugh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Amazing service, no long wait, food was spot on.  Must enjoy their Donuts and looking forward to try their Monkey bread next!", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "I ate here on a whim after accidentally crashing my friend's Hinge date across the street. SORRY BRITTANY! Anyway, she told me to get lost after one drink so I plodded over to Colonie for a TABLE FOR ONE. No complaints from me though -- I mean, how often do I get to eat with my favorite person?!\n\nAnyway, sat down at the bar and was immediately greeted by bartenders Erin and Michelle. We ended up nattering away all night! These girls are seriously FUN! They recommended fantastic wines, an amazing ricotta bruschetta, an awesome entree (can't remember the name of what I had but it was a pasta with prosciutto...life-changing!) and a delish dessert. Everything tasted sooooo good, and eating at the bar with them as company was a total pleasure. \n\nOther pluses: they charged my phone for me (thanks gurls!).\n\nBy the end of the night we were such fab friends we added each other on Facebook on Instagram. If that's not a positive staff experience, I don't know what is. \n\nTOP NOTCH, WILL BE BACK!", "author": "Molly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "My new fav spot! Awesome drinks mixologists onsite!! All types of options to mix your drinks. Loved the old fashion and the delicious orange pino Grigio. My friend had an amazing cucumber martini. The food menu looked awesome but I haven't tried a dish yet but very sooon! Handsome Bartenders too ;) ohhh I can't forget the music and the diverse crowd! Music was def dope and diverse. I had to ask who was playing and apparently one of the owners or managers was a dj and makes playlists for the spot. Customer service was on point and the patrons were also very friendly", "author": "Classical B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "Tried to eat here twice in 2 weeks. First time was told without a reservation we could eat at the bar. Problem being  it was hot as Hades. Said no thanks. Was told on a Thursday at 7 it would be a 2 hour wait. We left. Made a reservation and asked not to be seated near the kitchen.  Upon arrival for an 8:45 reservation we were offered the tiniest table for 3 in the window area. When we said no to that - asked about all the empty tables in the back - were told they were \"reserved\" for parties of six or more. We left and promise never to try again. Good luck people. Good luck Colonie.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "beautiful restaurant with yummy creative breakfast! I liked how they had the beer with the bloody mary! great refreshing drink that ive never had before and def will be on the look out in the future. The pancakes were thin, well done, and reminded me of crepes instead of pancakes. THEY HAVE BRUSSEL SPROUTS deep fried with cranberries and PORKBELLY!! def try their bacon that they prep in the place.\nIts a nice venue with interesting chairs, great service, and the herb/plant wall is super cool! I like how the bar area is divided up from the back and you can hold brunches, baby showers, and get together with a group of friends. I like how the coffee came in individual french presses!!!! :)", "author": "Lily P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-27", "description": "This place is not good for brunch. It's lunch. The service was pretty terrible - had the waiter ask for our order several times...when we gave it to him. We were rushed despite not having finished our meal. Very underwhelmed.", "author": "Eva S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Surprised to see the good reviews. The staff was magnificent. However we sat on the chef's table watching food preparation and it was shocking - most unhealthy and disturbing meal prep I've seen: (1) Chops (and most dishes) are fried with almost a cup of oil and a soup serving spoon full of butter. Burger is fried. Fish is deep fried with a couple of cups of oil. Added salt literally covers the food making it look white before it gets cooked. (2) and then one of the chefs is repeatedly trying food with the same fork and the other chef is not wearing a hair net (so if you got sick a few days later, just think if you ordered that gross pasta or meat). \nThe burger was 30% fat (or so the waitress said) fried in oil which was then thrown over the dish to melt the cheese. \nSadly, was so excited to go based on reviews which is why I'm writing this. (And would love for it to be different cause the staff was wonderful) Save your health and your life or at least go knowingly that you're eating literally large quantities of fried oil plus salt on everything.", "author": "George C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "cute space and food was pretty good.\n\nCame here for brunch! we had the monkey bread to start. Be warned that it's sweet and it's best to share amongst friends; but it's delicious! i'd recommend having it with a piping hot cuppa joe. Their bloody mary was decent. Could be a tinge spicier.\n\nhad the duck hash which was actually REALLY good. i was on a low-cab diet so it was a poor choice for me since it's packed with potatoes. The shrimp and grits look awesome!", "author": "Tiffany L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}