{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "All I can say is: Haters wanna hate.\n\nA while back, when Colonie was colonizing on Kickstarter, I decided to support some locals who loved oysters and got myself a dinner for 2.\n\nI finally made good on that donation the other night and I have to say nothing was disappointing. We had a great seat at the kitchen counter of the adorable chefs. We have a really wonderful server by the name of Genevieve. And if the guy who reviewed this place for the NYT doesn't want to wait for dinner, make a friggin' reservation.\n\nThe tasting menu was really well paired with beautiful wines. And they were so willing to accommodate the addition of the egg dish to our tasting.\n\nThere was nothing that was served that wasn't amazing. I could do without the Aussie bartender.. he left us waiting for a bit to order. But everyone else from host to owner to chef was amazing.\n\nWhat an awesome dining experience.", "author": "Jackie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-22", "description": "Went here after a full day of Biking and dancing in 1920s fashion around Governor's Island. We were in the mood for comfort food, and was thinking of biking over to Smith street, but... Too tired! We decided to walk into this inviting place on Atlantic Ave, and sat at the Bar. The Menu wasn't too big, but focused. Started off with Cranberry bean Crostini and.. OH! Egg with SMOKED Bone MARROW.. You knows I gots to get that! Believe me,.. It's as good as it sounds, and the Crostinis are quite big! My Girl and I had Flying Dog Porter, and Six Point to wash it all down.. Both Brews excellent, and Both, made in NY. Woot! \n\nWe continued to explore their menu, with adding on a Rabbit-Foie Gras Terrine, A Scallop Entree' and a Duck breast with lentils as well... The Terrine, is flawless! Rich, tender,smoooth... Plenty of meat to go around, and just amazing. As good as it gets. Simply came with Frisee' salad, that were crunchy and bitter. A bit much for my girlie, but I thought the bitterness played well with the dish. -\"It's a perfect circle\"-She whispers. How so?? She grabs the 'bush' of Frisee' and explains, \"THIS is what Wabbits eat, and now it's on the same plate\".. Oh, Asso.. Then, Professor obvious, what will Duckie eat then!?!?!.. She quietly dangles a perfect piece of toast. Well then, Everybody is happy.. Let's have another round of drinks! \n\nAt this point, we were a wee bit tipsy, so I can't recall the other silly things we were discussing about but, oh- When the Scallops and the Duck arrived, we sobered up real quick! First, the Scallops. Seared perfectly- Sweet, and meaty, with Mushrooms, Apples and lemony herb.. Wow! So elegant, you'd think this dish was coming from a posh Michelin starred place, rather than from a Neighborhood joint in Brooklyn. Really nice, but There were only 4 Scallops, so I did not want to steal anymore from my Date. The Duck was Fa~ntastic as well, with perfectly rendered skin/VERY CRISP, and cooked Medium rare. The Lentils were buttery, and firm. The Sauce? Man, the Duck Sauce was just amazing! Deep flavor, and so silky- Looks like a sauce straight out of French laundry's cookbook. I wish I could bottle it up to take home for breakfast. YUM! \n\nOur plates were wiped clean in seconds. Our bartendress was quite amazed... We get that a lot, wherever we go LOL. I wish we had room for Dessert, but.. Not this time; We still have to ride back over the Bridge to get back to Manhattan! Well, Colonie definitely gave us enough 'fuel' for our journey back.. \n\nNext time, we're driving down here! Awesome!!!", "author": "zakk G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "We've been to Colonie twice, once when it first opened.  I was overwhelmed by the space; it's beautiful, and clearly the Kickstarter money paid for a few place settings at best.  Then, I got to thinking: I've seen this before, in practically every modestly new restaurant that favors the \"Hamptons Barnyard\" style and it made me think the trend was getting maybe a little old.  Still, they've invested so much in this and the partners and staff were super-friendly so I am wishing them well. \n\nThe food: My fish was cooked well but less than room temperature so decidedly cold.  I chalked it up to start-up jitters. I never had oysters Rockefeller and i really enjoyed them, so that's good.\n\nThe second time trying there was a 2+ hour wait, so thank you River Deli for seating my family from out of town quickly and warmly.\n\nThe second time we made rezzies as we had a larger party. Service was attentive, food was really just  'meh' at Saul prices (but nowhere remotely close to Saul quality).  I will pay anything for a great dining experience but I honestly felt like I was paying for the reclaimed wood ceiling and not the food.  The wine on tap seems like a gimmick at $12 a glass for a wee pour. \n\nI guess in closing, don't try so hard on the 'experience'.  Take a note from the neighborhood institutions: it's all about the food.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "Colonie can colonize all it would like, and I'm fortunate enough that it has built its pillars in my backyard - just about. \n\nThe pleasure-to-please front of the house staff only foreshadowed the meticulously attentive wait service. From the moment our four-top sat to the time we left, our water glasses never made it past the half empty mark and our champagne glasses were always brim-full with our sparkling Lambrusco. Throughout the extensive meal our place settings were reset at least three times, which was whole-heartedly appreciated - the simple pleasure of eating off of a clean plate! It's these little nuances, the attention to detail that already set Colonie apart from the numerous establishments that tout good food, but rest all too comfortably on their laurels of hype and swank, dismissing the service aspect of the dining experience all together. Colonie tallied big brownie points to this end - and we haven't even gotten to the food yet! \n\nIf you can have your cake and eat it too, then you have it all figured out. And Colonie was able to do that. The plates were on point. Most of what we ordered was per the recommendation of our knowledgeable server (paralelling what we were tending towards already), and those were the dishes that won us over for the most part. The oysters were a fail-safe start to the feast, fresh and made interesting with a vinegar-based cucumber mignonette sauce, beautifully balancing their essence of the sea. Keeping it light, we opted for fluffy ricotta crostini, their pillowy dunes drizzled with sweet honey and aromatic tears of fresh mint leaves. Downright decadence with every chewy morsel.\n\nFloating back to the ocean, the dainty octopus left much to be desired. One of the few missteps in our spread, the image shows a 'before' picture, though it scarily resembles an 'after.' A thin meager tentacle cut into three short pieces were thoughtlessly laid upon an uninteresting bed of mizuna greens, fennel and apple. Perhaps pulpo at its worst. If this is the intended execution, I recommend not recommending it. Similarly underwhleming, but relievingly the only other unremarkable dish, was the kale salad. Now I know kale is tough - literally, and as a consequence often figuratively. But sometimes a chef can master this harsh leaf and massage it into a delicate green. Such was not the case here, unfortunately. Tossed in an anchovy dressing with carrots and cherries, the flavors were unpronounced and the rough texture was hard to overlook, try as I might.\n\nBut after surpassing these humps it was smooth sailing from there. A lifeboat came in the form of a flavor-forward heirloom beet salad. This rugged root provided a welcoming firm texture against the soft ricotta salata, and supple oranges, with a round finishing crunch from the crystalized hazelnuts. Staying the course of understated robust flavors, the black risotto topped with a web of crispy enoki mushrooms was delightfully smooth on the tongue but maintained a rich depth without the heavy weight risotto often brings.\n\nAs if our palates could not be tickeled any further, more favorites were ushered out. A perfectly seared  meaty artichoke, laying in tender husky chunks atop a wonderfully acidic blood orange hollandaise sauce. Talk about the bold and the beautiful. And the layers of flavor persisted in a layered lasagna of rabbit, sundried tomatoes, and swiss chard. Yes, it is as good as it sounds. An ultimate comfort food revamped rabbit-style. What's not to love? \n\nMany would say Brussels sprouts. But love them or hate them, they are the new \"it\" vegetable, making fashionable appearances on every seasonal menu. And Colonie certainly delivers with theirs, satisfyingly crispy with savory bacon and sweet cranberries. A melt in your mouth experience that will certainly erase their fabled bad rap. Some of the best Brussels I've had - and I've been to Brussels.\n\nSo exit the small plates, which carried a fine presence in our meal.  But we couldn't \"Colonize\" without testing the larger dishes as well. Enter the most substantial and succulent grilled scallops that have ever graced my palate. Then plop them on a  sweet kabocha squash puree dressed with pickled red cabbage and it's heaven on a plate. I wanted to bathe in these flavors and textures for eternity (but knew there would be some sort of sin involved if that were possible). Unyielding and bold, much like its large-plate companion, the roast pork was charred to a perfect crisp, the moist meat oozing supple juices. Served with grainy yet silky grits and heaping glazed root vegetables, it was a hearty dish all too appropriate for a medieval king's dinner. \n\nAnd royal we felt, as the dining experience could only be extended by nothing other than dessert. Colonie has all their ducks in a row and I am hopeful they will keep it this way in spite of their growing popularity - to which I realize I am contributing. I have no doubt I will become a regular. So let's just say, put it on my tab.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Love love love this place! Been here numerous times for brunch and dinner and each experience has been better than the one before. The food is really yummy and innovative and overdelivers compared to what you would expect just from reading the description on the menu - the Duck Hash for brunch and Rabbit \u0026 Foie Gras Terrine are all time favorites. The cocktails are always amazing - I'm personally a huge fan of Cool Hand Cuke. The ambience is nice and the decor is lovely. Sitting at the open kitchen and watching the chefs cook and prepare food really adds to the experience. The wine selection is nice and adequate but could be more extensive. My only wish is that they would start taking reservations...", "author": "Nikki S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Had brunch recently and loved the creative menu, much more fun than the usual brunch fare!", "author": "N T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "In the search for delicious food, I rarely venture off the island of Manhattan. And when I do, it's certainly not to Brooklyn Heights - a neighborhood typically considered more stale and historic than its other borough counterparts. Yet on my way to the NY Transit Museum, and at the strong recommendation of a friend, we ended up brunching at Colonie, a casual yet chic spot, complete with candles and its very own herb garden wall. And what a great meal it was!\n\nThis farm-to-table restaurant offers only the freshest, highest-quality ingredients and handles them beautifully, ensuring each flavor and texture is enjoyed on its own, while still existing as part of a cohesive whole. Many of the preparations are straightforward with little razzle dazzle, but some are truly inspired. Unexpected offerings like the Mushroom Egg Toast and Duck Hash are successful, though the latter has less flavor than expected. While everything is tasty,  and the simpler options are more of a \"sure thing,\" it's the unique dishes that make the trip to Brooklyn Heights worthwhile.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "Great dinner spot with wonderful small plates and crostini. Great place to go with friends or on a date. I got the kale salad and duck egg as a main and my friend got the steak which was cooked perfectly. Highly recommended.", "author": "Jessie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Ricotta Crostini and burger- amazing. I wasn't wowed by the tagliatelle... It wasn't bad by any means... We ordered it because of all the reviews - but will probably opt for something else next time- such a wonderful menu to chose from. Great coctails! Will be back!!", "author": "andrea c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-28", "description": "Nice decor. Attentive service. Menu was not very inspired and executed poorly (lots of salt). The pricing seems way off with veggie sides - that are simply just vegetables - costing more than some mains. Both steaks ordered at our table were not cooked properly and sent back. With all the amazing restaurants in the area, I won't return to Colonie.", "author": "Carolee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "Great brunch spot with delicious food, drinks \u0026 hospitable service. I was delightfully surprised and can't wait to come back for more!", "author": "Olga T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "Pros-  Decor, service, food, and drinks were fantastic!  We sat at the counter and got to watch/engage with the chefs which was neat!\n\nCon- my ONLY complaint is that we called ahead to make sure that if we came at 5:30 on a Sunday we'd be able to get a table for 5 people.  They indicated it wouldn't be a problem but when we got there there was only room for 5 people at the counter.  \nIN THE END- The counter ended up being a really cool experience but it would have been nice to know that in advance\n\nI LOVE COLONIE!", "author": "Mark K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Excellent execution of the dishes. Trout flakey and moist, the roasted cauliflower is the best preparation ever--tasty with interesting textures. Pea salad was fresh with tang and acid perfectly balanced against the sweetness of the snap peas. I plan to work on perfecting the date cake with toffee sauce.", "author": "k s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "A decent brunch/dinner place at the end of brooklyn heights. the eggs are done very well and the service is good too", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "Loved the atmosphere, very warm and comfortable, cozy, yet well designed.  The waitress was nice, and the food was good.  \n\nI sort of had one of those moments where I looked at the menu and nothing was really screaming out to me, and to be honest it's a couple months later and I can't remember what I had - EXCEPT - the bread pudding!!!  Holy crap. \n\nI got it on the recommendation of a friend, and I would suggest you follow mine and every other yelpers lead here and save room for dessert.  It was holycrapomgomgomgdon'ttalktomeI'mhavingamoment good.  \n\nIs it taboo to go to a restaurant for a drink and dessert these days?  Because I'd consider that the perfect date.", "author": "katy f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "I went here for a friend's birthday dinner.  Having read the prior reviews, I was skeptical and a little scared.  After my experience last night, I may never use yelp as an indicator again.\n\nWe got there early on a Thursday and put our name on the list for 7:30 pm so we could grab a drink around the corner.  We only waited 10 mintes for a table when we came back.  All staff were more than attentive.  They helped us move the wine we ordered at the bar, apologized for the wait (which was not even enough for me to finish a glass of wine) and were overall a pleasant, lovely bunch.\n\nThe food was awesome.  The three of us ordered the duck mouse crostini, beet salad, brussel sprouts, artichoke, The Egg, black risotto, duck orecchiette all of which was through the roof good.  We sat around talking about how good the food was for about an hour.  The \"stars\" were the brussel sprouts and the beet salad.\n\nFor dessert, we got the Date Cake....it was the best part of the meal, so leave room.", "author": "Tara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "Some of the food is quite good, some eh. Duck Rillette - delish. Pate seems to be not as good as it was, brussel sprouts - excellent. Prosciutto - gross. Came kind of minced up and thick. Who cuts it like that? Not good. \n\nWines are overpriced by the glass for the pour. I wish I'd realized the one we ordered was $15/glass. Ridiculous. The service is mixed. Have been here when the bartenders are friendly and helpful, other times, not so much. The bartender yesterday was on the chilly side, and we ate at the bar. My boyfriend had the pate - we've had it a few times and know it usually comes with some great bread. Not this time. When we asked for some, she just seemed hassled. \n\nThe bill for what we had was just too much.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "I need to preface this by saying that my first experience at Colonie didn't blow me away.  It certainly wasn't terrible, but I  was just expecting more, since most of my BK friends rave about the place.\n\nMy boyfriend and I really fell in love with everything about Colonie on our 2nd visit.  We ordered a LOT.  The charcuterie is definitely an excellent deal, they really give you a lot.  We also got the burrata and heirloom tomato special which was really incredible too.  Our entrees were fantastic.  We got the scallops and the halibut- both cooked perfectly.  They have wine on tap as well, which I love.  Service was great.  I have nothing bad to say. Can't wait to try the 2 DUMBO restaurants!", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Excellent meal! We ordered the pork chop, trout and a side of brussels sprouts. All were incredible. We will definitely be back!", "author": "Gabi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Dear Colonie\n\nAlthough you sometimes get too crowded and we decide not to wait, we still really like you.\nWe like the cocktails although they are a little pricey (help a girl out-specials every once in a while?), and we can get the exact same beer a half block away for 2 bucks less. But your bartenders are really creative, and we drink their concoctions despite the price. \n\nWe like sitting at the bar, or at the open kitchen counter, although seeing our $19 piece of octopus come from a plastic container sitting by the grill is a bit disconcerting. Especially when the said $19 piece of octopus is surrounded by so many friends, and yet ends up as a single piece on our plate. \n\nAnd then we end the evening still feeling happy and full, despite the fact that we've just paid a little more than we'd like for what amounts to farm-to-table-ish tapas. \n\nWe keep coming back though, because even when we don't totally love every bite (the beet salad with cocoa was somewhere between strange and strangely tasty), there's enough there that's satisfying and awesome. So, I don't know. Wanna knock off a few bucks on some of your dishes? Or run some type of special? We're still going to come, but we'll feel a little less liking rolling our eyes at some of the prices.\n\nThanks! \n\nPs. All kidding aside..the crostinis are AMAZING. Get the duck. Or the fig, if you like fig. And then wonder why the fig comes on a piece of crostini the size of your face, while the duck crostini is itty bitty.", "author": "Saskia S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}