{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Always so good! Love the seasonal menu and especially the waitress Kristen! She's the best!", "author": "Kay E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Amazing food. local ingredients. Attentive staff...\nVery cool ambiance in a relatively small dining room.\nEverything was perfect...", "author": "Marc W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "One of my most favorite places in NYC and definitely the best restaurant in Brooklyn heights. The food is excellent and consistent every time we go. The duck egg dish is probably my favorite and the fresh doughnuts for dessert. The crostini and cocktails are always point on.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "We visited Colonie back in November right before Thanksgiving. When we arrived for our 8pm reservation the place was bumping! The bar/entry area is very small so we were shoulder to shoulder with the folks around us. They were a tad backed up the night we dined but were very apologetic and kept good communication with us while we waited. I think we ordered everything on the menu and it was all phenomenal, no joke. The house made ricotta and pork chop were especially good. I am super impressed with the exec chef who grew up in small town Maine and made it in the big city! Bravo Colonie!", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "Had high hopes for this place. Went for brunch the other day. Loved the decor and service was attentive. I got the kale and Gruyere scramble - it was good but nothing spectacular. Would like to come back and check them out for dinner.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "I confess, this is my regular brunch spot.  If you ever are there for brunch, you might catch me and my buddy at the bar, eating, drinking and yukking it up. \n\nMy brunch drink of choice? The Michelada. Meredith makes the best one I've tasted and they should just rename it Meredith's Michelada. \n\nFood?  Love them all.  I could probably write an epic poem on every dish.  Special mention of the shrimp and grits - try it if you are in the mood for something different.  And the donuts are small but very addictive. \n\nStaff? We love all the bartenders and Meredith is the best of the best. \n\nThis is THE brunch spot in BK.  My tip? Sit at the bar.", "author": "Ming O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "My friend and I ate here after she was rewarded a chef's tasting for two for contributing to \"Start Up\" a few months back to help with the opening.\n\nWe made reservations and were seated within 15 minutes of arrival. The services was amazing - attentive, polite and not too smothering. The food was creative, rich, filling, and the wine paring was perfect. The night was capped off by meeting one of the lovely owners. \n\nI felt really proud to have been supporting a fine dining experiencing in Brooklyn. Manhattan always gets the glory but Colonie will show them that Brooklyn will win their hearts! \n\nQuick tip - make reservations!", "author": "Leah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Such a great spot! Open kitchen with a rustic feel to it. The food was amazing! We shared the oysters and it was so fresh. The squid ink pasta was also a winner", "author": "Christine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "I'm docking them a star because the brunch burger used to be my favorite item on the menu (heck, possibly my favorite burger of all time, exluding my grandmother's of course), but something about it has changed in the last few months. It used to come juicy with piquant spicy mayo on the bun and a restaurant-made ketchup blend for the shoestring fries that was both tangy and sweet.  I'm ashamed to say it, but I wouldn't wash my hands after eating that burger so I could smell them later in the day to remind myself of its sensory delights. For whatever reason it's now more pedestrian, something akin to a Shake Shak burger, and I'm left wondering if it was all a dream or if some sadistic kitchen warden decided that the human race did not deserve such a palate-pleasing comestible.\n\nOkay, I'm done with the hyperbole. Seriously, great brunch spot. The chef's table is fun and novel when dining in pairs, and the seats at the front offer pleasant views of the hustle and bustle of Atlantic Ave (mostly ageing hipsters and traffic, but better than nothing). Friendly service, thoughtful, tasty dishes, and a charming \"living wall\" of greenery towards the center of the restaurant.", "author": "Aaron F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "I was in town for a wedding nearby and the bride recommended Colonie as a good place to find some brunch. My cousins and I walked over and arrived late - about 1:45 on a Sunday - and were seated almost immediately by the charming host. \n\nI loved the open kitchen and the wall of greenery hanging beside it. We ordered iced coffees (a ginger beer for my cousin) and all were refreshing after the muggy walk over. We ordered the duck hash, the biscuit Benedict, and the hamburger with fries. All were really, truly delicious. \n\nThe duck hash was super-savory and rich - those potatoes were fried up perfectly! The duck interspersed was tender and awesome. Not a traditional \"hash\" in that everything is put together and fried up, but still awesome. Add a runny poached egg and you've got a winner.\n\nI'm not normally a fan of Benedicts (see discussion of hollandaise in Bourdain's \"Kitchen Confidential\") but this one was excellent, both the parts and the whole. The biscuit was divine, the ham salty, the eggs perfectly poached, and the hollandaise rich yet tart - it had a lovely lemon presence and I died over it. All hollandaises should be so lemony! All together it was a fantastic bite. \n\nI did not try the burger but my cousin reported it was excellent. We nibbled on his fries, which looked like they were not going to be that good, but they WERE. And I'm a fry snob so that's really saying something.\n\nFinally, we ordered the three filled donut holes both before the meal, and after for dessert! The salted-caramel vanilla cream was very tasty and you definitely got all of those flavors. Nutella was nutella (shrug). My favorite was the strawberry jam - tasted so much of strawberry, was not too sweet, and there was lots of it crammed into that little donut. \n\nBravo, Colonie! I will be sending folks your way for sure.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "The food here is consistently good and the living garden wall is lovely.  Try the rabbit and the duck eggs.  It also helps that most of the patrons here are easy on the eyes.\n\nMy main thing: Every time I go to restaurants like Colonie (hip farm to table, locavore cooking joints), I can't help but feel like the majority of diners in this city have never cooked in their lives.  (Which is a realistic assessment, since most of our kitchens are like 2 x 2 feet.)  But here's a secret guys -- most of the 'awesome' and 'mindblowing' favors in the dishes at Colonie can be replicated by putting whatever you like into a hot  cast iron skillet with a stick of butter and some salt, pepper, and thyme.  Try it sometimes.  You will spent about 1/10th of the price and not even have to wait 3 hours while the hostess keeps misquoting your wait time.  Having worked in restaurants during college, in the Meatpacking no less, I'm very sympathetic to restaurant staff normally but thought that her unrealistic wait times were very unprofessional.  If it's gonna be 3 hours, tell us! \n\nMy second thing: Why the heck is this place called Colonie? I mean what is it a 'colony' of? Mature, high income hipsters?  Colonialism isn't romantic, people.  Doncha remember your liberal arts education?", "author": "Gia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Found this foodie spot on my first venture out in the neighborhood, and I'm still thinking about how delicious the food was!  We ordered appetizers and drinks, including the Ricotta Crostinis and the Brussel Sprouts (a must try).\n\nCan't wait to go back.", "author": "Jade L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Absolutely loved the shrimp and grits. Sampled my friend's pancakes and had to be asked to slow down lol DELICIOUS brunch + cocktails !", "author": "Janelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "Have been to Colonie twice since they've opened and have mixed feelings about the place.  The food is good, but it's definitely still working through it's new restaurant jitters.  The portions are tiny for the price.  The two of us shared a crostini, each had a big dish and shared a carafe of the house wine and our meal was $120.  It's a bit crazy.\n\nMy second visit there I encountered quite a wait.  The host informed me it would be an hour, so we headed over to Roebling for a cocktail.  We came back an hour later and the host informed me it be another 1/2 hour.  Now, I get that's it busy but I feel that if you're a restaurant that doesn't take reservations then you should be realistic about your wait times.  I was ready to say let's just go to Henry Public but my friend had never been and really wanted to wait.  Honestly, no restaurant should have an hour and a half wait but we stayed anyway and had a good, albeit expensive meal.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Despite the crowd, they were able to sit us right away at the chef's counter in the back for a 1:30ish Saturday brunch. That really helped the overall experience. I can imagine having to wait much longer and being more cramped in one of the other seating areas so that's the only reason I docked them one star. But if you value living well then go get the duck hash with a large pot of their french press coffee. Finish with the doughnuts. This is the fastest way I know of to start believing in God.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Here for brunch today....Very nice interior; industrial with a rustic feel. Our waitress was excellent! She was very attentive and paid attention to every detail.\n\nI had the french toast which came with a berry jam, whipped mascarpone, and maple syrup. It was all delicious and filling. I also had a side of well scrambled eggs ($4).  I passed on a cocktail this morning (was out too late and had one too many drinks last night), so I washed things down with a perfectly brewed earl grey. \n\nI will most definitely return here the next time I'm in the BK.", "author": "Chi E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "brunch was awesome, coffee is perfect and service is on point. jump in and eat at the bar if the place is crowded, much better eating experience. must stop when in the heights!", "author": "Timothy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Colonie is spectacular in everyway - service, food, decor.  It is one of the best run restaurants in Brooklyn.  I've been here numerous times for brunch and dinner, and have sat at the bar by the chef's station.  Watching the chefs, servers, runners, callers and hosts run like clockwork is a testament to Brad McDonald and the owners.\n\nFor brunch, I've had the pancake, duck hash, burger, monkey bread, eggs benedict - but not all in one sitting.  The pancake is literally a cake in a pan - thick and doughy and buttery.  Duck hash is probably very bad for you, but seriously unbelievable delish.  Monkey bread is freshly baked with a sticky sugary coating on top.  Burger is spectacular.  \n\nFor dinner, all of the mains are perfectly executed.  The scallops are cooked to a T with microgreens and peas and carrots, really some of the best I've had.  Pork chop and Steak are meaty and seasoned well.  Butter lettuce is so simple yet revelatory.  All the crostinis are toasted and topped with various goodness.\n\nUgh, I really can't say enough about this place.  Never change Colonie.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Great Spanish spot. The food is excellent, the wine is excellent. I wish that maybe there were a few more options on the menu, but the seafood and fish are great- and with a Spanish flair.\n\nDefinitely try it out when you're in the neighborhood.", "author": "Petra A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Wonderful restaurant. Quite busy but a large/well laid out place to accommodate. We were seated at the bar in front of the open kitchen which was quite a nice experience. \n\nThe oysters were delicious. The pasta sauce was amazing. And the steak was divine. Perfectly medium-rare. Service was not too slow. \n\nNice decor and fitout too.", "author": "Thu L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}