{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "This is a great restaurant.  I stopped in after a busy week and ate at the communal table that is seated around the kitchen.  I had the heirloom tomatoes with feta to start which were full of flavor (no sea salt from the tiny dishes near by needed) and then I had the striped bass which was cooked perfectly.  \n\nI learned from the chef that all of the food is sourced locally. I know that's not a new \"thing\" these days, but it was impressive to hear how much went into actually operating a restaurant with locally sourced food.   \n\nThe portions are not huge, so I definitely had room for dessert.  I tried a couple of their donuts with a salted caramel creme on top.   They were, quite honestly, pieces of heaven!   \n\nAs I had a great view of the cooking and food preparation in their (only) kitchen, I was able to see everything being made.  Everything looked delicious.  Next on my list are the scallops, quail egg small plate and steak.  The head chef runs a great kitchen, everyone was working in unison, had great nature about them and seemed to be enjoying themselves.  \n\nIt's so nice to have a place like this in Brooklyn.  I'm definitely becoming a local!", "author": "Cristin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "It's on what, 10 years ago, was a nondescript block of Atlantic Ave. near the BQE; its neighbors were a burger bar, an \"old man bar\" called Montero's (cool neon sign), and a Tex-Mex Brooklyn chain place, which has since closed. The two-thousand-aughts have brought a chic/hep vibe, and it's in that universe, rather than the stale beer one, that Colonie is situated.\n\nIt's a nice place: it's storefront width and fairly unadorned with exposed brick walls, but came off as airy and pleasant. The back is where the restaurant proper is, highlighted by a bar around an open kitchen. The clientele is very \"new Brooklyn\": mid-30s couples with $900 chunky glasses and three young children and the young'uns who aspire to be them. \n\nThe menu had an appealing \"artisinal-this, artisinal that\" theme. A friend and I ordered breakfast foods here and were surprised at how humdrum the food was. The pancakes were a single pancake, cut into quarters, with a little diner pitcher of syrup. The bacon was two strips that wouldn't look out of place at the diner where that syrup came from, although it was smoky and flavorful. For two, with bloody marys, this was more than $50. \n\nSo, I'd say this is a great place for a second date or to show out-of-town friends a cool place in your new hometown. But I wouldn't rush there for the food.", "author": "Walt N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Hubby and I stumbled into Colonie hot, sweaty, and starving on a Friday night after other dinner plans fell through. We had no idea what the wait might by (I don't think they take reservations). I think the hostess could see the desperation on our faces and we were seated immediately at the very back table (which was actually awesome b/c there is a lot of separation so it feels like a very private table). Our waiter could not have been nicer and more helpful with all of our questions. We had the meat plate, several drinks, scallops, striped bass, and brussel sprouts. Everything was delicious and well worth the price. The decor is so lovely. Don't miss this great spot in Brooklyn!", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "Colonie hosted a perfect birthday dinner for my partner's 40th.  First and foremost, from the planning stages to the night of, the owners and staff could not have been more accommodating and gracious.  The beautiful atmosphere, customized 4 course menu, hand selected wines and impeccable service all added up to a perfect evening for our 28 friends and family.   And the food was absolutely delicious...  They deserve a Michelin star.  Lots of Love to Colonie!", "author": "Jason B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-03", "description": "Wow. I swear I ate at a different restaurant than where everyone else ate... \n\nI went to brunch there yesterday for the first time, after hearing good things about the place. We had a great table in the back, and ordered some delicious tea and coffee (in your own french press - fantastic!). And that's about as good as it got.\n\nThe leek/gruyere scramble was half-cooked, uninspired and rather grey. The tastes did not blend well, even if it had been cooked thru. The side salad was giant pieces of lettuce drowning in dressing. The chef didn't even bother to tear them or give them a chop. I have little tolerance for that kind of laziness. \n\nPotatoes were mushy, boring, no seasoning, not even salt. The Biscuit Benedict had a delicious and quite perfect hollandaise, but the biscuits were like hockey pucks - no fluff, no air, overbaked. The bread basket was teeny and just no better than any of the bakeries up the street.\n\nThe service wasn't horrible, but it wasn't great. The place was packed with a line out the door, and it took our server nearly 20 minutes to bring the check when we were done. Chipped plates \u0026 mugs, too. \n\nI expect better care \u0026 attention from a restaurant that has such high ratings.", "author": "D B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "Super pretentious and overpriced.  Our waitress was uptight and just not friendly.  The food was just alright and definitely not worth the money.  The people who like this place must be crazy or assholes.  Good luck.", "author": "Ava S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "I was really excited to say the least when i headed to Colonie with a group of six for sunday brunch. The place is very cute,modern and i liked that they had an open kitchen where you can see all the food being prepared. Our group decided to order the \"basket\" of assorted donuts which turned out to be four very,very tiny donuts that were ok but certainly not worth the $8 price tag. As we were ordering our dishes,our server proceeded to tell us about their special burger which was to be served Medium and topped with an egg and \"because of limited quantity there would be no substitutions allowed\". Now the burger sounded great to me and so i asked our server if i can order it but to leave out the egg(not a fan of eggs) and he said that the burger would not be served otherwise. Clearly,i was not asking for substitutions but for me to order the $18 burger sans the eggs! Anyway,i went ahead and ordered it and handed over the egg to a friend. The burger was again ok and definitely served Rare! As we were heading out,one of my friends who was a bit stunned at the burger situation insisted on letting the manager know that we were not happy to be denied such a simple request on my part. The manager went on to defend the reason why the burger would not be served without the egg(because the chef believed the burger would not taste the same without the egg). Really? Its a burger. Needless to say,will not be returning.", "author": "G T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-03", "description": "Went here for a celebratory family dinner the night after my wedding and was extremely disappointed with the entire experience. The food was ok...but not great, and definitely not as good as some other local places nearby. The thing that totally ruined the experience was the staff. The waitress was beyond rude, pretentious and unprofessional, to the point where she would visibly scowl and roll her eyes when a glass of ice or extra fork was asked for. Definitely not returning. Ever.", "author": "B S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "The ambiance and food is consistently a positive for Colonie.  Where they consistently lack is in the service.  Beyond slow waiters, no one ever even checking up on guests.  Someone dining should have to flag someone down to take their credit card or get water as that is just part of the service expected when eating out.  The food is good enough to get me back but I have to take a chill pill before walking in the door.", "author": "Lynette B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "Other than the food not being absolutely terrific, I enjoyed everything else.\nCool space.  Great neighborhood.  \n\nStaff was pretty good (fyi: when I overtip you it's always a nice touch to say thank you and not ignore me when I pass you on the way out.  It makes me regret the 40% gratuity you got just because I waited tables at one point in my life and believe in Karma).\n  \nBig fat open kitchen and cool surfaces and decor.\nI just didn't have great plates.\n\nThe Egg was the star player (but what's that crunchy stuff?)\nThe Octopus wasn't feeling well.\nThe Scallops were tasty and fresh and I ate around the apricots/eggplant.\nThe Chicken was better once I got it away from the pool of mustard.\n\nOverall the front of the house staff could use a little reigning in.  \nYou're working, I'm paying.\n\nAnd I'm thinking I just caught the kitchen on either an off night or a point where they're sick of the menu.  I felt like there might a lot talent in that team tho.\n\nStill better than most.", "author": "Wilbur B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-02", "description": "1. Amazing atmosphere\n\n2. Excellent service\n\n3. But was underwhelmed by the food experience. Hope they build on their culinary skills.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "Gracious service and truly excellent food. My group of hungry diners came away impressed, very satisfied and satiated, and charmed. One of the best restaurants we've been to in Brooklyn without a doubt.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-20", "description": "Food ranged from really excellent to not so good. The wines by the glass were just ok. Love the bar and the open kitchen. The space is nice, and the people are nice. There are just way better options in the area. I don't think we would be back but not because of anything bad, just because you can do a lot better for a lot less money.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-18", "description": "Great presentation and good food. The duck is outstanding. Mmm cheeses! The octopus wasn't  charred enough to my liking but nonetheless the meal was great. 3 out of 5 only because service was sub par on a slow Tuesday night. When I'm one of a few tables- pay me attention- I'm one of the few tips you'll make that night. Flirting with the bartender will not get you 20% + in tips. Focus on the customer, a huge pet peeve of mine.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "My girlfriend and I live around the corner and it is our go to spot.  Love everything about this place.  Great atmosphere, menu is ever changing with seasonal fresh ingredients and the wine/drink list is great.  We try to order new dishes every time we go, and have yet to get a bad one.  Really recommend it to anyone in the neighborhood, or anyone looking for a great date spot in BK.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Eaten here twice. Food, service, and atmosphere are 5 star imo. Of note the cucumber juice, crostini of egg and bone marro, cavatelli and peas, berkshire pork chop, donuts. Keep it up!", "author": "Ben M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "We came here for Valentine's Day and enjoyed a cozy dinner at the bar in the back of the restaurant, watching the cooks at work. The beer list was strong, the steak was perfect, and the atmosphere was just right. I definitely recommend this for dinner in Cobble Hill.", "author": "Julia E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "After hearing friends talk about Colonie my husband and I decided to check it out last week.  Upon entering I was impressed with the atmosphere - and pleased with being seated at the bar overlooking the kitchen.  The night started off on a high note with my strawberry-habanero margarita but then continued to go downhill from there.  The octopus appetizer was the best thing I ate while there - but definitely not the best I've had.  We ordered the scallops, pork chop and a side of brussel sprouts (fried with bacon and cranberries).  My scallops were slightly overcooked, my husbands pork chop was undercooked and the brussel sprouts were not fried - they were charred.  Charred black.    \n\nColonie had potential to be a gem in the neighborhood - but it will take a lot of convincing for me to return.", "author": "Becca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-09", "description": "We came here for brunch the other day and ordered just about everything on the menu.  All of the food is outstanding, service is great and the restaurant is clean with a trendy vibe.  It was very crowded around noon on a Saturday but by 2ish the brunch crowd started slowing down.  They have amazing drinks and fresh squeezed juices.  I highly recommend if you're in the area for lunch or dinner.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "My husband and I walk in on an early Saturday morning.  Prime brunch time!  There was a five minute wait, since they had to get a table ready for us.  I thought the atmosphere was spectacular with a wall of plants and wooden theme.  Where I sat I could see everyone working hard in the kitchen.  I also noticed that the portions were modest.  I thought it was just enough, but people on my right were complaining the entire time about the size of their food.  My hubby got the duck hash which he was reeling over, it was apparently tingling for the tastebuds.  For my decision, I went with the yogurt granola which I found fresh and delicious.  I especially like the wooden bowls that my food came in.  It made it feel as if it came from mother nature herself.  It has a nice calming effect being surrounded by plants and wood.  I'm not sure how to put it into words, but I would recommend just visiting to see it for yourself.", "author": "Polly H."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}