{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-20", "description": "The setting is lovely inside Colonie but the food is mixed. The desserts were uniformly good. Drinks were fine. The gnudi were delicious but the dish comes with 5 (!) tiny pieces. The kale salad was good - not sure why they threw the candied almonds in but ok. Finally the cauliflower - undercooked and bland. I wanted to like this place but really it isn't worth the $$.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "I was really excited to try this place after multiple recommendations but also saw the recent negative reviews on yelp and so I went in with somewhat low expectations. We ordered the Ricotta crostini and it failed to wow us.  It tasted like a glob of ricotta on toast.  While our meal started off rather disappointing, what came next was phenomenal - scallops!  These were by far the best scallops I have ever had and until that day I didn't realize what a fan I was of scallops.  They were tender and grilled to perfection and I still dream about them today.  My husband had the steak and he said it was also fantastic.  The meal had a perfect ending with some freshly made donuts...mmmm...mmm... gooood!  Oh, beware about coming here on a very hot day as they do have an open kitchen and it can get pretty toasty in there!", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Ambience is amazing; it's truly a treat to sit in this restaurant. The server we had was very sweet and very attentive; our water glasses were constantly refilled. We ordered a cheese appetizer and it was served with a very thin, almost matzoh-like, cracker and strawberry-balsamic compote, delish. I ordered the hanger steak (MR of course) and my gf ordered the ricotta gnudi. Both were very good, but not great. Their menu is varied and interesting, as is their drink menu. Definitely a place worth checking out.", "author": "Jared A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Another gem. It's not cheap, but well worth it. The food is superlative. The quality of ingredients is on par with greats such as Red Cat. Atmosphere and service unobtrusive, professional and pleasant. So much of a great restaurant comes down to the owners vision and a great GM. There's no doubt in my mind they hired committed and passionate pros to run the place. It shows from the moment you walk in to the last bite of perhaps the most amazing desert I've ever had (some kind of fritter).", "author": "Tim N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "I love finding great restaurants in BK Heights. Such a great neighborhood with so many options. \n\nThis place has a great vibe, interesting cocktails and friendly staff. Unfortunately it was packed and we didn't have a reservation so we had to sit at the bar right in front of the stove(is that the right restaurant term?) (they have an open kitchen, sort of where the bartender would be). It was very, very hot by the time we left.\n\nOysters and cheese plate were delicious. Would definitely go again.", "author": "C J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "This place is EXCELLENT.   We've been there twice and like to order a bunch of plates to share.  They chose how to pair the dishes and spaced out the timing of the meal perfectly.  The atmosphere is great and the food is delicious.  Brussell Sprouts and Date Cake are not to be missed!", "author": "Katy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Maybe I'm biased because I have a crush on all of the employees here, but Colonie delivers every time. Food, service, \u0026 atmosphere are consistently spot on. This place has a strong identity, and a confidence that comes with having a long track record of success. The menu is your standard American-New fare, but its done extremely well. I appreciate when a restaurant doesn't try to be all things to all people, and instead just gets the basics right.", "author": "Car M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "Some of the best dishes around. Chef Brad McDonald, veteran of Per Se and Noma, brings his seasonal menu into a great space on Atlantic Ave. I always try to sit at the counter in front of the open kitchen in order to see all the action. The rabbit and foie terrine is one of my favorite dishes anywhere. And few desserts in the city are as good as the sticky date cake. Prices tend to veer toward the expensive side for Brooklyn and the wait can be insane at times (1-2 hrs) since they don't take reservations for groups under 5 people. My advice is to find 4 other people and make a reservation. 5 stars for the food, minus a star for the price and wait times.", "author": "Joon K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-07", "description": "Just went there tonight for dinner with my husband. A former colleague and chef asked if I had been yet and it has been on our list so we decided to make the trek to Brooklyn for the evening. Coming in out of the heat and humidity we had a hard time cooling down in the barely air conditioned space as the gentleman at the next table visibly dripped sweat while hi date fanned him.\nThe menu sounded much better than it tasted. The food was not bad just flavorless course after course. The service was on and then it was off, completely inconsistent though pleasant when our server was there.\nGreat space and rustic decor but there are 10,000 great spaces in the city.\nUnfortunately nothing worth remembering.", "author": "Kathryn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Very pretty and cute presentation. Cool and yet somewhat romantic atmosphere.\nKind staff. I loved sitting at the bar by the open kitchen and watching the chefs. Sometimes chefs will just serve you the plate since you are right there anyway!\n\nFood was good... personally didn't like the pickled eggplant in my entree but overall everything was yummy and well presented. Pumpkin pie with brown butter icecream was amazingly!!!", "author": "Erin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "We have just returned from the most delicious dinner at Colonie on Atlantic Avenue. Unbelievable! Am so happy that this restaurant has come to Brooklyn Heights, with such a renowned chef to boot! Brad McDonald, we've just found out, has worked at Essex house, Noma and Pe Se in New York. In a nutshell, you can tell. We are blown away! \n\nSuch friendly people, such esquiste food and only a block away from our house! \n\nBrooklyn, with this new restaurant, a new Barneys Co-op and the Waterfront Park starting to look so fabulous, you are really shining!", "author": "katie d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "very simple. Love it. Love it. Love it. (food, ambiance, service).\nBut seriously. I live around the corner and was thrilled to hear about this restaurant. the neighborhood needed this.", "author": "john j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Expensive, hard to get a table, good food, slight snootiness in the service.  A little too much Manhattan in this place, but sadly this is the new normal for Brooklyn", "author": "Tom P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Inventive cuisine, friendly staff, inviting atmosphere. What more could you ask for? Worth the hype.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-03", "description": "Hard to live up to the hype - the brunch cocktails were great, but I had to send my (cold!!) poached egg back on my duck hash. Between the not-so-inventive brunch menu and the chilly egg, I am unlikely to return.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-11", "description": "We dropped off the toddler and went for a weekend brunch. I've heard very good things about this restaurant and it took us a while to try it.  First off the music is freakin loud. Part of a dining experience is the environment and vibe. Good energy but the loud music was a strange mix and I was fighting to be heard over the music. We sat at the open kitchen area which seemed less crowded then the communal tables. The dozen oysters are $30. Crikey. My hamburger was good, fries too salty and husbands duck hash was a lot more hash then duck. The waiter really turned us off. The robotic \"professional\" waiter--doing me a favor by getting my 2nd glass of wine 15 minutes from ordering it.   The food was above average and hit the spot but the overall experience wasn't as enjoyable as we were hoping for.", "author": "mj b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "I go here for brunch pretty often and really like it. I have tried a number of different things on the menu-the pancakes are to die for, but be warned it is a huge portion/incredibly sweet. I also really like the leek and gruyere scramble-it is simple but good and comes with really good potatoes on the side. The basket of doughnuts are also delicious-the nutella filled one being my favorite. This place can be pretty pricey for brunch (especially if you order drinks) but it is a really cute restaurant with good food and a good atmosphere.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "Having only been to Colonie one previous time for drinks at the bar, I was highly anticipating my return for dinner. I had met the owner Emily at the bar the last time, and she could not have been more kind, welcoming, and personable. \n\nWhen I walked in last night, I noticed two seats available at the chef's table, where my friend and I were immediately sat. We were greeted graciously by their new head chef Brad, who took us through an evening of about four courses, one entire course of an incredibly delicious fluke liver and a pork dish that were not on the menu and were absolutely outstanding. Other highlights were most certainly the crostini (ricotta, honey, and mint/egg salad and smoked marrow) the pork belly with cabbage, and the brussels sprouts. Another bonus was the chili strawberry margarita - a perfect blend of spicy and sweet. Chef Brad was an absolute pleasure to meet, and was almost like our third dinner guest - conversing with us the entire time while also providing us with an education. \n\nDuring dinner, Emily came over to chat and remembered both my friend and I from when we last visited about two months ago. I found this extremely impressive. I truly felt as if I was at a friend's house for dinner last night. Everyone went out of their way to make sure our experience was exceptional without being over the top. \n\nI will continue to go back again and again. Thank you Colonie!", "author": "Greg S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "Update: Add another star.\n\nWent back. Again, the place is slammed. Sat at the bar, no problems. I don't know there reservation system, but since I was only with my girl...it seems to be easy to get a seat. This place fills up, so good luck.\n\nHad the risotto again, and it was very good. My girl got the scallops, i had the fluke, both were again really good. No issues on temperature this time. The side of brussel sprouts were better...the bacon was much better this time around.\n\nLooks like they got some of the issues worked out. The place gets crowded...and they only really have a few entrées on the menu...but have good 'small plates'...and a meat and cheese thing going on (didn't try that). So far...it's been pretty good. Scallps were $18, and my fluke was $23 i think.", "author": "Allen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "Went here for brunch with my boyfriend a few months ago and have been meaning to write about it ever since. With so many trendy places popping up, I've been disappointed with interesting decore and average food. Colonie, from my experience, has gotten (almost) everything right. THE FOOD-and that's what any restaurant should really be about-was absolutely delicious. I don't remember the last time I so thoroughly enjoyed every bite, all atmospheric considerations aside (and Colonie is very quaint yet modern and cool in terms of decor). I had the scrambled eggs with gruyer and asparagus...seriously, right down to the home fries (which, let's face it are usually a boring yet necessary side dish) were just divine. Can't wait to try Colonie for dinner!! Down side? a little too close quarters in terms of tables and the staff wasn't the most attentive. Still! Worth trying.", "author": "Amanda C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}