{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-03", "description": "The food here is good, but it is overpriced.  We started with the grilled endive salad; I was expecting it to be at least warm, but it was in fact just a small plate of clammy, mushy endive.  There were some items in the salad (a few tasteless \"pear chips\"), but all I could taste was endive, and it was just ok.  Entrees were better -- my friend had the scallops, which were tasty, but nothing special, and I had the cod with kale, which was perfectly cooked and very good.  The best item we tasted was the sticky date cake, which was a delicious mixture of savory and sweet.  Service was friendly and attentive.  My only major complaint is that everything is at least a couple of bucks too expensive (the endive was $11, while the scallops were, I think, $22 for four medium sized scallops with no vegetables/sides) for cooking which is solid but not particularly creative.", "author": "P. J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-21", "description": "I want to give this a 2.5 but can't so we'll round up (out of generosity.) My husband and I live in the area and decided to go for an early dinner on Sat. We sat at the \"chef's table\" which was fun, and had a yummy cocktail to start. Next came the ricotta with honey and mint crostini, delicious and super simple, then the beet salad with orange and crispy hazelnuts. To this point I would have been happy. The restaurant itself is very beautifully designed and I loved the feel. Then we ordered \"small dishes\" for our mains since we both did salads, I had \"The Egg\" since I'd read it was a must and he had the orchiette which was super tiny but good. My egg was cooked through- huh? This was supposed to be a delicious runny egg on top of wheatberries and mushrooms, not so and it took a while for anyone to come ask about it. They sent it back (I hate doing that) and after we'd finished everything else the new dish appeared. It was good, not great, the egg was burned around the edges. The brussels sprouts were pretty amazing and earned the place an extra star. After having  a few small dishes and a drink the bill came to $112. This makes me hate living in NY. What? I could have cooked a better meal at home, sorry to say but true. The bill left a bad taste in my mouth especially since they barely apologized for the egg- no dessert, no drinks no comped dish. I wouldn't recommend it, maybe for a drink in the front but that's about it.", "author": "Amy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "Love this place! Great addition to the neighborhood. Try to sit at the counter to watch the chef's at work! It's a lot of fun, and the food is superb!", "author": "Alicia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Came here for brunch with my family, and since waiting for a table would have been a little too long for us, we decided to eat at the bar, which was totally fine.  The bartender was friendly and responsive, and on the whole I found the staff to be very pleasant and helpful - they really tried to get us to a table, but it just wasn't working out.  The food, on the whole was really delicious.  I heard rave reviews about the steak sandwich from my stoic Irish-Catholic father who will pretty much describe just about anything as \"fine,\" and the ramp scramble from my mother.  We ordered the \"basket of baked goods\" which were also excellent.  I had the duck hash with roasted fingerling potatoes and a poached egg.  Firstly, only including one poached egg I feel was a little more than stingy.  Second, it was less poached and more borderline hard-boiled it was so overdone.  Which is really a shame because I was very much looking forward to having that yolk mix in with the potatoes and duck.  Speaking of the duck, the dish was probably 98% potatoes, seriously I think there were two small pieces of duck in there.  And while those two pieces were incredibly delicious, I was left scratching my head as to why this was considered a main course.  I mean, really it was half an ounce of meat.  Not cool for $13.  Oh but the BACON is delicious.  The bloody Mary was good, interesting they used jalapeno, but needed more heat.  The ones at Henry public or Jack the Horse are way better. I wanted to give this place 3 stars on account of the silly portion size, but the cooking here is pretty special.", "author": "Colin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "I went on a great date last night to Colonie in Brooklyn. The second you enter the restaurant you feel like you are in a farm to table restaurant in Rhinebeck or Woodstock. The bar is beautiful and the sitting is unique. There is an open kitchen and the staff is so friendly and inviting. We tried a lot of great small dishes. I recommend them all. The Egg dish is fantastic. It is like nothing you have eaten before. So unique tasting with the spelt. My mouth is watering thinking about it. We also had the risotto, which was probably my least favorite although I would definitely order it again. A little chewy, but definitely seemed like the taste the chef was going for. Do not skip the mushroom crostini. The bread is seasoned and grilled perfectly, the thyme on the wild mushroom is fantastic. We shared the two pieces of crostini, but I definitely wanted them both to myself! We also had the beet salad. The hazelnuts are incredible, you will want to eat them by the handful. The ricotta salada really compliments the rest of the dish. I always love shaving it over my pastas. Will definitely start using it in salads. If you have room for dessert (we didn't), definitely try one. The people sitting next to us seemed to order one of everything and it all looked good. Well worth the trip to Brooklyn!", "author": "Liv R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-01", "description": "What a horrific and unprofessional place!! Hostess is condescending. My guest and I waited for 80 minutes for a table while we were told (prior to arriving) there was a 20-30 minutes wait. Once we got there (in 10 min), a gentlemen at the restaurant said the wait was more like 45 minutes. No problem, we waited patiently until the gentleman came by and offered us two chairs to face the chef. It's like the bar table except you are facing the chef. We declined politely and said no, we are here waiting for a table. When it was almost 1 hour and 10 minutes or so my friend got upset and told the hostess that it was not cool to which the hostess replied that you were offered a seat. F this place I say!! If we wanted to see people prepare food at a restaurant in our face then may be we will eat at a cart on the street. Very disappointed. This place thinks it is in Manhattan and charges Manhattan prices but I am afraid food is about average and service, I think, I already gave enough details on. One distinction: our server was great and provided very good service for which I was happy to tip 30%. Never will we go back to this sick place unless a client specifically asks for it! I manage a firm so one never knows.", "author": "Sid R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}