{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Okay, so Colonie is not a 3 star restaurant.  Every time I return, it's a memorable, good (sometimes great) meal.  Their vegetable section is unparalleled - I love their brussel sprouts, spaghetti squash, and cauliflower.  These dishes are hearty enough to have two as a main course.\n\nTip: although I generally dislike well done red meat, if you want your burger done medium well, you should emphasize this to your waiter.  My boyfriend has never received a medium well burger, though that's how he orders it to be cooked.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "Sigh. The location of this brunch spot is ideal for Cobble Hill/Brooklyn Heights residents, but it fails to deliver. \n\nBefore I get into the bad, I will say the restaurant is GORGEOUS. It looks like a great place for a date, brunch or time with family, that's how versatile the space is. I love the high ceilings, plus it was nice and cool on a rather warm day (I'm sure it's toasty when the temperature drops).\n\nBut on to the bummers: Our service was sluggish, the food was just fine and everything was rather overpriced for the area. The waiters and waitresses here seem the be the main complaint of the Yelp reviews, and I totally get it. There seems to be some major miscommunication between the kitchen staff and the servers. I think if they polished up the menu, knocked off a couple bucks from the mains and got everyone talking to each other this could be a sweet spot in Brooklyn Heights close to the park. Until then, I'm dining elsewhere.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Every dish was a perfection. The service was incredibly friendly and fast. A pleasure! Will be back!", "author": "Inna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Walked into the restaurant on a Sunday night for dinner and we were greeted by a very friendly gentleman and he informed us of a 15 minute wait. Our friends were running slightly late and so we parked ourselves at the bar and ordered a drink.  I got the empire sour and the fiancé got a whiskey - both were very good. 5 minutes later, our friends arrived and we were shortly seated at a table for four.\n\nWe ordered five appetizers: duck eggs, brussel sprouts, carrots, and grilled octopus - which were all extremely delicious. Four entrées we ordered the lamb, Fried egg burger, white truffle tagliatelle, and a parsnip purée dish.\n\nI think the appetizers outshined the entrées but all of the food was really delicious and fresh. The service was swift \u0026 friendly.  I would most definitely bring friends to this restaurant in the future.", "author": "Ling N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Would have been a five star rating but after our main course (which was outstanding), the service dropped off considerably. Waitress completely disappeared. Oh well, still a stand out in terms of food and vibe. New favorite despite service issues.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "All the pictures looked appealing, but our pancake was obvious reheated and had a very bitter taste in every other bite. It was sad to not be receiving fresh food. And you only get 3/4 of the pancake. Which is weird. The atmosphere is pretty and service is ok, I felt pushed to get other things. But again, or pancake was neither hot nor fresh.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "love this place! you should try duck hash, it's amazing! I haven't tasted anything else on the menu and we go there at least once a month. Expect a bit of a wait time as it's always crowded on the weekends, but it's usually around 20-25 minutes.", "author": "Amber K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "We stopped by somewhat by accident but had a great time.  Sat at the bar and had drinks and cheese and veggies.  All great!!  Definitely recommend!", "author": "Keith C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Love the ambiance and aesthetic of this restaurant. We stopped in here Saturday afternoon for a cocktail while walking around Atlantic Ave. I had a glass of wine which was fine but my boyfriend ordered one of their specialty cocktails and the bartender poured it from a pre-made bottle! It tasted horrible and to charge $13 to get a pre-mixed cocktail is absurd. This is NYC, and the bartender can't even make a drink to order? We were extremely disappointed in this place. It wasn't our first time at Colonie but it was our last.", "author": "Laura Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Great brunch, decent dinner. My main quibble with this place is that, booze-wise, you don't get what you pay for: their Bloody Mary's come from a lame mix, yet still run you more than $10. Their wine pours are stingy and expensive. Brunch fare was good, but dinner was unimaginative and tiny-portioned. The burrata, for example, was $16 for a speck of cheese.", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I had a good brunch expeience at Colonie. My cousin, her friend and I decided to meet up here to catch up with each other and enjoy some good eats. I had heard nuff about their duck hash and was looking forward to indulging. \n\nWe were seated at a corner of the Chefs table and were immediately greeted by Chef Paul. We watched him and his team pump out dish after dish; damn that bacon looks good, oh look thats the shrimp and grits, yum look at how thick the biscuits are, oooo look at that pancake! I was sold!...Two orders of shrimp and grits with a side of bacon and one order of buttermilk pancakes with creme fraiche and maple syrup; Ill save the duck hash for my next visit. Drinkwise, I went with their Cool Hand Cuke a mix of organic cucumber vodka, St. Germaine, cucumber juice and mint syrup. I'm a complete sucker for cucumber anything so my drink was absolutely delish and refreshing. \n\nThe shrimp and grits looked very appetizing. The shrimp were large and the heirloom grits had mushrooms and shallots; My cousin and her friend said they were very flavorful. After watching Chef Paul make my pancake I kind of knew, texture wise, what to expect. It's one pancake, made in a small frying pan; which gave a nice crust to the outside of the cake. It reminded me a bit of a pound cake just with a crust on the outside. Dense cake but still soft on the inside and rich from the buttermilk. The maple syrup soaked right in and the freshly whipped creme fraiche made them that much better. \n\nWe made sure to save room for dessert. I knew the doughnuts were a must get but decided to ask the waitress her opinion of what's better, the monkey bread or the doughnuts? (both were equally popular throughout Yelp reviews) With no hesitation, she said the doughnuts Lol Chef Paul even commented and said yeah the doughnuts are a must get, he likes them better than the monkey bread too. I thought that was pretty funny as hes the one that makes the monkey bread and the pastry chef makes the doughnuts. We were brought out four cinnamon sugar donuts filled with salted caramel custard, you could legit see the custard oozing out of the doughnuts! They weren't large in size but more so the perfect amount for the three of us. We each had one and after the first bite my mouth was filled with creamy sugary goodness. I'm pretty sure I had sugar all over my mouth lol After the next bite came the slight saltiness from the custard filling, which was nice contrast. The donuts were warm and a great after meal treat, so good my cousin and I fingerlicked the bowl lol\n\nI would love to come back for the duck hash and to try more drinks.", "author": "Dyanne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "A must for brunch! Not at all far from Manhattan, and also a great distance from Brooklyn Bridge if you're walking to/from Manhattan. The juice is freshly squeezed, which is always a pleasant surprise. The biscuit benedict was also lovely! I loved the atmosphere -- it's a pleasant and beautiful restaurant. We were lucky enough to get seats by the kitchen area so we could see everyone at work. \n\nI am still dreaming of the donuts that I had here. They were incredible -- warm, crispy on the outside, perfectly soft on the inside, and the filling would just dribble out. I would go back for just the donuts, though the other brunch items were also great.", "author": "Isabella C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "Colonie was a great find via Yelp.  I came here with Wifey for a Sunday Brunch experience and was very pleased.  The place was full to capacity and not slowing down.  The prices were right and the experience was unique because we had seats in a booth style seating facing the chefs cooking our food right in front of us.  \n\nWe ordered Leek \u0026 Gruyere Scramble with bacon and Duck Hash.  Many of the patrons were eating the Buttermilk Pancakes.  In addition, they provide you with a French Press style coffee maker which you pour for yourself.  Again a very unique coffee experience.\n\nOverall, I can't wait to come back and enjoy another Brunch at Colonie.", "author": "Freddy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Brunch: Lets confront this off the bat, throw your diet away and get the doughnuts. They are out of this world, pastry chef level quality, delicate French cream filled pillows of wonderfulness. I cannot express this sentiment enough. The iced coffee is silky smooth nitrogen infused and the hot is French pressed. You could leave after the coffee and doughnuts, the other dishes are good but won't get you back to that first high. The Benedict is yummy, with a small spatter of greens and a delightful lemon sauce, same with the kale omelet. If you want to be decadent go for the duck hash. It's certainly screams \"brunch\" not diner at this Neaveux American haunt for the rich if not so famous of Brooklyn Heights \u0026 Cobble Hill. It's a big crowd pleaser with out of town friends and even the skeptical manhattanites that come my way. The doors open at 11 AM and there is a considerably long line by that time - they do not take brunch reservations.\n\nDinner is not a disappoint either, think farm-to-table and a lot of flavoring with bacon. The restaurant is always noisy and crowded, but somehow still manages to be an intimate date or friend setting.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "We had a greatvbrunch. Everything tasted brillian. We ordered scrambled eggs, burger, kale salad, egg Benedict and for doughnut and monkey bread for dessert. All were good the doughnut and monkey bread were exceptional. The bread that came with eggs was a bit disappointing.", "author": "Omar A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "I came with a large group (12+) and we were entertaining clients. They even customized our menu's with our company names! The staff was excellent, their service was impeccable for such a large party. My glass was never empty and plates were cleared quickly. \n\nThe food, however, was inconsistent from plate to plate.\n\nSpaghetti Squash Salad: Must eat.\nCarrots with Yogurt: Skip it.\nHanger Steak: I thought it was under seasoned, but learned that one should use the aioli and table salt to tie it all together. The fries, on the other hand, were drowning in salt. \n\nAs a lover of dessert, the sticky date cake rocked my world. It's the best dessert I've had (out) in a very long time. The donuts, on the other hand, were ok.\n\nI'd come back, but only pick certain dishes!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "+++\n- What they say about the cocktails is true. They're amazing, although, I've only had one; with the apples, egg and whiskey (I forget the name but it was a pretty good, relaxing/chill mode/sip on during your date drink)\n- The kale salad was perfect conglomeration of greens, dressing, fruit, and almonds, the portion is big enough for two people to share as appetizer\n\n++\n- The burger was very avant garde, the egg really added to it. I almost discarded it. I would have been missing out on full complementation\n- Atmosphere is very warm/rustic/and romantic. The old brick walls mesh very well with the wood paneling in floors and in bathroom\n- This place is great for a date, after work get together, birthday party, place to bring your parents\n- Wife got the market fish, she liked a) how the vegetables came on the side and the cauliflower was neatly grilled and b) the fish dish as a whole (She only had the minor gripe of, it was advertised as bones removed, but there was definitely a full vertebral column in there)\n\n+\n- Wait staff is friendly and knowledgeable on the menu. They didn't offer much in the ay of recommendations, but the way our waiter phrased his answers didn't make him seem as aloof as some waiters seem when you ask them what they recommend.\n- We saw one of the managers outside at a store down the street, he even thanked us for coming in and wished us a good night. That was cool that he recognized us.\n\n-\n- Fries are very salty", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Hands down the best restaurant in cobble hill/ Brooklyn heights. \nIt's world class food served by a world class wait staff. \nI am constantly impressed by the food from Chef Andrew Whitcomb and his beautiful food is served by people deserving of that responsibility. \nOne of my favorite places in all of NY.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "I am born anew in the chef's genius. One of the best farm-to-table restaurants I have been to yet. Came with a fellow gourmand workmate as she recommended it highly. I was not disappointed. We sat at the bar since we didn't want to wait. The bartender was a very attentive server.  I realize the menu probably changes weekly (if not daily), but if you have the chance to try the egg salad crostini, do it. The octopus was amazing.  The Brussels sprouts were ever so slightly undercooked, but did not affect my love for the experience I had. I very rarely fall in love with a house cocktail enough to order more than one in a row, but the Cool Hand Cuke was sooo good.  I will not soon forget this place.", "author": "John B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "I've been here for dinner a few times. The first time was okay; the second was amazing; the third was terrible. The cheese and charcuterie are consistently good, but everything else is very hit-or-miss. Some of the pastas, vegetables and small plates are really oily. They overdo the sauces. The seasoning can be a little off. For the really bad meal, I got roasted carrots (the bottom half of the portion was sitting in a pool of grease), lamb belly (the top was so seared that I had to saw through it with my knife -- it was like overcooked bacon), and a spring salad (this was good). I was expecting the salad as a starter course, but it came out with the entrees. Everything was just really sloppy. I was looking forward to ordering the date cake for dessert (so good) but I was so grossed out by dinner that I just asked for the check. It didn't help that there were Patrick Bateman types sitting at the tables around me. I was like GET ME OUT OF HERE. This place is really expensive, and the food is so inconsistent that it's just not worth it. There are too many other amazing places in the neighborhood -- Pok Pok, La Vara, Jack The Horse, French Louie. When you go to this place, you just have to hope to catch them on a good night.", "author": "Olive I."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}