{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-22", "description": "I really like this restaurant and have gone out of my way on multiple occasions to dine there. The food has been good to great each time I've been.  \n\nUnfortunately, the hostess (tall brunette with straight, chin-length hair) has made me never want to go back.  My friends and I walked in at 3:02 for lunch on a Saturday. Lunch ends at 3:00.  We called twice before we got there to say we may be 5 minutes late and would they still seat us and were reassured it was no problem.  When we walked in (at 3:02), we were barely 3 steps into the restaurant when the nasty hostess gave us complete attitude and told us we could not be be seated.  Didn't even let us get a sentence out of our mouths before rudely interrupting us and turning her back on us. \n\nLuckily, there was a nice bartender who told us we could sit at the bar and order some of the food off the menu. He was gracious and patient, and what we ordered was decent.  But I won't be going back to Colonie and I won't be recommending it to others because there's clearly an attitude problem happening at the front desk. No reason to be so nasty to customers on a lovely Spring day.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "I just recently went here with my husband and friend in from out of town. We walked in on a Friday without a reservation, and were told that it would be an hour to 1.5 hr wait... OR, we could sit right away at this perfect little triangular 3-seat table in the front window (that I guess is considered part of the bar). Couldn't believe our luck! We knew it was going to be a good night and a good meal. We had a fabulous waiter-- I wish I could remember his name he was so good. We basically asked what was good on the menu and followed his recommendations. \n\nWe ordered a lot of stuff to share. EVERYTHING we ate was absolutely to die for delicious!! I think I would have to order everything I had again, plus more so I could try new stuff without missing out on anything! We had pate, terrine, 2 cheeses, oysters, acorn squash agnoilli (this amazing little dumplings bursting full of delicious acorn squash puree with this perrrrrfect sage butter sauce!), and the scallops (perfectly cooked!!). AMAZING!! We also had a delicious and pretty cheap white wine, recommended by the waiter. Also had cocktails, all of which were good (I had something with cucumber in it). \n\nIt was pouring rain when our meal was finished, so we decided to have another drink at the end of the meal. We were worried about holding up the table since there were other people waiting, and even said something to that effect to our waiter (who we'd had a lovely evening chatting with off and on) but the waiter wasn't pushy at all... in fact, he bought our last drink! Guess we all had a good experience that night :) I can't wait to go back to Colonie again!!! Seriously, this place is at the top of my list ffor favorite restaurants in Brooklyn right now. I'm already planning in my head who I'll take with me next time we go back! \n\n(If you do have a large party, I would recommend calling as far in advance as possible for a reservation. It's pretty small, and I think they only take 2 reservations an evening for 6 or more people, and don't take reservations for small parties. I could have the details of that wrong, but I'd tried to call in advance a couple of times before when my family was in town and didnt have any luck getting a reservation)", "author": "Mary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "Great meal and great service every time I've been. They know how to cook and do a fantastic job adapting to dietary restrictions. Keep up the good work!", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Brunch was perfect.  Perfect service, perfect location, perfect value.  Only concern was that those who ordered the duck hash didn't want to leave. Some gave 127 Atlantic as their new forwarding address.  Perfect", "author": "K W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "Awesome space. Amazing food. Great cocktails. \nI went to colonie a few weeks ago and was charmed by this beautiful, delicious neighborhood spot. \nMust try the oysters Rockefeller and the ginger cocktail.", "author": "Rex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "The service and the food were pretty good. However we did have to send the fluke back because it was undercooked the first time we received it, I must mention that they were great about it and brought us the new one quickly and it was perfect. The cheeses are fantastic as is the meat selection. We split a few bottles of wine and a mix of large and small plates. Be advised, this is a fairly expensive place so expect to pay for it.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "I had been wanting to try this place for awhile, just never found a good time to go. I went last Sunday to try brunch on their opening \"brunch\" weekend. My boyfriend and I were the only ones at the bar however the dining room seemed pretty full. The service was great and the bartender was very knowledgeable about both the drinks and the food. \n\nWe ordered the eggs Benedict with country ham, and Gruyere eggs with rosemary potatoes and 1/2 oysters to start. I realize that eggs Benedict seem like a typical, obvious brunch item that anyone should get right however I find that many people just can't poach eggs correctly and we're rather picky about our hollandaise. They nailed it. Nailed. It. Perfectly poached eggs with light, zesty hollandaise, gorgeous country ham on top of two slightly sweet, freshly baked biscuits. So good. \n\nThe Gruyere eggs at first glance appear to be just scrambled eggs with a light dusting of Gruyere but once you take a bite they reveal themselves to be creamy, fluffy, delicate, lightly scrambled eggs with rich Gruyere swimming through out. They are paired with cripsy-on-the-outside-smooth-on-the-inside potatoes that seem almost infused with the slightest hint of fresh rosemary. All served with a nice spicy watercress salad, lightly dressed with what I believe to be a sherry vinaigrette. Lovely. \n\nThe oysters were perfectly shucked, not a drop of brine spilled and were served with a cucumber mignonette that seemed perfectly suited for an early brunch.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "Consistency is not one of this restaurant's strengths. I went back about three weeks later with a group of friends, and ordered almost the exact same meal. The kohlrabi salad was very watery this time and very bland. My steak was over done and the fries weren't edible because of all the salt that was poured on them. The server wasn't attentive and didn't seem all that thrilled to be there, but the cocktails were still great and strong!", "author": "Alisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "We came determined.  We were not leaving without dinner, so we waited.  For 2 hours.  Luckily, the host was kind and helpful--we waited at Floyd playing bocce till our table was ready.  The host also treated us to a bottle of bubbly for our trouble.  \n\nAfter we were seated, the servers were attentive and upbeat.  We each ordered an appetizer and a main, along with some vegetables for the table.  Downsides: the grilled octopus salad was pretty tasteless and my duck was served less than warm.  Highlights: oysters were perfect and the pork belly was melty.  The atmosphere was warm and relaxed.  The green wall and antique-y decor were well suited.\n\nI'd go back, early, on a weekday, with fewer people, and sit at the table in the window.", "author": "Charlotte O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "The atmosphere is nice. Can be crowded but I went when it was new. The drinks are great. The wine list is good. The food is OK. Peel and eat shrimp....well it was my fault for ordering it. \nThe staff were very friendly. A welcome new spot in the neighborhood. Look forward to more.", "author": "Kelvin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "I had been wanting to try this place since it opened, and finally got the chance this Saturday night. We waited out the rain and arrived at about 7 pm, expecting a lengthy wait. To our delight, we were lead to the last two seats at the kitchen counter--a fantastic surprise! \n\nNot only did we get to partake in the delicious food, but we also got to watch it being cooked, and also got to hear the conversations between servers, the chefs, and expiditers--it was like watching some kind of complicated theater production. \n\nWe ordered the cara cara margarita for a cocktail--the smoked paprika salt on the rim was delectable, and the orange flavor was nice. We split a ricotta honey toast and a green salad for appetizers. Both of these were pretty good, nothing that reinvented the wheel though. For an entree, I got the pork chop, which was perfectly tender, and the sides were delicious as well. Joe got the scallops--again, perfection. We split the violet artichokes, which turned out to be the shining stars of our meal--they arrived in a paper cone, a la street food, and were like a healthy version of carnival snacks. A real treat! Speaking of treats, we couldn't ignore dessert after watching them prepared not 3 feet away all night. We got the doughnuts, lovely little fried balls of dough injected with salty caramel. They were good, but I was a little disappointed there wasn't more salty caramel sauce. Next time, I might go for the ice cream instead. \n\nI would highly recommend this place for the service, atmosphere (it's beautiful inside), and, not least of all, the delicious food. Worth every penny!", "author": "Jill D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "one of the best meals i've had in a year.  not only was everything that we ordered good, everything we DIDN'T ordered looked equally good.  sitting at the open kitchen counter is the way to go. onto the specs...\n\ncrostini x3:\nduck rillet w/ pickled shallots - great ducky flavor, tender meat.  shallots provided a nice cut to the richness\n\nricotta w/ mint \u0026 honey - not as sweet as one would expect it to be.  goos savory starter\n\ntop clams w/ green salsa - strong flavor...least favorite of all but that's not a ding.  clams just seemed a tad awkward with the salsa - acquantances rather than buds.\n\nfarro with hon shimeji mushrooms, haricot vert, and soft cooked duck egg\namazing things one can do with ancient grains.  this was a hands down winner.\n\ngrilled octopus with potatoes in chorizo sauce\nquite the tenderized tentacle!\nchorizo sauce was super smoky - nice touch!\n\ndoughnuts with sea salt caramel custard filling\n4 nicely sized fried balls, slightly smaller than my fist but bigger than 2 munchkins\nnot too sweet or rich, great custard!\n\nthing we did not get and will most def. do so next time:\nfried brussels - probs the largest brussels i've EVER seen\n\nsautéed sea scallops in butta - also gargantuan\n\noh and the pear and walnut cocktail is a dream!\n\ngoin goin, back back, to brooklyn brooklyn", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Lofty ceilings, exposed brick and expansive feel to the dining area meets with savory culinary offerings . . .  However; wait and hostess staff were more than a touch over-bearing, and the chill from the maxed-out AC did not mix well with the hot offerings from the kitchen.", "author": "Rob F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "I don't know why this place has such good reviews and high Zagat rating. First they do not carry Jack Daniels which is strange in itself, but on to the food. The menu is very limited. There is not a chicken dish on the menu,also strange.Had the beet salad, just ok. Can't really mess that up. We both had the hanger steak, it was flavorless and chewy. I sent my steak back to be cooked further and saw the cook take my salad off the plate with his bare hand and transfer it to the new plate. Really? Gross.\n\nThe server had no personality. Place is tiny where tables need to be pulled out to sit behind. There were three other tables on a Saturday night all with small children. Not the ambiance you are looking for as a couple. I would not recommend this place to anyone.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "Came here for dinner with friends ( who are very opinionated) and was thoroughly impressed. The waiters are very helpful in navigating the menu. Must try: date cake for dessert. Lamb chops received a group nod. Onlyyyy negative IF I'm being very picky is the cocktails are average. But don't think twice about checking out this place.", "author": "Indu K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-04", "description": "The look and \"feel\" are very good. The food is also very good but pricey, with fairly small portions. Odd that they don't give you any bread or similar to nibble on while you are waiting for your food. My only real complaint is the loud, thumping music. For a restaurant of this calibre this music is inappropriate, more like something you would hear in a cheap bar. It annoyingly added to the general volume of sound on a busy Saturday night.", "author": "Clint P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "Try it at least once.\n\nFood- fairly good, you can isolate each ingredient and each speaks for itself while harmonizing with the others. However, I'm not entirely convinced I couldn't go home and be creative enough to accomplish it on my own.\n\nPortion- appropriate and  as expected when the focus is on the taste, not large enough to satisfy a glutton or someone who has waited all day to eat.\n\nInterior- lovely but... it's a classic example of intimate NY dining as your elbows kiss those of the stranger at the table next to you and you find yourself struggling not to eavesdrop but to remain engaged in your own personal conversation.\n\nMy experience -The octopus with chorizo sauce was enjoyable but not spectacular. The fluke was well seasoned and paired with the potatoes. The date cake with salted ice cream was all the warm sweet goodness a dessert should be but I can't say I was entirely fond of the salted ice cream although I understand it's balancing purpose.", "author": "beecee e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Simply put... outstanding. This review is based on the brunch we recently had here which was our first dining experience at the restaurant. The brunch easily rivals Buttermilk Channel for best in the neighborhood. I recommend the shrimp and grits, sausage, and eggs with gruyere and leeks but I'm not sure you can go wrong with anything on the brunch menu. Looking forward to a dinner here in the near future.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "In defense of Colonie, it is always really busy and they don't take reservations. That said, my friend and I arrived late on a busy Thursday night, and we were still seated in less than twenty minutes. The food here is phenomenal. You can't skip the black risotto with enoki mushrooms - savory, perfectly salty, large enough portion to share with a friend. If you're a mushroom maniac like I am,  you also can't skip the oyster mushrooms - I could make an entire meal out of this appetizer, it's so dang good.  The wine list is not only great but you can also trust the wait staff to make good recommendations to match your food order. The menu is a little costly for the neighborhood but the fare is frankly in a class above my beloved Cobble Hill standbys and the service is great.\nAnd if you leave without having the fig/date cake with salted caramel ice cream, you are a chump.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "One of our favorite spots in Brooklyn.  Lots of nice seating options - the bar, seats overlooking the kitchen, or the normal dining area.  Food is always wonderful and they do a nice job of switching things up on the menu.  Highly recommend it.", "author": "Iceland J."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}