{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "I came here with a beautiful girl, a brother by pact, and a beautiful girl. We were still rubbing our eyes from a long night out; we were ready for a great brunch.\n    While I didn't order any for myself, I tried my teammates' alcoholic drinks. They were really really good! Tasty. No one had plans to get tipsy.\n   A perfect sideboard to our mains. I had the beans and eggs after sharing a basket of baked goods with my party. All were superbly tasty, unique, and yet still comforting.\n    My only gripe was that the portions were small. I'd have to spend quite a bit to get my fill here.\n    For someone like me, I'd come to Colonie for the flavor, the service (great staff!), and the atmosphere (friendly clientele..and seriously, what's with the entire staff being extremely beautiful?). The music choice was very interesting but all tasteful. I asked our server and he said that all the staff contribute. Cool!\n    I look forward to going back. I'll be saving up to splurge!\n\n  By the way. Order the pancakes. If not as your main, to share - these are so delicious and so unique.", "author": "Tuan-pi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "Hands down one of the best restaurants in Brooklyn. Brunch is amazing. Duck hash. Monkey bread is a must. Dinner is also great. Seasonal ingredients. Small yet very thoughtful menu. Every time I go to Colonie I am aware of the artful service and the vibe feels so good.  I get a feeling that the owners take really good care of the staff and that the staff really believes that they are an essential part of the restaurant and not just the employees.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "This place is definitely stellar. As it got more crowded throughout our dinner, the seating became a bit too close for comfort. However, the service was top notch and really quite impressive. The food was delicious and pretty much everything that went into our mouths was really, really good. Two thumbs way up for this place!", "author": "Yo Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "First thing they did when I called them was put me on hold. Apparently, the woman answering the phone couldn't hear me well and just hung up. All I wanted was strawberry rhubarb pie, but I wouldn't go there now since staff are clearly very impatient even on the phone.", "author": "Patricia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Great dinner or date spot. Highly recommend eating at the \"chefs table\" which is really just the bar seating. We sat here and chatted with the chef who told us his journey getting into the cooking industry. It was a great vibe in the restaurant, and really good food and wine.", "author": "Kelley K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-23", "description": "I have been to Colonie like four times now, and have become less and less impressed.  The space is beautiful, and the service is timely, but the menu has become lacking and the attitude of the staff is ridiculous.  I don't eat meat, but do eat fish and yet it's VERY hard to find anything on the menu that doesn't have meat in it... even the veggies!  The only entree option was a whole fish, which was so riddled with bones, i had to stop eating it.  They will keep the meat out of some of the veggies, but it all depends on the chef's mood as to what he will subtract from the dish.  My husband wanted to hold the duck egg on his burger and the chef refused to do it.  A little odd to me for a Brooklyn restuarant, and more than little ridiculous since my husband is allergic to duck egg so had to switch his entree. \nThe food quality was ok- but overall expensive for the portions and we both ended up feeling dissatisfied with our meal and the price we paid.  \nToo many other good options to go back, which is too bad because the space really is cool (though very crowded if that matters to people).", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "I live close by and have been here a couple times.  The food is really good -- loved the ricotta crostini and the scallops.  The back room tends to get very loud during dinner time, so if you can snag one of the front booths, much better.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Love everything about this place.  Food is fresh and everything I have tried has been great.  Service is good and the staff are very friendly.  Brunch is my favorite but dinner can't be missed.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "The short is the food is over all pretty good.  However, its not a great value.  I paid $17 for a Belvedere Martini.  I mean really?  I can buy a liter for $40.  I really enjoyed the steak and most of the dishes (pork loin was a miss for me - wrong sauce) and brunch is generally excellent.  The place is good - it's just over priced.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "Not quite understanding the positive reviews for this place. First of all, cheesy techno/disco music blasting is not what I'd consider warm and homey in the  ambiance department- its just annoying - especially when we waited close to an hour for our entrees, in a cramped space, for food that was average at best.", "author": "J G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-19", "description": "Over priced for what it was.  I'm not a foodie but really wasn't thrilled.  I asked for my steak medium rare but it was super rare and I couldn't stomach it (had to send it back). Portions were too small, especially the dessert portions!  We spent a lot of money there and the service was just so-so. They asked us to leave our table at the end of our dinner... the decor was really nice, and the people were super nice just not the height of dining experiences. Try Walter Foods for better and cheaper food, bigger portions, and a similar aesthetic.", "author": "Erika A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Duck Rilette!  I was satisfied after eating that.  My friend got the short ribs and said it was perfectly cooked.  I would definitely return.", "author": "April Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Came for a Sunday Brunch with girlfriends. We sat at the open kitchen section which was pretty cool. Liked the ambiance here and the decor. Lively, friendly, warm, well put together. I got the yogurt and granola- simple but good. My friends had a burger, and shrimp and grits which they both said was really good. They also had cocktails that looked fantastic. To top it off they were playing some old school hip hop which just made it great :) service was friendly and attentive. No complaints. Will return.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "Such great food, friendly and efficient service, creative menu, and tasty drinks. We just love coming here because it's a sure shot on the thing we really appreciate, fresh well made creative interesting dishes, solid cocktails, and a great wine list. The decor is so chill and you can tell that the whole staff is working hard to make the experience top notch. Love sitting at the bar and watching the chefs cook. The wait can be tremendous on Friday and Saturday, but for any great restaurant thats normal. Think ahead to make a reservation,however, sitting at the bar sipping a delicious drink while you wait for a table is fun too. Bon Appetite!", "author": "Rox F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "It's been a while that a place made me feel like i want to write a review.\nIt all started with an honest smile from the hostess, it sure helped her good looks, but then i noticed that the entire staff is quite handsome, the room is warm and inviting i love the bar and the green wall full of plants, and the eat sign right before the open kitchen.The food delivered a great brunch, my daughter scarfed 4 of the 5 buttermilk pancake and ot second servings of the marmalade, i got the duck hash, very well seasoned and toothsome and moist same time, loved the long branch of watercress that came with it.Good wine selection and execellente music choice, a very good sucess at creating a neighbor feeling.Back at the bar attentive but scrambling a bit i'm sure it was just a new season employee that will get the hang of things. Price are more then fair if you are used at manhattan. keep up the good work, daughter already asking to come back.", "author": "vito p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "There isn't much on this desolate stretch of Atlantic Avenue - at least with respect to food.  In fact, Brooklyn Heights doesnt really have much.  Colonie comes in as a seasonal American restaurant -- there are plenty of those but what I saw looked good.  The restaurant just opened yesterday and I was surprised by how full it was and how things seemed to have worked rather perfectly.  I had just had dinner before - otherwise I would've stopped by to try the food.  I sat at the bar with the GF -- we had some drinks.  Omegang Rare Vos on draft makes me happy.  And a nice, strong, margarita-type drink -- perfect to remind us of the warmer months.  The ambiance was not quite Brooklyn Heights - there was a youthful vibe to it, which I felt was refreshing.  I'll return for the skirt steak soon, once I get my life back from studying!", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "I've had two lovely meals here. Tonight, I had wonderful, fresh, briny oysters with a tart mignonette dressing;  divine mushroom crostini on fantastic, crusty,  rustic bread;  ricotta crostini that were light, fluffy and unbelievably flavorful (slightly sweet and a little salty); and the rich date cake with the creme fraiche ice cream. That dessert is a total winner: I told the waiter that I would have licked the plate if I'd been alone with it.  \nBlaire's Pears is a great, unusual cocktail, and the wine list is thoughtfully curated and reasonably priced.\nThe atmosphere is casual but festive. The music is great. The waitstaff couldn't have been more helpful. \nI agree the bathroom could use a bit more light, but the candles throughout create a dazzling ambiance. The vertical herb garden is stunning and yields flavorful, fresh garnishes and ingredients for the food and cocktails.\nFull disclosure: I know the family of one of the one owners and bought a dinner on Kickstarter, but I paid for my meals, which I fully enjoyed. \nI would not have returned if it weren't such a special place, and I can't wait to go a third time.", "author": "amy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "I recently moved to the neighborhood and a friend recommended this little jewel. I have been here 4 times in the last 2 months for both Brunch and Dinner. Always delicious! The only downer is that they do not take reservations for parties less than 5 and it can get quite busy. However you can always grab a drink at their bar (delicious cocktails) or at the bar next door.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "We went here four times now. The food, the service, the atmosphere: absolutely great. We like the \"European\" portions (so there's no need for the staff to ask if you want to take the rest with you). The 'heirloom tomatoes' are so tasty that our kids (!)  asked us to order more (!). Then why not five stars? Well, because the place has been 'overhyped' a bit. Of the four times we went, we decided two times to go somewhere else because the wait would be more than 90 minutes. One time was on a weekday at 6:00pm so there was a table; and one time we decided to order and eat at the bar instead of waiting for a table (which was fine). And you can only reserve as of five persons :-(. If you don't like waiting (people) at the bar you may decide to wait a few months, the buzz will (hopefully) slow down eventually.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "Update:\n\nAfter months of prodding my wife finally convinced me to return to Colonie.  Our first meal there their opening month was a spectacular disaster, some sort of strange experiment in how badly you could run a restaurant.\n\nHowever, they have come around.  After what were clearly major problems with their launch, this restaurant is now serving up consistently awesome food.  Everything on the menu seems to be great, and they have some excellent drinks.", "author": "Britt M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}