{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "It's been a while since I wrote a review but I just wrapped up dinner at Colonie and the experience was so fantastic that I couldn't not write one!\n\nColonie had the trifecta that I'm always looking for --amazing service, food and ambience! From the minute we walked in the host was so warm and welcoming. I was holding flowers and a wet umbrella but needed to run to the restroom and he took both from me while I did that. He was willing to seat me while we waited for the rest of my party (I love when restaurant s don't make you wait for everyone even if you have a reservation). The service continued to be fantastic throughout the meal-- our server was also really nice, gave good recommendations and didn't rush us. The team of servers supporting our table was attentive and quickly took away plates, changed out silverware, etc. and overall worked seamlessly together.\n\nNext was the food; we ordered the crudo, burrata, cauliflower, lamb belly, pork chops, and artic char. For desert we had the blueberry sorbet and the sticky date cake. EVERYTHING  was beautifully presented, light and flavorful. Standouts include the burrata which came with charred bread and to my surprise the char went perfectly with the light burrata and it's shaved pickled celery. The lamb belly is a MUST GET, pressed into a square shape like pork belly and crisped on the outside with a mint sauce drizzle it was so flavorful. My husband got it and I was jealous! The cauliflower was also so flavorful-- it came with fresh mint, a mint sauce, pomegranate and fried shallots. The sticky date dessert was amazing -- warm, sweet came paired with ice cream! I wanted a second order of it! My artic char was cooked perfectly. The crudo was light but had a little too much fresh oregano for me. \n\nFor ambience, the venue is nicely decorated, not overly done, dark wood, plants and clean. Whoever was in charge of music, they get a thumbs up! The music was a great mix of oldies, r\u0026b and a little lover's rock. Great vibe! The team was also diverse from the chefs to the servers and I appreciated that.\n\nThey are open late too which will make this one of my new go to spots for date night!", "author": "Tresha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Ended up here for the oyster happy hour, stayed for a full dinner. \nDrinks - Cool Hand Cuke (not on the menu but ask for it anyway)\nOysters - yum\nMushroom Pate - delicious, but a bit too rich for me. Order extra bread and spread it out. \nSunchokes - this was soooo good. Must Have!! I definitely licked the plate clean\nFor dessert I went with the donuts, fun and yummy, not too sweet. Next time I'll try the sticky date cake :)", "author": "Sarbani D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "Came here for brunch with a friend who recently moved to Brooklyn Heights. Luckily they were able to fit us in for brunch without a reservation. Very cool vibe with exposed brick and hanging vines on the walls -- very Brooklyn.\n\nI had the Lamb and Eggs, which were spicy and delicious.  The lamb was tender and spicy, the white beans were creamy and melt in your mouth, nice texture from the bread crumbs and the creamy yolk from the egg tied the whole thing together. Yum! My friend has the Turkish Eggs which were also super tasty. The yogurt, brown butter and chiles were great to sip up with bread...of your fingers ha. And, of course, the meal couldn't be complete without the Warm Doughnuts, which were heavenly. The lemon cream was so good! The Bloody Mary and Bloody Caesar were both great.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-31", "description": "It was a little difficult getting a reservation at Colonie. We made a reservation about a week in advance and got a reservation for 9:30pm on a Saturday night. Even with a reservation, we still had to wait 15-20 minutes for our table to be ready. \n\nWe started out with some drinks. I had the \"Cool Hand Cuke,\" a cucumber and elderflower drink. It was sweet (but not too sweet). I love cucumber in drinks and was not disappointed. For food, the cauliflower dish and snapper crudo caught my eye. Was a little disappointed with the cauliflower dish. There was nothing special about the flavors in the dish and it was too salty for me. However, I LOVED the snapper crudo. The flavor from the coconut milk was so interesting and suited the fish perfectly. It was definitely a novel taste to me and so delicious. Would strongly recommend the snapper crudo. \n\nTaste | 4\nAtmosphere | 4\nPresentation | 4\nService | 4\nOVERALL | 4", "author": "Lana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-18", "description": "I have eaten brunch here twice and have enjoyed both visits very much. The first time we came, we waited at the door for the figurative opening bell to ring and we scored 2 seats at the chefs counter!  This is the place to sit if you want a unique experience. We watched the chefs prepare, cook, dress and plate the dishes. It was pretty cool, (except that 1 chef who tasted the food and put his used spoon back into the dish for a 2nd taste) (I wonder how often that happens)? \n\nYesterday we had brunch at the bar. We had an incredible feast. Ricotta toast, 5 cheese and 5 meat board, lamb and eggs, Turkish eggs and a Bison burger with fried egg. I also had a couple of Bloody Mary's which  were pretty pedestrian for such an inventive restaurant.\n\nNonetheless, I am a fan!", "author": "Paula Jean K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-23", "description": "We did not have reservations but for a group of 3 we were able to grab a seat along the side bar. Our waiter was very friendly and was very knowledge about the menu. \n\nWe started with the buttermilk biscuits that came with jam and butter. The jam was sooooooo good. Wow. I thiiiink it was blackberry jam. It was delicious with the biscuits. They were warm and very dense. The outside top part was slightly flakey. Look, just get it. You're welcome. \n\nTwo of us got the Turkish Eggs and it was such a nice change from what I normally get when I go to brunch. The poached eggs were nice and runny. It sits on top of some Turkish yogurt covered in oil. You can see and taste the chili peppers and garlic and it will linger so maybe have a gum after lol. But it's totally worth it.  It also comes with a side of bread you can dip in there and eat with the eggs. My only issue with the bread was the taste of ash. \n\nThe Burrata was also delicious and worth trying.\n\nI think this is cool spot to visit for brunch.", "author": "Tashalee B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "I came here for a brunch during the weekend and overall had an ok experience. They do not take reservations so we were waiting by the door a little before opening time and was able to get the table. \n\nHere is the breakdown \n\nFood\n\nThe food was ok in my books, very elaborated plates but the flavor factor wasn't there at least for my palette. I ordered the duck confit hash and the house potatoes. My friend ordered the biscuit sandwich-- the biscuit was delicious. \n\nDecor/ Ambiance \n\nNice, cutesy rustic modern look. We seat at the chef's table and it was very nice to see them prepare the dishes right in front of you. Nice and lively house music. \n\nService\n\nThe waiters were friendly. It was busy and they were training their best to be as attentive as they could.\n\nOverall \n\nHad an ok experience. Great vibe, the food was just not for me. But it might be for you, so still try it.", "author": "Al L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "My favorite restaurant in Cobble Hill- Always delicious, great staff, cool vibe. But the secret's out so either make a reservation or be prepared for a long wait.", "author": "s. b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "OMG the Turkish eggs!!\n\nThis restaurant is very cute and aesthetically pleasing. With a large welcoming bar in front and plenary of seating in the back surrounded by a living \"wall\" and plants visible though the windows, Colonie makes you feel like you're dining in a more rustic area, rather than Atlantic street in Brooklyn.\n\nThen menu offers many items I definitely would like to come back to try but on advice from our neighbors went with the Turkish eggs. I'm so glad we did.\n\nAfter we ordered them breakfast arrived in what seemed an impossible quick time. (Im talking like cooking show chef puts unbaked item in a stove and immediately opens another one to reveal baked item- fast) the Turkish eggs were amazing! In a time where everything seems to have the same flavor Turkish eggs offered me something I've never tasted before. They were a little spicy but not overpowering so. The eggs were picked perfectly.\n\nI can't wait to come back and try their other tasty items.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Walked past this place on my way to another restaurant and had to walk back for a second look. Decor? Looked nice! Menu? Sounded delicious! Energy? Looked happenin! \n\nAgainst my better judgement, I gave into my date's dare to try this place without looking up a Yelp review... (Boy, am I glad I did!) This spot takes a limited number of reservations a night and was able to squeeze us in at the Chef's counter. It was a blast to see all that was going on in the back and get to point out what we thought looked good to order instead of simply picking off the menu. \n\nEveryone from the host to the chefs were very friendly, the food and drinks were all superb, and the food and drinks were brought out in a timely manner. \n\nI'd highly recommend the Warm Beet Salad, Sunchokes, and Duck Egg. Although I'm not a vegetarian, these dishes really stood out! The Fazzoletti was tasty, but next time I'm looking forward to trying the Cavatelli. \n\nTLDR: \n-Great service, ambiance, and food. \n-Sit at the chef's counter if you want an interactive experience\n-Great spot for vegetarians and non-vegetarians \n-Go with someone who will share with you, so you can try as many dishes as possible!", "author": "Sasha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "My 3 friends and I went here for a farewell brunch  the food was delicious and the cocktails too.    They were turning over to dinner so we went to the bar for a farewell drink but the bartender said that we were there too long and that he wouldn't serve us.  \nAfter speaking to the manager he said that it was a liability question.  And that  bring we were not intoxicated we could order another. But I refused saying we could spend our money elsewhere.  \nI was very humiliated by this event and will never go there again.", "author": "Aj B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "This place is best known for brunch, but the winning move is to go for dinner, when it's not nearly as crowded and, quite frankly, a better deal (brunch food is generally overpriced everywhere for what you get).\n\nSitting at the counter is a real treat -- you get the watch the cooks do their thing and it's always fun to watch an excellent craftsman work.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "This is easily my favorite restaurant in Brooklyn. I've been here a few times now for dinner, sometimes with reservations, sometimes without. Service is always excellent and attentive. I love the decor; there's lots of exposed brick and a beautiful living  wall. During my last visit, we sat at the chef's counter and got to watch them cook. \n\nAt my last visit, we ordered the sun gold tomatoes, the maltagliati and the spaghettoni. Every dish was incredibly tasty. The maltagliati was light and meaty, with plenty of crispy breadcrumbs. In the past, I've ordered the mushroom pate, which is my favorite and tastes so much like liver pate. Also notable is the sticky date pudding, definitely order it!!\n\nMenu is seasonal and I'm so excited to try all the new dishes.", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-04", "description": "Terrible service. Order taking was slow, check took forever.\nOK food. Not worth the wait. \nTerrible Bloody Mary. Small and basic. \nAmazing blood orange margarita. Come to the bar just for that and then leave.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Stumbled in here late last night. Fantastic margaritas, best burrata I ever had (I think the bread was smoked w something it was incredible) and clearly homemade pasta. The hostess was so nice and our waitress, Joan was really patient as we were super indecisive in picking! Can't wait to go back!\n\nThe cozy front window seats are also a must.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "If you know anything about Brooklyn heights, you know there are several restaurants in a 4 block radius and many of which are your general Thai, Mediterranean, or Sushi restaurants. If you live here, you also know how difficult it is to get your Manhattan friends to make the journey. I'm happy to announce Colonie is golden ticket we've all been waiting for. \n\nFirstly, sit at the chefs table. Watching the chefs work their magic is incredible (shout out to Kone (sp) on the pasta. They put so much TLC in their food it really is a treat to watch. All of their drinks are delicious, I especially favor the detox retox, and cuc cocktail. \n\nThe apps are also fantastic I would recommend 1 per person. Everything is fantastic, esp the sweet potatoes, Brussels (shaved and light not fried) and sunchokes. \n\nFor dinner- get the spaghettoni. The pesto blanco is almond based and has a spicy after taste. I could eat this for every meal for the rest of my life. It can be made vegan or they can make it into a cheesy delight of that's what you're into. \n\nEverything here is A++++, but just expect a $100 for a party of 2", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "I came here for brunch on the weekend and it was definitely crowded. I didn't have to wait more than 30 minutes but other people who came in after me were told that the wait was going to be an hour. I think the brunch menu is definitely unique and not your typical brunch menu. I got the warm doughnuts which was delicious and also the Turkish eggs which had nice kick to it. Service and food were great overall. 10/10 would come back again.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Had an amazing dinner there last night for my daughters birthday. There were 6 of us and everything was great. We had dates, cauliflower, cheese platter and lamb belly for appetizers.The burratta with blue crab was amazing.\nService and staff all friendly and attentive \nThanks to everyone", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Today I had brunch for the first time at Colonie. A group of 8 from my high school decided to get together before one of our dear classmates who is vacationing in NY goes back home to Haiti. The location is quaint and rustic and I loved that. It took about 30 minutes to be seated but then that's expected with a party of 8. They only take reservations for dinner therefore we knew we would have to wait. There isn't a wait area per se so I found that we were getting in the way of the wait staff often. Once we were seated our drink orders were taken by a young lady and shortly there after our food orders followed. Five out of our party of eight ordered the duck hash and two had the Shrimp \u0026 Grits. I'm not sure what the eighth person ordered but I'm sure she enjoyed it because she's a known complainer and I didn't hear a word from her. We all enjoyed our meals and various drinks. The server wasn't very friendly but she was efficient and gave us Everything we asked for. I'm sure I'll be back with my gf because she likes quaint places Like this . All in all I would recommend you trying this place and trying any item on their eclectic menu.", "author": "Christian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "One of my favorite places to visit when i am in Brooklyn the food is always great and is served in a timely fashion also the staff is very knowledgeable and professional makes the experience a true pleasure", "author": "Michael K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}