{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "I went with a couple of friends. We ordered monkey bread and donuts for share, and for our own dish, duck hash and shrimp and grits. Monkey bread and donuts tastes okay. I would have liked them more if they weren't that sweet. But if you are a sweet lover, go ahead, you will enjoy those sugar bombs. Duck hash is not as amazing as people said. It's basically 90% hash and 10% duck. We all felt full because of the potatoes but unsatisfied because there's so little duck. Shrimp and grits is a pretty special dish. I like the ingredients a lot. It has all sorts of enoki and wood ear and other sorts of mushrooms. Shrimps taste pretty good too. But the mushrooms are too salty in there. The service and dining atmosphere is excellent. Overall, I don't think the food is worth our 30-min-wait at the door.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "I am not usually a five star on the first time type of reviewer, but Colonie deserves it. Not only is the food delicious - I really enjoyed the shrimp and grits, which was comforting, exciting, and light all at once - but the service is great. We ordered a bread basket, but the bartender forgot to put the order in. We decided not to get it at that point since we were powering down our entrees. But they brought out a free one after we finished, just to say thanks and sorry for messing it up. That is just a cool thing to do. And I must say I highly recommend ordering this. The scone was insane. \n\nI also just love the whole vibe of the place - casual, fun, yet with awesome food. Can't wait to go back.", "author": "Barb B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "I have already been for brunch twice in the last month and a half, and have simply loved the local \"farm to table\" style restaurant. The shrimp grits had nice savory flavor, and the pickled mushrooms added a nice complement.  The duck hash with poached egg was spectacular (but, I'm pretty sure just about anything bathed in duck fat would be).  The bean puree brunch entree was a joke, probably 3 oz total of food, and my friend tried not to show his disappointment when he saw his dish, and looked at ours.  Service can be spotty (inattentive and chatting with coworkers, forgetting milk with the iced coffees, offering one person ground pepper but not the others at the table, and forgetting a plate for those sharing dishes).  I guess I will just have to remember next time to ask the hostess not to seat me in the section serviced by the perfectly cute and pleasant (but incredibly dense) waiter.\n\nThe space itself is fantastic - a well designed rustic-modern Americana-style, with a beautiful lush living walll.  I want that wall.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "Get over yourself colonie..used to really like this restaurant but went today for brunch and our waiter was a total piece of sh1t. Horrible attitude acting like he was doing us a favor serving us. Totally ruined the experience. This place has a B by the way, not a good sign, but something I overlooked because we had had good experiences previously. They ran out of the pastrami sandwich (at noon, really?!) so I ordered a burger and asked to have it without the egg. Clearly that's too difficult for them as they are very strict about substitutions. I'll be taking my money elsewhere, good riddance.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Delicious brunch with a menu that changes periodically. The service here is not fantastic but not bad enough to warrant missing out on this spot, and the space is airy and bright with a kitchen in the center so you know your food is made to order. As for the food, it's fresh, seasonal, and the portions are generous. I have been twice and tried the donuts both times. The first time I fell in love with the slightly crispy, freshly fried filled donuts. Today's donut, cinnamon sugar with a salted caramel custard filling, was just okay, surprisingly bland in comparison to the selection offered in the fall. The scramble ingredients vary and it's a simple but good option. Today I tried the rib special with honey cornbread, which initially I thought would be too much food, but it was so good I stuffed my face. No regrets.", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "i've had so much good food in this area that is it hard to top all of the other great restaurants, but OMG Colonie is straight up amazing and i'm still thinking about the ricotta with honey.  \ni went here on a sunday evening and tried a variety of offerings.  the duck egg was delicious as well as the octopus with fingerlings.  the brussel spouts come in a large order and we couldn't even finish everything.  the cocktails are unique and the atmosphere leaves nothing to be desired...except maybe a little more light in the bathroom.  it was dark in there!!!\nwhy not five stars??? the wait between dishes was a little too long in my opinion.  i love to have a long and relaxing dining experience, but it could have been a little faster.  i was HUNGRY...but left super satisfied.\nhighly recommended and the staff is the best eye candy around.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-24", "description": "For the neighborhood, this restaurant is a under-performer.  Seriously, do they taste their own food? I dare any of the staff (who were nice by the way) to stomach that salty bass without a chaser.  \n\nIt would have also been great if the menu mentioned the brussel sprouts were fried, which in theory is ok, but in practice = barf city.  The hanger steak was just ok, minus the mayonnaise \"aioli\" that went with the fries, and the accompanying Petite Syrah left much to be desired.. \n\nHonestly the worst 100 bucks I ever spent.  If you're in the neighborhood, stick to Smith Street, or try the nice Japanese place across the street.  I am still scraping the salt off my tongue.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-01", "description": "The brunch is not nearly good enough to justify how bad the service is.\n\nFirst, sitting in front of the kitchen isn't that bad.  It's only awkward for a second.  Second, it gets crowded but I've never felt squeezed.\n\nHowever the servers I've delt with are absolutely terrible. Generally unattentive and slow.\n\nMy last brunch there was the worst. The server either forgot to put our order in or just let someone else grab our food.  Either way, we sat there for 30 mintues without seeing our server and without food.  The chefs knew it, the expediter had to know it as he was only 5 feet from us, but no one took the time to care.  None of the other servers bothered to ask if we needed anything.  Awful.\n\nOnce the server realized her mistake she offered a forced \"sorry\" and no explanation.\n\nI'm sure it is a perfectly adequate experience for people who are lucky enough not be neglected but I'm certainly not going out of my way to give this place another shot.  It's just not worth it.", "author": "Roberto C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "Colonie is like stepping into Napa or Sonoma. The wooded decor and plants are amazing although like any other place in New York, the tables can be a little bit close together. \n\nThis is a great place to come with a large group for brunch. The basket of baked goods is devilishly delicious. My personal favorite is the mushroom and egg on toast. They make very nice cocktails as well. I have been several times and totally prefer it to the much lauded Buttermilk Channel (all our food arrived cold there!). \n\nThe staff are very friendly and part of the reason I go back.", "author": "Coco Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "I came for brunch with a friend, and while the space was adorable, I walked away feeling iffy. I had the duck hash, which wasn't too impressive (and really only had a few microscopic scraps of duck in it.. eek). Service was also strange and my friend had to ask for toast that was supposed to come with her dish anyway.\n\nAside from those things, Colonie is an otherwise beautiful restaurant. It'd probably make a great cocktail/dinner place for a date as well, since it's so pretty inside.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "I  was expecting great things out of Colonie.  It delivered in some and fell flat in others.\n\nThe good:\nParty of 6 arrived for a 9:30 reservation on a Saturday night.  Table wasn't quite ready, so the host offered (and we took) a bottle of champagne.  YES!\nThe space is incredible.  I absolutely love the open kitchen.  The restaurant seems big and small all at the same time.  It was flawless.\nThe tequila specialty martinia cocktail was unreal.  Loved, Loved, Loved.\nCarrot salad was awesome.  The carrots were all burnt and amazing.  \nSteak and fries were the hit of the evening.\n\n\nThe ok:\nSpaghetti squash was just ok.  Didn't wow me.\nService was just ok.  Our server spilled a drink on a member of my party and didn't seem to be that apologetic.  After the service offered at the door, I was a little surprised by this.  \nThe homemade donuts.  It's been done before and it's been done better.  Just ok.\n\nThe bad:\nDo not get the scallop entree.  Straight up not good.  Scallops were chewy/rubbery and bland.  \nThe menu is limited.  I'm not that picky but I was really only interested in 2 dishes.  The scallops being one of them.  \n\nI would like to go back for brunch, as it seems that's the real hit here.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Amazing food, great service. Great table at the street side. Yummy oysters and shrimps followed by corn, carrot and squash blossom dishes which were super fresh and tasty, not boring at all. The piece de resistance was one of the best trout I ever had. Will be here again ! Ps forgot to mention great cocktails and excellent wine, nothing bad to say about this place !", "author": "Johan V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "great food - every course was excellent \nservice was on-point\nloud at times", "author": "Ib B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-30", "description": "Along with Traif, I think Colonie has been one of my top meals in NYC.\n\nI was with one friend around 7:45 on a Friday night with no reservation (do they even take them?) and we were greeted by an extremely friendly hostess who told us there was a wait of about 45 minutes. She took down my number and my friend and I went two doors down to Floyd (go here! beers and cozy couches. perfect place to wait for dinner). The hostess from Colonie called my cell at 8:30 and we went back and we were seated at the bar that overlooks the kitchen. I was disappointed to be sitting at the bar at first, but actually overlooking the kitchen was sweet! Really fun to watch the chefs and prep cooks do their thing.\n\nMy friend and I were in the mood to try a lot, so we ended up ordering three apps and two entrees, all to share.\nThe egg salad crostini was pretty mind-blowing. I think it was because of the smoked marrow and veal jus that was somehow perfectly incorporated into the egg salad. These unique flavors infused the dish so well. \nThe duck egg, hen-of-the-woods mushrooms, and farro was SO YUM. First of all, this was not just a fried duck egg. It was like, DEEP fried. But somehow sunny-side up. The mushrooms and farro were rich and complex. Another epic win.\nThe Brussels sprouts were perfectly fried and accompanied by cranberries (yum) and large chunks of bacon (should be yum, but they were oddly a little bit lacking in flavor). I think the bacon issue might have been from braising the bacon with the brussels sprouts, post-frying... could this have zapped all the flavor out of the bacon? Anyway, I'm nitpicking here. Fried brussels sprouts are awesome and I was happy.\nMy only qualm was more an issue of our ordering choices- both the egg salad crostini and the duck egg dish were really rich, I think our third app should have been a salad instead of the fried brussels sprouts, particularly because our two entrees were rich as well. They have some really cool looking salads on the menu and I'd probably do this next time.\nEntrees:\n-Scallops with apricot, curry, pickled eggplant, pine nuts. W-O-W. The components I just listed should probably speak for themselves as far as how awesome it was. Perfectly seared, very large, texturally INCREDIBLE sea scallops. Can't recommend this enough.\n-Hanger steak with fries, roasted garlic aioli, baby greens... The fries were incredible, thin and salty and crisp, and the roasted garlic aioli was addictive. The hanger steak was absolutely delicious. Here's the thing though- Colonie just does such wonderful inventive things with flavors, I don't think I would necessarily order a steak here again. Not because it's not awesome- the steak WAS awesome. But I think you can order something more unique. But my friend was in a steaky mood (happens to the best of us right?) and it was certainly wonderful. (I was vying for the pork chop or the bass as our second entree and I can't wait to come back and try those).\nEveryone was super friendly, our waiter was great, and everyone in the kitchen who we were watching from our perch at the bar was smiley despite being super swamped with orders.\nIt's gorgeous inside, with a wall of plants (dare I say these are herbs they use in the food? I hope so).\n\nThe moral of the story is that everyone should get themselves to Colonie asap- it's a splurge-worthy evening.", "author": "Emma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "This place is amazing! One of my favorite dinner spots in Brooklyn. The burger is better than most burger specialists, and everything else is really good too. Highly recommended!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Very good but not 5 stars. Excellent cocktails. Great cheese/charcuterie boards. Very good crostini and salads. However, the pastas fall a little short of where everything else is on the menu. In any case, still very much worth visiting.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "This is probably the best restaurant I've been to in Brooklyn, and one of the best in New York -- and it's on our block. How danged lucky are we?\n\nWe went on a Monday night and were pretty stunned to encounter a 45-minute wait. But the hostess and bartender both made us feel well cared for while we waited, and we scored outstanding seats at the kitchen counter.\n\nService was what might be described as high-end Brooklyn: casual, hip, knowledgeable. You're not going to get starched white shirt waiters and a morgue-quiet dining room. It's rowdier, in a good way, and mellower.\n\nI loved everything we ate, but especially enjoyed the appetizers -- I had a small gnocchi called gnudi I think that was amazing, our greens were delicious, we had excellent beets. It's not that my fish and his beef weren't good. The apps were just better, and I think we'd just dine tapas style on all those treats and be really happy.", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "I sat at the chef's table here \u0026 had a great time.  I ordered the burger with the fries and it was cooked to perfection.  The bacon was crispy how I liked it and the fries were also amazing.  One of the best burgers I have had.  It's worth it to make a trip to BK to try this place out.", "author": "Alexa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "I feel like I must have been at a different restaurant than the rest of these reviews my waiter was terrible very condescending, never checked on us we waited 45 minutes to have half a dozen oysters that were raw - all you have to do is open them and serve them. It took another half an hour to get two dishes of pasta one of which was so salty it was inedible.  Terrible terrible experience I wouldn't recommend it to anyone seriously considered just going home and having a bowl of cereal instead.", "author": "jessica h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "Great atmosphere and typically crowded on weekend nights. Drink menu is good and diverse. Presentation is great here!", "author": "Donna R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}