{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "This is a delightful neighborhood restaurant with an ever-changing and never disappointing menu. \n\nI headed over with mom and sis in tow to find a fairly packed restaurant. A table would have been a long wait, so we opted to sit at the bar which overlooks the open kitchen. Although the space was limited and we got bumped a couple of times, It turned out to be quite a fortuitous choice--it was fun to watch the chefs whipping together entrees and appetizers left and right, and it just so happened that one of the chefs was quite the looker!\n\nWe decided to split a couple of dishes:\n\n(1) Brussel sprouts: These were to-die-for. They were crispy and paper thin, like chips, and just oily/salty enough. The perfect way to satisfy your hunger before moving on to your entrees.\n\n(2) Can't remember what is was called, but we had a version of bruschetta, sans tomatoes, plus a delicious assortment of mushrooms. The bread was crunchy and the mushrooms were so flavorful. It was a little messy to eat, though.\n\n(3) Skirt steak: The meat was cooked perfectly and the french fries were delish--crunchy and the garlic aioli was the perfect complement. \n\n(4) Fluke: The fish was meaty and also cooked just right. The fingerling potatoes were nicely roasted and well-seasoned. \n\n(5) We ended our meal with a slice of chocolate cake, which was good but nothing out of this world. I'd definitely try a different dessert.\n\nI cannot wait to go back to Colonie. The staff is friendly, the menu is original and the food is extremely well-prepared.", "author": "Janine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Brunch was delicious. Truly awesome. Guessing the staff have to submit headshots before getting interviews? Everyone is awful good-looking.", "author": "Matt F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "Adorable space. The corner tables for brunch are perfect for the awkward size of most South Brooklyn rectangle shaped spaces.  You can feel the sun from the windows, but they keep the door open so it's not stuffy.\n\nOutstanding meal. Duck hash w/poached egg and errant bits of frissee. Also had the monkey bread and tea. I should have had some vegetables, preferably something a bit acidic to cut all the fat and savory eats, but oh wells. It was too good to stop. Monkey bread is everything I love and nothing I should be eating at the same time and in the same dish. Bread, butter, sugar, cream and nuts.  It this is wrong, then I don't wanna be right!", "author": "Brigita J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "I love this place.  The pacing can sometimes be off but the food is well worth the wait.  Our favorite dishes: Ricotta Crostini, Summer Squash soup, Ricotta Gnudi, the Crab and Avocado app, Duck Breast entree, Scallops -- all amazing!\n\nOne bit of advice: While the chef counter is truly my favorite place to sit, it can be UNBEARABLY hot during the summer months.  (I feel bad for the guys behind the counter - I can't imagine how much worst the heat is in there.)  Stick to eating at the upfront bar if you are looking for that kind of experience.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Stellar.  Watching the Michelin-worthy eats prepared at point blank range was the icing on the glaze on the glorious pork chop I devoured.  Try the cool hand cuke...one of the finest cucumber-themed adult beverages I've had the pleasure of being pleasured by...", "author": "Jesse K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-01", "description": "I had high expectations for Colonie but it's disappointing on several key fronts, including:\n\n1. Grossly overpriced. A $17 grey goose martini gives you some idea.\n\n2. The staff gives off that annoying air of false superiority we all encounter on ocassion. Not a good fit in a family (albeit yuppy) nabe like Brooklyn Heights.\n\n3. Limited menu: only four entrees to choose from.\n\n4. And - most importantly - Colonie offers pedestrian food. Absolutely nothing memorable. Better tasting, more flavorful and layered meals can be found on the Food Network site. Scan the recipes, cook at home, eat better and save $150.00.\n\nIf you want a better dining experience visit Jack the Horse, Saul, Noodle Pudding, Queen, Morton's or Henry's End.", "author": "O U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Great restaurant in Brooklyn Heights. It has an awesome vibe, tasty cocktails and friendly/knowledgeable staff. I've been here with my husband a couple of times for dinner and the food and drinks have been consistently good. Sitting at the kitchen bar was enjoyable because you get to \"see the magic happen\". They definitely have a well choreographed plan in such small quarters. \n\nThe interiors have farm-to-table type of feel. Dim lights, lots of distressed wood, brick and a wall full on greens. It was a very warm and intimate ambiance, even with it having a open kitchen. If you do have to wait for your table, there are areas you can have a cocktail without feeling like you are in the way. I'm hard pressed to find anything I didn't find impeccable about my dinner at Colonie.\n\nWould like to come back just to have their cheese flights and wine parings.", "author": "I Love Cheese E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "My boyfriend took me here last night and I had a blast! The food was great and the the service was pleasant. LOVED IT.", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "They do a few things very well here. First - I love the decor, the set up of sitting in the window or at the chefs bar is my favorite for seating. The donuts with salted caramel are delish, and if you go for brunch you MUST have the duck hash.  Also, the pancake looked amazing.\n\nDislikes - prices are a little crazy so its a once in a while kind of place (my bf and i had 1 dish and 1 bloody mary each and the bill was $75) and they don't have a good set up for when it's busy, no one greets you so you kind of mill about half hazardly till someone sees you...", "author": "Melody G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-24", "description": "When Colonie opened, I loved it.  I still do, but not nearly as much.  \nIt was hugely welcomed to the hood, and I'm sure it will last, but I'd like to see them mix up the menu a bit, so I have some seasonal choices.\n\nThe last waiter I had was a bit nerdy and obsequious- Jeff Goldblum in Life Aquatic?\nJust say \"Good evening,\" bring us a drink, take our order and we'll let you know if we need anything more.\n\nThink about mixing up the menu and I'll think about coming back.\n-In a good way!", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Unfortunately we live nowhere near this little gem... The food was so delicious, I highly recommend the rhyeberry ragout, i could eat that for dinner every day of the week! We had a great canarian wine and the staff was so lovely and informative. The menu has something for everyone...", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "A friend arranged a surprise birthday party dinner for about 15 people (with a set menu, including place mats that had the birthday boy's name on them).  We made the journey from Manhattan and I have to say I thought the food was FANTASTIC!  I was not expecting that.  I had a beet appetizer, steak frite entree, and sticky date cake for dessert.  All of it was delicious, particularly the steak, which I found was cooked well and seasoned nicely.  I'd highly recommend this place -- I'd go back to Brooklyn to try it again!", "author": "Bryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Yum-oh. Just went here for dinner with my husband we really enjoyed it. We got some ricotta crostini and beet salad to start. Both very delicious.\nThe ricotta gnuddi is amazing! Fresh, and simple. And we also ordered the cod.  The desserts were out of control--fresh doughnuts and chocolate fondant. Will def return for brunch since brunch is my fave meal!  Also the restaurant has a beautiful interior and open kitchen, very cool vibe!", "author": "Katie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Consistently good with a great atmosphere and a wonderful drinks menu that changes seasonally. Some dishes are better than others, of course, but I've never had a truly bad meal here. The Brussels sprouts are amazing...even if you don't like them, try them here. Welcoming, laid back atmosphere makes this a cut above most others in the neighborhood.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Service is great, drinks are great. Food mediocre. Good menu but all the food was WAY too salty.", "author": "Jake E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "have had several meals here.there has not been one bad experience.  menu is wonderful.  ingredients are fresh. service is excellent.  its a sure thing!", "author": "J.P. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "A lovely place to take a loved one! Very intimate... Yes, you will be bumping elbows with the table next to you, but who cares! The food is really good for the value. Please try the:\n\n1. Duck Rillette Crostini\n2. The Pork Chop\n3. Sticky Date Cake or Doughnuts\n\nYou will be pleasantly impressed. :)", "author": "Shireen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "It's pretty sweet that this place is in Brooklyn Heights (technically, at least, since it's on the North Side of Atlantic Ave.) -- a neighborhood badly lacking in quality restaurants. Two or three more restaurants of this caliber and I might save a lot on cab fare.\n\nThe menu is a touch esoteric, but the food is really, really, write-home-about good. I'm a particular fan of the Berkshire pork. \n\nCritique: atmosphere and service are a bit manic. But this neighborhood could use a little bit of enthusiasm.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-11", "description": "Let me preface this by saying my experience was colored by the service and treatment we received and not by the food nor decor. \n\nAlso, one bad apple does not spoil the apple cart - I realize that, and you should to. \n\nWe arrived (party of 3) at 8:15 on a Saturday - we expected a wait, and there was one, of approximately 1.5 hours. The host kindly indicated that we should most likely just wait for bar seating to open as it did regularly - \"they're first come, first served\" he crowed! \n\nWe waited, and waited, and waited... when finally a seat opened, the patron was escorted to her table (I watched this happen) and we approached the bar's now empty seat. The bartender with the endearing Australian accent and curly golden locks promptly plopped a reserved sign down and said, \"sorry mate, the seat's still taken - she's just gone to the loo.\" I protested mildly and he insisted, so we waited some more. \n\nDuring this time we confirmed with two more staff that the bar was indeed, \"never reserved, always first come, first served!\" \n\n20 minutes later two more seats opened at the bar - right next to the one that remained vacant - and we were eager to eat and sit. When we approached the bar - BOOM! - down come two more reserved signs! I honestly thought the bartender was kidding, but no, he now happily admitted that he was saving all three stools for his friends that were coming by in a little while. When I calmly pointed out that not only had he lied about the first seat, but we'd been told by multiple staff that the bar was first come, first served and that we'd been waiting for over an hour, he shrugged and said \"sorry, mate.\" \n\nI understand wanting to show your new place of employ off to friends as much as the next guy, but this is your job and the place is new - should you really be driving paying customers out, so you can hand free drinks out to your friends?!? I can't imagine management would be happy with that.  \n\nI am as disappointed by the treatment as I am by not having been able to taste the food, but honestly if we'd stuck around everything would have been just a little too bitter that night. \n\nYour mileage may vary, but be warned - the bar is NOT first come, first served, and all customers are NOT treated equally.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Came to this place last year for my birthday. A little expensive, but a great place. Great atmosphere great food as ambiance. I loved the decor and lights were deemed which created a romantic atmosphere. Deff recommend this place just be prepared it's not cheap :) out bill was close to 100 for two.", "author": "Barbare T."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}