{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "We had great service, great food, great cocktails. Period. IF we were forced to come up with something that should change  - the octopus should have been sliced, rather than a whole piece and was slightly overdone.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-29", "description": "For all the hype this place just didn't do it for me. The atmosphere is great and the service equally good, but there is something really lacking in the food. The only menu item I enjoyed was something I didn't even order, a friend shared her Ricotta Crostini with me (thankfully), and it was delicious. The rest of the meal (all 4 of our entrees) were bland 1 was even overcooked (a steak that was well done that was ordered medium). Finally, the part of the meal I looked most forward to, dessert, was a complete letdown. Their dessert list on paper sounds amazing. I had the foie gras cherry glazed donuts. They were hardly edible. It tasted like someone had heated up smuckers cherry jelly and had poured it over dunkin donut cake donuts. Yuck. I won't be returning here.", "author": "Will R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "I never write reviews, but after brunch at Colonie this morning, I feel compelled to register my disappointment. While the space was beautiful and the staff was courteous enough, the menu was very limiting, and in general very unaccommodating. Could they omit the ham from the Benedict? No. Could we have cream or half-and-half instead of milk for our (very weak) coffee? No. Could I have a scrambled egg instead of poached? No. We certainly didn't set out to be difficult, but there was absolutely no willingness to accommodate their customer's individual tastes. The food was OK - not great. And brunch for two (with no cocktails) was $52 before tip. Nobody in the restaurant ever asked us if we enjoyed our brunch, so I felt compelled to register my feedback here in the hopes it will be heard.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "This place is so cute! I am really thrilled that it is in my neighborhood. The staf is very friendly, I had their burger, it was good, I definitely want to be back to try more food and hang out there on the weekends. I want to have a brunch day there with my girls too!", "author": "B U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "My new favorite restaurant! The food is creative, nuanced, and fresh. We enjoyed the cauliflower appetizer, then had pork chops and stuffed market fish for our mains. The lemon and peach pie we had for desert was to die for. Excellent wine list, friendly and attentive staff. We sat at the bar overlooking the chefs' work station, which created a fun and sometimes intriguing atmosphere. Great place to sit if you're on a date. We arrived at 6:30 on a Friday night and were seated right away. The place was hopping at 7:30, and they only take reservations for parties of 5 and over, so I'd suggest arriving on the earlier side if you can!", "author": "Anna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Great burger with a unique  twist. Doughnuts are a must eat. Cocktails are weak but taste good.", "author": "Truth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "Incredible, delicate and complex flavors these guys are very serious about their vegetables. The Kale salad is unique, and perfectly balanced with hints of green apple and candied almond.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-18", "description": "I was really excited to try this place out but...\n\nThe food was expensive and mediocre. Steak with fries under their \"Large\" category for $24 (!!) was appetizer size. In fact it was less food than my \"Small\" category dish of Black Risotto, which although many rave about was flavorful but way too al dente for my taste. I've never had Pork Belly which is served as ALL fat...maybe that is their style to serve it with no layer of meat or I got a bad batch but it did NOT taste good. My friends had the Foie Gras Doughnuts which they said was unexpectedly flavorless.\n\nAlso, we waited for a table of 5 about 1 1/2 hours while at least 6 tables of two got seated. I think the front-of-the-house needs a better system so the wait time isn't so high and low. THEN they end up squishing us into a table meant for 4 so 3 of us were benched on one side, elbow to elbow with other tables!\n\nIts getting 2 stars for the wait staff being pleasant and the atmosphere and decor being well designed and comfortable. Its still rather new so maybe certain elements of the restaurant will get ironed out.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-19", "description": "Hate to burst everyone's bubble, but don't believe the hype! \n\nAs others have noted, this is a very beautiful restaurant -- the decor and the lighting and the general look and feel are pitch perfect. Unfortunately, everything else was a huge disappointment. \n\nI'll cut right to the chase: the food was pretty bad...and not at all inexpensive. \n\nWe had a tough overcooked pork belly, an over-salted kale salad with a vague fishy flavor, another over-salted cauliflower dish with a nacho-tasting sauce (blech!), over-salted and limp fillet of trout (with chunks of chewy bacon !?) and a burnt chocolate bread pudding for desert. \n\nPretty much a complete disaster other than our oysters on the half shell appetizer, which was good . . . Can't say that the drinks are that great either. \n\nI would perhaps recommend going here to have wine and cheese and cured meats (we didn't try the cheese or meats, but how badly can those get screwed up?) because it looks so nice . . . As for dinner: stay away.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Finally! An excellent wine bar in Brooklyn Heights. Colonie opened 2.5 weeks ago and has a few kinks to work out, but it definitely is on the right track. The food (oysters, small plates, large plates) were all delicious--highly recommend the rabbit lasagne. \n\nYou can expect a friendly staff and great ambiance. Check it out; if you are a patient, wine-loving person, you won't be disappointed!", "author": "A S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "The food was decent. The place seemed like it would be cool except that the (good) music was loud, so everyone was yelling over it - though it was 10 on an Friday, so people getting loose is not really surprising. \n\nThe steak was good, but there was a philosophical disagreement about the fries: they were so skinny as to be basically potato chips, which I liked, but my wife (who ordered them) was less enamored. \n\nI had decent but not spectacular octopus and a frankly unmemorable salad. The duck rillette crostini was solid. What really put me off, though, was that one of our party clearly ordered a salad and an appetizer, with one to be brought with the main courses. Instead, they both materialized with the apps, leaving him the undesirable options of either husbanding his (warm) food and eating extra-slowly, or finishing his meal long before anyone else. We had been very clear with the server, yet when I said, \"oh, you've brought both [redacted]'s courses at once\" there was not a flicker of understanding in this person's eyes. This typified the staff's overall attitude, and our particular server was uninformed about their wine list as well, having to ask another server to answer our questions.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "Food and drink have been consistently good, but the prices can be a bit out of whack. Drinks are $13 bucks, beers are $9, apps are $13, and entrees are upwards of $25. The surrounding area is nowhere near this level of pricing. Colonie is expensive even for Bklyn Heights. Chip Shop is 10 feet away where a fish 'n chips with a couple beers costs $20 total. \n\n...Good food without value = no repeat business.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "Went to dinner here in early September. Decor was nice, service was friendly, the cheese plate was good, the heirloom tomatoes were good, the mini-doughnuts were good. What was not so good was: the pasta. My friend and I both ordered a pasta dish, and were both really underwhelmed; the pasta wasn't bad, but it wasn't anything special - not any better than what you'd find at a garden-variety Italian place for about ten bucks less (the pasta here goes for over $20 a plate). Honestly, it tasted like something I could make myself, and I'm not much of a cook. My friend has been here a few times and insists that other menu items are better; so, this story has a moral: if you go to Colonie, don't order the pasta (unless they've changed it up over the past month, which is totally possible...).", "author": "Mike N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Excellent brunch.\n\nGo for the Shrimp \u0026 Grtis w/ Egg or the Duck Hash.", "author": "Riot D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-18", "description": "Let's start with the positive:  The sticky date cake with salted crème fraiche ice cream is life altering. Such deliciousness raised a two star review to a three star.\n\nAnd the review goes downhill from here.  The food at Colonie is rather disappointing, which is a shame because it's a physically beautiful restaurant.\n\nThe Egg, which at $10 should be making one hear angels sing, is literally a single fried egg on a bed of plain spelt and plain beans with tiny mushrooms.  Remarkable in its mediocrity, and with each tiny bite a reminder that you just spent $10 on a $0.10 fried egg and have little to show for it.\n\nThe Brussels sprouts, which are a staple at many New American restaurants--nothing special here, and the bacon pieces were overly fatty.\n\nThe ricotta and honey crostini is good, but the same thing about a mile away at Frankies 457 has it beat.\n\nPerhaps most disappointing was the $22 tiny pork chop, where approximately 1/4 was fat or gristle, expectorated into my napkin.  \n\nI had the Bergamot Margarita; nothing special.\n\nEven though they've now been opened for several months, the service is still rusty.\n\nThe food is hit or miss, and the price to value ratio at Colonie is poor, which means I won't be back, except perhaps for the sticky date cake to eat at the bar after dining at another local restaurant.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "From the appetizers to main course to dessert everything was absolutely perfect. This place is REALLY AMAZING! The ricotta cheese toast with honey and mint is an absolute must!", "author": "Jena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "I've been here several times now, and have been reassured that this is hands down my favorite restaurant in Brooklyn. This place is great to come for a late dinner, as it gets less crowded. Twice I have beenserved by Christa, who is a wonderful waitress. My boyfriend and I came back once for dinner and sat at the bar in front of the open kitchen, which was great. We also have come once for dessert and drinks; amazing.", "author": "Una H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-14", "description": "An amazing seasonal cocktail menu.  Eat at the bar!", "author": "Nikki C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "This is one reason to leave Manhattan. I went to brunch here with some friends and ordered the biscuit eggs benedict... It blew me away. The fluffy, buttery, delicious experience was over all too quickly. I wish I had ordered two plates. I also did a flight of cocktails (i.e. took sips of all of my friends' different cocktails) and all were tasty. To top it all off, the ambiance reminded me of being in a local Nashville brunch place. I would recommend this place over and over.", "author": "Preston D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Cool atmosphere, delicious food, interesting selection, well-versed waitress, exposed kitchen. \n\nThe restaurant was a little cold, so was my food. Mains take about 30 mins to prepare. \n\nGood dinner choice for dates and small groups", "author": "NY X."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}