{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "My first visit was a wonderful end to a hectic day. The environment was soothing with brick walls, dark wood floors and flickering candlelight. The upbeat music helped create a hip understated atmosphere.\nI enjoyed the raw bar happy hour with 12 plump, fresh $1 oysters plus fresh bread and whipped butter. Complimenting the meal was a dry hard cider (picked from an eclectic cocktail menu. The bartender was very attentive and pleasant.  Definitely a place to share with my friends.", "author": "Suzanne J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "The management at Colonie reached out to us regarding our previous review and invited us back to have dinner on them - what a classy move!  We came in at 9 p.m. Sunday night, and from the moment we stepped through the door, felt we were in caring and competent hands.  \n\nOur server was solicitous and professional, coursed out our meal, kept our wine glasses filled, and checked in with us frequently to make sure we had everything we needed.  The food and beverages were consistently delicious.  A thing of beauty is a joy forever -and so is a perfect Negroni.  The oysters were impeccably fresh.  Carrots with cumin and ricotta were as good as I remembered, the snap peas tasted like springtime.  The maltagliati pasta with slow braised pork was my favorite kind of dish - familiar comfort food, but the citrus and anise flavors made it new - we couldn't keep our forks out of it.  Donuts with caramel custard sealed the deal. \n\nI don't envy restaurant owners in this city - diners have a zillion choices, with the Next Big Thing always opening to fanfare.  But I think the ones that thrive convey the message - through food, drink, ambience, service - that the diner is welcome and special, and that everyone, from chefs, to bussers, to servers, is actually happy to have you eating there.  Colonie communicated that message loud and clear, and I will be returning soon, with friends and family in tow.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "This is easily my favorite restaurant in BK, maybe in NYC. Been here many times and never disappointed. Dropped in before a show last night and had another great experience. Our food was just delicious. We shared the watermelon, lamb belly, duck, and red snapper. Excellent flavors, perfect portion sizes. Still raving about the meal this morning! \nThe service was very good too. Our server was charming, funny, and gave good recommendations. He also overheard us talking about a show we were going to and was contentious enough to ask what time we needed to leave, made sure all of our food came out in a timely manner, and brought our check with the main courses so we wouldn't have to wait. \nThe vibe in the restaurant is another thing that keeps me going back, and recommending to friends. The MUSIC is just fabulous. A mix of genres, all of it upbeat and uplifting. The decor and lighting are a nice mix of cozy and sophisticated. Sitting at the chefs counter is such a treat. Sitting at the bar is also one of my favorite experiences. Btw, Cool Hand Cuke cocktail = on the menu for years and never gets old.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "First time here during our trip to NYC. We stayed in the Brooklyn area and since it was my daughter's birthday, wanted to take her to some place nice. A friend recommended Colonie with great reviews so I made reservations a month ago. So glad I did!! Not only great service, but amazing food as well. Will definitely be back the next time we're in town!!", "author": "Cat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Delicious meal and a very cozy, romantic setting. Perfect for date night. Higher end price wise but won't break the bank, and definitely worth it both in terms of food and atmosphere. One of my favorite places I've been with my boyfriend. Brunch is great too-- much more affordable, albeit not as diverse a menu and not as good as dinner. (But still great!)", "author": "Vivian W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-17", "description": "Now that my best friend has moved to Windsor Terrace, the midpoint for us has shifted from Midtown East to Brooklyn Heights, which I'm not complaining about. I liked Colonie for its beautiful interior with the bright green ferns sprouting from one wall and the tolerable noise level on a Friday night (I could hear everything my friend was saying without having to strain), which makes it a great spot for a first date or a dinner with the parental units. \n\nFOOD: The food was tasty, but not especially different or original - the menu was the standard farm-to-table, locally sourced American fare that everyone seems to love these days. I also always have a grim chuckle when I see a place divide up its menu into \"Small\" and \"Large,\" because the \"Large\" invariably turns out to be the size of a reasonable portion and the \"Small\" is tiny enough to remind you of just how deep your hunger runs but not nearly enough to satiate. But points for Colonie for devoting a whole section of the menu to \"Vegetables,\" for those of us who dearly love our greens. \n\nThe gazpacho contained nice crunchy bits of toast but carried a mild sour aftertaste that threw everything off, and the grilled corn weren't the kernels that I was expecting but was grilled corn on the cob with a delicious tangy yogurt sauce. My favorite thing was the eggplant crostini with the slivers of spicy red peppers. We agonized over ordering the donuts basket for dessert and in a rare moment of self-restraint, mutually agreed not to (I know, I was extremely surprised). \n\nDRANKS: I wanted fire and brimstone in my watermelon chili margarita, yet it tasted more salty than anything. \n\nColonie is not exactly cheap: the bill came out to about $50 for two people for 2 drinks, 2 appetizers (the crostini and grilled corn), 1 \"Large,\" and 1 \"Small\" (the gazpacho).", "author": "Joy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Loved this place!  Went for brunch on a weekend, it was packed, but we waited about 20 minutes for a table of 3.  Staff was attentive, pleasant, and helpful.  We shared the biscuits, which were AMAZING, and a side of sausage, which was pretty good.  \n\nI had the duck hash, it was tasty, but had way too many potatoes.  We also shared the donuts with meyer lemon cream, also very tasty.\n\nOverall a good brunch experience.\n\nSide note: the place is popular, and was very packed and busy, but the restaurant made good use of the space.  Unlike other popular Brooklyn restaurants, tables weren't on top of each other and there was actually room to comfortably sit, eat, and get in and out of your seat.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Had the best time here on Friday night. Went for my best friend's birthday and was treated like royalty. Started with some great oysters for a buck each at the bar, and some well mixed martinis. We had a reservation for 8 for 6:15 pm, but never felt rushed to get to our table. Also had the nitro iced coffee, which was possibly the best iced coffee we had ever had. \n\nAnyways, we got to the table and surprised my friend with a happy birthday message on the menu. (The manager had been so helpful in making this happen!) The servers were on point and the food was incredible. The steak frites was perfectly cooked and the pasta with blue crab was heavenly. \n\nMy friend had the best time and I'm so thankful!", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "If I could put no stars I would but I have to enter at least one star just to write this review.  For the record, Colonie is not deserving of even this one star.  Food was good and we had the ubiquitous pork belly slider and duck hash for brunch.  My big complaint however, plainly and simply is that they charged $3 to fry my egg instead of poaching it.  My duck hash came with a poached egg on the menu but I asked for it fried well which is how I like my eggs.  I don't like runny eggs which is what a poached egg is.  The server took my request but when the runner brought it to me, it was sunny side up so we asked again for the egg to be fried well which was how I originally asked.  The runner rolled his eyes as if he were put off and when he brought it back from the kitchen he mumbled \"here, egg fried well\" under his breath.  Clearly he seemed annoyed even though I never deviated from what I originally wanted.  We had a full brunch and even ordered dessert (albeit mediocre doughnuts with a runny cream filling).  As I said, the food was good but not extraordinary.  The bill was $55 for 2 people which wasn't cheap for brunch but not unheard of and I am not adverse to paying an extra charge if it were deserved and reasonable. The server (who by the way was very fastidious about telling me which dishes had dairy so I could make the appropriate decisions due to my lactose intolerance) never told me about the $3 \"egg charge\" so I could choose to have it or not. I told him he should have mentioned this when I first requested to have my egg fried. I said I was supposed to have an egg with my hash and to me, an egg is an egg as I didn't ask to change the ingredient which is what I understand a substitution to be in most places. Since he was so attentive to my non-dairy need it was strange he didn't take a few seconds to let me know that my request to fry instead of poach the egg would cost $3 especially since no where on the menu did it state the cost of so-called substitutions.  It is not only inaccurate that this is an actually a substitution but it is highly irregular to charge an unspecified amount for it without letting the customer know first. Dare I say that this is even an unscrupulous practice?!  \n\nI rarely over analyze little things like this but I believe the runner who showed his dismay for having the egg returned to the kitchen to re-cook the egg probably did not convey that the customer had originally requested the egg fried well and the egg wasn't done as originally asked.  He shouldn't make it seem that I was some fussy customer who was making several unreasonable requests for a stupid egg which I wasn't.  The kitchen or someone from the serving staff messed up.  It seemed the charge was put on to quash a customer request and when questioned, they even went so far as to justify it with a no substitution policy which it wasn't. I am highly disappointed in this place, as I am always excited about finding good places to eat in my neighborhood.  Having been asked by the server when we first sat down if it were our first time, I said yes.  It's now my last time. You can just go so far with the food, the competition is stiff in the area and there are many places now on Atlantic Avenue and they should have thought more wisely about charging the customer for something so little as frying the same egg in the dish instead of poaching.  If I asked to add an egg, that would be different and at first when I saw the charge, giving them the benefit of the doubt, I thought that was where there was a misunderstanding.  When they clarified it was a substitution charge which this is definitely was not and would not take it off, I was not happy.  The service and accommodations will differentiate you from those who make your experience worth coming back.  This is not Per Se although Colonie thinks they are perhaps with their rave reviews and even with Per Se, whether you're a first timer or a regular, they provide the same service and work hard to make the patron satisfied.  Well, Colonie, you might have chosen Cobble Hill to make a splash but this Cobble Hiller is not impressed especially when incorrect applications of so-called policies are made. When you don't reasonably accommodate customers, they generally don't come back.  It's not about the $3, it's about my experience, about the server for not informing in the first place, about the annoyed look from the runner and probably about the annoyed chef who had to re-cook the egg and especially about the annoyed runner and server charging for a patron's choice of how she wanted her egg cooked and it's about the inflexibility to not take off the charge when the first time patron questioned the charge.  Yes, it's petty but for these reasons, Colonie is short sighted. As a local spot, you need each and every one of your customers to like you especially in the beginning to succeed.  Reputations are created and ruined by first impressions.  Mine was ruined", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Went to Colonie on Tuesday night to meet a friend that lives in the area. It was excellent! We didn't have a reservation (which I would recommend) and it was quite busy around 8:30pm on a Tuesday. We had to wait a few minutes, but we were able to order a drink while we did it was no big deal. \n\nWe had heard from a friend that the best place to sit was at the \"kitchen table\" and that's where we were seated. The reason it's called the kitchen table is because it's a long bar stool area around the open kitchen. It was Awesome! There were 3 chefs cooking in the kitchen and we were able to watch them prepare all of the food for the restaurant, while enjoying our own meals. It was so interesting to see and very entertaining! \n\nMy friend and I both ordered the Tagliatelle and it was really good! Fresh homemade pasta with just cheese, butter and pepper. So simple yet very tasty. I would definitely recommend. I also had a very interesting glass of wine. It was an orange wine, but considered a Pinot Grigio, which I had never heard of! My friend ordered the fig cake for dessert and that was so much better than expected! It was a great texture and tasted perfect. \n\nCheck out Colonie \u0026 don't forget to request the \"kitchen table.\" I'll be back when I return to the Brooklyn Heights area!", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-27", "description": "Went there twice for dinner. Disappointing. Very salty food. Pricey. Not. Horrible place but also not necessarily good value.", "author": "Stephan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "Firmly mediocre and overpriced. Neither the service nor the food stood out in any way. We got in after a wait that was several hours long and immediately ordered and asked for bread. Server agreed to the bread, sympathetic to our hunger. We got it 30 mins later. Cold bread. 30 mins later. We were seated in front of the kitchen. The service was careless at best, unprofessional at worst. \n\nWe ordered across the menu. The brown butter crudo was good but the fish was definitely old. Smelled and tasted very fishy. The rigatoni was so salty it was almost unbearable. Even the burger was bad today, which was hard to screw up. The burrata was crumbly, inexplicably. The lamb was good. I have had the pork before and it came out raw. \n\nWe came here because there were few options in the area and this had good reviews. There were a handful of negative ones, which we ignored. Do not make the same mistake.", "author": "A A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "This review is only for their brunch, which is fantastic! My boyfriend and I arrived at around 11:45 am on a recent Saturday and it was pretty packed. They don't take reservations for brunch, so go early or be prepared to wait. There were people waiting for seats by the time we left maybe an hour or so later. We were seated at the chef's counter, which is a fun experience. The two drawbacks about this is that it's pretty warm in that area due to the open kitchen, and the back room only has two small windows that open to a brick wall and plants, so it's not lit by sunlight. The front area has two cute window tables that fit two or three people, and there is also a good sized bar. The back room has tables against the wall, a long community table, and then a long chef's counter, which is fun to sit at because you can watch everyone cooking and orders going out. \n\nWe each got an iced coffee, which were strong and large. I got the duck hash (I had heard so much about it!) and he got the biscuit benedict. (The biscuits were delicious and had a great fluffy texture!) I was glad that the portions were large and everything was really tasty! I seriously loved this brunch. Other people have said that the duck hash is too small, but I found it to be a lot of food and very filling. There were tons of potatoes. It was a bit too salty for me, so I took some of my boyfriend's really tasty lettuce (it had some dressing on it) and put it on the hash. We also ordered a side of the sausage, which was also really good. \n\nThe service was wonderful. Professional, efficient, and friendly. We hardly had to wait for anything. We ordered the salted caramel custard doughnuts to go and enjoyed them at Brooklyn Bridge Park. Our bill was around $60, but we did order a lot. I think they have a really reasonably priced menu with something for everyone. My boyfriend always complains when a restaurant's brunch menu doesn't have a plate of just classic eggs, bacon, and toast, and he was definitely satisfied by the biscuit benedict!", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Mouth watering food, sensational cocktails (I recommend the cool hand cuke!), great service. I was especially impressed about how the entire waitstaff was so attentive we had a couple different people help us throughout the meal. Great experience!!", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This area is not what it used to be.  Walking down you have tons of restaurant options.  You won't regret going to Colonie! You can't go wrong with this local produce, cocktails,  and fresh pasta. You get for what you pay for, everything is exquisite.  This was my first time having anchovies and it made me a believer of putting it in everything.  The staff was very friendly and helped making decisions which was a great plus.  Lily was a great waitress and very helpful in wine selection. The executive chef Jared was very personable and very helpful on food selection.  Everything on the menu is delicious it just depends what your in the mood for.  The pasta is made on premise and it will not disappoint.  The must  have dishes are the anchovy toast,  mushroom pate,  roasted carrots, bass crudo, and date cake! Everything was full of flavor, very filing,  different textures, and very rich.  This place gets packed fast so make reservations.", "author": "Brigette U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Loved this place so much that I hit it up twice in one weekend.  The menu changes daily and the servers are very informed on each item.  I had a pasta the first night and it was fresh pasta, fresh like Italy.  So good I couldn't tell you what they did but it kept me coming back for more.  The next night I had a different pasta with saffron and goat.  I was a little weirded out by the description of the goat but nevertheless this pasta was also on point!  Great location on Atlantic and you can slip into Elsa's for a pre-drink cocktail or after dinner night cap.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "We randomly chose this place not knowing much about it. The craft cocktails are fantastic and the folks behind the bar can meticulously make off menu classics, such as  a Vieux Carre. But their food, damn....we ordered a bunch of things to share. Most of which I would never really order on my own, but they were recommended by the staff. Amazing flavors and textures and the fish was easily the best fish I've ever tasted. No question. I'm not a fancy food person by any means. I'd like to think I'm a pretty standard guy. Things are good or they're not. Whateves. But when I bit into the fish, It was like that scene in ratatouille where the critic took a bite and tears up. Chef changed my life. I recommend sitting at the kitchen counter and watching these guys do their thing. Fantastic place with an awesome atmosphere. I will definitely be going again.", "author": "Paul T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "This is long overdue since I live in the neighborhood and have been coming here for a while. \n\nI've never been disappointed by anything here, from the service (everyone here is nice and chill and attentive - if you can get a seat at the chef counter it's a plus), to the drinks (blood orange chili margarita is a winner), to the food (the carrots and the rotating pasta dishes are my go-to choices), to the atmosphere (except the one time we sat behind a patron who kept talking about her bowel movements). \n\nThis is one of those places that you hope your enemies/frenemies haven't found about, at the risk of having to duke it out at Adam Yauch Park for territorial supremacy.", "author": "Genesis W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "This place gets packed rapidly on the weekends, so be prepared to wait if you don't show up right when it opens!\n\nI loved the ambiance of this place - really open doors and entryway make for an inviting restaurant, and the rustic wooden seating in the back contrasted with the bright white panels near the bar make for exciting juxtaposition.\n\nHighly recommend the cider on their brunch menu - really dry without being dehydrating, and not at all sweet, which made it quite distinct. I got the burger, which features an over-easy egg and applewood smoked bacon - let me tell you, that burger was somethin' else. My cousin got their eggs benedict, which also came with applewood smoked bacon - so pretty he didn't even want to cut into it (almost convinced him to take a photo #yuppie).\n\nService is pretty efficient and the bartenders and servers are happy to chat with you if you sit at the bar and ask lots of questions about their farm grown pickled vegetables.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This place is so amazing ... quality of ingredients and the taste of the food. I will definitely come back. Most people seem to order the Benedict and Duck Hash. The Biscuit Benedict was a hit on my list. The grass fed burger was super tasty too. I would give this spot above 5 stars if possible. Awesome !", "author": "Anny P."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}