{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "From the management that brought you Public, Double Crown and Madame Geneva, Colonie, located on a busy stretch of Atlantic Avenue, brings a new breath of fresh air to the restaurant-starved neighborhood of Brooklyn Heights. In recent years, other local favorites such as the Italian staples, Queen and Noodle Pudding, as well as the game-centric Henry's End, have brought notoriety to the area, but not destination worthiness. That has all changed with the joyous arrival of Colonie. Opened in 2011, with its gutsy New American menu, Colonie is headed by Chef Brad McDonald who replaced Alex Sorenson (Mas-Farmouse) earlier this year. Chef McDonald brings an astonishing pedigree with him, having staged at some of the best restaurants in the world including Alain Ducasse at Essex House, Per Se, and Noma. His talents, along with an adept and enthusiastic wait staff, has merited Colonie with the highest current food rating (26) for Brooklyn Heights in the 2011-12 NYC Zagat Guide. The restaurant is bedecked with a ceiling that is completely lined end-to-end with wood planks, and between the lively bar patrons and the brick wall dining room lays an impressive and towering vertical herb garden where the cooks can pick their daily foraging. The airy, open kitchen is designed to reduce temperature in the dining room. This is a welcome relief to the customers that scrum to be seated at the dining bar attached directly to the open kitchen. The crafty barkeeps execute one of the most interesting libation menus I've seen as of late. All juices are freshly pressed to order, using commercial juicers found in the best vegan establishments. My friend, Isabel, who is a \"newbie\" to New York and my \"foodie-in-training\", joined me in sampling the Sugar Kiss Cooler house cocktail ($12); a delightful and refreshing mixture of organic gin, Lillet, fresh melon juice, basil syrup, and sparkling wine. The restaurant only takes reservations for parties of five or more. We waited comfortably at the bar for about thirty minutes, before graciously being seated in the bustling dining room. The menu has everything for everyone, from the light eater to the ravenous multi-course craving \"foodie\". For starters, we indulged in absolutely luscious Rabbit \u0026 Foie Gras Terrine with a Frisee Salad topped with Port Reduction ($14). The intricate quality of this charcuterie was as amazing as the famous Tourte De Gibiers I once encountered at Bar Boulud. From the vegetable selections, we thoroughly enjoyed the savory Braised Young Leeks with Romesco Sauce, Almonds and Cilantro ($11). Colonie has a masterful wine list with excellent choices from the nearby wineries to the international and many at very reasonable prices. After a thorough perusing of the wine list, we selected a bottle of the superior 2008 Domaine Chantegut Vacqueyras from the Rhone Valley; a powerful spicy, raspberry, and cherry-fruited blend of Syrah with Grenache ($49). From the large plate choices, Isabel and I were floored by a succulent quartet of sweet, juicy, and impeccably seared Scallops with Apricot and Curry Purée, Pickled Eggplant and Pine Nuts ($22). The seasonal and all-together remarkable Berkshire Sausages with Fennel, Peppers and Onion ($18) were a perfect summation to the main courses. To bring this glorious meal to an appropriate crescendo we pampered ourselves with a tasty, albeit pedestrian Blueberry Citrus Almond Tart and Buttermilk Ice Cream ($8). Conversely, the Fresh Salt-Caramel Custard Filled Doughnuts ($8) paired precisely my crisp glass of Hungarian Tokaj Cuvée Classic Dessert wine ($16). Two stars for the inspiring cuisine, another for the hip scene and rustic digs, one more for the attentive and smiling service. Dinner for two with cocktails, bottle of wine, tax and tip was $210.", "author": "The Jedi Foodi E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-19", "description": "it gets two stars only because the small portion of food that i got actually tasted good. horrible service, took an hour to get food. appetizers came out BEFORE drinks. portions were so small i left hungry. no joke. bad music, too loud. server gave every one the wrong drinks. $200, and had to eat again when i left. sad bad bad bad time.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-10", "description": "This was the second time we ate here .the first time was great ,service,food,dessert especially the date cake .Now a new chef and it shows one octopus tentacle thrown on a tossed bunch of greens is ridicoulous the vegetarian entree one of my party had was all of 4 spoonfulls of ,what,no flavor and no food oh and when i order a 90 $ bottle of wine lets make sure its the same vintage as the menu and not slip another year like we wont notice its arrogant lots of places out there folks get your act together", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "Amazing. Truly, truly amazing. One of those places where every detail is a godsend. Service was so charming. And they value local and organic ingredients. Oh I do love good food.", "author": "Lila L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-20", "description": "It was good. Not great or exceptional like I was hoping for, but solid. \n\nWe got the VT Bleu cheese with Prociutto, as well as the mushroom Bruschetta. All very good. The Bruschetta was very nice, good quality ingredients, nice portion of whole mushrooms. Great small option for vegetarians or vegans. \n\nFor the main dish, I got the Skirt steak, which was tender and juicy (lots of jus), but I ordered it Medium-rare, and it was Medium, if not medium-well.Not that we complained. BUT, if we had wanted to, our server was nowhere to be found for at least 10 minutes after dropping the food. \nAs for the rest of the dish, the chili aoli was pretty bland; the braised greens (chard) were OK. \n\nMy dad got the Fluke, which was also good. Nice and creamy. \n\nWe got a few sides, Brussels sprouts, which were nice, if a bit over-salted. Likely b/c there's bacon added, which adds saltiness without needing salt. \n\nDrink service was slow. Servers were kind and friendly, and offered good suggestions, displayed good general food knowledge. ... But were somewhat elusive. But adequate. \n\nThe Long Island Cab-Franc was sub-par. \n\nOverall, I will probably go back. The atmosphere is nice, the service OK, and the food good.", "author": "Como Ana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-20", "description": "Creative menu and very good food especially the appetizers, but the EXTREMELY NOISY dining room will keep me from returning.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "Had dinner there tonight  for the firest time(4/10/11) with knowlegable friends.  \nAll of us had a fabulous experience.  Great service, food, venu, just everything.  Menue outstanding.  Our best new local place.  Wish they had reservations.   Can't wait to go back.", "author": "Lawerence O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-09", "description": "First time at Colonie and it was a delicious and pleasant experience. The place has a nice rustic decor, friendly wait staff, and amazing food. The raw oysters were clean and very good. We ordered several salads and vegetable dishes, the stand outs include the young leeks, carrots, beets (all separate dishes \u0026 all very good). Baby lettuce salad was bland, and the fried brussels sprouts seemed a bit dry. The squid \u0026 chorizo dish was great, the scallops were outstanding, and the wild sea bass was delicious (although somewhat rich, i loved it). Pork chop was outstanding as well, and was the favorite dish of many in my group. We had to order some desserts, knock-outs were the chocolate fondant and the fresh doughnuts with salty caramel custard (yes, it's as good as it sounds). 5 stars.", "author": "Max G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "very good, creative food.  among the more expensive restaurants in the area, but good for a special night out.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Great Brunch spot!  Recommend the Benedict Biscuits, and even the OJ which was somehow the best I've ever had.  We got there right at opening but otherwise there tends to be long waits so keep that in mind.  Also a bit pricier but worth it for a nice all around experience.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "So right now, the hype is all on colonie, and I went there for brunch to test out their food. I went with a friend and sat on the bar area. I ordered the duck hash. The food was pretty good. However, because we sat in front of the kitchen, you could see all of the butter/oil/fat that goes into the food that makes it great. I mean, all restaurants load their foods with high calories, probably, so it was an eye opener in that regard. The ambiance was nice, and the staff friendly, and I highly recommend the duck hash. Will be back to try the rest of their menu offerings.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Don't listen to Britt M and Jim K. They are like most yelpers who love to jump on a restaurant right after it has opened and point out everything that could go wrong. Complaining about the candles in the bathroom? give me a break.  there were about 4 down there, i.e. adequate light. and  there is a light switch right inside the door w/ a huge light above the mirror. just turn it on if you need more light for some idiotic reason.\nhad their bread pudding and they have surely worked out the kinks on that. thick, rich, moist, adequately crispy on top.  i agree w/ the haters that the cheese portions are pretty small. but when you get a Grouper like that - cooked so absolutely perfectly - your small cheese appetizer is long forgotten .  sure, they need to work out kinks, they need more space in the dining area and their bartenders need to step it up, but otherwise this place  is headed in the right direction. food was stellar.  foie gras donut wasn't my thing, but everything else was impeccable.  and we had a lot of different items at our table.", "author": "john b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "Portions people, portions. I went with Jordan S \u0026 like he said, we all left hungry. However, on the plus side, you don't leave feeling like you might roll down Atlantic Ave and into the East River... And everything that we did get to eat was delicious. The duck hash was the clear winner, and I feel kind of bad that I ate a few bites of my friends'. However, the asparagus omelet was pretty tasty and fluffy itself. The Bloody Marys were also really nicely flavored, but again too small for the price tag. The place is damn cute though and I just loved being in there. That's got to be worth something, and I will probably be back if I am feeling fancy enough to afford dinner there. Word to the wise: the two window tables up front are first come first served so if there's a long wait you might be able to snag one of those. We did, and my second word to the wise would be that it gets reallllly warm sitting in the window. Not that I'm complaining, I love feeling snuggled in sushiney warmth while easing into my day.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "There was a lot of hype surrounding the opening of this place, but it more than lived up to it. Everything I ate here was a total knockout. I had the scallops; they were huge and seared perfectly. Hubby had the duck, which might have been the most delicious duck I've ever eaten. We had the mushroom crostini and a couple of cheeses to start; those were also great. Best of all, I live nearby and was told it would be an hour wait; I asked the maitre'd if he could give us a call when a table opened up and he happily obliged (we only ended up waiting about 30 minutes). If the food and service continue to be this good on our subsequent visits I will come back and throw in that fifth star.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "I finally got a chance to try this place on Saturday night and am glad I did.  They don't take reservations but we were planning on eating late.  We walked in at 9:45 and still waitied 15 minutes, which was fine with us but just a warning to not drop in if you are on a tight time schedule because this place is packed.  They only have three beers on tap but my bf managed to find one that he liked.  I had a cucumber martini that was awesome.  They juiced a cucumber right at the bar and it had a really fresh flavor.  For an appetizer we shared oysters, with a yummy mignonette sauce.  Then we shared the hangar steak and the pork chops.  The steak was cooked perfectly but the mixed greens left something to be desired, its like the dressing was too lemony.  We barely touched them.  The fries were also good.  The pork chop was slightly overcooked but the cabbage that came with it was so good and flavorful.  It really made the dish.  The service was excellent.  I'd definitely return.", "author": "Marissa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-26", "description": "Still some kinks to be worked out.  Service at the bar is slow and confused.  Nice atmosphere, though.  Probably worth a second try.", "author": "Jack F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "My husband and I got there right at 6pm and there were already 4 parties waiting ahead of us, so I would definitely either get there early or be prepared to wait. Everything we got was good, although, like another poster, I thought the Brussels sprouts were way overcooked. What blew me away were the oysters. I've never understood the appeal of them, but these oysters -wow- fantastic. They come with this light, cucumber-citrus (I think) side that really enhances the taste. Don't miss them!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "I could sit and intricately describe each thing we got....but it still would not do this place justice. this is my new favorite spot in brooklyn....manhattan....the planet earth....whatever. its REALLY good. Can't wait to go back!", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "I've been here twice so far.  Once, I sat at the kitchen counter thingie with two friends.  That was a fun experience, watching the chef.  He seemed like a nice guy.\n\nLast night, I went with 4 of my friends for my birthday.  The host held a table in the back for us, even though my friends were a little late.  I really like the ambiance here, and the food is great, too.  I've had a few of the crostini, a bunch of the vegetables and salads, and pretty much anything they have that involves risotto or mushrooms.\n\nHowever, last night, our server was a heinous b*.  My friend had put her umbrella on the floor in the corner behind our table.  When the server noticed it, she glared at it and us like there was a dead raccoon on the floor.  My friend apologized and said she thought it'd be out of the way there, and the server was just rude in response.  She also was a b* about how to pronounce certain menu items--I have off-the-boat Italian relatives; they pronounce ricotta in just two syllables.  I know it's a contested topic, but, hey, server, don't be obnoxious.  Don't try to correct me with your Middle America pronunciation of the word.  You know what I'm ordering.  Just write it down on your pad and call it a day.  As we were getting ready to settle the check, my friend asked if she could break a 5 dollar bill with some singles and some quarters.  The server, again, was laughably rude, telling my friend that \"we don't do coinage here,\" with an ugly snarl on her face and an aggressive tone in her voice.  Really, lady?  Who are you?  Who talks like that?  People who say rih-cat-ah?  Oh, okay.\n\nThis would have been a 5-star review, but this woman just needs to go.  What is she so pissed about?  I can never understand people who work in a service industry yet clearly hate dealing with people.", "author": "Steph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "I wish I'd reviewed Colonie after the first four times I'd visited because everything was wonderful--food, environment, and service. However, I went last night with visiting friends and the food and atmosphere were still excellent (though portions seemed to have decreased a little, which was fine) and the hostess was lovely, but our server was really disappointing to the point where her b*y attitude tainted the entire experience. I don't know if Ashley V. (according to our receipt) was just having a bad day, but she was rude and unprofessional, rushing us along, never smiling, never checking on us, and making a couple snippy remarks. It was unacceptable and I was embarrassed because I had just been telling my friends how great every aspect of this restaurant had been on previous visits. Despite this, we still left a decent tip because I love the restaurant and I imagine the tip is shared among several people. I'm definitely going back to Colonie, but will request not to sit in her section--she was so \"blech\"!", "author": "Alissa C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}