{"aggregateRating": {"reviewCount": 546, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Everything tastes good. Nice atmosphere. The service was nice including the servers, the bartender and the chefs. We ordered bass crudo; crab pasta; steak and date cake.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Colonie was a great spot for brunch in Brooklyn Heights. I visited last weekend and enjoyed my experience.\n\nMy table started with the monkey bread drenched in toffee sauce and topped with pecans. We split amongst 3 and seemed to be the perfect size.\n\nFor my main I tried the biscuit benedict. Since the biscuits were homemade they were extremely fresh and then topped with smoked ham, poached eggs and hollandaise sauce. It came with a side of potatoes on the side. Plus, if you want a side of bacon or sausage you can add that for just $3.\n\nI was happy that my friend had come to Colonie before and new how to play the brunch game. They open at 11am and don't take reservations for brunch. They have plenty of bar seating, but if you want to guarantee a table I would show up between 11 and 11:15.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Amazing experience.  The ambiance of the restaurant was incredible.  The food was absolutely delicious.  The setup allowed for an intimate experience with the chefs.  Shout out to super chef Corwin!", "author": "Tremeal B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Most disappointing restaurant I've been to in Brooklyn. The restaurant is small, loud and crowded. Service is very slow. Our cups were not filled with water when we arrived even though we called head and reserved the table.  We had to wait 10 minutes to get water, which was warm. The server didn't leave water on the table, so we had to wait another 10 minutes to get refills.\n\nThe menu is embarrassingly lacking. There's no poultry or basic salad options. You can get some pieces of lettuce with some drops of lemon for almost $20. Ridiculous. Wine list is also minimal and lacking.\n\nWe came in a larger party, and multiple members ending up getting nothing except water. \n\nIf you're looking to entertain guests, go somewhere else.", "author": "Krista G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Located in downtown Brooklyn, Colonie straddles an area that is in the midst of hyper gentrification while pockets are still very  much where they have been economically for decades.  Nestled in an old building, Colonie has a very unassuming storefront which leads into a gorgeous space full of wood and brick decor that feels almost like a hug as you walk in.\n\nColonie has a relatively large amount of space for a Brooklyn eatery, and they try to maximize that space as much as they can.  In the front are seats by the windows.  A small bar is near the host station (which becomes necessary during busy hours) and towards the back is the main seating area.  To one side is the open kitchen where lucky diners can eat and watch the chefs create the wonderful dishes served by the restaurant.  Nearby are regular tables which can be put together for larger parties.\n\nI've gone to Colonie twice so far, and each time the service was spectacular and the food was great.  Both times I had the Leek \u0026 Chevre Scramble which is a wonderfully fluffy egg scramble that practically melts in your mouth.  Less successful are their biscuits, which I think are meant to be rustic but have less taste and are more solid than I care for.  I have had the sausage side too and that is absolutely delicious.\n\nIf you are going to come here for brunch, I highly recommend getting there as early as you can.  The first time I went there was a huge crowd waiting, so you have been warned.  Plan properly, and you'll have a great time!", "author": "Benson Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "The look and feel of this restaurant is great. I love a good green wall and the windows and brick walls really make the place feel homey. I only went for brunch but I will be back for dinner.\n\nNegatives: we were told it would be a 30 minute wait and we ended up waiting for an hour and 20 minutes, mainly because I think they thought our group was comfortable at the bar and they skipped us instead of offering us the table. It sucked a bit but we did enjoy a really yummy charcuterie board with great portions and nice choices of cheese and meat. The onion jam was really flavorful and the little crackers it came with were DELICIOUS! They also sat us at a great table alone in the back, probably to help make up for the wait (it worked) ;) \n\nPositives: the FOOD. everything was SO GOOD. Best brunch I've had in the area hands down. We ordered the Turkish eggs with a garlic yogurt spread and a Aleppo chili oil. I could have dipped an entire loaf of bread into that oil alone and been a happy camper. The next dish was the Duck Hash. The waiter described it as \"hearty\", and dam was that accurate. This is  HEAVY dish, but it was really good. Perfect to share. They only gave one poached egg on top and to be honest it's so much potato that it could have used 2. I wouldn't have complained if there was a little more duck as well. But honestly, mixing these two dishes together (putting the oil and the yogurt on the duck hash) was a match made in heaven. We also got a side of bacon which was a really nice size and came to the table piping hot. \n\nThe service was good, they paid attention to us but weren't intrusive. \n\nI will be back for brunch but I'm even more excited to come for dinner. I'll update once I do that", "author": "Tami M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Came here for Sunday brunch after seeing really great reviews. The interior was really nicely done and the atmosphere was great. We were seated at the chefs counter, so it was totally entertaining to watch the cooks in action and all the great looking dishes coming out\nI ordered the biscuit Benedict, my boyfriend ordered the scramble, and we shared the donuts.\nThe ham on the Benedict was really chewy/fatty so wasn't loving, and thought the potatoes were bland. I tried the scramble, which was probably better than what I ordered.\nThe donuts were a good brunch dessert so would recommend tacking those onto your order! Extra powdery with a tasty creme on the side\nOverall I would rate the atmosphere a 4 and the food a 3", "author": "Sam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Ate the most wonderful meal. Had the Lamb Belly with the delicious yogurt and mint sauce for starters. The lamb melted in my mouth. Then had the rigatoni pasta was favorable and a little spice to it. Finished off the meal thyme sugar coated donuts with lemon Meyer Chantilly  cream.", "author": "Tamara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Delicious food from start to finish! The inventive cocktails were superb (I had a Cool Hand Cuke) and their selection of beers and wines is fabulous.  Our appetizers gave us a hint of the creativity of the menu and complexity of the flavors we would enjoy throughout the evening. Our favorites were the special fried mushroom and the bass.  The pastas entrees were extremely well prepared and flavorful and the fluke was among the best dishes we've ever had. We were so full that we only ordered one dessert to share (the panna cotta) which was a perfect end to a layered a immensely satisfying meal. Congratulations to chefs Jared and Kone who we got to watch prepare the feast for us and a happy throng of other guests!", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "Probably not even worth reviewing, but I just can't help myself. It's not a memorable bar, other than the bad smell. Having said that the staff were friendly and more than happy to suggest cocktails we might like. The place wasn't that busy for a Friday night, but it was the day after thanksgiving. I would say this bar is a safe bet, not a stand out but won't disappoint.", "author": "Matthew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "The atmosphere is beautiful and everyone is so friendly and accommodating, I am not a meat eater so there weren't many options. My recommendation is to add more options for vegetarians, also I got the spaghetti and I was really disappointed because it was $24 and it was just spaghetti with cheese and sprinkled pepper. I have no problem spending on good food, but this plate was not worth it. The wine selection is delicious. I'm giving 5 stars for atmosphere, accommodation, and presentation, and our server was so friendly!", "author": "Natasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Absolutely exquisite food. Went for brunch and got to taste lots of different things with my group. Hard to narrow down even one recommendation because everything was so good. The pancakes are stunning. The mushroom crostini is out of this world. \n\nOne warning--if you are finicky, you'll want to ask for details before you order. The shrimp and grits was AMAZING but with an Asian twist. It was delectable but again, if you're not someone who likes that kind of surprise, just ask how your dish might be prepared.", "author": "Roberta L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "If I was on death row, I'd order the Turkish Eggs as my last meal. The staff is incredible, too. Eat at the bar, if you can. Great cocktails, atmosphere and food. I've spent way too much disposable income here and I'm ok with that. Worth it.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Great presentation, very nice ambiance. You can order your own mini French press, but sadly they don't have an espresso machine. Great for brunch - would recommend! They have an interesting cocktail menu too - quite winter-festive!", "author": "Zoe K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Stopped in for a fantastic late brunch. I had the duck hash, which despite having a slightly high ratio of potatoes to duck, was delicious due to the tangy sauce. I wish it came with more than one egg! My girlfriend had the leek and goat cheese scrambled eggs which were cooked perfectly and were the standout dish.\n\nThe nitro brewed and slightly carbonated cold brew was a fun change from drip coffee.\n\nOverall the prices are fair for the area, and the restaurant has a great space with a charming green wall. The only thing to watch out for is that the open kitchen concept means the back part of the restaurant gets a bit hot.\n\nI'd put it in the upper tier or brunch places I've been to in New York", "author": "Sebastian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "My sister and I ended up here on a whim before we went grocery shopping at Trader Joe's, and I'm so glad we did! The food was amazing and service was great, we sat at the Chef's counter and were not turned off at all watching the team prepare our meal!  \n\nThe pancakes were crunchy on the outside and light and fluffy on the inside. They had the perfect touch of sweetness without being too much! The duck hash had hugeeee pieces of duck so you definitely know you're getting your money's worth. The fresh greens added a nice change to the already innovative dish. The eggs were light and fluffy, so I'm sure their egg scramble on the menu is amazing too! The biscuits were dense but not in a bad way and with nice crispy edges. The preserves were a little sweet for my taste, but still tasty! \n\nI definitely recommend and would come here again!", "author": "Chelsea G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Love this place nice food and best service,  no wonder so high review here !\nNice people and feel calm peaceful healthy food", "author": "Qing T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "You must try the duck hash, it is AMAZING. The photos don't do it justice. My friends had the leak and chèvre scramble and the trout, both were great too. But that duck hash!! Incredible. \n\nIf you're coming from Manhattan like we were, definitely hang around after brunch, this area of Brooklyn is lovely!", "author": "Kristina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "Brunch in Brooklyn! As a west coast boy, wandering around Brooklyn looking for good eats is an affair of the heart. I settled on Colonie in Brooklyn Heights after an unnecessarily exhaustive search through reviews and online map locations close-ish to my hotel. (admit you do all this too.)\n\nIt's a crowded spot with lots of good Brooklyn energy and I was lucky enough to get a table towards the back of the restaurant. I started with the French Press Coffee (it was my special day after all...). It was great...as strong as I wanted it to be, perhaps a tad acidic for my taste.\n\nI had a Kale and Gruyere scramble with jack cheese. They declined my request to make it with egg whites or any egg substitute...so if you are looking for eggs and always get that option, this isn't the place for you. (I'm accustomed to paying a surcharge for egg whites, but definitely not accustomed to places refusing to make your egg dish with egg whites. Whites...that comes with every egg...it's not like they were out of them...so disappointing not to have this healthy option.)  I got it anyway...it as very runny which is not how I like my eggs...salted too much, and the cheese it was cooked with had very little noticeable presence in the dish.\n\nI ordered a biscuit on the side. If a brunch place has a biscuit, being the biscuit fanatic, it's a mandatory order for me. I've had biscuits, literally all over the world...this was the first time I couldn't actually finish a biscuit. It was very heavy and tasted a bit like I was eating oil. When biscuits fail me, I begin to weep.\n\nColonie turns into a wine bar and they had an impressive looking cocktail menu. Had it not been first thing in the morning I would have loved to try the Watermelon Chili Margarita. (And back here in Los Angeles I'm salivating about the idea of this cocktail.)\n\nKudos for changing the menu up with the seasons. As of this writing, the scramble has changed on their menu. I'd give the place another shot for the evening menu and cocktails, but not offering egg whites or other healthy egg substitute as an option, plus the biscuit fail is a deal breaker for me in terms of lunch.\n\nP.S. They also had free copies of the New York Times which they offered to bring to the table. That's cool.", "author": "Rick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I live in the area and always have a fantastic time there. The staff is excellent and so is everything on the menu. I have tried almost everything on the menu and haven't had a bad experience. You must try the bass crudo.", "author": "Anne Laure S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Colonie", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "127 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vf3CvhiO2h8GCpdCe_CxvQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557500"}