{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 1.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "DO NOT USE THIS COMPANY!!!!!\nI purposely used a seldom used (if ever used) credit card for my order, because I'm a bit \"skittish\" of using credit cards with companies I don't know (don't have history with) ... AND ... I'm so glad I did!!!\nI checked THIS credit card, online, today - July 22, 2015.\nTHEY HAVE A SECURITY BREACH!!!!  \nTHIS CREDIT CARD HAS BEEN FRAUDULENTLY USED REPEATEDLY!!!  \n(Charges attempted were in excess of $150.00 \u0026 mounting!!!)\nI disputed EVERY fraudulent charge, ALL were removed from my credit card, AND I had to cancel the blasted card BECAUSE OF KOSHERLINE!!!!!\n\nSAVE YOURSELF A LOT OF HEADACHES!\nDO NOT USE THIS COMPANY!!!", "author": "Susan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I placed an order on September 12,2018, for a \"shiva fruit basket to be delivered to the \"shiva\" house.  The Kosherline order confirmation stated the basket would be shipped immediately.  When I called and spoke to the owner, on the following day, he assured me that the basket would be delivered in time.  The total time of delivery was seven days.  The UPS information was that the basket was left on the porch of the destination on Wednesday, September 19th at 4:30 PM. Aside from being a prevaricator of the truth, Mr Levy, is a poor example of a reliable person.\nThe individual and company are not worthy of a singular star .", "author": "Phillip B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "I ordered a gift basket for my in-laws. I never heard anything from them which was unusual so I called them. They did receive it but could not figure out whom sent it. The enclosed card said \"thank you for your janitorial services\"! This company mixed up the cards!!! When I called their answer was sorry but it does happen! I would never use them again.", "author": "Greta C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "Terrible customer service the owner is very rude and not fair at all. I had a basket delivered to my bosses house because his son passed away and they left it at the door and someone stole the basket and my boss never received the basket . Ups does allow signatures required but apparently the owner says they donot and completely lied to us making up a whole story about ups. With all the things going on in the world you would think that a basket $80 worth would need a signature required I will never shop there again I don't suggest anybody does", "author": "Elaina G."}], "servesCuisine": "Kosher", "priceRange": null, "name": "Kosherline", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "45 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9QNePiToXyz5RqOKpxVz6Q/ls.jpg", "@type": "Restaurant", "telephone": "+18885674378"}