{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Terrible Service \n\nOrder through online around 4:40. After 1 and a half hour when the delivery should be made, asked if the order is still available. The Guy who picked up the phone said He will check the order and give the callback. After half an hour, I received a text from seamless that the order was canceled. \n\nI wouldn't recommend to order from them, not worthy of trust.", "author": "Nathan Yongsoo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Amazing. Ah. Ma. Zing. The bento lunch box I had was so delicious I wanted to lick the box!\n\nI had the chicken lunch bento box which comes with a few pieces of grilled boneless chicken, two rice ball \"tacos\", chopped  fresh string beans as a side and a side of seaweed salad. Perfect portion, slammin' flavors and just so good.\n\nI love supporting local business and when the product is amazing I love supporting it even more! Excuse me while I go have another bento box...", "author": "Amber E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "This place is a FIND.  Delicious food, quick service.  Perfect lunch place for healthy but delish food.  Just wish they were open later than 6 (like 8pm even) because I would love to eat them for dinner but I dont get home in time.", "author": "Hector H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "This place is all white, simple and cute! Their matcha latte is a little bit expensive than other places but taste really good! Love their cute bento box and rice balls as well!", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "I was looking for a light healthy lunch and am so happy I found this place. It's minimalist and modern, with only two small tables with six seats total, so I decided to get it to-go. It's not the fastest service, but the Japanese ladies working there/owner were nice and you could tell the food was fresh, everything seems to be made in small batches. I came around 12:30 on a Tuesday and it wasn't crowded.\n\nThere is a limited menu so best if you aren't picky, but the bento box is a great deal at $10, with one protein, two small veggie sides that change daily, and two brown rice balls. I got the tofu, wakame salad, green beans, tuna onigiri (filling was a little sparse), and miso onigiri. Everything was tasty.\n\nIt doesn't look like there's a restroom there, but I didn't ask.", "author": "Priscilla H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "THIS RESTAURANT IS ABSOLUTELY INCREDIBLE!!!! My friend and I fell in love with their food over the past few summers in Dumbo (at their stand under the archway). \n\nWe've been wanting to try out their new location in Boerum Hill for quite some time and today we finally made it. As soon as we walked in, we were greeted by the kind and welcoming staff. It was clear that they recognized us from the summer, and the warm atmosphere of the restaurant immediately made us feel at home.\n\nThe restaurant itself is clean and intimate: a great setting for any occasion!!\n\nI'd definitely recommend the tuna mayo and the basic rice balls!! DELICOUS!! We were also delighted to learn that the drinks were amaaaaaziiiing!!\n\nRice and Miso, thank you soooo much for this experience!!!!", "author": "Avery O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Rice \u0026 miso is a spiritual experience. Clean, delicious food in a calming minimal interior. The bento box is the way to go - both chicken and tofu are amazing, and I usually wrap up one of the rice balls to snack on later. The only downside is that it's closed on Sunday, and for some reason I crave it EVERY Sunday! But yes, do try this place out, you won't regret it!", "author": "Marion C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Allow yourself the fantasy of being a schoolchild in Japan with a mom who packs you the most umami-rich, tasty, wholesome lunches you'd ever want. An every-day kind of place with just enough variety to never make you bored.", "author": "Eater O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Great addition to the neighborhood!  It's a nice place to get lunch or early dinner (closes on the early side for dinner).  The rice balls are great, I particularly like the grilled rice balls and the miso paste rice balls.  The miso soup is quite good but my favorite is probably the vegetable side dishes.  It reminds me of the Korean banchan I grew up with.  Everything is freshly made and the owner is extremely nice.  It's a cute shop with two or three tables.  Price is reasonable - cash only.", "author": "HanNa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Awesome! Beats Mitsuwa, quality of the ingredients and the flavors are all excellent.", "author": "Yusha H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "This place is close by to me so I decided to stop by for lunch. The place itself is very modern, small and quiet. The menu is limited but there was a good variation of meat/vegetarian options. \n\nI decided to go with the crispy tofu bento box which came with two rice balls and two veggie sides. \n\nWhen I got my box, everything looked very appetizing. But once the food entered my mouth did I decide to give this place three stars. \n\n-My tofu was FAR from crispy. As soon as I picked it up in my chopsticks the batter around it fell apart. The underside of the tofu felt wet. Not very appealing. \n\n-the sesame rice ball was good but nothing special. I was anticipating some sort of filling but it was just rice. I don't remember the name of the other ball I got but every other bite was very salty. \n\n-the sides I received were the mushroom/carrot mix which was the star of the box. Very good. My green beans were okay. Nothing special to say for those. By the way these side portions were very very tiny. \n\nAs this location is in the area, I may return and hopefully be able to update my review. But I doubt that will be anytime soon. I've heard/read good things about the miso soup. Will definitely try that once I return.", "author": "Marsha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "It's hard to find places in the City, that serves healthy foods, until I found this small place.\n\nRice balls with fresh ingredients, along with crispy tofu and homemade miso soup.\n\nNo MSG, Gluten Free.\n\nThe staff were nice and friendly.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "This place is so beautiful. I feel incredible when I eat their lunch. The place itself is tiny and can be an intimate experience with other customers- but it's also very quick for takeout.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I love this place!  Perfect spot to grab a quick lunch during the week.  The energy is serene and the rice balls are DELICIOUS.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Delicious tofu bento box for lunch in a quiet, calming atmosphere.  It is small but luckily it wasn't overrun so my friend and I were able to sit and eat and chat.  I will definitely go back.", "author": "Katy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "I wasn't very impressed by this place. Food was okay but certainly nothing to write home about. Chicken was gross, which caused me to just throw them out.", "author": "Craig C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "These ladies are great!  I've stopped in 2 or 3 times, for the bentos, the soup, and the matcha tea.  So nice and lovely service, delicious fresh food.  Very glad they are here, don't have to wait for Smorgasburg!  I hope they get other locations around BK. \n\nYou're probably not going to sit and linger here, but there's space to wait while your food is prepared or maybe while you gobble down your rice ball.  Very pleasant.  \n\nNothing wrong here. \n(except maybe, as far as I know... they are cash only. sad face for those of us who don't carry much cash. just be prepared.)", "author": "Jade H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "crisp, white interior serving homemade omigiri. they range from $3-5. i had the original filled with garlicky natto. it was delish. i'll be back for the bento box. those include 2 onigiri and a protein (tofu steak or chicken.) if you are are gluten free or vegan, a nice option in the nabe.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Delicious food. Get the beef.\n\nThe space itself is tiny-- I think it's meant to be more of a to-go place, but there are a few seats if you want to stay and eat.", "author": "Olive I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "I get Rice and Miso almost every Tuesday for lunch at their pop-up in West Elm in DUMBO and was so excited to hear they opened a location in Boerum Hill. I love their bento box with tofu, two brown rice balls (tuna is my favorite) and two vegetable sides.", "author": "Erin M."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Rice \u0026 Miso", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DaKozGDrIMAme3vJ5WeoCA/ls.jpg", "@type": "Restaurant", "telephone": "+19292793488"}