{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Amazing lunch bento box. Choice of proteins, two rice balls and two veggie sides. Amazing tasting food in a quaint, modern, clean space in downtown Brooklyn. So much umami, I can't wait to come back!", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "I found this cute little spot through yelp, and I'm glad I stopped by. \nThis is a small restaurant, it has a very modern and  minimalist style, which is great!\nThis place can get packed, people are coming and out. \nThe women working the front was patient and answered my questions.\nI ended up getting two tuna balls, which were pretty good.\nThey make everything to order, so be patient. \nI'll most likely come by again sometime in the summer to try some of the other items.", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "I would always pass by this shop hoping to get in for some lunch but it would always be packed. The space is not very big but I like it! \n\nOne rainy day I was able to get in and enjoy a meal without new mothers and their 4 year olds running around. \n\nI ordered a Bento Box with Lychee Lemonade and a Brown Rice Crispie Treat. (I'm a big kid lol) \n\nBento: I got the Salmon Teriyaki, Seaweed Salad, Sweet Potatoes and 2 onigiri. They also gave me a free soup! \n\nThe soup was okay a little bland but there are condiments such as soy sauce and sriracha. I didn't enjoy the veg in the soup. It felt as though the base of the soup was made and the veg was thrown in last minute. So the flavors didn't really meld well together. \n\nThe Salmon was very good; I can tell from the color and fat that is was very high quality wild caught fish! I devoured that within minutes. \n\nThe sides were also very tasty!! The onigiri were quite tasteless and the rice was a little underdone. In my experience onigiri rice is softer. But it may be because they use brown rice instead. \n\nThe lychee lemonade and the rice crispie treat were also very good. \n\nStaff were very kind, quick and efficient. \n\nOverall I had a great experience but probably wouldn't come back because while I am into health food, I don't think taste and flavor should have to be comprised at all.", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "These little suckers are hard to eat without having the rice splot all over so make sure you have some napkins around. \n\nWe tried the chicken bento box and was surprised at how tender and flavorful the kogi was! Probably the best deal of the menu-it comes with two rice balls, two sides and the main protein. \n\nA great little onigiri (rice ball) and bento spot with lunch portioned meals. Healthy and fresh!\n\nIt was oddly packed at 3:30, right before closing, on a Saturday and there is limited seating (about 10 spots) so considering getting takeout.", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Bit pricey but worthy rice balls. We stopped in for an afternoon/pre-dinner snack and tried the tuna rice ball (comes with mayo) and the beef (ground beef on the salty side with the marinate) and vegetable soup. \n\nSoup was definitely the highlighter with ample tofu pieces and large chunks of vegetables with a flavorful soup base $9 for 1 rice ball + soup. $6 for additional rice ball.\n\nI preferred the tuna rice ball since the flavors balanced better. Rice was just the right texture without being too sticky or chewy (better than other rice ball places in the city) and is a good hearty portion for a snack.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "If you are looking for a clean, tasty Japanese lunch in a bright, unadorned space, you've come to the right spot. I feel like I could eat Rice \u0026 Miso's simple fare every day and be a healthy man.*\n\nThey specialize in onigiri, and these brown rice balls flavored with tuna and mayo, or grassfed beef, or the original scallion miso paste will hit that spot if you have a craving. All are well constructed and served inside a sheet of nori, almost like a taco. I like to add a few sprays of tamari soy, but you do you.\n\nPersonally, if I want a $4 snack in the hood I'm more of an actual taco (or empanada guy), so I prefer the more balanced meal and better value of the bento boxes.**\n\nThe chicken option (tofu is the other choice that I've never made) comes with two onigiri, two osozai, excellent miso soup, and a few small pieces of shio koji marinated chicken. There's a hint of lemon, and they are perfectly tender and hugely flavorful, especially with the red yuzu kosho*** that offers a nice splash of color and spice.\n\nThe osozai (sides) are what make the meal, though. Every one of these little salads has hit the spot so far. The gomaae, the curried cauliflower, the squash...get something fermented and you're going to like it. \n\nTo be clear: this is everyday food. It may not blow you away, but it certainly feels like I'm taking care of my mind and body when I sit in Rice \u0026 Miso's minimalist space, listening to jazz and eating some fairly healthy fare.\n_____________\n\n*I must say though, I often eat out because I can get food cooked with more butter and salt than I have the stones to make at home. This is not that place. \n**If there's one thing I don't love about this little shop, it's the very odd decision not to serve the bento boxes until 12 noon. You open at 11:30 am and there are like five things on the menu. Why not serve them all when you open, instead of waiting a half hour? Or just open at noon with the full menu?\n***The owner of Rice \u0026 Miso tells me that this sauce is often green, but they prefer red because of the color contrast. I just know it tastes delicious.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Cute little japaness rice ball place in Boerum hill.\n\nVery bright and clean interior design all in white. I ordered beef rice ball and tuna mayo rice ball. I believe they are brown rice cuz I tasted the kernel. It's healthier comparing to all the refined rice options. Meat and sauce and the rice are perfectly blended.\n\n4-5 bucks per rice ball. 2 should be sufficient for lunch for average girls and 3+ for guys.\n\nGood option for a quick and healthy lunch!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "Love the Rice Balls and soup from here. The Rice Balls are always well cooked with the meat to rice portions great for me.The Plain Rice Ball is very flavorful even though it has no meat. The staff are very friendly and kind.I went there once and every time since they greet me by name. ( I usually go once a week. My picky daughter loves it as an afternoon snack).", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "A clean, minimalistic restaurant that makes amazing food ?!? I tried the original rice ball and a matcha latte with soy milk ( they don't add sugar !!) and really enjoyed both items ! The crisp interior really sold this spot for me, however. Although there is limited seating, this restaurant is on a side street in downtown Brooklyn. \n\nThe rice ball was sticky and the paste was salty and flavorful. I only got one, but felt like two would be more satisfying or getting the bento box (which comes with two rice balls, a protein, and some sides) -- I am definitely trying this next time I come !\n\nI can see myself returning quite often in the summer to enjoy the iced latte and a healthy and filling meal !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I absolutely loved this place, and it deserves 5 stars across the board. From the setting to the food, everything was perfect. The business put a lot of efforts into details, and it really shows. We got a set of onigiris which were top notch. In particular, I enjoyed the original because of its rich flavor. On top of that, I tried out the chicken bento which was delicious. The chicken is seasoned so nicely, not too oily, but not too bland. Along with the sides that one's able to pick, everything turned out great. My favorite thing about the place itself is the design. There's so much natural light, and it complements the minimalist interior so well. I will definitely be coming back and highly recommend it if you're missing an authentic Japanese lunch experience!", "author": "Rob C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Excellent tuna and mayo rice ball. You could taste how fresh the ingredients were. $4 for a rice ball but that's this area for you. Tiny shop with 3 tables so would recommend pickup if you have a large group.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I love this place.  Look forward to visiting every time I'm in the area.  The food is fresh, healthy, and delicious.  Sitting inside the cafe is a super-zen experience.  Just wish the serving sizes were larger so I could stuff my face with more of the goodness.", "author": "Deb C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Sooooo cool. \n\nWas just riding my bike by here \u0026 noticed it. Obviously I had to stop in!\n\nToday they've been open just one week. Such a cute little space with geometric stools! I love it\n\nWhat's more the menu is really great. It's full of healthy lunch options.\n\nI tried the original rice ball. It looks like a traditional japanese rice ball, kind of triangular in shape, with a dollop of miso Paste on top. What's more they used brown rice! Wow :)\n\nAlso had a bowl of miso soup which had kelp \u0026 mushroom. A nice departure from the typical wakame miso. \n\nThis spot is really home cooked. In fact mom *is* the cook! Explains why it's so tasty. \n\nIf you like japanese or snacky lunch stuff you'll really love this place. Great addition to the neighborhood !", "author": "Sean S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "One of my favorite spots and my toddler agrees, great flavorful food that is light and refreshing and totally satisfying. I van not say enough good things about this place", "author": "Joshua Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Well this turned out to be my favorite discovery of 2018 so far. The only places I've been able to find rice balls in so far have been in Dumbo under the archway (these guys!) and occasionally at places like Smorgasburg. Finally there's a brick and mortar rice ball restaurant! They have bento boxes with other stuff too. And it's a block from my kid's school so I'll definitely be coming by on the reg. Not only are their rice balls delicious (my fave was the tuna and mayo) but the soups are fantastic too. The simplicity and small size of the restaurant makes it even more appealing.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "Small cozy hidden Japanese fusion gem in Boerum hills. A great place for a quick lunch. Had the chicken bento box and the chicken was properly cooked and marinated. The sides were flavorful, colorful and yummy. They also had good variety of green teas. Will definitely go back.", "author": "Zary H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "So let me get this straight. If I wanna rub someone out, I should just ply them with the Onigiri from here, made exclusively with brown rice, on the regular?  Looks like this could be a potential case for Hercule Poirot.  But seriously, am just piggybacking on fellow Yelper, Chiko T.'s concern about reports that brown rice, in particular, is rife with arsenic.  Call me reckless, but I just waltzed in here with hubby, joy killing experts who like to suck the fun out of everything, be damned: \n\nAnyway, this small spot embodies the phrase, \"Japanese minimalism.\"  If you're into stark and pristine, you'll love it.  I'm more into warm and fuzzy, so I didn't feel especially compelled to linger.  Probably just as well since like virtually everyplace I'm drawn to these days, there wasn't a whole lot of seating.  So we got a couple Onigiri aka Rice Balls to-go.\n\nLOVED that the rice was warm and that its nori wrapping was easy to bite through.  The Tuna Mayo filling that I'd settled on is described on the menu as featuring 'cooked Tuna,' but per my admittedly foggy recollection, it didn't taste much different than a very simple canned Tuna Salad.  Hubby was underwhelmed as well by his Grass-Fed Beef pick.  Both fillings were also pretty skimpy so they didn't make much of an impact one way or another.  \n\nFor $4 a pop, these Rice Balls were smaller than I'm used to (no comments from the Peanut Gallery, please).  This being said, since Rice \u0026 Miso touts the use of mostly organic, non-GMO ingredients I'm good with paying more for less if you will.  Or am I paying more for more?  I just wish I'd liked my Onigiri pick more enthusiastically.  \n\nBottom line:  While I wouldn't call this place destination-worthy, I'd stop in again to give it another shot next time I'm in the area.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "What a neighborhood gem. Opening the front door, I felt like I walked into a modern gallery. It looked pristine - white decorative bench pieces, white counter, gray photos along the wall. They were probably going for the simple yet elegant Japanese style, and it works. Because the food they serve (organic onigiri, miso soup, and bento boxes) taste just as clean as it looks. \n\nService: 5/5 - two smiling ladies making my bento box. What's not to like? \n\nFood: 5/5 - I got the chicken bento box with miso soup. It comes with 2 onirigis, chicken, and 2 sides. They use brown rice in the onirigi. I chose the original and the beef. The original comes with a side of flavorful red garlic natto paste. Didn't think I would like the natto paste so much but it works well with the seaweed and sticky brown rice. The chicken was also extremely flavorful and just the right amount. I would get it again. \n\nCleanliness: 5/5 - looked pristine\n\nAmbiance: 4/5 - tiny store that would normally qualify as \"hole in the wall\" size, except the simple interior design rings modern elegance \n\nPrice: 4/5 - price on par with other New York stores \n\nEnvironmentally conscience 5/5 - everything they used, from the take out box to the fork and wrappers, was biodegradable", "author": "Tracey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Such delicious and very healthy options. If you are in the neighborhood, you must try. The staff is always super helpful and friendly as well.", "author": "Reina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Satisfied!! it is little pricey. But they are very freshly made and the ingredients are organic and healthy.", "author": "Jinhee H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Rice \u0026 Miso", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DaKozGDrIMAme3vJ5WeoCA/ls.jpg", "@type": "Restaurant", "telephone": "+19292793488"}