{"aggregateRating": {"reviewCount": 53, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This was a fantastic find for something clean and simple, but absolutely yummy to devour every last bite.  I did the bento box with a pick of two onigiri (original and beef),  two sides, and miso soup.", "author": "Wally C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Great, simple menu, quality ingredients, very fresh/light and I appreciate the vegetarian options \u0026 veggie side dishes.  A nice departure from the more common (and often mediocre) sushi and noodle-centric japanese options for lunch or a quick snack.  Definitely going back.  Also, it seems like they may experiment/try out adding japanese baked goods/pastries or other offerings in the future.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "So happy this place opened up in the neighborhood. Better than my mom makes - eek! I rarely choose brown rice for my onigiri, but I am loving their onigiri (all brown rice, no white option). Everything I've tried has been excellent...tofu steak, miso soup, hijiki, green bean goma-ae (perfectly cooked), wakame cucumber salad. And my two small kids have been gobbling it up as well. A great place for a healthy, delicious meal or snack.", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "I only tried the rice balls with spicy tuna. It was yummy definitely want to stop by and try the bento box some time", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "This is such a nice addition to the neighborhood. Tofu or chicken bento box, rice balls and osozai in a beautifully designed, skylight-lit storefront.", "author": "Andrei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Clean, bright space with thoughtfully prepared little Japanese snacks. Delicious matcha lattes.", "author": "Feather A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Serene space, super polite staff, beautiful counter, and completely delicious food.  I had the bento box with tofu steak, 2 vegetable sides, and 2 rice balls.  Everything was delicious, and the rice balls are made to order - so the toasted nori that wraps the rice ball is still crispy when you eat it.  Lovely.  Everything - the vegetables, the tofu, the rice - was fresh and just right.  I particularly recommend the Original rice ball, very flavorful.  But everything was very good.", "author": "Christian H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "It's a nice place and food is good. The only thing for me is that they don't have an option for white rice. I love onigiri and I consider onigiri as something that shows the quality of rice. I understand many people think brown rice is healthier than white rice but brown rice is reported to have more arsenic (http://www.consumerreports.org/cro/magazine/2015/01/how-much-arsenic-is-in-your-rice/index.htm), so some actually think white rice is better from this perspective. Anyway, healthy or not healthy, I think their onigiri would taste a lot better if they used good white rice.", "author": "Cat T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "This place is such a great addition to the neighborhood. The food is yummy, fresh and offered at a good price. I also love the simplicity of  as well. I think this will be my go-to lunch spot.", "author": "Ral S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "The food was good. It didn't blow me away but I really liked the originality. I'll be coming back to try other things and update my review. I highly recommend giving this place a try!", "author": "Isabelle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Went by today for the first time for lunch. Had a bento box lunch with chicken, two lovely side salads, and two brown rice balls (tuna and beef). Perfect little lunch. Took the food to go because there are only 4 stools inside and they were taken. Cash only for now.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "I don't write many reviews, but I am making a point to write one because I want this place to make it.  I happened to notice it walking by.  It's small and easy to miss.  Definitely a take out place, but the storefront is nice and clean looking.  Their menu is pretty small, comprised mostly of $10-$14 bento boxes, $3-$5 rice balls, and miso.  I got a chicken bento box; it came with 2 rice balls and 2 vegetables.  Everything was terrific.  I highly recommend it!", "author": "Nicholas M."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Rice \u0026 Miso", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DaKozGDrIMAme3vJ5WeoCA/ls.jpg", "@type": "Restaurant", "telephone": "+19292793488"}