{"aggregateRating": {"reviewCount": 37, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "Had the duck poutine fries at Smorgs in Brooklyn. The fries were seasoned well, but there weren't too many pieces of cheese to go on top. Nice pieces of meat did help the fries overall taste but in my opinion it wasn't anything spectacular.", "author": "Nick D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-16", "description": "This review is for the Duck Season at Bryant Park. Customer Service and Food were terrible. I ordered the classic with fries ($15). The cashier only rang up regular fries ($11) and then wanted to charge me another $11 to add on the burger, which was my original order. I told her absolutely not, as I ordered the burger with my original order. She finally fixed it and added the burger to the order but still overcharged me. Then, my fries came out before my burger order and instead of trying to remedy the situation I overheard the guy behind the counter telling the cook to serve another couple ahead of me as my fries (it was sleeting and cold) got cold. I wish I would've just gotten a refund when my order was messed up. The burger was horrible! Two out of the four bites had so much gristle I literally spit it out! I never post reviews, but this one was so overpriced and terrible I hate for someone else to waste their money! I'm not even sure this place deserves one star. If I were you, Id try the Mac n cheese from the BBQ place inside Bryant Park! Well worth the money!", "author": "Rachael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "They had me at 2 Duck confit for $13!! (end of the season special T^T) It was exactly the way duck confit should be. A thick amazingly delicious layer of fat + perfect amount of salt fried to crispy perfection.", "author": "Enya L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "Duck confit over french fries lacked flavor and was bad. The shredded duck meat had a weird dry texture, almost like it was fried, then shredded. The fries were both burnt and soggy.  I love duck and potatoes in all forms, so this was disappointing!", "author": "Professional N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "i didnt know how much i liked duck. ive come across it a few times in my life but when i tried the duck confit from these guys..... i realized that there was something that i didnt know about myself. i love duck. specifically duck from \"Duck Season\" i went back and decided to try their duck fries.... it confirmed what the duck confit was telling me. it should always be Duck Season. knowledgeable chefs were kind in serving me and made me feel okay about my initial ignorance.", "author": "Stefan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Great place to get your duck meat craving satisfied. Definitely recommend the poutine and DLT", "author": "Edward M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Every item on the menu is perfection! Each bite of the duck sliders was better than the one before. The potatoes were perfectly roasted and had excellent taste. Their cherry lime soda is also delicious - coming from someone who doesn't like soda or cherry flavoring. \n\nIf you're at Smorgasburg you MUST try this place, you won't be disappointed.", "author": "Andie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-08", "description": "I decided to try something new when I passed by Duck Season.  Just looking for a snack I asked for the Duck rinds. At $6 you get a decent amount of them but unfortunately they just weren't that great.  I'm not sure if they are supposed to be like this but they just tasted kind of burned and didn't have any of the richness that I would associate with rinds I've had in the past.  There were one or two pieces included that were a touch thicker where I could see what the intended flavor was. Those were good but on a whole they just kinda left a bad taste in my mouth. \n\nMaybe I just went at the wrong time and I should've tried something else.  They seemed pretty popular so I might still give it another try.", "author": "Alex K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "If they had given us a giant bucket of those duck rinds, We'd have kept eating until I reached the bottom. Or passed out. Either way, it would have been fine.  The entire idea is genius and they were absolutely delicious.  The duck fat fries were tasty too and came out hot and fresh.  The duck reduction sauce for dipping could have been a bit thicker, but it was tasty all the same.  \n\nAlso, their cherry lime soda is really delicious.  I love lime rickeys, but that soda actually won over someone who doesn't like cherry OR lime and that's a difficult thing to do. \n\nI'd gladly make the trip out to Brooklyn just to eat at this place. It's wonderful.", "author": "Avril K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Today, I had the pleasure of trying their sliders, fat potatoes, and duck confit (duck leg) and am so glad I stopped by. \n\nThe sliders (my favorite) are perfectly balanced- crispy seemingly pulled duck, with a refreshing slaw and a light Asian tasting dressing on a delicious brioche bun. The duck confit (duck leg) meat was so tender it was falling off the bone and its skin was super crispy but delicate and easy to bite through- no unnecessary batter to waste my time. Straight to the point, awesome duck meat served with a yummy preserve (apricot maybe) and an awesome carmelized onion compote type dip. \n\nThe fat potatoes were delectable too. \n\nCan't wait to return and support these friendly guys who are bringing duck back in style!", "author": "Missy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "A bit of fun with a load of deep fried duck dishes. What ever kind of duck you can think of they will fry it up. The confit duck leg was good, well seasoned and juicy. The duck rinds were tasty on the first bite but were also very oily so you will struggle to eat more than one. All in all a fresh new addition to the street food scene.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Wow, this place is amazing. I visited their food stand today in the Columbus Circle Urban Space Holiday shops. The duck was tender, flavorful and cooked to perfection. The duck rinds were super tasty. The service itself was excellent. I found the staff to be friendly and attentive. They go above and beyond to make great food and satisfy their customers. Don't skip out on this place. Duck also has a high nutritional value, so I'm glad I tried something different. 5 stars and three thumbs up!", "author": "Mizzy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Duck Season's stand at Smorgasburg is bangin'! I was a little hesitant to try duck for the first time but it was awesome. Duck confit, duck rinds, sliders, they got it all. Not to mention the fat potatoes. Really can't go wrong here.", "author": "Stacey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "This place rocks ! Every item on the menu is full with flavor , from the sliders to the rinds . Safe to say that I am a duck fan now thanks to duck season . The Service was a A+ to top it off .", "author": "Sean V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "The crispy duck confit is a must try, crispy, full of flavor even without the dipping sauce.  Season (duck) sliders are good as well.", "author": "Maki S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "I'm not sure if I caught them at a wrong time but their \"The Season\" sandwich ($12) was not good at all. I expected the bun to be warm \u0026 buttery but it was cold and very dry. Also, the shredded duck meat only added to the dryness. The purple cabbage slaw on top was refreshing but this whole slider was just a giant disappointment.", "author": "Aggie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "The Season Fries were definitely overpriced for $10.00, but still a nice treat option with the smallest line in the area.", "author": "George C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Duck Season", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nAjgWX67hGrqiW3mzs4IIQ/ls.jpg", "@type": "Restaurant", "telephone": "+19175657183"}