{"aggregateRating": {"reviewCount": 37, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "I love this place. Very good food and you get a good amount for what you will pay. The best item to get from this eatery is the duck fries. Extremely tasty and very good fries in general. These fries have a taste that cant be beat. \n\nHighly recommend going here and must order the duck fries. Delicious!", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-05", "description": "This review is for the Bryant Park location. I didn't see a that location on yelp nor on google. I can always change the review once one is created. \n\nI stopped in to have the duck bacon cheeseburger and side order a fries. With a Diet Coke that set me back $19. They didn't ask how to cook the burger and that's my fault for not being specific. Little too red for me. \n\nFor the longest time I couldn't get down the taste of the bacon until it hit me. It had a pastrami taste but was under cooked. Removing the bacon, the burger still had a lot of flavor. The fries were nice and crispy. \n\nLastly, your employees are friendly however, they have to know their audience. During small talk, profanity can't be included since there are a ton of families with small children around. Also, eating in the cooking space is not recommend, even when you're wearing gloves. Few occasion my cook was handling French fries to mouth and preparing my burger at the same time. Eventually, he switched to a utensil. Remember, you're not inside of an enclosed kitchen. People can see everything you do. \n\nPros: Tasty, Good Fries\nCons: Price, Food Preparation\n\n\"My review is strictly my opinion based on my experience and interaction with the business and/or persons while they provided me a service, food, or merchandise. This review is not to be translated as fact. My review is truthful to the best of my ability and is not intended to present harm to the business but to encourage them to perform better or allow them to continue being awesome. I have not received any monetary gain for writing this review\" - Bruno F", "author": "Bruno F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "AMAZING FRIES! everything else looked and smelled amazing too. \n\nThe duck gravy was really good but honestly the duck fat mayo was out of this world. The people I was with, who usually hate mayo, loved the duck mayo. The seasoning was awesome.", "author": "Carolina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-10", "description": "Tried Duck Season at Bryant Park Holiday Shops (it's actually at The Lodge).  A bit of a pricey option, but one of the more creative eats at The Lodge.\n\nHad the Brooklyn Poutine, which is a poutine with cheese sauce, duck gravy, and duck bacon.  At $14, it's a bit pricey, but it was a large serving and tasted pretty good.  The duck bacon was an interesting flavor.  I wish it was a bit more smokey or that they had put it on the griddle to get some color on it, but it was decent the way it was.  Instead of the cheese sauce, I would have preferred normal cheese curds.  The duck gravy, however, was the star that brought the dish together.  The fries were fried in duck fat and were delicious.  It was a very heavy side dish, but I expected that going in.  I do wish they had put something acidic on top to balance it out a bit.  Some pickled onions or something would have gone a long way.\n\nAlso had the Season Sandwich, which is a duck confit sandwich.  Didn't really like the brioche bun as it ate a bit dry.  The duck confit seemed a bit dry as well, so the whole sandwich just felt dry.  There definitely was not enough sauce.  Here, though, I appreciated the addition of crispy fried onions as well as a pickled onion.  That added a whole other dimension to the burger.  For $14, I don't think I'd order this again.\n\nI'm glad I tried this place and the food was okay, but I'm not sure I'd return.  It didn't really wow me.  Should have had a Chimney Cake at The Stackery instead.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "Once you have had poutine from Canada, nothing else will do, it seems.\n\nEven for a place that boasts a menu of delicious duck items. I got a Montreal poutine and now I know better. The portion was huge, but it was unfortunately quite underwhelming. Fries were dry and hard. They tasted like they had been through the fryer twice, or maybe 3 or 4 times. Also were salted to high heaven. Which made it nearly impossible to taste the bland watery gravy, which was completely undiscernible on the fries, save for the puddle at the bottom. Cheese curds were not squeaky, but I'll let that one go, since none of the poutines I've had in NY ever got that part right.\n\nI'll give them the benefit of the doubt that maybe the duck items are the way to go here, but it's a hard pass on the \"Montreal poutine\".", "author": "Steph C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "*****Review for Madison Square Eats*****\nDuck is one of my favorite foods, so when I saw an entire stall dedicated to this delicious protein I knew that I had to try it.  I will be honest with you though, this place just did  not live up to my expectations.\n\nI ordered the duck poutine, and the most disappointing part of it was by far the french fries.  They were not crispy, and very under seasoned.  Given that this thing was topped with cheese sauce and small pieces of duck, it needed crispy fries to hold up to the toppings, because it was basically soggy before the cheese was put on top.  The cheese sauce was delicious though, perfectly creamy and perfect with the little pieces of duck that.  Give me the toppings and take away the fries, then I'd be happy.\n\nLook for dishes that don't include fires, and you'll be better off becuase the duck is delicious.", "author": "Joshua K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Oh my gosh yummmmmm! My friends and I were touring around Bryant Park Holiday market and Duck Season had a pop-up shop. I already knew that I liked duck so this seemed like a great place for me to try. I got the burger and duck fries and it was soooo good. I am the kind of person if I have the option to add cheese to something I will, so I added cheese to the burger and it was the best decision I made all day. I wish I would have added it to the fries as well (worst decision I made all day)! The cheese was oooey, goooey, drippy, and delicious. The fries are tasty as well and have a unique taste after being fried in the duck fat (don't worry it tastes a lot better than it sounds). I am so glad I had the opportunity to eat here and highly recommend it.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "Hey yo. \n\nAhh, it's Smorgasburg season at Prospect Park again! I decided to head to Brooklyn on a relatively warm Sunday afternoon. I passed by Duck Season, which seems to have quite the niche with... duck! As a duck lover, I couldn't help but try some food here.\n\nChomped:\nThe Season Sandwich\n\nThe stand seemed quite popular, which was evidenced by the long lines. After lining up with high expectations, I ordered The Season. Firstly, I was put off by the duck rinds, which had feathers visibly showing! These rinds felt like they were sitting in the fryer 15 minutes too long. Secondly, the duck confit wasn't bad, but I felt like I ate a quart of oil after all was said and done. I subsequently ran 9.5 miles home to burn off all that fat. JK. I guess people came here more for the poutine. I love the concept, but the execution left something to be desired.", "author": "Jerry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-13", "description": "My husband and I shared the Montreal Poutine at their Bryant Park pop up. Being Canadian, I'm a tough sell on Poutine. I was actually quite happy with this one. The fries were nice and the gravy was super flavourful and plentiful. My only criticism would be that the curds could have been a touch smaller.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "Had the duck confit fries at the holiday market in Bryant Park. So satisfying after a couple cold hours ice skating! The flavors got a little monotonous by the bottom of the plate, but that's probably more a testament to the massive portion sizes than anything else. Such tender duck and such perfectly crispy fries!!", "author": "Amanda Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "I visited the Duck Season stand in the Bryant Park holiday market.  I was in the mood for fries and these were excellent.  The fries were perfectly cooked and the duck fat adds a bit of a smoky flavor.  The duck fat mayo was also tasty and they use the correct kind of ketchup (Heinz).  My only beef is that you have to pay $1 for two sauces, so in order to have both mayo and ketchup, you have to pay extra.", "author": "Carrie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "I was craving good fries for few days and this place popped out of nowhere so there was no way but to stop by. I got the Brooklyn (fries with duck bacon, cheese, and gravy) and it tasted great! Fries were thin, which was just the way I like it. I thought $13 was pretty steep for fries but I understood after I saw how big the portion was. Definitely share a portion with a friend or two, because it's way too big for one to finish.", "author": "Ami Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "Duck season had a fairly long line at the new Smorgasburg on Canal. We decided to give it a try. $12 for the Brooklyn poutine (duck bacon with sauce over fries). \n\nThey forgot our order, or gave it away to someone else, I don't know. We were waiting ~15 minutes until a man (who I think was the manager) noticed and told the staff to get our order ready. They forgot AGAIN. After watching everyone get their orders in a matter of minutes/seconds, we mentioned that we had been waiting for an unreasonably long time. We quickly got our food. \n\nIt was just okay. Glorified French fries at the end of the day. I'll skip it next time I visit Smorgasburg", "author": "Fallon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "FOOD | My friend and I ordered the Brooklyn Poutine. The fries were well seasoned and flavorful. I think they could've used a little more cheese though. My first time having duck!\n\nSERVICE | Friendly and fast for the amount of people that were falling in line every few minutes.\n\nSPACE \u0026 AMBIANCE | Located at Smorgasburg in Prospect Park. Lively and friendly- lots of people and other vendors around. If you want to sit down instead of walking and eating, you can find a spot on a nearby grassy area.", "author": "Tina M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "Bryant Park location: tried the cheese fries and disappointed overall. Positives: quick service, not even 5 minutes. Fries were well cooked and crispy. Negatives: cheese was very bland. So little flavor. Not sure what kind of cheese it was, wouldve preferred cheddar or mexican queso. Its $10 which I was fine with paying if I recieved gourmet fries, which is what they make it sound like. Other menu items may be good, but I wouldn't order the cheese fries.", "author": "Omaida H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "This review is specific to the season sandwich at smorgas square. The two main takeaways here are 1) it's pricy at $13, and 2) it's excellent. \n\nThe sandwich was served up super quickly, on a warm and toasted brioche bun, with a healthy portion of shredded confit duck, with cold slaw and sole fried duck skin, and a sauce on top. It's a totally harmonious blend of textures with the soft duck confit, the freshness of the cole slaw, and the indulgence of the fried skin. It's everything you want in a high end sandwich. \n\nIf you find yourself at Smorgas Square, get this. You won't be disappointed.", "author": "Dave F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "0/10 would not recommend the triple fat duck fries. \n\nI went to the Duck Season stand in Columbus Circle after seeing a picture on their facebook of the triple fat duck fries with aged cheddar sauce, smoked duck fat mayo, crispy duck skins, and duck demi glace. This thing is absolutely disgusting. The crispy duck skins literally taste like the deep fryer--they have no other flavor expect for the smokey flavor of a vat of week-old deep fry oil. I literally could not eat it--and I usually love crispy duck skin. Also, the sauces are all dumped on top of the fries, and the duck demi glace is liquidy, not viscous, so after 5min, the fries on the bottom get soggy. \n\nIf you get anything here, I would not recommend the triple fat duck fries--just go regular fries, or get the sauces on the side. Or go try their sandwich instead. Originally, I was going to come back another day to try the sandwich, but after having the flavorless triple fat duck fries, I don't think I'll ever come back there. I should have just gone across to Baked Cheese Haus and gotten myself a nice raclette sandwich.", "author": "V F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Yummy! I ordered the Brooklyn Poutine which isn't traditional poutine but it was still very good. Duck bacon, fries, and cheese sauce!  It took about 5 or 10 minutes to be acknowledged which was a bit annoying, but it was busy and the girl at the front apologized and was sweet about it, so que sera sera. They had a lot of different delish looking options and I'm a big duck fan, so this place really hit the spot for me!  I did knock off a star because my fries were lukewarm, but other than that I would definitely come back here.", "author": "Krissy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Grabbed a DLT which was sliced crispy duck breast on a delicious brioche roll, crisp lettuce, beefsteak tomato and a delicious mayo. The duck was perfectly cooked and was crisp enough without being to dry. \n\nOut of all the stalls we tried this was by far our favorite. Everything on the menu looked appealing, particularly the confit and the duck fat fries poutine.\n\nPrices were good considering it's duck. They also made a nice lime/cherry rickey.", "author": "Greg T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Found their tent at Smorgusburg in Prospect Park. Got the duck poutine, which was very good after a significant wait post ordering. The fries were superb: dark, crispy, and duck fat fried I believe. The chunks of duck were a bit like cubic morsels. Flavors were excellent all around and the portion was huge.", "author": "GT W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Duck Season", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nAjgWX67hGrqiW3mzs4IIQ/ls.jpg", "@type": "Restaurant", "telephone": "+19175657183"}