{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "I know you haters are gonna hate on this place., but I LOVE THEIR CHEESECAKES.\n\nThey have the best desserts. They even have a great low-carb cheesecake too.\n\nDon't doubt it, just go and try. It's an institution for a reason. Every time I go to NYC (which is often) I make a pilgrimage to my cheesecake mecca and it's worth it.\n\nHaven't found a better cheesecake except.... maybe... that one bakery across from Carnegie deli...\n\nEven the Time Square Junior's (while lacking ambience) is still delicious. The Junior's at Grand Central is the most quiet  of the franchise.", "author": "Debbie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "CHEESECAKE! CHEESECAKE! CHEESECAKE!\nIf you can't tell from my excitement this review is for the cheesecake only.\nMy sister lives in Brooklyn and I literally ask for a slice of cheesecake from Juniors every year for Christmas.\nSad?\nNo.\nNo, it is not sad, because this cheesecake is one of the best cheesecakes I've ever put in my mouth.\nI actually got the opportunity to come to Juniors while visiting my sister at LIU, so to me it was like meeting a celebrity for the first time. I almost wanted to ask for a tour of the kitchen.\nDon't judge me.\nThis is where all the magic happens, the restaurant is HUGE and their menu looks quite extensive and delicious but I came here for one thing, and one thing only.\nThe cheesecake.\nI usually opt for the chocolate mousse cheesecake for my Christmas present and I decided to switch it up with it being Fall and all for a slice of the apple crumb cheesecake.\nIt was creamy, sweet, tangy, and delicious.\nEverything a cheesecake should be.\nI heart you Juniors.", "author": "Kristin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "This is one of my Fav placed to dine. Although their lunch specials and dinner options are quite tasty... I really enjoy their breakfast menu. The coffee is always fresh and the best corn beef I've ever tasted. (And I'm not even a fan of corn beef lol!). The cheesecake is absolutely no ridiculous! No cheesecake could hold a candle to a Junior's Cheesecake! And I highly recommend the Raspberry Swirl! #CompleteDeliciousness", "author": "Kay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "I heard about the cheesecake and am now a believer how good it is.. I bought a small, strawberry topped one for my parents as a gift.  It was so rich and creamy with the sweetness of the strawberries - perfection!  They considered moving to NYC from Ohio because it was that good (not really, but they said it the entire time they ate).  It was the best I've found and will head back in the near future.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "Defiantly the strawberry cheesecake.  The best I ever had... but not so cheap. .7$ for a normal size pice. ..", "author": "Amit T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "We did not eat here only take out for some Yummy Cheesecake- \nThey have a variety of cheesecakes and pastries here- also your typical diner food served- \n\nIf you like cheesecake try this place, they've been around for a long time, they also ship them out.  We purchased about 6 different slices, ALL very good!", "author": "Rpm R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "Unfortunately since I'm out in California, visiting Junior's in person isn't an option. Anyways, for the past couple of years, my lovely lady has ordered a cheesecake for me for the past couple of years for Thanksgiving or Christmas. \n\nEach time I have gotten one, it is hands down the best cheesecake I have ever had. I have read some of the reviews saying that Junior's is the 2nd or 3rd best they've had. With that said, I can't wait to get out there to try out the various cheesecakes myself.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "Junior's is the reason I started to eat cheesecake in the first place. \n\nI remember when my mother used to start buying it, and I would not pay no attention to it, because I never ate cheesecake before. Until one day she had some of it in the refrigerator and I decided to go ahead and try it. I'm glad I did..I wasn't hook at first bite, but after my second and third bites, I was hooked. My one and only favorite for right now is the Strawberry Shortcake Cheesecake.\n\nNow when she buys it I'm happy..and when she doesn't I'm just upset and mad. It's my semi-drug. \n\nI recommend trying Junior's out...TODAY!", "author": "Tyrik G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "Five stars for the cheesecake; three and a half stars for everything else.  My history with Juniors goes back to my childhood fifty-some years ago, so believe it or not, it's rather hard for me to write this review, because my memories of the place keep getting in the way of its reality now.  Way back, it was a GREAT restaurant; I miss the pickled relishes that were standard on the table.  But that was then...now, it's merely good.\n\nPortions are still ridiculously large, and most of the food is good, but not fantastic.  Chances are you'll find something you like on the menu.  Not a lot of very healthy choices so don't expect that.  They still do a very solid burger with very good battered (not crumbed) onion rings, but since their glory years, many places have sprung up with fantastic burgers, so Juniors is no longer special that way.\n\nBut the cheesecake...I'm happy to say it's still every bit as good as it was back in the 1950s and 60s.  Really, that's the reason to go here.  My recommendation is to get the plain: everything else is unnecessary, and I find the strawberry variety downright annoying: HUGE WHOLE strawberries on top, and the whole thing drenched in over-sweet, artificial-tasting strawberry syrup: overkill, difficult to eat - forget it.  Get a plain slice and ENJOY!", "author": "marie m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "So I've always wanted a slice of NY Cheesecake from NY.  Juniors, is great. I had the strawberry cheesecake.  Two thumbs up!  Thick, smooth, and flavorful.", "author": "Kesha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "Of course since I was visiting New York, I HAD to go get a cheesecake from juniors. Ever since I saw juniors in Foxy Brown's video \"BK Anthem\" I just knew I had to get a slice. I was staying with friends in Park Slope Brooklyn for the weekend, and at the end of my stay we went over to Juniors for a Cheesecake. We were already so full because we had an adventure that involved eating suitcases of White Castle Burger (think Harold and Kumar go to White Castle). \n\nSo since we were already stuffed we went to Juniors just for the Cheesecake.  I got the Devils Food Cheesecake and it was PHENOMENAL!  I have seriously never tasted anything like that before in my entire life. As a staunch \"Chocoholic\" I had to order the Devil's food cheesecake and it was nothing short of a mind-blowing experience. \n\nThe slice was HUGE, and was a really good deal for the quality and price that you pay. The devils food chocolate cake and fudge was sweet but not overtly sweet. You can definitely taste the quality o f the chocolate. And the cheesecake tasted so legitimate. It was soft , creamy, and velvety. Pair cheesecake with chocolate devil's food and you have yourself a winning combination!", "author": "Lester V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "worth the hype. the original location is about a million times better than Times Square, not least because of the price. even better than the cheesecake, in my opinion, is the black and white shake. for my meal, I had a grilled cheese, and I absolutely love the yam fries here. when I get called for jury duty, I'm going to dream of juniors the whole time", "author": "Yael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "We came here before going to the Barclay Center. The drinks are cheap - $9 for a huge pour of Johnny Walker Black Label - a steal! We shared the Nova Scotia Salmon bagel - very good. Afterwards, we had the cheesecake and apple pie, and both met our expectations. Quite tasty.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-15", "description": "Why is everyone in love with this place? My friends and I wanted to go somewhere for brunch on a Sunday before Christmas. True disappointment! The place was older than my grandma. It smelled really bad too and our table and menus were covered in grease. Our service was pretty crappy too. The woman took 20 minutes to take our order. The whole time we were there, they played the worst holiday music to give you a headache or make it seem like you were in a torture chamber. Okay, maybe I should be a little nicer... broken record...\n\n I was trying to order something that would make me happy and tune out the music, so I ordered some unhealthy corned beef hash with pancakes and eggs.\nIs there really a way you can mess up breakfast?! My corned beef hash was horrible. It was the saltiest mess ever and super gooey! My scrambled eggs tasted like cardboard and my pancakes were so thin  almost disintegrated. Never tried the cheesecake, but I'm sure there are plenty of other places that could have done a way better job.\n\nI will not be coming back here, maybe even if you invited me to.", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "It's not what it used to be but still better than most. Their burgers and onion rings are still pretty great and although the strawberry cheese has been reduced to half the size it used to be and double the price, that is the main reason to go!", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "By far this place takes the cake the cheesecake that is (OK CHEESY I know) I finally went to NY for Christmas and had to try Junior's Cheesecake after a family friend who lives in Brooklyn shipped us Junior's original cheesecake for my wedding. \n\nHaving it in NY was 1000 times better, my husband and I tried the Devil's Food Cake (featured in Bobby Flay's Throwdown) how this did not win is beyond me I can't describe it but after the first bite I wanted to cry b/c I don't think my husband could ever bring me that much joy on that level I experienced with the first bite. It was light and fluffy (down south the cheesecakes seem very dense and heavy) no sour or tangy after taste just pure happiness. \n\nWhile in New York with family we did try other places but Junior's had me The crust was awesome, baked to perfection, and the consistency was divine. I plan on purchasing a cheesecake (several for a get together) and I can't wait.", "author": "Veronica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "Rating for Cheese cake alone is 5 Stars! They have the most beautiful display in the bakery you can buy a slice or the whole Pie. The best of the freaking best!!!!\nFood is pretty good too. Onion Rings are huge!  I had fried chicken \u0026 Mash!!!!!! \u0026 a chocolate Shake Bad 4 diet but good 4 the soul\n\nI was in town 4 a wedding \u0026 was visiting my family in Brooklyn.", "author": "Leslie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "The cheese cake is perfect but the baby back rib from lunch special menu was too dry.", "author": "Jinny T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "I thought the cheesecake was just ok...I actually prefer S \u0026 S, which only sells in the Bronx.  I actually made the trek out there twice just to get it!!  Juniors is a classic staple in NY, though.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Food was mediocre. Service was good. Strawberry cheesecake was way overated--don't understand the hype.", "author": "Laurie A."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}