{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "Everyone raves about the cheesecake, which admittedly is better here than Cheesecake Factory. But my go-to is the crunchy French toast -- with melted butter!", "author": "Sandi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-14", "description": "So I came here last night with my Lefrak close circle.  We got one of each\n-yellow cake with choco frosting\n-cheesecake\n-german choco cake\n-strawberry shake\n-banana shake\n-pineapple ice cream soda\n-cheese fries\n\nAll four of us got financially molested though.  They included a lavish gratuity \"because it was after 9pm\".  Nevermind the fact that we were FOUR PEOPLE ordering stuff from a case, A party of 6, 8, 12, ordering dish after dish and dessert and many a beverage and coffee, and getting rolls and butter and coleslaw, THAT I COULD UNDERSTAND, tack it on.  Hell include the tip in the bill and expect even more!  But damn...why us?\n\nAll this cold waitress unable to communicate or use curteous language did was look at us and wait for our order.  Then she chases us down.  As I pulled out my bills I had well over a months salary for her in my hand.  I told her that the receipt area labeled \"tip\"  was \"the suggested gratuity, right?\" \"No it's on the menu, after 9pm gratuity is included.\" I'm thinking \"Where, underneath the part where it says 'Hey cops if you come in here on a Thursday night you can probably catch a drug bust in the kitchen.'?\"   So I gave her a five (overtipping her 3 dollars more in the process) and said \"Yeah here's for chasing us down.\" And by chasing us down I mean, continuing-her-laziness-and-calling-for-us.\n\nI'm not gonna front, I'm going back to Junior's.  The pineapple cheesecake is too good.\n\nBut I will get my tip back.  Come hell, high water or idiot restaurant manager.\n\nGratuity my bum.  I'm not thankful, you old bag.  \n\nAND DON'T THINK I'M CHEAP.  We tipped 90% the other day at Presidente.  That lady was busting her ass.  She would've shined our shoes but we were wearing sneakers.", "author": "Kent P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "All the rage - I have finally arrived!  Yes, after my friend dragged me all around Brooklyn in search of Junior's, we finally found it.  (He was lost, not me.  I had never been there before, and he had.)\n\nYou gotta love places that specialize in desserts, especially when there's a special take out section for them too.  We grabbed a slice of Raspberry Swirl Cheesecake and Strawberry Cheesecake to go.  Walking over to Brooklyn Heights to enjoy the view, how can you not love sitting on a park bench eating cheesecake together? \n\nThe cheesecake was yummy and rich.  I wish I had water, coffee, something, anything to help bring it down. It was good. Simple as that.", "author": "Teri C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-05", "description": "Everything I ordered was terrible. My mayo was questionable, my server couldn't understand me and my cherry ice cream soda tasted like cough syrup. \n\n   I wanted to love it. I really did, I adore the snacky relish dish they gave at the beginning, though. I'll stick to that and try the cheesecake next time.", "author": "Amelia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-10", "description": "I only have tried their strawberry cheese cake here....but to me it just taste like any other cheese cake.\n\nI don't get what's all the hype about - it's just cheese cake!\n\nDon't listen to me - since me don't really like cheese cake!", "author": "Ro R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-16", "description": "Not sure how many of the other reviewers so far justified rating this place as a 4-star, with some people actually giving it a 5-star rating. Must be extremely subpar standards, I suppose, because this place was in fact a dive. The dinner specials were quite a few notches down from mediocre.\n\nIt's too bad this place turned out to be a thumbs down, considering I always use to go here.. Quite frankly, its overpriced and overall is a horrible place to eat other then the cheesecake. Every dish seems so shabby, greasey, overpriced, and small. Avoid this dump or pay there overpriced, very small burgers, chicken, and sandwiches!", "author": "Yimmy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-13", "description": "I just recently went to Junior's for the first time! Sure, I've had the cheesecake at functions before, and it is undeniably delicious. However, I was excited about the \"Junior's Experience,\" so my roommate and I brought her out-of-town relatives there for a Brooklyn Experience.\n\nWe had no reservations, and the place appeared to be packed. We weren't in a rush and didn't mind waiting. They quoted us a 30 minute wait, but I think it was faster than that. \n\nOnce seated, we were given a selection of PICKLED THINGS. This might've been my favorite part! There were pickled beets, cabbage slaw, and pickles. Also served were rolls and yummy corn bread. \n\nOur waiter was really great. He was super friendly, and gave us extra PICKLED THINGS because my roommate loves them.\n\nI ordered a \"sandwich\" called the Something Different. Something different, indeed! It was yummy, tender brisket, sliced thin and piled high between two POTATO PANCAKES. \n\nBy the end, we were so full, we had to take our cheesecake home!\n\nYUM. A great experience, a Brooklyn must-go. Go early, go hungry. Don't fill up on the PICKLED THINGS too much. Save room for dessert!", "author": "Allison G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "Relatively accessible, check.\n\nGotten pricey over the years, check.\n\nCreamy, melty, yummy, thick, sweet, delicious....\n\ncheckity check check check!", "author": "Taisha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-04", "description": "i have mixed feelings about this place. the location is nice. very bright. very well light. yeah there are a lot of lights here. its kinda bright. i wonder how much is their electricity bill a month.\n\ni had a burger, good burger, juicy, but i dont know. the fries werent my favorite. i guess this place is ok for the amusement. the lights.", "author": "JoseLuis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "All I keep hearing about Junior's is that the cheesecake is great, but the food is just \"OK\".....I haven't had the cheesecake, but have been twice and the food was great!....I recently went for brunch and ordered the corn beef and hash.  It was not the stuff out the can that they pour on to the grill at the other diners...this was actually real shredded corned beef with freshly cooked potatos...great!!!  I guess next time i go, i will have to save room for the cheesecake.", "author": "Justin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "I remember my sister and I had no idea where we were going when we went over here, but we knew we were going to get there and, oh yes, we would be eating cheesecake. \n\nI forget what I had as my lunch there... it was good general dinner/deli fare, with good variety available on the menu. And oh the cheesecake. The variety definitely extended there... mmmmm. We got one of the original and one of the devil's food cheesecake. Yeah, note to self, next time one for sharing is ample. But it's just so darn good.\n\nI haven't found another place to rival it's cheesecake quality so far. But I'm always on the look-out for someone to knock it out of its spot!", "author": "Lara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-17", "description": "Between the CONSTANT urging of a certain Framingham foodie and being featured on Diddy's \"Making the Band\", I made a point of making my way to this cheesecake institution on my last trip to NYC.\n\nBraving public transportation, I ventured to Brooklyn with one goal in mind - to try a piece of Junior's renown cheesecake.  Well, it is truly a piece of perfection.  The filling is creamy and delicious with just the right amounts of vanilla and lemon.  Now the crust is the only area of dispute as Junior's features a soft baked cake crust, which may turn off graham cracker crust enthusiasts.  It's a difference I noticed right away, but it did little to detract from the pure pleasure of enjoying my slice as I strolled through the glorious Fulton Street Mall.  Truly one of my fondest memories from Brooklyn.", "author": "Drew W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-08", "description": "WORST. SERVICE. EVER.\n\nThe waiter, besides getting my order wrong (a cheese omelet with french fries and toast), decided to yell at me for pointing out that he didn't bring my fries, insisting that I hadn't ordered them (they come with the omelet). Really? yell at me? really? WTF!\n\nThen, for a gross bonus to his rudeness, when he finally arrived to refill our water glasses (after they'd been empty for half the meal), he reached over two plates of food and dripped the condensing water all over what was left of our badly cooked lunches, and into my somewhat decent coffee. NASTY. Now there were no more drinks. \n\nFor a striking death-blow to the ambiance, the waiters yell at each other across the restaurant floor, as if they are shopping in the fulton mall and not working in a supposedly decent restaurant. \n\nAt the end of lunch, instead of asking if I would like dessert, the waiter said, \"Are you done.\"\n\nDone. \n\nNo, jerk-face, turkeys are done, tests are done, PEOPLE ARE FINISHED.  I could feel my third grade english teacher rising like a phoenix from my heart, and realized, I'm never coming back here.  So I said, \"No, I've finished my lunch, and I would like to see a dessert menu.\"\n\nHere was the moment that the cheesecake could have saved lunch a bit.  Hell, it's why we came here.  Despite my wanting to walk out at this point, we ordered the chocolate mousse cheesecake. It was good. Not amazing, not perfect, but good. It would have been better if the rude waiter hadn't decided to yell a conversation at the waitress on the other side of the room.  Really, is there a manager around? ever?\n\nJuniors, you are a disappointment to Brooklyn. \n\nYou are the testament of how atrocious service can destroy a meal, and how once great places degrade into shameful shadows of what they once were. You should fire your entire staff and hire people you can train. Start with this: never reprimand a customer when you get their order wrong, learn your own menu, don't reach across tables, if a water pitcher is condensing- wrap it in a cloth napkin or get another one, at the end of a course- ask the patrons if they'd like to see the menu for the next course, clear plates when the entire table is finished- not as each plate empties, and be nice, courteous, and polite to your customers, or they'll never come back.\n\n\nYou will never, ever find me at Juniors again.  Gross.  If the waiters are this awful, I can't imagine what's going on in the kitchen.", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "I never knew about Juniors before moving to Downtown Brooklyn.  I grew up eating cheesecake from the Cheesecake Factory.  However, I was really surprised at the quality of their desserts!  My boyfriend and I enjoyed a quick dinner here with huge portions!  We split a burger and caesar salad that barely left room for dessert.  Obviously we had to try the original cheesecake flavor, but our favorite one was the chocolate mousse cheesecake.\n\nThe dinner food was good, but the reason we keep going back is the cheesecake.  I've never seen this place without a crowd.", "author": "Hillary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "The variety of cheesecakes is just silly. Each bite is absolutely wonderful.\n\nThe rest of the food is not so bad either.", "author": "david w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-27", "description": "If you want a cheesecake, four and a half stars...if you want something more, well good luck!  It is really hit or miss.  Especially later at night.", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "The standard by which all cheesecakes are judged... 5 stars for this alone.\n\nJuniors is basically a glorified diner/deli... and somewhat pricey for what it is. The food is ok... 3 stars for this.\n\nI recommend the tongue sandwich.", "author": "Sockboy_philly .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-08", "description": "After coming out of the DeKalb station, some psychadelic lines hypnotized me, it was spinning like the bed in Austin Powers, yeah Bay-bee.\n\nOk it was the Raspberry swirl cheesecake from Juniors. It was my favorite and 5 stars. Every time I fly back to SF with 3 boxes of my secret weapon, JFK's airport security threatens to confiscate it.\n\n\"You're not leaving with that\"\n\"I'm stopping you not because you have our NY cheesecake, but because its Juniors.\"\n\nBut the Evil siblings, the Strawberry and Plain dragged this review down to 4. Alas they have foiled this strictly-cheesecake review. They just don't taste as good. \n\nPS - The cheesecake was spinning because I was admiring it from every angle before I cut it. No, I didn't take a picture Yelpers. It vanished. I can't wait for my next mission to NY. (Yeah, I know they ship it.)", "author": "Cheryl D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-27", "description": "Cheese cake - 5 stars. I really can not think of anywhere else in NY. Love love Junior's cheese cake. not crazy about cheese cake facory. These are the richest of all and maybe the best of all. And $4-5 a piece is worth bc you can not finish all at once and it will stay in your refrige for a week. So it pays off. God bless you if you are buying the whole cake to finish. \n\nDining experience - 3 stars. Dining in there, foods are great but I wish they clean waiter's uniform more. It is one of those old style all in black but it just looks too worn off/fading and all those. Distracting. And I saw a lot of spillage there. \n\nOverall - 4 stars.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "BEST STRAWBERRY SHORT/CHEESECAKE!. How do you keep outdoing yourself? It's not as complex as Chikalicous', but the Strawberry Short/Cheesecake I had was CRACKTACULAR. It definitely tasted better than it looked. Upon first glance, I was asking myself how this could possibly taste good. The strawberry was fused into the cheesecake and the shortbread was on the side with the whipped cream on the perimeter of the slice. For $6.75, I thought this was going to be a definite fail. To my surprise, it was quite the contrary. This slice was nothing short of heaven. You HAVE to order this. Whomever thought of this genius combination should be given a medal. That's all I have to say. \n\nPics: http://www.meetup.com/teamfoodie/photos/473330/", "author": "Jeff C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}