{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "CHEESECAKE!!! Used to live in Brooklyn and treated myself to a Junior's Cheesecake (usually with strawberries). I moved to California years ago and now I order Junior's Cheesecake via the 800#. It arrives 2 days later still cold in its packing. My favorite cheesecake... coast to coast!", "author": "Lorene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "I love Junior's!  I've been going here for years.  It's a great diner experience. The cheesecake is to die for and the drinks are the real deal.  Try the piña colada 151!", "author": "DAWN F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-23", "description": "the cheesecake is alright. i dont know what the hype it is about the cheesecake..hmm maybe because i went at the end of the night so it didn't taste so fresh? but great waiter and he was funny too :)", "author": "H H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "I have really been here too many times to count...I've  been coming here since I was a little girl. I am a fan of the BBQ Baby Back Ribs...so good...taste so much better than BBQ's. I'm also a fan of the Buffalo Shrimp appetizer, its the best. My second choice in appetizers is the catfish fingers! The sweet pea soup is good. The rolls are good. The creamy cold slaw is good(not the free one that they give you before the meal). Last, but not least,  the shrimp parm is another hot item on the menu.", "author": "Jasmine F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "Despite living in the USA for a few years it was my brother in law from the UK who found this place, which quickly became an object of my affection. I've been to the Juniors off Times Square and in Grand Central Station and purchased the same chocolate cake, which at $7 isn't cheap, but, certainly hits the spot (for several days if you're good  as you do get a very generous portion). The cheesecake is excellent and I say that as someone who doesn't even like cheesecake! I was partially converted by going to Juniors, although in my book chocolate still rules the day. I actually made a special trip to Juniors on my birthday a few years back for a slice of cake, whilst disguising my intentions to my little sonhey, how do you fancy a trip on the subway to Times Square to pass the morning great stuff. Btw: if there are several of you buying a whole cake is much better value.", "author": "natynatster"}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-09", "description": "food poisning! I've been going to juniors forever was always great up until yest after having chicken fingers that made me so sick with food poisning I'm still in pain now a day later.", "author": "dianne c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "fluffy eggs, yummy burgers, and of course fabulous cheesecake.", "author": "misty w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-31", "description": "What Veniero's is to Manhattan is what Junior's is to Brooklyn. This place is overrated due in fact to being another establishment of old Brooklyn. The cheesecake is pretty good, but not spectacular. It's not much different from most cheesecakes I've had in many bakeries.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-04", "description": "my girl friend and i were on vacation in NY and we stopped by at Junior's because we heard the cheese cake was really good, but i have to admit the cheese cake there was not better than carnigie, other than that i thought it was ok..nothing really special", "author": "billy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "Juniors is the best deli in New York. The pastrami is amazing. The matzo ball soup is the best. The cheesecake is so good as well as the lemon coconut cake! I love Juniors", "author": "S F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-28", "description": "ate breakfast here the other day. the breakfast is ok .the service is good too. just an ok place to go to. the cheese cake is great. the people behind the counter by the cheesecakes are always so mean looking and dont look happy to be there.", "author": "Lou S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-16", "description": "Junior's in Grand Central is a bit nicer than the original out in Brooklyn, but the food quality is still sub-par. Baby Watson makes a better cheesecake and the chemicalized fruit poured out of a can than they use to top things at Junior's is sad. A much better bet in Grand Central Terminal would be Two Boots, the New York Oyster Bar, or Zocalo. Avoid the Chinese restaurant. The Italian coffee bar is fantastic, and the desserts are everything Junior's isn't. I think Little Pie Company makes better desserts, including cheesecake.", "author": "newyork2011"}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "By far the best Junior's location.  Great, reasonably priced breakfast.  They also have my favorite egg salad of any restaurant.  The tin ceiling is really cool.", "author": "Jessie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "my favorite cheesecake of all time.  this is the real deal people....not that overly sweetened foo foo crap from cheesecake factory.  this is what real cheesecake tastes like....creamy, dense and smooth.  there's no excuse not to try it since they ship everywhere in the u.s.  there are also  locations in time square and at grand central station but i think it's more fun going to the original in brooklyn.  the reuben's aren't bad either.", "author": "Leon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-17", "description": "i love juniors... best cheesecake in town, hands down. the dinners are well worth it and the staff are very efficient.  i love coming here, it's always an event, not just dinner.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-09", "description": "customer service sucks. youll end up getting into a fight with a random cheap azz customer complaining about the price of cheesecake. ghetttttttto!!!!!", "author": "Drew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-03", "description": "i loveee the matzoh ball soup here. although i actually haven't had much other matzoh ball soup to compare it to. i also ordered the nova scrambled eggs, which were okay. the cheesecake really is amazing, and amazingly huge as well. the service is friendly and quick. a cool and casual dining experience.", "author": "dee w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "We came in on a rainy evening. The place was packed. The food was simple but excellent. And of course the main reason we came was for the cheesecake! Best we've had", "author": "Brad I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "pleasantly surprised.  we had a large party and no reservations, everyone enjoyed what they ordered from the large menu.  our waiter was efficient and accurate with special needs.  especially enjoyed the breadbasket (cornbread and excellent rolls) and the lemon meringue pie. glad to see the 'A' rating on the door", "author": "B. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "we only had the cheesecake, but that's all we needed to have to give it 5 stars!  it was absolutely the best cheesecake i've ever had ... we had the strawberry cheesecake and it had the most wonderful strawberry topping, with real strawberries.  my only complaint, which may be another person's preference, was that the crust was too thin.  i like a chunk of crust with each bite and there wasn't enough to go around.", "author": "Jul C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}