{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "After my mediocre experience at Mile End, my friend and I needed to go and get something to cleanse our pallets. What better to cleanse the pallet than with dessert?\n\nI'm not really a fan of cheesecake, but I'm trying to be. So naturally, I ordered cheesecake while I was here. I think it was a good cheesecake, but like I said, I'm not a cheesecake aficionado so I don't know if it was amazing or just okay. But I liked it, which is the most important thing.\n\nThe service kind of sucked but they didn't kick us out after we ate out desserts so. Yeah. It was okay.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Came here for a quick breakfast meeting with some people from my church. I was going out for a birthday brunch later, so I didn't want to eat anything big, so all I ordered was a coffee and a muffin. The coffee was good, strong. The muffin was good. The service was pretty good too. \n\nI definitely do want to go back though and try other items on the menu, especially that cheesecake!", "author": "Grace M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Nothing beats the original.  Best vanilla egg creams, cheese cakes --- with massive varieties, and all the Favs of authentic jewish deli cusine; matzo ball soup, potato pancakes, pastrami, cole slaw.  Taste of the world", "author": "Pearl D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Went there this past Friday. Loved the diner feel of the place. We had calamari for an appetizer. The corn bread that they bring with the pickles and beets was delish. I had the broiled seafood platter which came with scallops , shrimp, fish filet,  French fries, and collard Greens (this was a first for me and I'm a fan now) The tartar sauce it came with was amazing. For dessert I took a strawberry short cake to go \u0026 a strawberry cheese cake. The strawberry short cake gets the thumbs up from me. The service : the waitress was very attentive and very nice. She was extremely professional which I appreciated. Very hard to come by these days.", "author": "Jeanine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "I'm not from New York, so Junior's only meant  \"cheesecake\" to me, since that's what they will ship and cheesecake would make my Brooklyn-born wife happy (quiet) during her exile in Dallas. \n\nIt turns out Junior's is actually a diner - it has an insanely large menu, breakfast all day, a full bar and more. \n\nWe met two of my wife's high school friends for lunch and the food was good, the service was very friendly, and nobody seemed to mind we took up a table for almost four hours. (We did have soup, entrees, and dessert, but that still seems like a long time.) \n\nSo, after becoming used to being rushed in and out by staff trying to turn tables, it was very nice to find a staff member (thanks, Winston!) that was happy to refill drinks, wait twenty minutes to take an order because one of the party members was late, and in general provide excellent, personal service for an entire afternoon. \n\nOne issue - which is not Junior's-specific - parking in the area is horrific. If you don't have to drive there, take the subway. There were three garages in the area, and they were all full. We finally found a spot on the street a couple of blocks away, so our designated driver had to run to feed the meter once an hour. (This does help make room for more cheesecake.)\n\nThe food was good - I had the pastrami and corned beef combo, two rolls, one with each meat and fries. They were very filling. The matzo ball soup was amazing, and I am not a soup person. The German chocolate cake was very good, but by that point, I was stuffed. \n\nI'm sorry I didn't try the \"Something Different\" which is a brisket sandwich on potato pancakes with gravy. I think my arteries clogged just a little when it was placed on the table. \n\nThe chocolate egg creams were very good. If you don't know what that is, just go order one. I'll wait. You'll come back to thank me. \n\nWhile it may not be the same as in it's heyday, it's still a good diner. Plus, there's always the cheesecake.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "Gotta love Junior's in Flatbush. Scooped up a strawberry cheesecake and wanted another one. Good thing you can order online at juniorscheesecake.com to get mines shipped to FL.", "author": "David C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-05", "description": "I've had Junior's many occasions and while I do love the cakes it would not be fair to give them a great review due to an issue I had a few years back. I was in the city so I decided to go to the Brooklyn Junior's for a slice of cheesecake and a strawberry shortcake. I took my cakes back home to the BX and would you believe they sold me a bad cake! The strawberry shortcake was rotten. The preserves were sour. I kept eating small piece by small piece hoping it was just the flavor and I just gave up and threw it away. I was angry not only because strawberry shortcake is my favorite and that they are OVER PRICED but because I trekked there from where I was and it was out of the way plus an hour fifteen minute ride home. So for that you receive this generous star so take it.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "+yummy cheesecake - tasted good, but not sure about being NY's best. \n+complimentary bread/corn bread \u0026 small side dishes for dinner!! free corn bread!!! yum!!!\n+friendly waiter\n+big portions \n\nOtherwise, pretty standard diner food.", "author": "Angie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "they have pretty good cheesecakes but nothing to go crazy for. \n\n$6.50 per slice is a bit steep", "author": "Jo H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "Their plain cheesecake \u0026 plain cheesecake w/ strawberries are orgasmic. I love it! \n\nThe lady behind the counter with the attitude? Not so much... I was with one of my guy friends and he gave me his card since he had to use the restroom. She was rude in telling me that she needs ID with the card. \n\nI said 'Oh, he's in the restroom. He'll be back.'  She didn't believe me so I waited RIGHT at the cash register. It's all about how you say things...\n\nHe comes and presents his ID. No lip whatsoever from her. She was dead silent for the rest of the transaction.\n\n'Oh, where's your face? Ah, on the floor where you dropped it while being rude to me.' \n\nHa.", "author": "Joelle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "This restaurant has the same menu like the one at Grand Central Station.  It's within walking distance to shops, and the Transit Museum.  I liked their double chocolate cake for dessert.", "author": "Ilan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "Junior's strawberry \u0026 raspberry swirl cheesecakes are so divine. I do have to say that their cheesecakes are very delicious, and unique in their own ways. However, I think their cheesecakes can be overwhelming. Their cheesecakes are too sweet for my taste buds, and a bit too heavy on my tummy. Everytime I eat their cheesecakes, I feel like I don't have to eat anything more for the rest of the day because I am so full. \n\nService was ok. Nothing special to mention about their dine in foods. The foods served here are the same as the foods served at any diner; greasy.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "I stopped by this place one day just for the cheesecake because I mean.... who moves down the street from WORLD FAMOUS Junior's and doesn't try their cheesecake? Well.... gotta say, really wasn't that impressed. I prefer a graham cracker bottom, but unfortunately they didn't have any. Only sponge cake- which I wasn't a fan off. They are also pretty pricey even for the plain.\n\nI also came here for lunch with some coworkers. I got a pastrami sandwich and ceaser salald. Really can't go wrong with that. However, my coworker got the french toast (menu item that seems pretty fool proof), and I could instantly tell by her face that she hated it. It didn't even look like french toast. I wish I had taken a picture. It looked like it was fried and crunchy- not adjectives that you hear when describing french toast. \n\nTo top it off, our waitress was lousy. Service was slow, and she appeared to have an attitude everytime we asked her something. Even after telling her that we were in a rush because we had to get  back to work, she took about 10-15 minutes to even bring us out the check. Mind you, she was catering to only one other table. Unacceptable. At the end of the day, Junior's is just a glorified diner.", "author": "Marla B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "I have a love hate relationship with Juniors.  The service is kinda crappy and the food is pricey..but everytime I come to NY, I have to go there a minimum of 2-3 times and get their delicious french toast at least once!!!\n\nIts a famous place...so f you are in NY, you at least have to go once!! Their cheesecake is delish and I love their breakfast.  There are some servers I really try to avoid, but for the most part, the service is semi decent.  This last time the hubby and I went with my fam he ordered the cookie monster sundae..OMGEEEE TO DIE FOR!!!!!!! Im craving it now!\n\nDefinately check it out to say you've been!!! \n\nPlus they have turkey sausage!  For breakfast...expect at least a $30 for two people.", "author": "Toni B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Wow. For a minute, I thought I was going to a club. Burly bouncer at the door. Line a mile long outside. But wait...huh?\n\nYes, you read me right. A snaking line outside for the bakery. This must be some good shit. \n\nTheir cheesecake is good. Creamy and perfect. Just like your last wet dream. \n\nI bought a carrot cake cheescake ($27.95). The service was fast and prompt. \n\nNow, let's hope I can dazzle my family with it...minus the wet dream.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Food over the top perfection. The service... equally fantastic. The chopped liver was the best I ever had. Rueben - delicious. Deserts... all are the best. You restored my faith in the world of Diner eating.", "author": "Bill P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Had the pumpkin spice cheesecake, was very good.  Place is quite large with lots of good seating.  \n\nRestaurant appeared clean.  Service was prompt and courteous.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "I went back to Juniors after almost a 2 years of trying of the cheesecake and I fell like I have been missing out! I'm pretty sure Junior's has the best diner food I've ever eaten. It's a bit pricey, but the food is oh so tasty! \n\nI loved the soft dinner rolls and sweet cornbread. My Pepsi had the perfect balance of carbonation and soda syrup. My cheeseburger was delicious, not overly huge for me, and not disgustingly greasy! I also had a quick taste of my husband's mash potatoes, and I wanted to finish it! All and all....I'm definitely sad that I have been ignoring this place for almost 2 years. I'll be back!", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "We ordered three cakes. Original, Strawberry and Carrot Cake cheesecake.  I'm not a big fan of the cake bottom ( instead of graham cracker crust).  The actual filing was excellent. A little too pricey, but worth the experience.\n\nNot the best parking to come here on busy Flatbush Ave, so have a plan before coming.", "author": "Linford E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "We went to Junior's for lunch, and I loved the retro charm.  Diner decor and classic music playing in the background.  My husband loved that he could get a beer in a diner.  I ordered unsweetened ice tea, which was good.  \nTo start, the server brought us a little bowl of pickled beets, one of my favorites.  Another bowl contained slaw covered with pickle spears.  Good slaw, but the pickles tasted a bit medicinal.  We ordered grilled cheese sandwiches with fries.  I had mine on challah bread, which I loved.\nWe returned for breakfast.  With an entree order, you receive juice and pastries/bread.  I got the vegetable omelet with cheddar, accompanied by home fries.  As hungover hungry as I was, I could not finish this massive amount of food.\nThe prices are not diner prices, which was the only thing that informed us that we were not in a time warp.  Both visits featured friendly, prompt servers.  I would definitely return if I go back to Brooklyn.", "author": "Robin C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}