{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-25", "description": "Totally overrated, but you go just to say you did.  The cheesecake is pretty good, but  the dinner is just average.  Typical Denny's fare, even.  I'd  grab dessert here after a meal somewhere else.  Don't believe the hype.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "Last stop in NY. My friends and I were all full from pizza and ice cream beforehand so they didn't want cheesecake. I got us a small regular one (so small it fits in the palm of your hand) and we shared it on the plane. It was good. Not wow, just good. Brought my sister a small one (maybe 9 in) back on the plane, a raspberry one. She enjoyed it. She must love it because this is the second one she has had brought back on the plane. Haha.", "author": "Anita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "This is (don't laugh people) my favorite restaurant so my writing a review may not be fair, having said that here goes. I love this place this to me is the quintessential American restaurant from it's look to the atmosphere to the waitstaff. I love everything I've ever had on the menu I can't think of anything you could go wrong with I especially love the corned beef and the beef brisket. the drinks are great .  This place is cool. As far as deserts I've had a few I love the chocolate frosted yellow cake (strangely enuff I'm not really a cheesecake person although I like there's well enuff). To eat in or take out NO ONE should pass up....no let me rephrase that EVERYONE should check out Juniors restaurant at least once in their lives.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-05", "description": "Juniors is an institution in New York City. Located in bustling downtown Brooklyn. But once you step inside it feels as if you were transported back to a slower time. However this does not apply to the  staff which is very quick and helpful. Junior's even has bathroom attendants who offer you soap, paper towels, and lotion! Just like the neighborhood though the place is always packed with people ordering their wonderful cheesecakes.  Junior's also has dining in options that appeal to people without just a sweet-tooth; from tasty deli sandwiches, to seafood and steaks. Juniors has it all.", "author": "Foodie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "I recently visited here with a friend on a trip to Brooklyn who said I had to get a slice of cheesecake at this famous institution.  Due to the unavoidable constraints of a very full day of things to do, we came around the late breakfast time of day.  I've never been one to turn down breakfast so before my encounter with their cheesecake, I ordered a pretty standard meal of a ham and cheese omelet.  It was certainly very large, but I didn't think it was cooked all that well.  The home fries however were pretty tasty and brought up the meal's average.  I did have the chance to taste my friend's blintz and it was by far the best thing on the table I would have to say.  After all of this food then, I then went over the laundry list of different cheesecake choices and ended up with the old class, plain cheesecake with strawberry topping.  I'm a pretty big cheesecake lover, and while there was nothing wrong with it, I guess I had somehow expected more.\nThe service was a little inconsistent, our server was very nice and even indulged my touristy nature by taking a photo of us, but towards the end of the meal when we were ready to pay the check, he disappeared for a long stretch of time.  I could understand if they were very busy, but it really wasn't, so his absence was a little puzzling.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "I don't know what the big hype is all about but the cheesecake is not that great in my opinion it's okay to way to thick had better", "author": "Ebony E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Probably the Best pastrami sandwich in NYC. Better than Katz in Manhattan. Bakery is very very good. Cheaper than Katz Deli too", "author": "larry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "OK - I said I wasn't going to review Junior's (only because of the gazillion other reviews); but I did mention that I was a Junior's fan in another review - so I feel it is only right that I give a shout out to my beloved Junior's!!! \nI love Junior's, I often come here sometime after work - they are open till about 1 or 2am - even on weekdays! I have to tell you - there is always DRAMA every time I come here - one time a patron said that the bartender stole his watch - apparently he took it off and left it at the bar and the bartender put it on - DRAMA (funny as hell) Another time someone had \"forgotten\" to pay the bill - fight outside NYPD and all. I love NYC and I love Brooklyn - please out of towners don't be alarmed - its NYC baby!!! \nThe staff is super super friendly and courteous, its almost like they have this pride about working at Junior's almost iconic! Shout out to my FAV waiter Glenroy - this man must work a lot because he is ALWAYS there when I come to visit!!! He always hooks me up with extra pickles so that I can take them home (the pickles that they serve as an appetizer are the BOMB) \nNow to the drinks - I recommend the Strawberry Bellini - I think its the same strawberry sauce they use for the cheesecakes and sparkling wine - its fun sweet and bubbly and everyone looks while you drink it!!! \nThe food - OK I am a little biased here because I tend to order the same thing - but I have had several things on the menu - which have all been really good! I love the fried chicken with 2 sides I really don't eat the sides I usually have it with the cornbread that they give as an appetizer. So yeah - its 1/2 of a chicken cut up and fried to perfection - always served PIPING HOT!!! Definitely enough for 2!!! \nDesserts - now you all know that Junior's ships all it's stuff all over the world - but you have to be in the restaurant to enjoy the full experience!! Always served at room temp and HUGE portions - order a piece (you probably won't be able to finish it after a meal there) AND order another piece to take home - trust me you WILL be wanting to eat some cake for breakfast!!!", "author": "Karen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-04", "description": "By far the best cheesecake I have ever had.  The burgers are also good and the onion rings are the size of donuts.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-05", "description": "The best food and the best service in Brooklyn. The best hamburgers steaks , breakfasts and malteds. The friendliest waiters and waitresses , that deliver 5 star service .", "author": "charles s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "My rating is mostly based on the AWESOME service we received. Jason, you rock! The food was great, too. Great value and lots of free sides, like beetroot! What fun!", "author": "Mel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "Ok, so everyone knows the cheese cake is amazing but this review is for juniors strictly as a Jewish deli. As far as the deli goes juniors has got it down, every aspect of a Jewish deli covered except for one rather important thing. They DO NOT serve Dr.Browns.... Are they serious???? They are located in NEW YORK! OK moving on, I ordered a Rubin which was overflowing with corned beef, and kraut and and was DELISH. the side order of latkes I got was also very good. The staff was helpful and friendly (and even apologetic with regards to the Dr. Browns). Juniors is a Brooklyn institution and definitely worth checking out even if you are not in the mood for cake!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "When I got home, there was a delivery from Junior's at my door - in California. Some friends sent us cheesecake from here, claiming that it was the best cheesecake ever. And while it was over-nighted, it was delicious. We got a sampler that had 4 different kinds of cheesecake. Yum. This place is cool to deliver across the country!", "author": "Leah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "The original Junior's can't be beat. The MGM Grand Foxwoods location and Times Square location lose out to this Brooklyn spot. Hospitality at it's finest. Awesome Asian salad and calamari. Of course, you have to try the cheesecake, it's unrivaled. It's also huge, so you can split it. If you're into cheesecake, you need to come here!", "author": "Earl G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "Great Cheesecake! I've never tried the food here, but I have gone back for the cheesecake a few times. The only downside is that it's always a little hard to find, but very worth the search! My fave is the strawberry cheesecake! It was so good that my friend and I brought a small cake back home to Cali with us! yum!", "author": "Kathleen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "I don't like cheesecake but the Junior's cheesecake is delicious. The bulk of the cake has this vanilla taste. The edges have the tasty sugar crumbs. The chocolate cake is a tad too rich. You need a gallon of milk to wash it down. As for the entrees, the burgers are awesome (ask for medium rare or they'll overcook it). Forget the Big Mac and Whopper-Junior's is the best. The fries are lousy. Soggy, tasteless fries. However, the onion rings are the best. Instead of getting fries and onion rings tell the waiter you want a double order of onion rings. There's no additional charge. I also liked the chicken parmigiana. It is very delicious. However, you'd have to be a sumo wrestler to finish the whole thing. I definitely recommend Junior's.", "author": "L. William W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-13", "description": "Just went for some late night cheese cake and hot chocolate. Large delicious portions. It will take weeks to work it off. Just watch out on the bill. They include the tip in the total, and have a blank line below. Those who don't 2x check will end up leaving 3x tip. The service wasn't that good.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "The cheesecake was not what I was expecting. It was actually super creamy and more resembled one of those no-bake jello cheesecakes, only the consistency was slightly thicker (but only slightly). It was pretty dang good. I still prefer the cheesecake factory though.", "author": "Amuse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-22", "description": "A must whenever I visit NY. There isn't much i can add on top as what has been said. I never had a problem with the service i have received here. They have always been courteous and polite, my orders have always been made correctly and promptly. The servings are generous so i can always count on getting a to-go box for a snack later on when I'm back in my hotel room. This place would be one of the few and i mean few reasons why it would not be good for me to live in NY. I would be at this place to much and i would die from a cheesecake induced heart attack in less than a month.", "author": "Alfredo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "Creamiest cheesecake ever! I'm used to the standard \"cheesecake factory\" slice. Juniors was a force to be reckoned with. My date warned me.... \"grab a glass of milk,\" I didn't listen.  My only gripe is based on personal preference, I was a little deprived of my Graham cracker crust. But delicious nonetheless.", "author": "Kai P."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}