{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-27", "description": "The...best..cheesecake ever.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Best cheesecake period. I always get the strawberry cheesecake. It's very expensive though. The price goes up every time I go to Junior's, but it's definitely worth it!!!!!", "author": "Nathaliah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "I grew up eating Junior's cheesecake so it holds a dear place in my palate. My favorite is their plain cheesecake. The texture is different from the cheesecakes with the fruits on top. The plain cheesecake has a smoother, lighter, and creamier texture and it is so deliciously satisfying. They also offer a variety of other kinds of cakes. Tried the red velvet cupcake and it was decent.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "yay! I am totally fan!\nI tried strawberry cheese pie,the taste sooo good! I will try every favor definitely!", "author": "Edie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "The best cheesecake ever! The plain cheesecake is amazing! This is the to go spot for the best cheesecake. All of the cheesecakes I saw looks DELICIOUS!! You will not doubt yourself about the cheesecake. The christmas cheesecake is the best. Juniors is the spot for cheesecake. Prices are fair but the cheesecakes just taste amazing!!", "author": "Btoughdude L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "Come for the cheesecake, stay for... Well no don't stay. Don't sit. Don't order food or you'll regret it.. I should have known better after coming here years ago, but hey I thought maybe it will be different this time. \n\nI was wrong. \n\nUpon walking in, my gf and I were lead to a table. Silently. I even asked my gf where she was going, as I was following her, she guessed we were going to a table. Then after attempting to sit us in the smallest space possible, squeezed in between two people (even though the place was empty, wtf) we asked for a different table. The worst part is, whoever was leading us asked a waitress if she wanted to take us. To which she replied no. What kind of place is this? How do you refuse to do your job and just stand there?\n\nLuckily the waitress we actually got was pretty nice, the only saving grace.. The food was ok, I can't say it was horrible but it was better than I expected due to how we were treated. The waitress is the only reason I left a tip. \n\nNever again.", "author": "Anthony B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-23", "description": "I had the black forest cheesecake and a chocolate shake. Nothing special. I can't believe I just paid $15 for a piece of mediocre cheesecake and a chocolate shake that tasted like it was from Friendly's. \n\nI almost broke a tooth on a cherry pit that was left in the cheesecake and the rude cashier never even handed me my change. I guess he thought since I'm at juniors he's entitled to just keep it.\n\nDon't waste your time or money. There's so much more in Brooklyn that's so much better", "author": "Scott W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "The food is good, it is pricey and some of the servers don't even greet you. Our very own server didn't greet us and took a while before coming to our table. You can't argue with the cheesecake because that is in a class all by itself.", "author": "A C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Awesome cheesecake!! I went here for breakfast and ordered an omelette, it was pretty average taste from any other breakfast joint, pretty big portion though. Now let's get into the real reason to come here....the cheesecake. This is the place to go for awesome cheesecake in NY, forget the cheesecake factory and their chain restaurant taste. The cheesecake here is a different story, they actually taste like something your grandma would make. I tried the apple cheesecake, which was like having apple pie and cheesecake together, it was delicious!! I suggest that if you want to try the cheesecake here either share breakfast with someone or skip breakfast and just go straight for the cheesecake. I made the mistake of having breakfast first and I was full by the time I ate the cheesecake, so I did not enjoy it as much. So I definitely want to go back and just have cheesecake. Service was good too, attentive and fast.", "author": "Mario P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "This is the restaurant to go to for a genuine New York experience. The pickles and cole slaw are amazing, and the corn bread and rolls are to die for. The Matzoh Ball Soup is the best in the city, perhaps the country, and aside from the cheesecake, is Junior's signature dish. Get a sandwich of corned beef, pastrami, tongue, roast beef, or brisket, each of these on rye bread. These are also the best, better even than Carnegie Deli's sandwiches. Then, if you have room, order one of their countless cheesecakes. For a newcomer, I recommend the plain cheesecake, by far the best in the city and even the country. This was the key to Junior's' fame, and it is truly world famous. For all this, it is about $25 per person.\n\nThe service is fantastic, especially in Brooklyn. If you are at the Brooklyn branch, which is the true Juniors because it was the original one and is not as touristy, ask for the waiter Patrick, a seasoned veteran of the establishment. But you cannot go wrong with any of the other waiters and waitresses.\n\nThe atmosphere is best at the Brooklyn headquarters, and with all of the pictures and memorabilia, it doesn't just represent Brooklyn, it is Brooklyn. Less tourists go to the Brooklyn branch, and it is much larger than the other two branches.\n\nThe other two branches are in Grand Central Terminal next to the whispering corner and on 43rd Street near Times Square. This one is always busy and has outdoor seating, but because of its location is packed with tourists who have just watched Broadway plays and musicals. It is good, but if you want the real thing schlep out to Brooklyn.", "author": "Ethan O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "I just ordered pumpkin cheesecake to go. I thought it would have been better then Costco's but it's not", "author": "Meme B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Good was absolutely amazing!  Portions were big too! Environment was comfortable and clean and service was great!", "author": "Norma V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "So, I've only been to Junior's once but it was a really long time.  This time i was in the area \u0026 my granddaughter \u0026 I were hungry so i asked her do you want to go to Ihop or Junior's. She's 12 \u0026 wanted to eat at Junior's especially for the cheesecake.  It wasn't full so we were seated quickly.  We almost ordered the pancakes \u0026 french toast but decided that we could have gone to Ihop for that. So we ordered a chicken salad sandwich \u0026 a BLT with french fries.  First it took alil long for the food to come out. When we were served we each looked st the food \u0026 then at each other.  These sandwiches were huge, didn't look appetizing at all.  The chicken was too chunky, hard to chew, no taste at all. Too much bread.  The BLT was too dry, more lettuce than anything, too much bread again. We each ate just half of the sandwiches.  The best thing out of the meal was the fries \u0026 the server was nice. Too much hype for this place \u0026 too expensive.  Not worth it in my opinion.  Wasted money.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "The cheesecakes are legendary. I had the strawberry cheesecake and it was amazing. Did not try any food though but based on my visual observation, while standing in bakery queue for cheesecake, I saw some good looking dishes being carried by the waiters.", "author": "Shamshiri C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-26", "description": "Finally made it to the world famous Junior's.  The place of the Diddy Walk/Brooklyn Bridge.  What a big build up for naught.\n\nFirst of all, NOBODY bothered to tell us NOT to EAT there.  You know, to ONLY go for CHEESECAKE.  DUH.  We ordered food.  Yeah.  From the menu. Eww. I had an omelet that was just big, and dry, and lifeless.  I've forgotten what the gf had.  That's how memorable it was.\n\nThe cheesecake was certainly rich and creamy.  Yes, it was very good.  Would I make a special trip here for a slice?  Maybe.  If I were near.  Would I mail order? Probably not.  Would I walk from the city for a slice? LOL!!!!", "author": "Adrienne T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "A straight up classic staple in BK. Had the pickled appetizers. They were ok. The pickled pickles were VERY NY DELI. Split the Reuben. THE MEAT WAS TO DIE FOR. Yet I didn't die because I am right here typing this review. Thus the figure of speech (still good meat). Great place to come for lunch, sounds like a classic tourist place, why not. Get em in.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "When I realized my hotel in Brooklyn was just a 5 minute walk from the Food Network made famous Junior's, I just had to go. The truth is, I'm not even a cheescake lover, but I can't just ignore Rocco DiSpirito saying it's the best thing he ever ate.\n\nBetween the wood paneling and gold trimmed bar, I felt like I was walking straight back into time. I later found out that my parents used to go on dates at Junior's when they lived in Brooklyn (aw). It sounded like not much has changed since their milkshake sipping days.\n\nThe service was a little slow and the prices were a bit higher than I expected, but the food made up for it. For lunch I ordered the brisket melt -- a crazy mega sandwich with tender brisket and melty cheese piled onto a huge roll. It was amazing, but wayyy too much food. I had to force myself to stop knowing one more bite would send me over the edge before I could even stick my fork in the reason we came: the cheesecake.\n\nWe decided to order 1 piece of the chocolate marble cheesecake. To reiterate, I'm no expert, but I think this was cheesecake perfection. It was so light and the texture was just spot on. Certainly worth making a trip for if you're anywhere in the vicinity.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "Yummy cheesecake! But that's pretty much it... I don't recommend eating an actual meal here. My friend got a chocolate cake which was overly sweet on the frosting and cake was stale. Service is super slow! The waiter took a VERY long time to refill our water and to bring us our check, meal and dessert.  The place is huge but doesn't have enough waiters. I feel bad for them... they have a lot to cover. Our waiter did warn me that it would take about 25min for the food to arrive so that's fair for letting us know but in reality it took more like 30-35 mins. The food itself was overpriced but I expected it too be amazing as they charge like $23 bucks for a dinner plate of fried chicken. The fries here are too thick and flavorless and the fried chicken while is a lot of quantity the crust is really stale. Definitely not worth $23 bucks! They give you free pickles and pickled beets which had too much vinegar. They charge you if you want bread which is usually a freebe at most dinners/restaurants. I should have realized they have a bakery part right next door or I would have just gotten cheesecake and had dinner elsewhere. I recommend doing that and not bothering with the diner part.", "author": "Jane H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "While I just had dessert, my friends enjoyed their non-sugary food.\n\nWith that said...I LOVED the cheesecake (and I'm not even a huge cheesecake fan). I only wish I lived nearby, so I could try all the different varieties. And yes, the other reviews are correct, this is a giant $7.95 slice of cheesecake.\n\nGo get some cheesecake, right now!!", "author": "Jamie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "The cheesecake is good. My boyfriend and I got the plain cheesecake, strawberry cheesecake, and red velvet cheesecake. The customer service needs improvement. They weren't friendly at all.", "author": "Ariel R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}