{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I wish I could give Junior's 10 stars instead of five. Now my friend did arrive late and that really did irritate the heck out of me. So when she came we were seated in the booth near the street. Our server was Tyshawn. I'm just going to say one thing, Tyshawn is nothing short of a sweetheart. I would never forget him because his service was nothing less than 100%. He went above and beyond for my friend and I. I mean damn, when you have a great server, you'll always remember them. I had to tip him 30% because he was that good.\n\nSo I give Junior's a 5 star rating based off of that. I mainly know them for their cheesecakes not their food. Their food is very, very good.\n\nSo the only thing lacking is their drink selection. They will make any cocktail you want but you'll have to ask. I really wished I had a choice but it was okay. I had a Sex on the Beach that was quite good. Strong but sweet.\n\nSo I did not want to eat much, but my friend is a pescatarian and ordered the Fried Calamari. It was very good. I tried one piece and sure did like it. I ordered the Thai ginger wings as well as the Coconut Rice and Beans. The wings were excellent and that was the best rice and peas dish I have ever tasted. The rice had flavor and was not dry. It was that addictive. We were also given cornbread prior to eating out food. It was moist and tasted good with the sweet cream butter. Our server also gave us free soda and routinely came around to check on us.\n\nWe stayed at the restaurant for a few hours talking and Tyshawn came to us with a bag each with onion rolls, cornbread and pickles. That was pretty nice of him.\n\nWould I come back? Yes. Ask for Tyshawn. He is the best. The food is excellent too.", "author": "Omolara O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Finally got a chance to try this place. Lived in Brooklyn my whole life always wanted to try but never had time or could find parking. Went with my family for the half pastrami and corn beef sandwich. Super super dry I literally almost used the whole bottle of mustard on the table to eat it. Wife got the pastrami with mozzarella. Same thing super dry as if it was old from the day before possible. Kids had chicken sandwich same problem super dry white meat. Other kid got the chicken tenders surprisingly that was the only thing that wasn't dry. As for the cheesecake I must admit was creamy and good but not all that great. Would rather eat the frozen one from bjs or the supermarket. Even Cheesecake Factory might of been better. Bill came out or over $160. The cool thing about the experience is the inside is original old lookong. It was cool. Atleast I can say we tried it.", "author": "Benny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-27", "description": "Place looks like a Brooklyn staple. Food was mediocre. I believe they're known for their pies though. Service was very good and the lady was super lovely! It's a nice family place, which does include a loud atmosphere. A little chaotic, but it's a classic diner-a Brooklyn staple.", "author": "Familia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Nostalgic, friendly and tasty makes Juniors a go-to place for the locals in Brooklyn.  The place was filled with folks who were on a first-name basis with the staff.  We traveled here (as tourists) based on the travel channel suggestion.  The food and desserts are great here at the original location and I imagine they are likely just as good at the Times Square location too.  Checkout my Strawberry Cheesecake Milkshake!", "author": "Matt R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "It's an establishment in NYC. Come for the the namesake cheesecake. The rest of the food is meh, but you'll get your quantity for it.\n\nLook out for the random gratuity they'll tack onto your bill. That was sneaky, but I'm glad I looked for it and they \"corrected\" it. I'm sure an honest mistake.\n\nCHEESECAKE. YUM.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "Juniors is a spot I have to be in the mood for to drive for the food! I normally get breakfast every visit and this time I ordered a cheese omelette with fries. It was good for the most part. \n  The service was okay until I went to get some cake slices. It's really not clear as to which cashier is open or not and the workers aren't that helpful either. I stood in one line while a guy and the cashier held a 5-10 min conversation and when he left the line, I thought I was next, he never came back. Never said go to the other side when a crowd of people came and the other cashier took them first although he saw me waiting. \n   Things like this is the reason we normally do takeout. Next time, if there is one I will do so.", "author": "Tiffany J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "Junior's makes an excellent strawberry cheesecake and dare I say an even better pineapple coconut cake. It's very pricy (almost $10 for a slice of either) but makes for a nice late night treat when in Brooklyn.", "author": "Yasmin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Bought me some cheesecake for dessert today for thanksgiving ,the sales associate: Tashana was really friendly and happy to take my transaction . I wonder if you get all this from cheesecake factory LOL\n\ni'll defetinely will come back", "author": "L L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Food: 8/10\nService: 7/10\nAtmosphere: 6/10\n\nJunior's is a NYC landmark known for its myriad varieties of cheesecake.  While I've never ventured away from the cheesecakes, the menu is so expansive that there's almost certainly SOMETHING for everyone in your group.  The standard NY Cheesecake is always a winner, but if you're feeling more adventurous, see what's on special.  One of my recent favorites was a Black Forest Chocolate Cherry Cheesecake, which has become a must order when I see it in the display window!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Great Cheesecake. I got the original and my wife got strawberry. It was so creamy. They really know how to make a great cheesecake. Also, they have an extensive menu of regular food too. Plus, they ship it all around the world.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "Horrible place. Firstly, they are excellent in false advertising: on FB and other social platforms they promoted the strawberry shortcake for $5, but upon payment it turned out that it's almost $9 with tax as the other price is for dine-in only in case you also buy another dish... obviously no response for them. The cake itself is horrible, too sweet and it's just a ton of whipped cream, we couldn't even finish it. We tried other cheesecakes as well at Juniors, none of them was even close to a real cheesecake. They are too expensive and don't taste good at all. The carrot cake we also bought went wrong after 1 day!! We ate the half of it then it was in the fridge the whole time and it had a funny taste the next day so I threw it out. The only thing I like in that restaurant is the devil's chocolate cake.", "author": "Alexandra D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "I had heard really good things about Junior's but it was just okay. My mom makes better cheesecake. Also Cheesecake Factory. And this place is also really expensive so I wouldn't recommend. \n\nMac and cheese was pretty good though, but not $8 good which is what it cost me.", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "We needed a cheesecake fix and picked the Apple crumb Cheesecake with A La Mode vanilla ice cream. It's creamy texture contrasted nice with the apple crumb. \nIt only gets 4/5 because the diner level coffee was over priced $3.25 is way too much.", "author": "Noel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-06", "description": "I came to this institution thinking Greatnesses was happening here I ordered their Combo Pastrami \u0026Corned Beef it was far from spectacular Meat was piled high but lacked flavor the Rye bread was average .The Wife ordered the Chopped Liver on Rye nothing exceptional just a sandwich .This is my first N.Y. deli experience I only have to compare The deli in Los Angeles \"Langers \" which is Spot on\" like Cantors  . The only thing that stands out was the Cheese Cake  the best iv had I will come back for a second slice before I leave back home", "author": "George M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "While there was nothing wrong with this place, there was nothing special about it either. Just another tourist spot. Personally, I'm against chain restaurants and diners. I feel like because of the dirt cheap prices you sacrifice on quality food. \n\nMe and my friend wanted dessert and this was the closest in the area (I was not walking around in the cold.) We weren't getting anything but dessert. There's a massive selection of cakes to pick from. I went with the German chocolate slice with a scoop of coffee ice cream. You know what I got? I got a BOWL. WITH A MASSIVE PORTION OF CAKE. My jaw literally fell open as the waitress brought it to our table. As always my friend finished her slice while I didn't (terrible foodie.) \n\nI have nothing against the restaurant. Lots of different items, I'm sure they have something for everyone.", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "I've been coming to Juniors since I was a small child. My mom loves the food here so always come here for breakfast any time of day. I like all the food though. We came here the other night specifically for some delicious cheesecake!! Anytime I'm downtown BK I try and stop in for a slice of heaven or even a whole one. I say that because this place is just so good you think you've died and gone to heaven.. lol we got the strawberry cheesecake. \n\nI also really like how friendly the people are who work there.", "author": "Doris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "I do not know why I am writing this review. Everybody knows Junior's because of the cheesecake. What most people probably do not know is Juniors is a really good diner. It doesn't have the pages and pages menu or most diners. What is on the menu is really good.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "I can't remember our servers name! But she was so nice and joyful! We went after a heavy dinner so didn't have room for much. All we had was a slice of strawberry cheese pie and she wasn't even upset about it. \n\nThe difference in between the cheesecake and cheese pie is just a crust. We went with the pie and were happy about our choice. Real big juicy strawberries on top and enough strawberry sauce for each bite of cheesecake! Service was fast and entire staff was great. Manager also came by to say hello! Strongly recommend if you are in Brooklyn. Price for slice is $8-9", "author": "Arti G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-30", "description": "Service gets an A+. All of the staff were very friendly and helpful. The food was solid. I got the pulled pork sandwich which was really good and my wife got the fish and chips. Although I really liked my pulled pork sandwich, she thought her fish needed cooked a little bit longer.", "author": "Josh P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-21", "description": "Meals are oversized including the Fruit Bowl.\nMy grandson loves it there; I'm not a fan except for convenience.", "author": "Local And World T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}