{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "The food portions are huge so be warned and the food is your regular diner fare but what this place is really all about is the cheesecake. OMG in love with it. I had a carrot cheesecake and I can still remember the taste weeks later.", "author": "Catherine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "A family favorite whenever we are in NYC. Th cheesecake remains a favorite with the children.  Other items on the menu are well-prepared. The wait-staff is appropriately attentive and environment relaxed.", "author": "Antoine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "Something you must know about this fellow Yelper. I'm a cheese fanatic. Cheesy pizzas, gourmet cheese right into the mouth off the knife, cheese \u0026 crackers, cheese \u0026 wine, mac 'n cheese, cheesy baked potatoes, cheesy pasta, cheesy soups, cheesy salads, cheesy fries, cheesy movies...you name it. But if you really want to floor me good, nothing does it better than a fat slice of silky, creamy cheeseCAKE.\n\nThis brings us to Brooklyn and Juniors.\n\nYeah, Junior may not look like much outside...Yeah, it really is just an old-fashioned style diner. Yeah...so it serves up gourmet burgers, caesar salads, soups, etc....but I came here for one thing in particular.\n\nCHEESECAKE.\n\nI've seen a lot of cheesecakes. Maybe not all the cheesecakes in the world, but a lot. A single slice of any of Junior's cheesecake to order is,  no kidding --- the size of a 7-year old's tennis shoe, sans laces. A full grown german shepherd could have it be a challenge to down that in less than two bites. But oh, there is nothing wrong with a super-sized cheesecake. Never. Ever.\n\nI was standing at the gates of heaven at first glance at that strawberry glazed chunk of buttery white temptation...but ultimately ended up somewhere in a private room where Jesus and God must call their sleeping quarters...immediately right after my first mouthful of that creamy, buttery ambrosia.\n\nOkay, okay. It's a slightly exaggerated. It was not anything close to being a truly religious experience for the palate. However, I would certainly skip Sunday mass for one of these bad boys, and don't think I would have a hard time convincing God's best guys on Earth to do the same.\n\nAnother plus for Junior's? I paid less per square-feet of cheesy-cake goodness there than I would at any run-of-the-mill Cheesecake Factory location. AND I got my fill. Oh yes, I got my fill.\n\nNow to plan my next NY trip...", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "I never give 5 stars, but Junior's achieved my highest rating. Even though the restaurant's interior was basic, crowded, and noisy ... the service was prompt and the waiter was professional and pleasant. \nThe food was very very good.I had goulash and it was the best I've had in 20 years. The serving was so huge that I could eat only 1/5 of the meal. The rest went to waste and I felt badly about that. Then I ordered the red velvet cake to go and I had another wonderful surprise when I ate it back at the hotel. The cake was very light, tasty and very rich and sweet. What a wonderful dessert.\nWhen you go to Brooklyn, stop by Junior's and you'll be a happy person, indeed.", "author": "Chris E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "The dining environment is really nice. Even with lots of tables in one room, I didn't feel crowded. The combo Reuben is really good. But the beef burger is just so-so. The chef forgot to put any salt in it so it just tastes like an one-inch beef chunk without any flavor :/ Hardly finish it with pickles and marinated beets. Besides this, the service is pretty nice and food service is pretty speedy.", "author": "Janet K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Great atmosphere, good service and they play good jazz.  Omelette was super. $11 with grits, toast, juice and coffee and really clean.", "author": "Foodlove W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "It is Juniors. The wonderful thing is that it has not changed since I was a little girl in Brooklyn. I am now 63 and the memories exist. Thank you.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "If you're going to go to this restaurant, go for the cheesecake. The food here was okay but VERY pricy. You can eat your main-course meal elsewhere then go here for dessert.", "author": "Kerri-Anne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Yes I am a tourist but boy did I love Juniors! Recommended to us by locals we came for dinner, were seated right away and loved the while experience. Lovely waiter, Patrick, pegged exactly what I wanted, and this was the only place I found all week that had good local craft beer (Ithica Flower Power....yum!) Everyone enjoyed their meals, not gourmet, but damn good diner food. The cornbread was awesome! And of course the cheesecake! It is famous for a reason. Go eat where the locals and tourist mix. Great atmosphere, drinks and food, and topped off with the best cheesecake!", "author": "Dave D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "This restaurant should be on the places to visit in New York city just for its cheesecake. Undoubtedly the best original New York style cheesecake ever. Other deserts are great too.", "author": "Gibran K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Rarely do I ever give a place a whole four stars but Juniors deserves this.  My mothers decided to bring me here after giving birth to me.  Hey maybe the cheesecake craving kicked in, not sure.  I kid you not the cheese cake hasn't changed since I was younger.  Brooklyn has obviously changed for the good most people would agree, but this change has ran plenty of business out of business.  It's nice to see Juniors holding its ground. I'll always return.", "author": "Taaj F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-27", "description": "The food here is not a big deal. Honestly. \nThe cheesecake is good but I wouldn't say the BEST on earth. I've had better slices at little bakeries in Queens. Nothing to walk across the bridge for (Diddy is just crazy!).\n\nThe service here isn't all that great either. Pretty crowded every time I've been here and my waiters always seemed over whelmed to the point they couldn't be as lovely and pleasant as I wanted them to be.\n\nMy mom LOVES the wings and I hate them, (well, hated when I was a meat eater). It's hard for me to come across a chicken wing I don't like. It's an acquired taste though. Not a BBQ but not a buffalo. Something weird and I didn't like it. I suppose it's hit or miss though. You either love it or hate it. \n\nHonestly, after that little rodent scandal in the paper with the photo of the little guy hanging out by the cheesecake, I just got completely turned off to the whole place. I'm sure that was just some disgruntled  fired employee (from what I heard) but still. Once that image was in my head I realized I def wouldn't be able to come in here and sit and have a meal. ( I am deathly terrified of mice.)\n\nAnyways, nothing special. The cheesecake is cool but cheesecake is kind of hard to mess up. It's cold cheese. Put a strawberry on top and shove it in a box. Done.\n\nI won't suggest that you don't come here. I just don't go because of the crowd, the inattentive wait staff, and the mickey mouse pic. Feel free to try it out for yourself. You may love it.", "author": "Brittany A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "I had heard wonders about this place let me say they were right. Juniors has the best cheesecake ever and their food is very tasty as well.", "author": "Laura J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "The heart cheesecake. One of the best cheesecakes I've tasted so far. So chocolatey and decadent, balanced by the lightness of the cheesecake... chocolate chips surrounding the edges of the shape... dying to try more delicacies from this gem of a restaurant!", "author": "Roopa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-24", "description": "Junior's is one of those New York Institutions that you go to for one reason only... Great diner food and cheesecake. If you go here and order pasta or barbecue, you should be institutionalized! \n\nUltra classy and old school here. Wait staff are bow tie adorned and extremely friendly and helpful. Oldies playing over the system. Big comfy red leather booths. Simply put... you know those fifties style diners popping up all over the place, well this one hasn't changed since then.\n\nTo start... before you order you have coleslaw, pickled beets, and pickles on your table... and its good! The dinner rolls come next.... Wait wait wait! I haven't ordered yet... let me look through this thing. STAY AWAY FROM NONTRADITIONAL DINER FOOD, I cannot warn you enough. Don't get a burger, don't get ribs, or fried chicken, pasta, and all those other things that people who don't know how to order based on a place do... You won't be satisfied if you do.\n\nGET!!!! CORNED BEEF AND PASTRAMI COMBO ON ONION ROLLS!!! The most amazing lunch special in the world. Seriously two meals of mouthwatering brined and cured meats. Motzoh ball soup.... Good light and fluffy ball in delicious broth. Split pea is good too. Club sandwiches, or old school sandwiches (egg/tuna/chicken salad) are pretty clutch and hit the spot. Hit a reuben if you're really hungry.\n\nDrink: Egg cream!!!\n\nLEAVE ROOM FOR DESSERT!!! = Don't go crazy on your meal... bring it home, it's just as good the next day.\n\nIf you go to Junior's and don't get cheesecake, you must reevaluate your life and morality.... The endless choice of toppings will spin your mind... My suggestion, stay with the classics (RASPBERRY SWIRL!!! is by far my fav). \n\nJunior is one of those places that is a must go if you live in the city, and a must try for passers through!!! Don't worry, you don't have to rush, it aint going anywhere.", "author": "Ben G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Everyone must try the apple crumb cheese cake, truly awesome.", "author": "Hypha O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Great breakfast and they have grits! Had the corned beef hash with poached egg. Ton of food!", "author": "Stan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Junior's classic cheesecake is the best thing I've ever eaten.  Every time I eat the cheesecake, I have Meg Ryan's When Harry Met Sally moment.  The cheesecake is creamy and rich but not dense.  And, it has the right level of sweetness and saltiness.  I am convinced that my dopamine and serotonin levels rise when I eat Junior's cheesecake which enhances my experience and contributes to my level of enjoyment.", "author": "Lara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "I usually get the cheesecake which is the BEST cheesecake on earth. But this time i stayed for lunch. Good music, great atmosphere and great service. I love the hot wings, and the turkey burger is on point. Definitely a good balance here. I totally recommend coming here.", "author": "Elis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Walked Into juniors today with a friend to grab a bite to eat . From the time we walked in services was great , our waiter Andre was very helpful had us laughing the whole time we were there . That to me is great service were you can have great customer service with your guest.Food was good wish the mimosa was a Little bit more stronger but what can you do its juniors . I will return again ..... Thanks Andre for the morning laughs ( good luck in school )", "author": "Marsha L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}