{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "If you think you are an unchallenged master of cheesecake taste, or simply want to taste a gorgeous one, you should go to Junior's Restaurant. Less than 10 minutes on walk from Atlantic terminal train station, this place is a dangerous den of deliciousness: with more than 70 years of tradition, any cake, from the plain \"good ol' New York cheesecake\" to the crazy \"brownie passion\" (with all the love in between), there is wide selection of desserts and meals, all made with fresh ingredients from the kitchen! You can order to take out (one slice or a whole cake!) or sit down and enjoy the diner atmosphere starting your Sunday brunch with poached eggs on toast. Prices are affordable: from 8 to 10$ a slice or a whole cake starting from 24 to 40$ or more. This is a must go for every cheesecake lover passing in Brooklyn!", "author": "Alessandro B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "First Timer All The Way From Cali! And I Loved It!!! The Original New York Cheesecake Was So Bomb!", "author": "kristina w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "A Brooklyn fave. \n\nThe Great.\nThe food . The catfish was fried to perfection. 2 pieces of crispy on the outside and clean white on the inside. The fried scallops was my favorite. You get about 3 small sized scallops but they make them worth it . Very tender and very tasty. The fried shrimp , which is usually my favorite just simply wasn't the best . I love the buffalo shrimp with pumpernickel bread .\nThe corn on the Cobb was sweet. \nThe mash potatoes were creamy .\n\nI substituted the cole slaw for corn on the cob . I also substituted the fried Cod fish for the Catfish for a small upcharge.\n\nThe Bad.\nThey need to upgrade the interior \u0026 Keep a clean bathroom \u0026 I will happily give them 5 stars . The downsides to the experience. The women's bathroom literally smells of urine and seems to always have tissue adorning the floor. As a suggestion, an attendant? \n\nMy second visit in a month , next time I'm getting takeout .", "author": "Ayone D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Perfect diner for lunch and family dinner with family and friends in new neighborhood! I loooved the complimentary pickles and sauerkraut, i m russian and cant imagine life without it!!! We will be coming here on daily basis", "author": "Irene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "I've been coming to this place since before I was a teen and as an adult I still frequent this place with family when I'm in the area. I've come here for high school graduation celebrations, bday celebrations, dates and just plain ol' food and dessert cravings. Prices have gotten a bit higher over the years but that's any business. At one time the food portions were significantly smaller than previously but I went back after this time and felt that this was a one time occasion. \n\nOverall, it's a very nice establishment for a quality outing with whomever. Among my favorite dishes have been the meatloaf and mashed potatoes, ribs, wings and eggplant parmesan. I no longer eat meat so much so things might have changed over time (keep this in mind). Their cornbread is good too. Cheesecake will always be delicious but as my palate has changed (getting healthier), sadly, so has my love for cheesecake. But I will still get some for my family who loves it. I wish I had more photos from all of my times there but I just recently thought...hey I've been here more than enough times celebrating many occasions...its about time I finally write a review. Thanks for all the great times Juniors! :)", "author": "Tasha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-15", "description": "Usually come to juniors located on dekalb ave and Flatbush for breakfast. The gentleman placing the order at the take out station always has an attitude!! This is horrible customer service and experience!! Won't be returning here again!!! Too bad the breakfast deal was great!!", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "This was a tough one for me to voluntarily come due to its 3 1/2-Star rating. My colleague convinced me to go so I did. Hesitantly. Once we walked in I wasn't impressed due it's dated dining areas and level of cleanliness. The place was just dingy. \n\nI ordered the Pastrami Sandwich on rye and it came within 10 minutes. It was a meat monster! It was hot, juicy, and oh so succulent! I could really tell that it wasn't sitting under the heat lamp all day. Its texture and taste made me think it was just cooked. Service wasn't bad, and their food was great. I gave them a 4 because I didn't want to critique anything else but those two in this particular review. Call me a softy for NYC or Brooklyn, but it was good!", "author": "Omar M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Once again, I am not sure how I've yet to review the original Junior's! Five stars for yet another classic Brooklyn restaurant. First off, this review is for the bakery only- I have never eaten food from the restaurant side and probably never will- that is not what one goes to Junior's for.\n\nJunior's has the best NY style cheesecake for sure! It's pricey but so worth it. They have a variety of flavors and I've never been disappointed by it. My favorite is the apple crumb cheesecake and the seasonal key lime and lemon meringue ones! However, the classic strawberry, red velvet, devil's food, carrot cake and raspberry swirl are all top notch as well. \n\nThe other baked goods are worth a try as well- I love the strawberry shortcake, the cake consistency is perfect. I came here all the time growing up and look forward to it each visit!", "author": "Gabrielle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Truly worth the Uber to get here. Huge menu, nostalgic diner, feast selection of traditional diner food plus some surprises but the cheesecake WOW!!! Delicious.\n\nBig portions so you can share - prices high but of splitting it works. Delicious!\n\nHope to be back.", "author": "Cristina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "**Initial 3 star review dropped down to 1. Hope management fixes this so that I can increase the stars or fire the waiters doing this if it's not system wide.**\n\nREASON FOR 1 STAR RATING\n\nI just realized I've been scammed for over a decade because their bills automatically add 18% gratuity on the bill and then the final bill they leave a blank space for more tip with suggested percentages below which I never noticed. I questioned them just now and they said it's just on the receipt and that you don't have to give. So I basically told them you've been double dipping on me for all the years I've been coming? Be careful about TIPPING when coming here. I initially was going to give them 3 stars but I need to drop it to 1 for this deceiving bill which they have been duping me and everyone else for years... Now I know why the waiters don't care and can be as lazy as they want. Unbelievable...\n\nINITIAL 3 Star Review\n \nThis place has been around forever and their cheesecake is seriously good but heavy so be aware if your trying to finish it by yourself. It's a must try for anyone who has never been here but their buffalo wings are one of my favorite things to get here. Their Strawberry shortcake is pretty legit too. However, they need work on their customer service.\n\nI've been coming often for their breakfast since I live within 2 blocks and must recommend getting anything light on their breakfast menu which is just your regular diner breakfast meal but it comes with a delicious assortment of pastries and the butter they used for some reason is especially good in my opinion. I wouldn't recommend the smoked salmon Benedict because it's too salty and over cooked. Also, their take on French toast is very different because it is crusty which I do no prefer. However, I do enjoy their corn beef hash entree plus their dinner menu has gigantic portions which you can easily share with one other person.\n\nOne thing I do notice after coming here for years is some of the disgruntled workers here that are so rude when serving and taking orders. I tend to see it with some of the older waiters. It seems like they have tenure here and can't be reprimanded or fired because I see the way they act to their tables and if I was the manger or owner I'd fire them immediately.", "author": "David H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-14", "description": "Oh brother. I was really excited to visit the original Juniors... I went for dinner with my mother and we each got a soup and shared the pastrami sandwich. The sandwich was so dry that we couldn't eat it. The bread was stale and the meat tasted old. More like a jerky to be honest. The soup was totally average. Not really memorable. Especially considering this is an iconic Brooklyn staple. For desert we ordered the classic cheese cake which was actually good. It was a large slice (perfect for sharing).", "author": "Gabrielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "It was cool to say we came! The atmosphere was cool and laid back. Our server was nice. I ordered the cried chicken dinner. He ordered a 50/50 pastrami \u0026 cornbeef sandwich. Took the food 20mins to arrive due to the chicken, which was cool. I sipped a drink while I waited. When my chicken arrived it was fresh, but it was bland too. I dumped salt all over it. I nibbled on his sandwich it was good \u0026 fresh too. When we finished we ordered dessert up front, there was a crazy line up there and nobody was assisting patrons. I almost walked out due to the wait \u0026no assistance. But I got my apple cheesecake \u0026 coconut lemon cake which were  other good. I wouldnt need to go back again.", "author": "Rozalynn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-30", "description": "The food at Junior's was definitely underwhelming. The only thing that is good and worth getting is  their cheesecake. I also came here around 10PM on a Friday and it had a decent amount of people, but there were many servers that didn't have anything to do. When it was towards the end of my meal my server was gone for 20 minutes (??) and I had to flag down a manager. This place doesn't have the greatest service or food, but has decent cheesecake", "author": "Diana Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-12", "description": "First time finally eating at this restaurant after seeing it in front of my face for the past 5 years of my life. I heard that the prices were ridiculous but upon going in I realized that they were decent. I ordered the chicken and 3 shrimps and potato wedges and Cole slaw. However my waitress ordered the ribs instead and made a mistake, she corrected it about 8 min after. My partner also complained that the food was mediocre at best, the shrimp was possibly the best thing on the menu. For another tip to NY I will prolly try what they are known for: cheese cake.", "author": "Jordain J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "This review is strictly for the cheesecake. I stop by once every couple of months when I'm craving some cheesecake. My favorites are the chocolate mousse and classic strawberry cheesecake. Juniors are always consistent and always delicious so I would definitely recommend stoping by and taking a cake or slice to go.", "author": "Albert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "What a gem! If your hungry, want some reliable food, and don't want to wait hours to sit, come here.\n\nWe had the nicest server named LaToya. She was so sweet, attentive, and helpful when ordering. \n\nBefore we even ordered, we were brought VERY delicious warm corn bread, yeast rolls, and pickles. (You can skip the coleslaw and beets).\n\nMy friend ordered the pastrami burger. Perfectly cooked and served with awesome onion rings and fries.\n\nI ordered the corned beef omelette that was packed with lean corned beef, but a tid bit dry as they egg was over cooked. But, I still loved it and would order again.\n\nI need to find their tomato supplier- those sliced tomatoes are beauties!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "The Food is ALWAYS exceptional! Busy staff and busy restaurant, and its all worth the wait! Perfection at it's best.", "author": "Natasha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-10", "description": "Loved this place! Must visit and eat here when your in Brooklyn! Food was great and reasonably priced. Large portions too!\n\nUnfortunately we were to full for the cheesecake we originally went in to try! Next time!", "author": "Julie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-07", "description": "Triple chocolate is the one to get. A bit pricey at $9 a slice (same as Lady M), but definitely more body and everyman. The red velvet is also solid. The pumpkin cheesecake is a \"thank you, next.\"", "author": "Judy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-11", "description": "Come for dessert and that is it. The food has zero flavor. The food is not worth the price. Disappointed that I picked this place to eat on my trip to Brooklyn.", "author": "Sarah F."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}