{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "Was recommended this place for its cheesecake, but it delivered so much more!  Inside is a classic, retro diner with plenty of history and relics - without going over the top.  Authentic booths make it feel like you're back in time.  The service was friendly and quick, the coffee was nice and they made a pleasant fuss over our kids, which was lovely.  The cheesecake, as promised, was the best I've ever had!  Say no more! Yum!", "author": "Giles C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-19", "description": "I really wish I could give them No stars that how mortified I am with the lack of professionalism and customer service I received at this location. It's my parents anniversary so I decided to stop by and pick up a Slice of cheese cake for my mother $8.98 was the total point of sale purchase. I've been to Juniors many times and have used my card and have never needed my Id for a DEBIT card purchase . While I understand policies change there's still managerial discretion and courteous way to speak with people especially since as a customer I didn't know of this policy change. My car was parked 4 blocks away and on a meter all things I explained to Monica the Cashier and Dave the general manager and his idea of discretion was to be condescending and rude and refuse me purchase one a single slice of cheese cake. Monica turned me away rudely and pointed at a sign and shrugged  which is why I asked to speak to a manager thinking I would receive humanity and professionalism ...I explained to the manager I could understand a credit card but it's a debit card and I had two debit cards both with my name on it...he began to say if someone comes in the bank and does a withdrawal for 8.98 would you give it to them without an id and I said yes we don't ID under $100...he asked what bank and smartly replied \"that's why I don't bank there..well the answer is no you can't purchase this without you ID. As a long time customer it's truly disappointing that  I now have to give a formal complaint because of the poor customer service I received and the unprofessional tone I reviewed over a $8.98 slice of cheese cake. I will never go there again and will encourage all my friends and family to do the same. Customer service is exactly that, servicing the customers not being nasty and condescending. As a manager I would expect Dave to be professional and use his discretion especially for a $8.98 slice of cake. Expectations I clearly set to high even for a manager.", "author": "LiAna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "Eh. i've always loved the cheese cake but im not too fond of the restaurant. I thought i was in a nursing home upon being served corn bread and beets as a complimentary appetizer. However, attempting to remain open minded, i ate it and also ordered the buffalo shrimp which was ok. Overall i guess its pretty decent but i dont think it is a place for me. I will always return for some cake but never to dine in.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "#JuniorsCheesecakes #Brooklyn \"Pastrami Reuben\": Yo! I never thought I would walk to Brooklyn for some fuckin' cheesecake, but I did and I also got a sandwich.  Let me tell you, when you first walk into Junior's, there's a mannequin wavin' his hand at you, don't, trip! It caught me off guard, but I was automatically welcomed by a sweet waitress by the name of Liberia, she reminded me of Michael Jackson's song, and she was sweet as pecan pie.  She made sure we were seated right away and that our waters never hit the halfway mark on the glass b.  That's what I call first class service.  Anyway, I'm a Reuben sandwich kind of guy so I had to give it try nah'imsayin?  But it wasn't anything of the norm, they had Rueben's with pastrami, why the fuck not.  I also ordered some thick ass steak fries with it as you can see. Now normally, you get two halves with your sandwich b, but I don't know where the fuck they get their bread from but I got 3 halves b like I was in some hockey game or some shit nahmean?  It came with this sauce, I don't know what it was exactly but it probably was their house thousand island dressing sauce b, I wanna call that shit 'The Cayman Islands' dressing b cause that shit had me feel like I was in some tropical shit but really I'm in Brooklyn while its rainin'.  I took a bite out of the sandwich and I thought I saw Jackie Robinson, which I did but it was a picture on the wall, but what I'm sayin' is, the bite was so surreal, I thought I saw JR42 walkin' across the back and MJ moon walkin' on the table and shit, that's how good this shit was b.  When you can't finish your food on the table, that's how you know they take care of you nah'imsayin?  Where I'm from we call that shit the Samoan portions.  I didn't even take it to go, I felt so generous I wanted to give em back the 3rd half.  To top it off I had a red velvet cheesecake.  That shit was like Thugz Mansion and watchin' J. Lo fall in her Louboutins, the shit hit the spot.  I almost asked shorty to pass the Courvoisier but really I wanted milk.  Let me tell you, if you wanna impress ya girl man, like yo you tryna make her take off her panties soon as you get back to the spot, order the red velvet cheesecake b.  I'm serious.  That's an automatic panty remover son.  Overall I give this meal a 5.5 out of 7 rating b. #MoochEats", "author": "Marion E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I must admit, that I have never eaten a full meal here at Junior's. No. In fact, the few times I have come have been for dessert. Aside from a good memory of a group of 15 friends or so buying some cheesecake from Junior's before heading over to my place, I came here for some more dessert. \n\nMy friend and I, we sit down intending to have our cake today. I wasn't particularly famished as I had eaten before, so we only got some fried calimari before ordering our desserts. The calimari was good, great with the sauce. But of course, that was a mere distraction in the face of our real task.\n\nWe ordered ourselves the strawberry shortcake and the lemon meringue pie. Unfortunately they were all out of pie so we ended up getting the coconut lemon cake. \n\nWe started working on the coconut lemon cake, and it was nice. It of course was no lemon meringue pie, and it was a bit too sweet at times, but it was not a bad cake.\nHowever, the real star of the show was the strawberry shortcake. This towering mammoth of cake was absolutely brilliant. They give you a bowl to eat it in, and even then the whole thing was dripping and you get to pour the best strawberry sauce I've ever had all over your cake, JUST snglndsljkafnldsknfkl.\n\nYeah, it was a pretty good cake. Go try some.\n\n(Oh, and I also helped a family member get a custom cake from here, a really basic layer cake. That also tasted wonderful, and was well worth it.)", "author": "Mohammad H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-29", "description": "After walking the brooklyn bridge, me and my out of town guests were craving for something but our late lunch doesn't warrant for another full dinner.  Hence Junior's.\n\nI was impressed by the look inside considering they don't have much curb appeal.\n\nIt has diner like setting and the room was hardly half full at around 8pm.\n\nStick with the original cheesecake to experience their best assets.\n\nGlad that I can say that I've been to one of Brooklyn's landmark but next time I am craving for cheesecake, think i'll stop by Grand Central instead.\n\nNote that they have a $5 minimum per person.", "author": "Agustin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Are the per slice prices of the cheese cake the same at each of the Junior's locations or do they charge more for the Manhattan locations??", "author": "Cayo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "went here about a month ago... i had the jerk chicken, it was good as hell,ended it off with the famous cheese cake....very good...just needs to be updated and done over inside... but  i will go back....", "author": "Will S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-10", "description": "I wasn't expecting anything amazing from the food. I loathe their cheesecake (it feels like my arteries are clogging whenever I eat a slice) and their food tastes like mediocre diner food at best. But that's not why I'm complaining. \n\nMy waiter was not only rude to my boyfriend for no reason, but he was extremely leery towards me. \n\nWhen we first ordered, the middle-aged water was really nice as he should've been. When I asked for an egg cream to go with my goulash, though, he gave me this creeper stare that lingered for a few seconds too long. He kept on doing that every time he came over to our table, so I had to stop looking up at him whenever he sporadically refilled our water. By the end of our mediocre meal, our waiter was MIA. When he eventually came back to take away our plates, he basically called my boy a sissy eater. Someone didn't want to earn good tips that night, it seemed.", "author": "Jess B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-04", "description": "Okay review has been long over do country fried steak and mash is all I've had from this place besides the cheese cake and cakes but not the best cheese cake I've had...", "author": "Martin D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-16", "description": "Cheesecake, a 5 yes. Ok, cool.\nHowever, the food, mehhhh.\nI had the grilled cheese and it not only looked unappetizing it literally tasted like I was eating a huge pile of greasy cheese. This place is overpriced and running solely on the legacy of their cheesecake.", "author": "Sheryl H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-13", "description": "I went some time back, so this review is for that time. diner food, nothing outstanding, but b/c you're the famous junior's, \u0026 don't have better food/ attempt to improve it, is sad. cheesecake, very dense, tasted better the next day, w/ milk. service was super bad, barely saw the waitress, \u0026 @ the end, knew why, automatic tip added. I want that job!", "author": "Henry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "If you're not from NY and looking for thee New York Cheesecake, LOOK NO MORE!!\n\nMUST TRY: \n- Cheesecake\n- Red Velvet Cake\n\nATMOSPHERE:\n- Well Lit\n- Old school diner\n\nPROS:\n- Friendly service\n- Tasty sweet desserts\n- Open late\n\nCONS:\n- Don't order an Irish Coffee. The liquor mixture was a bit off. And I usually enjoy my drinks on the heavy hander side but, this was a bit much with the milk.\n\nGREAT FOR:\n- Catching up with friends and family\n- Late night cravings\n- Dessert dates\n\nCheers!!!! - Jodi", "author": "Jodi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-04", "description": "I cant eat a whole piece of cake. Cheesecake, regular cake, whatever cake. I have no sweet tooth, but I can admit it. For mothers day, I decided to send my mom, who lived in the midwest (small town) one of these. \"Oh this is from my son in new york\" I knew thats how she would preface every slice she handed out at work or home, and she likes to be proud so why not. She loves cheesecake, but her only degree of measurement has been wal-mart cheese cake. \n\nShe liked the cake. It was the sampler. She said it was huge, and very creamy. I would think that would be a good thing for a cheese cake, she wasn't as happy with it. For 42.00, I was hoping for more. I'm sure she was too. Take this review with a grain of salt, because it's second hand, but just make sure it matches the hype before committing to an entire cake.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Ok while their food may need some upgrading...I'm a New Yorker and I LOVE LOVE Junior's cheesecake!", "author": "Khalilah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "Service was good and the food was your standard diner fare. I expected a nicer, less dinerish place it being so popular, but no, it's a diner.\n\nTheir cheesecakes do rock, but I didn't have any on this trip and so the diner gets rated as a diner.", "author": "Carmen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Would eat here all the time if I could avoid the calories. Friendliest staff. Come inside if you want some authentic Brooklyn.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "I do not care if you are local or just visiting. No one tops the texture and flavor of the various cheesecakes that Junior's makes. One piece and your sweet tooth will be satisfied for.... well until you are craving great cheesecake again! ha ha ha\n\nIf by chance you don't live in the area or anywhere close to the state of New York you can actually order a whole cheesecake combo box with various styles delivered to your state of choice within a few days on their website. Yes! It's worth it! ;)\n\nhttp://www.juniorscheesecake.com/shop/corporate_login.php", "author": "Martin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "Order: Eggplant Parmesan on Linguine\n\nExpected: Roasted or grilled eggplant, maybe with some cheese, atop a delicate nest of linguine, garlic, and olive oil. A garnish of basil on the side.\nDelivered: Breaded eggplant, submerged in melted cheese. Over-cooked linguine in bolognese sauce pushed to the side of a 12-13 inch wide plate.\n\nI know it's a 'Traditional American' cuisine place, so I shouldn't have imagined Italian food done well - but would it kill to improve on presentation? Even Olive Garden, that we all know lacks authenticity, wouldn't have dumped the ingredients high school cafeteria-style. You'd think I'm hating on a cheap restaurant, but I'm not. That dish was $17.95. If it really is 'diner food' like other people said, why is the word 'restaurant' even there? What an insult to other establishments. \n\nThere is very little variety on the menu aside from sandwich, burger and breakfast options. Most everything is served with fries. So what if the cheesecake is good? If the regular fare is just mediocre, why on earth would I want to order dessert?\n\nService was 5 stars.", "author": "Debbie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "I had gone to the one in Manhattan a few times and loved it. I was a little disappointed with this one. The food wasn't as good. It wasn't bad per se. But it wasn't great either. I like the Manhattan location better.", "author": "Josh P."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}