{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "So I'm currently at juniors and this my first time i heard great things about this place .. And now that I am here the resturant did not reach expectations. Let's me start off with the service is horrible the manger ramen ( I could've spelled it wrong ) was at the door and stared at me before asking me did i want to eat. The server was rude and I felt rushed the whole time it's it crazy because it's 10:40pm on a Monday . My food came out cold and over cooked. I send it back and it was still not made correctly. It just didn't feel like a great dinning experience and it sucks coming a place well known like this but the desert are great", "author": "Chris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "Okay...hear me out...the reason that Junior's gets four stars from me is because it was pretty much a definitive part of my childhood. I'm knocking off one star, because they didn't have rugelach on my latest visit...And I'm as kosher as Anne Frank when it comes to getting me some rugelach!\n\nI'm not talking about the \"food\" that Junior's serves. Heck, until I was an adult, I didn't even know that they sold anything other than cakes and rugelach. When people told me that they went to Junior's for dinner, I assumed that they had noshed on cheesecake...and who am I to judge?\n\nI'm telling you, some of my fondest memories go back to when my mom would take me to Junior's to pick up a delicious Strawberry Cheesecake for a special occasion.\n\nAnd who can forget that episode of Making da Band when Diddy made 'Da Band' trek to Bk to fix his chzck craving? CLASSIC....And it's because it's that good people!\n\nI was down in this area today for a meeting at LIU and when I saw that red glowing Junior's sign...I knew that I had to pick something up.\n\nOkay, so the place wasn't as alluring as when I was a kid...and the bakery case doesn't seem as big or as full...and is it my imagination or didn't the strawberry cheesecake sides also used to have the crunchy stuff (and not just the top?). Either way, I wasn't here for decor or chicken wings! I asked for the small strawberry cheesecake to go ($19).\n\nI would have gotten a piece of rugelach to further relive my childhood....but they actually didn't have any while I was there! =(\n\nAnyway, I wrapped up my nostalgic moment and headed all the way back up to my Harlem home with my cheesecake...And it was just as delicious, rich and sweet as ever. Like I said earlier, it could have done with more crunchies on the sides, but I guess you can't be too picky these days?\n\nOkay, so I know that this wasn't really a food or dining experience review...But like I said, Junior's is one of the things that I'll always remember and associate with being a New Yorker...That being said, if you're a tourist, you'll probably think that this is NY Chzck heaven.\n\nOh, and why is a cheesecake place selling tongue sandwiches? Gross.", "author": "Carol B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Great food, you get most bang for your buck here. I usually order the cheeseburger platter, it comes with steak fries and two large onion rings. The stuff shrimp with crab meat dish is great also, but i have to be real hungry to order that, its alot of food, which is what i like about the place. They always, since i was a kid, gave good portions of meals. Always delicious. \n\nAnd  the desserts is great and always fresh. I love the devils food cheese cake.\n\nThe atmosphere is nice, friendly, family orientated, I love the pictures on the wall, alot of history from all New York. From pictures with Bill Clinton to auto graphs pics of Biggie.\n\nGreat place.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Best pastrami I've ever had. Fantastic cheesecake. (OH why oh why was I too full to have some cheesecake on my last visit? Darn it.) And why didn't we bring a cheesecake back home with us to Minnesota? Oh well, we'll be in Brooklyn again sometime soon, and we'll be sure to stop back in again. (And their matzo ball soup was just the comfort food my wife needed when she was feeling under the weather.) And the service has always been friendly each time. Don't go changing, Junior's!", "author": "Al I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "It's solid but wouldn't be my first choice or recommendation in the area, or even in top 10 for that matter, by any means. I understand it's a chain but it seems a bit too expensive for slow service. Food is tasty but greasy. Portions are a good size. Very conveniently located though for travelers.", "author": "Fareed K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "O-M-G! its like heaven! we went there for the first time and didn't know what to expect. the place was cute, it has that soda-shop feel to it. since it was or first time, and we had heard how great their cheesecakes were, everyone in our party order their on slice. we ordered a variety of their desserts becuz we wanted to try it all. and boy, did we try it all! we had german choco cake, strawberry shortcake, chocolate and regular cheesecake! we didn't realize the slices were so big! we probably could have shared just 2 slices between the five of us since we had just gotten done with dinner prior to going there. but i'm certainly not complaining becuz every bite of all the cakes were like heaven. if i remember correctly, each slice were approx $6-7.00 which is totally worth it!\n\ni know there are multiple locations in NY, but if you can, go to this one for the authentic experience!", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Junior's is what I think of when I'm imagining typical American food. Hubby and I stumbled across Junior's when we took a walk across the Brooklyn Bridge. We decided to go in as the prices seemed pretty cheap, it looked popular and we were after a more authentic American eating experience. \n\nWe definitely weren't disappointed! I had Southern fried chicken with mash and corn and man was the serving huge! The meal was very tasty but I could not eat it all! Hubby had a gigantic layered sandwich which he struggled with even though he's a big eater. \n\nThough we were full we decided to share a piece of their famous cheesecake and I'm very glad we did. The cheesecake was so tasty and we couldn't get over the size of the strawberries on it!\n\nWe'll definitely be back if we go to NY again", "author": "Katie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "I bought a brisket sandwich and a tongue sandwich.  Brisket was passable.  Tongue was HORRIBLE!  Customer service's solution was they were sorry and I should try them again.  No partial refund, no real apology.  Where is the 100% customer satisfaction guaranteed that they say on website?", "author": "Fern W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "A few years ago I started having Junior's cheesecake sent to my mom for Mother's Day.  My brothers would show up with baskets of geraniums, but I was the hero for sending such a tasty treat. Unfortunately, I live in a different state and never got to taste this cheesecake. My mom passed away last year. For her birthday I ordered a cheesecake. It seemed like a good way to celebrate and remember her. The cheesecake was awesome!! It was way too much for my two person household, so I cut it into 3 large pieces and froze them individually. Tasted just as good after thawing out. I think it was about $35-40 delivered.", "author": "Holly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Great service and classic ambiance. My kid and I really enjoyed our breakfasts. She had the lox Benedict's which were very good. My only complaint would be to have more of the damn tasty lemony hollandaise sauce on them. I had the corned beef hash which was also very good. Our portions were large but not stupid large.\n\nWe came back for dinner one of our nights and had enjoyed gigantic burgers that come with thick fries and two monstrous onion rings. We never got around to the cheese cakes which look delish.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Ohhh another childhood fav !! Omg I know I sound nuts ...but I go crazy for their pickled beets, pickles and bread basket lol these are given complimentary at a table when you sit to eat . I always get a cheese burger do I can't speak for the rest of the food ... the burger is old fashioned ny deli style ...\nThe cheesecake is  the best ... those juicy strawberries on top cant be beat ... love the chocolate cake too ! Ooh I want some pickles and beets now lol", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "I love going to Junior's.  I prefer going to the Brooklyn location but something settle on the Time's Square location if I don't have time.  Junior's still retains it \"Old New York\" feeling.  That is hard to capture in a fast paced environment in a big city like New York.  Even if just go for the cheesecake, you always leave with a feeling that you will return one day.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Went there for breakfast and had the French toast. Best French toast I EVER had. Asked the waiter how they make it and he informed me the nice outer crunch in corn flakes finely blended with a bit of cinnamon, then fried in butter, not margarine or oil. And of course I preceded to have a slice of EVERY flavor... I'm a tourist, I'm allowed to indulge . Personally the original and strawberry were my favorite, but my date loved the devils food and red velvet. To each their own, but can't go wrong with any flavor you choose.", "author": "cindy s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "I ordered the pulled pork sandwich (a September special) and it came with steal fries and fried pickles. The sandwich was good (moist and meaty); the fried pickles were pretty salty (and I typically like salty but for me it was over the top. Our server was attentive and friendly. Cheesecake was delicious!", "author": "Dana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-27", "description": "Everyone knows Junior's is where you go for New York cheesecake. That said, I've only picked up cheesecake from their Grand Central location. When I heard on the news this landmark was closing, we decided to pop over for a work lunch since we're nearby. The inside decor is definitely cheesy (it was decorated for Valentine's and it was 2 weeks past). Oh well, figured the food had to be as good as the cheesecake. Well, that's where it ends. The best part of the meal was probably the complimentary corn bread and pickles. Our table got a variety of the soup/sandwich and salad/sandwich lunch combos. All were flavorless. I got the tuna sandwich, which was supposed to come on challah bread (my most favorite bread ever) and what came out was some stale tasting yellow bread. Definitely skip the sub-par diner food and go for the sweets.", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "I've eaten at Juniors a few times and the fact that I never got around to reviewing it until today speaks for itself. The food is good, not great. The portions are huge and the trick to making the meal affordable is to split a salad or other entree with someone.  I have had the cheesecake which is good but a bit overrated and last night we had the ice cream sundae which was also good but not outstanding.  \n\nOur waiter while having to be reminded to bring a serving spoon, was very nice though he might have stopped by a little more often.\n\nRight now you can get in on a weekday night for dinner without too much of a problem but I wonder once the new arena opens how crowded it will be!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "Today is the first time I've had Juniors and it was the worse experience I ever had at an restaurant. I ordered to go a plate of jerk chicken and two sides. When I arrived home and started to eat, in my collar greens I bit into a bug. The first time in my whole life I've never had problems with bugs in my food. I almost passed out y'all!! I will never eat at Juniors again.  It doesn't seem like the cleanest restaurant in the first place so I should have known. Don't support this gross Juniors!!! Ain't no telling what you'll actually be eating. Sad day peeps...", "author": "Sharesa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Old school diner type restaurant with homemade dishes.  Coffee isn't refillable unless you get the special which is odd but they make up for it with unbelievable cheesecake!", "author": "Frank P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Juniors cheesecake has to have roughly a gazillion calories per slice but I just can't resist their creamy oh so delicious slice of heaven. One bite and you'll be blown away~ It's been roughly two years since I've dined in here so I can't recall my dining experience but I remember it being a decent one. \n\nFor $7; a slice of cheese cake is pretty expensive considering you're not in the city or anything but they do offer you a generous amount of cheesecake so no worries. I doubt you'll be able to finish the whole slice in one sitting though. Since the cheesecake is so rich and decadent, a few bites will leave you quite satisfied.", "author": "Shannon Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "I'm still going to say I like the cheesecake in the cheesecake factory better, but the ones i had here are also really good.\nthe homemade fries here though were simply incredible! \ni would consider going back for those!!", "author": "Namrata J."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}