{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "The best cheesecake. The Reuben was filling. The open roast beef was huge. The kids loved the bowl of beets.", "author": "Keith W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Red velvet is a must have!  Both a blessing and a curse to be only four blocks away from Junior's. Cream cheese-filled bites vs. self-control.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "I have been going here for years. Great late night meal! I always get few catfish nuggets or the catfish dinner mash, no gravy collard greens are the best I have ever had! Matzo ball soup delicious! That's why this place is the bomb!!!!!", "author": "Sadzia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-23", "description": "1973 was a very good year Juniors was ranked number 1 cheesecake no more. I went to school at LIU across street so had it pre and post fire. Was great pre fire after it started to go down . Now it's just holding on to it's old legacy.\nFood was well bland. Cheesecake nothing to rave about. I have had better at my spot in Manhattan and Bronx.\nI know Juniors is a legacy in the Resturant business with the expansion to GCT and TS is like a touristy thing now. When it was the one location food service and quality was much better.", "author": "Eagle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "After watching Matilda, we decided to eat at Juniors for a late dinner.  We had a party of 9 which they were able to accommodate with no problems.  We've eaten here numerous times and this place is very consistent.  Good food and good desserts.  They are known for their cheesecake which is very good...plain is the best.  Definitely nothing spectacular in way of meals but the service was top notch!", "author": "Sharon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-03", "description": "This place was so good we came here 3 times in 5 days. I'm not kidding. 3 times. \n\nWe always had a cup of coffee to warm up, and shared one variety of their world famous cheesecake for desert.\nThe first night we tried the Chocolate Mousse cheesecake. This thing was huge! There was a layer of moose at least 2 inches thick, and a layer of cheesecake about the same. It was very good, but also very rich. I'd rank it as my third favorite.\n\nThe second night we tried the raspberry swirl cheesecake. This was not quite as big, but still large for a slice of cheesecake and plenty for us to share for desert. It was superb and I'd highly recommend. \n\nOur third and final night, we tried the carrot cake cheesecake. We'd seen it in the window of the bakery the night before and couldn't help ourselves. This was the most amazing piece of cake I've ever had! It was also humongous. The cheesecake layer was at least 2 inches thick, and then carrot cake and frosting layers were another 4 inches, plus the creamy topping. I'd definitely get this one again!\n\nWe sat at the bar all three nights and had the same server, who was nice, talkative, and remembered us each time which was nice. \n\nThe one we didn't get to try was the blueberry cheesecake, which looked amazing. I guess that will have to wait for next time!", "author": "Krista S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "Got the open faced roastbeef delivered. Was very dissatisfied.  The bread was drowned in watery juice Gross! The juice/gravy didn't have much of a taste either.  And to top it off they forgot my fries. I didn't complain because it was an office retirement party luncheon. Overpriced glorified diner", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "My son and I were sat at a table by the windows facing the street. This made for nice people watching and enabled me to keep an eye on my car that I was sure I would get a ticket on. The waiter was friendly and didn't seem to mind when I told him we were only having dessert. We split a large slice of decadent cheesecake with strawberries on top. Delicious! I also had a cup of coffee that tasted very fresh. I will definitely be returning again in the future and my mom loves that she can have the cheesecake delivered to her in Boca.", "author": "Roxana J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Great experience! Great food! Friendly service! The portions are real decent and so yummy. The cheesecake ( specifically the carrot cake) is so creamy and delicious. Our waitress was a sweetheart and I honestly enjoyed the diversity of people I saw there. I will def come back!", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "What can I say? Still luvin' this place even after 5 years. Why did I stay away so long?!\n\nMy friend and I used to take the train from Manhattan at midnight during the weekdays to eat their apple crumb cheesecake, plain cheesecake, carrot cake cheese cake and strawberry cheesecake.\n\nI am ashamed to say that as I grow older, I grew tire of the journey to and from Brooklyn and the number of trips dwindled in number and soon, an entire year had passed since I haven't had Junior's cheesecake. What was I thinking?!\n\nI went back this past weekend and got their apple crumb cheesecake to go. I took a bite and all the great memories came back. Their apple crumb cheesecake hasn't changed! (If you haven't noticed by now, that is my personal favorite.) The crumble on the top gives crunchy contrast to the creamy, smooth texture of the cheesecake that melts in your mouth. Also, the apples are lined at the bottom of the cheesecake also adding sweet cinnamon apple flavor to the plain cheesecake. Yum~\n\nI definitely advise you to check out Junior's cheesecake. However, DO NOT eat their regular MEAL/ FOOD. it's TERRIBLE! JUST GET THE CHEESECAKE!! It is called Junior's cheesecake, GET THE CHEESECAKE!!! Especially the apple crumb cheesecake!", "author": "R Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-14", "description": "This is apparently one of the highest grossing restaurants in the US.  All the food here is meh, but you do get alot of it.  In fact, you pretty much get a whole meal worth of food mass before anything you actually order arrives, including pickles, cole slaw, cornbread, other types of bread, little pastry things, and pickled beets.  That being said, there are DEF better deli sandwiches in Brooklyn, and DEF better fried/soul food as well. (Theirs is tasteless and extra heavy on the batter.)\n\nThey get three stars instead of one, b/c of the cool bar scene here at night, in which you must be dressed in something snazzy and over 55 years old to hang out w/ your Henny.\n\nPS Yes they also have cheesecake here, as well as a full bakery of other pasteries.  Who really has room for any of these after all the food they bring you ?!?", "author": "Fadda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "The best cheesecake in America. The rest of their menu isn't bad either.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Totally a fan of their 10oz steak burger!  It was delicious.  I'm a bit of a health fanatic so i'm a bit picky when it comes to what I want to indulge in  but this place was a must and it did not dissapoint.  In fact, 3 out of the 7 of us had the steak burger and were completely delighted with our dish.  The others had a vanilla milk shake, spaghetti, chicken parmesan, a bacon burger, fries (which were steak fries) and sweet potatoe fries.  No one complained a bit.  However, I must say that I tried a sweet potatoe fry and it didn't meet my expectation - I've certainly had better.\n\nOne interesting aspect was that before we were served with our main course we were given a mix of corn bread, rolls, sliced dill pickles, vinegar cabbage salad and a vinegar beet salad.  I really enjoyed the cabbage and beets but didn't really care for the breads.\n\nService?  Well, it was awesome.  We were checked on frequently and the waiter serviced every request with a smile and timeliness.  Good job waiter!!\n\nAmbiance? Better than expected.  It's the holidays right now and Junior's was decked out with holiday cheer and holiday music.  We felt the joy and positive vibes.\n\nUnfortunately, we didn't try the famous cheesecake this time around but we'll probably come back in the next few days for that.  All I can say is that the slices are almost comparable to the Cheesecake Factory and i'm very certain that the calories are about the same as well.  :)", "author": "Natasha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Had a great time for dinner/dessert for my daughters birthday.  Food was tasty albeit priced high but the service was very attentive and courteous.  My raspberry swirl cheesecake was average but my wife's chocolate mousse cheesecake was outstanding. Would definitely return!", "author": "Tom A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-16", "description": "Went here last Friday with 3 friends.  We all enjoyed the milkshakes, but weren't really a fan of the cheesecake (I know, what?).  I grew up with the Sara Lee cheesecake in the frozen food section, and to be really honest, Sara Lee was better.\n\nI ordered the mac and cheese (heavenly), and the cornbread salmon.  I'm a salmon killer, but the cornbread and salmon combo wasn't my favorite.  The cornbread was awfully sweet, and I ended up scraping that off and eating just the salmon instead.\n\nOverall: Good, pleasant staff and fast service.  Not sure if has enough draw to bring me back again, though.", "author": "Plum E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "The cheesecake is absolutely delicious. The other desserts are good, but not up to snuff with their namesake. Went here with a small group on a weekend night and it was almost empty. Decent service. I love the atmosphere at Junior's!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Juniors is one of those places you have to go to.  Especially if you're new to Brooklyn.  As a native I haven't been to juniors in a while, but as soon as I walked in I felt at ease. As always the cheesecake was bomb, freshest cherries I've ever seen on a desert item.  The waiters and servers need to communicate better though, our drink order got switched a couple times and it was annoying.", "author": "Shari D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "Did you know they sell more than cheesecake at Junior's? \n\nMe, either. No idea!\n\nApparently there's a whole diner setup here, and if I had read some of the reviews, I would have known that ordering a sandwich for yourself is an exercise in futility and distension. There are small armies, both in quantity and height, that couldn't have finished that sandwich with three mouths and an extra plate scraper.\n\nWas it good? I dunno, it was a reuben and it would have made Sally at Katz's too freaking tired and full to do any faking it. How can anything still be that good after spending that much time eating it? But it was tasty enough and filling and most importantly the fries were crispy, which is, in and of itself, of mammoth import.\n\nIn other news, they have free refills on Diet Coke. Do you know how important that is to the decision making process?*\n\n* - Critically.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Good diner-type food, attentive service, clean, well-run.  A great asset in downtown Brooklyn.  And good cheesecake!", "author": "Jenna H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "Only reviewing the cheesecake:  I'm gonna be really forward here.  I think the cheesecake here is over priced, over rated, and over hyped.  but if you really need to try the cheesecake, strawberry cheesecake is the way to go.", "author": "Vincent L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}