{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Honestly, unless you are into really huge portions of ok food; skip the dinner here and just get the dessert.", "author": "maxl r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-01", "description": "Good food! Love their cheesecake! Staff here is like day and night. You can meet really nice professional ones, but you can also meet ones like he who has called me a nigger and suggesting that something is wrong with me, after messing up my orders on multiple occasions. So I wrote the Better Business Bureau! And brought them a copy.", "author": "Javin J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "LOVE the cheesecake. and The strawberry shortcake. And the devils food chocolate cake. the food is just ok. Pretty much, I would recommend the cakes and cakes only.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Juniors is a lovely family owned and operated restaurant and should be the pride of the brooklyn dining community. While there were issues with getting seats quickly, and our waitress, you can't argue with great food. I ordered their ribs and chicken BBQ combo and was floored by how good the sauce and meat was. They serve breakfast all day which I always appreciate in a restaurant, and had a pretty nice selection of american style foods. The atmosphere was interesting too. The walls display a pride for the brooklyn area, particularly the Dodgers giving it a very local feel. My one complaint would be the service. Our waitress moved insufferably slow. We got our food in decent time, however once we were done with our main course she was no where to be seen for almost thirty minutes. Juniors is known for their cheesecake which we were hoping to order in enough time to catch our flight home. We were there an extra hour than we should have been waiting for her to come by for our dessert order and our check after that. It did not seem terribly busy, and we received no apology for being missing, or any overly great attitudes from her. Because of her molasses service we missed our flight. She does not take away from juniors as a whole though. She recieved a deserved 2 dollar tip, and the cheese cake was SO worth missing the flight.", "author": "Samuel N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "how could anyone not have something good to say about juniors.! the best place in brooklyn!", "author": "Demo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "I would give 5 starts but I have experienced some pretty awful service here on more than one occasion. The cheesecake is great, and everything I have tried on the menu is always fresh and prepared just right! If you don't feel like sitting through a whole meal just to get a slice of cheesecake you can get one to take out!", "author": "Elizabeth A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "I literally come to this location once a week. My grandmother loves the food here so I take it upon myself to bring her here all the time (hey, I live in her brownstone....in Carroll Gardens....FOR FREE! Juniors is the least I can do). I can only review their burgers because I never order anything else....FOR A REASON!!!! Juniors steakburgers are definitely one of the best meals of my life! The portion sizes are HUGE and the burger will definitely last you at least two meals. I always always always get the same exact thing when I get here, the steakburger with onion rings, mushrooms, and 2 bottles of ketchup. Yup! That's right, I finish a whole bottle of ketchup in one sitting, guess that just adds to my overall amazingness as well as Juniors' amazingness as they gladly supply me with two bottles each time. Now, when you receive your burger, let me tell you, you might literally feel your arteries clog up and your heart stop as if it were really happening (bring Bayer, you never know!). The size of the meat alone can stop a heart...and those onion rings! Oy vey! They are definitely the biggest onion rings I've ever had and they're so....fluffy! Ugh yummy! One great thing about this location is they serve you DELICIOUS cornbreak, cole slow, beats, pickles, and fresh buttered rolls while you wait for your meal. UNLIKE the location in Times Square who jack up their prices $5-$7 more for the same meals in Brooklyn AND they do NOT give you anything while you wait for your food! Wtf! If people pay more, shouldn't they at least get the same amount of food as they would in BK? TImes Square and ripping off tourists....and NYers who happen to want to have a touristy day...typical!!\n\nBut, all that aside, who can forget the cheesecake! I know there was that news article that came out a few months ago that showed a mouse in the cheesecake display case...but are we to really think that our food in EVERY NYC restaurant is perfectly kept with not one hint of any type of insect, animal, or even the floor touching it?? I think not! Anyways, Juniors cleaned up the place and got it up and running again (don't worry, I didn't take my little old grandma to that place for 2 months until they got the exterminator in there!). But, did you ever wonder what heaven would taste like if it were edible? Well, here's your chance! Order a slice of Junior's cheesecake and come back and write a review about heaven, the rest of us who've eaten that cake will understand completely!", "author": "Smalls D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-24", "description": "So this is where it all began.  Now I know why there are copycats in Grand Central and Times Sq... it's pretty good stuff.  I came here for dinner on Tuesday and they have a lobster special on Tuesdays... did not get that, but was tempted.  I instead ate their fried steak-- i loved the cripsy crust, though the steak could have been a teensy bit more tender, but now I'm just nitpicking.  I'm not really a gravy person, but that was excellent gravy poured on top of the steak and on the mashed potatoes.  Unfortunately, I ate so much of the dinner I had no room for dessert.  I ended up taking a slice of their famed cheesecake back to Queens. It was quite delicious, even after a 40 minute ride to home.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-06", "description": "I have had the cheesecake a  bunch of times and it is very good but i have had better. I prefer the plain -the fruit they use does not really do anything for me. if puff daddy every told me to walk across the brooklyn bridge to get him cheesecake from junior's while singing juicy i would first tell him to eat my ass then walk to isgro's  in philadelphia while singing digital underground.", "author": "Erik s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "This is, by far, the best cheesecake I've ever had. However, you should skip the other food. Cheesecake, awesome, other food, meh.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "The cheese cake, the Red Velvet, the Carrot Cake, oh my! Their bakery is divine.", "author": "valda6"}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "I entered Juniors with cheesecake on the mind, a couple hours later I left. I wish I could say this was due to rapt enjoyment, lingering to chat long after my meal. Alas, poor service was to blame.  The food was everything one should expect: a bit greasy, large portioned, yet wonderful. The cheesecake is great as well: a solid, hunking piece that fits the bill for such a classic confection. But when our bread basket never arrived, our beverages were forgotten, and our bill brought begrudgingly Juniors slipped in my esteem. This is the kind of restaurant that ought to be reliable. Its not unexpected nor out of this world, but it is comforting in its consistency, so when that consistency falls short its a disappointment indeed.", "author": "Caitlin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "The food here didn't sound that exciting....but they definitely have the best cheesecake I've ever had. I got pumpkin cheesecake, my dad got carrot cake cheesecake, and my sister got strawberry cheesecake....all were amazing.", "author": "Molly R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-22", "description": "Junior's cheesecake vs. Eileen's cheesecake\n\nFIGHT!\n\nOrdered a pineapple cheesecake \u0026 despite being so darn full from lunch, I enjoyed every. single. morsel. of. that. darn. fattening. but. oh. so. delicious. cheesecake! :D\n\nWinner: Junior's hands down!", "author": "B .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "One thing to say, best cheesecake EVER! I also like their massive burgers and fries, but you need to bring a friend and share so you have room left for a huge hunk of that amazing cheesecake. I am a cheesecake purist so I only ever get the plain, but they also have flavors to satisfy any craving.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-10", "description": "What can I say? Wisdom of crowds and all that: the cheesecake here really is transporting, as would be the forklift required to cart me home if I'd had an entree with it. They look awfully big. Three stars on the assumption that the food might be reasonable.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "i'm a cheesecake whore, and i loved it when i went to new york in 2002. i loved it so much that must have walked over to juniors (how lucky was i that i was staying at my aunt's house in brooklyn, merely footsteps away from juniors. niiiice.) every day for a week that i was staying. the strawberry cheesecake is the best i've ever had. i don't think cheesecake factory's cheesecake is as good as junior's, but then again, you have to travel to new york to get junior's and there's a cheesecake factory conveniently in almost every city imaginable.\n\nanyways, i actually found recipe for junior's cheesecake online, and it's the only cheesecake i make... if i have the time. it's extremely time consuming, and it's got a lengthy ingredients list. it's REALLy good, though, and worth the effort.\n\nmy fave. part about the cheesecake is the crust. i've never had a cheesecake with an actual cake crust before. it's fantastic. it's a must-go if you go to new york, and don't knock the neighborhood... it's not THAT bad to be in brooklyn. hey, i stayed there for a week and came back to l.a. just fine. =)", "author": "Rachelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-01", "description": "The food here is ok. I got the something different which was pretty decent. The portions here are big and the service was ok. The cheesecake here is simply the best cheesecake that I've had and is what pushed this from a 3-4 star rating to a 5 star one. It definitely beats cheesecake factory cheesecake any day.", "author": "Jenn N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "I first tasted this when someone shipped original and raspberry swirl to my ex-boyfriend's workplace.  I sent one of my best friend's the cherry crumb cheesecake for her birthday.  She had to hide it from her family, then herself in the refrigerator.  My favorite slice is the chocolate mousse because I love chocolate chips and ganache.  Should I try the brownie marble swirl?", "author": "Ai M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "They have the best cheesecake I've ever had..it's amazing, their aren't enough superlatives in our language to quite capture the glory of their cheesecake. That isn't the only good stuff either, the other food is very good..I especially like the brisket sandwich..", "author": "Peter F."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}