{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "I love their strawberry shortcake but whenever I order food I'm disappointed.\n\nThis time I ordered pancakes for takeout. Just 3 regular pancakes with syrup and bacon, and I got these. These are NOT what I picture when I say pancakes.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "Pretty good breakfast options. Love the feel of this place.", "author": "Samuel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "I don't go here for much other than the cheesecake and it never disappoints.  I prefer the plain, but the strawberry is wonderful, and pineapple so so. They have a devils food cheesecake that is completely to die for if chocolate is your thing. \n\nThe staff is always happy and friendly and helpful.  If they fail to give you your receipt, call the manager because your order is on them! \n\nWhile in Brooklyn this is a must try.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "What?! Cheesecakes everywhere! From left to right and back, it is as if you were having a buffet surround by cheesecakes. Right side filled with whole pie with each level divided into different size and price inside the glass refrigerator. While on the left side, the glass refrigerator filled with single slide package in plastic boxes. It is like a cheesecake heaven. If you wanted try something famous here in NYC then Junior's cheesecake is definitely a stop before going back. One located in Manhattan, Time Square(New) and another one at Brooklyn, Fort Greene. \n\nThis is definitely a tourist trap, nothing else is good except for their cheesecake. The food was decent compare to other America restaurants so do not come here for the food. The services here was also not so great. Overall, do not waste your money here and go somewhere else for a better meal. \n\n If you are here, then definitely get a slice or the whole cheesecake to share. Their single slice is pretty big but they are not cheap either. A plain cheesecake costs around $8 with taxes and a strawberry cheesecake will be around $9 and that is definitely not a good price. The cheesecake had a good flavor and texture which is different from others. I believed for the price, you can get a better cheesecake but this is NYC so everything here is extra expensive for no reason.", "author": "Zhang C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I've been eating here for years. It's always a great experience. I love their food, drinks and of course the cheesecake. I love the milkshake with the slice of cheesecake on it. It's a lot but I had to conquer it. Junior's is a big deal in Brooklyn and I will always stop in for some good food. Stopped in on the way to a Brooklyn Nets game. It was easier to park Downtown Brooklyn then catch the subway to Barclay. I ate good so I didn't have to worry about food or drinks at the game. There are plenty of shops in the area so it's a great place to spend the day. The menu has something for everyone. I love the corned beef sliders. My favorite cheesecake is the apple crumb and one of these days I'll order a cheesecake and have it shipped. This is a legendary spot you don't want to pass up.", "author": "Celeta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Been here so many times, it's hard to remember now many. I don't remember having a bad experience with service or food. Professionally managed. Some servers has been here for years. \n\nI've had brunch, lunch, dinner and take-out from here. I've stood in holiday lines for Thanksgiving and Christmas. Always the plain cheesecake. Still best in the city! \n\nToo bad I don't work around the area anymore. Junior's is a classic.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-20", "description": "Junior's Restaurant has been around for as long as I can remember. My parents would come here all the time for celebrations. Over the Summer I went here about three times and I always order the barbecue half spring chicken with potato salad mac, and cheese, garden salad and extra corn bread. Well my last time here the food was not so good. The chicken was reheated with stale barbecue sauce that taste like old ketchup. The potato salad had undercooked potatoes and my corn bread was cold and hard. I am not sure if there was a different cook that day or an off day or that Junior's just fell off completely. I do know it turned me off and I will not be going back for a long time.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "I'm writing about a very special waitress, I am so sad I don't know her name.   She was working around 3pm on a Saturday afternoon a few weeks ago.  She has long black hair, medium build.   My son was in short, being a pill and I was very upset.  I had to run home (down the block) to get something he forgot and I was really flustered.  When we left, my son accidentally left 40 dollars and a metrocard on the table.   I ran back to Junior's.   I felt like such a mess.  When I walked in this waitress opened her arms, gave me the money and the metrocard and she said \"it's going to be ok\".   Can I just tell you how much I needed that?  She could have judged me but instead she knew I was stressed and that I needed some warmth and understanding.   I will never forget her.  My son was also moved by this.  The food was great, but she is an angel.  Thank you so much!!!", "author": "Brenda L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Ah, Juniors. I have childhood memories of family outings to this place where... each time my father would flip his shit over a non-issue, embarrass the family and ruin the evening... Anyway:\n\nJUNIORS! I remember loving the Meatloaf here as a child, and since work had forced me all around the city all day.\n\nThis was one of the only places open to eat so it was time to relive those childhood days... of disappointment! \n\nThey don't have Meatloaf anymore, so I had the roast turkey. I wouldn't call it GREAT, but I wouldn't call it the BAD. The price was about twice I'd pay for such a quality; even though single plate could feed a small Rwandan village, spending 30 total dollars for a meal of middling quality left a bad taste in my mouth, but not as much as the giant stomach ache I got 10 minutes after I ate, so for that; 2 stars.", "author": "Marco L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "This is the one off old and well known place and I'm so sorry to see they have this rude and lazy waitress I'll never ever go there again.\nI wish I can speak after all these years they have still same quality and good service.\n\nMy waiters name is Adriana\n\nThird generation business owner Mr Alan reached me and ask me about my visit having same business third generation I really appreciate and wish them best.", "author": "Alex V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Always a pleasure to visit Juniors. Huge portions, a walk through history and friendly atmosphere. \n\nWe always get classic eggcreams with Fox's Ubet syrup. Real Brooklyn classics right here in Brooklyn.", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-02", "description": "Totally incompetent customer service. If you can, pick up your cheesecake, but don't bother trying to get one delivered. Nobody seems to know how to process an order.\n We got a gift certificate from a friend for a cheesecake. First we tried to order online, then that didn't work, so we called. The phone person didn't know, so transferred us to a person who said we couldn't do certificates online, you had to mail it in. So we mail it in and no response -- call again, since it's been 4 weeks. We get passed around to 4 different people none of whom said the same thing but at least one said you had to do it online.  One said we called the wrong number -- shame on us, we called the number on their form. Clairvoyance isn't one of our superpowers.   \n\nCustomer service here is absolutely clueless.  6 people later we're told, \"call tomorrow\".  Ugh.", "author": "John W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "I had heard this was the location that the hit MTV show from the mid 2000's \"Making the Band - Season 1\" with P. Diddy made the band walk to in Brooklyn to bring him back some cheesecake from. It was a block away from our hotel and when we walked in, immediately you're overtaken by the different flavors of cheesecake displayed in the entrance. There's so many different flavors to choose from. We went 2 nights in a row because on our first night, the food was just so good. Unfortunately, there isn't a lot of vegetarian options on the menu nor a lot of seafood. I opt'd for the Tuna Melt which came on a large english muffin with 2 slices of cheese on top, sided with some fries, slaw, and pickles. The tuna melt wasn't the best. I ended up not finishing it because it just wasn't as flavorful as it looked. The slaw, very dry. This is far from southern cole slaw that I am use to. The service is good and quick but most of their waitors seemed to be foreign so at times it was a little hard to understand them. I found that weird only because Juniors' is an American food establishment. Would I go back again. Honestly, probably not.", "author": "Victoria K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "I've head a lot of great things about Junior's and was thoroughly disappointed. I seemed to be looking around for my waiter most of the time instead of enjoying time with my friend.\n\nThe side dishes they served were interesting...they gave us warm (and bland) coleslaw, pickles, and beets (each in their respective monkey dishes. The beets were actually delicious. I just wanted to add this because I've never been served beets before!\n\nI ordered the Tuna melt, which was cold, and sweet potato fries, which were good. My friend ordered an omelette, and OH MY if that was not the biggest omelette we've ever seen, and it was good. That was the only item worth the price. For the price and service alone I will not be back.", "author": "Abs M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "So we were told by many people we HAD TO come for the best cheese cake in NY. It was good but that's not why I'm giving 5 stars. Not sure if because wife and I were \"starving\" exploring NY for the 2nd day and we were having a very late lunch but the cheeseburger I got was one of the best burgers I've had. The decor was very interesting, the place was packed at 3-330 but well staffed and we were never waiting for anything. Our server was Blu and she was great! She helped me decide between the pastrami and burger; very good at making sure we (and from what I observed, all her customers) were good; and she was also the right amount of cheerful, but not fake about it.\n\nShout out to other servers who were dealing with what seemed like a very obnoxious, difficult customer who was seated next to us. Although they couldn't quite hide their displeasure with him, they were still very professional and didn't kick him out.", "author": "Donald R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Amazing service. Servers quickly approach you and give great recommendations. The meal portions are very large and I ended up taking the rest in a take-away container and finished the rest later. You'll definitely leave full and get your moneys worth. ALSO get a cheesecake slice for dessert or take home!", "author": "Ahmed A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "Good vibe place but I was not very fond of the staff. They weren't the most polite people but the quality of the food made up for it.\n\nThe portion sizes were tricky and it's hard to tell how much you'd get (even after asking). They have lunch and dinner sizes and the prices range 20-$35 for a plate.\n\nThe cheesecake was good as well and worth a visit.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "My friend \u0026 I were looking for a place to have lunch. We decided to eat at Junior's. I heard so much about the restaurant \u0026 learned that they're famous for their cheesecakes. The service was very good. Very polite \u0026 courteous. Their food is so good. When we tried their cheesecakes,we understand why they're so famous. Different kinds to choose from. If you're in Brooklyn \u0026 want to enjoy delicious cheesecake,Junior's is the place to check out. I highly recommend it.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "There is no other cheesecake in the world that compares. None. I had a slice of the apple crumb cheesecake, which had a later of cinnamon apples under their cheesecake along with streusel crumbs layered on top. It's a rich cheesecake, without being overwhelming or decadent. My favorite is probably still the plan with pineapple, but this one is still really great.\n\nFor lunch, I had a roast beef and turkey combination sandwich on an onion roll. I got two kind of medium sized sandwiches, larger than a slider, but a little smaller than a typical round kaiser roll. The meats were flavorful and moist, and the Swiss cheese was melted on top. I added a little of their deli mustard as well and it was a very enjoyable lunch. The fries were ok, nothing overly special though. Not really worth the extra $2. It's also very cool that they serve free vinegar slaw, sour pickles and beets to your table as well.\n\nPrice was about $70 for two people (two sandwiches, two soft drinks, two desserts, one coffee). It's high, but it's NYC, so you just suck it up.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "Awesome cheese cake enough said lol! They have good food huge portions and did I mention the cheese cake!", "author": "Dennis E."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}