{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-15", "description": "I don't think it lives up to the hype, but that is just me.  I had a grilled chicken sandwich for my dinner and it was good but how can you make grilled chicken bad?  It wasn't anything outstanding.\n\nI also had a slice of the cheesecake.  I am also of the gram cracker crust camp.  The cheesecake was good, but I didn't want to have sex with it like I do when there is something I really like.\n\nGlad I came to experience a Brooklyn institution but if I never had their cheesecake again, my life wouldn't be lacking or anything.\n\nNot bad... but certainly not great.", "author": "Ms T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "I really miss you brooklyn.\n\nI'm a plain girl and I like plain cheesecake especially from Junior's. As a Californian living in New York, I needed a car. As a dumb Californian, I drove to Junior's. Parking is a total B and you might lose a leg or an arm trying to get into your car on that busy street. \n\nThe cheesecake is so rich and creamy and tastes SO FRESH.\n\nI will always love you new york!", "author": "Anhers M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "i was in junior's restaurant last week with my girlfriend. we ordered chopped steak and burger.. chopped steak was amazing .. burger was okay.. more importantly price was extremely cheap.. i was expected over 100 dollars bill at the end of the meal . but bill was 50 something.... we really enjoyed it.. service was friendly.. place was not crowded .. perfect place .. I highly recommend it!.", "author": "Shawn T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "It was actually a very bad experience, and being a foodie its safe to say this is one place you might want to avoid. I had ordered a cheeseburger and asked for it to be cooked well-done. We waited for our food for about 30 minutes and once it arrived I was faced with disappointment. The burger was extremely dry and not cooked very well. The onion rings were just bland and everything about the burger was just horrific. I had paid about $14 yet I only finished the fries and left the entire burger practically untouched. The only good thing about this place I guess was the cheesecake but then again I could have gotten a cheesecake just as good somewhere else for a much cheaper price. So all in all I spend about a little over $20 for a couple of fries and some spoonfuls of cheesecake. Not worth anyones time tbh.", "author": "Nishat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "Came here with a couple of my co workers before our flight back to San Francisco. We heard the Cheesecake was the best and surely enough it was delicious. Unfortunately I knew about this place after I had grabbed lunch, but if I were to get a chance to come back I would definitely try out their entree's it sounds good. So I'll do a follow up review later.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-16", "description": "Oh whoa is me... my boss just left us to move back to the east coast.  And it's been a sad time to see him depart.  And although it'll take some time for us to get over this loss... he so kindly reached out to help us mend our hearts a little with a variety of cheesecakes from Juniors in NY!  My first thought when I saw the email was, \"hmmm cheesecake all the way from NY?  It must be good for him to send a couple of them to us here.\"  So off I went to try some.  \n\nI wasn't able to grab a sample of each flavor he sent... that would just be too much =x hehe... so I got a sliver of Tiramisu and a sliver of Chocolate Mousse.  And as I sit here and write this review, I'm thinking the Tiramisu Cheesecake is gooooood.  There's this crunchy layer in it that I'm enjoying and overall it's making my palette happy.  =) BUT... the sliver of the Chocolate Mousse cheesecake, I'm totally dying over right now.  It's cold, it's smooth, it's melty and it has chocolate chips around it.... mmmmm... delicioso!!  Chocolate's my thing yo!  \n\nDefinitely a place to consider next time I want to send someone something or have something yummy for a special occassion!  I'd go right in there if I could, but perhaps next time I'm in NY.  =D  That's not to say the Bay Area doesn't have good cheesecake, because we have some bomb diggity choices around here, but something different is always fun!!......... oh wow, yup, just took another bite of the Chocolate Mousse... n omg wow!!  still good... maybe even better than the first bite.  =)  My palette thanks you boss man!!!", "author": "Jo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "I love cheese cake and this place has best cheesecake period! Believe the hype!  My new favorite is the Red Velvet cheesecake.  The 5 star is review is for the cheese cake only because I never had their food.", "author": "Junior L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "So my last night, my girlfriend and I went to Brooklyn to have some YUMMY cheesecake from Juniors!  I'm pretty picky when it comes to cheesecake and for the couple of years I lived in NYC, I never found a place that made it well.  You know, creamy, rich and cheesy!\n\nJuniors has it all covered.  My favorite is their strawberry and their plain.  I had there apple crumb which I wasn't really a fan of, but it was still very good.  They also have red velvet cake which I do not recommend, as there are a few other places in Brooklyn that make the red velvet far better.\n\nOverall, I love Juniors and I recommend them if you're ever in the big apple and in the mood for some good NY cheesecake!", "author": "Kat A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "I really enjoy eating here.  While the food isn't overly special, I will say that it is very good with a decent amount of selection.  Junior's as a whole is one of those places that I take out-of-towners when they visit me.  The cheesecake is wonderful, but the cakes tend to be a little over iced.\nA +/- of Junior's are the portion sizes.  If you are eating there by yourself, it will be too much for any decent sized human being.  If you are with friends or family, you can easily split most of the meals between two or three of you.  Saves you some $ too.", "author": "Corey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "Try the chocolate mouse cheescake it is the best.  My suggestion is don't buy the individual cheescake slices prepackaged to go it is sometimes not so fresh.  I also recommend the sandwiches on the twin rolls, you get more for your money and will probaably take one home for later, my favorite is the cornbeef, turkey, tongue with swiss cheese and russian dressing awesome!!\nBottomline is Juniors is Brooklyn and the service and location are great, allways a good time.", "author": "Jon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Strawberry Cheesecake. That is all. I ate here once and realized this place isn't for food it's for best the cheesecake in New York!!!", "author": "Yovi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-15", "description": "Aside from the rat incident in the fridge..\nthe place is cool.\nI've sat down and eat a meal, \nfood=average.\nservice=average.\n\nThe dessert counter..\nCheesecake=awesome \nEXCEPT for the RATS", "author": "Kwame J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-07", "description": "I love cheesecake, but maybe not this kind. Cake is the crust, and there is no sourcream topping. It is just a slab of sugary cheese. (Not to say that I didn't eat it all!)", "author": "Sagruilla P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "My friend Collin stopped by here on the way to a dinner in Brooklyn and picked up the heaviest cheesecake ever!  It was like a weight it was so dense but man it was rich.\n\nThe two tiny young Italian girls at dinner were somehow able to eat massive amounts while I could barely finish a small piece.  It was wonderfully rich though so probably just as well.\n\nTo top it all off, all I actually had was the cheese-pie - not even the full-on cheese-cake which Collin insisted was bigger and better.  I am not sure I can believe that there's a larger richer version, but I think I'm willing to find out next time I am nearby and starving!", "author": "Gene X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "Didn't get the chance to eat in but order a cheesecake to go for a bbq party. It's my first time eating it since I'm new to NY, but this was one good cheesecake. Very Creamy and melts in your mouth. Writing this is giving me an itch to go back. Next time, I have to dine in and have another cheesecake.", "author": "C C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "I don't often indulge my taste buds to the heaven sent oh-so-fresh strawberry cheesecake, but when I do, that moment stays with me for a long time. And don't talk to me while i'm eating it! My taste buds go through a moment of bliss, almost similar to a flavgasm! (Yes, I created that word)\nThe red-velvet cake is flavgastic as well!\nI don't know much about the restaurant, so I won't comment.", "author": "Jess D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "Ok - they have EXCELLENT cheesecakes!  However, the food is not all that.  I suggest purchasing a slice/whole cheesecake to go instead of dining in.  The same goes for the other two Jr's in Manhattan (Grand Central \u0026 Time Sq).  \n\nThe 5 STARS goes to the cheesecakes!  I'd give the restaurant/food a 3.5.  =)  Enjoy~", "author": "Meay T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-20", "description": "My brother Ken would be upset that I'm only giving Junior's 3 stars, but for good reasons. When he first took me there 20 years ago it was THE place to go for cheesecake and the atmosphere as a whole. Like bagels, though, you can find great cheesecake in many places outside NYC, just like you can find the great sushi outside of Tokyo.\nStill gotta luv Brooklyn though...\n\nplease visit\nhttp://kennethgarywicht.blogspot.com/", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-30", "description": "This is some damn good cheesecake.\n\nMy favorite thing about the original is the cocktail lounge. Old school vibe with nice folks willing to talk to you if you're sipping on a whiskey.\n\nOtherwise I don't do the food. It's for cheesecake.", "author": "carl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "I LOVE JUNIOR'S!  Tom Robbins had it right when he said:\n\"Who knows how to make love stay?\n\nTell love you are going to the Junior's Deli on Flatbush Avenue in Brooklyn to pick up a cheesecake, and if love stays, it can have half. It will stay.\"\n\nThe strawberry cheesecake is heavenly and the flatbush avenue location is worth the trip.  The atmosphere is totally obscure at the times square location.  Seems really unnatural.  Go to flatbush, the original.  If I'm in manhattan though, the cheesecake is worth the awkward chic atmoshphere.  I wish they were open later!", "author": "Rachel C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}