{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Good food with a good deal. Not very pricy. Roomy, great service and easy parking space. Cheese cakes are very delicious.", "author": "Yu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Amazing cheesecake! I came here about 9 years ago while visiting NY. Now that I live here, I was eager to return and it was just as I remember it. Very very good!", "author": "Fabiano M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Deeeeeeelicious. Open face roast beef sandwich was enormous! So tasty. The plain cheesecake is to die for. Staff was so nice. Matzo ball soup was different, but good. Love all the little pickle and beet apps. The rolls?! Also ahhmazing. Would come back here every time for this great food.", "author": "Tessa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "I been here a couple of times before but most recently I came last week with Lapin for brunch. When we arrived there wasn't much of a wait and we were seated rather quickly. Except, we got squished into a corner seat right near the cart where they put used dishes and glasses. Every time, they made a new deposit into that germ-ladden container our conversation would get cut off by a loud clank or food/water sprayed on us. Oh, why yes, I would love garbage with my meal...\n\nLapin ordered a coffee and our waiter who was sick and coughed several times without covering her mouth was efficient in the beginning but towards the end --- she forgot we were even there. We waited 35 minutes after asking for our bill four times. Lapin remarked that they were trying to keep us as prisoners. \n\nLapin got the Old Fashioned French Toast with sausage and I got two scrambled eggs with fries.  The food was okay but for the price I thought it would have been a bit tastier. I feel like for the price and the quality, you could get similar food at a diner for a lot cheaper. Perhaps, it was just what we ordered and should have gone for lunch oriented menu items like we have done in the past. \n\nHowever, their strawberry cheesecake is divine and is definitely worth a trip to try their cheesecake.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "I really very much wanted to give this place 4 stars. However, the service I received when I was here forced me to have to knock off a star for the time being.\n\nI went here mainly for the cheesecake but ended up having an entire dinner here. I got here on a Friday night around 7 PM and I was starving from having walked all around the city for the entire day exploring. The place was busy but I had no trouble getting seated since the inside of this place is pretty big and has a lot of tables. When I entered I wasn't really greeted by a host/hostess nor did I see one anywhere close by. I moved a little bit farther into the restaurant looking for an employee I could talk to about being seated. I made eye contact with a guy about 30 feet away from me and he quickly came over to me. He asked whether I would like to sit at the counter or a table. I quickly chose to sit at a table since the counter looked a bit cramped and uncomfortable. \n\nOnce seated I very quickly took a liking to the decor and atmosphere of this restaurant. Lots of old pictures and advertisements from a much earlier time adorned the walls. A lot of my favorite oldies 1950's songs were being played. I really felt like I was hanging out in a 1950's Brooklyn diner. It was a really fun place to just sit back and relax after finishing my day around the big city. There was a large family of native New Yorkers sitting next to me complete with parents, kids, and grandparents all talking amongst themselves with thick NY accents. That absolutely completed the experience. Go where the locals go!\n\nIt took quite awhile for my waiter to make his first stop by my table to take my drink order. I had been sitting about ten minutes before he made his way over. No big deal. At that point I was enjoying the ambiance of the place. \n\nHe came back pretty quick with my drink and took my order. I went with the pastrami burger with steak fries. After taking my order the waiter came back a few minutes later with beets, coleslaw, and pickles. All were clearly house made. My food came in a reasonable time. The pastrami burger was a pretty good sized burger with several slices of pastrami piled on top. It came with a very large onion ring. The food was very good and the slices of pastrami on top of my burger were great. The steak fries weren't bad either. However, I was most anxious to try the cheesecake. \n\nAfter finishing my meal I ordered my cheesecake. The massive slice came out and I dove right in after getting several pictures of it. I truly can't describe to you how good this cheesecake was! Seriously, it was like no other cheesecake I had ever eaten before. It was the perfect balance of sweet and creamy. I enjoyed every single bite. I honestly ate tiny little bites of it at a time just so I could make the experience last longer. My advice: Get the cheesecake while you are here! I also regret not trying a Brooklyn egg cream while here which seems to be another specialty of theirs. \n\nMy waiter really never came back to check on me after dropping my dessert off. After finishing I tried making eye contact with him several times to no avail. I just wanted to get the check at this point. I decided I would sit back for awhile and digest and give him a chance to stop back by. After 20 minutes of waiting and watching him pass by my table with my empty plate and glass numerous times I deduced he was not coming back. I finally got up and asked him about the check. Having to make my way across the room to talk to him was a bit inconvenient considering tables are placed pretty close together here. Add in a bunch of other people and it was like weaving through a maze.\n\nOverall, I loved the atmosphere and the food (especially the cheesecake!). However, the service left a bit to be desired. I understand people have off nights and waiting tables is not easy. In this case my waiter practically forgot about my presence which irked me a bit. With that being said I will definitely be back for more of the awesome cheesecake and to give the service another shot. If you're looking for a New York classic or some true New York style cheesecake give this place a try.", "author": "John K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "If you don't have any place else to go, then this place is okay. Service is slow, staff seem disinterested. Food is average at best and not worth the value of money they charge.", "author": "Yar R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "For my birthday this year, I decided to treat myself to Junior's Famous Cheesecake. \n\nA few reviews warned that the plain cheesecake was too plain so I chose slices of chocolate mousse cheesecake and red velvet cheesecake instead. The red velvet cheesecake was amazing. It easily beat out one of my favorite restaurants. I am writing this review because I tried the the chocolate mousse cheesecake today... It's difficult for me to describe how mouthwateringly delectable this cheesecake is without stringing curse words together and throwing DELICIOUS at the end! With my first bite, I closed my eyes and put my hands to the heavens because no one but Jesus could have touched this chocolate mousse cheesecake and made it the best dessert i've ever tasted.  \n\nI now understand why P. Diddy made Da Band walk across the Brooklyn Bridge to bring him a slice of Junior's cheesecake back in 2003. \n\nBoth slices were $7.50 and will likely take me another day to finish because they are verry rich.", "author": "Zindzi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-05", "description": "We went here for a coworkers goodbye party  Simply put, lots of hype and delivers a traditional diner (complete with ambiance, servers, and food to fit the style). \n\nI feel like the food is forgettable - although I hear the cheesecake is worth the price - and, for your money, you can find better places in the area to eat. If you're a tourist and want to see a staple in NY Brooklyn culture, its a definite must-come-once type of place.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "I have been to Juniors many times as I am a Brooklynite. First, the cheesecake is wonderful. I would recommend that first and foremost.\n\nIn terms of the food, I am a fan but I wouldn't come here mainly for that. I would recommend that you try the Jerk Chicken. Spicy! Also, the portions are huge.", "author": "Phi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "RIPPED OFF!!\n\nThat's the feeling you'll get if you decide to eat actual dinner here.  Decided to check out this \"famous\" establishment whilst staying in the neighborhood for a brief stay.  Thinking that the $21 chicken plate and the ever more $28 \"jumbo\" shrimp plate my wife ordered was going to special to warrant the price which happens to be @ $10 more than the lunch price but there was nothing special that would even warrant a rave review.  Word to the wise.. if you decide to visit this \"landmark\" stick to the cheesecakes which was the only reasonable and fairly priced item on their menu.", "author": "Brian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "My fiance, his mother, and I went here to celebrate our engagement. They both told me that they were regular customers over the years. I ordered the eggs benedict, while they ordered the BBQ ribs/chicken and salmon.\n\nNone of the food was too salty, which was great because my future MIL was watching her sodium intake. The eggs benedict wasn't greasy and the eggs were cooked just right. \n\nThe highlight was actually the waitress. She was very sweet to us and listened patiently to a elderly man who was telling her about his day. \n\nThe most unfortunate part: We had no room for cheesecake!\n\n(now I'm hungry.)", "author": "Christine Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "9/22/2012\n\nWe were seated in a very quiet area with a wonderful waitress. She let us order from the lunch special even though we were 15 minutes pass the lunch special hour. I had the tuna salad sandwich with casear salad and my other half had the fries and BBQ ribs. This is very typical diner food. We then order a slice of chocolate cheesecake that juniors are famous for. It was ok, but then again I'm not a fan of cheesecake. We were in and out in 30 minutes. Definitely will come again if we are in the area.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "The cheesecakes at Junior's definitely live up to the hype. I haven't been here often, and the only times that I have been here, I just eat the cake. Each time I haven't been disappointed at all. \n\nOn this particular venture, I got a piece of the carrot cheesecake, and my fiance got a slice of the strawberry. Both were delicious! The slice of carrot cake had alternating layers of carrot cake and creamy cheese cake. The flavors are a perfect match! It's so rich and huge, you may not be able to down the whole thing! Her slice of cheesecake was perfection as well! The creamy cheesecake topped with sweet syrupy strawberries! We all know that strawberries and cheesecake match up well, and this piece of cake demonstrates that very well!!!\n\nI hate that this Junior's location is closing. So many places are closing their original spots and opening up new shops in places like Times Square. Totally understand that it's a money thing. I'm giving it a 4 based on their cakes, and the history of the place...I have never tried any of their other food there. If you get a chance, try to stop by for a piece of cake before they shut down. The way that neighborhood is changing, it will be replaced by some type of high rise before you know it!", "author": "Jay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Picked up a strawberry cheesecake from here tonight. I love that it's open late and if you come here late enough you'll find parking right outside. It's about $50 for a decent sized cheesecake but it's always fresh and yummy so why not.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Have u ever wondered what's an American New York cheesecake like? Well we crossed by coincidence the cheesecake corner in downtown Brooklyn where lots of people were queuing up to get some cheesecake.....after admiring the cheesecakes I understood kind of what makes people waiting for almost an hour for a Juniot's cheesecake....after having tryed the cheesecake by myself I have to admit it was worth waiting :-) - amazing!!!", "author": "Michaela F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Food is descent, this is a good place too take some folks from out of town or for a simple outing with a friend or loved one, cheesecake is definitely on point!", "author": "Anthony N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "I came here for dinner Saturday night with my parents. There is no definite host counter but a gentleman waived us over once we walked past the take out counter. He sat us in the middle of the dining room, right by the aisle where everyone walks past. \n\nWaiter ignored us for first 10 minutes. Said there was \"miscommunication\" with other colleagues as to whom would be servicing our table. Sure. We're sitting right in his section as I see him serving other tables right next to ours.\n\nTook 20 minutes to get a caesar salad and 2 loaded potatoes. No appetizers before that (no coleslaw, beets, cornbread, etc.). Loaded potatoes were lukewarm and cheese wasn't even melted. Gross. Fast forward another 20 minutes and entrees arrive. Portions are large but it's pointless when food is terrible. Roasted chicken was very dry, pasta is generic, and fish \u0026 chips were subpar. We were ignored for 90% of the time we were there by our waiter, Carlos. With such exorbitant pricing, I would expect some sort of service\n\nWe ordered the original and strawberry cheesecake and it wasn't too memorable. Perhaps 3/4 of the dinner already left a bad taste that made dessert worse than it actually is.\n\nService: Worse than the food. Most of the staff walked around apathetic. A busboy even dragged one of our vacant chairs for 2 feet before he finally stopped and walked around it to clean another table. \n\nBill: $126 less the tip. I was very adamant in giving only $4 for tip since it's commensurate with the service. Unfortunately, most of my party disagreed and gave $10 cash as tip since they felt bad for him. \n\nWe will NEVER return. Spend your hard earned money elsewhere where service and food is much better.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "My friend wanted to try this place out before leaving NY. It was better than we expected!! The service was awesome!! Our waiter was so friendly and helpful. \n\nThe free apps were plentiful! There were pickles, cole slaw, and beets (which is weird). Also, there was corn bread and other breads. \n\nWe order only two dishes because our waiter told us the portions were large. We ordered sweet potato fries for a side, the chicken parm spaghetti and the spicy chicken and rice. Both dishes came with salads. They were indeed large portions. Three of us finished all of it. We will definitely come back here.\n\nThe atmosphere is very relaxed. Great for families!!!! This place is huge!!!\n\nI totally want to try their cheesecakes. They're on display in the front of the restaurant. They even have mini cheesecakes if you don't want the big ones!!", "author": "Mary H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-19", "description": "I was never a cheesecake fan until I ate a piece from Junior's.\nIt's like an orgasm in your mouth lol.\n\nAside from that the service was pretty slow but they were all friendly so it out shadowed that.\nI ordered the Jamaican Jerk chicken with a double side of collard greens. My chicken was soo spicy I could barely eat it. Now don't get me wrong, I love spicy food but this taste like I was biting straight into a pepper. I just wrapped it up and brought it back home.\nThe next day I cook some white rice and tossed the chicken in it hoping to kill the extreme spice but no luck.\n\nOverall: I plan on returning but I will not be having the jerk chicken again.", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-31", "description": "Sometimes you need a banana split.  Sometimes you need cheesecake.  Opted to split a banana split with fresh strawberries (well actually freshly frozen which is still pretty good) with vanilla ice cream.  Was looking for the chocolate syrup and nuts but it was okay without these toppings.  Think the whipped cream is freshly made as it melted quickly indicating no stabilizers were used.  Pricey ($9.25) for what it was but this is Juniors, NY institution and tourist trap.  Stick to better Brooklyn artisan newcomers like Van Leewen, Blue Marble etc. and next time we'll stick to the cheese cake!", "author": "Wailana W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}