{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-28", "description": "Unfortunately, Junior's customer service is awful. I ordered a cake, a week ago, for tomorrow the 29th my birthday.  I received a call today the 28th informing me they were out of stock??? I was not given an explanation.  Are you kidding me! This is indicative of the erosion of professionalism and pride people use to have in their job and product.", "author": "Douglas M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-02", "description": "I've only come back for the strawberry shortcake cheesecake to go. It's to die for. The one and only time I came here to sit down, I had a terribly experience with a rude waitress who continuously asked mr if I was sure I wanted that. The table next to mine actually requested a different waitress and I probably should have followed suit. Our order took a really long time to arrive even though it was very basic.  The sandwiches were yummy though. But the 3 stars are definitely for the cheesecake. It would have been 5 but that waitress made the rating drop.", "author": "Liya D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "Rude on the phone!!!!!!! I would never ever eat here just called and asked a normal question and the guy said what do you want before I hang up on you? If they are that way with customers on the phone who knows how rude they are in person!!! Will never step foot in a place like this!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I give no stars but the thing on top said I had to give some kind of star but I really give them a zero!!!", "author": "Julie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "4 star because I have not tried their cheese cake yet. Im on that workout flow lol. Long story short about my experience. I came here with a group of friends for lunch around 4:00 because my accounting professor recommended this place and was asking to treat them if i come late to class once more, as a joke of course. Anyhow, The place was really nice when I first walk in. It gives you this atmosphere of a mix between Ihop and dallas bbq due to the music and the table/seat arrangements( seats on the far right near the glass where u can see outside and inside seating like couches and stuff). Ordered anything on the menu and the food comes with extra things such as hot and tasty cornbread and regular bread. My friends and I ate them like it was the last supper haha. The plate I order was ribs and chicken combo. Friends order something else like fish and chips and burgers. The service was nice like everyone stated and best of all in my opinion, the servings was ALOT!. The price was quite fair ( 15 dollar per plate) and the place is big enough for you to relax or hang out for a while to enjoy. I recommend coming here if you're a big eater. I end up paying 22 dollar for my meal because 15% gratuity of party 5 and over. I felt its worth it since i got some good bread. TRY IT OUT!.", "author": "Kevin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Their cheesecake BLOWS AWAY the stuff from the Cheesecake factory.  Good for lunch on a Saturday afternoon. Friendly staff. I would definitely go back.", "author": "Green I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "Came here just for the cheescake since we had heard so much about it. Between us we had the Raspberry swirl, the Strawberry, and the Strawberry shortcake. There were all DELICIOUS!!! So good. If I had to say something negative it would be that the strawberry cheesecake one was a bit too rich and we were unable to finish it, but that doesn't mean it wasn't delicious.... This place is definitely worth a visit.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "The diner food for a meal - pretty greasy and non-special. But their cheesecake is the best I've ever had.", "author": "M J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "The chess cake turn around is fast bought a few whole cakes for different occasion cant say they are bad cant say the cream of the crop but they are good., the food basing on the location in Time Sqr is probably the same thought he seating area does seem smaller, always a line to get the cake it self.\n\nGo to have an experience - don't expect to be raving about the food but maybe about the cake", "author": "Michael J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-20", "description": "I went there a couple of weeks ago for lunch with a friend. I ordered a bacon cheese burger, cooked medium well. The burgers are huge, so big in fact I couldn't comfortable bite into with out risking burger grease all over my work clothes. That's not so much a complaint as a fact.  What drove me to 2 stars was my burger being all pink and falling apart in the middle. Not even close to Medium, certainly not medium well. The bacon that came on top of the burger was delicious, but it's pretty hard to fuck up bacon. The waitress never even came to the table to ask if everything was OK. Wasted my lunch hour on a lunch that I couldn't eat. I think next time my friend suggests Juniors for lunch, I'm going to pass.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-26", "description": "This is my favorite cheesecake joint.  The strawberry is the only one you should order.  The others are okay but just don't have the same kick as the strawberry.  The actual diner is decent but does not compare to the thousands of other options you have in NYC.  If your looking for a great dessert then this is the place to go.", "author": "Husain K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "ONe of those things you just have to do when you're in Brooklyn.  Really good sandwiches, and of course, the desert is not to be missed (especially the chocolate fudge cheescake).  Great for entertaining groups, like family from out of town, and great for kids.", "author": "Gia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "Their cheesecake is rather perfect. It might be number 2 or 3 on my list of the best cheesecake I've ever had, and I've had a lot of cheesecake. I can't tell you how many times I have been here, including the Times Sq. location. When you go just get plain cheesecake. Not red velvet cheesecake or carrot cheesecake. Plain cheesecake. The other varieties lose the cheesecake punch I'm looking for. Their chocolate cake is bagin', though. I also love the fried chicken in bbq sauce, and if you want to be healthy, the filet of sole with veggie medeley; it sounds gross, but they really do a great job!", "author": "Emma K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-07", "description": "The cheesecake is OK. not the best I've ever had and they are overpriced !! $6 for a piece of cheesecake and $60.00 for a whole cheesecake ?? really ?? It's just not worth it to me.  They also have a dining area , even the food on the menu seems a bit much for me, I don't mind paying for food when it's WORTH the price.  If you want really good cheesecake at an affordable price I would strongly suggest Maxwell's Bakery on Atlantic Avenue.", "author": "Leka H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "The best cheesecake I ever had.  So many options to choose from. All are rich and moist. I love the velvet like texture all the cakes have.", "author": "Marsy A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-05", "description": "this place was busy when we went!  it reminded me of a small town diner where the whole town gathered to eat.  \n\ni ordered food, was stuffed but wanted to order their infamous cheesecake.  \n\ni thought the cheesecake was too rich.  i ordered a german chocolate slice \u0026 i didn't know what the big deal was with their cheesecake.  i'm thinkin of going there again to try their original cheesecake whenever i'm in brooklyn again.", "author": "miss a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "the cutest place in Brooklyn! great fonts\nwe had coffee and the strawberry shortcake cheese cake. it was so good! it was a cheese cake sandwiched in between yellow cake. the slice was huge! We split it and we still had leftovers\nour server at the bar was very nice\n\nwill be back!!", "author": "Paula C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "Excellent cheesecakes! Went to the Juniors at Grand Central Station for a slice to have while watching the Yankees, I chose a 'devils' cheesecake which was pure indulgence!!\n\n\n 3 layers of rich chocolate made this the best cheesecake I've ever tased! The slices are huge- as with most American portions and I was hard pressed to finish one slice- I had to have a little help from my friends!\n\n\n Highly recommended if you're ever in New York!", "author": "nienie13"}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Went there last Friday and really enjoyed the food! Everyone I was with had a burger and we were all pleased with the meal. I would have gave 5 stars, but I had the apple pie and it was awful!", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "so i haven't eaten the food here only the cherry cheesecake, plain cheesecake, and red velvet cake.  in fact, i did a red velvet cake contest between junior's and cake man raven and junior's red velvet cake is so much better.  the one from cake man raven was too airy and junior's is more substantial which makes it more flavorful.  i definitely support the masses on this one -- the cheesecake is smooth and tasty!", "author": "Andrea W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "We walked from wall street to Juniors. Very enjoyable walk with a BIG prize at the end.. JUNIORS! The service was excellent, the cornbread and dressings they give you while you wait for your food was delicious! The food... OMG presentation and taste, all very good! And of course the cheesecake, nothing compares!", "author": "Qiana T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}