{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Went for breakfast with boyfriend. Very clean. Food was good. Home fries were my favorite . Service was pretty fast as well.. historic place so u catch ur self looking around at all the memorabilia.. pretty kool place.", "author": "Deshiree S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "One of the best places to eat in NYC. This place is a family favorite and we take everyone to it when we take them to the city.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Love the rolls and corn bread thats included in you order.\nAnd the delicious pastries included in your breakfast menu.\nCant wait to go back. Waiter was very polite and helpful", "author": "Jan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Yum!! I stopped in Saturday night with my mom and boyfriend for some dinner. We were seated right away and our server Stephanie came over. She was so friendly and brought us over some cornbread, pickles, and beets! Everything was so delicious we had to ask Stephanie to bring us over some more!!\n\nI split the cheeseburger with steak fries with my mom and my boyfriend ordered the turkey club. Everything came out quickly and was amazing. The turkey club was huge! My boyfriend ended up taking home half of it and he is a good eater and the I couldn't even finished half of the cheeseburger I was splitting with my mom!\n\nFor dessert, I split the strawberry cheesecake with my mom and my boyfriend ordered the brownie which came with ice cream and whipped cream. When the desserts came out they were both huge!! The cheesecake was delicious. I wish it wasn't so cold (I like my cheesecake room temperature so it is softer) but it was still very good. My boyfriend loved the brownie and couldn't even finish it all. \n\nOverall, everything was great and I'm glad we decided to eat here. Also, our server was great! She was so nice and attentive which really made the experience even better.", "author": "Cara B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-25", "description": "I have been a Junior's customer  for years.  2 years ago I  noticed the food quality  and customer service went down  terribly.  First, I was in denial and kept going  back.  It's bad. Horrible  food  and Nasty workers even management. No smiles.", "author": "Sherry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-17", "description": "A must try for all cheesecake lovers. Definitely a worth it stop to this Brooklyn landmark.best cheesecake you have every had. They also have cake and food but not a big fan of anything here besides the cheesecake.", "author": "Diondra B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "I keep coming back to Junior's Restaurant only for the cheesecake! It is seriously GOOD, especially the strawberry one!\n\nTo be honest, it is a really famous restaurant and I like it, but the prices are very touristy. There are always tourists visiting, and for them, it will always be a good choice to go to Juniors's, but as a New Yorker and Yelper now I know it's pricey.\n\nThe staff is nice and friendly, if they aren't very busy they can take care of you easily and quickly. The complementary pickles, beets, and salads are super tasty. They serve plenty of food, you totally will take some home. \n\nI guess Junior's will be always a safe place to go if you are hungry in the area. I keep coming for the cheesecake, and even though the cheesecake deserves 5 stars I am only giving 3 stars based on the restaurant experience...Just wanted to make that clear.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "First time trying this chain! The cheesecakes looked yummy! Big portions. My burger was okay but my boyfriend's sandwich was very tasty. Ordered a strawberry cheesecake to go as we were so full.", "author": "Teresa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "This review is for take out at Juniors. \n\nAs you walk in the door, towards the right you can not miss all the display cases lined up with Cheesecake. The Pumpkin Cheesecake are available for purchase as well. \n\nOn the left hand side by the door is take out for food. Got hit with the food cooking on the grill.\n\nStaff were helpful with cake selection. As I turned around there was already a line forming for desserts.\n\nGot a 6 inch plain cheesecake. Totally and sinfully delicious. Soft, moist and full of creaminess even two days after.\n\nWill be back for lunch.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Bakery:\nFirst came for the cheesecake only. \nIn general, Junior's cheesecake is very good. It's pricey, but it's worth trying. Some special flavored cheesecake options can be a bit more heavier and sweeter. \n\nRestaurant: \nThe second time, I came to dine in for the food, \nI ordered from the lunch special (Pastrami sandwich with matzo ball soup with drink included). It was surprisingly good. I highly recommend these two options! \nI also like that they give bread and corn muffins. By the way, they have breakfast options all day, which my friends enjoyed. And no complaint for the waiter service. My party and I didn't have to wait in line to get in because they do have quite a lot of seating.\n(Fun Fact: they have framed pictures of famous people in the bathroom stalls. Pictures of famous men in the woman's bathroom and famous women in the men's bathroom)", "author": "Olivia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-06", "description": "I've lived in NYC my whole life (I'm 32) and have somehow never been to Juniors.  I finally tried it the other day and yes, it was amazing.  What wasn't awesome was the service.  The staff was inattentive, unfriendly, ignored us and looked generally miserable.  I wasn't even upset because the cheesecake was so good.  I really wanted to give this place 5 stars but just can't.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "My mom came home with the cheese strudel to surprise me, and what came out of the bag was extremely disapointing. I cannot believe Juniors decided to even sell a strudel with half the nuts missing!(pic shall be posted!) It has been years since I've had juniors cheese strudel and the taste has changed for the worse. First impression and bite of this thing has made me decide not to buy this for many years to come.", "author": "Rita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "Delicious cheesecake. After a night seeing a broadway show, can't go wrong with a late night treat!", "author": "Shawn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Junior's is in institution located at the corner of Flatbush and DeKalb Avenues in Brooklyn since 1950. Junior's is also a stone's throw away from the Hotel Indigo, where I usually stay when in downtown Brooklyn.\n\nJunior's is famous for their cheesecake but last Friday I had lunch there with my brother in law, who works very close by. The restaurant is spacious and clean and has that old school deli/diner type of feel. I almost expect to watch the Brooklyn Dodgers on the TV.\n\nThe menu is huge and the portions are also large. On my brother in law's suggestion, I ordered the lunch combination for $14.95. This includes a drink, a soup or salad and  1/2 sandwich on a plain roll. I chose the corned beef sandwich and a salad. I was a little leery of a plain roll instead of the traditional rye bread but my sandwich was excellent all the same. My salad was just OK but Junior's provided pickles and a really good breadbasket. The only part I regret was I was so stuffed I didn't have room for their cheese cake on this trip. I can't even imagine trying to eat a whole sandwich. I have had Junior's cheese cake before and it was quite good.\n\nJunior's is a great place to experience a slice of New York Americana and there is something on their menu for everyone. Service was fast and friendly.", "author": "Richard R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Headed there right now for brunch.. Yummy\nI'm here. Messed up my order....\nSo how do you charge someone for SUMTHIN you didn't put in the food. \nGonna stop at HoneyBaked Ham for their menu when I leave here....'", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "If you are looking for great tasting cheesecakes, then go to Junior's in Brooklyn NY.  Not in NY, me either.  I ordered this online and was shipped to me, frozen and without any hassles.  YUMMM!\nI am trying NOT to eat it all at once---check out their website for the ingredients and super pics of their cakes.  This is my latest acquisition.  White Chocolate Raspberry cheesecake.  WOW!!!  You can taste the quality as you slowly enjoy each chew.", "author": "Leaf H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "The cheesecake is amazing, best ever, 5 stars. The food is not bad, 3 stars. Service was spotty. Food was served quickly, but had to wait 10-15 min before server came back so I could ask for mayo for my burger, which was huge and probably would have been better warm. After that, service was great. Neighbors chicken sandwich was huge and looked good. Definitely come here if you like cheesecake.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "This restaurant has a genuine old school feel! Generous portions and excellent service. I ordered a burger medium and got it well-- was a bit disappointed. Would have like some flavor in the burger. Love the onion rings--they have a thicker hush puppy like coating. Open face beef sandwich was huge and great taste. You will not go hungry in this place. I didn't order it myself but they do have a huge selection of cheesecake that everyone was raving about.", "author": "Tonya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "So excited to have stepped into the 1st Junior's Restaurant. I was saving this place for a special occasion and what better way to celebrate after bf's first residency interview.\n\nAfter perusing the diner menu and choosing our dishes, complimentary vinegar-based coleslaw, crunchy pickles, and beets was served at the beginning. I nibbled on these instead of ordering to save my stomach for a huge slice of cake.\n\nORDER\n- Roast beef sandwhich + caesar salad: lunch combo under $14. Salad bowl was medium-sized, but the sandwhich size was disappointing and tiny. The tenderness and taste from the roast beef sort of made up for it.\n- Cheesecake: fruit on top tasted like cherry/pineapple/blueberry pie filling. Pretty dense, but not as rich as Cheesecake Factory. It was a bit sweet from the fruit toppings, so I'm sure plain would have been a perfect yum! I loved how the \"crust\" is a light sponge cake.\n\nOverall, I'd say come only for the cheesecake bc everything else is too pricey and not worth it. I've been to the theatre district location back in college with my mom and only tried a slice. Good thing too bc I wasn't missing out. I always make the excuse that it's NY, but still... how do people sustain their livelihood. The service from our pregnant waitress was so attentive. She refilled our waters and checked in on us a couple times. Huge kudos and tip for her! Next cheesecake bf will try is eileen's cheesecake.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Spectacular cheesecakes, if you're a tourist and nearby, a visit is a must. Big family friendly venue with fast uncomplicated service. I can't comment on the rest of the menu, but that doesn't matter, you come here for the cheesecake!", "author": "A C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}