{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-07", "description": "Brace yourselves when you walk in.  If you walked in, you'll waddle out.  And if you waddled in, you may have to be wheeled out.  This place has huge portions.  The waiters are great and very dapper in their old-style vests and ties.  The food is best described as comfort food.   But the cheesecake. . .oh the cheesecake!  Mercy nurse!  Slap your gramma!  The cheesecake will rock your world!!!  Make the drive to Flatbush people.  This place will not disappoint.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-03", "description": "The BEST cheesecake in the world. The surrounding neigbhorhood doesn't look pleasure. Once you're in the store, everybody looks happy. Chat with you and share their feeling about Junior's with you. I no longer a resident of NYC, but an annual visitor. I ordered for my boyfriend and my boss birthday. It arrived in a dry ice box and can be store in the fridge for about 1 week.", "author": "Nancy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-23", "description": "was in nyc in 2003 and had to stop here and get some cheesecake.  i preferred the plain cheesecake!  bought some to go also and it tasted better the next day, mmm.\n  \nthen in 2005 a friend had bought a whole plain cheesecake for my family \u0026 i online and it arrived next day just as yummy.", "author": "Xenia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "Had a really bad experience with Junior's delivery service. I asked for a cheesecake to be delivered to my friend for her birthday. They sent me a credit card authorization form. I filled it out and sent it back fully completed. They never followed up to confirm my order. I called them the next day and they said my order was never completed and now it can't be delivered for her birthday. Really annoying considering I had to complete the form, scan it, and email it back. They offered to deliver it the following day or the following week which isn't really helpful. They will try to fulfill the request tomorrow morning on her birthday but can't make any promises which puts me in the tough spot of whether I should find another place to deliver a dessert to her with same day service which is hard to find. Too bad as I am a fan of their cheesecakes and have been buying for years on special occasions. Won't be back after this.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "Good selection on the menu, from sandwich, to pasta, to cheesecake.  Food quality is ok.  Nice old school ambiance.  Service is usually pretty good.", "author": "Bram D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Even though I wasn't a fan of the atmosphere at all, the Cheesecake was SO FRESH, light and delicious. I can't wait to go back to NYC for another slice.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-19", "description": "Okay, so the classic cheesecake is rich and delicious. However, I work in the area and have been there many times for lunch and today's service was horrible. I usually order the soup and 1/2 sandwich special. (The matzo ball soup is always good and the half sandwich is normally big.) I asked if I could get a grilled ham \u0026 swiss; the waiter hemmed and hawed but finally said okay. Maybe something other than a plain sandwich of turkey or tuna is too much of a challenge for them. The sandwich that was brought to me was so thin, I complained to the waiter who agreed with me. He said he'd bring me 2 extra slices of ham. What am I supposed to do, make the sandwich myself?! The manager came over and I explained what had happened and mentioned that the waiter does not have a clue about service. He understood and had the kitchen insert the extra ham and the waiter brought it back to me with no explanation or \"sorry about that.\" He just dropped it on the table.\n\nSome of the service people there (especially the guy behind the take-out counter) are downright unfriendly and have no clue about customer service.", "author": "Alan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "I've long been a Junior's fan, thanks to the Grand Central location.  But today I found myself at Brooklyn Technical HS for a NYC teacher event, and with a quick Yelp I found that the original Junior's is mere steps away-- off I went!\n\nThe place is an oasis on a hot day, especially for a dessert lover.  I scurried across Flatbush, overhearing a nurse from a nearby hospital recommending Junior's to two wanderers: \"The food's ok-- but the dessert's amazing.\"  I knew I was going to the right place.  Marveling at the rows and rows of luscious desserts, I ordered an egg salad sandwich and a piece of what I thought was marble cheesecake (turns out chocolate swirl is the proper name), completely forgetting to order a beverage, which just demonstrates that I value my chocolate ingestion over hydration.  I took my booty ($6.95 for the sandwich and a whopping $5.75 for the cake) across the street to a park by LIU and chowed down.  The sandwich was more than ok, in fact, as far as simple egg salad goes, it was very good, and came with 2 perfect pickles.  The cheesecake actually was less of a swirl and more of a double decker: very thin bottom layer of chocolate cake, then a thick layer of chocolate cheesecake, topped by an equally thick layer of regular cheesecake.  Had I known this, I might have stuck to the plain.  Chocolate cheesecake just seems like overkill.\n\nThe place is cute, very busy at noon, and seemed mixed with both local regulars and tourists.  I wouldn't go back specially since I can get the food at Grand Central, but if I'm in the neighborhood, this would merit a return visit.\n\nUpdate: If you are at Junior's and not in the mood for cheesecake (heaven forbid!) their cupcakes are quite possibly the best in the universe.  They are $3.25 but two people could easily share (I didn't!) because they are enormous cupcakes on steroids-- not delicate little creations like I had at Buttercup.  The cake is buttery and delicious on its own (a rarity!), but topped with an enormous swirl of yellow, purple, pink, blue, or chocolate frosting, with edges rolled in fresh rainbow sprinkles... UMMMMMMMM.  I don't think the frosting is buttercream, which is great, just sugar, sugar, and more sugar!\n\nUpdate 10/07- eat in service is slow!", "author": "L C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-30", "description": "Unless you're going for breakfast or the cheesecake don't expect a culinary or cultural experience.  Food is sub-par.  Service is either very good or downright infuriating.  I  like their eggs and oatmeal.  Especially the poached eggs over  homemade corned beef hash.   Cheesecake is second to none.  The only item I like outside of the eggs and cheesecake is the tongue sandwich which can be a hit or a miss.  Mot of the food is either drowned in sugar, grease, or salt or all three,  Which is pretty bad considering the prices they charge.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "Firstly, I love that the waiters are actually dressed like waiters... The brunch is great, with a pastry dish included. The french toast is the best on the planet, they also have a full bar that is always open! Lunch and dinner plates are heaping... Very reasonably priced too...", "author": "Marc A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "My first encounter with Junior's Cheesecake was at the debacle named the Great American Food and Music Festival when the cheesecake was mushy and the crust was soggy. At that time, I questioned Diddy's taste in desserts (is this cheesecake that good to make his 6 contestents on Making the Band walk across the Brooklyn Bridge to get him a slice?). So, on my last visit to New York, my family and I paid Junior's a visit. We ordered a slice of cheesecake with cherries to go. This cheesecake had a nice creamy texture. It wasn't too sweet but it was so dense that it took three of us to finish one slice. But by far, this is the best cheesecake that I've tasted. Junior's has redeemed itself from the poor representation at the Great American Food and Music Festival. Next time I get the craving, I'll pull a Diddy and send my minions across the country and Brooklyn Bridge for a slice.", "author": "b p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-01", "description": "As a brooklyn native I must give major kudos to my of my favorite local hotspots. You can't go here without having the cheesecake. It's hands down the best cheesecake I've ever had. I may be saying that because I'm biased but it's also totally true.", "author": "diana m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-06", "description": "i remember seeing this place on diddy's making the band on mtv and somehow remembered it while i was visiting new york. decided to give it a try to see how great it is especially when it's voted best n.y. cheesecake.\n\nhonestly, it wasn't that great. my boyfriend says my cheesecake tastes better lol. i think the center of the slice tastes much better than the outer. there isn't much of a crust, so if thats your favorite part then i would pass on the cheesecake. \n\ni can't vouch for what the rest of the menu tastes like since all i went there was for the cheesecake.", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "Always impressed and never disappointed. This is a MUST have for the holidays or any special event. I arrive with this and everyone is happy. If you love cheesecake, make it to Junior's.  Try my fave, the Strawberry Cheese Pie. Mmmmmm good!", "author": "C K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "Juniors lives up to the hype big time.  The service from beginning to end was superb.  It was nice that they had complimentary corn bread and it was just like my mom makes which is to say it's very good.  My wife and I both had burgers and fries which were very tasty and not greasy.  We were full after we finished our burgers and fries so we had strawberry cheesecake to go.  It was the best cheesecake I've had by far.  I've had cheesecake all over the states.  People say the cheesecake at Carlo's Bakery in Hoboken is to die for and it's pretty good, but this place makes the best cheesecake I've ever had. I can't wait to go back for more.  Great service, great food, and the best cheesecake in the world, you cannot go wrong here folks!", "author": "Jake P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "I'm from Cali and we have a juniors out here but the juniors in Brooklyn is way better. well the cheesecake is a lot better, i only tried the cheesecake because i was in a rush but so is everyone else in new York. most of the places i visited in NY had really bad service but the customer service here was quite good. i will make a trip back to NY and i will go back to juniors but next time ill try something different", "author": "Antone H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "I just enjoy juniors every time I stop in Brooklyn....  there Cheesecake is the best in New York !", "author": "gladys g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "You can't get any more classically New York/Brooklyn than Junior's...even P Diddy recognized it when he made the kids from Making the Band walk here to get him some cheesecake. Thank goodness there's also a Grand Central Station location!! And yes, while the cheesecake is indeed amazing, creamy, rich, mouth watering and any other number of adjectives, the rest of the food is great too! Just make sure to leave room for dessert!", "author": "Irene F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-05", "description": "Came to Brooklyn for the first time and had to visit the world famous juniors with my friend. The food was ok... I had the fried shrimp plate. It was way over priced. We left there with at $65 tab. dinner + dessert. It was so crowded (but then again it was v-day). I had the red velvet cake for desert because i'm not a huge fan of cheesecake... lets just say i've had better all around. I would probably not go back to Juniors unless someone was taking me there and paying for it. I'm from Los Angeles and have been to way better establishments serving the same demographic. Overall Juniors for me did not live up to the hype.", "author": "A-lan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-05", "description": "Okay okay,  I had to make a visit to Junior's after seeing P-Diddy make the guys on Making The Band trek over to Brooklyn for cheesecake.  The food was above average but  the cheesecakes (regular and chocolate) we ordered was delicious.  If you haven't been to Junior's yet, make sure to stop by and check it out.", "author": "Mare P."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}