{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "If you're in Brooklyn I highly suggest going to Junior's for breakfast. It's a historical business and serves great food. It's also great due to its location being right around the corner from shopping. \nThe place has tons of seating so the wait usually isn't long or nonexistent. I come here with my grandfather all the time. If you can, sit in the back section where the windows are, that's the best.\nWe usually get the same waitress and she's always very nice. She's attentive and makes sure you have everything you need.\nI've never eaten from their lunch or dinner menu, I always stick to breakfast so nice we like to go early. They still serve breakfast all day but they usually stop giving out the bread basket in the late morning. I know that after a certain time they stop serving homefries or grits depending. I like the western omelette with egg whites. It always comes out hot, fluffy, and tasty. I usually order hot chocolate for my drink. It comes in an oversized coffee cup or a malt mug. \nOf course the number one thing that s their cheesecake which I will always love. Sometimes I buy a whole cake so I can bring it back with me. If you have to go, go to the one in Brooklyn. I promise you will not be disappointed.", "author": "Sam L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "Junior's specialty is there cheesecakes; there food is decent at best, but it's really their cheesecakes that shine, luckily, you don't have to dine in at any of their locations to order some. There is a seperate section dedicated to those just  ordering cheesecake. \n\nI have dined at this location twice and have noticed that despite not being full at all, waiters can be very inattentive, disappear for long periods of time and show up when they're not needed. Don't think I will dine-in again but would come to order cheesecake if anything.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Drove past this place, then looked up the reviews. Wow, they really can't say enough great things about these restaurants. We went to the Brooklyn and Times Square locations and had great meals at both. Their cheesecake is phenomenal. I had corned beef hash for breakfast and it was the best I have ever had.", "author": "Shane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "First time\nComing her have to say staff is friendly. I heard they have the best cheesecake in Brooklyn. There cheesecake is great but there are different places to compare the flavor. Price range was actually affordable definitely worth a try.", "author": "DrizzyBaby S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-23", "description": "My husband is a cheesecake aficionado.  So when we traveled to Brooklyn for our daughter's marriage ceremony, we had to visit here. I had already been years before and bought him a cheesecake back on the plane. This time was his first opportunity to visit for himself. \nThe service here today was spot on. Andrea our server accommodated our party of 6 quickly but did miss a few things. Even with the oversights we still enjoyed ourselves and would recommend a stop here. Although the food was just ok the cheesecake is the real reason why we came anyway. The steak fries are VERY good though. A bit pricey but that is the norm in downtown Brooklyn. We love Junior's cheesecakes.", "author": "Tonia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Finally .... I have eaten at Juniors. I would've given it 5, but the greeting/host staff dropped the ball. They were no where to be found when we first came in. Had the turkey, pastrami, corn beef deli sandwich and the wife had the cheese steak. Ok enough of that ...the real reason you go to Juniors is for the CHEESECAKE. Had the apple crumb slice. It was $7.85, which is more than I have ever paid for a slice of cheesecake. But it was worth every cent. It was divine!!!! Whenever I go to Brooklyn again, this will be the restaurant to visit. After eating their cheesecake, you will never view cheesecake from another establishment the same ever again.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "What can I say... Juniors is the epitome of great, decadent desserts. Especially the Famous Cheesecake...\n\nHow could I not have come here to Juniors while on a short stay in Brooklyn, New York. I was literally in walking distance staying at the Hampton Inn on the corner of Flatbush and Tillary. It had been a long day, so the order was take-out. All I can say was that after partaking in this rich and flavorful cheesecake, I was in sleep, sleep heaven.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "THE BEST CHEESECAKE. Bar none. End of discussion. Game over. Checkmate.\n\nJunior's has the reputation for making some of the most well known New York style cheesecake and deservedly so. I was fortunate to sample some of Junior's cheesecake when a student intern at my old job flew one back from his trip home to NYC. It was delicious and rich and perfect. It's the way all cheesecake should be. No need for a big slice or fancy toppings. No need for whipped cream and other accoutrements. It's plain. It's simple. And it's good. \n\nThere is only one place in LA that makes a cheesecake close to Junior's but Brooklyn is still the standard. I was again fortunate to have some of that glorious cheesecake when we recently had family from Queens fly one back with them. It was as good and as delicious I remember. You have no idea how happy I was, how content I was. HA! \n\nSo very good... And I'm so grateful I've had to chances to sample it. Wait til I get to Brooklyn... Just wait til I get to Brooklyn.", "author": "Chuck D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "There's NO place like Junior's! Not only is it a landmark and a staple in Brooklyn but it consistently delivers a great experience. Generous portions, friendly staff, and awesome cheesecakes!\n\nUsually we come here for weekend brunch and it has been consistently great, quick, and extremely satisfying. Great pancakes, giant omelettes, and quick and friendly service. The pancakes are so fluffy and delicious - pure perfection!\n\nI'm giving it 4 stars because my experience the other day was subpar by Junior's own standards. The service was much slower than usual, the omelettes were overdone and dry, the pancakes were dry too, and the service was inadequate and slow. I hope this is not indicative of new chef or things going downhill; I hope this is a one off disappointment because I really love Juniors and hope to be coming here without being apprehensive of bad service.", "author": "nina s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "To be fair I've only come for breakfast, so this review is for that meal only. \n\nThe food is pretty good quality. It's a family joint, so expect some children to attend breakfast (they have a kids menu), so it's probably safe to assume the kids come running for lunch too.\n\nThe service is usually great - nobody bothers you while you're eating. I always find it annoying when you've just taken a bite and for waiter asks how your food is, then stands there for 30 seconds while you chew \u0026 swallow only to hear 'it's great' like everyone always says.", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "My school is across the street and I only come in when I feel like fixing my sweet craving. Cheesecake here is a must buy that's almost a given. I've tried the red velvet cupcake and it pales in comparison to \"three little red hens\" on the upper east side  never the less it's fairly decent. The apple pie I ordered from here one was very hearty (portions ). \n\nSince I'm usually a take out customer I will say the process is effortless smooth, you place your order n within minutes you're out the door (major plus)", "author": "Emily S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "The cheesecake was fine but that's not why you come here.  It's an institution, the place has a very defined aesthetic, and the staff is quite pleasant.  We had a fun time, maybe next time I'd add a grilled cheese or something like that- it feels like the type of place that would do that well.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "I order 19 cheesecakes to different people including one to myself for a luncheon I was hosting. Mine was shipped to the wrong address and never arrived as it was lost in transit. I don't know if any of the others had the same issue or not yet. I asked for special shipping to ensure it arrived on time for the event and was told I had to pay and extra 20+ dollars which I agreed to. When I called to report it was mid addressed I was told it also was not\nShipped at the higher rate to ensure it arrived 2 days early. So basically many blunders and I have no cake for my luncheon. They could ship\nA new one but no guarantee of its arrival time the day of the event. I planned this 3 weeks in advance and the call center error ruined my luncheon as it is  to late to special order from any bakery. Last year they sent one client 2 cheesecakes and none to another client. They blame it on computers they use causing them to go back and forth between orders. In 3 yrs I have ordered over 60 cheesecakes and I won't order again", "author": "Lynn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Very good food \u0026 great service. Portions are huge so you definitely get your money's worth. My only complaint would be that it was pretty hot temperature wise inside the restaurant the day I was there. Other than that I recommend it to anyone who's in the NY area.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "Heard about the famous cheesecake in Brooklyn and had to try. Got the brownie cheesecake and may have devoured it in less than 5 minutes, oh well", "author": "Margi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "I've always heard about Junior's Cheesecake in Jersey.. but I never got the change to go. Well, on a visit up top for our baby shower we made it and I must say that I fell all the way in love with the cheesecake. \n\nThis cheesecake isn't extra sweet but definitely rich and creamy. The taste is out of this world. I only tried the strawberry cheesecake, but if they're all this damn good, let me get a small piece of everything next time! \n\nI couldn't get this cake out of my taste buds and dreams so I ended up ordering another cheesecake which was $60+ including shipping. SIXTY DOLLAR CHEESECAKE! that just goes to show how freakin' good this ish is... way better than the Factory. Not as sweet as them but they don't need the extra added whipped cream, either. \n\nI never thought I would have damn cheesecake this good but every time I go up north I will be forced to get a slice or two or a whole cake.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "My favorite part about our dining experience here is the service. We were seated right away without having to wait in line and our server was immediately attentive, friendly and conversational.\n\nWe ordered the jerk chicken and meatloaf platters (dinner version) and the orange chicken wings as an appetizer. The portion sizes for the main entrees were huge and we were unable to finish our meals. We gladly had them packaged and saved room for dessert! We split a chocolate mousse cheesecake slice and the portion size was still very big! We could not finish it again so we opted to wrap up the rest and devour it later at home, when the hunger strikes again!\n\nOverall, the food was filling, but the meatloaf could of had more flavor (tasted somewhat bland, along with the giant potato chip and broccoli). I seasoned my mashed potatoes and giant broccoli with butter (leftover from bread rolls platter) and that did the trick!\n\nThe environment was very old-fashioned, along with their music selection. The table size for two was rather small. The place, since it is somewhat old, felt kind of dingy, and possibly in need of a renovation or makeover. However, we will probably go here again to try out different options on their extensive menu!", "author": "Kay Ashley M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "Went here on a whim, and was not impressed by the menu, therefore had very little to select from.  I know they're famous for the cheese cakes, but they did not appear fresh enough for me to try.  The wait staff was a little aloof and the space looked clean and spacious yet can use an updated look to 2016.\n\nDon't think I will be going there again, if so, maybe for breakfast.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Hands down this best cheesecake in the world!!! But let me also tell u about their awesome milkshakes... it was amazing!!", "author": "Mayoh C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "My mom doesn't bake. Ever. So during the holidays we'd always have a juniors cheesecake (or two or three) in the fridge that we slowly ate over weeks. (The last bite is better than the first, believe it or not.)\n\nHowever, I was craving diner food and did not want to lose my parking spot so came here. It was all eh. Not bad (as in I still ate every last bite) but nothing special. The pancakes actually kind of tasted like bisquick-but I'll give these guys the benefit of the doubt and say it probably wasn't. And my pancakes and bacon was almost 14 dollars...breakfast for two with orange juice and coffee was 40 before tip...that's definitely not the diner price I was looking for either.\n\nReally 3 stars for the meal and an extra star for cleanliness and nostalgia for those wonderful cheesecakes.\n \nI would only recommend this place for cake (love the strawberry pie cheesecake but my dad loves the chocolate mouse cheesecake-it's been an issue in the past) and if you like traditional Jewish deli sandwiches (as in rye with tons of meat and a condiment-no frills and not my style but I know is beloved by many.)", "author": "Allana D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}