{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-16", "description": "OK, here's the controversy, I've never REALLY eaten at Junior's. Everytime I go to NY no matter who I visit, or for whatever reason I happen to be there, I only end up at Junior's for a few moments to order the take out cheesecake. No matter how adamant I am about going to Junior's to eat I always end up just ordering a slice of cheesecake to go.\n\nI've been told that the food at Junior's isn't that great, and it's as if native New Yorkers are a too ashamed to let the food represent their city. So therefore I can only comment on the cheesecake. My rating has nothing to do with service, ambience, food, nothing except cheesecake. Truily for all I know they may have the greatest food in the world at Junior's but due to now what I think to be a New York conspiracy to keep me from sampling Junior's food, I don't know.\n\nNow the cheesecake is alright, it's not life changing like some people would have you believe. I defiantely wouldn't order one online and have it shipped to me, that's taking it to the extremes, I would just make one first, or go to the cheesecake factory, or even Safeways and pick up a fresh one. That being said they are good enough to warrant a trip to Junior's everytime I go to New York, but even then I wouldn't go to far out of my way to get a one, not like I would walk from Manhattan to Brooklyn for a slice (hell naw) (Puffy was a fool for that one, LOL). \n\nWhile I'm now the subject of Junior's cheesecake I must also admit I only order the original plain cheesecake when I go. Once I ordered their strawberry cheesecake and didn't open it until I got home and noticed that the strawberries where so over ripe that they were just hours away from being rotten and they tried to hide the fact by covering the cheesecake with this thick a-- strawberry syrup. Had I rented a car, I would had driven all the way back to Junior's and made the Chef, owner, manager, somebody explain this BS to me.\n\nSo therefore, I'm only going to judge their original cheesecake and I give it 3 stars, but I'ma take a star because it's overpriced and I'ma take away my New York curve (because all the food in NY is over-rated curve so I give them an extra star so that it doesn't seem like I'm being overly critical in comparision to other reviewers) because they tried to play me with the strawberries.", "author": "Luke B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "Best cheesecake ever. Don't try to argue with me because you will lose. Go to Junior's for the cheesecake, not the food, not the coffee, just the cheesecake.\n\nI can easily polish off a Chocolate Mousse or plain one. It takes me a couple of days (they are that big) but I am determined. I'm no quitter!\n\nGo to Junior's now.", "author": "Melizza R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Calamari is too salty and greasy, and steakburger is tasteless and not juicy.\nHowever, England Calm chowder is amazing!!!", "author": "Hans W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "The cheesecake is banging, but the actual food is \"meh.\" Go somewhere else  for dinner and pick up your cheesecake from the counter on your way home.", "author": "Mindy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-14", "description": "Cheesecake!!! That's why I come here, for Cheesecake Baby!\n\nThe Dinner is besides that nice, clean, costumer friendly and with a excellent menu with various choices. As you enter there is a Pastry section, continue to walk and you will arrive at the Dinner section, as you leave you will notice a Bar section.\n\nIf in NY you can not pass this experience, to prove it check out my picture...... you can almost taste it! At least I do, son!", "author": "Patrick R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Let's not even talk about the cheesecake. We shall hold up on that, make a memo, putting that aside, okay. My waiter was amazing, service was fast, the establishment is a landmark basically. Everything was quick, friendly, worth every penny. \n\nNow the cheesecake is so fluffy and creamy, it defies physics. Do yourself a favor and go on in and get a slice on a nice day, because even though the service is fast, the line should always and only be out the door and around the block. AND, and i think we shall all morn for those who are lactose intolerant. These poor souls. OK, done, now go get some cake.", "author": "Sareli J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-05", "description": "It was my birthday. Hubby and I were visiting NYC. That day, we crossed the Brooklyn Bridge, and went to Grimaldi's for lunch. I texted my brother (who lives in NY) that we are at this awesome pizzaria, and he texted me back, go get a cheesecake at Junior's. So.. I looked up the reviews. I couldn't resist. If I had one piece of birthday cake, it had to be this one.\n\nSo we took the bus from Grimaldi's. Walked into this really classic looking cafe/restaurant. So classic. Jazz music flowing around everywhere (my favorite music in this world!). It was so charming. I cannot remember the last time I went to a place that had those small classic coffee cup/saucer combo. So adorable!\n\nWe got an original and a red velvet. We asked them if they had a candle, and the server went, why didn't u tell us earlier!! Then he fetched a lady, and they sang happy birthday for me. And then the cheesecake,... The original was out of this world. So good. I agree that the soft bottom is better than the crunch crust that you'll find with other cheeesecakes. And the red velvet was awesome too, with that awesome cheese cream goodness between layers. Aah, so heavenly. Wish there were more words to describe the awesomeness of the cake.\n\nYes. I had the best cheesecake in NYC for my B-day.", "author": "Cassandra S Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "We'll today me and my hubby went in breakfast like we have done in the past quite a few times , but today my omelette was delicious and the home fries good . My hubby on the other hand found a piece of plastic stitched to one of the pieces of bacon , it was quite odd . We called the waitress over but she didn't think there was anything wrong with a plastic on the bacon and he was unsure if he ate a piece of that plastic . Other than that everything els was good as usual , the waitress was nice and attentive .", "author": "Jessica V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "What can you say about a Landmark?\n\nBelieve the hype...This is the place! \n\nIf you are looking for THE BEST CHEESECAKE, look no further than here!  Excellent food and service and simply the best!\n\nThey do not disappoint you in any way! It's the BEST!!!", "author": "Touro T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Whoever says that Junior's cheesecake isn't good is a FOOL. \nI went there yesterday with my gf.. I had a Devil's cake cheesecake, and she had a raspberry swirl cheesecake.. They were both friggin' amazing... I ended up ordering another slice, and I went for the strawberry shortcake cheesecake, which was good, but not as good as the other two. Next time I'll definitely try the chocolate mousse cheesecake, and maybe a strawberry cheesecake. \nAnyway at Christmas I tried S\u0026S cheesecake, and it was good, but not as good as Junior's... Sorry S\u0026S, but for me the crown goes to Brooklyn.. ( my gf agrees and she is form the Bronx, so this has nothing to do with being from Brooklyn or form the Bronx)", "author": "Gianluca I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "I went with three friends to a sporting event at Brooklyn's new Barclay Center. We had heard about Juniors which is a New York style deli restaurant that is famous for its many varieties of cheesecake. We took a walk to Juniors before the game (about a half mile down Flatbush Ave). The food was plentifull and reasonably priced. I had a combo pastrami/corned beef sandwich which was good, a bowl of acorn squash soup which was excellent and split a slice of black forest cherry rum cheesecake that was outstanding. On the table were a pickle bowl, cole slaw, corn bread \u0026 rolls all very good. The meal cost about $25 each including tip and we were all stuffed. It was well worth the walk from the arena to the restaurant and back.", "author": "Thomas K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Not the absolute best strawberry cheesecake ever, but almost.  Went early on a weekend and sat at the counter. Service was quick and friendly. Portions are very generous. A definite recommendation!  Try at least once!", "author": "Hanssy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "I've been going to Junior's for many years and I do like their Cheesecake, but the Strawberry Shortcake is to die for...the only complaint I have is that it's kind of pricey, but because their cakes are so fresh and tasty I won't hold it against them.", "author": "Janis R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-29", "description": "I've been to Junior's 3 or 4 times because I use to work in downtown Brooklyn but I have never had the cheesecake. I've had a burger here which was very big but didn't have any taste. I had a corn beef sandwhich which was pretty good but not that big. I also had a shrimp parm which was forgettable. The food here is average the problem is it's not worth the price they are charging but they get away with it because they have the name.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "OMG, I love Junior's! I've been to both of the Manhattan locations, but the Brooklyn location is the best. I took my brother here who lives in California and he absolutely loved his steak burger and my pastrami sandwich was awesome! Honestly, I really only come to Junior's for the devil's food cheesecake and it never disappoints!! The reason why the Brooklyn location is the best is because of our hilarious waiter Jason. He is handsome, quick witted and funny! I'll definitely come back to this location.", "author": "Ayesha E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "My uncle brought me cheesecake from here. UGHHHHHHS. It's so fricken delicious ! BEST CHEESECAKE I ever had. hands down.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "The cheesecake is so delicious. The food is good also. I love the 2 pastrami mini sandwiches with the beets, and potato pancakes with applesauce. I can't go there to much because I will be a pig. Lol. But when I do go I always bring home a doggy bag for later. I would recommend this establishment to everyone", "author": "Crystal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "Came here on a Sunday afternoon because of its reputation for having the best cheesecake. My boyfriend and I sat at the bar. The place was crowded, the waitress (although super sweet and attentive to us) seemed a bit rude and inattentive to others. I tried the strawberry cheesecake which I wasn't impressed with. My boyfriend ordered an apple cheesecake which tasted much better and had a firmer texture than mine -- his was much better!\n\nWould most likely not come back unless with friends who wanted to try the cheesecake.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "Staff has always been friendly whenever i go there. Love their trio platter with shrimp, chicken and ribs! Not crazy about their chicken tenders - too meaty and the French fries are fat, and to not very tasty. But I will go back because of the platter and their cakes. However, they are a little overpriced. The giant chocolate chip cookie looks very good also. Will definitely be trying that the next time u go back", "author": "Jess M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "I'm in Orlando, FL USA. My Aunt just sent my Dad a cheesecake from Junior's. It was my Dad's birthday present. He saved a slice for my wife and I. It was amazing! I have never been to New York and only now do I want to go....straight to Junior's!", "author": "James D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}