{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-25", "description": "I came to buy mini cheesecakes for my boyfriends birthday. It took them almost 7 minutes to come help me when they were just talking and laughing. I was the only one at that counter. Finally a woman comes with an attitude like my order was inconveniencing her social time. Tells me they are more then actually listed, looks me up and down and demands ID with my purchase. Incredibly insulting and as someone who also works in costumer service I can tell you, if I had her attitude at my job I would have been let go.", "author": "Renea R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "I was brought here by my New Yorker wife. She said you have to try the cheese cake here. \n\nI ordered steak burger with french fries and for dessert we got the famous cheesecake. I don't want to admit that she was right. The food was delicious but the cheesecake was off the charts! \n\nWe will be coming back for more!", "author": "Hussein B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "I went here on a date, and both the boy and the cheesecake were winners. We each ordered a slice of the plain cheesecake, and it was just under $6 for a slice. It was a very dense cheesecake, and it ended up being dinner for both of us. The crust wasn't a graham cracker crust, but I really liked whatever it was.\n\nThe waiters were very nice to us. They made sure we had enough to drink and didn't rush us out on a Friday night around 5:00 PM - 6:00 PM, which we appreciated. Is it the best cheesecake in NYC? I'm not so sure, but it was delicious.", "author": "Amanda J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "My Sister in Law was visiting New York with her Family and wanted to try Juniors,so after Our little Cirque Du Soleil outing at Barclays Center we headed to Juniors which only sits a few Blocks away .We are all Happy and Satisfied Customers,on Purpose all 5 of us ordered different dishes,like the Jerk Chicken,the roastbeef,the Southern fried chicken,The Crabmeat with Shrimp and The Mac and Cheese,everything was excellent .We also received Excellent service from when we walked in until we left.My Sister in Law is once again visiting in October and she had already mentioned to us to save some time during her visit for all of us to go back to Juniors.We all are in for it.", "author": "Katia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I love the red velvet cake in junior's restaurant!!! Also a little cheesecake in raspberry flavor they're so cute and yum!", "author": "PatieZara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "This review is for the staff here. I was here on a Sunday evening. They were very attentive, fast, with great attitudes. Food was decent", "author": "Medina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Yes! I'm so glad we decided to stop here on the way home from NYC. First, let me start by saying cheesecake is one of my favorite desserts, so I can be quite critical...but THIS!! I had plain and it was SO GOOD. moist enough not to need any toppings. It was creamy and fresh tasting. Next time, I'm getting a whole cake that I may or may not share!", "author": "Muslimah A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-23", "description": "People cannot be serious with this good reviews.  Must be employees or something.  Anyone who likes this food does not, (I repeat) DOES NOT know what good food tastes like \u0026 probably haven't eaten anything good outside the dollar menu!! \n\n I ate here 3 different times because I used to like the cheesecake.  The first time i ate here I was horrified with spoiled food.  The 2nd I tried this place because I couldn't believe how bad the first time was.  3rd time I only ate here because my date at the time loved this place needless to say I had trust issues with her for such a deplorable pallet (I had to leave her)!  \n\nHere are my disgusting meals in detail.\n\nMeal 1)  The breakfast tastes spoiled (worse pancakes in my life \u0026 the eggs were BURNT!  plus my orange juice was stale!)\n\nMeal 2) I ordered fish, that was terribly seasoned only on one side \u0026 it had no taste!  That is extremely hard to be that bad \u0026 I literally wanted to vomit after eating the steak fries.   \n\nMeal 3) I knew it was going to horrible I decided to give it a try because the person(idiot woman) liked this crap.  I ordered a simple club sandwich to be safe.  They put way too much mayo, too much lettuce \u0026 not enough meat needless to say if you cant make a sandwich, you do not need to be in business.\n\nThe best part about this place is that its closing down!! (YAAYY)  The cheesecake are good not great \u0026 there are many pastries places that cant do a better job that this.\n\nOnce again Thank good lord Juniors is closing down!  You cannot keep destroying peoples pallets \u0026 calling it food!  I would sue anyone that would try to feed this garbage to my dog!", "author": "Harmonie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "This place is awesome for large, casual groups! Extensive menu with pretty solid fare at huge portions. The complimentary bread basket is a thing of beauty and variety, haha. Don't leave without trying one of their New York cheesecakes! Great place to take out of town guests as well.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Yes the Original~ !!! \nYou are the reason I am FATTTTT.....\nHands down the best cheesecake (aside from mine of course.. heheheehe) .\nI know I know Clique but it is totally true. \nI came here to get a cake after the Puerto Rican Day Concert at the Barclays Center. I'm a traditional type of girl I go for the Strawberry Cheese Cake at Juniors. Surprisingly they have a secion only for ordering cakes (score!!) Plus I was so ravious that I might have bought two if I had the cash on me! \nThe cake was Amazing as always! \nI'm a customer for life :)", "author": "Ingrid A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "I went to Junior's in Downtown Brooklyn for New Year's Day, and I have to say I don't know what is the big hype about this place.\n\nI ordered Sausage, Egg (Sunny side up), Home Fries, and it came with an orange slice. The meal wasn't great, the eggs were runny and made me want to throw it away. The Home Fries was okay but I had better. The Sausage was pretty good. This meal wasn't filling at all.\n\nI can't rate the cheesecake because I am not a cheesecake fan.\n\nI would say that if you want to get a good breakfast I would say go to the Ihop's a few blocks away.", "author": "Antonio L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "For a place that I just stumbled upon, this diner was on point. First pretty taken back by the prices of everything on their menu - like $8 for a milkshake or $17 for a cheeseburger. But once I got the food I realized that it is totally worth it. \n\nAlso very rad vibe to the place that seemed like a mix of classic 40's diners and the diner scene from Pulp Fiction", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Family friendly, food is great i really enjoy the breakfast! And of course the strawberry cheesecake! Yummy", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Solid breakfast food, fast and friendly service, and of course, phenomenal desserts and cheesecake.", "author": "Matthew H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-24", "description": "We went to Junior's because it's a Brooklyn classic, and my cheesecake-loving friend wanted to visit it before she went to Texas.  We were seated immediately, and I asked for a drink menu while my companion went to the restroom.  \n\nWhen the waitress came back to take my drink order (I had to catch her eye, since she was busy chatting with a few other waiters, and then wait for her to set up another table before she came over) I asked what frozen cocktails they had; she listed three, including one I hadn't seen on the menu.  I asked what was in it, and she replied, \"Oh, I don't actually know.  Rum, I guess.  They all have rum in them.\"  \n\nA glowing recommendation like that, how could I pass?  The drink was good; it tasted like a piña colada, except that it was blue.  My companion came back as my drink order was being taken, and when she declined, the waitress kept asking if she was sure, until my companion said she wasn't interested in drinking. \n\nThe menu was kind of limited; if you don't eat meat or seafood, there's only about 5 different things to order--and if you're vegetarian, I really hope you like cheesecake. \n\nWhen the waitress came back to take our meal order, my friend asked how the turkey sandwiches were, and the waitress said she didn't really know, that she didn't like turkey.  My friend asked about the burgers, and the waitress said, \"They're okay.\"  I asked her what she DID recommend, and she said, \"The dinners.\"  My friend said that she wasn't interested in a dinner because she didn't want a big meal, and the waitress just kept recommending the dinners, (\"Oh, we have a turkey dinner, you know.\")  \n\nMy friend ordered a burger with grilled onions; her burger came with no onions on it, but onion rings on the side.  I got the southern fried chicken, which came dripping in grease.  It was delicious, but after about 20 minutes, the bottom was totally soggy from the grease dripping down.  The portions were very generous, but when we asked to take them home, the waitress came over with two boxes, took a fork and plunked my leftover chicken in it, and then put the fork into the plate of ketchup.  After I wiped the fork off to place the mashed potatoes on them, the waitress kept putting things on the plate I was still using, clearly ready for us to go.  She got a strawberry cheesecake which she said was delicious; I passed, since a 20% included gratuity  on a cheesecake I'm taking to go isn't really my speed. \n\nIf the restaurant had been crowded or we'd been lingering, this would've been a little more acceptable, but it wound up just leaving the worst taste ever in my mouth.  For $30 a person, I can get a lot of fried chicken, and a lot of mysterious blue drinks.  I'll skip Juniors and go to one of my other Brooklyn favorites.", "author": "Ilysse W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "Great cheesecake! \nSandwiches r good, meaty.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Gotta love Junior's on Flatbush. Diner/cafeteria style fare that will surely clog your arteries if you eat here too often. It's a Brooklyn institution, classic throwback atmosphere right down to the waitstaff uniforms.  Yaaasss, the cheesecake is good. I am not a sweet tooth though so am not gonna rave over it, I will say the seasonal pumpkin cheescake is the bomb.. Ok, on to the food. Love the complementary pickled beets, cabbage salad, and garlic dill pickles they put on the table. It's an immense menu. They make a really good chargrilled burger (hello bacon-cheesburger with steak fries and onion rings.. nom nom nom)..  and a true trip to the ER (heart attack on a plate) the \"something special\" sandwich.. a brisket sandwich where they use potato pancakes in place of bread.. out of control.. Also worth mentioning the corned beef and pastrami combo sandwich - two petite onion rolls, one topped with pastrami, the other topped with corned beef - the best of both worlds! (Corned beef, pastrami, and brisket are not epic like Katz's but they're good).  I've eyed the fried chicken for years at neighboring tables but have not tried it.. so tempting... The Hungarian Goulash is not bad, my dad likes it..  Ok now get your prescriptions for prilosec (acid reflux), lipitor (high cholesterol), and benecar (high blood pressure) ready.. you'll need them after this meal :-P.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "I've been coming to this place since I was a little girl...I probably tried just about everything that they serve here... The food never disappoint me.. Service is always prompt..", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-06", "description": "People love this place because the cheesecake is legendary. The food in general? Godawful.  Everything's back in a freezer, slapped together from a low quality set of materials, and the atmosphere is crusty--hanging onto its long-ago legendary image. \n\nThey could easily revive themselves, its now a Borough of Foodie.  They don't have to fancy up, they just need to use fresh ingredients, and have a feeling for cooking!! \n\nSad.  \nBut again - look at the reviews; people love the cheesecake and so are blinded to the poor quality of the actual food.", "author": "kevin d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "A Brooklyn institution for so many years, Juniors does not disappoint. My family and I went for breakfast and it was perfect. The food ordered was delicious as well as the pastries they provide. \n\nFor me, the decor is even better than the food. It is the history of the greatest borough in NYC. Pictures line the walls of the stars that hail from here as well as a tribute to the Brooklyn dodgers. \n\nIt's what Brooklyn is all about. And make sure you have some world famous cheesecake.", "author": "Mike V."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}