{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "Hard to write a fair review when we only got the cheesecake.   As famous as it's supposed to be, the cheesecake fell short of expectations.   Maybe we hyped it up too much, or maybe we gave it more credit than we should've, but the cake was underwhelming.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "Made it to the motherland today!  The original location!  I have mail ordered many a cheesecake from Juniors and they have all been delicious.  After Di Fara we drove over here to get a cheesecake to go.  We were going to go with straight up strawberry but they didnt have any plain.  They only had one with a crumb topping.  We got a small one and I was hoping and praying that crumb topping didnt mess it up.  Well....it might have made it better.  The crumb topping is the same type of crumbs they use for old school candied apples.  It was soooooo good!  Juniors does cheesecake with a sponge cake bottom.  It was so rich and delicious.  The strawberries were great and that crumb topping set it over the top.  \n\nJuniors makes the best cheesecakes in the world!  Hands down!  It was amazing as usual!", "author": "Tim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "This is a great casual spot to get a hearty meal for a reasonable price.\n\nPros:\n-massive portions\n-wide selection of food\n-everything you want in a diner\n-reasonable price\n-friendly staff\n\nCons:\n-only thing that wasn't on the menu was grits! (My favorite brunch side)", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Expensive for breakfast food but good quality. Coffee was good too (we're very picky about diner coffee). Service was so-so. Our server seemed annoyed at life. Large dinning area so either they are always packed or it's not to hard to get a seat. We went in the off hours so we can't tell.", "author": "A T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Okaaaay, I'm not sure why this place is so famous but don't believe the hype. It's extremely overrated. If you go, get the cheesecake and ONLY the cheesecake, which was good but not just out of this world amazing. Unsure what type of food this was supposed to be, but they started our experience with beets, pickles, cucumbers and Cole slaw for appetizers. How random. None of the entrees we ordered were tasty. Nothing. I'm being generous with 3 stars.", "author": "Vikki P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "THIS is the Junior's to go to. The one's in Manhattan are okay, but the reason you go to Junior's is for the cheesecake, and they're just bigger/better here.\n\nBeen here several times (which is a trek in itself) - and each for the strawberry cheesecake. The rest of the menu is just okay, standard diner selection with egregious portions. I want to come back and try different cheesecakes, but it's hard not to pick the best (especially since they're so large).", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "Pretty good food, but for out of towners and tourists such as myself, the real reason for visiting was its frequently touted \"best\" cheesecake of NYC. To be fair, that's a reputation that builds up a high expectation. \n\nThe cheesecake does not live up to the reputation and is especially disappointing given the high price of a slice. It's good, but nothing to rave about. If the numerous advertisements about Junior's cheesecake all over NYC didn't give a hint, this place is yet another establishment on NYC's list of over-hyped touristy food spots.", "author": "Diana X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Heard how their cheesecake was a must try and indeed it is! The best I've ever had. It was so rich, soft, creamy, dense, and the perfect amount of sweetness. Very traditional and even the cake crust is perfection.", "author": "Dianna N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "I don't get it.  Someone please tell me what I missed here.  The service was terrible.  The food was bad.  The prices were not reflective of the quality.  The place looks dated.\n\nSo we were plopped down in the middle of the restaurant at one of the worst tables in a sea of emptiness.  Our waitress was very cold, not very attentive, hard to get to do anything for us.  I think she was trying, but it didn't seem like she was in the right line of business.  Some people can do this job, some can't.  I, for example, would throw things in people's faces.  That's not a good trait for a waiter, so I avoid it.\n\nSo I had a sandwich and paid extra for everything, including for the non-upgrade tasting rolls I had it on.  It was your pretty typical deli sandwich, nothing special.  Dry meat; we had to beg for something to put on the sandwich.  The potato salad was . . . fine, I guess.  It was way overpriced for what it was, even for here.\n\nWe had dessert, figuring that their cheesecake seemed to be what makes them famous.  It was fine, but it wasn't anything special.  The poundcake crust (or whatever cake it was) seemed like an odd choice.  The cheesecake was very dry in about 1/3 of it and the raspberry flavoring only barely resembled a raspberry flavor.  I can throw together a better cheesecake in a couple hours, and can make a far superior cheesecake with more time.\n\nI'm giving two stars because it wasn't terrible, but it's definitely overrated.", "author": "Ryan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Wow! I have to admit- THIS PLACE HAS THE BEST EFFING CHEESECAKE EVER! If I had to choose one word to describe their strawberry cheesecake, it would be HEAVENLY! Definitely worth the 220 mile drive from Boston to Brooklyn!\n\nP.S. The buffalo sauce is also ORGASMIC!!", "author": "Safat I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "My husband and I and our two kids went tonight for the first time and we were pleasently surprised! My husband order the ribs and fried chicken and couldn't finish it. He said it was delicious..\u0026 being a southern man that's a huge compliment! I had a garden salad, steak, mixed veggies a baked potato and lobster tail and some red wine. It was so good. I love good steak I like mine dark on the outside but nice \u0026 juicy on the inside lol. It was juicy with every bite!! We ordered linguine for the kids and they loved it. After we ordered two slices of the cheesecake. I had the chocolate moose and my husband had the apple crumb. We sampled each others and I just took his. The kids \u0026 I tore that apple crumb cheesecake up..my husband said do you want to get one to go? I said heck no..Addictions are too hard to quit..and I'm not pregnant so I won't have an excuse!! Now that everyone's sleeping I'm regretting that decision though...", "author": "Jackie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-24", "description": "Went to the original Junior's after loving the food and cheesecake from the location in Times Square. I was thoroughly disappointed. we ordered a variety of items and everything tasted dry and old. The restaurant itself is just a flashy version of a mediocre diner. Maybe it was an off night? Nonetheless, I'll be sticking to the location in Times Square.", "author": "Benish P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "We went for a snack. The cheesecakes were excellent. We tried red velvet, plain (my favorite), sugar-free and the strawberry topped ( they didn't like the gelatin on top and wished they got plain). Our service was great. Our waiter was so attentive, even though we weren't eating a full meal. Someone got a matzah ball soup that they liked and a lean pastrami sandwich, which they liked, as well.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "My favorite is the strawberry shortcake! This is probably the only thing I can eat a whole piece of myself. The lemon meringue pie was good too. But the sourness of the lemon becomes overpowering after a few bites. I also had the chocolate swirl cheesecake. But was only able to take a few bites too because of the thick texture and sweetness.\n\nBesides the desserts, I also tried the bacon cheeseburger. I've had better. It was nothing special with the burger.", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-23", "description": "Came here for a slice of cheese cake.  Tried the strawberry topped slice.  It was delicious, creamy and rich.  The strawberries were fresh and sweet.  I can't say I'm a fan of the cake \"crust\".  (I know it's \"cheese cake\", but I prefer the more typical graham cracker, or crushed cookie crust).\n\nOverall good, but nothing that would put it leaps and bounds beyond other quality cheese cakes I've had.", "author": "Nick G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Was in the area with my kids so decided to eat at Juniors..\ndon't know what all the fuss is about!?..the food is ok nothing to brag about..the place needs a makeover looks abandoned. it's accumulated with dust!! if you don't believe me next time you visit..just take a good look \u0026 run your fingers on the edges of the booth \u0026 the decor...YUCK!!!!!!", "author": "Jessie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "Service varies from person to person but I personally didn't have too much of a problem with the service when I went. The food is decent and good but nothing I would go out of my way for. The only thing I'd crave is their devil's food cheesecake. That thing is bomb. I want one right now. It is almost eight bucks a slice but the slice is massive and extremely decadent. If you can finish that slice in one sitting... Props to you. It is so heavenly and rich. Okay, enough adjectives. Just go get one.", "author": "Sally K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "I came here in a bad mood because of my recent ex lol.  I just wanted to treat my self to yummy food...people kept asking if I was dining alone and I was getting irritated because it was a constant reminder I was alone. Carl my waiter made sure I left with a smile at the end of the evening. I have never had a more attentive waiter ever...he recommended really great items off the menu, since I couldnt figure out what I wanted. He is a true gem. I never felt alone or had to ask where my waiter was... kudos ill definitely be back.", "author": "Sherri D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Just a classic in Brooklyn.    \nService 10- complimentary  cole slaw, pickles and fresh and hot corn bread.  Oh and bread buns.      Ice water always serve,  always refilling your glass\nFood 10- we try the Reuben, rib plate and the rib shrimp plate.  All huge size portions, serve fast and at the correct temperature.    All dishes were great.\nDessert 10  their famous strawberry cheesecake  was delicious.  It's a classic cheesecake topped with fresh strawberries within a kind of strawberry jelly. Was great, is the kind of real cheese, not the commercial fluffy or light cheese cake.    In others word not the commercial. Hello type cheesecake\nWe also try the chocolate swirl, also great.\nRestroom and general- 3.5.    Why the bathrooms are in the second floor.  And the stairways  are not kind of friendly.   I know that their is handicap or family in first floor; but is only one.     Also the furniture and all wood elements need a kind of retouch.", "author": "Al V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Just tried Junior's for the first time thanks to Steve S. Wow it's an institution. Their menu is absolutely phenomenal. I went with the brisket potato pancake sandwich with au jus gravy and a chocolate egg cream. My friend Hough Sue and Steve went with the hamburger. Hough had a pastrami hamburger. OMG. Then for desert we shared a cheesecake with vanilla ice cream. I am so glad to finally try this place   Way to go Junior's.", "author": "Andrew G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}