{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "This is the quintessential New York restaurant. I love love love it. We had an amazing assortment of everything. We stopped in for light snack of coffee and shared cheesecake. We ended up with a giant platter of huge crispy  latkes with sour cream and apple sauce, rich creamy split pea soup (vegetarian) and bowls of lovely cole slaw, beets and pickles. Oh gosh, the rolls and corn bread are delicious. Amazing! We were so stuffed, we ended up bringing the cheesecake home. We have plans fo it..I remember it as the best cheesecake in the world!\n\nOur server was the incredibly charming Jamari.  He was smiling and gracious for our entire visit. I would go back in a heartbeat and ask to sit in Jamari's section. He was so sweet and very tidy. The food, the fun atmosphere and the delightful Jamari made this a perfect visit.\n\nHighly recommend!!\n\nGo see Jamari!!!", "author": "Diane W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Drove all the way to Brooklyn after a long day in the city just for some Junior's cheescake because I was told that they were that good. And people were right- it was well worth the drive!\n \nWe got a strawberry cheese pie (one of their most famous) and a chocolate mousse cheesecake to go. Both were DIVINE. So light, decadent and not too sweet. Out of the two, the strawberry cheese pie was my favorite!! The huge, fresh strawberries and strawberry glaze really add a nice touch, making it different from your usual cheesecake. You can bet that I finished every single bite and was licking my plate to make sure I didn't leave a single crumb or drop of glaze--now that's when you know you got some amazing cheesecake!! :-)", "author": "Christine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Friendly and helpful staff! Good location.. The cheesecake was very good but the strawberry gel type topping was just okay. However, the cookie and butter pecan ice cream was \"out of this world\" good!! A bit more expensive than you'd normally pay for this type of food in Indiana, but glad we tried it.", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "This was an unexpected treasure of a dinner in NYC. I had a Jamaican jerk chicken that was outstanding. And like some old-school supper club, they brought out a bunch of relish plates with pickles and beets and cole slaw, all of which were just excellent!\n\nThe server was super nice. Not the fastest but the rest of the experience more than overshadowed that.\n\nJust an excellent experience all around - absolutely loved it", "author": "Steve G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "Dined: 9-24-18\nLate dessert\n\nI love cheesecake! I heard about this restaurant and wanted to check it out since we were in New York. I was going to try the pineapple cheesecake, but settled for the strawberries. We also ordered a red velvet cheesecake. They were not shy with the slices. The cheesecake was moist and flavorful. I could not eat it all and therefore, had taken it back to our air bnb. The restaurant was not busy at all because we had dined late at night, like past my daughter's bed-time.  This restaurant is one of those nostalgic feels, I love these!  Perhaps the next time, I am back in New York, I will try their other foods and that pineapple cheesecake.  \n\nThank you.", "author": "Pilar B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-25", "description": "Not sure what the fuss is about. Big portions of cheesecake (split one slice between 2 or 3 people), but painfully average. You can find an equal slice from a decent grocery store. I suspect the 2 locations in Times Square bring in hungry and cheesecake depraved tourists that love it.", "author": "T Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-02", "description": "Best cheesecake I've ever tasted this is the true definition of New York cheese the cake was very rich and the strawberry were nice and fresh very tasty! I only give four starts because I didn't go inside the restaurant my husband did so I cannot comment on the cleanliness of this place and I only give four stars because just for two slices of cheese cake to go it took him 35 minutes just to get the order so the place was super busy! But hey it's Brooklyn right", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "Okay so the food was GREAT. But the service was the worst I've ever experienced in my life. This guy didn't refill our water, we had to actually GET UP to ask for creamer because we were so unattained, didn't bring our pickles and coleslaw, we had to ask another waiter, and last but not least, we had to ask for the bill 3 TIMES. That's crazy. \n\nTerrible terrible service but honestly the food was great, I got the \"chicken on a bun\" sandwich. Which was actually on challah bread with a side of honey mustard, it was huge and tasty. I wish I could give more stars but the service just sucked.", "author": "Chrissy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "A friend recommended this place to me. I had the New Yorker. It was amazing. I've never has anything like it!!!!! A slice of cheesecake over a milkshake. The service was quick and attentive. I had a great experience. Its not a 5/5 because there we found a tiny bugs on our first New Yorker. They were very gracious and swapped it out.", "author": "Alina Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Friends recommend New York cuisine, delicious cheesecake, delicious, dense, thick cheese taste, big push New York must eat", "author": "Kao K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "What can I say. The cheesecake is incredible. Never fails and it's so good I brought 2 slices.", "author": "Canineya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-16", "description": "I have been here many times in my visits to New York and the service this time was HORRIBLE. Waitress name was Arlene. We all told her Good morning and crickets. we were a group of 5. She had a Fuchi face and was not happy to be there. Definitely a 9-5 / paycheck only type of person. When i have gone there before they give you complimentary bread at the beginning, usually before you order your food. She brought it when they were bringing our food. She brought our food but we had to remind her to bring us our drinks. She forgot the syrup for the pancakes. I asked for brown sugar for my oatmeal She looked at me like she didn't know what i was talking about. She then brought me a brown packet that had sugar in it. (Pure Sugar). She said - \"that's all i have\"  She brought an extra OJ and an extra Coffee and set them down in front of one of us as if we had ordered it. - maybe it came with the meal - We don't know because she didn't tell us if they were or weren't. She just dropped them off. \nThe only time she spoke to us was when she brought the check. At that time she smiled and said thank you. She even put a happy face on the receipt with \"Thank you\" at the bottom.  \n\nMy experience there has always been great, friendly and very attentive. i'm very disappointed.\n\nArlene if you read this i want to let you know that the recommended tip was 11.10 / i gave you 5.00 out of generosity.  Your service was short of a penny. I honestly wish i didn't leave anything. When you took the receipt you were mad and your attitude and force when you took the receipt was horrible customer service. You made the situation Awkward for my group as a whole. We felt unwelcome not only based on your reaction of the tip we left, but based on the service you gave. What was even more unprofessional was the fact that you then went to several of your co-workers to show them the amount of the tip we left you. Imagine if we didn't leave anything. That would have been more embarrassing to you. But i didn't want you to think i forgot to leave you something. \n\nI hope you take this as the rest of your TIP - Pay attention to your customers. Focus that you bring everything to the table at the time you serve them. Don't make your customers chase you down. Don't speak bad of them when they are watching you. and most of all - EARN YOUR TIP - a tip is optional.", "author": "Tamara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "Juniors cheesecake did not disappoint. The cheesecake was fabulous and everything that I have ever heard about it.  The service was a little slower than expected considering that it was not crowded.  But the atmosphere reminded you of an old diner and or old what a burger.  \n\nI would definitely recommend visiting if you like cheesecake.  Oh and the cheesecake does not have a graham cracker crust which is a huge plus.  So yummy!", "author": "Toni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "So good? Then why are they hiding (See and click on bottom of reviews page) over 195 hidden all negative but thorough and accurate reviews? \nHad to give it stars so it maybe might not get hidden. \nUsed to love going here often until about 10 years ago before it went to sh*t....around the same time they started expanding. Just low-bar awful now. Greed ruins everything.", "author": "Disco .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-11", "description": "Service was okay and the food was okay. The cheesecake is good and it cost about $8 for a slice. Turkey sandwich for $16.50. It came with a Russian dressing for the sandwich. This was okay. The bread was not toasted and was bland for what it is. I think the food here is alright except for the cheese cake. I would just come here just for the cheesecake.", "author": "Irene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "So I'm not much fan of cheese cake...plain cheesecake \nBut we HAD to go here while in Brooklyn \nIt was ok", "author": "Jeff U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-01", "description": "On Friday 2/1/19 I attempted to order two cheese cakes from the 800 958 6467 number ...this is the Kansas site.they were not able to complete order...Supervisor refused to get on phone to handle the problem and Orion person did not know how to deal with customer (me)..... terrible ordeal..Orion refuses to give me Corporate number..this is not the Juniors I dealt with in the 1980's....terr", "author": "Vic M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Two stops in Juniors - one for a late night club sandwich and another for a slice of their famous cheesecake. Three things to watch out for - first, the service is heat, second, the quality of the food is excellent, and three, the portions are enormous!\n\nDefinitely will go back but with an empty stomach!", "author": "Brett B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "Love this place the shakes are on fire, pastries are real and the atmosphere is fire. I will visit", "author": "Christian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "I went here on a Friday for lunch with a colleague. I never realized how huge this place was! I think it's been a decade if not longer since I came here but since it's an easy place to find I chose it for lunch. I had the burger that comes with pastrami- it was good! I would say if you come here bring your appetite I was not prepared! They start you off with pickles, then a sauerkraut/coleslaw,beets, big slabs of cornbread- all before your food makes its way to your table. The service wasn't too fast which is always disappointing when it's prime time for the lunch rush. Our server was pretty lackadaisical about being our server which was annoying. \nI would come back to Juniors with more of an appetite so I could eat all the extras the bring out and get some cheesecake.             (I didn't take any pictures because everyone knows what Juniors food looks like)", "author": "Kia A."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}