{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "The original and iconic Juniors restaurant in Brooklyn. This place has been accused of being commercialized but when a brand becomes so well known they are inevitably popularized. Of course this and every review is based upon my experience at the establishment. \n\nMy original mission was to go and try the famous cheesecake only. The place itself is very big restaurant. I was expecting a smaller type bakery with the different cheesecakes but it was a lot more.  They have a large display area with the cakes and adjacent to the take out area (which had a long line of people).  \n\nAdmitted I was a bit lost at first. I walked into the dining area toward the bar because no one was acknowledging me. They have kiosks in certain parts of the restaurant. I got the attention of a waiter and he informed me that I should go back to the front area where someone will seat me. A young lady who smiled at me earlier saw me and asked if I needed help. She helped me to a table and got me a menu. \n\nI was very happy to find that they had an awesome selection of hot and cold foods. The waiter was a polite older gentleman who was helpful. I saw they had a chicken pot pie special and he informed me that it was a large plate and should be more than enough food. And it was a large helping of delicious chicken pot pie. \n\nI then ordered a supplemental stacked turkey sandwich that was a lot of food but I finally felt full. Then came time for dessert. The popular dessert I noticed being ordered around me was the original cheesecake and strawberry. The slices looked not too big even though I had already ate a lot. I had decided before that I wanted the red velvet cheesecake and it was quite a hefty piece. \n\nI was only able to eat about half the slice and had to take the rest to go. \n\nOverall it was a good experience despite the confusion and lack of acknowledgement when I first arrived. Shoutout to the young lady who helped me in the beginning and my server. \n\nIt seems this place is busy regardless of what day. But the staff is attentive and they have a great selection of food and desserts. They have a a steady crowd of regulars/locals and visitors. \n\nI would say at least worth going to once to try it if you get an opportunity.", "author": "Gregory C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Cheesecake and coffee with two friends from England.  Window booth; friendly service, nice decor, good music.\nThe cheesecake is dense and delicious.\nKitschy, with Brooklyn touches, really comfortable.\nClassic", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "OH MY GODDDD. Best cheesecake I have EVER had in my life. I can't even think of a cheesecake that even comes close to Junior's. Jeez, it was so creamy and light. The strawberry topping was to die for. My boyfriend and I shared one slice, but I now wish we had both gotten our own. The cheescake was so decadent and I wanted to savor every bite. I often close my eyes when something tastes so amazing, just so I can enjoy it more, but every time I opened my eyes I would notice that giant chunks were missing. The Bf was eating more than his fair share! I guess he was enjoying it just as much as I was. I can't wait until the next time I am able to come back to Junior's.\n\nI hear that Junior's is closing so that a developer can tear it down for luxury apartments or something like that, so I really hope they open up a new location!! I would be so sad if Junior's   no longer exists by the next time I come back to the city.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Came here for some strawberry shortcake and an egg cream and wasn't disappointed. There's plenty on the dessert menu I could scarf down. Hope to come back when I am back in the area... for cakes only, obviously.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "My date and I came here on a whim last weekend and I was pleasantly surprised. First of a all I appreciated they there are open late and even at the late hours had great customer service.We were sat immediately and our server Kristopher was very kind and attentive. \n\nThe atmosphere is very throwback, very classic kinda 70's feel. The same rings true for the uniforms the staff was wearing, oldschool classic. Just a great feeling of nostalgia all the way around.\n\nAfter we ordered our food and drinks we were served a assortment of complimentary snacks ( coleslaw, beets, pickles, bread, and cornbread) Our wait time was a bit longer only because my date ordered steak. Even then, it was still pretty prompt.\n\nI ordered french toast with eggs and turkey bacon. The french toasted is breaded with a light crispy....I actually have no idea what.... of tastiness\n\nOverall the experience was great. \n\nand for the famous cheesecake?!\n\ndrum roll pleassssssssssssssssse\n\nMy date took mine :( \n\n*tear*", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "The cheesecake here is definitely the best i've had in NY, it really lives up to its reputation and while I probably had more than I should have, I regret nothing. I'll be back soon to try out their other cheesecake flavors", "author": "Erick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Juniors was right up the street from our hotel so we had breakfast there one day, and enjoyed it very much.  Excellent, professional service made for a great experience.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "An Institution!\n\nJunior's Restaurant represents all things Brooklyn! So glad they did not sell out to the gentrification of Metrotech and the Barclay's Center... the last piece of Old School Brooklyn that is left. \n\nSo many items on the menu I have enjoyed and the overall service brings back nostalgia... but one thing I have never done at Junior's is breakfast! I was not disappointed... who knew their pancakes was all that? Evidently me! \n\nIn short... this is my new breakfast spot. Thank you Junior's Family!", "author": "Corey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-28", "description": "Good dessert!\nWayne, our waiter was a gentleman and funny \nHe also put up with my sister  \"bougie\" attitude (dairy free girl)\n\nThanks Wayne (older guy)", "author": "Tammy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Here is a pretty fair assessment of Juniors. My parents have been coming here since they were children back in the 60's. The food to them was God. \n\nWe came here tonight after the Yankee game to get a feel of what this place was about. We sat down and were greeted by different people. The first guy brought us water. The second guy brought us complimentary sour pickles, beets, cucumbers and coleslaw. We waited a while for our waiter. A gentlemen came up and told us our waitress was busy so he was taking over. \n\nAfter we gave him our order our waitress came over to introduce herself. Everything was great so far. First thing out was the matzah ball soup. Soup was ok. Not the greatest otherwise this review would be 5 stars. 1 matzah ball in the soup a couple of noodles, which were raw and hard which we told the waitress. The waitress never took the soup off the bill but that's here nor there. Just wasn't what we were expecting.  \n\nNext came the potato pancake. That totally redeemed for the matzah ball soup. Very thick and big pancake. Good sour cream. Did not taste store bought. \n\nThen came our pastrami Reuben. Also very, very good. Then we got our gut on and ordered the cheese cake piece! Ohhhhhh man was that good and a big slice !!!\n\nOverall the soup killed the 5 star rating and on top of which never was discussed to take it off the bill or what have you. For 40 dollars and we literally sat in the for 45 minutes they probably could of came up with something. Also considering they fed us raw pasta. Everything else was great !!! I would come back again!", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Always a great visit a big kudos to George Tim Melissa always a pleasure service is top notch food is great a real gem", "author": "Sherry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "I'm a born and raised Brooklynite till this day and I still love Junior's. It continues to have that old school vibe and original decor that you can't get anywhere else. The pastrami on twin buns is my favorite along with the red skinned potato salad. Yummy pickles, coleslaw and pickled beets are always served before your meal. I also order an old fashioned chocolate egg cream which is slurped down to the last drop. After all this I'm so full but will always make sure I take home a nice slice of the strawberry cheesecake pie. By the way any flavor cheese cake is delicious and I can attest to that!", "author": "Emlyn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Had a meeting just around the corner, so decided to come by here with some work associates from out of town. They had all heard of Junior's but never had the opportunity to try it. Obviously we came for the cheesecake, but it was lunch time so we got sandwiches as well.\n\nI had no idea how good their actual food was going in. I got a combo Ruben (pastrami / corned beef) and it was very good. So good I'd probably come here even if it weren't for the cheesecake. They gave a huge bowl of Russian dressing on the side, so you can add to your preference. I like Russian a lot, but only like a little on a Ruben, so I greatly appreciated that. Others had different Rubens and a turkey club - great reviews all around. \n\nThen for the cheesecake - the best there is. They don't have quite the 'specialty' options that some places have (thinking along the lines of cheesecake factory), but they do have a bunch of options and they are all light years better than anywhere else. I've never had a piece of cheesecake that's a quarter as good as they have here. \n\nAll in all a great experience. They seemed a little understaffed, even though it was a pretty quiet lunchtime, so it took a little longer than we would have liked.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "I came here with one of my buddies for a quick dinner. I never sat in the restaurant before but I've ordered the cheesecake a bunch. Hands down juniors have the best cheesecake. However the food here is not that appetizing. They have diner-styled dishes. My friend and I both ordered a burger and it was massive. The patty was cooked fine, I should've gotten medium rare. I asked for medium well and it was a little dry. The burger wasn't bad but I wouldn't go here for a 20$ burger. The service was also a little bit slow. Each server manages their own tables, and when someone's backed up with customers, the other servers don't try to help out. I was waiting for water for a hot minute. I recommend this place if you're lookin for just cheesecake.", "author": "Henry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Good service, basic all-American diner food cooked very well, and pretty good prices. That's all there is to it, lol.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "EXTREMELY large portions...share with a friend! The potato pancakes were GREAT (and the size of my head). Matzo ball soup was yummy. Roast beef Reuben was on point. Service was fast. Cheesecake was disappointing. I know. It's Junior's. It was ok but tasted less than fresh, more on the stale side, actually.", "author": "Lisette R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "I love this place from the first time I went for my 8th birthday in 1987, when they had the gigantic burgers til now. I do appreciate them leaving this place with the old school feel, it makes it feel like the real BK. Ladies if you're looking for an old money zaddy, this is you're place ! This will always be a place to eat at with the family or a first date(if you're date never been here), or date night. The Alamo (Albee square mall) movie theater is a 2 minute walk. It's just so Brooklyn. The prices are steep but you do get your money worth  The service is a lil blah, but lines go quick if you're just getting slices.", "author": "Lipstick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Nice, comfortable restaurant, attentive staff, varied, good selections on menu, tasty food. A bit pricey", "author": "Maria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I was in the office with my Co-Worker when she let me know she was hungry. She asked me to come to \"Juniors\" with her. I wanted to go for awhile so of course I jumped on the opportunity. It was a 10 minute walk from my job and the weather was perfect, so we headed out. When we approached I noticed the size of the restaurant. Some advice is to not take a car, police sit outside and write tickets so if you forget to add money to the meter be prepared to get a ticket. Coming inside this place is beautiful! I like the many different areas in the place. It was very busy and judging by the smell of food inside I knew why. They have seating by windows facing the street which we sat at. The chairs are comfortable but have seen better days. Our waitress was very pleasant and talked a lot, but she seemed overworked because she forgot a couple of things we asked for. I got a burger with sautéed onions and she forgot my onions. My Co-Worker asked for a lemon with hot water and she had to ask twice. Once the meals came out all the errors were forgotten. The burger was amazing! The onions (once I got them) were delicious. I never had sautéed onions so caramelized and flavorful. The burger was thick and juicy. I truly enjoyed the meal. The menu is a bit pricy, but well worth it. I will definitely come back again and try more items from the menu. Someone from Yelp told me to try the cheesecake, but that's after my diet. But this is definitely the place to be.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "I know Junior's Restaurant is a full fledged restaurant, but let's be honest: this place is known for their cheesecake.  I was in downtown Brooklyn and decided to pick up some cheesecake to take on my way home.\n\nFor their to-go orders, Junior's has a nice system set up right next to the entrance.  You can see all their cheesecakes on display, and the service was exceedingly rapid.  I just went up, told the server what cheesecake I wanted, and then he boxed it up lickety split.\n\nOn this visit, I got one of their small, strawberry cheesecakes.  The strawberries were huge and flavorful, but my favorite part is the macaroon crunch that covers the edge of the cheesecake.  It's a pricey dessert, but I think it's definitely worth it!", "author": "Keith H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}