{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I come here with my son when we are in the neighborhood because it's one of those iconic places that everyone should visit when in Brooklyn.  The staff is always very pleasant and the food consistent. And like any good diner, they offer the classic starters of bread, coleslaw, pickles and beets. \nI highly recommend the chicken pot pie, chicken parm, and the BBQ items. And of course their cheese cakes!", "author": "Macy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "Juniors in Brooklyn was slated to close a few years back but due to the dedicated and loyal Brooklynites who hold this landmark in high regard it has been saved from the brink of extinction.\n\nThe location is right on Flatbush Avenue just a block from Albee Square where Trader Joes, Target, Alamo movie theater, and Century 21 but most importantly a massive food court of eclectic and expensive stature.  There are no half stars otherwise this would receive a 3.5 from me. It loses the half star based on prices.\n\nThere is also an Applebee's restaurant across street and a few blocks from a few small boutiques and fast food locations. Being there is no shortage of eateries in areas demands Juniors stay on top of it's game. Barclays Center and LIRR are just a few long blocks away as well as BAM including all the eateries that serve the visitors at Atlantic Center (restaurants there as well). \n\nIt's across Flatbush from LIU. Don't even think you'll easily find street parking here because you won't. The traffic is crazy around there. The Manhattan Bridge empties straight down the block, and the Brooklyn Bridge a few blocks away.\n\nThe location is handicap accessible with ADA restroom (not for other patrons) on first floor, and the restrooms for the rest of us will require you to climb a set of stairs (their private dining area is upstairs).\n\nThe first thing you encounter entering Juniors is their dessert and 'other' takeout counters. The restaurant is pretty crowded in feel. Moderate noise levels.\n\nService for us was prompt. One of the few deli style restaurants in New York that still provide you free pickles, coleslaw, and pickled beets!\n\nPricing is on high side for this type of food but again you get the 'freebies', the ambience is decent with memorabilia, and the cheesecake!\n\nThe cheesecake the star of the show. You won't find cheesecake better, perhaps beyond the sea there'll be on waiting for you. But if you're in NY and want to fly like a bird flying on cheesecake high you must make your way here at least once in your lifetime.\n\nBon appetite!\nCarson", "author": "Carson T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-03", "description": "I was told that this is a must go to diner in Brooklyn so my colleague and I decided to drop in for breakfast. Place looks very inviting from the outside and we were excited to try it. The breakfast dishes we got were good but the service was not. The waiter was short and absolutely not engaging with customers at all and not listening to the order requests. I asked for dry toast, ten minutes after my food showed up the waiter asked again how I wanted my toast and by the time I was done with my eggs toast with butter on it showed up at the table. Plus this place is not cheap for a diner. The cheesecake was so expensive that I skipped desert. For me this place was a one try spot.", "author": "Arkadiusz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I'm gonna be honest with you. When my aunt suggested we go to Junior's for a family lunch, I was all \"ughhh\" and \"aw, cah-mon really?\" If you're going to go to a diner in Brooklyn, it better have the best food ever plus flying tigers plus dancing clowns, minus dancing clowns, because that shit is scary. Anyway, knowing I probably wouldn't see any of these things, my hopes were not high. \n\nI'm happy to say that I was pleasantly surprised. We had 11 people ranging in age from 3 to 91. For serious yo. My grandpa is a mother fucking sorcerer. \n\nEveryone ordered something different. We had noodle soup, split pea soup, a chicken salad, 3 deli sammies, mini and regular pancakes, jerk chicken and the insane thing I ordered, which was a brisket sandwich with 2 thick ass potato pancakes serving as the bread. Because every last one of us is a fat ass, we then ordered 3 or 4 pieces of cheesecake, carrot cake, ice cream.....I think you get the picture. \n\nOther than Ben K. (yea, my brother is now also Yelp Elite ...*bows*...you're welcome) saying that his cheesecake was the most disappointing thing he ate (he still ate the whole thing), everyone was happy with their meal. It ain't easy to feed 11 Jews on Rosh Hashanah, and our waitress was on it. She even shoved a candle in a piece of cheesecake for the brother's birthday and sang us all a melodious tune. \n\nAll in all, for a diner known mainly for their cheesecake, this place did a pretty great job all around.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I love Junior's, there's something about being one of New York's oldest cheesecake chains that makes it so attractive. Plus, their cheesecakes are delicious! Although their other flavors are good, I really like just the strawberry cheesecake (regular cheesecake with strawberries and strawberry glaze on top). The slice itself is huge and is super tall to boot, and every bite is so fluffy and not too sweet - I'd agree that it's one of the best I've had in my life for sure. I'd previously gone to the location in Times Square, and that one is very touristy so I do prefer the Hoyt-Schermmerhorn location for sure. Always make a point to stop by and grab a slice to go after getting of the Q stop right across the street!", "author": "Carol L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-18", "description": "This institution isn't what it used to be. Bunch of lazy employees who don't care about customer service. Tried to call to see if they carried the tiramisu cheesecake at this location. After calls to both of their listed numbers and ringing for over 3 mins each I decided to walk into the establishment. No organization or system inside the at the counters. If there is a line, should you as the employee behind the counter follow who is next in the line and take their order? No. These employees acknowledge whoever is the loudest and can get their attention. What is this, the stock market floor? Watched the two people in front of me who managed to place an order be wrong.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Happy Sunday!\nI just called them asking if they make \"custom\" cheesecake and was surprised to hear them say No. Also, I asked if an oreo cheesecake could be made for an additional fee of course, also got a NO. Why do you have the DRIEST person answering your phone? There was no enthusiasm in her voice or \"no unfortunately, we do not...\" Please have someone nicer and more willing to help, answer your phone. I'm not even eager to go eat there anymore. Shopping at a REAL bakery for an oreo cheesecake now.\n\n1 star on phone customer service", "author": "Kris M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "I gave Junior's Restaurant 2 Stars because in the past  the Server would bring Pickled Beets, Pickles, and Cole Slaw, along with warm corn bread and rolls, for the Customer to nosh on while waiting for their order to be prepared. THis was done regardless if you ordered a sandwich or Shrimp appetizer (btw is about $16-$17.00) Last time I was there the Server said the Beets etc is no longer given unless a full dinner is ordered. In addition, years ago the Chiefs were better...and now the Restaurant is sorely in need of Renovation.", "author": "Carol S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "Ok, so I know this place has been around for ever and kind of a staple in Brooklyn.. I've enjoyed their cheesecake since I was a kid and is still my favorite which is why I've given them 3 stars instead of 2.  My review relates to the service I've received in recent years..\n\nJust last week I sat down with some friends for a going away party.  We all ordered our over priced bland diner food.  I ordered the very dry tasteless hockey puck style burger.. when we finished and asked for the check to be split evenly across all of our credit cards our waiter quickly scolded us and told us we should have told him this before we ordered and how it is going to take him extra time to do.  He advised we all pay separately but we said it is easier to do evenly.  He was quick to be sarcastic and explain to us how he can do easy math etc..  Eventually he did his job charged our cards, finishing the transaction by tossing our cards on the table mixed up.  \n\nMy point here is this.  If you come to Juniors just stick to the cheesecake and order to go or sit at the counter.  Don't expect to come here and get a decent meal or any kind of quality service.  Now there's some nice staff that work there as well, it just seems that Juniors has no need or care to deal with the bad ones..", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Best place to get cheesecake in NYC. Pretty long  \nwait to get our food, but it was worth it. Cheesecake was great and the dual cookies were good too. I love the 80s feel of the restaurant and I'm glad they haven't changed it. All in all,  this is the best place to get cheesecake in the NYC area.", "author": "The R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-18", "description": "We Stopped in for cheese cake. Unfortunately the cheese cake was disappointing. It was dry and no longer creamy. It tasted like an assembly line cake. Can't even compare to La Cheesecake in College Point Queens hands down that's the best cheesecake ever!", "author": "The Food Boss S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "I'm giving this a 3 star review because the Cheesecake was amazing but the food was just ok. I got the pastrami Sandwhich which is a pretty good size and that was alright then went back the next morning for French toast and I didn't like it, it was made very differently. I will only be back for the desert next time.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-05", "description": "My NYC born \u0026 educated hubby raved for a year about Junior's cheese cakes.  He'd exclaim, \"Every cheese cake you've had is an immitation.  Wait til you try the real thing!\"  We ordered the cherry \u0026 coconut cakes.\n\nThe cakes came efficiently wrapped in self contained styrofoam cartons \u0026 deco orange boxes.  They were frozen solid as a rock so they required a day to properly thaw.  That should have been my clue \u0026 overpriced to boot $100.\n\nOne small bite sent me directly to the garbage can.  Nasty is an understatement.  It tasted fake \u0026 artificial.  I'm from the South \u0026 we home girls make it from scratch.\n\nI read the 15+ ingredients \u0026 found 4 kinds of preservatives \u0026 numerous artificial flavors.  NYC you can keep your frozen fake cakes! It's time this newly wed introduce her hubby to a real treat....organic cheese cake southern style....no artificial anything.", "author": "Dorcas D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-10", "description": "I wanted to go just for the cheesecake milkshake but I also got some breakfast the food was kool regular diner style I wasn't expecting much . I enjoyed my shake and it was presented so nicely . It was a little crowded on a Sunday my waiter was too busy for my liking .", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "Best pastrami sandwich I've ever had. It was lean, tender house cured meat with a perfect spice crust along the edges. Hot, melted real Swiss cheese on fresh baked rye. Great breakfasts too. Wish I lived closer!", "author": "Sheila E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "This is a fun eat for families. There's breakfast available all day. Many comfort food items and seafood. Many desserts and casual atmosphere. They serve mounds of cornbread and rolls while you wait. This place offers the comfort and calories that only mac n cheese can bring", "author": "M J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "It didn't live up to the psych for me. Food was ok (I had the pastrami sandwich) and I didn't particularly like the cheesecake. I like Cheesecake Factory's cheesecake and Route 58 Deli's sandwich in VA much better. Service was fine. I'm sorry it just not my piece of cake!", "author": "Kim F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "Been hearing lots of good and bad things about this place but I had to give it a try for myself. I was watching a movie nearby and stopped here! We ordered the burgers and potato cakes which were massive. \n\nWe didn't have any room left for dessert. Def gotta come back for their cheesecakes tho.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Let me start by saying I'm not a cheesecake person. Junior's lives up to the hype, okay. Yeah, I said it. We were walking down the street after our delicious meal at Hans Dynasty when I saw this guy on a bench eating this delicious looking strawberry cheesecake. It had real pieces of halved strawberries in it and a dreamy cheesecake filling and a graham cracker crust that promised of wonderful things to come. I seriously contemplated jumping the guy for the cheesecake. He laughed knowingly and pointed to Junior's front door. \n\nI admit that before I came to New York I never heard of Junior's. My friend kept saying that \"she had to go, she had to go\". So I said \"Alright we'll go\". I got to say it was a great idea. We sat at the booth and order three cheesecakes. Two strawberry pies and one pumpkin. The strawberry cheesecake is sold whole at the counter but you can also buy the pie whole. I think they ship across the country so I'll definitely be doing that.\n\nI did have time to take a look at the menu and it is quite extensive. Good old American fare. A little bit of everything for everybody. I felt that it was a bit pricey but it did look good. Might have to come back for the Reuben sandwich. Junior's was a great experience.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "I love this location.  As soon as I got there, I was being seated right away.  Service was wonderful.  My waiter was very attentive and so was the waitress who spotted my water glass being empty, refilled it twice.  Since I jogged through manhattan bridge and I was so thirsty, I had total of four glasses of water.  I had matzoh ball soup with a cornbread and a roll on the side.  And it was delicious and the right temperature.  The Portion was good.  I was so tempted to get a slice of cheesecake but I didn't want to waste my exercise.  Overall it was wonderful.", "author": "Amanda W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}