{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "I loved my experience at Junior's! \nI came here for breakfast, and I sat at the bar, which was really nice. I got prompt service and a nice chat with the bartender. I love the little pastries that came with my breakfast, and I was blown away from the amount of food that I got - really good value. I had grits with bacon, eggs, bread...all very good, all very solid! and I didn't even have the cheese cake!!\n\nI also liked the fresh coffee, and I certainly will come back. \n\nI loved the relaxed Brooklyn vibe with good Jazz music, casual people, and good food!", "author": "Gerhard W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I've visited Junior's before, but this was my first time getting takeout. I ordered the buffalo wings which were delicious!\n\nThe cashiers and staff were not friendly at all. I asked for ranch with my wings, but was given blue cheese. I told the cashier and she let out a long sigh as if I was wrong for wanting what I asked for.\n\nThe cheesecake is great. Not the best I've had, but pretty close.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "First time visitor. The coconut pineapple cake was good. but to me a little under the sweet taste i seek in my cake. The Pine Apple Cheese cake however was incredibly delicious. Rich and delightful taste in each bite. I know I will return and try other flavors. They have something for every taste.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "After a night hanging out with my boyfriend. We wanted something sweet decided to go to Juniors to get a cheesecake. It was delicious . That's exactly why Juniors is famous for their cheesecake", "author": "Robin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Really enjoyed the experience. We've been to the Original one in Brooklyn, and the Time Square location on Broadway. Not enough good things I can say about both. The Brooklyn one was just to get a Red Velvet cheesecake. It was the best cheesecake I've ever had. My only real complaint is when we went to the Brooklyn location, no one came to seat us, so we just seated ourselves at the barstools. The Time Square one was more attentive on that end. It's not enough to take away a star as it was just a minor inconvenience. In the end, Junior's reputation is well earned. I'll make my way back again.", "author": "Vernon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Definitely worth a visit if you've never been to Brooklyn. Not the best customer service but the cheesecake makes up for it.", "author": "Lin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "It's JUNIOR'S!!! HELLO...the cheesecake capital of the universe! I know some people believe that the factory spot is better. I beg to differ... That strawberry cheese cake has been my savior on a craving night. The crust is insane and as I type I am making myself crave another slice.\n\nI've eaten here before for dinner and it's basically like your local diner with a bit more flare. \n\nThe 5 stars is completely for the cheesecake!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Fun, kitschy diner. Food is better than average diner fare. They bring plates of beets, cole slaw and pickles, and service is good. I know everyone comes for the cheesecake but we didn't have it tonight. We've had plenty in the past, though.\n\nI had the pulled pork sandwich, thought it was very good. Came loaded with extras that I couldn't eat. My daughter had the chicken finger appetizer and brought most of it home. The husband had a classic corned beef on rye and was happy.\n\nMy only regret? I didn't get an egg cream. Next time!", "author": "Adele P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "I have been craving good cheesecake for a while now and this is the place to be! It's cheesecake heaven I tell you! I ordered a plain slice to go for $7.08. It's very creamy and at the same time fluffy. My friend also tells me that you can order any of their cakes online now and they will send it all around the world for you. Nice!!!", "author": "Win C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Best cheesecake or at least one of the best cheesecakes you will experience in your life if you haven't tried it yet. The cheesecake is extremely creamy, delectable, savory, and rich just by itself so imagine sweet syrupy strawberries hovering over this cheesecake. It's worth taking the train here and avoiding multiple crackheads in the street for. Even when I lived in FL it was a tradition of mine to always bring a cheesecake back since it's one of the best souvenirs you can purchase in the city. \n\nIf you are a tourist and bring a cheesecake back your town there is a high possibility that you will make everyone endlessly happy since it's one of the most famous cheesecakes in NY. Don't bother getting just one slice, one slice does not justify and I have found the best slices are from a fresh cake. Bon Appetite!", "author": "Daya A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "I have been to Juniors twice within the last two weeks and I must say the recipe for the strawberry cheesecake has changed.I've been coming here for over 20 years and the strawberry  glaze is more of a gelatin and the cake portion crumbles horrible when you put your fork into it.I miss the old recipe because now I feel like because of the expansion of this business that short cuts are being taken to save money", "author": "Y S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Four stars for the cheesecake and the nostalgic atmosphere. Food is only so-so but c'mon: who really goes to Junior's for the food?  Portions are massive, however, so plan on a doggy bag if you want to have room for the cheesecake. Skip the coffee unless you like yours watery. Don't understand the knocks on the servers. I find them all to be very pleasant. One note to the ladies: if you use the restroom, there are photos in the stalls. It's a bit disconcerting to pee with Spike Lee staring down at you.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "I'm from south and this did not suit my taste buds at all. The food was cold, collard greens tasted like spinach; jerk chicken wasn't even flavorful. The coconut rice \u0026 beans didn't taste like anything either, what's up Juniors??? I gave it 2 stars only because the portion size was large...which was left on the table #dissapointed", "author": "Cee E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "It was just ok...I wouldn't go again. Went for brunch and the food was just ok nothing special nothing particularly tasted. We didn't try the cheesecake though but there are probably better restaurants to try in the area", "author": "Mona A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "The McDonalds was closed that night causing equal parts panic and intrigue, made even more intriguing with a cryptic yet honestly sufficient sign on the front door printed in bad faded (but bold) font that simply said: SORRY WE ARE CLOSED.\n\nWhile sad to miss the dollar menu, free wifi and dangerous crazy shady characters of the McDonalds near the Dekalb Ave station, I was hungry enough to take a hit on my budget and eat at Juniors.\n\nThe best part about Juniors is the prompt and attentive service - better than some fancy restaurants out there.\n\nThe bad part about it though is how mediocre the food is. Listen, I am not expecting a Michelin star taste here. I am not that fancy. But considering their prices are above average, you kinda wish that the food is better than the dollar menu of McDonalds.\n\nI ordered the steak burger because it sounded delicious (inciting visions of meat oozing with sumptuous greases and juices) with onion rings and steak fries for around $12.95. Meat was thick and warm, was ok, mediocre. Five Guys Burger is better for $5. The fries here was ok, crispy enough, could be warmer. They probably just heated it (which I guess many places do and that's kinda normal). The two large onion rings, while generously thick, was cold. None of the crispness that makes onion rings... um, onion rings. The onion rings I had on the side were cold and had a soggy surface. Sorry to say, Burger King was better. Ugh. Such a disappointment.\n\nOf course, I'll pay my bill and still give a big tip (as I normally do - in support of the workers and whatever dreams they have). If I knew the food was going to be this mediocre, I could have just bought instant noodles from 7-11 and saved my $20 (tip included) painful payment to Juniors and invested it in a Savings Account with a .01% interest. \n\nOverall, come here for the cheesecake (I've eaten that in the past - for take out though). Juniors cheesecake is legendary and do deserve the hype. It is delicious and the portions are generous. Do NOT however spend your money here for dinner. To be fair, I only tasted the burger.", "author": "Kristian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Yeah, it's a classic diner and it's huge and a great place to meet up. The coffee is hot and delicious, BUT the homefries were smooshy and the bread rolls and danishes were stale and tasteless. My poached eggs were perfect, but the hollandaise says was floury and gummy. I'm glad I went, but I won't be back.", "author": "seela m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "I love this place for the menu . This is the classic Brooklyn comfort food and drinks that will solidify you as a Brooklynite. A Long Island iced tea here is a different experience paired with a cheesecake... omg so F*ing Brooklyn right here.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-11", "description": "This place is by far the most mediocre restaurant in NY.  The best thing they have to offer is their cheesecake; one of the best I've had. I really wanted to like this place given the hype that I heard.  Service was slow-slow-slow, water cups remained empty up until it was time for us to pay. I had a cheeseburger! Not sure I can even call it that since I barely could stomach the dry unflavored meat. My friend had the open face turkey sandwich, yet again NO flavor.  It's almost like their cooks take NO pride in what they serve, quit sad!  We did have dessert,  junior's famous cheesecake, which was great however didn't make up for the whacky service and tasteless meal. There's nothing that would make me revisit the restaurant but for sure will be back for the cheesecake!", "author": "Gina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Today was my first visit to the Brooklyn location.  I liked it better than the Times Square location.  The server was attentive and fast.  The burger was juicy.  The cheesecake was as fabulous as ever.", "author": "Melinda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Junior's is one of the many restaurants that I've been waiting to try for a long time and I finally did in the summer. \n\nOne of Junior's famous menu items is their famous 10 oz. steakburgers. The swiss steakburger consisted of mushrooms, lettuce, and a slice of tomato. Onion rings and steak fries came on the side. It was such an enormous amount of food that I didn't even get to the onion rings.\n\nApple Crumb Cheesecake, $6.25. The apple crumb cheesecake is actually an original New York cheesecake but, with tart apples, cinnamon, and delicated steusel crumbs in the mix. I actually liked the apple crumb cheesecake especially the tart apples because they weren't overly sweet and a dash of cinnamon with the tart apples was exquisite!\n\nStrawberry Cheesecake, $6.50. My boyfriend loves getting strawberry cheesecake at just about every diner-like restaurant we've been to. The strawberry cheesecake is an original New York cheesecake too but topped with fresh strawberry pie filling and baked with a graham crust. It's finished with macaroon crunch on top.\n\nThe presentation and the taste of his cheesecake was actually better looking than mine. The strawberries were a tad sour but, otherwise succulent and yummers!\n\nOverall, Junior's is a great place to come for a family style or group gathering. It doesn't disappoint at all.", "author": "Jessica D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}