{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "They give you a breadbasket when you sit down to breakfast! With danishes and rolls and all this great stuff! God bless america.", "author": "Horatio N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "I dont live in NY, and had a business meeting later on, so since i arrived so early i decided to have breakfast here. No one acknowledged me when I walked in. After standing there and pacing back and forth, I just walked up to a waiter to sit me. He sat me down and I waited for 20min to get waited on. Instead of getting up and leaving, I stopped another waiter to let them know I haven't been helped. So then another waiter came up and finally took my order. They treat you with hot tea and some pastries while you wait for your order to arrive. I asked the waiter where the restroom was and I literally took less than a minute to return to my table to find it cleaned! All my food, just gone! So I stopped one of the girls again and said that I just used the restroom real quick and they cleaned everything off for the next customer.... (This is unbelievable!) They re-served me and gave me a fresh new order... So unorganized. Not customer service oriented what so ever. Not coming back.", "author": "Sabris98 .."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-26", "description": "We went here after Grimaldi's just for the cheesecake. We were shocked. We are huge cheesecake fans, and we thought this cheesecake was DISGUSTING. \nIt was very similar to eating a very concentrated fat philadelphia cheese. \nWe thought it would be fluffy and sweet (even just a little). \nAnd our waiter looked like he had no will to live. He must have had one of those cheesecakes.", "author": "Daf M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "I like this place since it seems old school.  The cheesecak is good, but expensive.  \n\nI'd give it a higher score, but I saw pics of mice in the cheesecake case.  That's never good!  haha", "author": "Jay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "Always GREAT!!\n \nBreakfast: The BEST French toast I've ever had. I don't know how they do it but it tastes like heaven.\nLunch: The corned beef-pastrami sandwich. They don't skimp on portion size. \nDinner: Haven't had dinner here yet but I can't wait !!\n Dessert: Don't miss out on their famous cheesecake !!", "author": "Hayley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-30", "description": "My sister and I ate at Junior's a few years ago and I sincerely hope it's gotten better since then. We're true Brooklynites and had always loved the cheesecake there. One day we decided to stop in for more than sweet treats. As soon as we were seated, we were grossed out by the tablecloth adorning our table. It was spotted with stains and looked like it hadn't been washed after at least 3 uses. We'd always known Junior's to be upscale, so we thought that because it was a Sunday, perhaps they hadn't done any laundry. We ordered brunch and while we were waiting, not one but TWO roaches decided to pay our table a visit. We were AGHAST! One roach was scuttling toward my sister's side of the booth. The other was crawling up the tablecloth and onto the table. We were mortified! But we had already ordered our food, and didn't want to cause a scene that might upset other patrons. We used napkins and papers that we had to shoo them away. Then, we inspected our food once it arrived, was sure to say our prayers, and gingerly ate most of what we had ordered. From what I recall, the food was okay - nothing exciting, but we were filled. Of course we didn't have great appetites and felt as though we were eating at a dive, not the fancy place we'd always heard about and seen celebrities eat at. Just the other day I saw a reality star dining at Junior's with her daughter and my stomach turned. Like I said, this was a few years ago, and I hope it's gotten better since then. Otherwise, they certainly don't deserve to call themselves \"most fabulous\".", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Typical New York Deli but with great cheese cake. Had the French Onion soup perfect very cheesy and the Wedge Salad loaded with blue cheese and bacon, very good. Should have had pastrami probably less fattening than the salad. No cheese cake for me after all the cheese and bacon. Next ordering the cake first.", "author": "Larry D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "This place!!!!! Their cheeeeesecake is out of this world. They come in nice small but filling portions and their cherry one is the best in my opinion. They have other food too but I haven't tried anything else here. My friend recommended this place to me for cheesecake cause I was really craving it so I asked my boyfriend if he wanted to take a drive. I convinced him haha. Loved it. 1 star down only for the service. The line was horrifically long and the staff didn't know how to handle them. But that's it. Definitely an amazing place and will recommend to anyone who looks for cheesecake.", "author": "Marsha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "A great place for a sit down meal. Their traditional plain cheesecake is a must, it was classic New York cheesecake. I also tried their bbq ribs and chicken, and their sauce is great. They serve breakfast all day, which is very nice and their french toast was fluffy and delicious. And their prices are very reasonable for all their items. \n\nTheir service is a little slow, so I would not suggest it for anyone with time constraints. All in all it was a very affordable and delicious New York meal.", "author": "Audrey R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-27", "description": "I'm not that impressed.   But then again I'm not a fan of having a pound of lunch meat in my sandwiches.  The food is OK.  Well then again, my friend's onion rings was a pound of batter and an ounce of onion.  He enjoyed his pastrami so that's a good choice.  I wasn't impressed by my roast beef ruben.  I didn't have the cheesecake that night but I've had Junior's cheesecake from the Grand Central location and it's a good cheesecake but I'm not that into cheesecake so I couldn't tell you if it's the best.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Famous place and the prices reflect it. Woo! Goodness. Anyways, I had breakfast here (you can get breakfast anytime) and it was average. I was more impressed by the complimentary appetizer which is a coleslaw and pickle. They are both fresh and homemade. Loved it and I didn't share it with my lunch date (sorry). I have also gotten a turkey sandwich for takeout from here. The sandwich is maaaassssive. I ate half that was enough to full me. I ate the other half the next day with the fancy mustard packet it came with and it was even better. The sandwich is too expensive to get on a daily basis for lunch but it is good. I didn't have the cheesecake which everyone is raving about because I don't eat cheesecake but it is overpriced for a slice. I don't care what it tastes like. Seriously, spend a little more and get a whole meal.", "author": "Shanora S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "Thanks to my chum, Joanie, for making sure I had a Junior's fix before heading to LaGuardia. Combination pastrami/corned beef Reuben and a piece of cherry cheesecake. I waddled off to the airport a very happy girl!", "author": "Anissa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Junior's is Brooklyn, been coming here for over.  Great for locals, great for tourist.  Nothing like the original.  Everything  is great as you expect, if not, one of the many attentive staff will rectify it expeditiously.  Hot rolls, corn bread that doesn't need butter, but everything  is better with butter.  You don't really need another pic.  Just make sure you save room for cheesecake, or take some home.  Any kind is the right choice, leaving without a cheesecake is the only wrong choice.", "author": "T J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "I am the king of cheesecakes and sweets and absolutely love them. I have tried this place multiple times, trying to give it credit for all the hype that it gets. I've tried the strawberry cheesecake and their New York cheesecake multiple times. I must say I'm not that impressed. I've definitely had better. But nonetheless, they have decent tasting cheesecakes, just not as good as all the hype it gets. It's definitely a famous establishment in New York though, so I say go ahead and try it once, see how you like it.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Great cake. Bit pricey but delicious!", "author": "Nychoopaholic B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "This place is famous for their cheesecake, but I usually get hamburgers here and they're always good. As far as I can see, any food you get here tastes good!", "author": "Mike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "I thought this place was just awesome.\n\nWe stayed at the Brooklyn Sheraton a block or two away, and they recommended it-- I excpected tourist trap.\n\nMy lunch special of grilled salmon was terrific and came with a spicy cajun sauce.  But, MOST incredibly, it also came with a fresh steamed veggie, rice and beans, and a ceasar salad included in the price.  And my daughters' meal included her large chocolate milk.  My mother ordered a crabcake appetizer that was very large and almost all crab meat.  And we all shared a red velvet layer cake for dessert.  \n\nSo, the food was terrific and very reasonably priced.  But, even more impressive was the service.  Our waiter could not have been friendlier or more prompt, and even brought out my daughter's food first because he could tell she was tired (and he had dramatically presented her with crayons and coloring pages on her way in, so he'd already won her over).  What a sweetie!!!", "author": "Kerry D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "The food was okay. It was good place to visit as a tourist and def a place to visit if your making a stop in Brooklyn. Cheesecake was great :)", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "It was pretty good cheesecake. But, totally not worthy of the hype in my opinion. Maybe it used to be better and now it's just living on its reputation.", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Food was average - like a diner. Their cheesecakes are to die for. Huge portions, around $7 a piece and absolutely delicious.", "author": "Lukasz K."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}