{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "My boyfriend told me about this place, being a Brooklyn native and all, and since I adore cheesecake I made it my mission to get some.\n\nIt was a rainy weekday, so the place wasn't busy at all. We were promptly seated and brought water, bread, and sides. Our waiter was really on the ball about getting us whatever we needed, which we appreciated. \n\nI got the roast turkey plate which was huuugggee. I got at least two full meals out of it, and it was delicious to boot, with everything you could want out of a classic roast turkey.  My boyfriend got a sandwich, and the corned beef on it was really tasty.\n\nWe got a cheesecake to go, and I can see why everyone says its the best. It was the classic NY style cheesecake and it was so creamy and cheesy and exactly how I like my cheesecake. The slice was pretty big, too.\n\nI really enjoyed the experience and I will definitely be back in for a slice next time I'm in town.", "author": "Dehlia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "What is there not to like about this must go to restaurant?!\n\nI really really love Junior's. I love the furniture, the old charm and the way the staff welcomes you in. \nThere is that high end diner atmosphere that is priceless.\n\nOf course I had the cheescake and I love it (even if I am not a cheescake person).\nI also had the devild chocolate cake... Really outstanding and not your typical overly sweet dessert.\n\nI had a pastrami sandwich and was great.\nPortions are extremely generous.\n\nYes it's pricey but hey, I'll save my starbucks money and my takeaway money for an evening at Junior's anytime.\nAnd you can always go for coffee. It's not much more expensive than starbucks, but what a different scenario!\n\nSide note:\nThey do have lunch specials though that are totally affordable.\n\nI'll be Back soon Junior's!", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "The original cheesecake is heavenly. It is everything a slice of cheesecake should be, creamy, dense, slightly tart...yum!! Our waiter Tyshawn was very helpful.", "author": "Shandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Visited this place after so many years. I stopped by during national Cheesecake day. Sadly, I paid full price for a slice. It's prob my fault for not reading up on the 50% off deal. \n\nI got the red velvet Cheesecake and was not disappointed. It was a huge slice. I'm a big dude and needed a friend to help me finish. I would definitely return for their Cheesecake. \n\nThe cashier that rang me up was really kind and Ecuadorian as well!", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I used to come as a kid growing up in Brooklyn. When my family moved to NC, we'd come back to NYC every year and make sure we came to this spot. It is the best cheesecake money can buy. Not to mention the food is great too. I loved he seafood bisque and deli sandwiches. You can't come to NYC and not go to Junior's.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Forever my Cheesecake loving desires at this place...one of many to choose from and always mmmmmm good!!!!", "author": "Rosa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Anytime I hear the word cheesecake I automatically think of Junior's. They have the best cheesecake. Whenever I have a family function and they say I'm in charge of desserts I run to junior's. They sell original cheesecake, strawberry cheesecake even a strawberry cheesecake pie with the graham cracker cookie crust all around the cake.\n\nThese cheesecakes are not cheap. Approximately $27 for the small 6\". But they say you pay for quality.  And that is for certain what you will get at juniors. \n\nIf you're ever trying to get a cheesecake during a not holiday is. Thanksgiving,  Christmas,  be prepared to be a part of a long line. The hood news is they have began to master the flow of traffic. Went there for Christmas and spent less than 10 minutes on line.", "author": "Paul T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "It is a cozy historical place to eat at with your family or a partner. It has the atmosphere of peace and offers a great view of Flatbush. Their cheesecakes are amazing. Especially the  Red Velvet cheesecake. I was a student at LIU ,and this was the place to take my family and my boyfriend.  We have some great memories there. I've been in the Juniors at Times Square,but it lacks the atmosphere of Brooklyn Juniors ,although the cheesecakes are as  amazing as in Brooklyn Juniors.", "author": "Dilyara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "This establishment is a little creepy to me because it is so old and dingy......it is in need of a real update. \nAlso, I thought the prices were a bit on the high end for the options. \nHowever, I loved the various relishes.....that was different!!!!\nThe coleslaw was the bomb.com!!!\nService was exceptional and the cheesecake is to die for!!!!", "author": "Milly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "The legendary Junior's, with their signature cheesecake. This place has been around since 1950! And still going strong! Great food, great old-time atmosphere. I liked their matzo-ball soup. And the cheesecakes, so good. You have to try this place!", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Junior's cheesecake really holds a special place in my heart.  I get excited whenever I have an opportunity to come here.  Both my Grandmas loved this place, my parents grew up eating here, and I too have eaten many of their cheesecake slices since I was a little boy.  Over the years I've had the Devil's Food, the Red Velvet, the Carrot Cake, the Chocolate Mousse, and my favorite, plain with strawberries and glaze on top; I love that the strawberries they use are huge and fresh all year around.\n\nIn addition to their desserts I've recently also had the pleasure of experiencing a Turkey BLT and a Brisket Burger from their food menu.  Both were delicious and served in generous portions, just like their cheesecake.\n\nService was also really good.  Every time I've been here with my family we were served with nothing but kindness, and I really appreciate that ... Until next time Junior's.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "This is an annual treat for me. I had the pineapple cheese cake, omg it was smooth, sweet and just enough tartness to balance the flavor. This place is always busy with locals and tourist. A NYC must !!!!!", "author": "Winifred W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "This place has good food and good service. Our waiter was nice. The cheesecake in Dallas tastes better to me. Portions was good and food favorable.", "author": "Comisha S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Waitress never mentioned the difference between the lunch and dinner servings. I was expecting the lunch portion until the bill came to nearly $90.00. I wouldn't have minded it if the food actually tasted like a $30 meal but it (shrimp parmigiana) was bland. The shrimp was covered in batter, fried then smothered in marinara sauce and a load of cheese.  It was honestly bad to me. Never again.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "As my trip to N.Y. comes to an end, we decided to celebrate my B-Day having dinner here. Our waiter Taina was beyond amazing. Not only was she a pleasure to speak with, but her customer service skills are superv!! I had the BBQ ribs and chicken along with the NEW YORKER!!! The food was a tasty treat. The ribs were very tender and the chicken was juicy. Plenty of BBQ sauce to lick your fingers. As for the NEW Yorker, piece of heaven. Tiana and the staff sang me Happy Birthday as they presented me with this deliciousness. Overall, I could not have had a better experience and definitely recommend this restaurant to anyone. Bring the family and enjoy.", "author": "Rigoberto D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "3 of us walked in here on a Thursday evening at about 10:15pm. This place has 2 floors, looks like an older diner, and is relatively clean. Only a few tables were seated at that time so I was able to get a seat right away.\n\nI came here because an Uber driver suggested to come here for the cheesecake. It is definitely awesome cheesecake! We split 3 cakes, one was the original cheesecake (my favorite), the other was the raspberry swirl (also very delicious) and the last one was a layered cake. This is a fantastic place for desserts and is not too loud or quite. Washrooms are clean as well. \n\nI would highly recommend this place for dessert!", "author": "Gabe F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Very large place and retro in a sense. You walk in and are welcomed by staff and of course your eyes see the yummy baked goods. I have a large family and seating was comfortable and roomy. Our waiter was wonderful. Bring a hungry belly because you will get a lot of food. The onion soup was awesome! BREAKFAST SERVED ALL DAY! I also had grilled cheese! A classic! Husband had Reuben sandwich, daughter had chicken tenders, and my youngest had Mac n cheese! Bellies were full! We will come back before we head home for some of the cheesecake and baked goods!", "author": "Loretta P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "The place is like a big classic diner. We ordered shrimp marinara and a cobb salad, both dishes were delicious! The prices are high but the dishes are huge, I wrapped half of my salad to take home and had lunch the other day. They also give you complementary homemade bread from their bakery and some snaks while you are waiting! The only critic I have is that they brought my salad to the table and 5/10 minutes later they brought my husband's marinara.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-28", "description": "Just had desert and coffee. Desert was mediocre. They claim the best cheesecake. Not at all. It was good that's it. Sundae was ok not exciting. The chocolate fudge cake was ok. It was really cold, not sure if it started off frozen. Coffee was week and not fresh. \n\nService was poor. The server moved slow. We had to ask for napkins, refills and finally the bill. Restroom needed cleaning.", "author": "JJ M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Tasteful food and good price.\nGenerally the food is more than sufficient for two people, the whole attendance is amazing and the place is so warmful.", "author": "Bruno V."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}