{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-19", "description": "We came here for - what else? - the cheesecake ...and I was honestly not that impressed. NY, if this is the best you can do, then I don't know where you get the reputation for cheesecake. \n\nThis was an extremely dense, thick, rich cheesecake. The kind that you can only take a few bites of, because after that your mouth is cemented shut with solidified cream cheese. It was pretty average NY cheesecake. Sure, it was fine. But at $7 a slice, it should be better than fine. I've had much, much better. \n\nPass.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "Junior's is sort of like an old diner.  The food is ok and the atmosphere really needs to be updated.  \n\nWhat is good is the dessert...  I have eaten here a few times but probably wouldn't again.  I would just come for the dessert.  The cheesecake is delicious...even though I am not really a cheesecake fan.  \n\nCome for coffee and cake or if you need somewhere to go late night.", "author": "Tillie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-03", "description": "Mail ordered two cheesecakes, special for my cheesecake loving grandma.  I really wanted to love this place, and I would have been a loyal customer. \n\nI have had better. \n\nThe regular cheesecake didn't have a crust, it was on a thin sponge cake and it really lacked... tartness? Zip?  - It was missing something. \n\nWe also had a Dutch apple cheesecake, this too was missing something. There was actually a crust, so that was good. \n\nThe local supermarket has better cheesecake.", "author": "Anastasia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Okay, so I'm sure I am not the only one to say this, but the cheesecake is amazing! One year we bought a bunch of their cheesecakes for Thanksgiving desert.  Oh, and the food here is great too.", "author": "Cleo E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Reasonably priced and quality food here at Juniors. I've been here twice. The first time I got a chicken cutlet platter with gravy and all the sides...Delicious.  Recently I had the pastrami burger which I thought was just a pastrami sandwich, but it came with a beef patty. The combo was pretty tasty. They are usually busy, have a very large dining area and a separate bar area as well. I have never waited for a seat there though. Waiting staff was very good and prompt. If you are in Brooklyn and want a burger or some quick eats in a Mega-diner type atmosphere, this is the place to check out. PS...don't forget to try the world famous cheesecake! Last time I was too full to get it, but I will never make that mistake again lol.", "author": "Calvin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Just ate at Juniors with my husband and have never been so utterly disappointed in the whole event. I don't know what was going on, but from the moment we walked in we were treated like shit. No one greeted us and when we actually got a table it look 10 minutes for someone to even acknowledge that we might want water. We also weren't given any bread or pickles which were on everyone else's table. There were tons of servers all over but all of them were just standing around. When our waitress Heather finally came she was rude and passive aggressive and and rolled her eyes at our questions. Everything we asked for (which was just basic coffee and eggs) was an inconvenience for her. The only times anyone came over to us was to take our order and deliver our food. Forget trying to get out water filled, even though the two people next to us had there waters filled multiple times and the family that came in after us had their food before we even ordered. We had to get up to ask for the check, and go to the front to get someone's attention to pay. Over all the food was bland and unappetising and they didn't care to ask our preferences on sides or bread. We left feeling irritated and did not leave a tip. So no I would not recommend this location. Perhaps other Juniors in the city do a better job.", "author": "Laine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "This review is for shipping Junior's cheesecake (not specifically for the restaurant). I had a sampler cheesecake shipped to someone recently and it turned out great. I was a little hesitant first just because it was the summer and thought that the cake would come melted. The cheesecake arrived in great shape and the sampler got great reviews, they said it was delicious.", "author": "Lena S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "Do you swear to order the cheesecake, the whole cheesecake, and nothing but the cheesecake?\n\nI do.\n\nJunior's is a Brooklyn icon. If you like a nice, dense, intensely flavored cheesecake, look no further than the bakery counter at Junior's. The decor is classic diner, and it's nice that it seems to stay suspended in time as condos rise around it. It's also nice that it maintains its classy appeal, in spite of downtown's sea of stores selling gold fronts, hair extensions, cell phones, and sneakers--under the same roof.\n\nEven though this is a full-fledged restaurant, and even though there are many other items to order in the bakery...I just don't. The food here is standard--not great, not terrible, just average. That's okay though, because a slice of cheesecake is heavy enough to be a meal.\n\nMy personal favorite is the chocolate mousse cheesecake. It's $6.95, or as I will now call it, the cheapest sex in town.\n\nIf that's not your thing, you can choose from quite a few varieties. \n\nHonestly, I can't see anyone loving cheesecake and not being in love with Junior's.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "The food and dine-in service are abysmal. Just mentioning either will generally be met by a bunch of gagging sounds and faces that look like this X_X\n\nBut the cheesecake is bomb! Most folks don't know about their cake/cheesecake hybrid options: red velvet cheesecake, carrot cake cheesecake and strawberry shortcake cheesecake, to name my faves. That is really where they shine in providing quality you can't get anywhere else. Next time you get into a fight with someone, drop $7 on a slice of red velvet cheesecake and they'll be happy again with you in no time.", "author": "Anthonine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Never thought that I can be sooo full after a bowl of soup and a regular piece of cheesecake! Servings are enormous, onion soup is very tasty - one of the best I've tried in NYC, and, of course, cheesecakes are delicious!", "author": "Alina U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "The world famous Junior's Restaurant is not just a one trick pony, even if that one trick is one the best in the world. People often forget that it's a diner that sells awesome Cheesecake, and not a place that sells cheesecake that happens to have a diner. Whether you're craving a humongous burger, an over stuffed deli sandwich, some fish and chips, or just dessert, Junior's has you covered, and then some. The ample portion sizes are sure to satisfy even the mightiest of eaters. If the entree doesn't do it for you, the silky, smooth decadence of some of the world's best cheesecake will.", "author": "Jeffrey O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "The cheese cake selection at this store is unbelievable but they really are creative and make it work good place to visit", "author": "Kendrick H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "I've been eating at juniors since I was a child   That's over 50 yrs. I had French toast. That's why I come here. It was great as usual. Service however not that great.", "author": "Bonnie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "A late night run to Juniors for cheesecake was great as usual. A special added bonus was our wonderful waitress Shauna-Kay Brown. My out-of-town guests \u0026 I loved her. Oh \u0026 the cheesecake was pretty darn good, too! Good thing Shauna told us Juniors isn't closing anytime soon!", "author": "Ileane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-17", "description": "I just like Junior's, and always have since long before I became a New Yawkuh... And I still haven't tried their cheesecake!  I know, seems crazy right?  I just don't like New York style cheesecake.  Anyway... \n\nWhat's not to love?  You can get a full, satisfying, balanced meal here, the type of meal that I still have yet to have at a diner anywhere in New York City.  The price seems expensive at first, but by the time they bring out the pickles and beets and cole slaw  that  reflect its old-school Jewish heritage plus the three types of bread (the cornbread is so good!) you realize that you have been given your solid money's worth.  \n\nI like the fact that they always have a wide range of vegetable selections for your sides, even if they do cook them in enough butter to negate their salubrious qualities... They season the vegetables well and render them tasty if not all that healthy.  James Beard's ol' fat bald ass would be proud!  I usually get the collard greens.\n\nThe service can be best described by two words: \"on it\".  They must train their wait staff extremely well, because I have only had the best experience with every Junior's waiter, here or at the locations in the City... They are never obtrusive, they list your options very carefully, they listen very carefully to your selections and they work with you on your arcane tastes, i.e. your particularities about type of mustard or cole slaw, your desire for juice on your brisket, etc.  They then watch like a hawk to make sure your drinks are always full, whether it's your water or your fountain drink.  I hope Junior's pays them well...\n\nIt's just a pleasant place to be.  They play a pretty good selection of oldies that is fairly Martha Reeves and the Vandellas-type R+B heavy, and I appreciate the fact that both the staff and the customers reflect the full range of Brooklynites... The people who run this place know how to run a good business, they've got plenty of saychel... they know how to make everybody in Brooklyn feel at home.", "author": "Seth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Everything is delicious. Especially the fresh cheesecakes. Customer service isn't that great. But I would still recommend coming here", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "It's hard for me to say anything negative about this place because it means so much to me. I've been coming here since I was a little kid, and their food hasn't changed.  The ambiance (ambience? I never know which one to use) is all old-fashioned diner. The waitstaff is very polite and the menu is very old-fashioned. \n\nCons: -The burgers are HUGE and kinda dry.\n            -I didn't really like the catfish fingers.\n\nPros: FRENCH. TOAST. Their French Toast is almost like dessert. It's slightly crunchy, it's buttery, ridiculously unhealthy.... *drool*. It comes with this apple...thing to put on top.\n\n      -This is one of the few places  where I actually like the scrambled eggs. They're simple, and not ridiculously creamy like other places.\n     -Their home fries are to die for, but beware, they don't have them after a certain time (they serve breakfast all day though). Their turkey sausage is actually well-spiced.\n\n     -Their chicken fingers are wonderful. They're white meat, but extremely juicy (not easy to achieve). Their drinks are great too. They have old-fashioned cocktails and a few new ones, too. \n\nOverall, this is a very family-friendly type place. It's not the trendiest spot, but they really make you feel at home.\n\nThe one in Times Square is an abomination and doesn't even begin to compare to this one in terms of service, and they don't even serve breakfast all day. So if you have only been that tone, you haven't really experienced Junior's. Sowwy.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "To be fair, I have never eaten Junior's cheesecake.  Maybe if I had I would rate this place higher. But, as a steady customer of BAM, I have eaten at Junior's frequently because and only because of its convenient location. That said, I think it is coasting on its reputation and maybe its cheesecake. I have had three barely edible meals there in the last two weeks, weird blintzes fried as stiff as egg rolls in a Chinese takeout, a scrambled egg sandwich which appeared to have been made with synthetic eggs, served on their \"famous twin rolls,\" both stale, and last night's ultimate horror, a sloppy, disgusting eggplant parmigiana with another stiffly fried thing (probably the eggplant) under a blob of tasteless red sauce right out of the can, and a mess of overcooked linguini. This monstrosity was $22. I shared it with a friend. We asked to have the check split in half, both paying with credit cards. Her tab arrived as eleven dollars (correct) and mine as twenty-two. The staff had great trouble understanding the problem, let alone fixing it, let alone in time for us to make our 7:30 curtain. What established restaurant in New York City does not know how to split a check?\n\nThe food across the street at Appleby's is probably no worse and a lot cheaper. OK, maybe they don't have cheesecake.", "author": "judith d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "Went here to eat with a friend on New Year's Day. Kinda overrated IMO. Our waitress, though nice, kept messing up our orders and took an unusually long time to retrieve basic items (extra napkins, cup of water, condiments, etc) despite the place being about 50% full at the time. The food was decent (me and my guest had breakfast meals), however, the sticker shock definitely set in upon receiving the bill. 3 Pancakes, scrambled eggs, and French toast w/ bowl of fruit was almost $50, at least double what you would pay for the same thing at a regular diner. All in all, I wouldn't recommend this place to anyone unless tourist traps are your thing.", "author": "Tristan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Excellent diner in Brooklyn famous for its many, many types of delectable cheesecakes.  You will not be disappointed in their desserts.  The main entrance leads you right through the bakery counters to prepare you for what is to come.\n\nMenu is intimidatingly large.  Page after page of cuisines and types of food.  It is more diner / comfort food focused.  If you cannot find something you like, it's more because you will be overwhelmed with choices.\n\nPrices are a bit steep but portions are very large.  Good luck trying to save room for dessert.  Be prepared to request a to-go container.  Full bar adds to the fun of the experience.\n\nService is just OK.  Friendly, but not the most knowledgable or efficient servers in my experience.\n\nLarge restaurant overall with many seating areas.  Mostly a kitcshy, diner theme.  Walls are lined with famous, autographed headshots from over the years.  Overall a very fun, appetizing place for a meal and/or dessert.  Highly recommended, especially for tourists.", "author": "Darren M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}