{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "After the seeing Junior's featured on the Food Network, Cooking Channel and in my sweet surrender dreams at night (over and over again) we knew for damn sure this was going to be one of the main stops for us while we vacay in NYC.\n\nWe stopped in at this particular Junior's (the original), 2 nights in a row. The 2nd night, we actually walked over a mile (in the cold!) from the restaurant we had dinner at just to get another slice of heaven from Junior's.\n\nThis review is just for the desserts here at Junior's.\n\nSlice of Original New York Cheesecake: Best cheesecake of my life! If someone raped me and handed me a slice of this creamy, decadent goodness, I'd probably end up raping my rapist right after. :)\n\nSlice of Strawberry Shortcake Cheesecake: The strawberry cheesecake part was very, very dense and sweet...but good! It paired well with the actual shortcake, which was super moist.\n\nRed Velvet Cupcake: HUGE! Like triple the size of a normal cupcake you see at other bakeries. I ended up having this 2 nights later after leaving it on our hotel room desk. Couldn't believe how MOIST the cake part still was. Unfortunately, since I left it out, I couldn't enjoy the cream cheese icing on top, but I could tell it would have tasted amazing if I had it fresh. Honestly, if the SBBF didn't smell it to tell me the icing might have gone bad, I would have definitely devoured that whole cupcake!\n\nBlack \u0026 White Cookie: Is this really a NEW YORK thing? Uggghh, why?! I want to be able to have these huge delicious, cakey cookies here in Cali! We shared this cookie in bed and let me tell you, the flavor is just as amazing as the nookie nookie we had on that bed. :)\n\nMajor brownie, or shall I say cheesecake points for the Junior's staff for being so friendly and efficient when we dined there. \n\nJunior's will now always be the first place we hit up when we're back in NY!", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "Average food at best. Also a bit pricey for diner fare even with the large portion size. Got the brisket melt which was surprisingly dry, would have been nice to have some sauce or jus on the side.\n\nFriends got the burger and pork chops. Nothing special unfortunately.\n\nThis place should be a cafe instead since the cheesecake was bomb. Next time I'm in the area will definitely find another spot to fulfill my appetite for savory fare and then hit juniors strictly for the dessert.", "author": "Bora G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "You can't go wrong at Junior's. The best way to describe it is a step up from your usual diner. They have everything you'd want from breakfast to deli sandwiches to seafood. The service is always really friendly and quick.\n\nIt's also a must for those visiting the Downtown Brooklyn area. There's so much history in this place. When you step inside, you feel like you're in old NY/Brooklyn. For such a famous place, the place is often crowded with locals, which is always nice and shows how great this place. Junior's is an institution, not just a restaurant. Oh, and of course, make sure to have a slice of cheesecake.", "author": "Hilla I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Might say I'm a sheep... Yes I like the popular things like an iPhone Rolex Lexus Nike ... But juniors is not a trend! ITS A DAMN GOOD CHEESECAKE", "author": "Brendon V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "I went to the restaurant part for the first time and the food was good but nothing to run home about. I have had their cheesecake in the past. It's more worth it to come here for that.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "We've been doing major lunch events here for over 15 years.\n\nOur group essentially takes out seating for 200+ for the set time frame. We have a pre-selected menu, designated section, and a great time. The waitstaff is on point, although it was a little faster under the previous management.\n\nI also occasionally stop by for lunch and pick up dessert before major holidays for friends and family.\n\nThis place is legendary. I'm happy they didn't sell and move.", "author": "Liliya N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-24", "description": "Horrible, horrible, horrible! This place deserves negative one star; however, I could not post without checking at least one star.  I placed my order for a Thanksgiving dinner party over a week ago.  I was informed that the window was between 9 and 1.  It is 1:54 pm and when I called to inquire about my order I was greeted with attitude.  I have little ones starving and a failed dinner party in front of me.  No one called to apologize for the lack of communication and professionalism; however, when I called to inquire I am met with attitude.  Moving forward, I would strongly suggest that customers stay away from ordering \"catering\" from Junior's because you will be met with poor communication and a lack of food! Two thumbs down and NEVER again.  Management should really look into who they employ because this is the worst experience ever! Thank you Junior's for ruining my Thanksgiving dinner party!\n\nHere we are over 2 hours later and still no food!  Holiday ruined! Dinner party all left to try and catch a diner with their kids.  No way to treat people.  No humanity at all.\n\n*Update*\nAlthough my Thanksgiving experience was a fiasco.  I would like to thank supervisor, Colette S. For following through with rectifying our experience.  She was the bright spot in an otherwise horrific experience.  Thank you Colette for your professionalism!", "author": "Jhaye J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-17", "description": "I'm never quite sure why people love this place. Both locations are large, crowded, noisy, and seem inauthentic in terms of the diner-style atmosphere they are trying to emulate. The food is purely OK. It's diner food with a New York local flavor (which has been done better elsewhere). Maybe it's because they have a reputation for having the \"best\" cheesecake. If you say Junior's, the first thing someone usually thinks of, of course, is the cheesecake. I'm just not excited about any of it. Not even the cheesecake. I've had better homemade cheesecake on multiple occasions. \n\nThe bottom line is that the food isn't bad. In fact it's actually pretty good. But it's not anything to rave about and the fact that it feels like a theme park's version of a traditional city diner really sours the experience for me. This was an out-of-town visitor's favorite for a while, which is why I had the unfortunate experience of having to go there multiple times, even though I don't enjoy it. Is this a tourist trap? I just don't know. Go to Katz's instead.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "This Brooklyn institution is the ultimate cheesecake mother lode, not the kind of cheesecake that comes out of a \"factory,\" if you know what I mean (I'm teasing, of course, I like the cheesecake there too).   My suggestion is to look past the fancier cheesecake creations and stick with the basic cheesecake.  You wont be sorry.  \n\nThe cheesecake is, as they say, most fabulous...perfectly creamy, not too sweet, light but flavorful, and firm (and it wont fall apart on you).  It magically melts in your mouth.  Very very good stuff.  The food itself is fairly standard (the fries were bad) and the Dodger decor all over the place is just downright annoying (Giants fan here, can you tell?).  \n\nFinally, excellent service.  We arrived just 30 minutes before closing and we were not rushed, servers are friendly but not overbearing, attentive, helpful.  I'm always wary of \"institutions,\" out of concern that they may be overrated.  IMHO, Junior's immense popularity is well-deserved, at least for its cheesecake.", "author": "Angel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "When you go there look for the waiter name Nafaa Cause he  is a people person and knows how to be interact and be a waiter...not like that wench name nikki or the asian looking waitress she had either a stiff one stuck up her ass or she just didn't want to be there either she was going to get slap Until the manager here the authority in my voice then Nafaa came and save the day.....Overall food was nice! Minus the Evil she was trying to give my partner but little she did know the angels was protecting her ass Cause I don't Tolerate Lack of Common sense", "author": "Kay. K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "I didn't have the food and the staff is rude that's why 4 stars. The cheesecake gets 5 all day. Ohh my goodness it's simply wonderful. The strawberry short cake is good as well. The ted velvet cupcake I had was a little dry but the Red Velvet cheesecake was delicious!!!!", "author": "Tieshea B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "It aint just about the cheesecake here, awesome breakfast you should try !!!  But yeah, the cheesecakes are the BEST in the business !!!   Very roomy, great customer service !!!", "author": "Jmert J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "It was my first time here and with 683 reviews before mine, what more could I say that others haven't already?\n\nI had a large slice of the carrot cake cheesecake, and it was really good...  I'll be back again in the future.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Very good service and good food!  The pastrami Reuben was delicious and the strawberry cheesecake lives up to the hype.  The cheesecake had a light, fluffy  texture, and was topped with large pieces of strawberries.  Don't leave the restaurant without ordering a cheesecake", "author": "Yoon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "I like the decor and the feeling you get when you're in Junior's, a true Brooklyn establishment. From what I understand from my friends, the entrees are middling in quality, but the cheesecakes I've had there have been good, and I like that they provide cole slaw, pickles, beets, and bread plates to your table gratis, and that they're not lazy about water refills. \n\nIt seems like a miniscule thing to consider, but sometimes a man just needs his water and he needs a lot of it, and it seems the waiters at Junior's are happy to oblige. \n\nAll the service I've had here has been very polite. So polite that the last time I was there in February 2012, a person in my group who was so drunk he threw up at the table more than once was not asked to leave and no one was mean to him. They just politely cleaned it up and moved on. The staff may very well have been fuming on the inside (we were all embarrassed of this guy and wished he would just go home, but instead he ate cheesecake after puking which, of course, he also ended up barfing minutes later), but to our faces they handled the situation very calmly and quickly. I have a lot of respect for that.\n\nI would argue that the Carnegie Deli cheesecake is better, but it's a lot easier to get a table at Junior's, and you have more personal space in Junior's, too.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "We think that all the breads are five star. The waitress was also five star. Very helpful and attentive. The red velvet cheesecake was also five star.  \n\nI thought that my brisket sandwich was three star and a bit expensive. Should have been a few dollars less. It did not come with any side orders. Had to pay extra for the French fries. They were 3.5 stars. She had a combination fried fish with scallops and shrimp. She gives it four stars. She also had cole slaw and good pickles.  We also liked the Brooklyn themes and the real seats from Ebbets Fields, as well as the autographed picture of Sandy Koufax on the wall.\n\nThis place is a great treasure in Brooklyn and should be visited by anyone who comes to New York. The cheesecake is a must to try.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Good luck choosing a type of cheesecake... I'm still working my way down the list, but they're all amazing!  (Especially the chocolate mousse!)", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "Junior's is an overhyped landmark with mediocre food. The only reason to come here is for the carrot cake. I got one for my friend's birthday and it was very tasty. Ironically, the cheesecake is actually not good here. Too sweet and doesn't have that homemade feel. Overall the place is way too expensive and nothing out of the ordinary.", "author": "Bernardo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-12", "description": "I always go straight to the cheesecake and golden layer cake with chocolate frosting ..Haven't eaten here since a kid like 16 years ago I'd say I was 9 when I came I remember pancakes that's about it ..Anyway today my friend wanted to go  and eat there ..For  some strange reason I didn't have good vibes ..Low expectations aside ..The waitress gave my home girl turkey bacon not the sausage she asked for ..The toast  was burnt I requested cheddar cheese for my omelette she gives me American n the fries looked very much like the frozen fries that be on sale at the supermarket ..Waitress not ONCE checked in with us walked past for 20 minutes and didn't say how's the food I tried telling her but she acted like she didn't see me I sent my food back she gave me attitude ..I didn't ask for more food I asked you to send it back not bring me more garbage .. The bacon side was 4.50 didn't even look fully cooked ..Overall big fat 0 ..Never again ..", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "I love the Black Forest Cheesecake! The perfect combination of chocolate and cherry flavors all with a rich cheesecake texture, it's just perfect.\n\nUnfortunately, I'm not very impressed with the food otherwise. It's classic New York deli fare, but the pastrami really left something to be desired. Maybe it's unfair to compare to a place like Katz's Deli, but with cheesecake this good, it really puts them in an elite category.\n\nGo for the cheesecake and a cup of coffee, you won't be disappointed!", "author": "Calvin D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}