{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "Great food. Love the marble and devils food cheesecake\n But all costs avoid a waiter named Dennis--especially in the evening when the gratuity is already added to the bill!", "author": "Femi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Visited Junior's for the first time and it's definitely an old school diner. With a warm and cozy atmosphere, I went there because I heard so much about it and wanted to grab a bite to eat before the play I came up from DC to see at the Kumble Theater. The wait staff was friendly and professional and the waitress we had was a class act! Tasha brought out water with ice to the table, but proceeded to bring an extra glass of ice to keep the water cold. Very nice touch! When our food arrived, it came to the table piping hot and delish!! I ordered a veggie omelette which was very tasty and nourishing. Came back later for the famous cheesecake after the play. Loved the original with strawberries, but wished the crust was made from graham cracker crust. Not sure what crust they use, but I didn't care for it. Other than that, the food was good comfort food. When I'm back in Brooklyn, I'll be sure and stop through again!", "author": "Sondra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Finally tried the famous Junior's on a trip to NYC. Pretty good food and of course took home a slice of strawberry cheesecake.", "author": "Dre B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-22", "description": "Overpiced standard to disappointing diner fare. Cheesecake does not live up to legend.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "My spiritual home in Brooklyn. Love everything about it. Delicious old school classics, great service, classic surroundings. And don't forget the cheesecake!", "author": "Karl-Ede K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-26", "description": "First visit here.  Food was ok. Burgers very good, fried chicken excellent, avoid the cheese steak.  The wait staff very nice for NY.\n\nI strongly recommend eating at Juniors.  However, your main reason for visiting should be the cheesecakes.", "author": "Bob B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "So good!\n\nI was out to dinner with my friend, and when I was about to order a cheesecake desert, he stopped me and drove me clear across town for the BEST = Juniors!\n\nOnce we got there, I was so overwhelmed by all the good-looking choices that I couldn't decide on one...so he got me the two I was torn between, plus his favorite.\n\nWhile we were driving home, I was thinking, what are we gonna do with 3 whole cheesecakes?!?!  Once we got back to the house, some of his friends came over, and when I offered them some cheesecake, they all were like \"nah, I already ate and I don't like sweets\" or whatever, but when they found out it was Juniors cheesecake, these grown **s men ate up all my damn cheesecake like they were some starvin children!  \n\nBy the end of the night, I was actin like a fool, \"where's my 3 cheesecakes!?!\"  I was so mad!  But when everyone left, my friend showed me that he hid a few slices of each kind in the back of the fridge.  I guess they always act like piranha when it comes to Juniors...\n\nMmm, can't wait to get back to the east coast and get some more!  In my book, it's the best in the country.", "author": "T T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Eh, it lives on its fame, the cheesecake is great but the food here was just ok. Much more legit delis in Nyc besides this and the overplayed Katz's", "author": "bill l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "I didn't think I've love Junior's cheesecake because many have said it's overrated ... but in fact, I LOVE Junior's plain cheesecake .. it's thick and dense but not in a bad way .. it's silky smooth and creamy and melts in your mouth (NOT at all hard or chalky as I've read) .. it's sweeter than Eileen's but tastier in my opinion .. I prefer a graham cracker crust but the lemon cake bottom was very delicious!\n\nI also ordered a key lime pie, which is my favorite dessert, and it's TERRIBLE .. the custard was thick and heavy and gross .. it wasn't tart at all .. the only thing good about it was a thick graham cracker crust ..\n\nProbably 10 minutes after trying a few bites of both, I had uncomfortable stomach pain and dashed to the bathroom and ... well you know what happened!\n\nDon't know which one made me sick, but one of them did! ):  Next time I\"ll try each separately and I pray it's not the cheesecake .. because I love it so.", "author": "Anvy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "I liked Juniors. It delivers what you expect with ridiculously good service. Bonus points for authenticity and music.\n\nFood- 3.5 Stars\nBreakfast was fine nothing special. Omelet's were fine, home fries as well. I have had better, I have had worse.\n\nThe rolls and pastries they brought out before hand were nom nom nom awesome.\n\nWifey went back for lunch and got a slice of cheesecake and ate 1/2 of it. She said was sinfully delicious and artery clogging.\n\nValue- 5 Stars\nVery good value, like $25 for two huge omelets and rolls/Danish plus juices\n\nService- 5 Stars\nJust on point. Coffee and water always full.\n\nAtmosphere- 5 Stars\nKinda old school diner-ish. Love the music and the bar area.", "author": "Alexi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "OMG.\nA Brooklyn institution --- hell, it's a NYC institution!  Service can be spotty --- but worth the \"wait\" for your food.  Overall --- the grub is NOT anything to write home about --- but there are MUST HAVES:\n\n1. BEST matzoh ball soup in ALL of NYC \n2. BEST Strawberry Shortcake Cheesecake\n3. BEST Strawberry Cheese Pie\n4. YUMMY Macaroni \u0026 Cheese\n\nAND --- if you want's sumthin' diff'rent --- get the \"SOMETHING DIFFERENT.\"  An artery clogger of beef brisket sandwiched between two potato pancakes.", "author": "BrasilPo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "Have been living in area for a year and familiar with history so got around to stopping by for quick snack on Sunday late afternoon.  We split a Pastrami sandwich and a piece of Strawberry cheesecake.  Sandwich was a little small and OK but nothing great.  Cheesecake was good and obviously the main draw.  Understand that prices probably need to be high here to maintain operation and possibly for rent but not exactly a value.  Odd behavior by waitress in that she insisted on handing me the check vs just leaving it on the table, then she was insist on giving it back to me was it once it was run with credit card and pointed to area where I needed to sign and leave tip and waited for me to tip and sign.  Was a bit odd in that I have never experienced that before and place wasn't busy so they weren't doing it to quickly turnaround tables.  Respect place for history and giving it three stars for that alone but probably won't be back", "author": "Kyle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "Greatest cheesecake in the country I'm convinced! Had Junior's ever since I was a child. Have faithfully ordered their triple chocolate cheesecake with chocolate chips on the inside as well as the strawberry cheesecake. The prices are expensive but rightfully so! If you are in Downtown Brooklyn or Manhattan's Financial District I believe, I can't remember where Manhattan's is honestly, GO HERE AND ORDER A SLICE, OR TEN, OR A WHOLE CHEESECAKE. You will come back for more I promise you.", "author": "Devon A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "The Strawberry Shortcake was great. Jaw dropper!", "author": "Ray I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-17", "description": "This is a review of the food, not of the cheesecake.\n\nThe food was never spectacular but the last time I went two years ago, it was at least all fresh and well-prepared standard American diner-type fare.\n\nNow it's a disaster.  The matzoh ball soup, once clearly homemade from scratch, in a delicate, almost clear chicken broth dotted with pieces of carrots and celery, now consists entirely of toxic-pee-yellow liquid that tastes distinctly like artificial flavoring (and possibly even msg), no vegetables, just the pee liquid and matzoh balls.\n\nAnd so on and so forth.", "author": "Lee J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "I like Juniors. You get a ton of food.  I don't care much for most of the dishes there but the deli sandwiches and the cheesecake are really good.  I also love the pickles that they serve while you're waiting.\n\nGenerally quick and friendly service.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "Food was great. Service was terrible and I was at the counter. Never going there again.", "author": "ValueKid S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "great chees cake and blintzes at this institution! A total scene at night. Big portions and no deals here but good.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "More than Cheesecake, the Lobster Roll and Reuben's will make you want to make this place a tradition.  Juniors is truly authentic.", "author": "Ron Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "Awesome! i didnt give them 5 stars because i know a way in which the cheesecake could be improved.That way is stealing the recipie for crust from \"copelands\".That would be a cheesecake for all to taste.I had the strawberry cheesecake and it was magnificent.Real big tasty strawberries! YUM", "author": "Tramaine W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}