{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Not impressed with the cheesecake or the service. Had the apple crumb cheesecake; just okay. Service was not very attentive. The 50s decor was cool.  Not likely to make a return visit", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Lordth!! The \"take-out\" cashiers have disgusting attitudes for those basic cheesecakes. Just go to the Cheesecake Factory", "author": "Stacy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Juniors I will keep this short and sweet.  Always wanted to check this place out if I ever came to New York.  Well I'm here and since it was impossible to find parking down town New York we drove to Brooklyn and hit juniors.  \n\nThis famous institution looks just as it did when I saw it on tv about 5 years ago.  The food was great I had the burger which was perfectly cooked could have used a little season but was from fresh ground beef very good overall.  The bread basket with cornbread was nice also.  \nSurprising the beets and coleslaw were pretty good also.   I was disappointed by the cheesecakes due to the presentation.  I was thinking they would be on the level of presentation of Cheesecake Factory but feel short of that.  I opted not to get one especially after one of the ppl That was with us stated she had it and personally preferred that other cheesecake place.", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "I'm so saddened and disgusted by the state of this place.  What was once a thriving landmark restaurant is now a mostly empty, sad tourist trap. \n\nThe drink menu is not really a drink menu. It's a list of all the liquors in stock... WTF? The food menu is equally dismal and everything is severely overpriced. \n\nThroughout the years, this was a place I came to with my family for celebrations, with friends after work for great drinks and dinner, or just because... Too bad this may be my last time. \n\nBrooklyn is dying!", "author": "Lora R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Like the food but it's getting a little too pricey IMO. Very good food and nice staff. Love the beets and pickles you get before meal. Like I said just be prepared to spend some coin but you will get a very good meal at a very nice restaurant.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "In New York on a bus trip and wanted to take cheesecake to snack on on the bus. The staff was so rushed and rude. No one said hello or thank you. I asked for 2 forks and was told they were in the bag. I was basically pushed out of the way. I got on the bus and no forks.", "author": "DiAnn E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Juniors has been part of NY life since 1950. In my opinion they have the creamiest and most tasteful cheesecake around which is what keeps people coming back.   As for the diner side of things the food is plentiful and tastes pretty good.   The dining room is clean and service is pretty good.   Parking can be a pain so if you can use public transportation or Uber then choose that option.  You can find a paid spot but you might find it a bit of a challenge.", "author": "Frank F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "101 Tastiest Places to Chowdown in USA  \nCountdown Number: 34\nFamous for Cheesecake - New York style cheesecake\n\nKnown for its creamy and delicious New York Plain Cheesecake, Junior's has been serving NYC since 1950 with the first and original location based in downtown Brooklyn... yes! here at 386 Flatbush Avenue Extension is where it all started... historic as well as iconic... and now the chain is available on 45th \u0026 49th street near Times Square, Foxwoods Resort in Connecticut and Boca Raton in Florida. Although there are varieties of cheesecake shops available in nearly every corner of NYC, Junior's has been and will always be a part of the Big Apple in every sweet way.", "author": "Jack K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Looking for comfort food in Brooklyn -This is your place.\nA lot of good memories and I am happy to say that they have maintained their high standards for the homey,kitschy atmosphere and quality of the food.\nEnjoyed an excellent brisket sandwich, not dry, with au jus sauce and some cole slaw and pickles.Finished it off with some orgasmic strawberry cheesecake and coffee.\nAlmost forgot ....a real chocolate egg cream with U Bet syrup and fountain seltzer\nStay strong", "author": "alexander b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Serving size is HUGE here so make sure you share everything! We had the shrimp parm, Greek salad and red velvet cheesecake. We didn't even eat the Greek salad because we were so full and so we packed it to go home.\n\nService was excellent, we had a wonderful waitress who was kind, funny, and super accommodating! \n\nShrimp parm was really delicious and I loved that they gave a side of yummy veggies. \n\nCheesecake was sooo delicious. So light, decadent, and fluffy!!", "author": "Julia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Huge portions. I got a cheeseburger with fries and a side salad. I also got 2 Halloween cupcakes to go. Everything tasted great. The waiters and waitresses were quick and polite.", "author": "Arianna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-18", "description": "I've been to Juniors a few times and every time I come here, the service is extremely slow. Ridiculously slow. I would have given this place a higher rating because the staff is just pleasant and always smiling, but unfortunately, my patience was wearing thin. I ordered a tuna melt (open face) sandwich. I have to say, Juniors is very generous when it comes to food portions. I'm also not sure that anyone can finish their plate in one sitting. I had leftovers for the next day, which is always a good thing. I love their steak fries - these folks know how to fry 'em! The tuna, however, was a downfall. It was oddly cold when it arrived at my table. My friend from out of state ordered a burger and asked for it to be a medium-well, but sadly, they got her order wrong and she ended up not eating it at all. What I can recommend for you all is to order their reuben egg rolls. They are so delicious!", "author": "Florann E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "In town for the week and couldn't go home without stopping the famous Junior's Restaurant. It definitely was worth the trip. Our host was a little pushy because we didn't know what we wanted but she can tell we were not from New York. The food was pretty good, I had pancakes aka hotcakes and turkey sausage. My fiance had a veggie omelette which we shared and their famous french toast which was really good. Before we left we grabbed a 12\" NY strawberry cheesecake which we were able to bring back to Chicago in one piece. Thank God I had a AMEX gift card because the food is wayyy too expensive. You have to see the mural of photos from the restaurant of the Yankees, Bill Clinton, etc", "author": "Parris J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Fun sitting, while having coffee, watching all the people stroll by! The day is still early yet! Juniors tends to be more of a great dinner spot! Having an full open bar makes this a great place to hang out in a family and friend type environment; Diner style!, but not diner prices!", "author": "Tammy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Everything here is served BIG as what you will expect so hold your horses ordering everything on the menu. Their food is great and tasty!\n\nOne last thing that you should not forget is to try their Cheese cake variations, to die for!!!", "author": "Sophia Fabiola D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "Sadly Juniors service is not the same as it used to be. Servers are not working together to insure customers have a comfortable dining experience. No one came over so we had to ask, only to get \"sure but this isn't my section\". Pickles, beets and cornbread also had to be requested after being seated for 20mins and orders were in. Juniors please step it up and get new management. Please! I grew up going here.", "author": "Keisha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "A true classic. Nothing really tops a good ol' Junior's cheesecake!\n\nJunior's boasts a timeless menu filled with American diner staples coupled with their own unique cheesecakes. For $8-$10, you can get a HUGE cheesecake enough to feed two people for dessert. Their favors range from sugar-free to fresh strawberry to apple crumb cake and everything in between! I was pretty disappointed to compare my sad slice of plain old sugar-free cheesecake (or \"diabetic-friendly,\" as the menu calls it) with my friends' decadent slices topped with fancy fruit and rich chocolate, but that's not to say that the sugar-free slice is bad. Junior's is the best spot to catch up with your friends over a cup of hot chocolate or satisfying slice of pie, and the ambience of the restaurant really adds to the overall vibe.\n\nWith all that being said, I'm still not a big fan of their regular food. Their burgers were dry and fries pretty bland. I definitely wouldn't call Junior's the best classic American diner out there, but I would dare say that their cheesecake is among the best. I usually only come here after a meal elsewhere, and the trip is well worth it. Few places offer dessert as good as Junior's, so be sure to check it out!", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I have been coming to Junior's for over 50 years and I have never been disappointed with the quality or quantity of food served. My favorite is their Seafood combination.\nI also love their cheese cakes and chocolate cake", "author": "Brenda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "My experience at Junior's was jaw dropping. Starting from the bread and corn bread that were given as the appetizer(mozzarella sticks), and  all of their wing flavors. The entrees were  well seasoned and very presentable. Very appealing to the eye. I ordered the fish,shrimp scallop entree with fries. It was outstanding. Everything just exceeded my expectations from the decor, display case of chessecakes, staff, and the food. I definitely will be returning back to Junior's for a 2nd time some day.", "author": "Catema M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "I actually came here a few months ago.  Ain't nothing special about this spot as far as the cuisine.  As a matter of fact I forgot all about it until this showed up in my feed.  Real talk I don't even remember what I ate.  I remember I was going to try the jerk chicken but this heavyset Jamaican lady that was at the table (we were a large group) looked at me like \"ya mad?\"  I might've ended up getting a burger or something like that.  The cornbread and the shrimp bisque soup was cool.  Other than that I might've well have ate at Applebees (FYI I don't eat at Applebees).  I get it it's an iconic location for some reason but it needs a renovation.  They need to do a better job cleaning the restrooms too.", "author": "Benny B."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}