{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-31", "description": "OH MY JESUS CHRIST SUPER STAR!  MOUTH 'GASM ALL OVER THE PLACE! Pardon that sudden burst of excitement. \n\nOne, if not, the best cheesecake in the NY area. As an avid baker, I can tell you that this cheesecake is simply dee to the freaking vine! DIVINE! I could seriously eat the whole thing by myself, and I have.\nNow I have only 1 qualm. Do not go to any other Junior's besides the one at DeKalb Ave. It is not the same, the one at DeKalb is the original. Totally worth taking the Q/B/R to Dekalb. It might be a little scary, especially since the area is sketchy, but worth the risk! \n\n**Now, Junior's has other foods, but I would not recommend the actual diner. One goes to Junior's for the cheesecake (I love the raspberry swirl cheesecake), the chocolate mousse cake, and the red velvet cake, that's it.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "I've seen this place on TV for a zillion times and heard about it via word of mouth a zillion and one times. So,  when the opportunity to come to this temple to baked cheese and sugar presented itself, I couldn't resist.\n\nWe got seated surprisingly quickly, on a busy Saturday night.  I have to give it to management for buying such a large space and having the wisdom to make a quickserve counter for those who just want pastries to go.  The line was pretty deep there.  If you have a chance, take a quick look at the cheesecake shaped like the Juniors building under glass.\n\nMy party ordered the #1 Cheesecake and the black forest cheesecake along with some coffee.  Even on a full stomach, both slices were fabulous.  The fluffiness and richness of the cream cheese they make here kicks the buttocks off of all the Entenmann's cheesecakes I grew up on and my reference point.  I definitely want to go back. 2 down, 23 to go.", "author": "Keith O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Anywhere else in the country a pastrami-corned beef reuben sandwich mighty be a tasty mess but is usually a) over-salted and b) greasy. The beauty that Junior's serves is neither. The side of homemade dressing was equally worthy. No BS 1000 Island but a subtly flavored (and not over-salted) sauce was served on the side that complimented the sandwich perfectly. Pickles and cole slaw were really good and there were plenty. Coffee was very good and cheesecake was out-of-the-park delicious. Service was friendly; bartender Tim was styled and cool, and there is a selection of at least three local brews on tap that were all good. I liked this place.", "author": "Joe R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "There is only one reason to come here and one thing to order-strawberry cheesecake. Be it a slice or two or a whole cake, this is what you want. Screw the Cheesecakes Factory, this cake is creamy, sweet with a nice Graham cracker crust.  The strawberries on top are nice and plump and the strawberry  sauce is sweet and brings it together. Its my love and worth every calories.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "Just a couple of things to say about Juniors;\n\n1) the young sister was great as far as service,loved the Afrocentric vibe especially coming from the west coast.\n\n2) someone posted on Yelp that they must have missed something while at this place and I concur with his/her statement.\n\n3 ) Food was awfully bland and seemed to be microwaved.\n\n4 ) I will definitely avoid Juniors in the future even if it's late with very few options.\n\nThe one star is for the waitress", "author": "Food Has To Be Good W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "The way to my heart is through Juniors Cornbread! I travel 60mins just to get some of there cornbread! First off the atmosphere is very like old school glam, secondly there cornbread is beyond anything in this world. Once you sit down they give you complimentary cornbread, pickles, beets and coleslaw (Talk about making sure your feed). Then there portions are OUT OF THIS WORLD!! They give you so much food it amazing! The drinks are straight alcohol lol but they are so good. i have been going here since i was about 12 with my family and I continue to go to this date as a special occasion or treat night out. LOVE IT! one of brooklyns gems!", "author": "Monique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "I recommend the delivery service whole-heartedly for hard-to-please cheesecake connoisseurs.\nRecently my dad had been waxing nostalgic about the cheesecake at Junior's. I knew he loved cheesecake, because every time he orders some in New Jersey, he talks about how it's not a \"real New York cheesecake.\" But this mention of Junior's was new. \nSo for his 77th birthday, I had a plain cheesecake delivered from Junior's. Oh my gosh. He was beyond deliriously happy. My mom too, and she doesn't really like cheesecake. Apparently it came very securely wrapped so that nothing would happen to it in transit, and it was incredibly fresh. Believe me, my dad would have told me if it sucked or was just so-so. No, he thought it was beyond great.\nAm so relieved. At his age, he doesn't need a bunch of stuff to clutter up the house some more. He just wants simple things like comfort foods that make him happy and bring back good memories. Yay, Junior's!", "author": "Charlotte H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Junior's strawberry cheesecake is soooooo good. It's very creamy. The perfect stress reliever.", "author": "Chaniqua T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Classic NY diner. Went with my wife and a friend. Food is good, the cheesecake was better. Good food good friends what more can you ask for on a gorgeous Saturday in NY", "author": "Nick M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "I HAVE BEEN COMING TO THIS RESTAURANT FOR AS LONG AS I CAN REMEMBER. In fact my mom would come here regularly when she was pregnant with me in 1988. My family, friends, and Community supports this Restaurant. Today on the celebration of its 65th Anniversary, I came out extra early 7am to be exact to get my .65 cent slice of cheesecake and another slice for later. My God mother and I went together after learning that it was only 1 slice per person though it wasn't advertised on anything I read. When we reached the front she ordered her 2 slice and I handed Thomas the cashier $1.00 to pay for hers. When he was finished with her and handed me my change, he yelled next. I then informed him that I was next and I was ready to make my order. \"One per person he said\" I replied I'm aware, that's why she ordered hers and now I'm ordering hers. He ignored me and continued to call the next person. We began to argue because he was clearly wrong. Though  I paid for my God Moms cake she ordered it with her own bill, there were 2 separate people present, there was no violation of policy. Before I knew it things escalated and Thomas the cashier called me a Monkey. We began to really get heated in our insults in front of a long line of customers and full staff. He then slammed the drawer and walked away while cussing me. What really surprised me was security coming and accusing me of insulting him, while he was still cussing in the background. To make it even worse, The owner then approached me with a n attitude and asked me to stop yelling and to not make scene, tho his worker and I just had a heated confrontation in front of the entire restaurant all along he continued to cuss at me from a distance. \"I've owned this restaurant for 25 yrs, I've known him for 25 yrs and nothing has ever happened, he's just overwhelmed with all the customers\". If someone has been working at a major restaurant and landmark for 25 yrs and they become overwhelmed by customers ordering 1 slice of plain cheesecake for .65 cents by 7am when you just opened at 6:30 That's a concern. No one should become overwhelmed within a half hour. I CANNOT DEAL WITH ALL OF THE EXCUSES, BEING ACCUSED OF CAUSING AN ISSUE I DIDN'T START, AND THEN NOT EVEN BEING ABLE TO EXPRESS MY DISSATISFICATION WITH HORRIBLE DISRESPECTFUL CUSTOMER SERVICE. I LIVE IN THIS COMMUNITY HAVE LIVED HERE ALL OF MY LIFE, I ABSOLUTELY LOVE JUNIORS CHEESECAKE, BUT I WILL NO LONGER DINE OR TAKE OUT FROM JUNIORS EVER AGAIN.", "author": "Raymon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "The cornbread is good. We also liked the cherry ice cream soda. However, what stood out the most was the wonderful service. Our server, Nikita, was a delight. She was so helpful, so warm, and made us feel at home. I want her to be the waiter at all of the restaurants I ever go to. Love you Nikita, see you next time, I hope!", "author": "Thoralf I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "Cheesecake is not what it used to be. I have noticed the taste and quality to its regular cheesecake. Not as creamy as well. I have visited juniors 3 times since hoping that it redeems itself, but to no avail. , it is still not what it was years ago.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "Okay. First, I need to catch my breath. \n\nI just inhaled the most divine slice of cheesecake I've ever had the pleasure, nay, privilege of tasting. \n\nApple crumb cheesecake. It's exactly what it sounds like: a fusion of apple crumb cake and Juniors world famous cheesecake. \n\nI now have a new destination for late night guilty pleasures. Well, another one anyway.\n\nTo all of you purists out there- the classic pie is great. FINE. But you're missin out if you stick to your regular bread n butter. Branch out, you'll be SO glad you did.", "author": "Nicholas A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "I love the cheesecake, BUT the food is always a surprise (it can be really good or it can be bad). The service is always great - waiters are very friendly and you don't have to wait long. The prices have gone up over the years. However, the food serving is pretty large.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "By far the very best cheesecake ever. Its dense and creamy and fresh....with so many wonderful flavors.\n\nI am NOT a huge cheesecake lover. However, if I want cheesecake then I prefer Junior's.\n\nI do not like Cheesecake Factory cheesecake. I do not like Italian ricotta style either.\n\nMy personal favorite here is the Carrot Cake Cheesecake- its moist spicy carrot cake layered with junior's Cheesecake- its divine. Also, I love their Pumpkin Cheesecake- just the right amount of seasonal spice, pumpkin flavor with a nice graham cracker crust. \n\nIt's a NYC institution because its excellent- it isn't (just) a tourist attraction. They bake thousands a day, ship all over the world \u0026 patrons wait in line for a reason. Its excellent!\n\nThe decor is totally 70's Soul Train lol. The rest of their menu is good too but I usually just come for the Cheesecake.", "author": "Debrin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-20", "description": "Love this place! Grew up here, and it's right down the Street from my High School (Brooklyn Tech)\n\nNow that I'm a grown up, I can order drinks, but I still love their Milkshakes and Floats.  Famous for their Cheesecake (of course), but Hamburgers and Pizza Burgers are awesome too! \n\nAlways crowded, but never a long wait.  Stop in for Breakfast too.  Never had a bad experience in 20 years.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Only go for breakfast or dessert. Corned beef hash or french toast, cheesecake for dessert of course! Great delivery packaging as well!", "author": "Sara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-15", "description": "Rating on cheesecake only otherwise it was a 1. The table next to ours was ordering dinner and the overpowering stench of the fish turned out whole table off . Fish that smells that strong has gone bad. Place looked tired and old- time for a facelift.", "author": "Lourdes E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "If you are reading this, then you are on the fence. \n\nListen - Just go. You won't regret it.\n\nGet the egg cream, matzo ball soup and a sandwich. Save room for cheesecake. Everything on the menu is really good, but go to the original place in Brooklyn.\n\nJuniors is one of the few places that figured out that pan fried chicken is the way to go. It's so juicy and delicious. \n\nIf you go for it, you better be hungry or share with a friend because it's huge - the chicken must be the size of a velociraptor.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "Old school charm sustained by the wait-staff from the local ESL school.   I'm here because it is the Smithsonian of cheesecake establishments.  Fame is not enough for my tastebuds.  The coffee tastes like instant coffee and the waiter brings me cheesecake  with a sour look on his as though the slice represents his \"last chance at romance.\"  P-Diddy you have Junior's.  I'm done.  But is the wait-staff part of the enslaved workforce Anderson Cooper is so worried about?  Spoiler alert:  the original cheesecake has a cake crust or really no crust alt all/. It was creamy.  It came was served plain, no whip cream.  But there was some whiplash.", "author": "Timothy H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}