{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "Since when is it ok to add a gratuity for a take out order WITHOUT ASKING??!!!!  And still have a line for a tip!!!!  Now I remember why I haven't been back in such a long time. They are rip-off artists!", "author": "Chanel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-27", "description": "Got coffee and bagels for the group I was with. We dumped out the coffee it was so bad and the bagel was disappointing.  Would have done better at dunkin donuts.  Was hoping for something so much better in NY.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "We visited the branch in Grand Central terminal in Manhattan for a cup of coffee, people-watching and a slice of New York cheesecake.\n\n\n All of these aims were definitely fulfilled - and more.\n\n\n The location of the Grand Central branch is brilliant, in the dining concourse of the station, where you can just sit and watch people buying food, eating, chatting, drinking and possibly waiting for their trains too. The elegant surroundings are echoed by the style of the cafe - although it's on the concourse it is marked out by a ramp up to the area and fenceposts around.\n\n\n Coffee was hot and fresh. We ordered the Cherry Cheesecake and Carrot Cake Cheesecake - just a slice of each.\n\n\n What arrived was more of a mountain. The carrot cake slice was about as big as my head, and therefore most of it had to leave in a box with us, but it was so fresh, tasty and indulgent and most quintessentially Brooklyn cheesecake. YUM.\n\n\n The cafe also does hot eats (burgers, fries and the like) and a hugely vast range of cake slices, as well as cheesecake.\n\n\n A definite must to visit. It's awesome.", "author": "kateyay"}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-12", "description": "I know I may not be like most of the reviews from people who frequent Juniors but I have to say I am not all that impressed with this old-style NY deli/restaurant.  I've made a couple of trips here to see all the hype and have tried the so-called \"award winning pastrami and the \"#1 cheesecake\", and can say that I've had much better.  Just my personal opinion.", "author": "Forrest W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "I gave Junior's a second chance.  All I can say is it was an ENTIRELY different experience.  The service was prompt and efficient. The wait staff was attentive and helpful, almost too attentive.\n\nI tried \"Something Different\" and it was really quite tasty.  The side dish of beets were amazing.  \n\nThe cheesecake was really quite good.  It was the perfect texture and flavor.  I don't recall the type of cheesecake but it was the cheesecake inside a rich chocolate fudgy cake.  \n\nEveryone at my table enjoyed there meal and the service.  I would definitely recommend giving Juniors a chance.  Obviously I had two completely different experiences.  I know they are definitely capable of providing amazing food and service.  If you don't enjoy the food or service let the manager know and I am confident they will take care of you.\n\nI would give the second visit five stars, but I am still in disbelief it was that great of hospitality.", "author": "C. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "Even if you're not a cheesecake person, at Junior's you will become one! My favorites are the combos -- red velvet cheesecake, devil's food cheesecake, carrot cake cheesecakes, chocolate mousse cheesecake. The kiddees also love their cupcakes. They are the old fashioned kind, vanilla cake smotherered with butter cream and sprinkles. You will not find lavender, green tea, or bacon on these cupcakes.\n\nI ordered their cheesecake and buttercream cake for a family event, and they were a big hit.  I can't say much about their food, since I usually come there just for dessert. It is also fun to sit at their counter (there's a small one in the front) and watch Brooklyn go by.", "author": "Maureen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-07", "description": "There's only one reason to go here, as far as I'm concerned, and that's the cheesecake. Eat it there or get it to go, but don't waste time on the other stuff. Overpriced food in a mediocre atmosphere.", "author": "Leah Shane D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-19", "description": "This rating?  I went there solely to try their \"world-reknown\" cheesecake.  I have heard about Junior's Cheesecake for more than ten years and have heard their cheesecake has been famous for probably thirty years or more.  So this intrigued me that I had never tasted it. \n\nSo, I went there, took days to find a parking space (on the street, at meters).  (Park legally in this area or your car will be ticketed, towed and heavily fined and nearly impossible to get back.  Never had my car towed here but have heard the stories --true stories of others who have had the experience. \n\n\nRATING THEIR CHEESECAKE? \nI rate it a THREE (from one to ten, with ten being the best). \n\n(I think if I hadn't heard their unbelieveable reputation and word of mouth, I would have rated this a seven.  But I was expecting absolutely, great, tremendously, marvelous cheesecake but was served a \"pretty good\" cheesecake instead. \n\n\nThe cheesecake was definitely a huge disappointment to me.   They should clear out all those claims that Juniors has the best cheesecake.  \n\nJunior's has had a \"reputation\" (a good one) in our borough for many, many years. Though I had never been there until about 2 years ago, I guess I believed the reputation. \n\nFor more than twenty years, I've heard and read that Junior's has the best cheesecake around.  You can never believe what you hear but believe what you see and taste.  Believe what is before your very eyes.\n\nHere's how I rate cheesecakes in the United States of America: \n\n1.  Zins Diner (in Ephrata, Pennsylvania or near there). \n\n2. Linda's Cheesecake (usually sold in frozen department of any Pathmark. \n\n3.  Baby Watson  (sold in diners, candy stores and other places).  These are bigger than bite-size (like small cupcakes) and the taste and texture is great. \n\n4. Junior's Cheesecake.   So , why is Junior's number four and not number one?  This is for a few reasons, mainly these:\n\n5. Barnes and Nobles Cheesecake -- only the price was a disapointment   Taste is great but not many can afford it.  (Picture going in there with a family and many mouths to feed.  Cheesecake is out in that case. \n\n                     1.  Junior's reputation for its' cheesecake spoils the taste because you are going there just for the cheesecake and wow, what a let-down.  (Perhaps if the cake was cheaper, the letdown would be not so bad).  But for those prices and for that FABULOUS reputation, I expected so much more.  I expected to be WoW ed, expected to have my taste-buds tingled.  I expected to at least come away saying, \"WOW, now that was a cheesecake\".", "author": "Honest R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "I always liked this place even though the burgers are not that good anymore! They do have a big menu and the corned beef and pastrami are very good!  Great onion rings as well, The cheesecake is great definitely the best out of all these famous restaurants in NY", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "Went to Juniors twice whilst is NY. Being from London I was surprised at the amount of food you get but that was a good thing!\n\nOn both occasions I had something from the breakfast menu; one from the pancakes breakfast menu. The food was good, but a lot to eat in one go. \n\nIf you get coffee, you get free re-fills. \n\nThe interior of the restaurant was good, with pictures of Biggie and Puff Daddy and other notable New Yorkers. I was quite impressed, not a fan of cheesecake so I didnt bother with that.\n\nWould recommend.", "author": "Dru H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-16", "description": "Date Attended: 11/14/09, Saturday\n\nSo you're an out of towner like me and have seen the Making the Band episode where Diddy sends the contestants walking across the Brooklyn Bridge to get him some cheesecake and want to try it too.\n\nWell, I had the breakfast plus a strawberry shortcake cheesecake.  Ehh..  nothing real special to note here.  I had eggs and bacon.  There was a lot of fat on these bacons, I've had better.  The cheesecake was ok, pretty cheesy and sweet.  The best part I'd have to say was the waitress.  She was pretty courteous and nice.", "author": "Go K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "Read from Yelp that the cheesecakes from Junior's are superbly delicious. Went to Brooklyn to try it myself.\n\nOMG! It is great! I love the original and the chocolate cheesecake. I cannot wait to try other flavors. It is so good!!!", "author": "foodsleuth j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "For some reason, I really don't like eating here.  The place is nice looking and kept pretty clean.  Also the servers are super friendly.  However, I think their prices have become a little unreasonable for average tasting diner food.  Also the portions have been reduced over the past couple of years.  Their famous cheesecake does not taste any different than David's frozen cheesecake that you can buy in a supermarket.  If you want a cheesecake that is light \u0026 airy and has no preservatives, then go someplace else other than Junior's.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "This place is known for its cheesecake! No matter what anyone tells you if your in Brooklyn looking for good Cheesecake this is the place to be. You can either have it take out or dinning in or you can even get it shipped. I found out about this place while in Miami when a friend of mine shipped a Multi-flavored Cheesecake down to me for Christmas. It is so rich you can only eat a slice, I haven't found anyone able to eat more than one slice at one time. When I went to the restaurant to have a cheesecake to go, they have about 30 different flavors to choose from (depending on the time of year).  They also serve lunch and dinner so if your looking to just relax its a perfect place to. If they could ship by slice I would get a slice mailed to me each week!", "author": "Jessi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "Great food \u0026 great prices. It's always a nice experience. I would advise to avoid it on Sundays around the time church gets out. It's typically crowded. They have a lot of tables to keep up with the rush.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "I got 2 different kinds of cheesecake, which were ok but the high prices didn't make sense for the quality.  Overall this place is a tourist trap and I will never return.", "author": "William W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "A four star review of Junior's seems a bit absurd, really, considering that (\"world famous\" cheesecake aside) the chow here can be classified as average diner fare.  Yet the place is in most ways utterly wonderful, and, if you live within regular striking distance, can be downright addictive.  (This I know from experience.)  \n\nFor people-watching alone, there's likely no better ticket in all of Brooklyn, and the old-school surroundings and waitstaff (tired, sure, slow, maybe, but infallibly polite and beyond charming, undoubtedly) are a huge part of Junior's seemingly inestimable charm. There's a wonderful, hushed sense of borough ritual and history here: the awe-inspiring old-school red neon sign outside, the giant cases filled with overstuffed cakes and cheesecake (that you'll never leave room for) as you enter, the small plates of pickles, slaw and rolls that almost magically appear on your table shortly after you're seated.  (Don't dare be a killjoy and refuse them.)\n\nThe menu and portions are huge (side salad w/choice of dressing, side potato, side vegetable, etc.) and the food is predictably comforting, salty, sweet and artery clogging, and, truth be told, not terribly good.  \n\nBut I almost never notice, really.  Four bites into my fried shrimp entree, I'll wonder if I can ever eat another bite of food, ever again, and the thought of a gargantuan slice of Junior's (decadent yes, lovable, certainly, but not really world-class) cheesecake is downright terrifying. \n \nOf course I'll suck it up, for the sake of tradition, and the chance to come back again.  I heart you, Junior's.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "If you love cheesecake and have been to NYC, then you should already know the name. If not, you're slacking. It is simply the best I've ever had and I've tried a lot of cheesecake. Only one time did I try better but that was homemade by an old lady on my block where I grew up.\n\nEating in here is a must at least once. It's not the greatest food but I never expect that at a diner. I don't do it too often though because I like the place. One thing I heard from many Brooklynites is the more you go will take away from it's appeal.\n\nI recommend a shopping trip to the Fulton Street Mall and swing by to grab a slice of the silky goodness called cheesecake. Check my blog for a video tour of the Fulton Street Mall.", "author": "Gregory M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "I had a corned beef and pastrami combo that was quite good like sliders not huge for $17 but good and leaves room for overpriced new York cheesecake", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Went here only for the cheesecake and got it to go...so I can only comment on that.  I got the carrot cake cheesecake. Delicious!!!! I can see why diddy made the band walk to Brooklyn for it.", "author": "opqr s."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}