{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "A neighborhood institution! The cheesecake remains the draw but also great for brunch, lunch and dinner", "author": "Tracy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "Ehhhhhh... I'm not quite sure what the hype is about... restaurant is packed... food is ok and way too expensive.... but I guess for Times Square that's what you get. I'm a New Yorker and only go here because friends from out of town want to. Otherwise, not my first choice.", "author": "Kayla F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-14", "description": "I was in the neighborhood when I suddenly looked straight ahead and saw Junior's.\nFeeling nostalgic, I recalled that I was a little girl the last time I had eaten there with my family. Aside from the famous cheesecake, I also remembered how much I enjoyed the mini Danish that were always set on everyone's table. And so, I decided to have breakfast there.\nThe exterior and interior seemed virtually unchanged. However, the prices were definitely 2016!\nI looked at the breakfast prices and they were comparable to a trendy brunch spot---but wait, I thought--- isn't this a diner?!?!? \nI ordered the 2 eggs any style (over medium). That's it. Ten bucks.  To be fair, it came with a small juice, coffee/tea, and the choice of either grits, home fries, French fries or toast. However, should you desire meat as in bacon or ham to accompany your eggs,  expect the price to shoot up to about $15. Typically, 2 eggs any style with toast should not be more than $5.50.\nA few minutes later, the mini Danish arrived followed by my 2 eggs over medium with grits.\nIt was average at best. The eggs were tiny and the grits were bland.\nApart from the 5 star cheesecake (which can be purchased at many places), I don't really have a reason to frequent Junior's. And I'm rarely in the neighborhood.\nBut the walk down memory lane and remembering my youth \u0026 loved ones merits 5 stars.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "We catered holiday office dinner for 14.   When I walked in to pick up the order I had to talk to 2 different staff and they are just so rude beyond what you expect. As I wait for MANAGER I can't help notice how dirty place looked. ( that should have been warning signal )\n\nWe ordered un-carved turkey, stuffing , ..etc ( usual holiday dinner)\nTurkey is half done. (Bottom half is totally uncooked)\nStuffing is so dry( box stuffing is better then this)\nMix vegetable ( in the water with no seasoning )\n\nI have been here couple of years back and I thought it was  good but what happen to this place ??", "author": "K K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "The last time I wrote a review was back in 2012. It was my 30th birthday and I was in a dark place...ready to trade my two year old for a crack-cake. Fast forward to Spring Break 2016 and she's almost six. We're both addicts now. She's been to the one in Times Square and Grand Central, but I told her that we had to go back to Cheesecake Mecca. \n\nThey didn't disappoint. What can I say that I haven't already said? Same ingredients: sugar, cream cheese, crack. We argued over which cheesecake to get. I won because I have a job and keys to the car. We sat in complete silence and let our eyes gloss over. Then we left. \n\nThe sugar rush is real. Giving cheesecake to a five year old is like giving cocaine to a gremlin. She ran across the Brooklyn Bridge all the way to the WTC...then asked if we could get another slice from the one in Times Square. That's why I love her...codependent and enabling.", "author": "Ordale A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "About 3 of us visited after a night on the town in Manhattan.  We did not enjoy the meals (hamburgers \u0026 sandwiches) but we DID enjoy the cheesecakes!!", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "It's a fun environment, but the food is your basic American food that is completely overpriced. A lot of sandwich options. A lot of deserts (which I do want to go back and try. That is what they are known for I guess) Food was okay. Nothing special. They offer iced coffee and other drinks you wouldn't normally see on a menu. So, the variety on the menu is great. But to me, it didn't taste like anything spectacular. It was just okay. There seemed like there were some great servers, but ours took forever, he left us waiting for 20 minutes before taking our drink order. Then another 15 minutes for the drinks to come out. The server in the next section over was annoyed with him, as was I. But he was friendly enough.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Every time I come to juniors I have a good experience. The dining area is always clean, the staff is always friendly, and the food is decent. Breakfast, lunch, whatever it's all good. But the cheesecakes on the other hand. Every single bite I eat tastes like heaven on a fork. Sure it's a tourist trap, but is it like Times Square? Hell no. This place is not overcrowded nor is it overpriced in my opinion. \n\nIf you are a tourist just remember one thing, don't think about it. Go inside, and buy yourself that God damn cheesecake already. I know you wanna. More importantly, you know you wanna. So what're you waiting for?", "author": "Albie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "The strawberry shortcake cheesecake was on point! I can't wait to go back and their food at the diner next door to the bakery", "author": "Raymond L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Our hosts had recommended us to try the legendary cheesecake and so we came here for breakfast. The cheesecake was truly delicious, both the classic one and the one with raspberry swirls. The service was very friendly and attentive and we barely had to wait. For our German stomachs, one piece of cheesecake was enough for a whole day of sightseeing. We didn't get hungry for hours and so our next meal was dinner ;-)", "author": "Saskia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "Ok, it's a chain restaurant, but maybe there is a positive reason why they are so famous.\n\nTheir cheese cakes are REALLY good! loved it!\nThe service also is really top notch!", "author": "Max F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "I went to a Nets game and went to Junior's to grab one of my favorite sandwiches (twin sandwiches).  I had an all access ticket, which means you get almost unlimited food.  I ordered 2 twin sandwiches, 2 black and white cookies, a water and 2 animal crackers.  With each ticket swipe (you get 6) you can get a drink, a snack, a dessert, and a entrée.  I noticed that this women was swiping my card over and over again (like 3 or 4 times) and I said something.  She explained that she could only do what I had said above (limited amount for each swipe) and that she needed to swipe it that many times.  She could have swiped only twice, but swiped it 4 times.  I don't know if she was counting the animal crackers as a dessert or something.  I didn't want argue with her as there was a long line of people forming.  It was halftime.  She brought my over my food and there was only one twin sandwich.  I said that I ordered 2 and she agreed but said she forgot to put it on.  She said she would ring one up and asked my for my all access ticket again.  This would have been my 4th or 5th swipe used at the same location.  She could have done it in 2.  I wanted to try other places as this was a cool experience.  I went to another spot and ordered what I wanted with no issues or troubles.  I went to another spot and was told I was out of swipes.  This is crazy because I should have been able to get 6 entrees and now I am out of swipes having only tried 2 spots.  I give Juniors 2 stars.  The food is really good.  The black and white cookies are some of the best around period.  The employee was horrible.  When she admitted it was her fault for not remembering to add the sandwich to the swipe she should have given it to me without any issues.  You wanted to swipe again (5 of my 6- I felt like I was being bullied by her).  I feel like often these employees like to flex power over costumers.  This whole debacle definatly made my experince at Junior's and at the game in general was worse then it should have been.  I was excited to hit up one more game and all access ticket before the season ended but this was beat.  I hope that Juniors and Barclays trains their employees to be more competent (to do a proper job) and treat people better then they do (show some respect, have manners). I hope this improves.", "author": "Joshua B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Thank you Don (manager) and James (server) for a wonderful experience. We only came for cheesecake but we ended up splitting a BLT, (huge and delicious), but the principal of this show was the cheesecake. It was as great as ever. The big surprise was the coffee. I remember the drip coffee from back in the day and this didn't taste anything like that. This was amazing coffee. I asked Don about the coffee, and to my surprise he told me that Junior's served La Colombe coffee. What? Only the most amazing coffee in the world. Junior's may soon be known for their coffee as well as their cheesecake.", "author": "Justo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "We came twice!\n\nThe first day we came- we had a GREAT SERVER who ensured we sat in the window seats and gave us time to look over their extensive menu of food. He was patient and suggested many things that sound appetizing. I opted for a burger, cooked perfectly. My friends both enjoyed their meals, one having jerk chicken the other a BBQ chicken entree. The prices were comparable to other establishments in the area - not too overpriced. The drinks and food quality were awesome...the service was definitely the added cherry on top.\n\nThe second visit the next day was due to guilt - like who comes to Juniors and not have cheesecake?! We can in for a morning cocktail and ordered the red velvet, carrot and strawberry cheesecake all which were huge portions but also VERY good.\n\nThe historic business is classic in appearance on both the outside and the inside. You can tell the era it was built and how things haven't much changed.....I think its the charm. I would definitely recommend for a morning or early lunch.", "author": "Hsia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Best cheesecake in New York. \n\nThe restaurant itself is average - pretty basic diner fare and quality. But the cheesecake is phenomenal! They've truly mastered the art. The crust is buttery and flaky, while the filling is creamy, velvety, and just sweet enough. They have several cheesecake varieties, but personally, I prefer the classic plain cheesecake. Can't go wrong!", "author": "Jeannette N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-02", "description": "The customer service is horrible.  Besides the waitress making up her face when customers asking for some assistance, she told me that they don't put seasoning on the food when I asked her to.  She also told me I didn't need no seasoning.  She said another stupid comment, which made me get up and leave.  Junior's should hire the right people to represent them.  Smh ‍‍", "author": "Erica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": "Had a great chocolate malt. HUGE portions of food. Had the cheesesteak sandwich. It was way too greasy. The bread was soggy from the grease on the steak. Decent food, but make sure you are ready to share your entree. Too much food for 1 person.", "author": "Abel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "Okay.  So I give it a three but if you are a first time visitor to NYC, you have to go regardless.  Juniors is iconic.  The Juniors in Brooklyn is the original and the one you should go to but if you are pressed for time, there is a Juniors in Times Square and one in Grand Central.  But it's not quite the same thing.  \nThe cheesecake is good.  The desserts in general are good.  Lots of variety and the serving sizes are healthy.  (And by healthy, I mean large.  So I guess that would kind of not be healthy.  But life is short.)  \nThe desserts are a great value, especially for NYC prices.  The food though is mediocre.  I think they simply figure they can capitalize on their iconic cheesecake.  Have a quick sandwich if you must.  Otherwise grab your dessert and go.  Grab two.  Heck.  It's Brooklyn.  Grab three and fuhgeddaboutit.", "author": "Thad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "I've heard so many great things about Junior's cheesecakes and thankfully I live a few minutes away.\n\nI've tried the mini ones you can find at grocery stores, but I knew I had to try a legitimate slice.  The strawberry cheesecake was good but it wasn't amazing. The crust was similar to pie crust, which isn't what I was expecting. And the cake itself was way too dense. \n\nIf you're in the mood for cheesecake, I definitely recommend Junior's but I've tried better (surprisingly at typical NJ diners). \n\nI really like the atmosphere, nonetheless. I could definitely see myself eating here during my college years after a late-night study session or a night out with friends.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "One star is being generous. I was here last week w/ my family from out of town and the customer service was terrible. We were completely ignored by staff when we arrived and unable to figure out where the hell to sit until one of the hosts decided to begin working and tell us that we weren't allowed to seat ourselves. Thanks sir, but that direction would have been appreciated when we first came in.\n\nAnd the food was awful. We ordered burgers and fries, and the burgers were unseasoned, lacking flavor, and burnt. How do you mess up a basic burger? We didn't even wanna try the cheesecake they're supposedly famous for because everything else left such a bad taste in our moths (no pun intended. okay, maybe it was intended). Neverrrrr coming back here again!", "author": "Amber M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}