{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-24", "description": "2 stars for the actual cheesecake. Definitely pass on the cafeteria-style food. Came by for a work meeting and wanted to see what all the rave reviews were about. It's one name away from diner food. The service was terrible and they stack plates on top of each other when bringing the food. They put a plate of meat on top of my salad and I'm vegetarian. Needless to say I didn't touch my soggy salad. The pea soup was so thick and cold it could have easily come out of a freezer bag. \n\nJust come for dessert because the food will be a huge disappointment unless diner food is your kind of thing.", "author": "Lyndenise B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-01", "description": "My group walked in hungry for actual food so we decided to give the infamous Junior's a try as an \"American diner\" according to Yelp. There was a small line of people waiting outside by the cheesecake display but only a few tables filled for dining. The host greeted us, led us through a maze-like interior (poor choice of design and decor) and sat us down to our booth right next to another party who was celebrating a birthday. It was after 8pm on a Thursday night and of all the numerous tables you had available, you just HAD to sit us down right next to the loud group all the way in the back? \n\nService here was unlike any other I've ever experienced. The waiter looked annoyed when we had to flag him down twice to take our orders and when he did finally walk over, he gave no intro or recommendations, not even a smile. What was more surprising to me was that when my friend started to tell him of our lengthy list of food, he did not reach into for his pen and pad. Yup, he just stood there and nodded as my friend continued while the rest of us wondered who was brave enough to ask this man if he had super memory skills. Unfortunately, none of us spoke up so we made a bet on whether or not if our orders would get messed up.\n\nBefore our order came out, we were given generous amounts of pickles and bread. Be careful not to fill yourselves up on bread though. The cornbread was very dry and rolls were slightly warm. It didn't take long before our massive plates of food came--and I mean MASSIVE. Way bigger than we expected. My friend's pasta dish was heaping with linguini and giant chicken parm while my other friend's burger was a huge steak between a small bun hidden under the thick onion rings and fries. My Chicken-on-a-Bun wasn't even on a bun...it was an enormous grilled chicken steak sandwiched between two thick slices of toasted buttery baguette. As for the bet, our order was indeed messed up. He forgot our side dishes of baked potato and mac n cheese (something I was reallyyyyy looking forward to from an American diner) and switched my sweet potato fries with my friend's regular steak-cut fries. \n\nUnfortunately for me it's always about quality over quantity. The flavors was missing. Everything was bland. My grilled chicken was not seasoned at all; friend took one bite from the chicken parm dish and said the sauce was blah and reached for the ketchup bottle and S\u0026P shakers available on our table. When we called for a check my friend waved for the same waiter who was too cool for a pen and pad. He was literally standing a few feet behind us but his eyes was glued to the sports game on the TV. Well sir, there goes your chance of a nice tip. Highly disappointing considering it was quite expensive. Next time I will ONLY come here for their namesake--cheesecakes.", "author": "Cece H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Don't be afraid of the tourists. Juniors is definitely worth an occasional visit for a warming, comforting, filling slice of Brooklyn. Brunch, lunch and dinner are all good. Try to it in the window seats.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "I absolutely LOVE Junior's!!!  It's the only place to go if you want quality cheesecake!  \n\nThis is my favorite location.  Conveniently located in Downtown Brooklyn in the middle of everything.  The B38 stops right in front of the place.  Let's face it, you don't go to Junior's for the food.  You go there for the scrumptious desserts!!  I've came here for several sit down meals.  It wasn't awful, but nothing was fabulous either.  For the prices you're paying, you'd expect more.  Besides the cheesecake, the best thing here is the spread they bring you out before your meal!  Best cucumber and beet salads I've ever had!  I like that they bring you rolls AND cornbread.  Hot and yum.  The cole slaw is interesting.  No dressing and it had strips of pepper in it.  Pretty good.  \n\nI had the lunch special for $14.95 I believe.  You could choose from soup and a salad, salad and a 1/2 sandwich and soup and a 1/2 sandwich.  I chose the 1/2 chicken salad sandwich and  Cesar salad.  The sandwich came out on a tiny roll.  The chicken salad was pretty good.  Had a good taste to it.  Definitely had some celery salt in it.  The salad was very boring and bland.  All it was was a bowl of slightly brown Romaine lettuce and croutons with Cesar dressing.  \n\nThe service was lacking as well.  Maybe it was because it was our waitresses first day?  I wish her luck and hope she improves!  The restaurant was fairly empty so why the hostess sat us all the way in the  back was puzzling.  We got our food pretty fast.  When our waitress came out and said, \"I forgot to ask you if you wanted Cesar dressing on your Cesar salad?\", I was taken aback.  No, I want FRENCH dressing on my Cesar salad!  Ugh!  She also didn't ask if we wanted dessert!  I would think that's a big no no at a place as Junior's!  We just got dessert to go.  Sad to say, I've tried many of the different cheesecakes over the years here.  Each and every one are totally amazing.  My new favorite being the Red Velvet Cheesecake.  It's very heavy and rich so one slice for $7.95 should last you a while.  Take small bites and savor the delectable goodness known as Junior's!!!! Great cocoa taste and a lovely frosting.  The Chocolate Mousse one is another favorite.  A better option if you want cheesecake but don't feel like being weighed down.  As well as the Strawberry Shortcake Cheesecake.  \n\nI definitely will be back to Junior's.  No questions asked.  Maybe not to sit down and eat though.  Just to stop by and have a delicious slice of heaven!", "author": "Marie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I'm so glad that we live nearby to Juniors. Junior's is a Brooklyn institution and a delicious institution at that! We had dinner last night and per usual, it didn't disappoint. I love their beets, pickles and Cole slaw. Our server was very friendly, kind and helpful. My split pea soup was delicious. The crab cake was yummy. My husband's Cobb salad was enough for five people. The pumpkin cheese cake was literally perfection! Their cheesecake is always wonderful but the pumpkin, wow!", "author": "Amy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "not one of my favorite Diners, I'm always complaining every time I go here to eat. The cheesecake though is delish, red velvet is my fave", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Perfect diner experience -- easy, delicious, and friendly.  Having only been to the Grand Central outpost, a friend and I walked over from the hotel we were staying at in Fort Greene.  That was a wonderful decision.  We were seated quickly and greeted by a friendly and attentive waitress.  I loved staring out from my comfy vinyl booth seat onto signed pictures hanging on the wall of Mary Tyler Moore and Tony Danza.  \n\nI ordered the challah grilled cheese with a side of fries and bacon.  Mmmm.  Seriously perfect diner grilled cheese!  My friend ordered challah french toast which came with a delicious assortment of danish and sweet breads.  Again, perfect diner french toast and pastries.  The price tag was a little higher than it would be in say Colorado, but, as NYC food goes, it was on the cheap.  \n\nOn our way out, we both grabbed some cheesecake to go and rainbow cookies.  Life was very good later that day when we tried that!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Review for Cheesecake Only:\n\nPROS:\n\n- Strawberry Cheesecake [3 STARS] $7.50 a slice + tax = $8.17. This one is not as good because the strawberries are drenched in strawberry puree sauce and tons of sugar like the ones you would find on Costco cakes.\n\n- Apple Pie Cheesecake [4 STARS] - My favorite one so far. Creamy delicious cheesecake.\n\nCONS:\n- Kind of expensive for a slice of cheesecake.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "First time at the original location. Saltiest matzo ball soup I ever had. First it arrived cold and the second time salty with over cooked matzo balls. I'll stick with the Times Square location. This place is like a sad memory of what once was.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Ok, so I wanted to come here because Puffy made Da Band walk 12 miles to get him a cheesecake and I just had to see for myself if it was just that good!!! I walked the Brooklyn Bridge over from Manhattan and. Although it wasn't 12 miles I will say that Juniors' cheesecake was totally and completely worth the walk!!! \n\nSo...the Devil's Food was the most amazing cheesecake I've ever had...no lie...not exaggerating...it is incredible!!! OMG!!! It is a mixture of cake and cheesecake and it is just incredible! I did not want it to end.  Also tasted a bite of the red velvet cheesecake and meh...that was alright but not nearly as good as the Devil's Food! I would have it shipped it is so good!!!", "author": "Princess P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "The to-go cheesecake counter is dangerous. I've never had any of the other food but the cheesecake is all you need to know. The Apple is crazy tasty.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-21", "description": "This diner is the so called mainstay and self acclaimed defacto representative of Brooklyn. It is kind of a mix bag diner. The vast bland interior of tables and banquettes accommodates all types of seating.  \n\nThe service is friendly and usually prompt. I've been here a couple times for dinner and brunch. Let's start with dinner. Sticking to the obvious choices of burger and half roast chicken. The burger was fine with the usual side of fries, lettuce, slice tomato and onion. The chicken was roast chicken with a side of salad, beets and mashed potatoes. We decide to share a slice of the lemon coconut cake. I'd have to say this was probably the most favored part of the meal.\n\nIt was a rainy Sunday and we didn't feel like venturing far so Junior's was close by decided to give it a try. The Sunday brunch was in full force upon our arrival. The restaurant was packed full of Sunday church goers all hungry after service. The same usual service. Friendly prompt waitress took our order of a Western Omelet and Eggs Benedict. The table came with bread basket of sweets and buns. The eggs were dry over cooked and not very good. \n\nThe Eggs Benedict a main staple of brunch was a travesty. The congealed Hollandaise sauce looked disgusting and tasted so. The poached egged cooked in way to vinegary water was fowl. The dish on the whole was inedible. This was my own doing for ordering this. Thankfully, I had the grits and bread basket.\n\nI'll have to say Junior's is mix bag. Stick to the basics and you should be fine but if you want something more I would suggest the other great restaurants in Brooklyn. As to their 'famous' desserts. I prefer the cakes and just plain cheesecake and tend to stay away from the congeal mess of coagulation fruit topping etc.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "I had the best experience tonight at Juniors Restaurant. Food was delicious as usual and we had the sweetest waitress, Stephanie Joseph. She was personable, friendly and attentive. Five stars all around for service, kindness and professionalism!", "author": "Georgia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "Really disappointing. Service was gruff.  Service was slow.  Waitress forget soup and did not seem to care.  Seafood was incredibly dry and seemed old.  The restaurant in Boca Raton Florida is excellent so expected much more at the original restaurant.  Place was dirty too. Never to return.  I even tried breakfast there to see if better. It was not.", "author": "Peter Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Came for the pastrami. Stayed for the cheesecake. Stick with the original. Strawberry is ok if you like fresh fruit encased in a gelatin coating. Its all good. \nLoved the deli sandwiches coupled with pickles cole slaw and beets as a side. The waiters are fast and very courteous. Went back twice and looked for same guy who seem glad to see us. The late hours are perfect for after Barclay Center dining. Its da bomb in Brooklyn if your looking for good diner style menus and good size portions.", "author": "Dan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "A local suggested Junior's as we exited the subway.  You get a lot of food but I loved the pickled beets that was one of the starters along with cornbread, sourdough rolls, coleslaw, and dill pickles.  Ask for the phenomenal waitress from Jersey City, Stephanie, she made the experience fun and amazing.  We loved her!", "author": "Brian I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "My first time here. I must must say it was a great choice! Our overall experience was very nice,the waiter was very active at our table. Place was clean and well lit. Will def go here again.", "author": "Jodi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "We hosted a breakfast at Juniors in Brooklyn for almost 50 people - many from out-of-town.  Everyone ordered from the menu as they arrived and food was served promptly.  Our waiters were very attentive - filling coffee cups and making sure everyone had what they needed.  We had a big cheesecake for the group that we cut into small breakfast-sized pieces.  The food was great and the cheesecake was even better than I remembered it - if that's even possible.  The catering department was very helpful in getting this set up and the price was very reasonable.  It is a New York landmark and the perfect place to host a group of New Yorkers and out-of-towners.  I can't wait until I'm in Brooklyn again so I can get back there.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "This place is adorable. Great vintage vibe with your standard diner fare. HUGE portions. Service is a tad slow, but that just lets you soak up all the fun vintage details of the decor. The pastry case is filled to the brim with super tasty looking cakes and pies. Glad we stopped here for breakfast!", "author": "Lindsey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Came here for lunch with a coworker. Really good lunch, had a burger and fries. He had the same, we really enjoyed. Cheesecake was actually really great, good service. We were on our lunch break and we came out within the hour, for a weekday in downtown Brooklyn during the lunch hour I thought that was pretty amazing. Will be returning and referring friends!", "author": "Iris P."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}