{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Great food.  Eat the cornbread, it comes with your meal.  This place is a bit overpriced, but blame yourself if you have leftovers.  It's very easy to order too much.  The portions are plentiful.  Order anything, it's all good.", "author": "Viv A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Went for late night drinks and eats. Pretty good service. Not too crowded. Drinks were strong and generous portions. Ordered a ginger barbeque ribs/shrimp/wings appetizer off the specials menu. The best sauce I've ever had. So delicious. Will come back just for that. Also got fried catfish tenders. So so.", "author": "AJ T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "My review is based on the cheesecake. Since I'm a cheesecake lover it only made sense that I try the legendary Junior's. So I purchased several of their varieties for myself and family members. We all agreed that Junior's famous cheesecake was a huge dissapointment and extremely overrated.", "author": "n b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Hands down the best diner food I had in years! Went for lunch and \"Something Different\" lunch special was delicious! Did not expect to get that much food. Well worth it.", "author": "Luis D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "Junior's. Its a restaurant famous for their cheesecake. Their cheesecake is considered one of the best. So of course I dropped by to give it a taste. The portions is big and very creamy. The waitress has the brooklyn charm and the place itself has a cozy feel. The guy next to me order green pea soup and a piece of cornbread, sounds like a true American order to me and thats what Junior's is about.", "author": "Toyo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "The Junior's in Brooklyn has the best french toast. They don't make it the same at the one in Manhattan, so don't waste your time dealing with Times Square. I wish I knew what their secret was. I think they caramelize the sugar, but maybe I don't need to know the secret. This way I will keep going back for more! \n\nI also love the fact that they give you little pastry appetizers for breakfast. \n\nThis is also the best place to go for cheesecake in Brooklyn, and it's a fun to place to take out-of-towners to have a real Brooklyn Pastrami sandwich too.", "author": "Jenifer H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-29", "description": "As a resident of NYC and a proud Brooklynite one question often asked by visitors is \"have you been to Juniors and how is it\". My reply is always \"go for the cheesecake.\" As a preteen, I loved Juniors but with age come wisdom and reason so has my gustatory judgement and appreciation. You can go to the newer locations but if possible, please come to the original in Brooklyn. Go and enjoy the cheesecake, take pictures so you to can say \"I've been there, and the cheesecake is good.\" Because it is good! It's Juniors Cheesecake!! But do yourself a favor and don't entertain the idea of dinner. No!No! No! I recently took visiting family members to Juniors for CHEESECAKE, but one of the elders really wanted to eat there and to appease her we ate. Despite my judgment and memories of how awful the food was I relented and ordered a safe meat and potatoes dish. My taste buds slapped me so hard, all my saliva instantly went to drought mode, screaming 'what did we every do to deserve this punishment?' I will say that 3 out of six enjoyed their food. I understand I can be critical so the average  person may enjoy it but keep your expectations low on the food and high on the cheesecake. I love what Juniors represents to my Brooklyn and as many times as I've see the red and white lights and awning I'm always happy to see it when I return from an extended stay away from NYC.", "author": "Aionga Sonya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "This review is on the cheesecake only. We did not have an entire meal there, matter of fact we meant to go in and get a plain old regular cheesecake for home. After making our way through the dining room to the take-out area, we saw flyers posted for their special red velvet cheesecake. So we decided instead to get that. We look into the case and see a beautiful cheesecake with red swirled fruit that we are told is raspberry. So we change again and got a large raspberry cheesecake and a slice of the red velvet cheesecake. \n\nIt was fabulous and didn't last 24 hours in our house for our family of 4. We've had Eileen's cheesecake (another notable NY classic) but prefer the sponge cake crust and creamy goodness of Junior's.\n\nService was quick and no-nonsense. We'll return!", "author": "Suzee Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Definitely worth a visit. 4 stars for the cheesecake and service. The other items are sub par and would def skip next time around.", "author": "Lynee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "Food is good, service is good. Great traditional diner with amazing desserts..", "author": "Jake B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-17", "description": "Junior's holds the title for the best cheesecake in the world.  My favorite is the strawberry cream cheese pie.  It's so delicious, scrumptious and creamy that I have friends in other states begging for it whenever I visit New York.   Every year my family rings in the New Year together with Junior's Cheesecake.  \n\nMore than just cheesecake, Junior's is a full service bakery and restaurant with all types of other pies and cakes.  At the restaurant I enjoy burgers, fries, eggs, pancakes and other basic all American foods.  Junior's has become so popular that they've expanded to a few locations in Manhattan.  To ooooohhhh and aaaahhhh go to www.juniorscheesecake.com.", "author": "Erin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-03", "description": "I went there to celebrate a special occassion with my daughter. I've been going there for years. The decor of the restaurant hasn't changed.  It reminds me of the 70's style furniture etc. I dont have a problem with that. It is their unique trade mark.  The staff were friendly with neat apperance.  I always order the usual that I often enjoy.  The food usually taste very good.  However, today the waitress messed up my simple order 3 times. And by time she got it right and finally completed the order the rest of my food was half way eaten and a bit cold.  The food taste decent but not as good as previously.  Perhaps they are under new management, new supervision, tired, or simply were having an \"off\" night or the staff is new and still in training.  I must admit I was a bit disappointed especially because we were there to celebrate a signifigant and special event.  I am a very patient and understanding person.  But I waited around 45 mintutes for them to get a very simple order correct.  Also the dinning area was a bit chilly.  There were a couple of people sitting across from us eating with their winter coats on.  I am usually a very very generious tipper but today SMH all I can say is the waitress is lucky to get anything.  I know people who would have tipped $0.  The waitress was plesant but horrible at her job. She tried to correct her mistake 3 times. So I did leave her something.  As I mentioned earlier the food taste decent/edible.  However, when we got home my daughter cried in tummy pain nonstop for hours.  She made plenty of poo. I rub her back and tummy til 1:15 am. (Hours later). She seem to be feeling better.  So, for all the reasons I listed above is why I rated this 1 1/2 star which is an extreemly generous rating for our experience today at juniors.  I hope they read this and make necessairy much needed improvements.  I doubt I will return there.  There are so many delicious restaurants in the area to choose from.  No one deserve to be fired or anything but definitely training and proper supervision is needed.", "author": "Bless M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-16", "description": "I'm surprised that this place has good reviews.  Maybe it's just the difference in expectations between Seattle and NYC?  It was near our hotel in Brooklyn and recommended by them.  My hubby and I ordered that roast beef sandwich.  The beef was piled high and that's where the goodness ends.  The sandwich didn't have anything on it besides the meat and the meat was very dry.  The bread was supposed to be wheat but seemed like brown Wonder Bread.  We assumed it would come with fries or coleslaw or something on the side, but since it wasn't listed on the description I guess we should not have assumed.  They did bring us a bowl of pickles.  yippee.  For the price I expected more.  Glad we split the sandwich.\n\nMy daughter had the chicken tender app.  There were a lot of them with a tiny little bowl of sauce.  Greasy and dry.  Need  I say more?\n\nAnd finally, since they are famous for cheesecake, we ordered the strawberry shortcake cheesecake.  It tasted old and the strawberry filling tasted canned.  Honestly, Sara Lee is better and cheaper.  Overall, we spent about $40 for an app, sandwich, 1 drink and 1 cheesecake and tax/tip.\n\nWe tried it for breakfast the next day, anyway.  Our bad.  Over cooked omelets that came with that same tasteless \"wheat\" bread toast.  Nothing else came with that--no potatoes, no fruit garnish, nada.\n\nInstead of breakfast, I had a BLT.  Lots of bacon, cold white toast, just a tiny bit of lettuce and tomato.  Again, no fries or chips or fruit garnish of any kind.  Which I think is weird given the price and the fact that it's a sit down restaurant.\n\nI'm also a little confused by other reviews that say breakfast includes juice, pastry and home fries.  That wasn't true at the Brooklyn location.  (We got rolls and cornbread) I wonder why?\n\nAs for service, it was good the first time, but the waiter was a hard to understand.  The second day, the hostess tried to seat us right in front of the bussing station even though there were plenty of empty tables near the window.  She seemed surprised when I asked for a different table.  Our waiter was friendly, but not very good.  He seemed a little surprised when I asked a couple of questions related to food allergies, had to come back to ask my husband what type of toast he wanted and then assumed my daughter wanted the same type.   He brought a drink that my daughter didn't order.  When the food came out they gave my husband's omelet to my daughter and vice versa.  They were similar omelets and it took a few bites before they realized it.  Good thing my daughter wasn't allergic to anything in my husband's omelet.\n\nIf I wasn't going to steer clear of here because of the food, I'd stay away because I don't trust that they could be trusted to accommodate people with food allergies.", "author": "Six S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "We came here primarily for the cheesecake because we heard a lot of hype about it.. but I have to say the food was very bland and average at most. The cheesecake was okay but not worthy of a return trip.", "author": "Katelynn And Sam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "What's not to love? A classic! Great corned beef, fried chicken, steak burgers and don't forget the cheesecake.  The real hidden gem is the lemon meringue pie! It's always great to go to the original store.", "author": "Vinny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-27", "description": "This place is delicious and their red velvet cheesecake is amazing. This is a definite must do for anybody in the area. The service could be better but the cake makes up for it.", "author": "Kenny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Yes, the Cheesecake is excellent, but so is the matzo ball soup, cornbread and the staff.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Great food thats affordable, good service and cheesecake to die for!\n\nMix the old 50's / 60's vibe and its one of the best restaurants I have eaten at.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "Had lunch at Junior's while visiting our son in Brooklyn.  The decor is great..40s and 50s style.  We had a nice table in one of the curved window alcoves.  I had the lunch special with corned beef and a Caesar salad.  It was tasty, but a $13 lunch special is pricey for this Midwestern native.  I waited in line to get cheesecake to take out; ordered strawberry and raspberry swirl and got strawberry and cherry.  Good thing my son likes cherry.  It was only okay; my brother in law actually makes a better one; but it was an enjoyable visit to a NY landmark!", "author": "Jan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "Cannot be more disappointed with Juniors. My issue is with their online orders.I am sure the food/cakes are great. They got my order date wrong (a month late) and even though they emailed me showing the correction, they never informed their delivery team. No email. No call. Not to mention that you have to go through a circus of menus to get to a person. C'mon, Junior's. Are you kidding me? \n\nThis is not about the food or restaurant, but to say that they are NOT equipped to handle online orders or gifts to be sent.", "author": "Yanks N."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}