{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "Juniors is raved for their delicious cheesecakes. A slice is a little bit on the pricy side but since I went to high school around there I decided to give it a try.\n\nThe cheesecake was a bit on the dense side. It was rich and good but not for me. I took 3 bites and I lazied out on the couch.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-28", "description": "I always look forward to coming here. This place is a gem! Have a sandwich and a slice of cheesecake and you will not be disappointed,", "author": "Eddie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-31", "description": "Aside from being famously featured in MTV's Making the Band, I have heard plenty of praise on how good the cheesecake is here. After all, New York is known for its cheesecake so I had to try it among all the other famous NY foods I tried on this visit. Except I took the subway to get here, I didn't walk! haha\n\nUpon entering, the diner like atmosphere reminded me of similar diners we have in California. (Mel's or Ruby's anyone?) The first thing you notice is the large display cases of cheesecakes and other desserts, however I opted for the take out counter which conveniently had assorted slices of cheesecake and a quick order menu for other food options. I only ordered the plain cheesecake to keep it original for about $5. \n\nThe cheesecake was really good, sweet but not too rich and had a good homemade taste to it. However, I'd like to come back and try their regular food items and different flavored cheesecakes to get an all around feel. Although some of my friends that did order food say it was super good. But based on this visit alone it definitely deserves 5 stars. If you visit don't walk, even if Diddy asks you to!", "author": "Derek A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "Shame on Junior's.  The prices they charge and they use margarine instead of butter.  I saw a documentary on TV and Juniors seemed proud they used margarine.  Margarine is one molecule away from plastic.  Went here when I was single 50 years ago.  That was in the Oleo margarine days and only the poor ate margarine.", "author": "James T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Great service, food was above par and quick. The baked goods are awesome and the bang for your buck is tremendous. Great place will go back again and again.", "author": "Derek M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "I bought a strawberry cheesecake for my friend's birthday and I personally thought it was too fluffy. Everyone else loved it, but I wasn't so fond of it.", "author": "Canny F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "The cheesecake is delicious.  The retro interior is cool.  The pastrami and corned beef reuben was pretty good. The goulash was pretty good.  The service is really, really bad.  It always has been, at least since I first visited in 1983.  And with the prices they charge, the place should be cleaner.   Just have the cheesecake.", "author": "c l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Forget the cheesecake, which is delicious, how about their breakfasts?  Reasonably priced entrees come with a nice pastry platter, coffee AND juice.  It's a great place for large groups and they're always extremely friendly.  If you can't make up your mind, or are with a group that includes children, definitely check this place out for breakfast!", "author": "Timothy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "This is my favorite restaurant hands down. The cheesecake is spectacular and highly underrated in my opinion. I live in Phoenix and I've ordered it multiple times and let me tell you it's worth it!", "author": "Bonnie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "Finally made it the original Juniors and was not expecting the flashing lights and relatively new decor (I guess I was expecting it to be old school.)  Anyway we picked up a raspberry cheesecake and it tastes like cream cheese heaven.  Fluffy, airy, yummy...", "author": "Neelam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "who doesn't love Junior's? Sure, the décor could use some updating but ...every time I return I have nostalgic memories of my childhood visits. Cheesecake is still the best!  and they always serve a huge portion. The service is always friendly. And I always get a kick out of stars like Spike Lee staring at me while I use the bathroom. Junior's is a Brooklyn mainstay. You have to stop in! It's part of the Brooklyn experience.", "author": "Bella P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "Cheesecake is excellent. Slightly tart, perfect consistency. We ordered the plain. Was good enough that we brought some home to share. Diner is enormous! Parking is horrendous of course but possible with some metered spots. Located near Deklab.", "author": "Denise J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "Still going strong after all these years, Junior's menu is traditional and adaptable. It's been grounded in Jewish deli yet has evolved to include items such as real fried catfish, not just a reasonable facsimile. The waitstaff are very friendly and professional. From the complimentary pickles, beets \u0026 cornbread all the way through to the iconic cheesecake, a meal at Junior's is a pleasure.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-08", "description": "I have not eaten a meal here, I came for the cheesecake and I was not disappointed.  I had the carrot cake cheesecake (carrot cake on the ends, cheesecake in the middle) and I was in LOVE!  It was moist and flavorful.  I need to find out how I can some of that shipped to Miami...", "author": "Kendra L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-31", "description": "Filthy diner with low-grade quality but tasty American cheesecake.\n\nCompared to Italian cheesecake, this just doesn't compare.", "author": "Adrian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "the service was 5 star impeccable! although I wish the food choices were more up my alley and considered taking a star off for that but I realize they have what they say they have and I cant take points off for that. they aren't pretending to be anything they are not! The classic (if basic) affordable american food they have is great, and the service was just amazing like being at a much more expensive restaurant.", "author": "B S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "I did not eat here, but my girlfriend and her friend did - and then brought me home something - I will relay their experience and my own.\n\nTypical diner fare - burgers, sandwiches, breakfast items, etc. Portions are quite large. It was described to me that as dishes came out, unsuspecting women had saucer eyes as foods approached the table. They also had drinks - an apple martini that was pretty much a martini with apple scent, and a tequila sunrise, which was orange flavored tequila. At least you get your money's worth.\n\nThey brought me home a Reuben with corned beef and pastrami. Very delicious, even cold. The meat is piled high in the classic deli style, so you need to squeeze the sandwich down to take a bite. Also - I was under the impression that Reuben's were traditionally made with russian dressing - why the hell do I always have to specify to put that on? Make those lame-asses who don't want deliciousness ask to omit it. \n\nI had to sub in some mustard, which is good, but not the same. I would eat their food again.", "author": "Giac K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "This popular upscale landmark diner attracts mixed crowd Of gangsters, thugs, tourists \u0026 large groups of church bonnet wearing religious groups. Their cheesecake is SOOooo Overrated. Unlike Cheesecake factory which has a creamy, french style cheesecake; Juniors NY style is kinda dry \u0026 dense although, some prefer that texture. Everything else is tasty \u0026 they have a HUGE selection of food on their menu. I NEVER get their cheesecake but the other food is worth the experience. Their bread \u0026 relish tray is great also.", "author": "Angel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "**Disclaimer: I don't like cheesecake so this review is not about their worlds famous cheesecake, it's about their restaurant.**\n\nJunior's the restaurant is just your average American cuisine restaurant. A staple in downtown Brooklyn, it could get pretty crowded at times. All in all if your looking for a bite and in the area, this place has something to please everyone. \n\nThe quality of the food isn't up to par with the top restaurants by no means. It's just your average restaurant, with average cooks, who serve average food. But I will say the decor of the restaurant is very good. It has a classic '50's feel with a modern twist", "author": "Christine R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-12", "description": "Wife \u0026 I went to junior's for the first time in a couple of years. The place is done, finished \u0026 over. It is nothing like we remembered, we were very disappointed with the food, maybe the cheesecake is still OK. they say you can never go back, well, we won't.", "author": "Ravanna K."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}