{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "Another NY institution that has lost it's luster. Once the best cheesecake in the city is now barely above average. Sometimes fame is not a good thing.", "author": "Ron E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Best cheesecake in the world in my opinion..I've been coming here since I was a child..my fav is the strawberry cheesecake..velvety, dense and rich...love it..", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "I had to eat here after i saw this place on MTV with Puffy daddy and the Making of the band.. and how they dropped the cheese cake on the floor.\n\nwell its better than i thought. i had the chicken fired steak and finished it off with a cheese cake Mmmmmmmmmmmmmmmmmmmm\n\nfood was GREAT!!! 5/5\n\nit was worth the trip 2800 miles nothing like this place in Cali", "author": "Kirk D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Get the Strawberry Cheesecake. Fast and friendly service. It makes the best Birthday cake at all times.", "author": "Missy J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-25", "description": "Earlier this evening I craved a piece of their \"world famous\" cheesecake.  I trekked in the snow, and on the train to get a slice at their Brooklyn Location.   Once I reached home I dug into my cheesecake.  Less than halfway through, I found what appeared to be a thick strand of hair baked right into the cheesecake!  I was repulsed and immediately discarded the remaining cheesecake.  I was extremely disgusted and disappointed.  At $6.25 a pop, I expect my cheesecake to be edible.  It is safe to say that I will not be returning to this specific location, and I'll have to think long and hard before visiting another.  Unfortunately, I do not live close to the restaurant, otherwise I would've returned to address the issue immediately.", "author": "Yesenia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-27", "description": "I can't even comment on the food because the service was so atrocious.\n\nThe waiter completely ignored us the entire time. Not once did he come up to our table on his own to take our order or even to bring us our food! We actually had to ask if our food was ready to finally receive it. \n\nThen, after I put down my credit card to pay, he disappeared with it for over twenty minutes! I had to walk around the restaurant and track him down to get my card back. He didn't even apologize, just made an annoyed face and went searching for my card, which he'd just left haphazardly next to the register!\n\nI still can't believe this happened. I've wanted to go to Junior's for years and now I just look back on my one visit with a terrible feeling. I feel even worse knowing that I subjected my family to this waiter's behavior as well because I made them go to Junior's with me, promising they'd love it and have a great time.", "author": "Darcy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "Still the best cheesecake on the planet...and it's in BROOKLYN! Never had a meal there though...and I'm from Brooklyn, odd but true.", "author": "Charles N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "as someone who stays away from refined sugar, the german chocolate cake was too rich and too sweet for me. perhaps i should have tried one of their cheesecakes. the \"chicken salad\" salad was huge and very flavorful. it didn't even need dressing. complimentary pickles and coleslaw are always a plus.", "author": "S W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "A classic diner. Food is relatively cheap by NYC prices and the girl working the bar is friendly and clearly knows the local regulars. Food is pretty standard diner fare.", "author": "Chuck W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "this place has amazing cheesecake but they also know how to make one hell of an order of french toast! \n\nthis used to be my go to spot on sunday mornings to get french toast and read the paper...\n\nits amazing and a brooklyn classic, anyone who hasnt gone there should go and anything you order im sure you will love!!!", "author": "Lydia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-29", "description": "I went there just to have a slice of cheesecake.  It was worth it.\n\nThat first bite was the most delicious bite of cheesecake I've had in a long time.  I struggled to finish it, but was determined to do so.  Junior's deserves the hype.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "Sure, after watching DIddy's orginal Making the Band, and seeing them travel across NYC to get Diddy some of this cheesecake, I had to try it out.\n\nAmazing cheesecake?  Yah, pretty much.\n\nBut the thing that stays with me the most is how gross the actual food was.  Myself and a group of friends hit up this place, and we were absolutely disgusted by burgers \u0026 fries that we got here.\n\nI guess we shoulda just stuck to the program/plan!!\n\nCheesecake was worth it though.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-10", "description": "I've been to Junior's 3 or so times and I've really wanted to be happy every time I left but I'm still waiting to be happy. Sorry to burst everyone's bubble but people giving it 5 stars clearly enjoy going to lose their money - it reminds me of casinos....You go in with high hopes, have a little success hoping for it to climax with a great ending (the cheesecake) and you end up leaving having lost a lot of money and no happy ending (though you could possibly get one from a woman of the night in the surrounding area). They have OK ribs and their water is cold (sometimes). Coleslaw is average, bread is average, cheesecake (drumroll please) is heavy and really not that good. I think the only people hyping their cheesecake are one of 4 people:\n1) the owners\n2) old people who lost their taste buds about 40 years ago\n3) tourists from Iowa who like anything that is \"New York-style\"\n4) hipsters who like anything with some sort of retro-chic to it\n\nStay away and get better food from a food cart you can probably find within a 1 or 2 block radius - or spend less money and go to the McDonald's around the corner - at least you'll get what you would expect.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "The breakfast was sooooo good. The portions were huge, everything tasted fresh, and everything was cooked just enough. I loved the little danish and hot rolls they give at the beginning, they were sooooo good. It wasn't busy when I went at 11 am on a Sunday, which is strange, so it makes me wonder if I missed something. Loved it. I'll come back very soon.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-03", "description": "I'll get right to the point......a 2 for the food, but a 5 for the cheesecake!!!!! Itt's delicious!!!! If you do eat here, get something safe, like a steakburger, or you'll be sorry!!!  Junior's has FAR too many things on its menu for any of them to be GOOD!\n\nBut the cheesecake...... it's a SURE THING!!!!  Delicious every time! \n\nP.S-  Avoid the egg cream at all costs, and choose the Brooklyn location over the touristy Times Square one!!", "author": "Robyn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "The best cheesecake ever. It does not compare to no other.  \n\nWent a while back and boy it is so worth it.", "author": "Brenda V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-04", "description": "I FINALLY made it to the infamous Junior's! After years and years and years and years and yeeeeaaarrss of hearing about this place I made it and all I have to say is it's just okay. \n\nNow I'm a sweet tooth junkie if there is anything I love it's definitely sweets! When I first walked it I was in heaven but after one bite I was quickly brought back down to earth. I had the carrot cake cheesecake and it tasted like regular carrot cake and the cheesecake was alright as well. Now the portion was HUGE but I didn't/couldn't it all of that. If you go on a date here, save yourself some money and unwanted calories and share with your date. I have to say though that the service was exceptional VERY exceptional despite of what you hear about NYC. \n\nIf you've never been go and I'll probably go again to experience the other things that Junior's has to offer but I'll stick to the Cheesecake Factory for the best carrotcake cheesecake I've ever tasted.", "author": "Troy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "Please forgive any forthcoming anacoluthia, as I was almost as out of it as the unacceptably rude and unhelpful staff here.\n\nWhen you're up at 6 for breakfast and pay MORE than that number for a slice of cheesecake to go, you do it for a reason. I've been to...gasp...the Times Square offshoot before I could make it here to the original \"institution\" that is Junior's BK. I'll remind any non-disciples of mine that I do eat dessert fare before and/or for breakfast and that any detractions I make therein are a reflection of the product and not the admittedly odd habit. I found the hype to supersede the result when it came to their plain original cheesecake. I'm both a purist and pretty adventurous when it comes to food, so there was some serious internal conflict when it came to the flavored vs. original cheesecake, but I had to give the slice that started it all a chance. Well, the dissonance after the fact was almost incapacitating. While the original packed appealing citrusy flavor notes, it was definitely not worth the price tag (this coming from someone who regularly drops double digits on sweets without thinking twice).\n\nBe mindful if you snag takeout that you will deservedly be the recipient of many disdainful glares as you brandish the orange striped bag around the streets.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "Burgers are the best, thick juicy can't even fit in your mouth, order medium rare or medium. Of course cheesecake is what you order, be daring.", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "I know I should come back and review this place when I've had the cheesecake - sorry!\nI had really good matzoh ball soup though. Not as good as mom makes, OF COURSE! I also enjoyed the rolls and cornbread a loooot. My friend had the brisket and really liked it though I don't eat meat and can't comment.\nI totally enjoyed seeing a variety of people - all ethnicities, large family groups, couples, friends, teenagers, all intermingling. You rarely get to see that.", "author": "Liss C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}