{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "I've never been to this place but I've had the cheesecake many times and I love it! It's simply flawless, the texture, the taste and every single bite feels so good in your mouth. It works perfect for every occasion, thanksgiving, christmas, dinner party and more. Great dessert.", "author": "Heider T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-09", "description": "strawberry cheesecake and hot wings! just not together! hahaha fun place, a little \"gheto\" if you know what i mean.. haha", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Had lunch here because I was at a workshop right across the street at Long Island University.  My friend, Alexis, had grilled chicken with collard greens and mashed potatoes.  She said the dish was delicious! I had cream of potato soup with cheddar and scallions which was amazing.  Alexis had strawberry shortcake for dessert, while I had chocolate mousse cheesecake which was to die for.  Service was excellent, prices reasonable.  We were there for lunch on a Monday and there was no wait.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-05", "description": "i havent tried the food here except for the cheesecake.  i dont know what all the rave is about their cheesecakes...the only difference is that the texture is a little more dense than any other cheesecakes in the city...other than that, it tastes the same to me...i plan on coming back for the food and retro atmosphere though!", "author": "Anthro Food E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-09", "description": "Okay don't get me wrong- the cheesecake is GREAT, good chocolate cake, fun 50's-style interior, blah, blah, blah, but when it comes down to it, the food is basically just average diner food. Again though, it is a fun place, great for families, and I wouldn't discourage anyone from going.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Their cheesecake is the softest I have ever had. And the vibe in the place is traditional diner, filled with different aged people coming from around Brooklyn to have a piece, or to just sit in the diner and talk with an old friend.", "author": "Soraya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-07", "description": "Food reasonably good for breakfast, but service extra rude, even by Downtown Brooklyn standards. Most recent experience: didn't even make it to a table as the host/warden refused to seat me at a larger table by a window on a weekday at 10:45am when the place was completely deserted, and then proceeded to walk away while I was politely speaking to her. Never again.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "The food is not bad.  Nothing that I would go back for though.  Now the cheesecake is a whole different subject.  I will say this is the best cheesecake!  The cheesecake is not cheap...but then again what in New York is.", "author": "Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-28", "description": "Basically a diner.  Good diner-type food, attentive service, clean, well-run.  A great asset in downtown Brooklyn.  And good cheesecake!", "author": "John H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "good comfort food, excellent cheese cake", "author": "One i."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-06", "description": "I've never had a meal here, but I can tell you that Junior's serves up the best (and biggest) portions of cheesecake in Brooklyn, if not the whole city. The egg creams are also really good. You can also order a cheesecake and have Junior's ship it to your chosen lucky recipient; I had one sent to my mom for her birthday several years ago and it was a big hit.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-31", "description": "2 stars for a reason not related to the food.  A friend at work who was born and raised in Brooklyn said if you do one thing, you have to eat some Juniors cheesecake.  I'm here in NYC for a week. I bought the NY Pass which says in the book \"Holders of the New York Pass are entitled to a free slice of plain cheesecake with $10 food purchase. Not available for take out. Valid only in the Brooklyn location.\"  Okay, so we just need to spend $10 to get a $6 cheesecake for free.  Spend 10 and get 16.  We start to order some tea, onion rings and mac and cheese.  The waiter said we need to buy an Entree.  So, I felt duped and I think Juniors isn't honoring the words printed in the NY Pass booklet.  We just got a piece cheesecake.  It was good. Smooth creamy and a bit of lemon in the crust to help add some acid to break down the richness of the cheesecake.  Had I not felt duped by the waiter/management of Juniors, I would rate the chessecake a solid 4.5 stars.  It was really good.", "author": "Dave S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-10", "description": "worst service i've ever had in my life. two of us went for dinner on a saturday night we ordered an entree each and a appetizer. they brought one meal and the appetizer at the same time. 15 minutes later both plates were done and we hadn't gotten a meal. from the time we ordered until this point our waiter never even walked near our table. we both were ready to order another dirnk as well. the backserver came by to clear the plates asking if we want dessert, i told him i didnt even get my meal yet. he walked away. literally 15 minutes later. i grabbed a manager to ask for my check because our waiter had still not showed his face yet. i had to ask for my entree 3 times. nothing on the plate needed to be cooked. it was a cold meal. it never came. i had to ask for the check 3 times and that still came before my meal. i guess the manager had said something to the waiter so the waiter came by showed me his paper he took our order on and acknowledged he got my order and made some excuse that he had to toast a bagel. at this point the person i was with had been done eating for 30 minutes! another 10 minutes later still hadnt gotten my meal or the check! we'd been in the restaurant for 90 minutes and i never got my meal. the waiter never apologized and tried to blame someone else for his lousy service. he got $0.00 tip! (and he earned it). i would never walk into this place again, i'd never tell friends to go there. could not have been more dissapointed with \"junior's\". literally no one should ever go to this place!", "author": "Jason W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}