{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "Good cheesecake, but I wouldn't go out of my way to come here. Eileen's Cheesecake is way better.", "author": "Chris N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-06", "description": "One word, Cheesecake. And, arguably the best cheesecake ever. Junior's has been around for a while and has since become a New York institution, in my opinion. I honestly never eat cheesecake anywhere else because once you've had Junior's you've had best. It can't get any better from here. \np.s. If you've had Veniero's cheesecake before, brace yourself for Junior's.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "They give you alot of food, be prepared to take a doggie bag home with ya. Great service and delicious cheesecake! The bathrooms are sanitary though LOL!", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "We all know what Junior's is famous for. Love their cheesecakes!\n\nI dined here a couple times, the waiters were extemely attentive and very professional (big tip). Food was good - good old American burgers and etc.", "author": "Tenaj K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "was a little hyped up for me I guess I was expecting more", "author": "Doreen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "I can eat at Junior's every day. The Weekday Special is amazing!! I ALWAYS get matzo ball soup, salad with Blue Cheese, broiled sole, broccoli, mashed potatoes with extra potato chips, and chocolate layer cake. I go here so much and I even took 3 co-workers who were in town staying in Manhattan and they loved it. I love how it's so conveniently located near the subway and near the B/Q trains for me! I love Juniors so much! It makes me happy. This is a great by yourself restaurant to eat at too!", "author": "Brian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "best cheesecakes ever! \n\nmy favorite is the strawberry cheesecake but they have other kinds like chocolate swirl, raspberry, banana, etc.", "author": "Vero H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "Best cheesecake, better than cheesecake factory and the boxed kind at costco. It was moist and not dry like others.", "author": "Yudelan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "A lot of people act strange when I ask them if they have ever eaten at Juniors. They give me this weird look that say's \"Ive eaten the cheesecake there but aaaaa nothing else...\" That was all in that long drawn out cali speak that has so effectively gravitated to this great city. That said they should come on down off that high horse for a second and have some chicken and ribs, it's pretty amazing here and for the money it's the best bang for your buck in downtown brooklyn. Everything from steaks to fajitas its all standard and all delicious. Nothing fancy just good portions in a nice throwback atmosphere. One thing everyone should try once in their life is the sandwich on the menu called \"something different\". Moist Brisket on a bun made of fat potato pancakes topped with the juices from the brisket. It is one of my favorite things in the world. Worth a try, nothing fancy but a classic standby thats worth more than just the cheesecake.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Junior's is the best when it comes to cheesecake....seriously. The Cherry Coke isn't too shabby either. I haven't been there in awhile but next time I'm in Brooklyn I'm stopping by.", "author": "Will M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-31", "description": "Was on the prowl for Southern Fried food today (because, sometimes, it's nice to eat your emotions - particularly when laden in grease).  Unfortunately, Southern-Fried isn't something to try at Junior's (and, admittedly, in Brooklyn) - and, yes, I admit that the only reason we tried Junior's is because nothing else was open (Happy New Years Eve!).  \nStill, it's an experience: the vast sterility, florescent overhead lighting, razmatazz holiday decorations (glitter-tipped poinsettia! twinkle lights! aluminum garland!), tuxedoed wait-staff, etc.  \nMust admit that the price wasn't that bad - less than $40 for two entrees \u0026 mimosa; plus, a parade of complimentary, off-the-wall nibbles (coleslaw, beets \u0026 cornbread) arrive right when you're seated.  I ordered Southern Fried Chicken; my friend Chicken Fried Steak.  The steak had a better scald to it and it was moister; the chicken was a bit over-cooked - however, while I preferred the steak, my friend preferred the chicken (we agreed to dine together more).  The potatoes were good but tasted a smidge boxy, the corn was delicious.   The service was attentive and the waitress was the most cheerful soul around.  \nIf I ever were to patron Junior's again, it would be late a night, after a breeze on the dancefloor - during that in between time when even the streets seem to be sleeping.  When all you really want is a clean, well-lighted place that feels like a few steps into yesteryear.  When all you really want is a plate of steaming cornbread, mashed potatoes \u0026 fried chicken.", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "OK, now I've always herd that Juniors cheese cakes are good, but that's an understatement. Last night for the fist time i went in for a slice, and all i got to say is\" juniors cheese cakes are freaking awesome, the best in NYC\"", "author": "Juan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-06", "description": "It was a trek to get there by train,  but wow was it worth it!\nI had the fresh strawberry cheesecake.  The strawberries were fresh, the glaze was just right, not too sweet, and the cheesecake was so deliciously creamy it just melted in my mouth.  Yummmyyyyyy!", "author": "Nina Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "OK this review is for those how haven't ate a meal here. There food is exactly good. The breakfast is very tasty. If you like pancakes or french toast this is the place to be. There dinners are good but i usually get the Reuben sandwich, it is very good with the side sauce. The chocolate mousse cake is great and if you haven't eaten the cheesecake yet you should be ashamed of yourself for depriving yourself of the best cheesecake in the world.", "author": "Jason J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-28", "description": "Solid my friends... well, depending on what you are going for... but the menu has everything... I mean everything.  My favorite there are the blintzes, but have had great soups and desserts.. oh yes, the desserts.  Very heavy eating, but hey, it's a delicattesen for Christ sake... stop complaining.  Everyone talks about the Cheesecake, and yes, it is the best in the city, but I really am not a Cheesecake fan.  I don't think the pastrami is as good as Katz's or Carnegie, but not many are and definitely still solid meat sandwiches for sure.  A solid Brooklyn eatery and if you are sick and need some comfort food... they will help you feels all better.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "We just stopped at the bar and I have to say the drinks will knock you on the floor. They also have a menu of all the classic drinks they can make, so it's easy to pick some things you might have forgotten about.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-27", "description": "....it was like being the quiet nerdy girl in high school who finally got asked about by the gorgeous captain of the football team, looked good, but had no real substance or texture inside...thats what my juniors cheesecake was like..it looked good, but Ive had so much better.. if you're ever in New Orleans I suggest the cheesecake at Oceana on Bourbon ST. its soo good.", "author": "Tiff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "This is a do not miss experience and if you can't get to Brooklyn look for the Juniors in Grand Central Terminal or Times Square. There is the most fantastic range of cheesecakes here as well as all sorts of cakes. If you are having a meal first be mindful that you are going to get a massive portion!\n\n\n Have also had a burger here and this was also very tasty but the main thing is to leave room for the cheesecake!", "author": "Darlingtongirl"}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-24", "description": "Junior's used to be a reliably above average to excellent restaurant. I typically frequented it for breakfast or a coffee and pastry (both reliably excellent). Yesterday, I stopped there before going to the theater. I ordered a tuna sandwich on thick Chalah bread. It was below average: the bread was stale, and the tuna salad was definitely also not fresh. The best thing were the FREE pickles, beets, cole slaw. I ate half the oversized sandwich, packed the other half to go and ended up throwing it in the garbage once I got home. No reason to keep it. The service has also declined. In the past the wait staff were much more savvy: matre d didn't alert a waiter that we had just entered: we had to flag one down ourselves. It was not an especially busy time so one could not forgive the oversight on that basis. It was simply carelessness on the part of the maitre d. At the cash register the person taking payment asked how we enjoyed our meal. I told him politely but honestly - we were very disappointed. He looked through us with total disinterest. I would strongly advise people to avoid JUNIORS Brooklyn if you want something other than cheesecake and/or breakfast.", "author": "Dolores B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "Seems like things shouldnt be so expensive.  food was good but nothing spectacular.  You could go and spend 100 dollars easy with the option of 9 dollar cocktails and 33 dollar steaks.  I was hoping for a diner experience but paid fine dining prices.", "author": "NICK D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}