{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Best cheesecake in nyc! Always have to buy one when I'm around the corner! The other cheesecake were okay but can't be compared to the original cheesecake! \n\nNever ate at their restaurant so can't comment on that. The environment is nice nonetheless. Travelling there isn't that convenient..", "author": "Josephine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "NPS = 9\n\nThe quintessential cheesecake of NY!\n\nI always make it a point to grab a slice to take home while in NY.  Plain cheesecake, of course.  Nothing else fancy necessary.\n\nThis time around, we grabbed two whole cheesecakes to take home to Miami.\n\nTurns out there is not a problem whatsoever bringing some whole pies on the flight!  Awesome!  Talk about an awesome souvenir for friends and family.\n\nThe cheesecake with the strawberry on top is fantastic.  The strawberry gelatin did not taste \"artificial\" like other cheesecakes.  And the crust....my, oh my.  Delish.\n\nI also had some coffee that was nothing to brag about.  I mean it was just coffee.  But what you really can't miss out on here is the cheesecakes.  I have yet to try the actual cakes but so far....I haven't wanted to deviate from the fluffy, creamy, rich plain NY cheesecake.", "author": "Henry A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-25", "description": "Old school NY here. Since this is a diner, I went for some typical diner dishes, although they have many items on the menu to choose from. Had the Turkey Reuben and Matzah ball soup, both were very mediocre.\n\nI might come back here for some of the desert and their famous cheesecake.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "great cheesecake and other baked goods .. i mean, thats what theyre famous for, right? as far as the regular dining experience goes, its just overpriced diner food for the most part. but everything in new uork is overpriced, right? i stop here when i can find a quick parking spot to bring some goodies home but not typically to sit down and dine. there are so many other offerings in brooklyn for food and jumiors isnt the best place to get bang for your buck.", "author": "Beaumont L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "I cannot speak for the actual main courses since I have never had them - but as far as cheesecakes go, there's a very very good reason why Junior's an institution. It is utterly blissful to have their rich and flavourful cheesecakes. And no matter what flavour you like - their original (plain) cheesecake is also a must try. \nI have walked past the branch in Midtown on a few occasions, and you're better off going here as it's easier to beat the crazy lines too!", "author": "Vaibhav M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Look, the food here is gross, standard american fare. Seriously, it's tasteless and really unappealing to even look at. But you don't go to junior's restaurant, which is interchangeably called junior's cheesecake by most people, for their nasty food. You go there for their absolutely delicious strawberry cheesecake.\n\nNot, their chocolate pies, plain cheesecake, apple crumb cake, or any of their other desserts - specifically, their strawberry cheesecake. \n\nThat's the reason I am giving this place 4 stars. They do cheesecake right. It's dense, rich, sweet, has those strudel thingies on top - sometimes the strawberries are sour because they're out of season, but I just don't eat them and the pie still tastes absolutely delicious.\n\nMy boyfriend knows that if he wants to make me happy, he can get me a slice of cheesecake. So I get one for my birthday every year. I watch what I eat and eat pretty healthy - but when I indulge, I indulge right with something that's worth it.\n\nEach slice is 430 calories, but they are worth fasting for the day or the next few days to compensate. I know these things are my weakness so I limit my consumption by allowing myself only two visits per year.\n\nThe fact that one slice or a whole pie is really damn expensive, parking is really bad at this location, and that cops are always around trying to ticket you helps me stay away.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "This is a great restaurant! Lots of memorabilia and super wait staff. The food is excellent and lots of it. We tried the grilled cheese. Wow! Lots of cheese and lots of fries. The red velvet cheesecake was to die for. In fact, that is the reason we like to eat here when we visit NYC. Although, this particular restaurant is in Brooklyn. We were there last week and I'm still full.", "author": "Lowell F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Came here for a late night dessert! Their Black Forest cheesecake was amazing!!!!! Sat at the counter. Service was awesome. Ladies working the counter had awesome personalities! Had a great time! Can't wait to come for dinner!", "author": "Suzi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Food is good ! Especially brunch time You got free drink and some bread ;) that was great to have brunch here ;) thank you ;) service are ok tho !", "author": "Zaw Win T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Really good wings, the steak looks way better than it tastes. The food was really expensive but I didn't mind since my grandpa took me out. He really enjoys the sea food platter. \nOf course the cake was great", "author": "Goldie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Rating solely on desserts. Strawberry Cheesecake is very rich. Red Velvet cake is very moist and amazingggg. Total win for desserts. Gets pretty busy at times, but worth the wait.", "author": "Donna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "I had a great meal but they prepared quickly for me I had bacon eggs and cheese grits and they were all fantastic.", "author": "Vincent W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Very cool, old school diner in downtown Brooklyn. The breakfast was delicious and served hot. The staff were friendly and attentive. There was a really nice mix of people  at this restaurant that makes me believe that it is popular with the locals and not just a tourist destination. \n\nThe coffee was really good, and the timely refills just kept coming throughout our visit. We ordered breakfast and the eggs and potatoes were cooked to perfection. The prices were very reasonable and we left with two pieces of cheesecake (the fresh strawberry and the red velvet) to enjoy later in the day while we watched movies - and boy did we enjoy it! \n\nJunior's is on my list of places I plan to visit again when I am in New York.  Excellent cheesecake and a great breakfast. I will have to come at other times of day to enjoy the rest of what Junior's has to offer.", "author": "Finijo F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "Junior's have always been one of those stables of the downtown Fulton area. It's one of those places where I enjoy walking by as a landmark, but cringe when I have to go in there.\nFirst off, the front door of the restaurant is ridiculously out of this world heavy. It's like at least 80 lbs, and I almost died trying to open it to go inside. (Juniors, why you make your door so heavy? It's heavy enough to keep me out. Almost.) \nThe cheese cake here is phenomenal, and everyone knows it. I work in the neighborhood, so every time the company have a celebration or birthday, Juniors is place to go to. And again, every time if Im the cake buyer, I cringe coming here. But the cakes are just so darn good! \nThe reason why I decided to give Juniors a one star, despite the alter mater of cheese cake that is serve here is because of the service. While I cannot say for their restaurant staffs because I never dined in here, the take out crew is poorly managed and coordinated. There is really only one individual working, and that's the man that's always managing the left cashier of the take out section. Once you get through to the heavy door that makes your eyes widen at the incredible weight, you walk through the mini lobby into the take out section. The take out section is separated between the left and right, the left is for food take out, and on the right there is a cake counter displaying all the cheesecake galore. I always get confuse on which counter to go order the cake from, BECAUSE THE CHEESE CAKE COUNTER IS ALWAYS EMPTY! Meaning, there's no staff to serve you. There's staffs behind the counter that's within the opening of the bakery take out and the restaurant, and they see individuals walking up to the cheesecakes examining which pieces to choose but they do not greet you. They wait till the victims, oops I mean costumers walk naively over to the food take out and wait on the line while others are actually ordering food to go. When it is finally their turn, they happily ask for the cheese cake that they have their heart set on. Only, finally to be pointed to go back to the other side.\nNow, mind you, I am sure the staff that was suppose to be managing the cheesecake counter sees this whole interaction from when the customer walks through the door and look at the cheesecake because the customer clearly recognize the staff that did not serve you, and when you walk back begrudging to the cheese cake counter the staff sees you walking over and laughs and keep talking with their restaurant wait staffs. Even when you're at the cashier, the staff decides to keep laughing and talking with their colleagues for a good two minutes before taking your order. \n\nAll in all, this is poor management and I dislike coming to this location every time. Hopefully downtown Fulton will have a good bakery / cake catering shop opening soon to save the residents and locals from the misery of the incompetent take out staff here.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "I've been coming here ever since my kindergarten graduation. I love this place, it's a landmark. They were trying to tear it down at one point, which would have meant a lot of the staff losing their jobs, and a neighborhood losing a piece of history. I'm glad that didn't happen.\n\nThis is the best place in town for breakfast, a drink, or cheesecake. Be sure to tip your server right.", "author": "Sunny D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "This review is for the black-and-white cookie of which I have enjoyed thoroughly. In the last six months I have gone to at least six different bakeries for black-and-white cookies. \n\nThis time, got a black n white chocolate cupcake too. \n\nSo far, Juniors has my favorite Black and white cookie. I haven't eaten here so I can't speak on anything else. \n\nThis beautiful cake cookie has a delicious fondant icing over a vanilla cake moist cookie. It's gorgeous to look at and The one time they didn't look so beautiful the guy pulled out a box with fresh black-and-white cookies. \n\nThe cupcake was to die for. Totally moist and chocolatey! Now I love juniors even more. Approximately $10 for two black-and-white cookies and one chocolate cupcake but looks like one of those Hostess cupcakes that you got in a plastic bag at 7-Eleven except this cupcake is much larger looks more homemade and tastes a lot better.", "author": "Rizwan A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Wish I ordered the Cheesecake..didn't know they were famed for it until done and writing this review.\n\nWas there for breakfast, it was ok.", "author": "Jive O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "I want to thank Juniors for being open on Christmas Day. Christmas isn't like it was when I was a kid; now its pretty much just me and my Dad. I took him to see Star Wars early in the afternoon (\"I don't want to wear those red and green glasses\"), then we needed a place to eat. Not a lot of options on Christmas Day (even Shake Shack is closed), but he suggested Juniors. \n\nSure enough, they were open, serving, with a fairly decent crowd. Walking in the side door really kind of transports you back a few decades. It felt surprisingly homey and comfortable. I'd been there before, but I never realized they had a full bar. I ordered a beer, Dad order a bloody mary (his drink of choice). Dad didn't like his drink; apparently I make a better bloody mary. \n\nWe ordered mozzarella sticks, which were fine, but pricey for only five. Ah, but then came the sandwiches. He ordered the pastrami/corn beef combo, I ordered the brisket. They're big; normal people would get two meals from each sandwich. I must've been hungry or sentimental or both, because I basically inhaled mine. It was delicious. Oh, and I destroyed the fries as well. My father took half his sandwich home for another day.\n\nIt may be sacrilege, but we both passed on cheesecake.\n\nI really hope this place lasts forever. I thank them again.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Don't know about other days but the service was horrible.. my boyfriend and I were put on a corner table, no one even bothered to come up to offer water to start off. We literally had to ask to get our order taken. We didn't have an actual waiter like other tables did, random people just came. It wasn't even busy nor were they understaffed. Some tables just received attention more than others. Overall, very displeased with the service so we didn't tip. Never going back.", "author": "MaryJane R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-30", "description": "This review is only for the strawberry cheesecake. I went there all the way from uws to get the most famous cheesecake. $8 a slice was really expensive. The cake tasted good, soft and fluffy. I like it better than those ny cheesecake with hard and heavy texture. However, I hate the red jelly topped on the cake. It made the cake taste so sticky and artificial. I had to scratch all of it off. Also, they put whole giant strawberry on the cake rather than slices, which made it very convenient to eat. I won't order it again but I'm still interested in the original and chocolate cheesecake.", "author": "Yaran S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}