{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-15", "description": "*amazing Cheesecake. \n*POOR customer service at the takeout section.\n*we were asking for recommendations and the lady gave us an attitude as if it was a real hassle.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Overpriced cheesecake which did not taste special at all. I also ordered chicken fingers and they tasted undercooked and awful. Slow service.", "author": "Surbhi S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "Juniors is definitely famous for just the cheesecake, which I dont eat.  Ordered fried catfish, burger (dnt recall which 1), and fried chicken with turnips, mashed n gravy n rolls.  Food was horrible, no seasoning at all.   The rolls had poppy seeds or sesame seeds or something on them, yuck.  \nVery expensive for horrible food.\nIf you dnt need any seasoning or flavor to your food, definitely go to juniors.", "author": "L J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "The cheesecake was to die for!  Nice place to visit but a little to commercial for my taste. The food was good but pricey, I had a pastrami sandwich, 2 drinks and cheesecake for $50. I'd definitely recommend going at least once or just order a dessert to go.", "author": "Lanissa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "I tried the chicken pot pie which was OK.\nAlso tried two different types of cheesecakes.\n\nNothing was overly impressive, I probably wouldn't have gone back if it wasn't close to the hotel I stayed at.", "author": "Iman R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Cool diner. I enjoyed lunch and a dinner. Be hungry. They serve a lot of food. Didn't try the cheesecake but think it's great.", "author": "Keith S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Great food... In addition to amazing dessert. Was surprised at the high quality of their grilled chicken sandwich which was served on wonderful challah bread. The fries and sweet potato fries were crispy.. Yum! \n\nThey put out pickles, coleslaw and beets on your table- awesome touch!!!!\n\nAnd the rumors are true :-) their desserts are amazing. The plain cheese cake is perfect and if you want some added sweetness go for the strawberry cheesecake pie (pie has the graham cracker crust).", "author": "Dara B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-05", "description": "Great Cakes and Pies and tasty brownies. \nThe only issue In have with Jr's is the staff. \nThey are always very rude and curt. \nI really go out of my way and try to be very polite and courteous to anyone that serves me--since I'm a flight attendant myself and I  understand how dealing with the public can be a challenge. \nI have to wonder if the staff perhaps is not treated well by management and maybe that is why the customer service is subpar.", "author": "Dexter C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "If you're doing Brooklyn, you have to do Juniors. Its the historic diner restaurant of Brooklyn with famous cheesecake. You can feel the years of this place in all the good ways. I enjoyed my over cooked burger and fries. It wasn't cheap, but it tasted good and I could spread my legs at the table and soak in the view. The grilled cheese was also good. The cheesecake wonderful. If you're in the mood for homestyle restaurant food, Juniors is the spot.", "author": "Vassilis J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "sucks on all accounts. cheesecakes are overrated, beer is flat, service isn't attentive at all. no reason to go back.", "author": "K B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Old style restaurant with lots of history and awesome food. I tried cheeseburger with pastrami...maybe the biggest burger I've ever tried and one of the more tasty ones. To finish the party...strawberry cheescake!! Amazing!! A must for sure", "author": "Albert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "The chocolate cake is too good and I miss it as I used to eat it every week. \nReally speaking the food is not the best but the cakes, Oh my god. That's a must. Go eat two slices. One for me too.", "author": "Yuvaraaj J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "Food was decent, maybe a bit high.  Waiter laughed at us when we asked if they had military discount.  Then came back to the table 3 times to verify our bills, and added a 18% gratuity for our party of six.  Never again.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "We thoroughly enjoyed this diner. We went to Brooklyn just to have their cheesecake and it was well worth the trip. The service was awesome and cheesecake lived up to the hype. We highly recommend stopping in for one of their sweet treats.", "author": "Tanya O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-09", "description": "I've come to Juniors 3 times in my life. Each time I got a worse impression than the last.\n\n1st time: I went with a relative. My waiter had serious body odor\n\n2nd time: I went by myself. My waiter was inattentive.\n\n3rd time: I went with my buddy. The waiter was nasty. He stared us down and gave us the evil eye. We complained to management.\n\nJunior's has standard diner food nothing impressive.", "author": "Burgandy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "Junior's is known for their cheesecake but you need to have a meal here as well. \nAny meal is great but I love coming here for brunch.\nThe staff is always attentive and friendly, I have not had a bad experience with anyone. \nTheir prices are cheap and considering how much food you get with it is crazy! If you walk away hungry that is on you! You get a pastry tray with your meal which has cute bite sized pastries and rolls with it. Then your meal alone is huge! I always end up taking it home or having someone else finish! Their french toast is heavenly! I definitely recommend!", "author": "Ashleigh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I stayed in a near by hotel, so I had both dinner, breakfast, and dessert in that order at this restaurant. The bartenders were excellent!!! \nDinner 3 stars\nBest drinks, ever. The jerk chicken was tasty. Decent meal portions\nBreakfast 2 stars. I had the smoked salmon, which was good, but I'm not a fan of the home fries. My fiancé had an omelet, that lacked meat. \nDessert 4 stars\nI purchased the swirl, plan, and red velvet cheesecake and everyone loved the flavor they tried.\nService 4 stars!!", "author": "Tash P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "I care for it anymore.  They don't listen to what you say. When you want your  chicken well done they burns it . I was so made I stop going", "author": "Corine D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "I have mixed feelings about this place....  I grew up in Brooklyn and this used to be one of my favorite restaurants.... Today the service was terrible the waiter was extremely slow it took 15 minutes to get our starters and an extra 25 minutes to order.  It was not busy.  The food was not hot just warm.  The best part was the mimosa which took 20 minutes to get and the cherry Pepsi which is my absolute favorite.  Juniors you guys are losing your touch and the lunch special is not available on weekends so paying full price for terrible service and mediocre food pissed me off. I guess I'll be back when you guys step it back up", "author": "Brittney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Juniors is a delightful trip back in time. The service was speedy, the breakfast was tasty and the cheesecake. Ooo the cheesecake. \n\nA lot of NYC staples are overrated, but juniors cheesecake lives up to the hype. If you are going to make the trip to Juniors you also need to Brooklyn. My only ding was the price.  The large cheesecake is $35! Now I've paid more and I didn't feel ripped off, but yikes $35 for a cheesecake.", "author": "Charles L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}