{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "I love Junior's carrot cake. I pop in every so often, so I really excited when I stopped in today for a treat. But today, the carrot was not very good. The sponge was dry and tasted stale. Junior's is usually much better than this. Hopefully it's just a carrot cake off day. Fingers crossed until next time.", "author": "Sharon F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "We came here for the cheesecake and didn't try any of their other food. Overall, we were slightly disappointed, since this place is so hyped up. Their cheesecake is too decadent and I didn't find anything exceptional about it. \n\nInstead of buying your cheesecake, google: Michael Symon Pretzel Crust Cheesecake. Super easy to make and better than most (actually, all) commercially sold cheesecakes. \n\nWe're glad we came, because we had to try the famous Junior's cheesecake. However, we probably won't return. \n\np.s. parking is a nightmare in the area", "author": "Ilona K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "The was wonderful. I would definitely come back again. Although I don't eat cheesecake but damn it looking good.", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "This Junior's restaurant is centrally located in downtown Brooklyn, near the subway and Flatbush. We were staying nearby so it was within perfect walking distance for breakfast. The dining room is extensive, but it wasn't too busy when we were seated. \n\nFood came out quickly and we also enjoyed the complimentary pastries. The menu is classic with favorable choices. We ordered Hot Cakes plate w/bacon and Eggs plate that came with bacon, potatoes, and toast. The portions were large, especially the pancakes. My dining companion loved that there was a lot of maple syrup available to douse the cakes (and bacon) with. Speaking of bacon, it was plentiful. That's the way all diners \u0026 restaurants should serve bacon--stacked and crisp. And their home fries were probably some of the best breakfast potatoes we've ever had. For our whole order, prices were decent for what we got. \n\nThe staff was nice and attentive, especially when refilling drinks. Unfortunately we were so full from our meals that we couldn't handle cheesecake, but everything from the bakery near the entrance looked delicious. \n\nJunior's is a nice place to eat not only for visitors, but also for locals, as we saw a few of them being served while we dined.", "author": "Christel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "This place gets a 4 and its for one reason only! The cheesecake!!! Yes!! It's everything you've heard it is! Yes it's worth walking to from Manhattan like Diddy made the members of Making the Band do! \n\nI've had the food here and it's not that great very standard diner food with 4 star restaurant prices. Wayyy to expensive but I guess you pay for the name. \n\nSo if your going to be over changed for the name you might as well get what they are known for! THE CHEESECAKE!!!! I've had the original and the chocolate and both are amazing! They have lots of other flavors but the original is still best!!! Next time your in Downtown Brooklyn stop in for a slice!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-18", "description": "Torn between 3 and 4 stars because the food was actually pretty good but the service was quite the opposite.\n\nWe were seated immediately and then forgotten like neglected, red-headed stepchildren. The host walked by about 10 minutes after we were seated and offered to take our order when he noticed we were server-less. Luckily, he brought us some cornbread to munch on while we waited.\n\nI ordered their cheeseburger which was hefty, for lack of a better word. My friend had the Chx Caesar Salad. Both were great and portions were large! Eventually, another employee who also noticed that we were abandoned offered to bring us takeout boxes... and then never came back.\n\nThe bus boy, who did not utter a single word, brought us more cornbread (which is a nice consolation prize for our invisible waiter) and we requested those boxes we were promised. Our substitute server came back and apologized for the mess at which point I handed her my credit card and asked for a slice of cheesecake (which was basically the only reason why we came). There was a concern that I may never see her again but at this point I didn't care if I had to call Visa to cancel my account--I wanted out. Much to my surprise she came back with both the card and the cheesecake and all was right with the world again. I'll make sure to place a to-go order next time...", "author": "Jinah Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Fun place and great food. Rough service but seemed like our server was super busy and stuff was broken. Cheese cake was amazing", "author": "Jenn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "A gem of a restaurant. Excellent location in the heart of downtown Brooklyn. I really enjoyed the 1950's atmosphere and decor. The service was very polite and friendly. My food came out quickly. I highly recommend the Matzoh ball soup and the original cheesecake. This is the best cheesecake I've ever had; it literally melts in your mouth. My burger and fries were outstanding, as well. \n\nIf you're visiting NYC and you want to try Junior's, make sure to visit this flagship location in Brooklyn. (The locations in Manhattan won't give you as authentic of an experience.)", "author": "Ward S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "Dinner attempt take 2: we rolled into Juniors and were quickly seated. Portions are beyond ginormous... we each ordered an entree and then latkes to share. Wish the waiter had told us how big the potato pancakes were because really, one would have been enough! I had the blintzes, but could only eat one and a half (so rich!) and my friend had a giant sandwich. I had a chocolate egg cream (a NY must!). Too full for dessert, but we stopped by the bakery counter on the way out since my friend wanted treats for later. Our waiter was very friendly, but we had a couple of communication issues.", "author": "Briana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "A friend and I are traveling for the holiday. We came in on Christmas, we were quickly seated, except we were by the door where we felt draft come in constantly. Along side this the server was relatively rude, with grabbing menus and grabbing my friends hand in a rough manner while retrieving the menus. My order was ignored about checking on the double chocolate chip pound cake. I ended up receiving a chocolate swirl cheese cake. It was delightful, too bad the service isn't as great as the cake.", "author": "Freddy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "So this place is kind of a tourist trap, but it's also kinda awesome.  \n\nNot only does Junior's have a storied history, it looks like it has a storied history.  The place looks straight out of an early Quentin Tarantino movie, i.e., unchanged from the 60's and 70's.   \n\nI had split pea soup.  It was good.  Not amazing, but good.  Surprisingly, they have a pretty good selection of local craft brews, too.   Junior's main claim to fame is their cheese cake.   I can't it's unjustified.  I'm not a huge fan of the cake \"crust\" (as opposed to a hard crust), but the body of the cheesecake was so smooth and airy.   It wasn't too sweet and wasn't too sharp.   Really good.", "author": "Angelus K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "Everyone raves about Junior's cheesecake so I had to try it since I love cheesecake.  I got their famous strawberry cheesecake and it really wasn't all its hyped up to be. Definitely not even comparable to Cheesecake Factory or Martha's Country Bakery. The cheesecake was so dry. I only took one bite and the rest went to waste. My husband got the carrot cake and he also did the same, one bite and then trash. Had high hopes for Junior's, unfortunately it wasn't tasty at all.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Tried their famous original cheesecake which was yummy. Strawberry shortcake was good as well.  Carrot cheesecake was ordered by a friend but I didn't try it. So no comment.", "author": "Marz S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Junior's got to be the best place to get some cheesecake or dessert in general. Plenty of dessert options to choose on the go. They give you huge slices, so you definitely getting your money worth. \n\nI got the plain cheesecake and the carrot cheese cake. \n1. Plain Cheesecake was fluffy, rich, creamy and oh so good. Perfection.\n2. Carrot Cheese cake was good. There was more cheesecake than carrot cake. It was moist and creamy. \n\nBest place to get cheesecake. Disappointed to hear they are shutting this place down.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "I bragged about my Junior's food experience on social media by using the term \"God like\" ... So I feel I should mention that here. I had the \"Something Different.\" A brisket sandwich where the buns are made of potato pancakes! POTATO PANCAKES! And an au jus dip!!!! Massive pancakes that held together well under the circumstances. And when the sandwich finally started to fall apart - amazing applesauce (chunky) to accompany the pancake bits. I made the mistake of ordering fries on the side. Big mistake. Too much food. Just an amazing experience. One of the best meals of my life. I mean that. I took home some Black Forrest Cheesecake which was also out of this world. I will return here every time I come to New York. Guaranteed.", "author": "Nathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "I've never eaten here but my family frequents here often to buy their original cheesecake. We love their cheesecake!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Top for American traditional cuisine...\nI got a BBQ combo platter with ribs, shrimp and half chicken ....it was really good .... And Their homemade bread it's spectacular !!\nJunior Brooklyn rules!", "author": "Samuele L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "I've been to Juniors way back in the days . I was looking to reuniting myself with their famous strawberry cheese cake .  I arrived at 07:20 hours and waited to be seated . There were 2 customers seated at the counter area and one waitress serving them . I waited a good 7 minutes to be seated, but no one approached me . The waitress at the counter was too busy talking to the kitchen staff . Finally the cashier walked over to me and seated me at the counter . The above waitress handed me the menu and looked very annoyed . I placed my ordered for the strawberry cheese.  When it arrived , I expected a glass of water, but she did not offer . The strawberry cheese cake was very good, but not for $9.00.  After I finished, I looked around for the waitress but she was no where to be found . I walked over to the cashier to pay my bill and suddenly the waitress walked over to collect my payment . You can see that she was waiting for a tip . I gladly paid my bill with zero tip. She rolled her eyes and walked away .  Cheese cake good . Service \"SUCKED.\" Never again .", "author": "Joe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "A Brooklyn classic!! Whether coming for a meal or just dessert, Junior's never disappoints! All the staff are always very friendly and very helpful which makes dining at Juniors an experience unlike any other. My favorites on the menu are the pastrami Ruben on rye, the potato pancakes with apple sauce and sour cream, and a slice of the classic cheesecake and a cup of coffee for dessert!", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "All the cheesecakes are good,but def the new York cheesecake is the best! The strawberry compliment every ingredient in this yummy dessert.", "author": "Arely S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}