{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "My Aunt Vivian was a waitress here back in the 80s and 90s.  Loved coming here and getting her treatment.  She was great.  Boy, I remember coming here after clubbing and stuffing myself with waffles!  (Im not a big cheesecake eater, but I can eat the crust of a cheesecake like there was no tomorrow.)  I'm a vegan now so it would be hard to eat there--lest I was dropping my law for a day!  I miss Brooklyn and can't imagine what its like now with the new Barclay Center a few blocks away.  Junior's is the perfect place to be gluttonous and avoid counting calories.  A good place to forget about cholesterol and fat and just pig out.  So, beware when you go, and have a plan!!!!!  And workout the next day for shizzle!!!!", "author": "Ganious M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "Can't say their legendary strawberry cheesecake was any different from the Cheesecake Factorys", "author": "Girl B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "To me, Junior's is not just a mere Brooklyn eatery landmark... to me, Junior's is this special place that holds sentimental value to my entire family.  It is this very famous cheesecake mecca, where my mother and my father had their very first date... flash forward almost 45 years later, and Junior's was a must-do on my to-do list with my wife.\n\nYou may look at Junior's passing by on Flatbush, as you say to yourself, \"Why would anyone ever want to walk into that overly brightly lit diner in the middle of such a crappy area?\"... well, you would be foolish not to pique your curiosities and step inside for a quick bite.\n\nAs you peruse through the menu, the only echoing thought that will run through your mind is, \"I can get this diner slop anywhere,\" and for what it's worth, there really isn't anything on the menu that screams New York's Best... that is, right up until you decide to order yourself a slice of cheesecake... or should I really say a thick indulgent slice of heaven.\n\nSuddenly, as that creamy rich goodness meets your tongue, you will understand why this is Brooklyn's best.  That's when that slightly above average brisket becomes something to go out of your way for, just so you have an excuse to eat dessert.\n\nIt's hard to explain.  You look at the cheesecake, and it looks like every other cheesecake you've seen.  Then you ask someone to describe it, and usually the word \"heavy\" is the first thing that people say.  Neither which feels even remotely worthy of being the best.  Which is why, in this case, tasting is believing.\n\nI can still remember arguing with my wife, as I tried to force her to eat a slice of Junior's cheesecake, where her words of \"How good can this cheesecake really be?\" became trumped by the decadence that won her heart over even before the first bite was fully swallowed.  Yes my friends, the cheesecake here is just that good.  So good, that the moment my wife was done with the first slice, we were buying one whole cheesecake to take home for us to enjoy later, one for her sister to eat with her boyfriend, and one for her parents to enjoy... just the same way my parents did 45 years ago.\n\nNow that Junior's has become slightly commercial, in that they have a few extra New York locations and even an online ordering system for their famous desserts, you still need to do yourself a favor and take a hike into my hometown to try the original... it's really the only way to do it right.", "author": "Bryan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-12", "description": "Likes:\n-Huge Portions\n-All American diner atmosphere\n-items on menu you don't usually find nowadays, but used to be very popular (potato pancakes)\n-Potato pancakes\n\nDislike:\n-Junior's club was huge but no good. The bad (dry) turkey was abundant but it lacked the key to a good sandwich, flavor.\n-Egg benedict was no good, at least they poach the egg right, but sauce was to lemony and the muffin was plain no good.\n\nOther:\n-The famous Cheesecake was the reason I visited Juniors. It was not bad, better than Cheesecake factory perhaps, but no where near the best cheesecake I've had, and I would not even rank it higher than Marie Callendar's cheesecake (which I like a lot even though it is a chain).\n-Most of their food was whatevers, like sweet potato fries (edible but not memorable). Neither good or bad for the simple stuff though they did screw up turkey club.", "author": "Jun Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-01", "description": "Came here for drinks and was quite pleasant, so came for breakfast the following morning. \n\nThe bread/cake basket was really tasty and fresh. \n\nI had an egg white veggie omelet. It was sooooo greasy. Defeats the point of it being healthy! I then found some ham in my omelet (which I don't eat). I was so upset. \n\nI asked to speak to the manager and they were helpful enough and comp'd the whole meal, so we didn't pay. \n\nAll in all, without the rogue meat pieces, the food was still terrible. The potatoes my husband had were greasy and quite sickening.  Omelet he had was super greasy and cold.\n\nGiving them 2 stars for service and bar area. Food is tragic.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "Cheeseburger craving solved! Awaiting the next urge.\n\nAs for the cheesecake, big meh. It looked like cheesecake.", "author": "Peter N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Junior's is a place I frequented while attending LIU. The restaurant itself is pretty big; it has 2 levels, with clean bathrooms on the upper level. They have a counter in the front for take-out and cheesecake orders. Junior's is good if you know what to expect. \n\nThe times that I've eaten there, I've had to wait at least 5-10 minutes to be seated, even when the restaurant is not crowded. The servers are not particularly friendly, but, again, I know to expect this. \n\nI've ordered a little bit of everything off their menu. I've had griddle cakes, burgers, potato pancakes, steak burgers, and a bunch of other entrees I can't remember. Their food is usually greasy, but if you know to expect this, you won't be disappointed. Their beer-battered onion rings are greasy, but wonderfully disgusting.\n\nNow, the cheesecake is hit or miss. I have had their cheesecake on many occasions, tried a bunch of different flavors, and it is inconsistent. On some occasions, it's been creamy and wonderful, and on other occasions, it's been less than desirable. (Plus, who can forget the photo of the impostor rat in the window of Junior's, amidst said cheesecakes?) The memory of how wonderful the cheesecake is on some occasions keeps me coming back.\n\nI would recommend this restaurant to anyone in the area. I wouldn't go out of my way to come here for a meal. It is convenient in respect to location and their food is really decent.", "author": "Stefanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "My Dearest Darling:\n\nI will forever belong to you. And you will forever belong to me. Why did you have to be so good? Why? It's not enough for you to be a one-note Johnny. Oh no. You have to come in different flavors. Seasonal. Your tiramisu slices were perfection. I couldn't stay away. I even put most of you in the freezer... for later. Yes, that's it. Later.\n\nBut you called to me, as a siren, in the wee hours. Like a sleepwalker, I would obey. I am ashamed to say that I ate most of you frozen. And that I enjoyed every bite. Every creamy, delicious bite. I even licked you clean. And I would do it again my love.\n\nJust when I thought I was over you my Mom sent me your deviled food cheescake. For no reason. Some women use sex as a tool to teach their husbands a lesson. Mom uses online shopping. So I was the recipient of angry cheesecake. Thanks Dad.\n\nWe have to stop meeting this way. I have requested that the family no longer sends you to me at holidays. Although I secretly desire them to ignore my wishes.\n\nAll my love,\n\nMona's fanny", "author": "Mona M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "Junior's Cheesecake is the best I have ever had, and Drake would tell you the same. \n\nGrowing up I was never really a big cheesecake fan, but Junior's is too good to be true. \n\nI've never had any cake that has tasted as good. \n\nIt melts in your mouth so gracefully, and the flavour of it is rich and creamy while remaining subtle and not too overpowering. \n\nMy first ever bite triggered a release of seratonin in my brain.\n\nOne of the ingredients must be unicorn jizz. \n\nJunior's, like bacon, has the power to end war.", "author": "Devan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "CHEESECAKE!!!  Great food and great desserts.  I love Junior's!  I don't like the fact that the bathrooms are upstairs though.", "author": "Cobra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-17", "description": "You denied me a chance to immerse you in the orgasmic experience that is Junior's SO MANY TIMES.  \"Lactose Intolerant\" you claimed.  I didn't believe it, and I persisted.  Finally, you caved, and with ex-lax in tow, we indulged in the creamy sex of a triangle euphoria called Junior's Cheesecake.  \n\nOn the ride home, you farted so much, I could barely keep my cheesecake down.  I felt bad, like a cruel boy, for doubting your ailment.  But once you arrived home, you took a dump fit for a queen, and thanked me for taking you.  \"It was so worth it!\" you said.\n\nYou were worth it, my dexterous little sugar cookie.  I'd like a chance at a second bite.", "author": "Brutus A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "I discovered Junior's when I came to college --I am now 70 years old, having relocated to the great borough of Brooklyn-- so my take on it is very nostalgic, beyond their vintage-y vibe. \nJunior's cheesecake is just the best...period. Don't let anyone tell you otherwise! I prefer the classic plain, but the strawberry is delish, too. \nI have a few other menu favorites that are standards: The breakfast basket, brimming with fresh-baked assorted rolls and mini danish; home made corned beef HASH; pastrami on twin onion rolls...YUM. The last may be just a tad fatty, but, hey, It's pastrami. \nBut by far, what I like most about Junior's is the family that owns it. Over the last few years, as written up in the local media, developers offered $ millions to take over the property...and the Rosens (who I have never met) didn't sell out. Brooklynites sure do appreciate that dedication to our borough and rich tradition, as well!\nPS. Their location in the theater district in Manhattan offers a good nosh-before-the-show option.", "author": "Jeanette K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-12", "description": "Tomorrow  is my wedding anniversary ...and it is a weekday and we'll be both working .....so  we are celebrating it today Sunday.....  \nto start it of...we went to the 8:30 am mass ....then proceeded to good ole Juniors for a sumptous breakfast.....(my diet is derailed again...as usual..) ...but this time I went for Soft Scambled Eggs, Scotch Kipper with Onions, Grits, Fresh Orange Juice and  Coffee...I think its a healthy breakfast ...I have to get off the Pancakes and the dreaded bacon....Nashad with his usual order of 2 eggsover easy..home friesand toasted whole wheat breadw/ butter...no meat.....\n\nOn my way out ...this is where it gets rather hard....just to pass by and ignore all  the Sinfully delicious desserts.nicely lined up ...(.cheesecakes, cupcakes, bundt, cookes, pies and brownies )without stopping and getting something to go...gotta have  the Red Velvet Cheesecake....can't help it.....\n\nMy son gave us a gift card for dinner at a Thai Place in Bayside called BKNY.  Their food was great when he brought us there  the first time on  Mother's day.....I am sure I'll enjoy everything.........Bon Apetit........", "author": "Olivia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-21", "description": "I guess Im just a harsh critic, very hard to please when it comes to things I actually think taste good. Junior's is ehhh OK I guess ( I really mean ehhhhh). It certainly doesn't deserve rave reviews. I have certainly had better cheesecake from a regular ol' supermarket. I would NEVER EVER go back to Brooklyn for some of this sub par cheesecake concoction created in a rumored rat infested kitchen. Their red velvet cheesecake was below my standards- tastes like cold sweetened butter. Why Puff Daddy (or whatever he goes by now) sent the poor souls of Making the Band to get him some cheesecake is beyond me. I would have laughed in his face, got him some Entenmanns and called it a day. Save yourself the commute and get something better.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "I didn't come here for the cheesecake.  I don't even like cheesecake.  But my friend, Heather, visiting from California adores any kind of cake pretty much.  She ordered the original cake and was QUITE delighted by her choice.\n\nOur server, Sam, was AS delightful as Heather's slice of cheesecake .  Even at 12:30am, he was chipper as can be.  And we all know how hard that has to be working at Junior's.\n\nI wasn't even all that hungry, but I definitely indulged in the free pickles and beets.  Gotta love diners/delis and their pickles.  And then like an angel from heaven, Sam delivered a plate full of cornbread (that came with the chicken strips my other friend, Vonnie ordered???).  And although I despise anything in the cake family, I don't discriminate against cornbread.  \n\nDuring our late night feast, we were even serenaded with the familiar tune of \"Happy Birthday to You\" going on at the table across the way.  This party of grown folks decided it would be awesome to celebrate this person's birth at 12:30am at Junior's.  And to this Vonnie said:\n\n\"Monica, if you ever throw a party for me at Junior's, I will punch you in the face.\"\n\nYikes.\n\nOverall, a pleasant dining experience.", "author": "Monica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "Forget the cheesecake, I anticipate the pickle spread. As someone who will often crave pickled beets and appreciates Cole slaw without mayo, an eggsalad sandwich or any meat sandwich for lunch here is always welcome.  I have also hung out at the bar in the back (which is always packed with locals and never fails to entertain me despite the poor choice of beer).  Most people I know swear by the split pea soup, but I have never had it.", "author": "Suzi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-28", "description": "Opened in 1950, this is the original location and a true Brooklyn landmark. Everything on the menu - most of which merits only three or four stars - takes second place to the five-star cheesecake - thick, creamy, and rich enough to satisfy your sweet tooth for a week or two. It comes in a number of varieties and, if you're looking for something more fancy-schmancy than the classic plain, brownie marble swirl is your best bet.", "author": "Gourmet G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-16", "description": "i have no clue how this place got such a lofty reputation.\n\ni'd suggest you not order anything savory at junior's as i can assure you that there are over a hundred better dining options within a 10 minute walking radius of the establishment (read: their savory dishes are borderline disgusting).\n\nin my opinion, one shouldn't even think about going juniors unless they are literally standing in front of it (damn you dekalb station!). that said, they do have some good cheesecake... wouldn't make my top 3 or anything, but still tasty... idk, i'd rather go to the cheesecake factory.", "author": "Ricky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "I finally made it to Junior's...pretty embarassing as I am a life long \"Noo Yawka.\"\n\nIf there are 3 three things that Brooklyn has over the other other 4 boroughs its pizza, bagels and cheesecake!\n\nThis cheesecake is damn good...and I have had some mind blowing slices in my lifetime. For $5.95 you get a huge slice of plain cheesecake. It is so creamy and has a delicious crust. Worth the price tag, as this is a staple of Brooklyn.\n\nThis particular location is the original store, and has been around since 1950. The cheesecakes here are so good, that in 1983 when the place went on fire, people stood outside this blaze yelling \"save the cakes!\"\n\nI also tried the German Layer cake, and it was also a mammoth slice. They charge $5.75 for this dessert, but it was so good that I gave half to my friend. It is chocolate cake layered with a filling of walnuts and coconut. The icing is great too. I have had better German Layer cakes, but again I was solely here for the cheesecake.\n\nI have not tried the restaurant, but anyplace that serves tongue on the menu must be good. Go here though for a slice of heaven, and worry about the calories and fat content later.", "author": "Andy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "We had ten minutes before we needed to be at the movie theatre to see Harry Potter and we wanted a quick dessert...what better than Junior's? We got the strawberry cheesecake to go. I normally don't like the strawberry jam-like stuff on top, but this was pretty good. The cheesecake itself was rich and creamy without being too heavy or too sweet. \n\nFinal evaluation: good cheesecake, nut definitely not the best I've ever had. I think Cheesecake Factory's cheesecake MAY be better, for a mass-produced cheesecake.", "author": "Zainab N."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}