{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "This is a place known for it's cheesecake but it's actually a diner styled restaurant/bar with a full menu and tons of seats. \n\nI'll give 5 stars for desserts, 3 stars for the service and food. 95% of the people who work here are Indian (I'm not saying there's anything wrong with that but it's very unexpected especially for the area). The service is generally no so attentive and never noticeably friendly and the food is pretty mediocre (I would advice against anything fried unless you love tons of greasy batter). The one good thing is that if you do come here for a meal you get free cornbread which might not be authentic but it's certainly addictive. \n\nMany call this place the originator and the king of cheesecake, the place that makes NY famous for the cheesecake. I can't say I've had better cheesecake, the consistency and taste is perfect. The only thing I'm on the fence about is that the bottom is not the graham cracker crust you might expect but a thin slightly soggy sponge cake. I'm not a big fan of this but I realize that it helps the smooth consistency of the cheesecake stand out without screwing that up with you having to chomp down on some thick crust. If you go during the fall they have their seasonal pumpkin cheesecake, if you like pumpkin you will love this. They have a huge list of desserts that are half cheesecake-half cake in one slice which is cool and they also have a huge selection of desserts that aren't cheesecake if that's not your thing. But going to Juniors and not getting some sort of cheesecake is like going to Nathans in Coney Island and not getting a hot dog. \n\nThis isn't the best area of Brooklyn so I wouldn't stroll around and explore the area but it's fairly easy to get to via car or extremely easy via subway (it's directly across the street from the DeKalb Ave B/M/Q/R stop)", "author": "Matt E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-05", "description": "The redeeming factor for Junior's is definitely the cheesecake. Don't come here for anything else-- without the cheesecake, this restaurant is simply a transplanted diner with overpriced, shoddy-quality diner/ Southern comfort food that will escalate your cholesterol levels to new heights.\n\nPortions are huge, and the quality is mediocre at best. We also ordered the buffalo wings, which were cardboard-y, and the celery was wilted and rubbery. Seriously, folks-- how do you mess up celery?!\n\nThe service is slooooooooow. Don't expect to have a quick meal.\n\nAnd there are people in the Denny's-style restroom to dry your hands for you! Do you tip them? Because this is certainly NOT the type of restaurant where you'd tip the busboys at the bathroom! \n\nIn short, if you want Junior's cheesecake, you're better off getting some at the stand at Grand Central. It's not worth the trek out to the restaurant in Brooklyn.", "author": "Debora L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "This place is mediocre, at best.  Average food, average cheesecake - it's a tourist trap and the service reflects that they are not worried about losing customers, because their name will continue to draw tourists who don't know any better.  I have been there in the past and was underwhelmed, but now I live in the neighborhood and on a recent \"snow day\" I went there with my boyfriend at about 4pm.  The place was pretty empty as far as customers go, but several staff were standing around.  Even with this ratio of staff to customers, no one greeted us and we didn't know if we were supposed to seat ourselves.  We asked the guy behind the cheesecake counter how to get a table, and he directed us to a man standing 20 feet away staring at us.  Hello, do you want us to come in and spend money here or not?  Anyway, after we got seated we were ignored - no water, no \"hello I'll be your server,\" not even an \"I'll be with you in a minute\" - literally nothing.  After maybe 5-7 minutes, we finally got water, but still no greeting (remember, the place is pretty empty...).  A server walked by after a few more minutes and said \"Do you know what you want?\" as she continued to walk by on her way to deliver something to another table.  I could understand if it was super busy, or if they were understaffed due to the snow storm, but there were servers standing around chatting because they weren't busy at all.  We decided to get up \u0026 leave and take our snow day money elsewhere.  When I tell people I live in this neighborhood, they often ask \"Oh have you been to Junior's?\"  Now my answer will be \"Yes I do, and I will never go back.\"", "author": "Katie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Okay, those people who said this place is pricey must have just flown in from another state, because nowhere else in NYC will you get this amount of food for about 11-15 bucks a person if you get a meal and dessert.  They start you out with free pickles, beet salad, and cornbread. The plentiful menu has close ties to the Jewish and African American communities in which the restaurant flourished--so you find challah bread sandwiches along with catfish. All very affordable, most plates between 8-13 dollars. Their 'green salad' is huge and comes with eggs, chickpeas, broccoli, olives, lots of fresh veggies. The various types of cheesecake are friggin' enormous, almost a 1/4 of a pie, for 6 bucks. Chocolate moose, strawberry swirl...mmm....come on, folks, let's be honest about pricing in New York.  Except for McDonald's, there's no place where you can get a full meal for $5. Junior's gives you heaping servings plus lots of freebies for about 10.   Junior's is a must-go-to Brooklyn classic with kitschy but oddly endearing decor--think Applebees but with less of that chain restaurant feel. . I've always found it to be clean, the spaciousness and brightness make it a fun place for groups of reuniting friends. \n\nRecommended.", "author": "Colleen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "This is IT!  The real Jrs. - not the \"poseur\" outpost in Grand Central.  GET THE CHEESECAKE - the food is OK, but man, they really do make a tasty, rich cheesecake.\n\nThe strawberry one is great!", "author": "Karen F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "My love for cheesecake will probably surpass my love for my future off springs. I love it so much that I even have cheesecake flavored lip balm. Instead of the traditional sheet or ice cream cake I always have a cheesecake on my birthday instead. \n\nI've never been to Juniors but on my 22nd birthday as a surprise I had devils food cheesecake shipped all the way to my house from Juniors. And just recently my sister's friend brought her back a WHOLE raspberry swirl cheesecake. I'm not a fan of fruits in my dessert but the cheesecake filling was amazing. Both times I had it, the cake was dense, rich and super creamy. No need to chew, it will seriously just melt and dissolve into your mouth. It's incredible that both cakes had traveled more than 2000 miles and still tasted delicious. \n\nNow my only complaint is that both cake lacked the graham cracker crust I love. Come on, the graham cracker crust is what makes the cheesecake complete. It's like having a cupcake with no frosting or a donut with no glaze. It just didn't taste right. I guess you can't have everything in life.", "author": "Ha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "It's all been said before, but here's my contribution nonetheless:\n\nJunior's is a Brooklyn landmark.  They have heavenly cheesecake and a monstrous menu of delicious deli/diner fare from sandwiches piled high to breakfast all-day.\n\nThere's nothing bad you can say about this place.  It's a hearty meal with gracious service; a time capsule from days gone by.  It's where my mother had her Sweet 16.\n\nIf you haven't been here yet, don't delay.  It's one of those things you need to add to your NYC Bucket List.\n\nAnd then go back again.", "author": "Scott J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Junior's is another New York staple that i'm ashamed to say i had never tried until recently.  Although the allure of this Junior's deli is the Cheesecake - I was here for a lunch meeting. The ambience itself is nothing special - a dinner but it's comfortable enough. When you sit they bring you sour pickles, cole slaw and warm rolls. I'm usually a big cole slaw fan but the slaw here is nothing special either.  For my meal i had a half brisket and half pastrami sandwich on rye - and they were actually pretty good..... the meat was tender and lean (i hate when the meat is chewy and fatty)..\n\nFor post lunch - of course we ordered the traditional cheese cake and daaaaammmmmmnnnnnnnn... Mmmmm it was excellent 5 stars!", "author": "Dew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "I've been coming here since I was a kid. This place has my favorite cheesecake. But it's not for everyone because it's a bit sweeter than most other cheesecakes. But that's why I like it. I love the fact that it's so sweet and creamy. My problem with this place is the area. I'm not in this area much lately. And the last time I drove past Juniors, I so wanted to stop and get a piece of cheesecake. But since I'm not in the area much, the traffic and parking were too chaotic for me in this area to even stop at Juniors, I was sad because I don't know when the next time I'll be in the area.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "We've visited this diner twice in the past month, and the service was friendly and the food was good both times. If only we lived closer....", "author": "Eugene D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "I've been in here before but since I don't eat cheesecake. (Gasp, I know I'm weird) I settled for the Strawberry shortcake like I always do.\n\nThe strawberry shortcake was ALL whipped cream.  I opened the box and was wondering where the hell was the cake at?\n\nMy boyfriend had the ever so famous Strawberry cheesecake though.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "You can say you are coming here for dinner but you're lying! Tell the truth! ITS THE CHEESECAKE!!!!!!! But if you do come for the food its pretty good too and the service is excellent! The cheesecake goes without saying and every real New Yorker will tell you is legendary!", "author": "Joe E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "The five star rating that you see here is dedicated entirely  to one particular dish at Junior's. No one EVER raves about the french toast so I will. Crispy on the outside, soft doughy and golden yellow inside-their french toast is served in four thick, beautiful slices, with a tiny cup of melted butter for drizzling. The warm maple syrup and dish of spiced baked apples and raisins that accompany this deliciousness are a welcome accompaniment (I pick out the raisins!) I always order  this scrumptious dish with the slim but juicy turkey sausage links and a tall glass of milk. After that, I'm good till dinner time.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-23", "description": "I was in NY a couple of weeks ago and came to Junior's ONLY for the cheesecake. I brought a double chocolate mousse cheesecake, as well as the red velvet. It kind of fell flat. I was preparing myself for the best cheesecake of my life and it was just OK. I would definitely give it another chance the next time in in Brooklyn, maybe I'll get to taste the hype.", "author": "Ellena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "Junior's is an institution. It's the home of the egg cream, and the cheesecake is the best cheesecake. Don't look for health food here -- but it's the greatest for what it is. I recently tried the potato pancakes for the first time - enormous, dense, deep fried onion-potato patties served with surprisingly delicious chunky apple sauce and good sour cream. Also surprising was the value: it lasted two people two meals.", "author": "Sarah F. H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-29", "description": "I debated on giving it 1 or 2 stars. The customer service is what garnered the extra star. The food is GROSS. Let me repeat... The food. Is. Gross. I ordered soup. It was totally from a can. I couldn't eat anything else really because they have no healthy vegetarian options. I won't ever go back.", "author": "J Danielle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-06", "description": "Kicked it at Juniors after watching a Broadway show.  It looked pretty dang crowded by the time walked right across the street to Juniors.  Fortunately, it was only a 10 minute wait for my cousin and me.  The place has a bit of a retro diner feel to it.  We both scarfed down our solid bricks of strawberry and raspberry cheesecakes with satisfaction and headed off. \n\nNow with cheesecakes, it's always the \"after-party\" in my stomach that judges how good it is.  Sometimes the party in my stomach gets a little too crazy and I don't feel so hot.  With Junior's cheesecakes, the party in my stomach was all about joy.  No drama at all.\n\nMy stomach and I give 4 stars to Juniors.  Service was quick and easy.  They brought out a French speaking waiter to our neighbors who were probably French tourists who did not speak English because all I heard was a bunch of zhhzhhzhzz sounds of French words.", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "I only ordered the Red Velvet Cheesecake but I would gladly travel here (I live 30 min away) just to have it again. It's pretty much perfect.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Gotta love Juniors - outstanding food and legendary cheesecake.", "author": "Agent Mulder .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "My wife and I are Los Angeles based but planned our wedding in Brooklyn for Labor Day weekend. Needless to say we had a very difficult time finding a bakery in Brooklyn that would deliver to our venue for a reasonable price, that was open the day of our wedding or that would even call/email us back. Junior's took all of our wedding cake headaches away. I didn't need a cake tasting because I had already had it, I'm obsessed with cheesecake and they are way more affordable that any bakery in Brooklyn. We chose 6 different cheesecakes, they delivered on the day with no problem and people are still raving about it!", "author": "Emily H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}