{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "2 Thumbs up: I stopped by and grabbed two slices to go; one pineapple \u0026 coconut slice and a chocolate fudge slice. Both slices were great! The customer service was surprisingly good. I was greeted and received the cakes promptly with napkins and utensils... Definitely would go back and try other slices. Side note: I didn't have to walk from Manhattan (insider)", "author": "Allen T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-11", "description": "Overhyped cheesecake. While the cheesecake was probably around a 3, the service and employees were so bad I can't justify giving them more than one star.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-18", "description": "Only basing this review on some takeout strawberry cheesecake we had.  It wasn't very special to me, far too rich and creamy (yes, there is such a thing) and it was pricey ~$8.  The strawberry sauce on top didn't do too much for us either.  \n\nI've had much better cheesecake at the Cheesecake Factory.  Parking is difficult to find as well in this area.", "author": "Crystine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Always love a good cheesecake from juniors . My fave is the red velvet. Got the red velvet for a coworker's last day at work and it was a big hit. My coworkers have since brought two to work to celebrate lol", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Went for the cheesecake.  Definitely an original!  It was rich, creamy, and not too sweet.  The crust is like a butter cake with slight hint of citrus as opposed to other places' graham cracker crusts.  \n\nA delectable treat and classic to check out if you're ever in town!", "author": "Amnaj B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "I have only dined here once maybe a dozen years ago- a memory too distant to fairly compare. Junior's, if course, is widely known, and therefore must provide a certain minimum expectation to get past the minimum mark of one star. In one sentence: slow, neglectful service, except for the waiter's lip service that he's \"here for me,\" and tasteless, poor ingredient food. \n\nSome detail: I ordered the \"steakburger,\" which is a totally inappropriate use of the term as this was clearly the lowest grade chuck meat, and needed flavoring or at least SALT. It was cooked longer than necessary for my asked \"medium-rare,\" and was not hot enough once our table was plated(probably because it sat on the window waiting for the slow, incompetent waiter to pick up). The fries were surely sourced  from a frozen artificial means, and also could use SALT or some flavor to their bodiless nutrition. \n\nNow, I ordered the original cheesecake to experience their gold standard \"tried and true\" product, and was underwhelmed. The thin layer on the bottom (cookie crumb crap?)distracted from the flavor of the overall cake. The uppermost layer was too stiff as if somehow left in the fridge too long and even a good amount of tapping with my fork would not break it's skin. I can't totally scap the cheesecake, because it was \"au-aight,\" but the consistency was not uniform; to use an analogy of earth science and rocks, it felt like my mouth was tearing into sedimentary layers of different rock types instead of the delicious customary single layer of sand. Ok, not a great analogy, but some of the cake was stiff and dry, while other parts seemed creamier. It just felt like they did not care to love their signature product.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "Yesterday like most birthdays my co-workers and I bought a Junior's cake to celebrate the birthday of a colleague. We have purchased countless cakes from Junior's and expect nothing but fresh, tasty cake no matter the flavor. What a disappointment when a carrot cake purchased yesterday turned out to be what we've dubbed \"blizzard cake\". This dry crumbling cake was sold to us in what was an obvious attempt to sell cakes were not sold the post-Christmas blizzard of 2010. \n\nOne colleague returned to the restaurant with the dry cake and requested another. One salesperson offered to 'go upstairs' and bring down a fresh cake. A second person behind the counter, a female lied to him and told him that fresh cakes were already available behind the counter. \n\nThis second cake was worse than the first cake. Three of us returned to work today complaining of going home with 'issues'. The cream cheese icing tasted like a refrigerator and the cake was just as bad as the first. We called and were told we could come back for yet ANOTHER cake. Really? Are you kidding me? How desperate and low does an establishment have to be to sell cakes that are obviously over a week old.\n\nI've always enjoyed their brunch and would treat myself to a slice of cheese cake now and then but after this experience it will be a long time before I trust the losers that work at Junior's.", "author": "Sabrina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "The legendary Junior's.... Been going here for as long as I can remember! From High school basketball dinners to just grabbing a slice or small plain cheesecake for my mom just before heading home. Going back recently after so many years a few things have changed.. Its busier... Wider range of food selection but primarily still \"down south\" cuisine.  But two things I know haven't changed is how rich and savory the cheesecake is and the long @$$ line you have to wait on to get one... Lol All in all if you are ever in Brooklyn is a must place to visit!", "author": "Ralph D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "It's all pretty mediocre here. Big portions of basic food. Looks as if time stood still inside, but there is no smell that usually comes with places that still look like this. I found that kind of cool. Obviously they maintain it pretty well, just don't change the way anything looks. \nAs far as cheesecake, it was kind of different that any cheesecake I've ever tried. It was so soft almost melting like cream. I'm used cheesecakes that are more dense, and after trying this one, I still prefer the dense ones.  If I come here again I'll grab one to go, But a plain one without all that artificial looking bomb on top that was twice the size of the cheesecake below it. \nPlace is funny. Ironic. Kitsch. Worth passing by at least once just to feel like you took part in it. It's nice that it's so big and can accommodate many people. They stay open until 1am on weekends, but the area outside, although well lit, still doesn't feel that safe at that hour.", "author": "Maria B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "The restaurant looms large my personal mythology and, as a displaced NYer stuck in Texas, I was SO looking forward to a slice of this on Christmas.  If you use their mail order service, take screen shots of every component of your transaction, because not only will your delivery not show up as requested and paid for, they'll not refund your expedited shipping costs, argue with you about the date it was to have been delivered, and they won't even apologize for their mistake!", "author": "Dev S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "The real deal American place...we came in for the dessert but the food looked great. Espresso was real and the cake was amazing", "author": "Gil V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Huge menu! The small sandwich rolls are so good--everything is good. The cheesecakes are uniformly the best in all flavors. Go at least once in your lifetime.", "author": "Marian P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "A Brooklyn classic. They have something for everyone and the cheese cake for dessert. The servers are a little whacky but it adds to the \"charm\" of the place. Very good pastrami. Plenty of seating. Classic Brooklyn.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Very  nice  waitress. Sides  come  fast  and  drink.\nCoffee is ok. Good old  school  jazz. Good  \nPancakes. good waffles. Quick food.", "author": "D R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Expect to pay dinner entree prices for a Reuben sandwich,  but also expect it to be very tasty and large enough to share,  especially if you'll be getting a slice of their famous cheesecake,  which is a must.   The cheesecake is also pricey,  but true NY cheesecake.   Service is friendly.   Ambiance is like a diner with 1950s music.   The bathrooms are big and clean,  unusual for NYC.  The only reason we can't give this one five stars is the Disney World prices.", "author": "Chasen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Just like those who have reviewed Junior's before, this is the quintessential Brooklyn stop for tourists and some of the NY residents alike. I've gone here several times over the past year and it has not let me down. Most recently, we took guests from VA here this past Sunday and they were not disappointed. We had a party of 10 and needed a table stat. We were seated by 1230 no problem!\n\nTo start, you get the complimentary cornbread/rolls. The cornbread is sooo good. I can't remember the last time I had cornbread so moist but not overly greasy which tends to be the case. Excellently done in my opinion. We all proceeded to order separate things but I got the Southern fried chicken breast with mashed potatoes and fries. This again was good and very satisfying. I've had better in the South but this hit the mark for my craving of fried chicken. \n\nWhat I loved was what Junior's is well known for, their cheesecake. I ordered the apple crumb cheesecake and it was rich and crunchy and smooth and delicious and orgasmic. And I mean every single word. I tried to leave some to take home but I devoured the entire thing there. Extra calories be damned!\n\nOverall, my guests were happy eating at Junior's. Consider my a regular there anytime I'm in the area!", "author": "Emile G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "I only had the strawberry cheesecake.\n\nAnd for the rest of my life, if I ate the cheesecake at Junior's, I'd die a happy man.\n\nThe cheesecake is perfect here. Dense but light, sweet but not too sweet, fluffy but solid enough to give that cheesecake texture, and light on crust but still enough to make you know its there. Strawberries were light but sweet enough, and huge, covered in a glaze that wasn't too sweet either. The crumbles, whatever they are (cracker? butterfinger? candied nuts? not sure) are perfect finish.\n\nSeriously folks, best NY cheesecake. Bit on the pricey side ($20 for small size, but big enough to serve 4-5 people), up to $60 for a 20 slice wonder, but its worth the cost.\n\nLEGIT.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-17", "description": "Ehh I mean it is Junior's if you are coming here for the Cheesecake then alright it is good. I know there are times when I do have a craving for it.  My slice of choice is the strawberry cheesecake YUM YUM !! I have never had any of the others so I cannot speak for them.  \n\nI have had lunch here twice and the food has been alright both time there were no complaints from me.  The 3 stars is mainly because I feel that they are overpriced. Yes they give you a good amount of food with your entree as well as the free bites before your meal but the cheesecake is expensive as are their meals.  It is something that for me the quality of the food I only would eat here once in a while.  Will I be back sure probably because I would get the cheesecake but am I running through their door ehh nopee not even close", "author": "C F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I can only speak to Junior's desserts as we haven't made it in for a meal yet...but wow, their desserts are incredible! They have various pies, cheesecakes, cakes, and other bite sized treats to purchase. Our favorite is the strawberry shortcake which is massive (serves at least 2!) and has the best homemade whipped cream along with it. A bit on the pricey side but a few bites in and you'll forget any reservations you had regarding the cost!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "For the past 18 years, I keep going back to Junior's simply for the cheesecake! It is simply the best! I have tried a range of cheesecakes from many different restaurants and none compare to Junior's. It's the BEST!!!!", "author": "Donna B."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}