{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "I've never eaten here, but I've gotten the cheesecake to go.  Although I usually prefer cheesecake with graham cracker crust to add some texture, Juniors' filling is the perfect blend of tangy cream cheese with just the right amount of sweetness.  The hint of lemon flavor in the cakey \"crust\" adds a nice citrus note to cut the richness, and it's just a perfect bite.", "author": "Meredith F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Fantastic, enjoyed the cornbread muffins.   I was dissapointed to find out the Times Square location does not serve them.", "author": "Dawn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Love their cheesecakes!!!  Even plain cheesecakes are the best.  Other items are very good as well.  I tried their grilled salmon a few times.  Delicious.  Go there.  Will not be disappointed!", "author": "Ester B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "so i've dined in here twice and both times the service was average, not superb, but not horrific. if i was reviewing jr's for their dine in service and food quality, i'd prbly give them a 2.5  to 3 stars.\n\nwith that said, my review is based on taking their OH SO YUMMY cheesecake TO GO. hot damn, if you're going to splurge on cheesecake, jr's is definitely a good spot to hit up. it's densely creamy and rich, just the way artery clogging cheesecakes are suppose to taste like. i've also had their red velvet cake, which was equally tasty. jr's is a good spot to pick up a cake and take it to a dinner party as your dessert contribution. you'll definitely score good points with the other dining guests.", "author": "Sherilyn T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "Incredible ambience, great staff, huge portions but the famous cheesecake simply isn't that good. I eat here from time to time for the feel, not for the food. It's a real neighborhood institution, which I value particularly as this neighborhood goes through monumental changes. Nevertheless, the kitchen is clearly not the top priority. I'd love to see Junior's put some oomph behind their mouth-watering menu.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "This place is a classic, especially the original one in Brooklyn. It has that old time feel as soon as you walk in the door too. The menu is looong, so I'm sure you'll find something you like. We just came for cheesecake, but ended up getting a couple sandwiches as well. They start you off with complimentary pickles, pickled beets, and cole slaw. All good. The service was a lil slow, but he was very nice and apologized. I had the fresh roasted turkey on wheat, he had the beef brisket and pastrami on challah. They were about $12 each. His came out hot and was very yummy! The mustard they have was spicy and delicious. My turkey was a bit dry, but nothing a lil mustard and mayo couldn't fix. The topping on the cake (pun intended) was definitely the Cheesecake! Omg...I didn't think it was gonna live up to all the hype, but it did. We shared the red velvet and the carrot cake. The red velvet was very good, but the carrot cake cheesecake was ORGASMIC! I'm sure I'll be craving that again at some point and drag my butt to Brooklyn again.", "author": "Ninni N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "Incredible plain NY style cheesecake. Customer Service...not so much.", "author": "Lita J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-07", "description": "Old, dated and overpriced. living off their past reputation. The food is average. You can see no money has been put back into this place. The staff act like they are doing you a favor to serve you. The only reason to go there would be to say that you did eat at the original Juniors.", "author": "Dom M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-24", "description": "I am happy to say that I ate here. I've heard so much about it and seen it on TV, so it's cool to know that I've been there. The food was fine. I wasn't blown away by any of it, but it was tasty with nice portion sizes. Our waiter, Winston, was funny and personable. I feel like I missed the boat because I didn't get any cheesecake. We went for breakfast so it was all griddle cakes, omelets, home fries, and pastries. The coffee was delish too.", "author": "Gia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "This is an after BAM late night treat, where you can often see the performers turn up to chow down and chill out.  I am very sad they have taken their borscht off the menu.  It was excellent.  But the rest of my favorite meal is still available: Something Different--brisket on potato pancakes. Fabulous!  and then a Broadway ice cream soda, no cherry.  So perfect.  Just the fact they have a named ice cream soda that delivers coffee ice cream and chocolate sauce won my heart.  The waiters are great, the diner atmosphere welcoming, late night, Sunday Brunch, a must go-to before or after any BAM performance....", "author": "Harley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "I am allergic to strawberries. Despite this, I always get the strawberry cheesecake. It's that good.", "author": "Timothy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "The cheesecake was the perfect topper to the fried shimp plate!  Only downside of Junior's is the gigantic servings!", "author": "Pat M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "OMG! I can't believe I actually found a place whose food actually stood up to the hype. The cheesecake is devine and will redefine what you consider a quality dessert. The strawberry cheese cake and rassberry cake was excellent and I highly recommend it....oh and surprise! The beets are rediculously deliscious.", "author": "Barney S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "This review is based solely on the plain slice I ordered through take-out.  I went in, ordered my cheesecake, paid, and left. Thereafter, I dove into the most delicious slice of cheesecake I have ever had. So delicious was the slice that I barely even noticed the lack of crust ( I'm partial to graham cracker crust). The texture was rich, thick, and just plain good! I will be back to try the chocolate mousse cheesecake I heard so much about.", "author": "Candice B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "The best cheesecake ever!!! I never had the food but no one I know goes for the food just for the cheesecake which I love that is what the 5 stars are for. It is pricey cheescake but the slices are big. The plain with strawberries on top is insane. The other flavors are good but my favorite is the strawberry cheescake by far!!! Can't live with it!!!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "I've been a long time fan of Juniors...not b/c of the selection of cheesecakes and other tasty desserts. Their food menu has gotten so much better! Had the jerk chicken and it was sooo on point with the rice and collards. OMG!", "author": "Chante R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-12", "description": "Juniors is best representation of food in NY overall: It is OVERRATED and big tourist trap...buisnesses here take advantage of being in NY and focus more on attracting easy to trick tourists then actually working to make good food. \nCame here because I just moved here, and as with all the other \"BESTS\" NY has to supposedly offer I was dissapointed.\nFirst off this was horrible cheesecake, I mean what kind of place has the best cheesecake and yet has the worst crust I have ever had?? The crust was some thin layer of flavorless dry cake, it was disgusting...chesecake is not complete without a good crust so this place failed. The actual cheesecake was ok...not as smooth as I like it...I have definitley had better in the city. Also didnt like the lack of good flavors, like I wanted the strawberry but it had a pie crust so was more like strawberry pie...\nSecond the food was also pretty bad. They brough corn bread which was dry, gritty and tasted old. We ordered lots of stuff just to try everything, everything tasted like cheap quality crappy diner food...definitley not worth the prices that would make you expect good quality stuff. The calamari was dripping in oil, and had a gross flavor I think its the oil they fried it in maybe wasnt so clean. Matza ball soup...it was my first time trying it and I think its one of the worst things I have ever ate. Potatoe pancake was flavorless. I dont eat lots of fried stuff, so this was a big dissapointment and waste of calories.\nService: The WORST I have ever experienced, we sat 20 minutes no one came. Finally came took 20 more minutes to get drinks, and the place was pretty empty and we were the only table this guy was waiting on. There was staff members just walking around, a manager was just sitting folding napkins, whenever we flagged someone down instead of helping us they would say they were gonna go get our waiter and we would be left waiting for another 15 minutes until he would come WHILE the same staff members were just walking around doing really nothing, I mean the manager was just standing right across from us doing nothing.The guy brough us some weird pickled stuff, forgot the bread. Our food came out seperatley not together, like dish by dish...took forever. Forgot some side sauces, and he took forever to bring it out. Really BAD service and I am not uptight about service.\nVibe: Place felt dirty, tables were sticky and it smelled dewy. People here were shady characters I would say, like I wondered how they could afford the prices, definitley not an enjoyable crowd to dine with.", "author": "Zara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "OK- I am gonna be the freak here and not give it 5 stars for the cheesecake, tho that was decent.  (Canters in LA about the same)  The 5 stars is for the BEST pastrami I have ever had.  And yes this jew-gal has had her share from coast to coast.  This even puts to shame my beloved Izzy's in SM.  Well priced, but everything (EVERYTHING) is ala carte.", "author": "Jen-Jen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "Junior's is one Brooklyn institution that lives up to the hype.  It's just a shame that most downtown Brooklyn institutions like the Paramount, the Fox, and scores of other old school theaters have not survived along with the maker of one of the best cheesecakes anywhere.  Still, as \"old\" downtown Brooklyn continues to die a slow death and transforms itself into the Ratner City Space Station, Juniors will remain.  Don't even BOTHER trying to procure a cheesecake on the eve of a big family holiday.  Not going to happen.  The lines are three deep...now that's girth (lil inside joke for those who remember me misusing 'girth' in the Mark W. post)!  Best part about Junior's is that the cheesecake isn't the sole reason to eat here.  They have a pretty impressive diner menu that includes an enormous hamburger that would easily fill the most bottomless pit of a belly.  The portion of fries served with a deluxe is generous, and even gratuitous given the size of the burgers.  More than anything, I find the wait staff incredibly kind and accommodating given the daily pressures they must encounter with the sheer number of customers.  Our waiter returned no less than 5 times...and not in an annoying manner, to make sure we had everything we needed.  Also, if you have room, don't pass up any of their old school diner classics like a milk shake or a cherry lime rickey...Junior's blends them all to perfection.  Just do yourself a favor, and make it to Junior's before you die.  Travel with that \"Death or cheesecake\" spirit, and your meal will be that much more satisfying.  Personally, I prefer cheesecake to death.\n\nP.s. What was that guy talking about a few reviews down...you know, the guy who was disappointed that there was no sour cream on his cheesecake (WTF!!???!!).  Poor guy.  He's probably been putting cream cheese on his baked potatoes for years!", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-01", "description": "I would not go again for the food.  Indifferently prepared with merely acceptable ingredients.  We went for breakfast on Easter morning because the restaurant we preferred wasn't open.  Service was reasonable.  The cheesecake (which I did not have this time) is wonderful.  Eat somewhere else and go for dessert.", "author": "Barbara S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}