{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "I will NEVER return to this Juniors on ANY of my trips to NY ! For starters the cheesecake was mediocre at best. The worst part was how rude the employees where. We didnt notice that restaurant was closing because we where just sitting there talking and joking. We did tell our server we wanted a whole strawberry cheesecake to go but we where told it had to be requested at the front. So at 2 min past closing we go to pay and thats when we where told we could not buy a whole cheesecake, it's to late. Now here we are standing at the cash register NEXT to a freezer full of cheesecakes and we are told it's to late. We where already INSIDE and we where already paying. On the plus side had this not happened we would not have gone to the \"Canoli King\" amazing place and their cheesecake was OFF THE CHAIN !! I can cross Juniors off my list and add Canoli King. My next visit will definitely include them!!", "author": "Lexi S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-18", "description": "Poor customer service over the phone. When you call to place an order you better make sure that you speak to someone who wants to work because they will transfer you or hang up on you. Mind you, I am ordering from a building with alot of workers who go there. Disgusting and disappointing!!! And why is the price of a slice of cheesecake so expensive!!! Every 5 months it goes up a quarter, wth!! Not going there anymore.", "author": "Lana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "I took My Husband Jim here , it was his 1ST. Time at Junior's. Brooklyn is the best place . We had a great time...", "author": "Pearl A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Rarely dine in here cause there's never parking, but went shopping after work and ended up last minute meeting a friend here. Great laughs and food.   Our waitress recommended the rum punch.  which had some very visible rum atop the drink.  Buffalo wings were finger licking good.  Waitress recommended the Jerk chicken which looked amazing.  My friend said it was great and tasty.   Shrimp Parm was ok, then shared a Blueberry cheesecake and order some extra cheesecake on the way out.", "author": "Patricia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Based on take out - cheesecake only\nThere is no other cheesecake in NY like junior's\nNo matter where I go\nWhat I try...it doesn't compare\nI got the usual classic- plain cheesecake. Dense, smooth, silky, creeeeeeeamy, excellent. Classic ny cheesecake. almost $8 for the slice and I thought...eeeesh but totally worth it\n\nNow they also have other cheesecake options\nAnd I also got the chocolate mouse cheesecake which is also EXCELLENT\nThe chocolate part feels like cheesecake but it doesn't have that tang\nIt's silkier and smoother \nUgh. I want more of these two slices.\nMOOOOOOOOOOOOOOORE", "author": "Bubble T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Went to a show at bam and stopped in for a late night meal \n\nSalad was average nothing special \n\nNew England clam chowder was superb\nBread basket very good rolls tasty and fresh cornbread superb\n\nThe cheesecake is the star here we had the carrot cake cheesecake which imho is the best of both worlds.  It was great but I'm sure any cheesecake you get here will be stellar \n\nService was very good", "author": "Alex P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "A classic place in Brooklyn; great burgers and amazing cheesecake; also right next to  Albee Sq for the shopping lovers.  Some tourists for sure and yet still many regulars who were nice enough to chat with us about the history of the place. Our waiter was super nice and efficient. We had a good time. Watch out for the size of the plates; they are huuuuuuuge and way bigger then what we are used to outside the US so either share or prepare to roll your way out of the place ha! Ha!", "author": "Sylvie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "One slice of cheesecake here equals three slices elsewhere, and it is pretty good. The same portion rule goes for all their entrees, however the entrees didn't not meet the same flavor standard like the cheesecake.  Just come here for the cheesecake people!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "We waited for a long time while two servers, a man and a woman, joked around looking at shoes on their iPhone. While our original server was nowhere to be seen. We were ignored and asked for a manager to three employees while each claimed to not know where any of them were. This angered us greatly and we left after waiting for a half hour with no assistance after being seated. Avoid this place. They don't care.", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "It's a huge diner in a cute neighborhood. They are traditional and portions are very big and fulfilling. The staff doesn't care about you and I guess that is normal for old ny diners. Even though Food is mediocre, I think I'd go there again. And I really like the corn bread and pickles they bring as appetizers", "author": "Emine A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "We really like coming to Junior's. The food is always good and so far our servers have been nice. But it really needs cleaning and some paint. The up-keep is well over due.", "author": "Kamalani M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "SO good.  SO, SO (yes, twice people) good.\n\nI don't know what it is, but I've had this unescapable craving for their grilled cheese lately.  Does anybody nail toasted challah bread with melted american cheese better than Juniors?\n\nOF COURSE NOT.\n\nIt was a rhetorical question, silly pants!\n\nI didn't mean that - I'm sure your pants are really nice, BUT we're getting off topic.\n\nJuniors is SO, SO good.  It's got that perfect, old school diner feel.  All they are missing is a jukebox.  Don't sleep on their mac and cheese, matzo ball soup and of course, their bomb desserts.  \n\nLove this place.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Must stop in Brooklyn. Could not go pass this restaurant without stopping. Delicious food. Great staff. Delicious cheesecake", "author": "Tammie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "My family had been getting cheesecakes from here for as far back as I can remember. They are the absolute best in New York always consistent in flavor. The restaurant is also great they have a large dining space and are able to accommodate large groups even in busy holidays we came in on Mother's Day with a group of 7 and we were seated very quickly. The food was also great they have breakfast all day and the staff was very friendly.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "I finally checked on my bucket list Junior's!\n\nI had an impromptu dinner here, before going to see show at BAM, and I am so glad I dined here.\nThe friendliness of the my server, and the overall atmosphere of the place made my week! \n\nThe place is pretty big, but me and my friend decided to sit at the bar stool close to the entrance. From there we had a prior view of the kitchen, the take away area, and almost the entire restaurant. The place is homie, really clean, and every servers/waitress is relaxed, chatty, and the same time pretty fast.\n\nWe ordered a grill cheese and a burger with fries - but prior to our meal, we got a combination of side orders that apparently are complimentary: pickled beets, cole slaw, and warm buns and cornbread with butter. The overall amount of food was maybe for 4 people, but we enjoyed and it was really tasty. \n\nAfter this huge amount of food, that we proudly finished, we got offered two slice of cheesecakes, because we waited 10 minutes to get our orders picked. Such a nice gesture, that first of all do not happen so often in NYC, and secondly without any of us complaining for the wait! \n\nWe picked a chocolate mousse and a classic strawberries one. OMG. So delicious!! The slices are really big, and we were told we have to finish them for a funny rules of the place within the next two hours. We didn't, but we were able to get the remains to go home - which I can wait to retaste with my coffee! \n\nLast, but not least, this delicious and traditional dine experience cost us, with a 20/25% tip, just $30! \n\nI am a big fun of old diner, and this one is a gem not to miss.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "Juniors has been a favorite of mine since grad school. However, way before that, I remember riding past it on my way to and from church. As a child, I'd head about the famous Junior's. The ladies at my church would bring all kinds of delights from Juniors on Sundays. Oh how they would talk seem like for hours about what they bought and what they would bring next. As fate would have it, I would attend LIU Brooklyn for graduate school and the restaurant is right across the street. How funny is that. The funny this is, I remember cutting out of class early so could get a piece of cheesecake with the extra large strawberries on top. \nAt the time, I lived on LI and so after class I would have to catch my train but not before I indulged myself. Clearly, Juniors is known for it cheesecake but from time to time I will pig out and get their apple turnover or even a piece of lemon meringue pie! All of their cakes and sweets are a treat but their cheesecake is amazing.", "author": "Percy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "I finally made it to Junior's and I was very pleased! The cheesecake definitely lived up to all the hype, the steak was like butter, the cornbread resembled what my mother used to make, service was stellar and it was very easy to get to!! We will definitely be back every single time we visit NY! Only thing I would change is, I just wish the restroom wasn't upstairs.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "I popped my 1st Junior's Cheesecake cherry back in 2006 while on a blind date. I represent Queens, he was raised down in Fort Greene Brooklyn.  He boasted heavily of the cheesecake and after we had dinner, he bought me my 1st slice to go. DO NOT COME HERE FOR THE DINER FOOD! U ARE HERE FOR THE CHEESE CAKE ONLY! \n\nI got home and tore into that heaven filled red and white bag only to discover the most moist cheesecake I have ever had. Talk about cake by the pound!  I usually dislike cheesecake because it's more cream cheese than cake. BUT JUNIOR'S!  Junior's is the real deal. THICK Cake and cream cheese and strawberries on top.  Simply an orgasm. This is a New York tradition and must have for any tourists. Walk the Brooklyn Bridge to taste a slice of Junior's cheesecake. Clearly the date was memorable all because of Junior's.", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Junior's in downtown Brooklyn has become not only a Brooklyn icon but a New York City icon since its opening in 1950.  And its most famous food is its New York cheesecake.  I've eaten it twice now and I def like it, but I don't know if it is the best cheesecake I've ever eaten.  I think I would have to be a taster in a Cheesecake tasting competition to better assess that.  But I can safely recommend Junior's for a good hearty diner-style meal and yes I will say - Don't miss ordering the cheesecake!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "The most overrated cheesecake on the face of this great country. I tried the Times Square location a couple years back and I was not impressed at all, so this time I said maybe the OG location in Brooklyn would seal the deal. I travelled all the way from MidCity just to have it, and it wasn't a piece of cake (get it?).\nThe cheesecake is very hard and I almost can't taste the actual Cheese because there is so much Strawberry Jelo on Top. Tastes like just any other Deli,maybe even worse. So many better Cheesecakes in NYC.", "author": "Bassel N."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}