{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "I love their food, cheesecake and German Chocolate Cake, I been there with my Ex and the food was amazing and delicious. I also enjoyed the fact that I can purchase cakes separately, it makes me feel like I can get in and out of there quickly. You never know when I'm going appear to have a date or just to come get some cake. I appreciate that there is always something to do when you around the restaurant. I approve of this message", "author": "Josh C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "I found a hair in my breakfast plate! Absolutely disgusted with the food!!! The waitress was sweet but embarrassed. I will never go back to THIS establishment again!!!!!", "author": "Tashana F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-02", "description": "Was looking forward to eating here but from the moment we walked in something told me it wasn't going to live up to expectations.  The floors and tables were filthy, service was surly and the food was barely tolerable. We ordered a corned beef sandwich (really dry) split pea soup (tasteless) and jerk chicken with rice and beans (meh). \n\nWe were do disappointed and irritated with the service we ended up skipping the cheesecake. I'm not sure if ownership has changed recently because it doesn't live up to reviews.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "It's Junior's. It's the home office of cheesecake. Anyone who loves cheesecake has to make a pilgrimage to Junior's. From the old time music to the ambiance to all the choices... \"It's Junior's\" says it all.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "They really better do something fast before this place closes. They have already cut most of the staffs hours down because of the loss of customers. I blame management because they are in control. The food quality has gone so far down that this is literally the last place I go for something to eat. Most of the menu dishes taste horrible, some servers are the worst and without class. they run out to smoke and come back to your table stinking like cigarette smoke and then want to chat it up with you. (you know who she is) Just tired of hearing her story and just want a quiet meal sometime. This restaurant is surviving on their cheesecake it is gonna take more than that. The writing is on the wall for the future of this once great restaurant but it doesn't have to be. It is not fair to the longtime customers and the employees. We all deserve better.\nOhhh and before I forget; DO NOT EVEN BOTHER ordering for delivery. $25 of my items that I ordered and was charged for were missing, the food delivered was different from the food I ordered from the menu (Bait and switch) Poached eggs came scrambled, corn beef hash came, chopped corn beef -no potato, the whole order basically went in the garbage. A big waste of hard earned money. Uhgggg!", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "While in the Brooklyn area I had the thought of cheesecake and immediately thought to stop at Juniors! Luckily it was 4 minutes away from where we were. Now I must warn you, on a weekend The line for the bakery wraps around the building! Thank goodness after roughly 7 minutes of standing in the gigantic line a worker came out to inform us about the express lane! Yes there is an express line just for a couple of slices! That saved me and my time! I simply got the Strawberry cheesecake. \nThis cheesecake is EVERYTHING AND MORE ! it was rich and creamy. The strawberries are a bit two sweetened (I wish they were just fresh laid on top) but I had every bit of it over the next two days. I couldn't eat one slice in one sitting way too much. \nIt was amazing and I'm glad I can say I've tried the famous and highly acclaimed Juniors cheesecake.", "author": "Rosemary F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "I usually wind up at the Times Square location. I don't often get over to the original. \n\nI really should come over here more often. \n\nWe had a party of 8 for Sunday brunch. They accommodated us nicely and our server was a champ. \n\nEveryone enjoyed what they ate. Three of us got the pastrami omelette. All three of us devoured it. My wife really liked the chicken salad sandwich. Even my 2 year old's mac and cheese was tasty.\n\nNow, I convinced everyone to come here because of the cheesecake. My wife and I are huge fans. At least three others in our party had never had it. \n\nYou should have seen the looks on their faces when they tried it. \n\nIt's worth your time to hop over the bridge.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-15", "description": "I usually don't leave reviews but i just had to leave one about this experience. I'll start with the good, as usual the cheesecake and corn muffins were great. Now for the bad: I went with a party of 20+ for a christening celebration. It was a pre-fixe brunch menu for $38, ok fine. For pre-fixe brunch i was expecting mimosas, steak \u0026eggs, French toast etc. My heart was set on the French Toast because i know it's delicious. I get the menu the options were brisket, fried or boiled cod and roasted chicken, bummer. I was so disappointed in the menu. Just by looking at the stale beets and cole slaw on the table i knew this  brunch was going downhill really fast. I ordered the brisket and it was gross. Everything tasted like hospital food. $100 down the drain even the service was subpar. The workers were rude and rushing us. The children didn't even like their chicken fingers. How can you screw up chicken fingers?? I understand they like to stick with tradition but this was horrible. On top of all of this they charged us for the 8 guests who did not show up. We should have went to IHOP which would have been cheaper and better. Very disappointed in this iconic restaurant", "author": "Simone P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Awesome cheesecake. \n\nCame here for breakfast, cheesecake for breakfast (when in Rome!) \n\nThe waitress passed us our menus, then we ordered tea and coffee before straight up asking for the cheesecake menu. She gave us a knowing look that I can and will only describe as a mix of respect, admiration and a hint of fear (the fear was a comedic addition, nothing can scare this woman, not even cheesecake for breakfast). \n\nI ordered the Devils food cheesecake, my girlfriend ordered the raspberry swirl (I actually wanted that but you can't order the same thing!). The raspberry cheesecake was awesome, light, and huge. The Devils food cheesecake was enormous and delicious. All kinds of chocolatey deliciousness. \n\nThe coffee and tea were also good, but let's not pretend you or I care about that. \n\nDefinitely pop in here if you're in the area (we walked several miles to get here) and eat cheesecake.", "author": "Rich G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "I like cheesecake and I asked people in NY the first answer will be Junior's. Don't know why? I checked out Yelp reviews and asking friends about it... didn't really get any good vibe. But I went to try anyway. \n1. Service wasn't the best, a bit chaotic\n2. The cheesecakes are not greatest either, I've tried other cheesecakes elsewhere with better texture and sweetness level\n3. Price are reasonable I feel. Can't really complain consider the size you are getting\n4. Vibe, didn't feel any special even though this place supposed to be one of those historical place to eat in NY\n\nOverall experience, if people ask for cheesecake I'll send them to my recommendations (not Junior's). This is the place where they called I would label as \"once and done\".", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Thank you Junior's for being a consistent staple of my NYC diet! The warm and hospitable Staff, quality service, and delicious food are much appreciated!", "author": "Emilio H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "A New York icon. We went to the original landmark in Brooklyn and ordered a piece of plain cheesecake at the bar. While waiting, we were served our own bowls of mixed nuts. I picked out all the cashews, Tim took the almonds. The bartender was a storytelling master and shared stories of Junior's history (pre-1950) as well as his own fascinating life. The cheesecake was good, the whole experience was great.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Ok I just finished lunch at Juniors with my wife and daughter and had the most amazing lunch. My steakburger was outstanding. The meat actually tasted like filet mignon and the steak fries were amazing. However the best part was the service. Our waiter Eugene took excellent care of us. I think he knew we were starving because he bright us a bunch of munchies while we waited for our food like pickles, beets and some yummy rolls. Great job Eugene! We will definitely be coming back.", "author": "Joe A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "Junior's was a tried and true staple in the downtown Brooklyn area. I have fond memories of visiting with my mom as a little girl during our bonding time on the weekends. Fast forward about 15 or so years...and amidst outrageous price hikes, loss of quality in products, including their famed cheesecake, the whole mouse in the glass case debacle (please google), I am no longer impressed. Even with all this and against better judgement I have popped in from time to time to grab an expensive, albeit mediocre cheesecake slice or a quick bite for takeout. \n\nLast night I picked up two orders of buffalo shrimp and virgin pina coladas. My fiancé actually flipped out about the 5 jumbo shrimp that were housed in a huge takeout platter on a bed of inedible lettuce and 2 pieces of celery. He's like, \"No corn on the cob, French fries, something, anything?! How could they?!\" I have to agree with him and particularly since the 10 pieces of jumbo shrimp and 2 frozen drinks set me back 50 bucks. I understand the shrimp is an appetizer and it's actually very good, but it is okay to add any of the prior suggestions for this not to be a complete rip off. Something to note is the shrimp recipe has been changed over the years also. Juniors has to do better, but I am part of the issue with my continuing patronizing the place and all. Overall, it has drastically lost its local business feel. Frustrating.", "author": "Nikk B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I love this place! Well I love their cheesecake more than anything else.  I've eaten here a few times and the food is alright but what I look forward to the most is the desserts!  Sometimes I come and buy a few slices of cheesecake, chocolate cake, red velvet, or carrot cake. \n\nThe slices from my experience taste better than buying the entire cake.  Not sure why but my taste buds can see a different between the two.  \n\nWhenever I have family gatherings I buy a cake and this time I got the Mix Fruit Cheesecake.  Cherry, pineapple and blueberry topping! (See picture)  This cake covers everyone's tastebuds. \n\nThe desserts are expensive but its worth paying for from my perspective.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Don't know how relevant my review will be as I didn't have the cheesecake . However, I was able to enjoys Junior's Breakfast menu on this fine Friday. \n\nLet's being with the complementaries as they were much more than I expected. These include coffee, 1 cup of juice and assorted mini pastries. Very nice touch to any dining experience. \n\nI ordered the French toast which was ok. It came with Apple strudel but fresh fruit would've been preferred. \n\n-Tempting Taste", "author": "Tempris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Superb, moist and reasonably priced New York Iconic dessert. Pls don't change!\n\nUsed to just buy take-out cakes, and mousses from here. Finally tried to have a sit down session with a friend and update my review for a fuller experience. \n\nThey have a number of locations but my favorite is the one at Flatbush Av because it's at par with the old Downtown Brooklyn vibe. We were greeted by uniformed servers. That's one thing dying in dining experiences. Aside from 5star restaurants, servers usually wear casual attires nowadays.\n\nI got the the chocolate mousse with an earl grey tea. My friend got a strawberry cheesecake with a glass of merlot. Most people eat there diner style but we were just there for a quick dessert.", "author": "Pauline M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Junior's is a classic Brooklyn restaurant.  Most notably known for their cheesecake.  It is by far the BEST Cheesecake in the WORLD!  I have tried just about all the types of cheesecakes they have and they are all great.  My personal favorite is the pineapple topping cheesecake.\n\nI went to junior's yesterday and for the first time I had the food and it was just as amazing as the cheesecake.   I can not believe that it took me so long to try it but I am glad I did. Just great!  If you want authentic Brooklyn food Junior's  got you covered.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Horrendous customer service for delivery cheesecake. I ordered a cheesecake on 8/29 for delivery on 8/31 (they offer 2 day shipping for $24). After calling the intended recipient on 9/1 I was told they did not receive the cheesecake. I called juniors, who had sent me an order confirmation email and charged my credit card, and they told me some system error caused the cheesecake to never be shipped out. They could not offer a discount on the cheesecake or shipping cost, but offered to actually send it out this time which i hesitantly agreed to. Called the recipient again on 9/7 well after it should have been delivered and they had still not received it. I called juniors again and they gave me the same story, they could either refund me entirely or \"send out a cheesecake\" to which I said no thank you please refund me. Ruined my Mom's birthday surprise, thanks.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Since day 1 in New York,  I've heard that junior's was making the best cheesecake. I am  not a big cheesecake water due to all the calories in them but I am a big big big fan and I can definitely treat myself once in a while. Anyway after 3 years in New York, i made it! I ate my Juniors cheesecake and the verdict is:Blah! It's fine. Good but not great. I had better. The quantity is there for sure! But something is missing. What I did not like at the cheesecake factory: the sugar cream on top of each piece. What I did not like at Financier: the cheesecake was to airy when it should be compact and rich. What I did not like at Juniors: the jelly on top and the crust wait to thin. I am still on my journey of finding the best cheesecake of nyc. If you have any hint, Message me! :)", "author": "Thalie L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}