{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Three minutes and my order was taken without delay. Within a few minutes my order arrived. Awesome. Had my lunch and back to work I got.", "author": "Benito P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "I'd take the kids to breakfast  on Saturday morning in the 80's through early 2000. The rolls were memorable with the great thick jams, cream cheese  with heaps of all different kinds of miniature pastries, delicious  !\n\nThings often change for the better- NOT JUNIOR'S.  Boring pastries, mushy and sweet and \"white bread\" rolls- soft,with no substance and tiny packets of diner- type preserves  for  over $9.00.\n\nI could swear that the bread and pastries were frozen and baked  in batches for people who don't  care or  why  would they ever go back to Junior's.\n\nOver the years I have recommended Junior's- I'm so embarrassed.", "author": "Jo S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Terrible drunk diner food. \n3 stars for the desert only.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Great breakfast ,  better Bloody Mary and our waitress Melissa was more than accommodating.  We will be back for some cheesecake later !", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Service was excellent, very polite and outgoing. We tried mozzarella sticks which were phenomenal and marinara sauce was miraculous. Afterward we had original and strawberry cheesecake. They were pretty big portions but somehow they were easily finished. I will come here again for sure!", "author": "Filip M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "We were directed to this \"world famous\" restaurant when we were visiting the area. We ordered a cheeseburger and slice of cheesecake with ice tea. The burger was average, cheesecake was below average. Guess it's all a matter of taste. We bought slices of cheesecake at supermarkets that we liked much better. Our waiter was terrific, always there with great service.", "author": "Barbara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Ok, finally came into the original.  I have been going to the Times Square for years because it's right by my office. This was just what we wanted.  Huge portions, decent prices.  Yummy cheesecake.  Mom wanted the Black Forrest cheesecake, which I was ike meehhh, but it was pretty good.  We had the French Onion soup, which I loved.  I will be so sad when it's gone.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-04", "description": "Alright it's fine. Family Saturday breakfast for five. Basic diner fare. Had not been here in years. High point -- our waitress was wonderful.\n\nI love pastries but these were not good. I didn't try the rolls though.\n\nTwo had the corned beef hash; it's the waitress's husband's favorite and is made fresh. They both loved it but couldn't finish - large portions.\n\nMy omelet was overcooked; that's why I'm giving a 2. The hash browns were fine.\n\nShared some pancakes, which again were OK but not great. Can't remember what the other 2 had.\n\nThe dessert case did not look appealing at all.", "author": "Alyssa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Juniors is another NY institution and for good reason.....no one makes a cheesecake, or egg-cream, like Juniors. If you are coming to the city you need to stop in for a slice of heaven!", "author": "Robert M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "The food is just ordinary. Service and ambiance was okay. Perhaps just get a cheesecake to go and call it a day.", "author": "S B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Came to Junior's last week and was here for the first time in about 20 years! Gotta say it was better than what I expected. Took a special someone here for their birthday last week cause that's where they wanted to go and was taken kind of by shocked, cause I really don't know of anyone who wants to go to Junior's for their birthday but whatever. I really had no memory of what the food tasted like and just know that Junior's' was known for its cheesecake.  To my surprise the food was better than what I expected...\n\nI had the jumbo stuffed shrimp with crab meat, yellow rice and veggies. Wasn't the greatest meal in the world but wasn't disappointed by it either, especially being that I didn't even know that Juniors served seafood like that. The person I took had Southern Fried Chicken along with a potato if I remember correctly and some cornbread. I tried her chicken and it was good as well...For dessert, she of course had the cheesecake while I ordered a chocolate mousse cake. I didn't try her cheesecake cause she took it home but I am pretty sure it was good but the chocolate mousse cake was on point! Also had their version of a Blue Hawaiin which was just ehh...definitely not the taste of other well known Blue Hawaiin's but nobody's perfect. The service was excellent though, I must say and it was a nice ambiance.\n\nNot in a rush to come back here but I still would...", "author": "Jay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Approaching cheesecake corner. You know what that means. You're entering a red and yellow diner that isn't known for their food. People shouldn't come here for dinner. Perhaps drunk food but its not really worth a sober visit for sustenance.\n\nThis is a place for diabetes forming habits. For people to feel like munchkins eating giant sized baked goods because damn they don't have their portions under control.\n\njust don't think about how many calories you're scarfing down there in one slice. That 6-8 dollar slice is like taking a huge tub of cream and sugar and making it taste like something real (red velvet for instance) and cramming it into a thick juicy moist slice of cheesy cakey goodness.\n\nred velvet layer cake by itself is the bomb. the bright red juniors color combined with cream cheesy frosting makes it almost seem like you don't need to try the red velvet cheesecake. oh but you do.\n\nthe fruit topped cheesecakes are key. the devils food isn't as awesome (not really a fan) but it is a chocolately explosion of thick chocolate frosting with thick not too sweet cheesecake.\n\nseriously. dessert, people. that's why juniors has it's own street corner renamed. forget that jewish guys name above the sign for \"cheesecake corner\".\n\ni'd recommend sharing your slices or you'll be having some sugar diabetes soon!", "author": "Mary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "I haven't been here for years, \u0026 it's absolutely as fabulous as I remembered it. Fabulous Cheesecake, fabulous Reuben sandwiches, and every dish, on every table looked fabulous.They lose a star, because the French Fries were kind of mealy ,if you order fries, make sure you ask for them well done. I don't think they're hand cut, and this kind of iconic restaurant should be serving decent fries. We were lucky enough to get a metered parking space, but be prepared to pay for parking.Worth the trip.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Any time I did a favor for co workers from New York. They always sent me a cheese cake from Juniors. At  one time I had like 5 large cheese cakes in the freezer. \n\nNow that I am no longer working in corporate America. There are days I wish I could have a piece of cheese cake from Juniors....\n\nI guess I need to get my but back to New York to get me some... :)", "author": "Wendi X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "Last in the Mandatory Tourist Brooklyn Experience. Do you know what the most awesome experience was? Seeing the picture of Spike Lee staring at me when I turned around to flush the toilet in the restroom. \n\nI'm one of the trite members of the City that say the cheesecake has slipped. But honestly, it has. That said, I did try something different than the regular cheese cake offerings this time. I mixed it up by ordering the Black Forest Cheesecake.  I actually liked it quite a bit. Very rummy with cherries on the inside as opposed to how I imaged it would be, on top. That and the pickles in the relish tray that comes out, are the only things I can recommend. \n\nWhy only two stars, though? Service. Couldn't understand my server and then he disappeared. Good work, dude. My friend's chicken fingers weren't appetizing and ended up being returned. But that wasn't a complete shock. The woman who skipped the line in the restroom to throw-up, didn't recommend anyone eat the chicken anyway. Yipes. And listening to the tourists complain about the upstairs location of the restroom and the size of it, made me want to shoot myself in the head. Each one complained as they got on line.\n\nAs you can see, the restroom was the most memorable part of this dining experience. \nI now know what Tourist Hell is.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "I have to give Junior's credit for improving the overall quality of their food. When I went a year ago (and took my in-laws), the desserts were phenomenal (strawberry shortcake the size of your head? yes, please!) but the rest of the menu was sub-par. I went again more recently and was pleasantly surprised. \n\nIt's worth noting that I tend to venture there on the early-side on the weekends, since I generally skip lunch. \n\nGet the matzoh ball soup, you will not regret it. And their burgers are also pretty decent. Red Velvet, German Chocolate Layer cake, Cheesecake and, well, yeah, there isn't such a thing as bad desserts at Junior's.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-21", "description": "I don't know what's happening with Juniors.  I'm a Brooklyn native and I've loved their cheesecake for years.  A few days ago I took some out-of-town guests to check out their famous cheesecake.  When I brought it home I realized the bottom of the cheesecake was pie crust! Juniors is known for having a thin layer of cake on the bottom.  To not have that, or even a graham fracker crust, was very disappointing.  The taste of the cheesecake was also a little bit off.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "my son recently got a job in new york city. he's so happy there he may never come back to california.\n\n he bought an original juniors \"most fabulous cheesecake\" (30ish). someone ate some, the rest was airfreigted to california. each slice sells for $6.5 a slice in the  Juniors eatery.\n\neats: \"fabulous cheesecake\"\n-not really a cheesecake fancier\n-this cheesecake is RICH,  creamy, clean tasting, chemical free.\n-truly high end natural ingredients used.\n-doubt i can find equivalent in oaktown, frisco maybe.\n-leaving rest to SO who loves cheesecake....", "author": "Victor G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "I had to finally get to Juniors and I did the other day for an early morning lunch. I was concerned that I might be getting yesterdays dry pastrami when I ordered my favorite pastrami on whiskey but out came a luscious, succulent, tender, perfectly brined pastrami, as good as I have ever tasted! Throw in a generous portion of sour pickles, coleslaw and beets, chase it with a coke,  and you have a happy customer. Waitress was courteous and top notch too.", "author": "Steve P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "I guess I'm not as jaded as other reviewers.  Plus I live overseas so anytime I get a NY Deli sandwich I'm elated.  In any case the Corned Beef and Pastrami combo on onion roll was divine.  Beef brisket sandwich was piled high but kind of dry and had what seemed like plan ole mayo to lube it.   Could have used some more creativity.\n\nWe didn't have room for cheesecake but one hears it's quite good.  Next time in Brooklyn I'll certainly be back.", "author": "Gilford S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}