{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-10", "description": "Good ole juniors.....with your crazy expensive and unseasoned food..... you have really changed for the worse over the years.....we will still support you because you are a Brooklyn landmark but don't do us brooklynites like this and add some seasonings and don't be too cheap..... the portions are big but crazy expensive. I'd rather have a good size entree for a good price....", "author": "Megan T. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Junior's is still the best cheesecake in the world - full stop, no contest. From the plain, to the chocolate mousse cheesecake, to strawberry and the seasonal flavors, you're bound to find something you like unless you're lactose intolerant. Junior's cheesecake may be heavy, but the slices are big and worth sharing. When I'm at Juniors, I'm most frequently at the to go line to pick up a cake for some event.\n\nI've also been here for dinner and breakfast. If you're a fan of all American diner food, Juniors is good. Lots of fried foods, sandwiches, carbs, gravies, etc give people plenty of options for an affordable and generously sized  meal here. It's not great for vegetarians or vegans as many of the green items are iceberg lettuce, sad tomatoes, or stewed vegetables that lack texture and brightness. Breakfast is better, with hotcakes, omelettes, oatmeals, and platters of fresh pastries. I would definitely rather be here for breakfast or brunch vs dinner. \n\nService here is friendly but not fast. Prices are reasonable, especially when you see the portions and all the add ons. Tables are plentiful but a little sticky, decor is retro. Bathrooms are clean and the place is wheelchair and stroller friendly.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-09", "description": "We had dinner at Junior's Restaurant the food was ok then we went back downstairs to purchase a cheesecake and the cashier by the name of Joy Is a rude young lady that shouldn't work with the public.", "author": "Deborah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Great diner feel, but there was no one to bring me to the cheesecake area when I went so I stood around for a proper 10 minutes to let the loneliness kick in. Eventually I was able to order a cheesecake which is what I'd dreamt of over the course of a few weeks. The cheesecake at this Juniors location tasted like it was held at a better temperature than one I'd previously had at the Grand Central location. Overall, the cheesecake was decent, rich, and quite filling. I've got quite the appetite and I'd recommend one cheesecake for two.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "I've been to the Times Square location several times and it's pretty good! \n\nI usually get the challah bread grilled cheese. It's really good and the bread is super thick! The French fries are good too. \n\nNow, their cheesecake is the superstar. I love their blueberry cheesecake! The crust is buttery, the cheesecake is luscious and the blueberry is sweet. I love it! Their yellow cake with chocolate icing is super yummy too. \n\nTheir food isn't amazing but their cheesecake is, come here for dessert!", "author": "Bridget W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "Had the raspberry cheesecake and a cup of coffee.  Couldn't complain.  The ambience was perfect.  Mixed crowd of tourists and locals.  Older women enjoying a drink at the bar and cutting up like it should be.  \n\nPrice was reasonable.  Service was good.  My rating is mainly for the taste of the cheesecake as i didn't order anything else from the menu.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "I've been to this place twice and won't go back. The decoration and ambience is great, but service is terrible, they're rude, no \"thank you\" \"please\" \"May I\" \"you're welcome\". The food was okay, I had better things for the same price. \nI'm a server at a fine dining restaurant, and I know that coming here I'm not going to get that kind of service, but at least a good one.", "author": "Patricia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "Came here tonight with three other people we all ordered together let's see 2 burgers a fish plater and I ordered a simple pastrami sandwich well everyone's food came but not mine I really think this juniors are racists towards white peeps the rest of my party are more colorful than me lol we all came in together about 1145 and seated us they tell me the kitchen is closed and they can't make a pastrami sandwich shut the front door hope they go out of business", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "A Classic must go-to while in Brooklyn! Of course, you MUST have cheesecake while you're there. The menu has a variety of things on the menu that ranges from sandwiches, BBQ, Salads, and Seafood. The portions are ample! You may need a to-go plate unless you arrived really hungry.\n\nYou're provided complimentary beets and cornbread. I ordered the rib and shrimp plate with the notorious strawberry cheesecake. The ribs were just okay. The shrimp was delicious! The cheesecake was phenomenal! I'd certainly take that walk across the bridge for the cheesecake if I had to.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "I like this place!\n\nI was initially hesitant because it's a huge diner. But everything I've ordered from here has been good, the wait staff friendly and the drinks are strong.\n\nI was adventurous and craving meat the first time I went to Juniors, and I ordered the ribs. Great choice. The portion was large and I had leftovers and the ribs tasted saucy and good.  The breads they serve you with the entrees are also something to get full off of! And I loved the Reuben egg rolls, I'll be back for those!", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I had their pastrami sandwich. Let me tell you, this is the best sandwich I ever had. Hearty, savoury...huge portion ( 3 pieces ) It only came with Russian salad dressings... no salad or fries. I found the waiter a bit odd ( Muslim or Indian bald man )\nHe didn't fully explain today's special like $5  cheesecake... I overheard it from the next table's waitress. He ( totally ) ignored all my requests like refilling my Coke, and more napkins for the table. I feel that he needs culturally sensitive training. His buddy ( who speaks no English ) simply refilled our glasses and cleared our dishes.  \nNot happy with the bald waiter but I was very happy with my sandwich. When I'm back, I would like to try NYC location one. Not disappointed \n\nGreat restaurant for lunch and dinner", "author": "Hannah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "The cheesecake was good. I would've liked crust on the bottom, but hey it's popular for some reason. The inside is delicious but was hoping for crust. I wouldn't go back but nice to say I've been there.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Feels like its been the same since 1958, and that is definitely not a bad thing. Simple, Nostalgic and Delicious, blessed that its right next to my apartment.", "author": "Stephan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "The worst seafood combo I've ever had, the fish was dry and over cooked, the fries was cold and the coleslaw taste sour. The waiter was the worst, she didn't pay us no mind....... overral just a bad experience.", "author": "Jaydean J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "It was late at night and my friends and I really wanted some good cheesecake. I was excited to see that Junior's was still open, so we went. Upon walking in, I felt like I was in an old Denny's restaurant and if I was there for a full meal, I would have walked back out. However, we found our way to the take out area and the unfriendly employees there. We each got a Little Fella and asked for a cup of ice water and were told we needed to order the water from the other side and it would be 50 cents. I personally think it's ridiculous to charge paying customers for a to go cup of ice water, but hey, it's NY. We pay for three cups of ice water and then receive three cups of just ice. We had to insist that we wanted water and then it took another five minutes to get it.\nThe cheesecake is good and the Little Fella is the perfect size. I definitely suggest going to the location in Manhattan instead of this one.", "author": "Heidi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "New Yorkers love their food so what better place to sit, eat, and kibitz about sports, life, and politics.  \nJunior's clearly fits those requirements and more.  This place is pretty big so you don't have to wait no matter how busy it is.  There is a bakery on site and some really wonderful looking cheesecakes in the windows!\nFood wise, Junior's has huge portions.  My two eggs looked like three.  Grits overflowed its dish, toast perfectly done and crisp.  My Virginia ham was nothing to write home about and the eggs were overdone but pretty standard for most diners.  Service was friendly and quick.  They serve great coffee too.  \nThe prices are a little high but they offer a lot more than most places do and this place is spotless and pretty modern.  That is always a good sign!", "author": "Douglas A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Not impressed. I know that this place is an institution, but the many times I have had their cheesecake, I have found it to be dry and crumbly. Not my favorite place for cheesecake despite it's reputation.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "My review is strictly for the cheesecake. I only give the place a four because I haven't dined in or tried anything outside of the cheesecake. I discovered Juniors Cheesecake when I was younger.  I've only ever had the strawberry cheesecake but I love it! It comes with a layer of cake on the bottom versus a traditional graham cracker crust. Then the topping is a strawberry glaze with fresh strawberries and some kind of candies nuts maybe, around the edges. It is so delicious. Every time I have the opportunity I have to get a strawberry cheesecake from Juniors to take back home. Maybe one day I'll try other flavors.", "author": "Takera W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "I'll be honest, we only went to Juniors because my wife loves Sex and the City and this one is where Carrie had her wedding meal..\n\nBut we were pleasantly surprised when we arrived and had some breakfast.\n\nFirstly, our server Xiomara was amazing, so friendly and attentive. I got a coffee with my breakfast but I also ordered a soda as we'd been doing a lot of walking, and neither cup was ever empty!\n\nWe both had breakfast, I had the lumberjack which was delicious and filling!\n\nBefore we left we also got a slice of lemon meringue pie, and my wife tells me it's the best she's had!\n\nI'd definitely recommend a visit if you're in Brooklyn!", "author": "Ruaraidh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Best place to dine in if you're in NYC, the biggest chicken salad I ever had, I came back the same day for dinner to have another giant steak. 4 stars", "author": "Gary N."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}