{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "The food is so damn good, the cheesecake best in the world. Only problem is servers \u0026 cashier don't move any faster then they have to. Prices a little high but food is awesome \u0026 huge portions", "author": "Stan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Such a great tourist attraction (food wise) in Brooklyn. Puff Daddy may have made this famous for having his band members walk the Brooklyn Bridge to get a cheesecake but there is more than the cheesecake that makes this place special. When you first walk in you can get a cheesecake or other pastries to go. \n\nI came here for a lunch on the a cold Saturday and the place wasn't super packed and got sat down instantly.  Our waitress was very nice and hospitable about what to order and always filled our glasses up when we needed to. You get free coleslaw, half sliced pickles, and sliced beets. Then you also get free cornbread and harm butter rolls. Everything was pretty solid for the most part. I'm not much of a coleslaw guy but did have a few bites. All this was already a meal itself but of course i had to get something to order.\n\nI ordered the lunch special chicken pot pie and for only $12 it was massive, which included free refill on soda. A huge portion of a pot pit but it was overflowed with the chicken, corn, peas, carrots, thick delicious mush that was perfect on a cold day. The bottom crust was a bit mushy but the top cover was flaky and buttery. I was half full already even before when I got the entree so I had to take the leftovers home.\n\nI was too full to get a cheesecake but I will come back to try their other eats. Everything on everyone's plate around me looked delicious and looked worth the price.", "author": "Garreth G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "The best for cheesecake. Legendary!!!  Now you have to try the pastrami, the corned beef, the turkey club.  Full service bar, and cafe on side.  DeKalb and Flatbush Ave. Try to take a cheesecake home. You may pay up, but it is not disappointing.  I like the pastrami on twin onion tools.", "author": "Steven N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "Famous for their cheesecakes but I wasn't impressed with them as much as their pastrami - it's to die for!  Packed with flavor and literally melts in your mouth.  A little expensive and formal for lunch but definitely worth a trip if you go to Brooklyn.  Didn't care for the Matzo ball soup, but the BLT was huge, enough to feed 2 people, plus they give you extras which we didn't know about - pickled beets and pickles, so you do get alot of food for the price.  Will definitely go back the next time I'm in Brooklyn.", "author": "Maria D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-30", "description": "Hitchhiked to Brooklyn with two local friends who were nice enough to take my friend and I to Junior's to buy their famous cheesecake before our trip back home to Miami.\n\nWe showed up around 10:00pm on a Saturday and the restaurant was completely empty, maybe a table or two were occupied. \n\nI went straight to the cheesecake counter and ordered a regular cheesecake, the price was a little steep considering it was just plain cheesecake, but you know what they say... When in Rome...", "author": "Monica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "I mean a staple here in NYC. The dessert was definitely the best part.\n\nWe did come in a little late, but the server was super slow. Too slow. 15 minutes for a greet, which in customer service standards is a long time.\n\nWe were unhappy with the catfish fingers and the server no hesitation took off the bill, a bonus.\n\nOverall ok experience. Come here for the dessert not the service.", "author": "Matty G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "Food honestly wasn't great. Mac and cheese was especially terrible...But the cheeseburger was okay, according to my boyfriend.\n\nThe real winner here is the cheesecake!! We ordered the strawberry cheesecake (good) but a few months later we ordered the red velvet cheesecake (even better!!!) \n\nMy advice is to not waste your time with the food and just get the cheesecake to go, but if bland/meh diner food is something you're craving (or if you just want to check Junior's out because of its renown, like us) - check it out!", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Brooklyn tradition. Best pastrami sandwich and cheesecake I've ever had. You must go eat here.", "author": "Cara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Showed up here late morning hoping for some decent breakfast. Nailed it. \n\nThe place is an old school restaurant. The staff are all dressed in black outfits. The chairs and booths are covered in 70s color vinyl. \n\nThe service is great; there, but never obtrusive. They bring you a plate of amazing baked goods (buns, little cinnamon rolls). I had the french toast, with great pork sausage. It came with a dish of melted butter. That's awesome. \n\nIf you want fancy, not here. Just a good find.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-14", "description": "All these 5 star reviews are blowing my mind. I had literally the worst food experience I've had in New York at this place. Don't get me wrong, I love Junior's cheesecake as much as the next guy, but the food at this restaurant is horrendous. \n\nI ordered buffalo chicken tenders and steak fries. The chicken tenders were the most bizarre thing I've ever received at a restaurant. Terrible, soggy frozen chicken tenders, soaked in some kind of red sugary sour sauce. NOT buffalo sauce by any means. It was so disgusting I took one bite and refused to eat another. \n\nThe steak fries were also terrible. Frozen, unsalted, extremely potatoe-y and flavorless. They just taste like starch. \n\nMy friend and I were so shocked after tasting the food we wanted to leave immediately. We hastily asked the server to have it wrapped, paid, left, and then threw it in the garbage once we were outside.\n\nI'm still reeling at how bad this experience was.", "author": "Sydney L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "As good as it gets when it comes to Cheesecake!\nPerfect combination of cheese \u0026 sweetness could not say a negative point about this cheesecake! The slice was huge the two of us shared.\nBefore heading to NYC from Australia for the 3rd time I looked up best Cheesecake in NYC and can definetely say this wins hands down!\nWe took takeaway due to time restraints so cannot comment on service.", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "I am surprised to be the first comment on that page! The restaurant was completely full!\nI have to say we had a great meal : nice and fresh salad, good burguer with real potatoes french frieds and a delicious orriginal strawberry swirl cheesecake.\nHard not to fall asleep after such a great meal. despite the number of people we had our meal prety fast. It was still very noisy and we were a bit cold. \nThe price was quite high but worth it. I was very happy to try the orriginal NYC cheesecake recipe :)", "author": "Eva R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "Never had a meal here, but the cheesecake is to die for.  \n\nJust a word of advice (and some others here said the same thing and they are sooo right), don't kill the cheesecake with sauces and added flavors, KEEP IS SIMPLE... order plain cheesecake (perhaps with some strawberries).", "author": "Glenn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "If you're getting dessert here, stick with the cheesecake! I had their German chocolate cake and it did not taste like German chocolate at all. I mean, it wasn't bad, but it was kind of dry and there was a coconut part to it, which seemed out of place in German chocolate cake. I actually had to double check if they didn't accidentally give us the wrong cake. Also got the fries here, which were pretty good. The portions of the meals are large, but they're also kind of expensive. Would be nice if they had some cheaper bites on the menu for those who mainly come for the desserts, but also want to try something more filling.", "author": "Tamanna R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Really really sad. I love a legendary eatery. We came here for breakfast. I ordered corn beef hash two eggs tomato slices. They messed up my order once. I corrected the waiter on the hash part and my eggs... he bought out another wrong plate by now my whole party was almost done eating. I asked if I could have discount because it was truly an inconvenience. He looked at me like was crazy so I just cancelled my order completely. Then he came back and told he was going to take it off my bill as if he was doing me a favor. My family all order breakfast the French toast coffee and bacon were all winners. Everything else blah blah... I didn't get cheesecake because I'm done with this place. Really dissapointed. They even messed up my family's orders. Uhhhhhhhhhh", "author": "Ro F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "I wouldn't be a real Brooklynite without a Juniors review. This spot is everything you've heard and more. Been coming here since I was five and it's the only cheesecake I'll eat--quality is always above par. Betta go get you sum!", "author": "Kerriann G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Food is good, got the grilled cheese and fries. Classic diner style. The service is incredible! A little pricey, but you get free beets, pickles, cole slaw at the beginning. No patty melts!", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "I'm a fan and always eat at Junior's when in NYC! Usually, I eat at the location in Times Square, but this trip I ate at the Brooklyn location. Love it! Excellent service and great food!\n\nThe belgian waffle was excellent, and my friend had the pancakes with bacon. Great meal!", "author": "Charles D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "After having a pastrami at Katz and walking around Times Square, I decided to come here for cheesecake. So I love red velvet cake and I love cheesecake so when I saw they have red velvet cheesecake , I was ecstatic.\n\nSo it was huge, and for 7.95 I expected it to be huge, the cake was really moist and sift and the cheesecake had just about the same richness in it, all in all it was great!!\n\nA must visit when you are in New York!!", "author": "Mahmoud E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "Last time I went to Juniors had to be a couple of years ago when I had family in town.  It's great diner food, and ridiculously luscious desserts.\n\nI ordered the german chocolate cake.  I know I know, if I don't know what I\"m ordering I shouldn't order it.  But I don't like coconut, so I was stuck eating the chocolate frosting off the top.  Which was very yummy mind you.  That and a scoop of chocolate ice cream which did seem to really hit the spot.\n\nI have to say I enjoyed having to go UPSTAIRS to get to the bathroom.  Most restos make you go downstairs.  So that was a twist.  What's more I really liked the old-school circa 1970's decor that in no way needs an upgrade.  That and the still hanging christmas decorations.  Woohoo!\n\nOh and one more thing, despite what MDs might have you believe, vinyl wood panelling is not *CAMPY* unless it was put there intentionally.  If it was put there because it was stylish 40 years ago, that's something entirely different!", "author": "Sean S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}