{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "Terrible outdated at the foot of the grim location that is Flatbush Ave. How places like this survive in 2014 is beyond me.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Good cheesecake, not the best, but its good.  Everyone forgot to mention the fact about the parking situation around that area, its almost impossible to find a legit spot!! Your best bet is to park it in a garage or else a piece of cheesecake is gonna cost you about 250.00 plus fees in towing costs", "author": "Jerrys K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Reuben sandwich here is amazing. Well worth the trek from Dumbo. Used to hit it up regularly and never had a bad meal.", "author": "Rick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Sweet baby Jesus. The Carrot Cake Cheesecake is like unicorn magic.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-10", "description": "I used to come here when I worked in politics because this was the mecca of Sunday post-church politics.\n\nThe only things I have at Junior's are the Cheesecakes and the Strawberry Shortcakes.  Both are made fresh and made well.  Both are offered in different sizes and they really taste great.\n\nThe food is really not that great.  I put it in the same class as diner food.  Maybe this is a good place to fall into drunk and hungry, but that's about it.  \n\nThe three stars are for the cheesecake and strawberry shortcake, NOT the food, or the service.", "author": "Robert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Classic Diner.  Good comfort food.", "author": "Tim D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "Two years ago it was the best cheese in the city. Now it is a standard cheese cake.", "author": "cirillof"}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-27", "description": "Excellent cheesecakes and above average dining experience. Pastrami and corned beef were good, but can't compare to Carnegie Deli nor Katz Deli. Service was friendly and courteous. Only complaint is your order could very well take about half an hour to be served. Over all, other than the renowned cheesecakes, Junior's resembles a glorified and possibly overpriced diner.  Not bad but nothing special.  4.5 stars for cheesecake, 3.5 stars for dining.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "NY Style cheesecake, baby! And it doesn't get anymore NY than Brooklyn. The cheesecake is so rich you will need water (or in my case coffee) to push it down your throat. They have a low-carb, sugar-free option but I think that is for losers. LOL. Seriously, when in NY, go to Junior's! You won't regret it.", "author": "R Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "A real New York city diner, with a wide variety of food choices, huge drinks, and I hear the cheesecake is pretty good!", "author": "Tom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "I'm a big fan of strawberry cheese cake and strawberry shortcake.This is the place to be to get the slices of cakes you wanna enjoy. You wont be disappointed at all", "author": "Ceo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "I'm giving this place 5 stars based solely on the cheesecake. Every time I go here I tell myself I will order real food but I always end up with a slice of cheesecake. The waitstaff are friendly enough and they are efficient. To be honest, this place could be an absolute dive and the waitstaff could be total a-holes but I'd still come back for cheesecake. Get any slice of cheesecake, your mouth will thank you.", "author": "melissa d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "I had been there so many time, but never took the time to write up the review.  Don't order too much, otherwise you will not have the stomach to eat the cake.  \n\nI went there with few of my buddies, just to eat the cheesecake during lunch, dinner on both weekday and weekend before they opened the one nearby TQ.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Yay! I'm a fan?! I don't know if that's the complete truth. I am not as much of a  fan of Junior's the establishment as a whole as I am a fan of their desserts--more specifically the cheesecake and the red velvet cake.  \nThis is THE place for cheesecake. Although I do not eat cheesecake often, when I choose to do so, I refuse to order it at any other place besides junior's. While I like the cheesecake, what I love is the red velvet cake and the frosting [ they make the classic thick cream cheese kind..not the sugary fluff  other places try to pass of as frosting!] Let me tell you..the RVC is great here! Honestly, the best I've ever tasted. ( and believe me because I've done my research!)\n\n\nHowever, folks, I'm sorry to have to tell you that this is where my gushing review on junior's ends. service is slow and spotty at times (My friend and I once sat down for 10 15 minutes before anyone even came to even give us water!), they add a mandatory gratuity if you're dining after a certain hour no matter how many people are in your party, be it 2 or 22, and the food is definitely overpriced. I went to school in the area so, needless to say, I've been around Junior's VERY often during the past few years and even with it being so close,  I've only opted to eat there about 4 times ( 2 of those times I was requested to go as part of birthday celebrations and such). \nIn fact, I've gone to the Applebee's across the street way more often than I've gone to junior's. That's saying a lot since if you've been to said Applebee's, you'd know that  they're not exactly the epitome of a great restaurant either. My general feeling towards Junior's sit down service can be depicted in one word expression:  -_-\n\nBut, let's venture back to my lust affair with junior's red velvet cake shall we? You can buy a whole cake if you need to at their bakery counter, however they also sell all types of cake[ chocolate, many varieties of cheese cake, etc..], including the red velvet, by the slice at the take out counter. I have been to that counter to get a slice of cake more times then I am comfortable admitting lol. At a bit under $7 per slice (tax included), the slice is a bit pricey, But, I'll tell you what- it is that good and the slice is a substantial size ( I suppose you're getting your money's worth). IMO, you can def split it among 2 people. If I am eating it alone, I can never finish a slice off at one time. so I often eat it over the course of 2 maybe even 3 days lol\n\nP.S...if you choose to actually sit and eat here, when you go to the bathroom make sure you have a dollar on hand  because last I remember, they have a bathroom attendant.", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "Craving some cheesecake!!! The first place I'll have to pay a visit when I get back to NY...if I get there.", "author": "Victor A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-06", "description": "Everyone from New York city  knows you only go to Junior's for Cheese cake!!!! I would never eat the food there!\nWhy they serve meals I have no idea because I do not know anyone\npersonally who has ever bothered to eat meals there. \nBut the cheese cakes are as much a part of Brooklyn New York history as Coney Island.\nThey are the classic New York cheese cake. They used to be my favorite\nbut like with most things that are firsts people always come and\nimprove on them after wards. Cascon's is my favorite now but you can't eat in they only have counter service. \nThis Junior's  is the original  and was in the news recently (Oct 2009)  for having mice and they showed mice running around chewing on cheese cakes. \nhttp://www.nydailynews.com/ny_local/brooklyn/2009/10/21/2009-10-21_juniors_mousecake_photo_leaves_bad_taste.html\nhttp://www.slashfood.com/2009/10/21/mice-photographed-in-window-at-juniors-cheesecake/\nSo no need to go to the original in Brooklyn though for me it holds \nspecial memories. \nJunior's is not  a hipster hang out so don't even think about having brunch here. This is old school Brooklyn and for those who don't know that means it means  poor service and no brunch. \n So it is good that tourists can now eat Junior's in Manhattan and do not\nhave to go all the way to Brooklyn to enjoy the cheese cake. Plus it\nseems not many people know this but all of Junior's cheese cakes at\nall of their locations come from the Maspeth warehouse where they are\nbaked. So you are getting the same thing at the Manhattan locations as\nyou would in Brooklyn. I have been to all of the locations. 3 stars for the nostalgia and cheese cake minus the mice. But for me I will skip the mice and have it in Manhattan.", "author": "Pinky And The B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-24", "description": "Not sure about all the hype about their cheesecake. Veniero's hands down is way better.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Huge portions, classic place that is a must see and must do in Brooklyn.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-14", "description": "I mean, I never tasted the cheesecake but maybe I should.......On the contrary I did hold a breakfast with my manager and ordered pancakes...It was \"iight\". I think Cracker Barrel's food is better and LESS expensive. Juniors food is TOO pricey which is why I've only been there ONCE.", "author": "K F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-04", "description": "As a brookly native, Juniors has always been the holy grail of cheesecake. No matter where you went, if you mentioned \"Juniors\",  someone would recognize the name.\nNow since the health inspection scare some time ago, i figured that I would give my old favorite place a shot again.\nAfter all, this is the place that no matter what time of the day, you could get a fresh tasting and delicious slice of strawberry cheesecake.\nI no longer reside in Brooklyn, so when I visit, I bypass all the old spots (unhealthy) and continue to go and handle my business.\n\nIts hard to stay on the straight and narrow healthy path when there are so many unhealthy options out there... that are appealing and cost effective (SMH)- thats another argument) \n\nSo since Im doing well on my path to eating well, I decided to splurge a little. I deserve it! So, i bought a small cheesecake to bring home for my family and me to enjoy . I figured it would be a nice dessert after dinner. Boy oh boy was I in for a surprise.\nLook wise: it looked great. It smelled great. It had everything that I remembered when I use to frequent this place.\nSo i cut a piece for everyone. I sit down and began to take my first bite.\nDisappointment. I figured maybe my taste buds wasn't use to this much sugar or stuff...so I took another bite (just to reacquaint my taste buds), and nothing.\nI was waiting for the cheesecake to melt on my tongue, but it didn't. It just stood there like a block of cheese.\nThen, i check out the strawberries.....more disappointment. They were all old and soggy. They put so much glaze on them that they appeared fresh and juicy but NO NO NO. When you cut into them, you see the real deal.\nThese are strawberries that you wouldn't pick at the neighborhood supermarket. The strawberries are either already old or just about to become old.\nOn a different occasion, I tried again. More disappointment.\n No warm feelings inside like how i use to get when I indulged in a piece of Juniors Cheesecake. So, I'm totally disappointed and convinced that the cheesecakes are not fresh. I'm sad. Juniors was such a staple in the community and then it ends up like this.\nI was never crazy about the food items. I mean, even back then, everyone knew their food sucked. But the cheesecake was the BEST and the lines use to hang outside the door to purchase a slice. SMH....look at it now. Health Dept violations, newspaper reports, and old cheesecake. I ended up throwing the leftover cheesecake out. Its just wasn't FRESH. It clearly was old or its been frozen or something.\nI will NOT be back.", "author": "Tiwana E."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}