{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "The red velvet cheesecake is beyond amazing. I can't ever eat an individual slice in one sitting. They make the best cheesecake hands down. I had the chicken parmasean it was pretty decent nothing to really for over but the portion size was enough for two eatings. I also ordered a slice of the sugar free cheesecake for my friend and he loved it. I took a bite and you wouldn't be able to tell it's sugar free, my friend is diabetic so I didn't want to get him a regular slice this did the job. If your in the area I highly recommend stopping in.", "author": "T H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "There is a reason why these guys are still in business and that's because of their awesome cheese cake. \nAmbience of an old school diner, staff was welcoming and friendly, food (other than cheese cake) was delicious but not fabulous: like a really good diner delicious. \nGreat for groups (went with family members) but parking is a *you know what* so be prepared to pay like 40 bucks for a parking lot or just take the train.", "author": "Alisha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "This little old-time-y dive is a gem. Great food, huge portions, and very tasty. You've definitely got to order the cheesecake. Not too heavy and tasty and satisfying at the same time. Divine.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Everybody's knows that Juniors has the best cheesecake. You CANT visit Brooklyn without getting a slice of Juniors cheesecake . I normally stop by just to get cheesecake  but today I sat down and had a seat. All I ordered was a strawberry slice with a glass of milk and my friend ordered a pineapple slice.", "author": "Lisa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Great food, Great Service! IT was an awesome experience. The matzo ball soup knocked my socks off!!!!", "author": "Jesse-Marie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "**i love juniors!!!\ni love juniors!!!!\ni love juniors!!!! is what i say when anyone mentions this restaurant to me\n\n-#1 cheesecake in new york city period!!!!\n-food is great i always get the chicken param pasta and my cheesecake to go!\n-cocktails are very small i usually dont drink here\n-its always has business \n-love to come on special occasions\n-waiters are always nice \n-food is served fast and in good taste\n-love the way the seating is ((im always in a different area when i dine))\n\nhave been  coming for years and will do so in the future until they close down \n\n**this place is the bomb!! \n\nsigned\ni live to eat out \u0026 i do it consistently with class n we tip well!! \n\nmr.von teese \u0026 company **", "author": "Tyshawn V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "I am so disappointed by this restaurant that I don't know where to begin. So, I'd visited Juniors in Times Square about a year ago with some friends and left disappointed by the tasteless food, but decided to give this Brooklyn location a shot since this is where P. Diddy made his group walk to get cheesecake on the old MTV show \"Making the Band\" and I had a friend in town who wanted to see what they hype was about. \n\nI ordered the BBQ chicken with yam fries and coleslaw and my friend ordered a burger and spicy fries. My friend's burger was so overcooked that I'm very surprised that her throat didn't close up from dryness. My chicken was so bland that I couldn't take more than a few bites. \n\nWe continued to eat because at that point we were both so hungry that waiting for a new order or attempting to go somewhere else  was not an option, less we pass out in the process from hunger. (I exaggerate and don't take real hunger lightly, but you get the point)\n\nWhen the waiter came back with the check, he looked at my nearly full plate and said, \"So you didn't like the food?\" I politely said, \"No\" paid the check and we left. \n\nNeedless to say, I will not be returning here... not even for the cheesecake.", "author": "Brittney G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-26", "description": "Horrible customer service.took me 10 minutes to buy cheesecake. One cashier two helpers took them 10 minutes to take my money for one cheesecake. LAZY cashier waisted my 20 minutes.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Nice place, the wait staff was nice and very attentive.  You can order breakfast anytime.  Clean bathroom.   The food was good. ( I had French toast and eggs.  The French fries were good too.  Casual dress with music playing in the background", "author": "Annette T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-19", "description": "We have been eating here for years but our last visit we saw the bill went up. We order the same meal all the time. Our sever said they raised the price 2 times in one year. So beware of price increases without notice.", "author": "Rubin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I always come to this location in Brooklyn to get my cheesecake whenever I'm in New York. I can't leave here without doing so. Best cheesecake I've had hands down!!!", "author": "Loriene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "BEST. CHEESECAKE. EVER!!!\n\nStraight-forward, to the point. We had the classic. We had coffee and tea. The atmosphere (retro-sincere-tacky), was awesome.\n\nDo yourself a favor and have cheesecake at Junior's at least once in your life.\n\nI do plan to go back for the food one of these days ... till then, Junior's gets a 5 for the obvious.", "author": "Frances G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "My friends and I were in the area with a cheesecake craving so we came here. I had little to no expectations so my experience was just fine. The service and food were not outstanding, but I had no complaints. I got the lunch combo of half a sandwich and salad for $14, and it was actually pretty filling! I had the pastrami sandwich, and while it can't compare to Katz's, it was decent. \n\nAs for the cheesecake the 4 of us split 2 slices - one strawberry cheesecake and one chocolate mousse - and we couldn't finish them. They were gigantic! I really enjoyed the chocolate mousse because the flavor was so rich. The strawberry slice was kind of plain. \n\nSo although the diner itself is just ok, the cheesecake is still the star of the show. Junior's is worth checking out at least once.", "author": "Helen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Absolutely awesome! We got a full plate of all kinds of bread for free, very generous! Main course we ordered Steak and Two eggs--potatoes, median steak and sunny eggs are all perfect. Recommend to everyone~", "author": "Flair L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "I ordered a BLT and it had more bacon on it for me to jam into my face than I've ever seen before on a sandwich. The staff is attentive, the food is good, the atmosphere is fun. \n\nI ended my meal with a scoop of sherbet which almost had a touch of dreamsicle to it. Yummy!\n\nIf we were locals, my man and I would be regulars. Thanks for the good meal!", "author": "Erin O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Bad service !! Didn't ask me what I want for my plate they decided by themselves!! Every table have bread and some small side dishes BUT I don't have !!", "author": "Pin-chen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Had the combo Rueben, potato pancake, and an egg cream...what could be better! \nThis place is the real deal!", "author": "S S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Don't come here for the food or the service...just get the cheesecake! My favorite is the strawberry cheesecake. It is best in the entire world. I find the service to be slow when dining in and I am always underwhelmed by the taste...even with the burger.", "author": "Desiree D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "The only reason this gets one star is because their cheesecake is awesome. The food, meh. The price of the food, ridiculous! Pick another place for a meal and come get dessert here.", "author": "Marlene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "Decided to have lunch today to simply unwind.   As usual, the food is always fresh and great.   Had the pastrami on twin rolls.      Absolutely fantastic    Be sure to try there breakfast. Always delicious", "author": "Derrick J."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}