{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "Came here late on a Friday night - obviously, the hours are a big perk, and my girlfriend wanted to check this off her bucket list. Granted, we were tourists, so I'm not entirely used to NYC prices, but I thought they were steep, here. To be fair, though, the portions are large... However, a large part of that is thanks to bland steak fries that they use to fill out your plate. Draw your own conclusions.\n\nMy girlfriend got a burger that she liked - and couldn't finish. I got a grilled cheese with ham due to it being one of the cheaper menu items, along with french onion soup. To me, the cheese on the sandwich tasted cheap. It was all borderline mediocre.\n\nGranted, we didn't delve into the bakery, which is their main selling point, so I'm not completely condemning the place or anything, but I was not impressed.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "Food was very good.  Cheesecake was amazing!!  Service wasn't horrible but it was slow and they weren't busy at all when we went.  I would definitely go back though!!", "author": "Kerri J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Seated very quickly, friendly staff, and the atmosphere is always live and festive. We order the jerk salmon and it was alright (the portions were huge) and California Cobb Salad was mixed with beacon, chucks of grilled chicken, boiled eggs, lettuce, tomatoes, red peppers, and creamy ranch dressing, but the red velvet cheesecake for dessert was the absolute truth. The dinner roles, pickled beets, and dill pickles on the table is an reminder of the old school flair that makes this place a staple in Brooklyn, the tourist flock to it and the locals still go there looking for a piece of time that can't be found anywhere else (egg cream.... they still serve egg cream).\n\nThe drinks are strong, not watered down, and the Jamaican rum punch is a must.\n\n\"Eat the cake Annie Mae\" Ike Turner", "author": "Letty C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "This location is way better than the one in Times Square. The Brooklyn location has an authentic feel to it still. The cheesecake even taste better in Brooklyn lol.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Juniors Cheesecake is an iconic spot for a nice fluffly cheesecake that is light and airy and never too heavy.  It's also a full fledged american style restaurant and it's pretty solid.  They don't bother you to leave and plus it wasn't a very busy night anyway.  They had a ton of tables to seat people and the restaurant felt like it was only 2/3rds busy the entire 2 hour stay we were  there.\n\nI had a cheese steak sandwich b/c why not i was hungry and just went to town.  It was pretty good, but not the best i've ever had.  My buddies had food and we all said the same thing - it was good, but not amazing.  \n\nWe did order a piece of cheesecake that came out and was delicious.  It's definitely why they are known as a cheesecake destination of NYC.\n\nIn my opinion, come and eat, but definitely get dessert and by dessert i mean cheesecake.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Decided to venture across the bridge to have lunch at Juniors.  It was delicious.  The hot open roast beef was cooked perfectly. It was incredibly tender. The pastrami was lean and flavorful, by itself and on a reuben.  The kosher style salami was so good because it was grilled.   The beets, pickles and slaw were good too.  For dessert, the chocolate mousse cheesecake is to die for!  So so good.  What really made this whole experience complete was the waitress.  She couldn't do enough to make everthing right.  So friendly and helpful.  We will go back for sure.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Delicious cheesecakes! Absolutely loved the two we got! I am glad we had the time to stop by!", "author": "Neethu A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "This place was great. The homemade pickles to start are fantastic as is the cornbread. Our main entrees were really good. Nothing ground​ breaking, just good food. I had the burger and my husband has the pastrami sandwich. The cheesecake however is phenomenal. The slice was quite large so we easily shared. The service wasn't the best but the water was nice and the food made up for it. \nI look forward to returning.", "author": "Elisse K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "Stopped here for breakfast. The best item was the buttered toast. I ordered a ham \u0026 cheese omelet. It came out with lunch meat ham folded into the the eggs w what looked like velveeta cheese. The home fries were awful too... soggy \u0026 tasted like they came from a bag. The French toast was fried too. Not good. Worst breakfast I have ever had.", "author": "Jim G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "Disgusting. ! The peach pie tasted like rusty canned peaches and the apple crumb cheesecake tasted like American cheese. I don't know how this is the original but it was DISGUSTING !!!! So glad I took it to go and not sat down to eat.", "author": "Anne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "Cheesecake is amazing (but EVERYONE knows this), so my review is focused on the actual diner/menu aside from their renowned dessert. \nThe diner is huge - you are seated right away, even during busy lunch hours. The staff was friendly and helpful. I came here with a friend and we were seated in a very small table - there was barely any space to put all our plates without stacking a few bowls on top of each other, our elbows felt extremely squished, and there was no space to rest our handbags, so we had to put it on the floor, which was dirty. The menu is not that impressive: very standard diner stuff but with less vegetarian options than the average diner. Overall, the food was just ..okay.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "love the cheesecake.\nThe bitch behind the counter needs to adjust his attitude;\nHe gave preferential treatment to people BEHIND us because of who they were;\nNo explanation, just snotty and curt;\nHoping he's not always such a bitchy drama queen.", "author": "Edwin V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "The best pickles ever !!! Nooo seriously!!! The best damn pickleams and they are free!!!! Just ask the waiter for some pickles...everyting else was delicious!!!", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Cake, cake, cake, cake, cake, cake... yeah buddy, when in Brooklyn check out Junior's for the strawberry cheesecake. I've never seen anything like it. It's suuuuuper thick and the topping gives it the extra wow factor. I called in advance to make sure they had one available which was silly because yes, they were fully stocked with all of the yummy baked goods and were refilling the display cases just as quickly as they were being purchased. I got the 6\" for $23.50 as a gift and it gets 5 stars given the fact that he smashed nearly half of it in the first day. Like seriously?! It was clearly that good.", "author": "Alfreda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-05", "description": "I haven't been to juniors in awhile...being that I work downtown now I decided to stop in and grab some treats for the fam I got the strawberry cheesecake as well as the strawberry shortcake. I was not really pleased with the fact that the strawberries on the cheesecake taster spoiled and the strawberry shortcake had basically whipcream and two small pieces of cake for 7.50.... disappointed but hoping it was just an off day. The cheesecake saved the review with the extra star because they couldn't mess that up it's a classic.", "author": "Zenda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "cheesecake.cheesecake.cheesecake! \nALWAYS good! that is all.", "author": "Shelly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Dude, what the hell man?!?!? I am a sucker for NYC tradition and Junior's is an icon in New York. Junior's has been around for 65 years and in that time they should have gotten better as time goes by, not worse. I have had Juniors's several times over the years and I used to really like it. I really liked the smooth texture of the cheesecake and the not too intense sweetness of the filling. That is long gone. I went there the other day with some friends and we got a slice to go that we split amongst the three of us, oh thank heavens we didn't get one each. \n\nThe food:\n\nStrawberry Cheesecake- So we ordered a slice of strawberry cheesecake, since I have enjoyed this in the past, and on this trip, it was so damn sweet and so damn chalky! The chalkiness was really weird like it was undercooked flour and it was very apparent. I was really kinda shocked and disappointed that the slice was bad. I also felt like a butthole since I took a friend who has never been and she was left with disappointment *sad face* And to throw pie in my face, the damn slice was $7.50, with tax it came out to $8.16, were these supposed to be magic cheesecakes?", "author": "Ben L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-29", "description": "The cheese cake was delicious and the portions were huge! \nThe burger I ordered was also good. I just think that everything here is overpriced. I came here to try real New York cheesecake , knowing that i would be overpaying . I came here for the real New York experience but if I were a newyorker , I probably wouldn't come here on the regular!", "author": "Chantal J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "When you think of eating out, juniors is the place . Excellent service all the way, baby ribs, shrimp, and many more on the menu.  Tasha's  personality is real to the bone,if you know what I mean.", "author": "Claudette B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Upgraded one star today\nGreat greeting and service today\nMatzo Ball was great lite fluffy\nSoup too salty \nPastrami juicy today\nBeets coleslaw pickles cornbread table gifts very good today\nWIGB? Yes", "author": "Hungry K."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}