{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "Let me 1st say the food is excellent and portions are very good. But where Juniors fails is the service. We stopped for breakfast and the service, It's slow, and the wait staff is lethargic, unless they are talking to other wait staff. They are in this 'sleep walk' mode that takes away from the food. We decided to stop by the bakery and the cashier never stopped talking to her friend the whole time we checked out. We were wanting to ask questions and maybe purchase additional items but the impersonal touch left us just wanting to leave. \nThe food is excellent but we know now the service doesn't match.", "author": "Edward B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Juniors cheesecake.... do i need to say anymore. Staple in NY. My favorite is the strawberry cheesecake. I can sadly eat a whole pie alone ( day by day of course :D ) \u0026 when i dont think im going to eat a whole pie... i get slices. i mean i am a New Yorker... i just live in another state. But best believe i always make my way here when im in town. Push come to shove.. i would totally walk here and im from Queens lol.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I have enjoyed eating at this restaurant for over 20 + years. My favorite appetizers are the buffalo shrimp, fried calamari or salmon cakes. \n\nMy seafood favorites are: The broiled flounder stuffed with crabmeat, broiled filet of sole or the whole broiled red snapper-Caribbean style. \n\nThe drinks:Long island ice tea, all day any day. Then I was introduced to Ketel One w/cranberry juice and a twist of lime, OMG. \n\nDessert: Their famous original cheesecake, its delish by itself or with a cup of coffee.", "author": "Mac S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "The cheesecake is what they're known for, so don't be a rebel and just get it. I recommend the raspberry swirl, but all of them are five star worthy.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I mean...it's Juniors.  What's not to love?  :D\n\nThe desserts looked so good, I wanted to try them all!  But I held back, because I'll BE back!  Couldn't decide what to have for lunch, because everything that passed by our table looked perfect.  I ended up having a late breakfast of skirt steak, eggs, and home fries.  As expected, it was tasty!  \n\nThe carrot cake, devil's food and chocolate swirl cheesecakes were all recommended.  I had the chocolate swirl, and my travel buddy had the fresh strawberry cheesecake.  Both were flawless and delicious!", "author": "Tami F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Junior's is an excellent diner in downtown Brooklyn. The food is good (though not great, other than the cheesecake), the service is very good and the seating is very comfortable and nobody rushes you. All in all, a very fun, unpretentious diner with good food and service. And a great location, at least for some of us.", "author": "Andy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "Its taste like grocery store pastries... Very disappointing.\n\nI had the brownies...extremely dry.\nDevil cheesecake and red velvet cheesecake and they tasted cheap.  Nothing authentic about it.", "author": "Abby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Amazing beets, pickles and orange juice! Their burgers are amazing and the pastrami is fabulous here!! And you definitely need to try the plain cheesecake and the other types!! \n\nCozy and friendly place! Oh, definitely use the restrooms here: beautifully decorated and very clean! I love Junior's!!!", "author": "Masood M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Juniors just celebrated their 65th anniversary a few weeks ago, and it's no surprise why. Their food is timeless. They start every meal off with complimentary pickles, beets, coleslaw and bread. I love their breakfast, turkey and stuffing, Hungarian ghoulish, jerk chicken, chicken fingers and cheeseburger. But be sure to save room for the best for last. The original cheesecake is to die for.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "First time going to Juniors was last month, and food was bomb! Had to get me a slice of cheesecake to go!", "author": "Kenny Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Awesome food and service! Alnasir was our waiter I believe, and he was fantastic! Super cordial and friendly wl amazing customer service skills. Tried the fried seafood platter and it was legit one of the best I've ever had! And as Alnasir's recommendation, I tried the chocolate Devils food cheesecake which was THE BEST. Super light cheesecake paired with thick decadent chocolate cake, mmmmm. Can't wait to be back!", "author": "Fariha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "I can't claim this is the best cheesecake I have ever eaten - but while taking bites of it, there was nothing critical I could think of. It is definitely one of the best.\n\nI also had the pastrami reuben sandwich. First time having one, so don't have a comparison, but it was delicious! I've had pastrami before and this was tender and tasty.\n\nSo why only 4 stars? Well, the service was a bit clinical. The diner environment is a bit shabby. And the prices are eyewatering - $28 including tips for a reuben and a slice of cheesecake?", "author": "Dahokolomoki Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Love Juniors, Been coming for YEARS... Everytime I go no matter what time I get there I seem to get a spot right on Flatbush, right out front. The place is huge on the inside, never a wait am always seated right away. \n\nLove the pickle plate they bring. LOVE LOVE LOVE the pickles. \n\nHave tried soo many things here, great sandwiches. Cheesecake is good, but Im from Boston I love Cheesecake Factory better - Jrs Cheesecake is soo Rich \u0026 Cream Cheesy almost too heavy for me.  But def take a stop when you are in the city, Totally worth the little out of the way trip to Brooklyn!", "author": "Tracy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "I love this place! Wonderful food and drinks! From the manager Sammy to the best waitress ever Tasha ! Every time I walk in there I look out for Tasha! She is the best! Food is amazing-(try the wings) ohhh and the breakfast is amazing! And obviously u need to try the cheesecake!!", "author": "Ramona P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "holy moly Laura our waitress makes the most amazing Vanilla Egg Creams in brooklyn. She's in competition with my grandma straight from east flatbush. Ok i'm convinced she has the best egg cream game in BK, not even lying. The cookie monster sundae is awesome too", "author": "Helayne K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "GREAT CHEESECAKE, if there is anything you have to order, its cheesecake. \n\nI have only been here twice (Times Square location), the first time I had a sandwhich but honestly dont remember what it was but it was alright but the waitress we had was fantastic and funny, havnt seen her in a while.\n\nThe second time was just horrible, service was all over the place, the fried chicken platter was nasty, small, and overly priced. just not worth the misery.\n\nBut again I cant emphasize enough on the cheesecakes; so do yourself a favour and forget the food go for the deserts.", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "You have to save room for cheesecake. In fact, skip the meal, and go straight to cheesecake! The actual food is kind of pricey and not too tasty (but large portions, which we like). Did we mention you just have to get cheesecake?", "author": "Sweet H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Greatest place on earth My buddy from Brooklyn brought some for us and it is great.", "author": "Sonny L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "Will this be considered a fair review considering I didn't actually have the cheesecakes there?  I was visiting the in-laws and, as usual, did not have the time to do anything I wanted.  I planned for days to go to Junior's but it didn't happen.  Luckily through reading Yelp reviews, I found out that the cheesecakes could be ordered online and delivered across the nation.\n\nThere were more cheesecake flavors available for delivery than I saw on their online menu for dining in.  I ended up settling on the Favorites Mini Sampler, which consisted of six of each flavor: raspberry swirl, red velvet and devil's food cake.  It cost $44.95 plus $12.00 for 2-day UPS shipping.  Note: It still took a week before it was actually shipped, so if you need it for an event, place your order well in advance.\n\nThe cheesecakes were shipped frozen, in a giant Styrofoam box with five pounds of dry ice.  By the time they arrived after a two-day travel, almost no dry ice remained and the desserts were slightly softened.  The idiot UPS guy left the box out in the sun and didn't even bother ringing the bell to notify me of a delivery.  It even described on a note taped right on the box, next to my address, what the shipment contained, but I guess reading is not part of this guy's job requirement.\n\nSo I read the paper that came with the package and it said to eat at room temperature.  I couldn't wait considering I already waited a week for them to come, so I sampled all three as they were in-between soft and slightly icy.  Terrible.  Just terrible.  It basically tasted like the four flavors sampler cheescake box that I bought several weeks prior from Trader Joe's.  I waited again until they had completely defrosted and much warmer than room temperature and they were much, much better.\n\nThe consensus is that they were average desserts and nothing special.  I did not like the cake base.  It totally needs the graham cracker bottom.  The raspberry swirl was the best (and largest of the three) and did not have a base at all.  When I was considering which sampler to purchase, I was disappointed that I had to get the raspberry one with my order considering I bake raspberry swirl cheesecakes myself.  But in hindsight, I think it was good to have Junior's for comparison and sorry, Junior- yours cannot hold a candle to mine.  My raspberry swirl cheesecakes are so much tastier, with fewer and better ingredients, no preservatives or things that I cannot pronounce and they sit on a thick graham cracker base.\n\nThe loser of the three was the devil's food cake, the one that I was looking most forward to because my sisters and bestie all wanted that one.  Methinks they're going to be sorely disappointed.  It was too rich.  The red velvet wasn't bad.\n\nMy conclusion is I will probably not order for deliver ever again, unless I go the the restaurant itself and try out in person the other flavors that I really wanted, which was the plain/original and the strawberry shortcake one.  It was just too expensive to order all that cheesecake and pay all that shipping for possibly something I was going to hate.  Maybe next time I'm in NYC...\n\nP.S.- I posted a photo of what showed up on my doorstep.", "author": "Kera K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "Do you like dirty restaurants with flies buzzing all over the place? Do you like uneducated, ignorant, disrespectful servers serving overpriced, mediocre cheesecake? Then this place is for you! I brought my wife and a friend here last Friday and it was an experience to forget. As flies continually landed on our table and in our food our server's brilliant response was....well if you don't like it you can leave and I'll take your food. YOUR RESTAURANT IS DISGUSTING and NO ONE cares at this place. I think they get their wait staff from the work release program...at least that's how they act. Many better options close by. Forget this tourist trap.", "author": "Ricky V."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}