{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "Somebody say cheesecake?  I'm there, Especially when it claims to be the best!  It's absolutely my favorite type of cake.  So when I saw Juniors featured in my Lonely Planet book, I made it my mission to go.  I walked the Brooklyn Bridge and enjoyed a walking tour from my book and ended this adventure with a slice of cake from Juniors.\n\n[The Cake]\n\nI ordered a traditional slice of cheesecake.  Very good!  It was simple yet splendid in flavor.  The cake was not overwhelming in favor and had a thick and smooth texture.   I was pleasantly surprised because I had expected a super sweet cheesecake like the Cheesecake Factory.     This cheesecake is perhaps one of the best cheesecakes I have ever had...only coming second to my very own cheesecake. ;)", "author": "Brandi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "I stick to the cheesecake here haven't tried any of the dishes so can't comment on it.  That being said, the cheesecake here is unbelievably delicious!  Love the raspberry swirl.", "author": "Rocky F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-06", "description": "Best Cheesecake EVER!\n\nWhen my parents were in town visiting we got some cheesecake from Juniors and every time since my dad asks me about it, and wants me to bring it with me when I visit.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "I came here because Puff Daddy made Da' Band walk here to get him his cheesecake.\n\nIt's good. Puffy knows his cheesecake. Thanks Diddy!\n\nI'm gonna go dust off my old Puff Daddy \"No Way Out\" CD and give it a spin now. Take that take that take that.", "author": "Jay W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-26", "description": "Sorry, but no matter what anyone says or how much I've been forced to eat cheesecakes from this place thanks to some of my ex annoying co-workers, I still don't see the hype over this cheesecake. Cheesecake is one of my favorite cakes to eat, but the ones I've tried from this place, at locations in BK and the city, tasted like mud and were just so heavy. It was extremely overpriced to boot. I think people hear the name \"Junior's\" and just have to say how great the cheescake is..", "author": "Incognito W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "The chocolate mousse cheesecake is incredible, but the berry ones (like the popular strawberry) are too syrupy/sweet for me. \n\nI've never eaten anything but cheesecake here, as the menu seems overpriced for a not-so-good diner, and isn't veggie friendly.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "I agree and it has been the best cheesecake in the world for quite some time.  I have personally visited the Brooklyn site, and even ordered online cheesecakes as gifts for friends in other parts of the USA.   The Cakes arrive frozen in pristine perfect shape, and you defrost them.  \n\nThe strawberry cheesecake is my favorite with gargantuan sized strawberries, the largest you will ever see.   They have many other exotic cakes and cheesecakes you can order too online.  \n\nDon't take my word, check it out for yourself.  ;)", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "Best Ginger Thai wings ever! Cheese cake, well what can I say...bye bye Lindy's Hello Junior! The cheese cake is to die for! Awesome aubiance and wonderful place. Love the music and the food who can ask for more. A must do in it the city!", "author": "Teresa E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "The cheesecake was one of the most fabulous I've ever tasted. It was busy but the food was banging and the service was phenomenol. Its really some of the best cheesecake I've ever had in my life-not that I've had too many but it was a good time. Maybe it was just the company I had when I was there. Thanks Trevor for introducing me to this place.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "WOW!!\nFirst let me say that I am just basing it off the shipped cheesecake - I haven't even have yet to try the cheesecake at the restaurant which I imagine is even better!\n\nI love love love cheesecake, and have tried a tonne - never NY though\nWhile in Jersey City on business, had some shipped to the hotel to try NY cheesecake\nOH my - AMAZING! We got the sampler - plain, cherry, raspberry, chocolate - I have actually only tried the cherry so far, but it is definitely the best cheesecake I have ever had. So creamy and light - but still dense - all around amazing\n\nCheesecake lovers - this is a MUST try. It doesn't get better than this!!!!!", "author": "Mary T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "I've been back to this place several times now, and I haven't been disappointed as yet.  Cheesecake was awesome (recommending Choc Mousse and Strawberry Shortcake versions).  The meals were really good and I'd recommend the southern fried chicken breast ... burgers ... mini brioche pastrami sandwiches.  The restaurant has flashback appeal to it which is aided by the pic of famous stars from years ago, and the great music they play from the Motown era.  For me, eating here was like eating at home ... and when you're on the road as much as I am that is a very good thing.", "author": "D A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Did not disappoint, have not been here for 30 years. Food was top notch and plenty. Took legendary cheesecake to go to savor another day. Will be back shortly!", "author": "Mitchell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "Best meal that I had during my trip to NY. Atmosphere is great, service was wonderful. Breakfast was soooo yummy. I got oatmeal, fresh fruit and toast. Friend got grits with cheddar. Lots of yumminess.", "author": "Candice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "This is one of my favorite places to eat in Brooklyn. Yummy comfort food, service is always great, AND this is the original location. Don't fall for the locations in the city and elsewhere because they're overpriced clones without the same quality of food and service. Best part is definitely the cheesecake. One slice can be a meal on its own. I also drop in for individual pies for birthdays and other special occasions. Nothing shows how much you care like a Junior's cheesecake!", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-12", "description": "Their cheesecake is incredibly delicious, the size of the slices is very generous and it's worth every cent!  As an added bonus, Junior's also serves good deli food.  I went there a few days ago after a long hiatus and noticed their prices have increased substantially - but the food \u0026 service were as good as ever and the interior still looks great.  Junior's is a landmark of downtown Brooklyn, and their cheesecake is absolutely *terrific*.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "This place is a neighborhood favorite (and one I'd travel to even if I didn't live down the street). There's something totally authentic feeling about Junior's - the 1950s music, the drugstore seasonal decor - that would feel kitschy or silly anywhere else. The food is great, refills are free, and the pickle plates are endless, but it's the full experience that makes this a five-star restaurant.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-07", "description": "ok all I tried was the original cheesecake\n\nand it was like HEAVEN, it has been by far one of the most delicious cheesecakes I have ever tasted!\n\nI do not know if I can look at other cheesecake the same since this was soo good.\n\nI have to admit I was skeptical because I like my cheesecake with a thick crust, and Junior cheesecake did not have this but the creaminess was all worth it!", "author": "Liz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-14", "description": "I love their Traditional CHEESECAKE. It is a staple in my home for birthdays and valentines day. The strawberry daiquiri taste delicious virgin or non. i love the environment with its retro theme, its close to my job, and its in the heart of Downtown Brooklyn. If you are trying to watch the calories, share with a friend or someone you love....personally i get greedy XD.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "Amazing place,delicious food!!! cheesecake was like a piece of heaven on a plate.And they really know how to make a good cocktail! I loved the service too.  Always love coming back there !!", "author": "Tanya E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-09", "description": "Went there twice before in the past.  Tried 3 different entrees.  The food is not seasoned at all.  The kids enjoyed the cheese toast sandwich, and fish and chips, and burgers.", "author": "Janet M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}