{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-12", "description": "Oh my GOD, NOT THE SAME,  its a damn shame.  Who screwed around with the cake recipes ?  I've been a big fan of Junior's since the 70's and watched it go down hill in the last few years,  very upsetting for me and my family.  I remember delicious char burgers over an open flame in the front window,  GONE.  I remember a perfect \"sponge\" cake in the Strawberry Shortcake and the golden cake with fudge butter cream,  GONE.  The sponge cake now taste more like wet clay,  or Duncan Hines,  pudding in the mix...just nasty.  Why couldn't they just leave well enough alone? I just don't get it.... I was there tonight and wrote it off on my BEST NYV places to visit....the Icon is gone. Junior's is now  a mid-level, over priced DINER, NO KIDDING. I get better food and cake from a diner up the block from me,  for about a third the price.      I have so many wonderful memories of the original Juniors and hope tonights mishap don't ruin them.  I feel like a very good, ole faithful friend...has died tonight.  I'm hoping with all that's going on in Downtown Brooklyn (new development, etc...) someone who cares,  remembers and tries to bring it back to it's former glory.", "author": "john b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "All I have to say about Junior's is cheesecake...mmm...cheesecake...\n\nAnother spot I had to hit on my first trip to New York, and another winner! I didn't try anything but the cheesecake, and it was fantastic! I actually ordered the devil's food cheesecake, expecting to get a piece of cheesecake with a ribbon of chocolate in it or something...what I actually got was a massive piece of devil's food cake with cheesecake as one of its layers! It was like choco-cheesecake heaven.\n\nDefinitely worth a trip to Brooklyn, although you can also visit their two locations at Grand Central Station.", "author": "Art D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "I have mostly eaten here for breakfast so I can't speak for the other meals, but they make a hearty breakfast of fine quality. Junior's can feel like a diner or it can feel like a family restaurant, or it can feel like a date spot-- depending on if you sit at the counter or a booth or a table, and who you drag along with you-- your snot nosed kid or grandmother or a hot date or go by yourself. Slightly more expensive than the average Brooklyn diner but with style and quality to justify it. Bathrooms that are not scary. And they're famous for cheesecake, but I don't know... who can judge cheesecake? I mean, someone can, for sure, but what a thing to be an expert on! There's no way a cheesecake expert could escape being under 300 pounds. Cheesecake should be heavier than concrete, and dense enough to stop a bullet, and never mistaken with a health food.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "Always great for their cheesecake! This is one of those places that you'll travel for if u get that sweet tooth!", "author": "J D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Get real. You go to Junior's knowing it's a tourist trap. This is not a neighborhood haunt; it's a place to take your guests when they visit from Indianapolis and want a taste of Brooklyn (a la Disney). The fact that it looks like Brooklyn's version of Radio City, with nostalgic atmosphere and a scrupulously courteous wait staff earns this joint four stars - it's exactly what anyone in his right mind would expect, and a little bit better. Tbe cheesecake is rich and as heavy as a Steinway; classic New York. (For GOOD cheesecake get ricotta cheesecake from a good Italian bakery!)", "author": "Diego C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "I went here on a recent trip back to our hometown with my husband.  The service wasn't that great ( waiter took too long to come to our table), and the food was, okay.  I ordered Brooklyn-style buffalo wings, a cheese/potato soup, and my husband had a roast beef sandwich.  We both had regular fountain drinks and at the end we had a cheesecake.. The cheesecake was really good, and really big for a slice.", "author": "Sara V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "Let me start by saying that cheese and cake are two of my most treasured foods in life besides meat. When I went to junior's and ordered the devil's food cheesecake and took my first bite I could have left and died a happy little girl. I can't say much for the plain cheesecake but the devil's food cheesecake is a little slice of paradise.\n\nWord of advice: bring a friend. The cake is so decadent that I doubt it can be finished by just one person.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "Skip the heavy, greasy, mediocre food. Go right to the bakery. \n\nTheir classic cheesecake is dreamy. Dense, flavorful with lemon \u0026 almond and melts in your mouth.  There's a reason it's famous. \n\nBut my favorite? The towering lemon meringue pie. The height of the meringue defies all logic. It's carmelized and studded with crystals of sugar. The lemon curd is sweet and tart. And there's a thin layer of angel food cake between the layers. \n\noh. \n\nmy. \n\ngod.", "author": "Emma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "The egg cream, the pastrami on rye, traditional cheesecake = excellence", "author": "Ericha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "great cheesecake, great service, great mazha ball soup but everything else is sorta so so, soggy fries, large portions. always a great place to stop by", "author": "Geoff K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "You know what.  I don't really like Junior's.  There-- I said it.  \nI don't understand what other people are eating that makes them think this is a full menu.  It's all sandwiches.  It's really not that great-- it's just been around for a while.  The food tastes okay.  I had the special the last time I was here (even though I don't really like it-- I go-- because it's always there!) -- it was A warm turkey sandwich with smoked gouda I believe.  It was just a sandwhich-- lots of meat, but definitely cold cuts-- not real turkey off the bird as I would've expected for $13.  I could make the same sandwich with $5.  I should start charging people to come my house if they love paying for this mediocrity. \"THE J.  JR's!\"\n\nThis was the first time I've been there during the playoffs-- a good amount of tv's near the large bar.  The cheesecake is good, albeit inconsistant.  Sometimes I get huge fresh delicious slices, and sometimes I once again imagine that I could've made this cheesecake myself-- then left it out for a couple of days and charged you $7 for it.  \n\nIf you want to go, to say you went-- by all means go.  If you came on here looking for a great place to eat-- keep looking.", "author": "The J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-02", "description": "I like to go to Junior's for a burger.  The rest of the food isn't bad though.  I especially like the fries and I like the fact that they give you enough cornbread, beets, and pickles to fill you up before you even get your meal.\n\nThe cheesecake is pretty great, although I must admit I'm not too into the cakey bottom.  I am a graham cracker crust type.\n\nI do not like bathroom attendents.  See my post in Talk about this.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "I only go to juinors for their cakes. so I compeltely recommend trying their strawberry shortcake cheesecake and carrot cake cheesecake. \n\nits a very interesting sensation to have the cakes balance out the rich creamyness of the cheesecake.  \n\nits... soooo good.", "author": "Candice A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-01", "description": "Defintely a glorified diner.  Cheescake is good but the sit down menu is just eh.  \n\nI think the service has deteriorated significantly in the past several years.  I've decided I'm done with this place.  I just don't like when places/people feel they are entitled because its \"famous\".  \n\nThe last time we went was on a Sunday morning for brunch.  SERIOUSLY must've waited 25min for the waiter to come and he was grumpy.  We didn't have water, bread - nothing.  I would've left but we were waiting so long we felt like we had to stay.  He wanted to come back to take our order but we said no, we would like to order immediately.  \n\nWhen our food finally came maybe 30min later he got me the wrong thing.  When I told him my order was wrong he told me I ordered it wrong!  Ahhhhhhhhhh!!!!!!  Now I have low blood sugar and this idiot blamed me for his mistake.  I'm still reeling over that experience.    \n\nDon't go to this dive unless you want sub-par service and sub-par food.", "author": "Mia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-03", "description": "Best Cheesecake ever - its the sort of thing everyone needs to do regardless if they live in NYC or just visiting.\n\nPS - Strawberry is the best!\n\nThe sandwiches are overstacked and hearty - I cant even finish one!", "author": "Liz V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "Chicken salad sandwich and a slice of cherry cheesecake and ur in heaven. This place worth the trek! Its not pricey, the people are friendly, and did i mention that the cheesecake is so good, it will make you cry, like really amazing!\n\nonly con, its not a great neighborhood, there's not much to do once your over there.", "author": "Kimberly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "Well I have been to every Juniors in NYC and Brooklyn is still by far the best.  The prices here are nice, and the menu is vast.  You can count on them having what you want and the service you like.  I live about 3 long blocks from here and I started going off and on 5 years ago when I moved here.  Every one told me to try the Cheese cake.  I like it but it still does not beat my moms.  Sorry.  Mom is Moms.  Just like a certain cake place here, nothing beats moms cakes, pies, cookies and such.  I have and use her recipes when I feel the urge to bake.\n\nThat aside, I love the chicken and rib combo, the sweet potato fries, mash potatoes and gravy and the fish be it catfish fingers, or the fish and chips.  I have had breakfast, lunch and dinner here.  They have the BEST pastrami and corned beef I have tasted in my life.  You have to use the stadium mustard on them. MM MM good.\nThe coffee is smooth and plenteous, they will give you as many refills as you like.   \nTo me this place is a neighborhood staple, a little ole cafe.  Mind you the prices are about double the average neighborhood cafe, but it still is good old American food and in portions enough for 3 meal each. I always have to take the rest of mine home.\nIt is good eating none the less.", "author": "Catie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-05", "description": "This place is a bit tricky....but I've tried and tested it for so long that I've decoded the formula;\n\n1. The cheesecake is over-rated. (I'm from Philly, I know cheesecake, and my mom's trumps theirs by far because of crust, mainly) their crust is upsetting, and their toppings taste way mass-produced. Go with the milkshake instead (if you're eating in)\n\n2. The best thing at Junior's is actually their mile-high deli sandwiches. Get the corned beef \u0026 pastrami on rye with a side of fries. You might have to take some home, because the portion is huge, but the lunch special allows for a smaller portion-bargain.\n\n3. As for the rest of the menu, look at the place like a hyped-up, pricey diner. Diners are only good for certain things, and certain things only; mostly basic and bland classics served on heavy plates in an old-fashioned Americana way, with lots of food.\n\n4. When you order meat, esp. hamburgers, know that they will ALWAYS be overcooked by one-two temperatures from the way you ordered it.\n\n5. Their bar is very very liberal on the alcohol...management does not care if they doctor up your drink extra stiffly, so take advantage. If you sit at the bar (especially) you will not only get a colorful experience of regulars, old playas, young playas, creeps, tourists, and a few other characters, but a strong drink and probably a very memorable conversation.\n\n6. Their service always ranges between bad and terrible. People act like they're doing you a favor by serving you, and management doesn't seem to care. You have to schmooze to get decent service, basically.\n\n7. In my opinion the best things at Junior's are:\n\na. deli sandwiches\n\nb. the fries!! (who else has good steak fries in Brooklyn?) the sweet potato fries are damn good, too.\n\nc. the milkshakes, floats, egg creams and sundaes\n\nd. the stiff drinks (even though their drink menu is cheesy)\n\ne. breakfast menu (their cornbeef hash is good, so are eggs, french toast, and other stuff that's hard to mess up, etc.)\n\nf. side of spaghetti (it's really good!!)\n\ng. mashed potatoes \u0026 gravy\n\nh.  a few other things that I can't think of right now, but that's the jist of it\n\nSo go at your own risk, and remember....everything's hit or miss so stick to the formula!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "The Cheesecake is divine as most of you probably know, and the food is actually pretty good too, if this wasn't a cheesecake place it could still stand on its own as a highly above average diner. \nWhen I need to indulge my diner tooth and sweet tooth at the same time I like to come here at the wee hours of the night/morning and drive right up to the place and park out front.", "author": "Gee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "Yummy cheesecake; though nothing amazingly exciting or delectable.  I got the red velvet. \nApparently, a lot of famous people go here. I saw an autographed photo of former President Bill Clinton on the wall. That's pretty special, right? Blessed by the president, haha! Convenient location, since the Brooklyn Bridge is only about 5 minutes away (in a cab).  \nThe staff in the take-out area is very friendly, the staff in the sit-down area is kind of not. Restrooms upstairs rather large, and fairly clean. We had to order a couple appetizers in order to be allowed to sit down inside. Service alright. \nI probably wont go back unless it's in some kind of touristy schedule for friends who have not been to Brooklyn.", "author": "Monica G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}