{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "The ONLY reason Junior's is getting four stars is because of the food. It wasn't that good and a little overpriced. The service was suuuuppperrrrr slllooooowwww but we weren't in a hurry anyway.\nBut enough about that. On to the cheesecake. Or heaven on a plate. I got the apple crumb cheesecake and almost died with the first bite. It looks dense but it is really light and melts in your mouth, literally melts. I have never experienced an orgasm from food until I had this cheesecake. Will definately come back next time I'm in Brooklyn.", "author": "aTLien J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-06", "description": "Although I have publicly hated on the 'bees (http://www.yelp.com/biz/applebees-brooklyn-2) I thought it was time to try another watering hole when I have to \"wait in the area\".\n\nEnter Junior's the renown restaurant and cheesecake factory. There are two entrances. There is one for the restaurant/cake pickup and the other is the bar.\n\nOn the several occasions I decided to dine in, food and service was copasetic in general; sometimes service was inattentive. The bar has little soul and exudes the enthusiasm of a baked potato. Ever drink with a friend at a bar and have the urge to stop because you're depressed and uninspired? Reread that last question; I moved myself, too.\n\nCall me crazy, but unless I want to buy a cheesecake for someone really special, I'd rather be at the Grand Central Dining Concourse location (http://www.yelp.com/biz/juniors-restaurant-main-concourse-new-york).\n\nThis is a place where you should try once in your life and determine from there if you want to go back. It's not special to me (and I foolishly returned at least 3 more times).\n\nIFHTP 3+", "author": "Peter K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-08", "description": "Went for a big family deal (birthdays and anniversaries all within a 3 day block) and all was good with the food. Great portions, strong drinks, plenty of sides, etc etc. Then there is the gift card debacle.\n\nLet's backtrack. A few months ago I got my father a gift card from juniors for $40. Getting this giftcard took 30 minutes, I was sent all over the restaurant upstairs, downstairs, finally to a manager who looked at me strangely, and had to disappear \"to the back\" for almost 10 minutes just to find one. wtf? Ok so I finally get one, dad gets it, is happy. \n\nHe then finds out that he has to validate it (like parking?!), in store, before he even tries to use it at the end of the meal. wtf_2? Is it so they know he has $ to pay for his meal or something? Especially since the waiters are ecstatic that they have to swipe a GC for no reason. Ok so he swiped it and validated it , $40. \n\nAt the end of teh meal, my pop puts it in with the credit card for the waiter to swipe. The waiter comes back, just under 15 minutes later, and says that there was a mistake, he only swiped $30 off of it. WTF_3?! How can something that happens automatically be an accident. BS I say; the manager likely saw the GC, told him to take 30 off, so now we have $10 left, which means hey we can come back right? That's an elementary school con job. Its like when you're paying a $6 taxi fare with a $20 and the guy says \"oh I have no change.\" Not wanting to make a scene I accepted the excuse, because it's not the waiter's fault he works for a vinegar \u0026water cocktail.\n\nMassive loss of stars, despite good food, for being so desperate for business, that questionable tactics are used to keep people coming back, as if I wouldn't have before (seriously questioning it now). The cheesecake should be what generates business, not swiping sketchy plays that come from cab drivers rulebooks.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Junior's is a definite MUST if you're visiting New York.  And if you've been living in New York and haven't yet gone, what are you waiting for??  Junior's offers one of those quintissential New York experiences - you see people coming here from all walks of life, all ages and races, from the tourists to the oldtimers, all enjoying a great meal under one roof.  \n\nAside from the delicious cheesecake and heaping portions of comfort food, Junior's also boasts a friendly and efficient staff of servers all clad in black pants, white shirts and bowties.  You get the sense that these guys have been working here all their lives and may very well be 2nd generation Junior's servers.  For that fact alone, Junior's has so much character.  \n\nIt is definitely one of the establishments in the city that not only deserves its title as a \"New York institution,\" but also maintains its vibrancy and quality as such.  It is not staid or stuffy, overhyped or overrated, past its prime or a sell out.  It is simply a great restaurant with awesome cheesecake that's worth crossing the river for.  As long as Brooklyn exists, so should Junior's.", "author": "Kristine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "i was really happy with Junior's. It's a very tourist driven place, but accordingly they were moving people in and out with lightening speed. We got out of an amazing production of the Lion King and happened upon Junior's on a fluke.\n\nThe servings are MASSIVE so I would suggest splitting a dish. We shared a bbq chicken salad and a slice of blueberry cheesecake. The food was really good/fresh, and the service was speedy and efficient. When the weather is nice Junior's is the place to dine outdoors and people watch. Luckily I was there for 85 degree weather and an early dinner so with the sun shining bright and drinks in hand nothing could be more perfect.", "author": "M M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-11", "description": "I just don't see why this place got so many positive reviews. I find the food to be nothing special at all. The cheesecake is ok (3 stars for that), but the food itself is gross. I ordered buffalo shrimp as an appetizer; it was so gross that I told the waiter not to bring my meal. It literally tasted like shit. I'm pretty sure the shrimp was rotten. My bf got a hamburger and I quote his opinion: \" The burger tasted like it was infused with gas from a stove\". After his nasty burger and my rotten shrimp we decided to split some calamari because he was still hungry, and we were taking a cheesecake to go. We got calamari-- how could u mess that up. The calamari was just full of grease, and the marinara sauce was nothing special at all. Take it from someone who LOVES to eat, this place is all hype because of the name and the cheesecake. There are soo many other spots you can go to get much better desserts and meals. \n\nAs far as Junior's cheesecake I've only had the strawberry one. The strawberries they put on top are in this jelly-like sweet stuff that ruins the whole taste if you don't wipe it off. There is no graham cracker crust which kind of pisses me off, but hey that's the way they make it. I honestly don't see how so many people rave about Juniors cheesecake and/or the restaurant.", "author": "Sonny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "You must try the apple crumb \u0026 carrot cheese cake... It has to be a sin to eat them because it's so good !!!!", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "Brooklyn staple and it was one of the first stops I made when I hit BK. had to have the cheesecake and it lived up to all the hype and more. Definitely will be back!", "author": "S S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Every New Yorker (and just about every out of towner) knows Juniors is the place to go for great cheesecakes. While I personally am not a big fan of cheesecake, I must admit Juniors Strawberry Cheesecake is delicious. Now moving on to the rest of the restaurant (in case you guys forgot they do serve actual food Lol)\n\nLunch: I had a cheeseburger with fries..I know pretty basic..but what do u expect me to get when all they re famous for is cheesecake. :-P\n\nBreakfast: (Yea I was surprised they served this too) I went one time with my best friend..We were greeted..correction..shouted at..by the hostess(too nice a word for such a miserable person)..she gave us attitude for not seeing her slouched off in the corner and just walking to pick our own tables. After we were \"seated\" our waiter came and took our drink orders and later came back with a tray of delicious pastries (Yum). I ordered cranberry juice..It came in what reminded me of a tall shot glass (and went just as quickly). I got the Belgian Waffle..My best friend got the French Toast..We had no complaints. Both were delicious. And when we got the bill I was very surprised at how cheap it was (20 for the entire meal!)\nSo other then the bitch hostess(that sounds more fitting :-) )  and the Teeny tiny Juice..It was a pretty good experience.", "author": "Shanell P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-21", "description": "Ooooh yeah. Stopped by this afternoon with a friend, she told me that as a cheesecake lover, there is no excuse for living in Brooklyn and not having been to Junior's. Hey, I've only been here a month, gimme a break! But yeah, even a month was too long because this was DAMN good.\n\nI had the pastrami on rye for lunch, dear jesus, it was delicious. Definitely compares to Katz's. I mean, this was proooobably the best pastrami I've ever had. Granted, I don't claim to have tried all the pastramis in the land, but you cannot go wrong with this sandwich. My friend had the half roasted chicken, which came with rice, mashed potatoes, applesauce and a soda for $15. Not a bad deal seeing as that will make for at least 2 meals. And it was gooood.\n\nBut what we've all come here for: the cheesecake. We got the original topped with strawberries. Amazing. I kind of wish we'd just gotten the original plain (or maybe the chocolate mousse) because the strawberries came with this kinda gross jelly and a bunch of the berries still had stems! But the cheesecake itself made up for all that. Thick, creamy, crumbly crust. And huge! Excellent splitting size. I don't even know how one person could down a whole thing. (I say this now, but I'm sure I could manage given the opportunity, heh). Can't wait til next time.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "Service was great, corn bread was good, and the burgers were HUGE. The corners of my lips hurt. \nGot a slice of strawberry cheesecake to-go and it is now waiting for me in the fridge. (Waiting for stuffy nose to clear up). It's the best.", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "Mybe I'm the only person in New York City that's not all that impressed with Junior's, but I'm not.  If not fo rthe cheesecake, this place would have been closed a long time ago.  Why? Because the food sucks!!\n\nI'm sorry to disappoint some folks out there but the food really, really sucks and the service sucks too.\n\nBut, woohoo for the cheesecake, which I tasted to see what the hype was about since I'm not that big on cheesecake.  So there, that's my Junior's review, if you don't like it, then...then...I don't know.", "author": "Rose F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "Cool- I get to be review 201!\n Yes, they make a very nice cheesecake. It's a taste of old school NY and you gotta make it here for Breakfast someone needs to explain to me how they get their omelets so fluffy.", "author": "Jerry H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "Junior's reminds me of my childhood.\n\nI still vividly remember spending Sunday mornings there, with my family. I'd pile into the car along with my two brothers and parents, and we would go to Junior's. We'd walk inside and breathe in the aroma of freshly brewed coffee. We'd sit at a large booth and look over the menu,  although I'm fairly sure we all knew the breakfast menu by heart. We'd eat and laugh, and enjoy Sunday mornings together.\n\nIt's been about fifteen years since we did this. My brothers are married with children, and one of them lives halfway around the world now. We no longer have this same Sunday morning tradition. But, on my father's 57th birthday we decided to take a stroll down memory lane for breakfast. When we got there, I was struck by how little had changed. Everything looked, smelled and felt exactly the same ... in a good way! I love how walking in is like a blast from the past. The waiters are friendly and familiar, they feel like long lost uncles when they bring me my juice and toast.\nWe ordered our food and while waiting for it to arrive, enjoyed the tray of assorted pastries and rolls that sits at our table. These, too, have not changed over the years.Sticky sweet mini danishes filled with blueberries or cheese --- they remind me of the good old days.\nOur food arrived and everybody enjoyed the meal. My Mom proclaimed her Eggs Benedict to be delicious, and my Dad and I enjoyed our standard two eggs with hash browns, mine with sausage and his without.\n\nI agree with the masses --- the cheesecake is fabulous. It stands alone and is well worth a trip to Brooklyn just for a slice. \nBut, I've never had a meal other than breakfast at Junior's. I have no desire to do so either. And while you can indeed find a hearty, satisfying breakfast in a great many places, you won't find the unchanging ambiance that Junior's provides. It's probably just nostalgia talking, my blathering but affectionate memories of days gone by, but Junior's will always have a place in my heart.", "author": "Camille M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-07", "description": "I've heard the hype, so I had to try it.  Went for brunch (my weakness), and discovered a very pleasant, friendly staff.  If you go to Junior's bring your pants that stretch, wear sweats, or if feasible, go pant-less, because they will give you enough food to feed six blocks of China Town!  It's diner food, so don't expect pop-rocks to go off in your mouth, but it's hearty, satisfyingly fattening, and lots of it!\nNow I could not try the cheese cake as there was simply too much food!  Tell me, is the Cheesecake that good?", "author": "Thom B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-24", "description": "This rating is strictly for the cheesecake, not for the actual restaurant or other food on the menu.  I'm going against popular Yelp opinion here, but...\n\nI've heard the stories, I've heard the legend.  My local wine guy even told me about the best dessert experience he had with a cold summery wine and a slice of Junior's cheesecake.  So I sampled two slices.\n\nMaybe it's just me, but I expect my cheesecake to have a buttery, crumbly graham cracker crust.  Not a soggy tasteless cake crust.  \n\nThe cheesecake filling is okay enough, though not tangy or creamy enough for my liking.  \n\nAlso, if you'd like two inches of waxy chocolate frosting, chocolate cake that will sit at the bottom of your stomach for 24 hours, and maybe 1/2 inch of cheesecake that is just \"meh\", then Junior's \"Devil's Food Cheesecake\" is calling your name.  \n\nI think I'd rather have Sara Lee.  My \"Great Cheesecake Search\" continues...", "author": "Caroline B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "In one word: OVERRATED.\n\nIn more words: you're better off going to the Cheesecake Factory where you will find a whole array of different flavored cheesecakes. I believe Junior's has had it's fair share of fame but it doesn't have the same taste as it used to.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-24", "description": "Went last night. My whole family got food poisoning from there very average tasting cheesecake, which is all we had. Horrible. Bah humbug.", "author": "Marianthy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-12", "description": "Why are all the servers crazy miserable here? \n\nOh. \n\nYes, once you do a turn around this place you'd want to get the fuck out too. Don't get me wrong, it's orderly and clean--- just the vibe is not right. Nobody is here for that much fun. The cheesecake is fun for five bites. The bathroom attendant sprays freshener in your general direction while talking loudly on her cell phone, orders are forgotten, and it takes a very long time to flag down a server. \n\nThis place has a lot of history. Bill \"quadruple bypass\" Clinton came here. He then sent them a letter of gratitude. Unless something happens really soon, this restaurant will feel like as much of an obligation as the letter the aide had to type.", "author": "Lisa Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Best. Strawberry. Cheesecake. Ever!\n\nThat's the only thing I get here. The best part? You can order their cakes if you don't live near there!", "author": "Tiffany D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}