{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I love the Buffalo shrimp. Just make sure they are not cheap with the sauce. The vegetable omelet and bagel an lox are all good. My sisters love the burgers, turkey and the beef, both juicy goodness. Lemon merengue is our favorite dessert. I hope they stay in Brooklyn forever", "author": "Genie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Close your eyes and you taste an American Apple Pie. This cheesecake was delish! It's not overly sweet. It's full of flavor. I wish there was a Junior's in North Carolina.", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Had a great time here. Prices are what you would expect for a deli, al little pricey BUT the food is delicious!  This place is an institution, its been around forever and it shows in the quality of the food!  Will eb back next time I am in Brooklyn!", "author": "Brett R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "The cheesecakes are bar none. But, this trip... We didn't get to have a piece. Because we sat in the front section which was the café area and they only had two servers... We didn't get half of what we ordered and what we did get we had to wait an hour for... And of course it was cold. Next time I'll just go get the cheesecake online and have it delivered.", "author": "Kris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "I had business in downtown Brooklyn and afterward decided to stop at Juniors for a bit of refreshment and a pick-me-up. I sat at the counter and ordered cheesecake and coffee. But this wasn't an ordinary piece of cheesecake. Juniors offers an array of cheesecake that surpasses any chain cheesecake restaurant. I ordered the red velvet cheesecake. It was a thin layer of moist, delectable red velvet cake topped with an entire New York style cheese cake and on top of that was another layer of red velvet cake topped with a thick layer of cream cheese icing. Needless to say, this was not a low calorie treat. It was delish and I had coffee with it. It's also quite possible to take half of the cheesecake home.\n \nThe waitress was super attentive. I wanted milk, not the half 'n half she offered. She quickly got me a small pitcher of milk. She refilled my coffee cup three times and also refilled the milk pitcher.\n\nJuniors is a 50s style deli with hustle and bustle. One of the managers asked me how I enjoyed my meal. I've eaten there before and that's kind of standard for them. They ask. The cheesecakes are incredible. Other baked goods are very good too. The food is diner food.", "author": "Nike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "I live in Brooklyn. Expected better from this location. The waiter messed up my order. Wasn't hospitable in any way. Never smiled. \nWould not return even for the cheesecake. \nThanks sucky waiter\nAnd I'm glad I'm going to be dentist tomorrow so hey can help me clean all this junk I ate at this place.", "author": "Luis V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "I ate at Juniors last Saturday for the first time that I can remember. Had a late breakfast. Was seated right away. 10 minutes later was served a cold cup of coffee--not even lukewarm--COLD--LOL! Sent it back and got a fresh, hot cup.  Didn't get served my breakfast for another 35 minutes!  They brought bread and butter,  but I WANTED MY BREAKFAST, durn it!! When it finally came it was good! Haaa  I would go back. Didn't get dessert this time...", "author": "Gwendolyn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Juniors hands down has thee best cheesecake I've ever had. It's a must whilst visiting NYC. I had the original and it was exquisite paired with coffee.\n\nAside from the cheesecake the service was wonderful, the place was packed the evening I was there.", "author": "Wendy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Besides one waiter with long braids and a very unpleasant look kept giving me and my friend a dirty look while we waited to be seat on, i had a good experience the food was good overpriced a little the diet coke is horrible water down, the cheesecake was amazing though i had the apple one and my friend had red velvet, i guess the waiter that was looking at me thought me and ny friend were homeless are some shit cause i had to bring it to the manager attention and tgen she never came by our table again", "author": "Raneisha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Best cheesecake in the world?  That's a bold claim... Rare for folks to make it but even rarer to live up to the hype.  I don't even like cheesecake, but this was amazing.  A thin doughy crust perfectly complements the thickness of the cheesecake above.  Strawberries as big as your head pile high above the cake and the combination of it all takes you places.  Seriously - grab a slice and you can say thank you to me later", "author": "Ed C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "I love their desserts. Cheesecake, strawberry shortcake, pie... Delicious. \n\nAll the portions are generous. The omelettes are gigantic. There is a lot of corn beef hash. If you don't  want the entire pancake order, you can ask for a single pancake. Probably true for the French toast too.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "The red velvet cheesecake is absolutely delicious. I also tried the red velvet CAKE. It was good but I prefer the cheesecake. Would highly recommend for dessert!", "author": "Hannah V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Our server Joi was truly a joy. My second time here and went to the juniors at Times Square many times but Joi here served us truly so well\n\nGreat service, friendly staff, responsive, kind, genuine. Food was served fast and well\n\nThe strawberry cheesecake ($8.35) with coffee always hit the spot \n\nThank you Joi!", "author": "Yun Chun C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Only had cheesecake as had heard it's a must at this iconic restaurant. \nI must say it was awesome and definitely the best I have had! \nService was great and the place looks 70's cool... love it!", "author": "Damian A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Not sure what exactly people are raving about!? Went to this place after a terrific show in Barclays only to ruin our experience with disgust! Don't get me wrong, place was packed but quality and cleanness were questionable at the least. Table was sticky and smelly as if the fresh vomit was just wiped out. In fact that was the smell of the entire restaurant!? Yack, but we were super hungry and ordered their \"famous \" sandwiches, I had turkey with coleslaw and beef tongue, both came dry and stale, slices of Swiss cheese looked like a year old at least! Drink overloaded with ice and tasted as dish washing detergent. Pieces of food scattered all over the floor. Disgusting experience!", "author": "Miss P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "The service here was really nice. I wasn't a fan of the salad, but I took my class here on a trip and we had a fabulous time. The service was excellent. I enjoyed eating with my students. We ordered the sundae and got the chocolate mousse cheesecake. The kids had a great time.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I may risk any credibility I have with this review, but I'm willing to take that chance. My family and I came here, a group of 12 or so. I tried about six different entries, and ordered an unconventional item myself, specifically the jerk chicken with collared greens and rice and beans. Surprisingly, the food was all very enjoyable. Brisket, tongue, jerk chicken, mac and cheese, pancakes, among others...everything was good. So I figured that the food was good, the dessert would be great, slam dunk. Strange thing...the cheesecake wasn't great. Don't get me wrong, it was fine. Just nothing special. Ultimately, I've had a lot of NY cheesecakes in NY; this one was no better than many of the others. It was almost too think, wasn't that sweet, fine but nothing great. I actually enjoyed the low sugar one more than the regular. It was also disappointing that the waitress told us that they'd charge us $5.25 to add fresh strawberries to one of the cheesecakes. Still, food was good, dessert was good, service was excellent. A very good experience. I don't need to come back but I certainly wouldn't mind if I did.", "author": "Benjamin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Went here for lunch after seeing this restaurant on food network,  hearing the cheesecake was to die for.  \n\nStarted with a chicken salad sandwich which tasted like it came straight out of my grandmothers kitchen, for only 10.99. Finished with the Devils cheesecake,  probably one of the best cheesecakes Ive ever had! Wish I got some to go.", "author": "Dave C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "I always check reviews from customers before I visit a restaurant. I heard so many good things that I was really looking forward to eating at Juniors. My mom, boyfriend and I went today for Lunch. We ordered the bacon cheeseburger, western omelette and French toast with bacon. Before we received the food our waitress didn't offer us any of the complimentary dishes and I was wondering why since everyone else had it on the table. ( Beets, coleslaw, pickles and bread) we had to ask for them which I didn't like and instead of bringing us bread and cornbread she only bought us 3 slices of cornbread. But again I'm not too sure how that works, if you get it with a specific dish and what not.. The food was Ehhhhhh! The cheeseburger had no flavor and it was super dry. The omelette on the other hand it was really good but my mom got food poisoning and I'm not really sure why... the French toast was ok but too greasy because of the way it was deep fried ... tables were super sticky and the service was okay. Also, there's this other girl that works there in all black, not sure if she's the bus girl or not.. ( Alittle chubby ) she kept slamming the box with the utensils and had such a bad attitude in her face when a customer looked at her....overall, experience was ok.... I do not think I will be coming back here ....", "author": "Maria T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "A friend and I arrived at this location just before it closed and the \"Door Man\" was so rude. He was practically pushing her out the doorway and when we asked for a manager he told us that we couldn't speak to the manager. It was the most unprofessional encounter I have ever had at the location. We kept calling to speak to a manager and no one was answering the phone. I will never go back. I wouldn't recommend this location to anyone.", "author": "Kimberly R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}