{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Whenever I'm on the Northernmost portion of Flatbush Avenue, I feel compelled to stop by Junior's for their amazing NY cheesecake. I also enjoy the hot open turkey sandwich with gravy on the side.", "author": "George M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Cheesecake review only.\n\nHands down, best cheesecake with strawberry topping ever!!!  This will lighten my mood and tighten my belt EVERYTIME!! lol", "author": "Tammy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Was very excited to come eat, as I've been here in the past. Was recommended a burger. Would NOT recommend the Swiss steak burger. Burger patty was quite large, which to some would be great, if they seasoned it! Felt like I was taking a bite out of a cooked log of ground beef. Could not taste the mushrooms cheese or bread. James was great until we got the food in which he never came back to ask how everything tasted. Very courteous and attentive, but would've liked to order something else. Other items looked great and the building was well kept and comfortable. Will give it another try next time I'm in New York.", "author": "Aj N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Had breakfast with Ethan Hawke this morning! Was in the booth right behind me. Didn't want to bother him doing the family breakfast thing. On to the review:\n\nJuniors has been a staple in the downtown Brooklyn area since only God knows. Known for their cheescake, which I never had,  their menu is pretty vast. Their breakfast I must say is superior in Brooklyn, and a little pricy too. They make their own corned beef hash which is the best i ever tasted. Sundays are always packed with the church goers having breakfast, dinner. Ample seating. I usually sit in the back in the window by the bar. Before all the Applebee's, and Pizza, and food chains that came and gone. Junior's is still standing on the corner. And their food has always compared better. The picture of the waitress on the wall was a lady I remember from coming as a kid. If you never been to Juniors, it's worth a sit down, you will be pleased.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Got 2 pieces of cheesecake to go and loved them! The chocolate mouse one and the original one were both awesome! They were light and fluffy and just enough richness!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "My first and hopefully one of many visits to come.  Excellent food, surroundings and service. Ask for Marcelin or Michelle for a guaranteed dining experience. Prices are reasonable, you get a ton of food.  My wife and I share dishes and get a great variety.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "The Original. \n\nStarted with a Heineken ($5.50) and a Cosmopolitan ($11). The beer was cold but the Cosmo was a little on the weak side.\n\nNext up, the Baked Onion Soup ($7.95). Mmm, mmm, good. I especially liked that they used a seeded rye bread. It really brought out the flavor.\n\nThe cole slaw, pickles and beets were pretty standard.\n\nFor the main course I had the Corned Beef on rye ($13.50) and my other half had the Jamaican Jerk Chicken ($20.50). A okay. \n\nFinished off with a Brooklyn Egg Cream ($3.50) and a Raspberry Swirl Cheesecake slice ($7.25). Good stuff.\n\nWorth the nostalgia trip. \n\nAnd it's a four block walk from the Barclays Center, which was where were headed after our dinner.", "author": "Gregory C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-16", "description": "So it's super packed, the food is ok...nothing that memorable. Service was cool. Until the waiter told me the $5 dollar tip i added wasn't enough....\n\nLiterally counted his tip in front of me and said the suggested gratuity is $13. I understand, however, the service was not exceptional. This place wasn't 4 star quality. Im absolutely appalled, never coming here again.", "author": "Montinique I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "The cheese cakes are the best!!! However, it's getting more and more expensive D:...I went there for lunch with family one day, and the pasta was awful and tasteless. The service was meh, waitresses were not attentive, and need to call couple times. I'm pretty sure they're not busy at all, as there were few tables customers. The four star is for cheese cake only.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Love this place. The food is ok. The drinks and desserts are on the spot! Cheesecake of course is always great", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Really cool old school diner feel. I had the best waitress!! She was so full of energy even while still seating ppl 30 minutes before closing time. Ntm she is pregnant and still doing her thing. The food was good and the cheesecake was great!", "author": "Leandro M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Absolutely 5 stars!! This place has the best cheesecake in the world!!! Great tasting and a taste you will never forget ... I've been going here since I was a child.. great place to enjoy the best cheesecake ever !", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "I honestly do not know why people make a big deal about their cheese cake. It's ok. I find costco cheesecake way better.  \n\nAnyways the food here is good but not that great. It's a bit pricy but your eating at a well known restaurant.\n\nEmployees were very nice and sweet. It's clean and organize. Highly recommend. :)", "author": "Nora A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Huge portions.  I'd never been to one before \u0026 I don't eat cheesecake but I got the chocolate golden fudge cake as well as the grilled chicken sandwich with fries.  Prices are not cheap so it's not as much a time warp as you'd like.  The bathrooms have headshots of celebrities of the opposite gender in there; I found one stall that had a pic of Spike Lee in it \u0026 the one I used had a pic of Woody Allen. I liked getting the free pickles \u0026 had been dying to go to a Junior's at least once.  Glad I got my opportunity.  Since I don't eat cheesecake, I can't judge that but the restaurant itself was nice.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Came here Monday afternoon and was seated right away. Honestly the best thing here was the cheesecake! My meal was the chicken sandwich that had bacon and cheese on top with a side of fries. Very typical diner food and taste. Has to ask for iced tea refills a few times and she forgot to get my last refill. Food was bland, BUT GET A CHEESECAKE!!", "author": "Mr. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "I'm glad this landmark neighborhood place remains in business. Junior's is a well known restaurant visited by many and is good for friends, couples,  families or by yourself. The restaurant is situated along a great path for transit and and has many out of area visitors. The service is friendly and professional. They offer a wide array of food choices on their menu and have flexible hours.  \nYou can sit in the main dining area or Cafe. They even have an area for take out food if you wish. Also if you haven't heard about it or tried it yet, Junior's cheesecake is tasty by the slice or if pick up a pie to take to friends or family for an event.", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I love junior's cheesecake and you get a nice piece...I have coming there since I was in my younger days and I love there food to...I have been there on special occasions and social gatherings...I would recommended to everyone if its their first time... 5 stars....", "author": "Zakiyah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "The take out slices are a hit or miss. Sometimes the cake is moist other times the cream cheese filling saves the day.  A bit too pricy per slice of cake. However if it was cheaper I would be in there every day!", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "Went to dinner late Sunday night,  and everything seemed kinda of old and run down.  The food was ok.  I got a corned beef and pastrami sandwich and my friend got a vanilla milk shake and wings.  The dessert was a strawberry cheese cake-it was just ok.  The la columbe latte was excellent.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Great place and New York treasure.  Four times over past years I have ordered a sandwich on rye bread. Bread was stale each time. Inside fine.", "author": "Asylums P."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}