{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-17", "description": "Yummmmm Strawberry cheesecake..............sorry I got lost for a sec. So I ate dinner here and was surprised about the the famous juniors restaurant . But not in the good way. There's no doubt that their cheesecake is amazing(I haven't tried all the flavors but that's my 2013 resolution) but everything else on the menu.....straight diner food. The kind you go after the club where your so out of it that everything taste good. Then u wake up wondering what happened and how long you have to be at the gym today to make up for it. Sometimes desserts can be meals right?", "author": "Marie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "I have never been to this location. I am writing the review for the fact that we order it and have it shipped to our house. this is one of the best cheesecakes I have every had! We have ordered many different kinds. There is none that have disappointed! The price is worth the taste! I suggest buying some for you and sending them to those you love! \nWe just ordered the sampler recently. So good! you must try it!", "author": "Olivia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "There isn't better cheesecake in New York City.  This is coming from a guy, who as a kid, insisted on having cheesecake instead of birthday cake.", "author": "Benjamin F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-19", "description": "I live down the block from Juniors and therefore have had many experiences here. They have usually not been positive. Other than the apparently delicious cheesecake (I don't eat cheesecake), Juniors is basically just an overpriced diner. The staff aren't very friendly, especially in the bakery and take-out sections. Every time I go in there, I feel like they're mad at everyone for coming in.\n\nThe ice cream is not very good and the buffalo wings were disgusting. I recommend the matzo ball soup or the latkes (potato pancakes).", "author": "Alissa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Known for their cheesecake which I had planned to have for dessert; however, I could not eat anything else after consuming the copious amounts of food we were served. Hot buttery cornbread \u0026 rolls, pickles, beets \u0026 cole slaw were served as a starter. I finished with the delicious pulled pork sandwich that I am quite certain is the best that I've ever had in life. Couldn't bear to leave any on my plate. Going back for the cheesecake the next time I am in NY.", "author": "A A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "THIS CHEESECAKE CAN TRAVEL!\n\nso about 3 years ago, i wanted to bring 4 cheesecakes back to hawaii.  the TSA dude stopped me and said that they were considered a liquid or cream and that he had to confiscate them.  now, cheesecakes are not cheap so i asked for a supervisor.\n\nwhilst waiting for the supervisor, a flock of TSA people came to comment on the best cheesecakes in NYC.  hands down, they said junior's! ROCKED  in the meantime, the supervisor came over, opened all four boxes and then did some crazy test on them.  in the end, she let me bring them home even though \"it is against their policy.\"\n\nif you are a cheesecake person, please know that this is worth the hassle!  on my most recent mecca, i brought home cheesecake to rave reviews! \n\njunior's plain cheesecake - according to an employee - lasts 2 weeks (4 in the freezer).  i took a cooler bag and empty ziploc bags to the airport.  once on the airplane, i asked the flight attendants for ice and stuck them in the ziploc bags.  i replaced the ice once, and the cheesecakes made the 5,000+ mile journey (9+ hour trip).\n\nif the TSA ever stops you, the cheesecake - is in fact - baked.  turns out that they stop you in hopes of eating the cheesecake them selves!  thankfully, the female TSA agent told the male agent, who wanted half, to get his own!  true story!", "author": "Jay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "Stopped in here for dessert and I was not disappointed. Collectively my table got the original cheesecake, carrot cake cheesecake, and the strawberry shortcake cheesecake. All were great and really big portions.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "If i am there for lunch i always get Junior's corned beef or pastrami. Their breakfast is great too. The side of Danishes they give you are close to the top of my list when it comes to pastries. Of course the regular cheesecake is AMazing.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Simply THE BEST CHEESECAKE in the world.  Look no further and the restaurant is cozy and friendly and the food is also great.  This place is a must-go-to place for young people dating because it is an experience you will never forget.", "author": "Carla D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "Not sure why this place is serving food. The specialty here is nothing other than the cheesecake. The infamous Diddy-ordered cheesecake is alive and well. It's a spectacular dessert here. The HUGE slice is the hallmark. I had the strawberry, which seemed to have just a little too much of the syrupy gunk on it. Remove that, and the cheesecake is just fine. Delish as usual.", "author": "Charmie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "As diners go the food is completely MEH... But that is not why I go... it is about the cheese cakes!!!!\n\nThe cheese cake, well I will to 100% clear here, no one will ever be able to make a better cheese cake than my grandma could. So cant say it is the best cheese cake out there. \n\nBut it sure is damn good. \n\nBut with that said, yes I started going here for the cheese cake and that is the only reason why I continue to go, and yes when I am in the area I normally go in to see if I can get fatter.. ... So I give this place an extra 2 stars for cheese, else the diner  food would have got 2 star.", "author": "Mischa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "I was told that this is the place that p-diddy made his \"making the band\" members get him cheesecake. This place was huge! We ordered the strawberry cheesecake cake. Pretty darn good. The waiter recommended a Mudslide drink to go with the cake. I was a little nervous to pair them together,but it was ok. I think the waiters should know more about their liquor and food.", "author": "Kirsten L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-31", "description": "Well, I like this place for breakfast! It's wonderful, the service is great,  as soon as you sit water is brought to your table ( without even asking),  you are always asked if you want your coffee refilled. they have this great bread basket with rolls and miniture pastries. I have tried a couple of the omlettes and they were great, huge i could never finish it. Great service in the morning and that is why I gave it 3 stars.\n\nNow I have to mention a bad experience hubby and I had a while ago. We went to dinner ( it was hubbys first visit) , and he was undecided between the briskett sandwich and another entree. Well when our orders came the waiter bought hubby the wrong order! So politely we told our waiter, who immediately had an attitude and said \" but YOU said blah blah\".....so finally he bought the brisket sandwich (  my order has been sitting here for 1/2 hour and is now cold) hubbys briskett sandwich was COLD , there was no gravy on it..... It was on two pieces of untoasted cold wonder bread, no lettuce or tomatoes  or anything . It looked pathetic! Our waiter was very rude and ghetto , he kept giving us the eye all the while because he knew what he did.  Needless to say we have never returned for dinner. As for the cheesecake I never tried it.", "author": "Kristy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "World Famous Juniors Strawberry Cheesecake, a little slice of heaven!  So good, but pricey and getting smaller and smaller, every day.  The restaurant food is decent diner grub, but I mostly go for the cheesecakes.  I've given them out as gifts and they never disappoint!", "author": "Brandon D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Went to Juniors with a referral from my friend who was raised in Brooklyn and lived there for many years. We just so happened to be traveling through the area and needed to get something to eat before hitting that crazy NYC rush hour traffic. I was impressed when they came out with a bowl of Pickled Beets, Pickles and Coleslaw as a complementary appetizer. The coleslaw was good, vinegar based and the pickles were crunchy. The beets were good as well. I ordered the Swiss Steak Burger which came with a slice of lettuce, tomato, swiss cheese and mushrooms on top. Served with two large onion rings which I wasn't too impressed with as they had that faint hint of fish from the fryer in them but oddly enough, the fried it came with didn't taste like that at all. They just needed salt. The burger was good, not overly great but tasty enough and went well with a Guiness Extra Stout. The roll was fresh and the burger itself was very juicy so the cook did a nice job with the cooking time. The staff were friendly and quick to refill the water at the table and clear the plates. Didn't try the cheesecake because it was already too much food to eat. The total for our order or two Guiness, my Swiss Steak Burger with fries and my friends Cheese Burger with Fries came to just over $51.00 which included gratuity. If you aren't from the city, be prepared for this little piece of culture shock. Yes, things really do cost more in the city. The same meal for me back home in a local diner wouldn't have cost half as much as that. Oh well. It was still nice to have experienced another unique piece of NYC and it was cool to hang out with a friend who grew up there and hear him tell some pretty cool stories about Juniors from when he was a kid. Would I go back? Of course, I still have to try the cheesecake!! Lol", "author": "Jason V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-19", "description": "Sure you get tons of food, but it was rather bland and boring (and not cheap). my friends wanted to go here cause they heard about the place rap songs. i'm not so hip so there wasn't much allure visiting here.", "author": "Ameer N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-21", "description": "Generous portions of tasty cheese cake and decent drinks. The place has a really comfortable neighborhood feel. we went for dessert with friends and we sat and talked except when we stopped to scarf the cheesecake.\n\nI can see why puffy/puff daddy/P Diddy/Diddy/Diddy Dirty Money made Da Band walk over to get some cheese cake.\n\nWe came for the cheese cake, we stayed for the conversation.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "A NYC institution that lived up to it's name on my visit!  Salad was the bomb...service was quite a bit spotty", "author": "Sean R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "I suppose, it's one of the places you have to hit up at one point in your life.  For the most part, I don't think you'll miss much.  The food is \"meh\", but the cheesecake lives up to the hype.  It's also waaaaaay over priced in my opinion.  If you want regular diner food, go someplace else.", "author": "O C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "The cheesecake is the best I've ever had. The food is forgettable, but who cares? Can't wait to come back for dessert next time I'm in town.", "author": "Alex H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}