{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Imagine how good American food probably tasted before the overly processed industrial food system our country knows today. Thats what I think Juniors is like. Its a diner, but they seem to care about quality. The service was super fast and the cheesecake lives up to the hype.", "author": "Jon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "Great place for desserts!\n\nI came in as a I couldn't help but notice all the delicious cakes on the window.\n\nThis place was a classic old skool joint- I was with two other people, we had an order of onion rings which were amazing. The batter was very light and stuck well to a nice thick juicy onion. We also enjoyed a slice of the red velvet cheesecake and the lemon curd coconut cake both were fresh and moist and so yummy!\n\nAs a Seinfeld fan and someone from Canada I had to also try the infamous 'Black and White' cookie and man they were good! Nothing like I've ever had.\n\nAlso their chocolate chip cookies were delicious- they had a ginger taste which worked perfectly and were so soft. I will definitely be back!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Some of the best desert in the five boroughs with classic diner fare and a welcoming staff. The cheesecakes are incredible and worldly famous. They have a great pumpkin cheesecake as well!", "author": "Jane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "The food is great. I've had a ton of different things here and have never been disappointed. I love the fried chicken and the desserts.\n\nThe service is \"good for Brooklyn\". You're not going to be coddled here, but you'll get your food without confrontation (the hallmark of Brooklyn culture in most service situations). \n\nIf you're a tourist, you'll probably note that the neighborhood is incredibly diverse and somewhat dangerous at night. If you're a native New Yorker, you'll probably get in and out of there without dallying long enough to get mugged. \n\nIf you're in the neighborhood, stop by and grab some lunch - it's excellent.", "author": "Johnny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "I'm from ca and was told its a must have when in Brooklyn... Definitely a must have. Food/service was great.\n\nI'm from ca and was told its a must have when in Brooklyn... Definitely a must have. Food/service was great.", "author": "Danny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "My dad cant get enough of this cheesecakes! He bought their cookbook to remake their recipe, Sorry dad! Juniors makes it better !", "author": "Christy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "Good cheesecake, but don't ship one as a gift, unless you want to spend $60-65 for a cheesecake that doesn't get delivered on time. I placed an order for two cakes ($128 delivered). I drove an hour to get to the delivery location for pickup of one of the cakes for T-G dinner. No cheese cake. The other cake was sent as a gift, for my mother, who lives in another state, to serve at Thanksgiving dinner. She stayed home to receive it, but it never arrived on the scheduled delivery day -- the Tuesday before Thanksgiving. When I called Junior's, they hadn't shipped either cake yet, even though it was past delivery date. They said a batch had been ruined, and that's why the cakes didn't ship. It would have been the easiest thing in the world to send an email to those who ordered saying our orders would not be delivered on time, and ask if they should cancel the order. People ship these as gifts, so the delivery is time-sensitive, but they didn't bother to notify me about the delayed shipments.  When I called Junior's on Tuesday after the last UPS delivery of the day, they told me that they would absolutely get the cakes out for delivery on Wednesday, and there would be \"movement\" at UPS by early Wednesday morning.\n\n\nUpdate:\n\nI checked UPS tracking this morning. One cake was on the move, but UPS didn't receive the other cake, the one that's supposed to go to my mother two days before Thanksgiving. So I called Junior's. The person I spoke with insisted rather testily that both cakes went out for delivery today, even though UPS was, at that point, showing that they had only one cake from my order of two cakes. The woman at Junior's insisted that the tracking number hadn't been updated and \"All CAKES WERE SHIPPED,\" Me: \"but...\" Her: \"ALL ORDERS WERE SHIPPED.\" Me: \"You're telling both cakes were shipped and will arrive today.\" Her: \"YES.\"  The woman I spoke with wouldn't actually look up my specific order. She just insisted all delayed cakes were shipped.\n\nFast forward to noon Wednesday. I was called by someone else from Junior's (the woman I spoke with late on Tuesday) who said that unfortunately only one of the two cakes was shipped, but they could deliver the missing one next Tuesday. It was a gift for Thanksgiving -- tomorrow. I had purposely ordered last week, and scheduled the order for delivery two days prior to Thanksgiving, just in case there was a screw up. My mom doesn't need to sit around and eat an entire cheesecake by herself next Tuesday.\n\nWaiting to see if they can manage to handle my refund for the undelivered cake correctly.\n\nThis was so badly handled. I will not order from Junior's again.", "author": "Paul P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "Talk about tradition.\n\nThis place has been around forever. \nLocated in downtown Brooklyn - full of heritage and pride, this humongous restaurant hides in a simple building there.\n\nTheir food was incredible. They have amazing burgers, and cheesecakes.\n\nI loved the feel of the place. The music they played. The servers, grown men that live for this job, their tradition, their heritage. I loved this place.\n\nIt seemed so proud and dignified of who they have been for the past decades. They truly inspired me to think of this place as a lifestyle for those that have been there for years. It made me feel a great appreciation for their food and service. \n\nI will definitely be coming to Junior's when I get back to that area of the country.", "author": "Felipe Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "The most perfect cheesecake ever!  Seriously.  This place is not messing around.  You have to love the old school atmosphere too.\n\nGet yourself here.  Get a slice of cheesecake and enjoy!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "I Order a hamburger well done They bring it to me raw like what the fuck  i won't go back to them ever", "author": "Joseph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "I went to Junior's to buy a 16 inch cheesecake to freeze and bring home to California. No shame. \n\nThankfully, it made it through travel AND It was the fluffiest, lightest, most scrumptious cheesecake I ever had.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Went here only for dessert.\n\nWe had the Fresh Strawberry Cheese Pie, Apple Crumb Cheesecake, and Strawberry Ice Cream Soda.  All of it tasted very good.  I don't eat much cheesecakes but it wasn't as creamy as I thought it would be.  I would definitely come here again to try something else.  The strawberry \"jam\" that was on the cake wasn't too sweet and the Strawberries weren't too sweet either.  As a whole, it wasn't that sweet of a pie even thought it sounded like it would be really sweet.  The service was good, decor was nice.  The place is very bright inside.  The place has a Johnny's Rockets feel to it.", "author": "Leo O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "You simply have to eat this cheesecake if you are in New York City. You can not pass this place without eating here at least one time. The burgers are to die for and come huge and in charge. The cheesecake you must leave a lot of room for because it will fill you up faster than your  normal meal does! All around this place was a yummy treat after a long hard day", "author": "Dana R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-24", "description": "Just picked up a cheesecake for the holidays and two of the counter staff people/cake boxers thought itd be hilarious to mock the asian lady behind me who couldnt properly pronounce 'christmas swirl' and would continuously say the mispronounced version of 'christmas' back to her asking if she really wanted the xmas swirl. Good job guys. On christmas none the less. Real smooth.", "author": "Isabelle E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Received the cheese sampler for my birthday.....over rated and over priced.....boxes are huge.,....cake is small......taste just o.k  \nI have had better ..,, don't waste your money.", "author": "Lindà W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "Can I just say that the reason why I am fat is because of Junior's? I grew up on this crack. Literally had this cheesecake since I was born and can't eat any other cheesecake because my taste buds only understand THIS cheesecake. NOTHING ELSE COMPARES. If you haven't tried it, you are missing out on life. Get your butt there, right now!", "author": "Mich L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "We went here for the famous cheesecake, but were more impressed with the food we ordered. Don't get me wrong...it was rich and tasty, but I have had (and can make) something just as good.  First...you get pickles, picked beets and some slaw right when you sit down (yay for instant snacks). The menu has a lot of variety, so everyone can find something. Great brisket, pastrami, and corned beef. Potatoe Latkes were huge, full of flavor and crispy!  We even asked how they make them...and off course they are deep fried. DELISH! \n\nThe place is large, so seating is in abundance. We sat near the windows and really enjoyed the people watching. The service was good, and quick - we were in a hurry. \n\nIf you like diners, this is a definite must try. I thought the prices were average, around $17 per plate I would say.", "author": "ZZ K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "Normally I'm into nostalgia and love the originals, but this one leaves a lot to be desired. It's in a seedy part of town and the decor is stuck in a time machine. Stopped in for dessert and left feeling a bit disappointed. I had the strawberry shortcake cheesecake. It reminded me of something you would find at any supermarket. Nothing special to it.  Mostly whipped cream more than anything else.  Not a lot of cheesecake consistency. My friend had the fresh strawberry cheese pie.  She made the better choice.  It was covered with fresh strawberries and the pie crust was coated with nuts. Excellent. Prices weren't steep. It was about $7 a slice. \n\nThe bathrooms were filthy. A notch above Penn Station. There also was a foul fishy smell near our table which forced us to shovel down our cheesecakes and beg for the check. I should have stuck with the original cheesecake so I will give them 3 stars because of my mistake. I visited the Times Square location in the past and had a far better experience, also weighing in on my 3 star rating. I recall I had a burger and enjoyed it. I don't know what to say  Felt like I was in the Deep South.. Normal cheesecake is great, but there was something off with this original. Go to one of their other outposts, much cleaner.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Always go whenever I am in Brooklyn. Good comfort food with a twist and a of course the best New York cheesecake", "author": "Gloria O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "I think there's Juniors Restaurant and Junior's Cheesecake. The diner sucks, with their menu being too steep compared to modern restaurants when this diner has been running since the 50's. The cheesecake, on the other hand, is amazing. While $8 is too much for a slice, its worth the splurge.", "author": "Vhalerie L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}