{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-24", "description": "Food use to be so good, but everytime i go it seems to be going down hill.. Had some cheesecake from there recently and was not impressed! If your in a rush and just need to eat, its ok.. but if ur looking for classic Juniors food from the past, look for somewhere else to eat.. Dont think ill be going back anytime soon!", "author": "FoodieJunkeyz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I have walked past Junior's probably a 100 times and I only recently decided to stop in for a bite. I thought that it would be really touristy but it wasn't at all. I went to the cocktail lounge that has an entrance on Dekalb not expecting much but was pleasantly surprised. The cocktails are, as the bartender put it, \"not a normal pour because they pour heavy\" and are only $7. The house salad was really big, tasty and reasonably priced but the wings were just ok. There were a lot of locals and I don't think I saw one tourist in the cocktail lounge area. My favorite part of the place was the bartender who was really funny and knew what he was doing. He blew my mind when he told me the day of the week I was are born on when I told him my birth date. \n\nAs I said, I walked past this place a million times and never went in but not anymore.", "author": "Collin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-02", "description": "Don't know what all the fuss is about. I've def had better cheesecake before... at cheesecake factory. The two stars isn't because I didn't like it, it's because I expected to much more from Juniors.", "author": "Brittany C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-04", "description": "Absolutely terrible. Worst meal I've ever had. Not even worth 1 star. Ordered a pastrami sandwich which came on a hamburger  bun. Should have refused it, but I was hungry. I will never frequent that restaurant again! Used to be good. I don't know what happened.", "author": "Don D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Even though every time I come here it is packed you never seem to wait long. The food is great and the staff are always upbeat and  accommodating. I would walk here from any part of the city for some of their strawberry shortcake. Mmmmmm mmmmm", "author": "Eduardo A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "This place is just ok. The food potions are enormous and the prices seem about right but it's nothing spectacular. The staff needs some serious help. Some are great and some just make you feel straight up awkward. If you've never been I'd say go see what I'm talking about for yourself. But on another note their cheese cakes are fantastic and you should definitely get one to go!", "author": "Tom M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-03", "description": "Drove by here a while ago with my sister. I left her in the car and went inside to get some cheesecake to go. I got the strawberry. It wasn't cheap but since I was already out here and no one shuts up about how good it is, I decided to get a couple of slices. \n\nI got back to the car and my sister says she just gave money to the lady over there and points. I asked why, and she says she came over and demanded it. I looked at the lady she pointed at and she saw me and quickly scampered away not unlike a roach in the kitchen when you turn your light on. I guess she thought I was gonna ask for the money back. Which I was gonna do. \n\nSo I guess the moral of the story is, this isn't the best neighborhood in the world. But the cheesecake is really good. Just hold hands with a friend when you come here.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "I'd heard about Junior's cheesecake for years, and I finally got a chance to try it a couple years ago. It was SO delicious. It took a while to get back to New York, but once there Junior's cheesecake was on the list of \"things to do\"! We went again and it was still just as good. I had the original cheesecake, I liked it better than the flavored ones that I tried off of a friend's order. I haven't ordered the food, just cheesecake and coffee. But it was worth the trek through Brooklyn to get there. A+", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-05", "description": "Since when does a Chicken Ceasar salad consist of iceberg lettuce \u0026 chicken?? What happened to the cheese \u0026 the croutons? I had to take that salad back. $15 for lettuce \u0026 chicken is unacceptable.\n\nWhen I took back the salad they told me that I meant to order the \"house salad with grilled chicken\". No, that is not what I meant to order. I informed them that after doing 4 years of college across the street at Long Island University, \u0026 eating the chicken ceasar salad atleast two times a week for those four years, I knew exactly what I was ordering.  I asked them if they had changed chefs \u0026 they said \"no\". That is a LIE! \n\nThe house salad was too busy for me \u0026 I did not enjoy it at all. There was way too much going on in that salad. At any rate, I will never order a ceasar salad from Juniors again. It really is a shame because that salad was so delicious back in the day. \n\nOn a side note: Prior to packaging the food, they used to show you what you were getting. I should've noticed that they did not do that. I guess that is a sign of the times. Make sure you ask to see your meal before you leave.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "Do not come here and get anything besides cheesecake. I haven't had the food but don't see great reviews on here. I did have the coffee which was unbelievably bad but the cheesecake is pretty darn good. It's a heavy NY style cheesecake that's insanely expensive but sometimes you just gotta go get a piece.", "author": "Angel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-25", "description": "My visiting Australian friend wanted cheesecake at 9pm. Yelp said this was the closest place to where we were in Dumbo so we made our way over in the rain.\n\nShe had the Carrot Cake Cheesecake, which was a humongous slice, compare to my small sliver of Chocolate Swirl Cheesecake. The cheesecakes were okay but I've had better. \n\nNevertheless, she enjoyed the experience, which she described as very American and that was all that mattered to me!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "I am lactose intolerant. \n\nI order the chocolate mousse cheesecake every time I come here. \n\nI eat the entire thing in less than 5 minutes. \n\nAn hour later my stomach is in the worst pain ever. \n\nAfter a few hours of pain and agony, I smile and think to myself... \"That was soooooo worth it!\" :-)", "author": "Alee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "I was completely enchanted by Junior's. Maybe it was the old-school Hollywood vibe it gave off, with the '50s music and black and white photos of Fred Astaire, Frank Sinatra, and the like. I truly felt as if I had been transported to a different era. Or perhaps it was the waiter, an elderly man who almost seemed of that era, dancing to a rhythm he was beating out in his head while serving us. Or maybe it was the fact that the Christmas decorations were still up and the whole place seemed so magical. \n\nHUGE menu. I ordered a lunch special - a BBQ pulled pork sandwich with steak fries. Delish! However, I may be the only person who loves Junior's food but is not in love with their cheesecakes. I ordered a strawberry shortcake cheesecake, and was not a huge fan of the strawberry creamy/jelly filling. Too sweet and mushy. My friend ordered a Red Velvet cheesecake, and while I thought it was better (the cake part was moist and wonderful), I still felt the cheesecake and frosting were waaay too sweet. \n\nHowever, I'm still giving this place 5-stars because the service was good, the food was great, and the atmosphere was absolutely fantastic. When I came home, my bf asked me how it was, and all I could say was the Junior's was a \"truly special place.\"", "author": "Rea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "Never say in to eat here just really stopped in for a quick slice of cheese cake to fulfill my cravings. Lines are fast an it's really a simple order that I'm in an out. $9 for a slice of strawberry cheese cake it definitely was worth it. I won't buy a whole cake unless it's a holiday BC I don't need all them calories an extra ass. Lol seriously but it looks pretty decent definitely will give it a try one day to sit an eat. Also downtown Fulton definitely No parking ever.", "author": "Steph A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-28", "description": "I was on vacation from the Midwest and decided to stop in, the cheesecake was great, however the guys at the front who helped with selecting had a rough/rude tone, but when it became time for me to pay he was much friendlier. I would assume it was so he could get a nice tip, but at that point it was to late. \nRecommendations: Your staff needs lots of additional coaching!", "author": "Ms D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-17", "description": "I'm not from New York City, so I've had the pleasure of experiencing another restaurant that is famous for their cheesecakes. \n\nEating a cheesecake from Junior's was like a step down, I was not impressed. Which was disappointing because everyone was raving about their cheesecake. Obviously they haven't experienced the real deal. \n\nI was really disapointed by the fact that the slices are already cut, and packaged - which I question how fresh the cheesecake really is. The presentation of the pies on display were sloppy also, they didn't look very appealing. \n\nI got the strawberry cheesecake, the cream cheese is really thick, I could only eat half of it, and there are huge strawberry chunks on top. The strawberry sauce, I'm not a fan of, but that's a personal preference - I prefer fresh strawberries and some whip cream. \n\nLooks like I'm gonna have to make a trek to upstate New York to get some GOOD cheesecake :-(", "author": "Brooke M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "ONE OF THE BEST STRAWBERRY CHEESECAKES I'VE EVER HAD!!!!!!\n\ni'm no cheesecake connoisseur, but I know when its a good one...and this one is HELLA-GOOD! \n\nEvery time I come to NY I make sure that I NEVER leave back home without having some!  Kinda wish I could just catch the subway right now and go grab some....too bad I'm in Miami :o(", "author": "Vicky P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-14", "description": "I had the BLT club sandwich it was nothing special, wife had the cheese cake and said it was delicious.", "author": "Marcos S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "The regular food here is pretty decent but I doubt that's what anyone comes for.\n\nIf you don't like Junior's cheesecake (of which there are several varieties), then you need a tastebud transplant. STAT! \n\nBrooklyn = pizza, bagels, and Junior's cheesecake. For serious locals, it also includes a roast beef sandwich from Roll 'N' Roaster.", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Great breakfast! Espresso, eggs (over easy), Bacon (crispy), and grits...all cooked to perfection. God, hearty good. Reasonably priced. Going back tomorrow.", "author": "Frank T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}