{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-20", "description": "Because of how great food is at Juniors is that I put up with the everyday horrible service provided at the coffee take out part of it by Thomas. It is almost as if they were giving you the coffee for free. They don't even ask you, they just stare at you and if I don't say anything they just say: \"what do you want!\" In a disgusting tone. They should never be in customer service, they hate people.", "author": "Coni S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "I attended a pre-fix dinner at Juniors and I was very disappointed with the pre-fix menu options. I had half of a whole chicken which wasn't that great and my side options(only side options were broccoli and a dry baked potato) I didn't even bother eating my food as it was cold and tasteless. My kids had mac and cheese and chicken fingers. The chicken fingers were standard however the mac and cheese was really delicious! Why wasn't this an option for pre-fix dinner? The servers were attentive and the cheesecake really was phenomenal! I had the strawberry cheesecake and it was one of the best. Overall nice night due to being w family and cheesecake. Eat elsewhere and grab dessert to go", "author": "Naja F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Love the pickled beets and pickles! I was warned about the size of the portions but was still amazed. The burger was good, a little dense, but had great taste. Also shared a Ruben and that was great too! Cheesecake was world class, I think I left in a wheelbarrow due to a food coma!", "author": "Randy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "I picked up two cheesecakes to go and brought them back on my flight home. They arrived in good condition but the consistency of the cake was less than desired. Too dry. The flavor was so-so. Not the Junior's I remember...", "author": "Rev. Sylvia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Review strictly for the sinful piece of devil's food cake with cheesecake in the middle.\n\nJunior's, you KNOW you ain't right for that one! I would pull a Diddy and demand a walk to Brooklyn too behind a slice. RIDICULOUS!", "author": "Elsa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "The bbq shrimp is my favorite the half chicken is also tasty the strawberry cheesecake,chocolate cake, and strawberry shortcake are wonderful. I am giving this restaurant three stars because the prices are too high and always going up and when I ate in the person with me tried the chicken parm and it was okay nothing to rave about.", "author": "Christine W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "I'm not sure how this place has received the rating that it has... service was not good at all and they included gratuity and didn't tell us. Food was nothing to call home about either.. I'm upset that I wasted a meal here when there's so many other amazing place to eat in Brooklyn.  Do not recommend this place.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "In Brooklyn for the first time last weekend. Went to Junior's for breakfast Saturday. Really, it was great! Food, service, ambiance, price, all top notch. Took a piece of cheesecake home, and yes, it was heavenly.", "author": "Geri R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Junior's is a Brooklyn institution synonymous with cheesecake.\n\nHowever, having stomped around this borough for the better part of a decade I've never been inside the restaurant. This all changed this past Sunday, where after a movie, friends and I decided to make the trek for a bite [NB: 15-20 min. walk from 106 Court st - so not exactly next door from the cinema]. One of our party had been to Junior's before so explained that it was diner-ish so that set our expectations. It was so very diner-ish.\n\nThe space itself is huge. Huge, huge. \n\nThe front end of the restaurant may have had twenty something tables by itself; the back end past the bar (weirdly situated in the middle of the place) may have had twenty something more plus booth seating. Our waiter, for some reason, decided that we would walk by many of the empty tables upfront and take us to the back. While making our way there we had a good look at many of the other patrons on that Sunday night dinner service. It was a very mixed crowd; from your families to your college kids to your having a drinks with friends. All different shapes, sizes, colors. Nice to see that lived diversity and a shared space across the spectrum [cause, quite frankly most places don't].\n\nNow as far as the food, well, the menu is quite eclectic and having watched way too many reality tv shows based on restaurant rescues; this would be the point where the celebrity chef would complain about how the menu is too broad in scope and they need to have a tighter focus. \n\nI, however, am no celebrity chef. \n\nI simply took note that under \"Sides\" you could get  bagel/cream cheese as well as linguine marinara. You can also find a red snapper, and broiled lobster on top of regular diner fare (your burgers, fried chicken, chicken tenders,  breakfast any hour, etc). So - yes - quite extensive.\n\nI ordered the fried chicken dinner. I was warned that it could take some time but it came out piping hot and in no time at all. It came with two sides which you got to pick some kind of vegetable side (collards, coleslaw) and your choice of potato (french fries, mashed potatoes, baked potatoes). Portion size was jumbo! Three pieces of meaty fried chicken basically half a chicken. Taste was not bad but at 21 bucks for the dinner; a bit price-y.\n\nMy friends were very satisfied with the mac and cheese; the chicken tenders were actual chicken - not frozen bits thrown in a deep fryer; the bacon cheese burger was big enough for two hands and a question on how to eat it.\n\nOverall, Junior's will scratch that diner-itch. Food is quite decent. Service is quick and snappy. And of course, the legendary cheesecake.", "author": "Mike Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "The cheesecakes where delicious. \nI got the wrong cheesecake. But, it was delicious. \n\nThis was my 1st time here. \nAnd, the order I got. Was enough to feed 3 people. I felt the waiter should had warned me on the sizes of the order. \n\nOf course I tried to eat it all. But the red velvet got the best of me. Lol", "author": "Luis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Great food, you won't be disappointed here. Just make sure you come here the day you get paid and when you plan on not paying this month's cell phone bill. It's worth it.", "author": "Will H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "Family's been buying cheesecake here for years. I personally have never eaten here. However the cheesecake pretty, especially sugar free.", "author": "Kashiro W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Was craving something sweet so I stopped in and grabbed a chocolate peanut butter cupcake. It was pretty good. Had to wave one of 4 attendants to help me but it was later and on the slow side so it's all good.  It satisfied my sugar craving so that's all that mattered", "author": "Tee A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-09", "description": "Thought I was going to have a great eating experience here from looking at the reviews, and the inside area being full of people. My family and I went and or experience was horrible. Crystal the waitress and waiter we later had were both so rude. The waiter couldn't understand us and we couldn't understand him. He was very slow and not attentive. On to the food... it was tasteless! The burger w/fries tasted the same as my moms seafood platter, a no seasoning taste. My mom sent her food back and I covered mine in ketchup and gave the rest to a homeless lady. Later we found out from people we met in Brooklyn, that you only go to Junior's for the cheesecake. In my opinion, if the food ain't good I don't want the dessert! -From Texas home of seasoning", "author": "Krystal T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "First time every at Juniors, and boy was I pleasantly surprised! Freaking ginormous portions and free appetizers (Cole slaw, bread, beets, cornbread) offset the seemingly high cost of the eggplant Parmesan dish ($14.95 with free soda during lunch). Holy. BTW--this is the only non-breakfast vegetarian entree available. Service is good, and decor is historic. Love the old-school flavor here... It's diner food at huge portions at a reasonable price. What's not to love. \n\nAll of this is completely separate from the Juniors cheesecake--a NYC institution unto itself. This needs no explanation.", "author": "Wei H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Great place to stop! You won't find the cheapest meal here but it will be hearty and good! I ordered the potato pancake, it was the thickest I've ever had!! Great taste! I also had the Reuben with their homemade sauce, it was good but I was disappointment they didn't use rye bread. The cheesecake as expected was sensational! Best I've ever had!", "author": "Ashton W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Now who doesn't love Junior's? I most especially like their lunch special which is from 10:45am to 4:30pm on Monday's to Saturday's.  I always end up ordering the Southern fried chicken breast, there's something in the gravy that just hits the spot for me.  \n\nWhat comes next after a tasty meal? Dessert! Don't even get me started on the different kinds of cheesecake they have because I probably won't stop, but I will anyway.  The chocolate cheesecake is so good! So is the devil's food cheesecake, and the chocolate swirl cheesecake.  And of course, I have to give kudos to their milkshake too.  \n\nAs far as the service, never had a problem with the staff.  They are always great in Junior's, fast, friendly, and the best part they serve the amazing goodness of Junior's.", "author": "May M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "A Brooklyn staple that has long been a family destination growing up as a kid in the neighborhood.\n\nMy grandfather would shout \"I want coffee and cheesecake!\" and we'd all jump in his huge Chrysler New Yorker that had a bench seat in the front (Three people buckled up in the front seat, what a concept??) and drive to Junior's.\n\nI've been taking my family to Brooklyn to see old family homes and to eat at restaurants that we would frequent as kids.\n\nMy oldest son has been acting like a big shot because he had a \"Pastrami burger\" at a deli in Long Island. He wanted a full blown pastrami sandwich. I told him its a block buster of a sandwich, are you sure?? \nHe chickened out!\n\nMy wife \u0026 I spilt a corned beef sandwich, son #1 burger and son #2 chicken fingers.\n\nNow just a few things I noticed over the past 10 years. First, all of the \"All you can eat\" chinese buffets as well as Chinese food sit down places with tablecloths have all but disappeared in Long Island. The same with any good place to go for deli. I guess American palates are changing.\n\nWe all ordered cheesecake and coffee. Just like my grandparents did back in the day.\n\nI get it now. Yeah, the cheesecake bring back memories. But its the memories of this place that's locked in my past. My grandfather just passed the torch.\n\n10 stars", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "When I go to NY I have to get Juniors cheescake! It's so rich and delicious and has a really smooth texture, with the right amount of sweetness. \n\nI also had the joy of eating there for dinner with friends and we all agreed it was pretty awful. My meal was very greasy and bland. My other dinner partners shared the same thoughts.\n\nDon't bother to eat here...just grab your dessert! The restaurant is a 2-3 but that cheesecake is so worth a 4.\n\nNY HERE I COME!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "This classic Brooklyn landmark has both southern style soul food and Eastern European/Jewish classics. I had the ribs with broccoli and french fried, all of which were excellent, the sauce was a little sweet for me but overall tasty. The service was excellent, our waitress was attentive and super helpful.  Be careful, the portions are very large. An egg cream and some cheesecake will wrap things up nicely!  Go in here and have a nice meal before Brooklyn is completely ruined by yuppies.", "author": "Sean L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}