{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "The cheesecake is MEH. It's no Whistle Stop.\n\nCheese blintzes are where it's at. They are huge, deep fried, covered in powdered sugar and served with a side of the strawberry topping they put on their cheesecakes. The skin is golden and crispy and delicious. The filling is just sweet enough and smooth and luscious. \n\nThe service is spotty. I find that if joke around with the waiters and pretend to give them a hard time right of the bat they treat you a lot better, and may even comp you something.", "author": "Inna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "We ordered one slice of plain cheesecake, one slice of strawberry cheesecake, and a slice of red velvet cake.  I like my cheesecake with a graham cracker crust.\n\nBest thing:\nCheesecake with the strawberry topping (I like a bit of tart fruit to break up all the creaminess)\n\nLeast Favorite thing:\nred velvet cake\n\nStick with the cheesecakes.", "author": "Flo T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-08", "description": "After walking across the famous Brooklyn bridge, like Day 26, we went straight to Juniors for some cheesecake that P.Diddy is so fond of..\n\nAnd honestly.. It wasn't THAT great.. Most definitely an experience to eat here. Had the Strawberry Cheesecake.. SUCH A GENEROUS SLICE, enough for two people.. I don't remember how it tastes..\n\nBUT I DO REMEMBER THE MATZAH BALL SOUP!!\nI had a cup and it came with one huge ball.. The soup was good, something gentle on my stomach after eating white castle at 2am the night before.. \n\nAmbiance is very old school, I loved it.. Our waiter was super nice.. Hit this spot up and see why Diddy loves the cheesecake yourself..", "author": "Mare L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "Had I just had the cheesecake then I would give them more stars. However, I had breakfast here as well and it was not the greatest. I guess it wasn't any worse than your typical diner food but then again your typical diner food would get 3 stars.\n\nSo, the cheesecake with strawberry topping was great. Get that.", "author": "Shawn T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-20", "description": "everything they say is true and more.  I stopped by here on my way to the air port - left my friend in the cab and went in and picked up 4 (YES 4) cheesecakes to take on my flight back.  \n\nWho would do that for bad cheesecake!?!?!?!", "author": "Tricia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-13", "description": "I love Junior's and a visit to the Original Junior's was great. This one definitely has more character than the one in in the Theater District, and also feels like its more of a neighborhood diner.\n\nI really like how this place still looks like its 1950 inside. Their food is great. My favorite dish has to be the tuna melt and split pea.  MMM i wish i could just eat a juniors everyday.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-16", "description": "Okay, Let me first say I'm a native Brooklynite so I've been coming here for years. Since i was a little kid. 10 or 15 years back , the food was great! Everything cooked perfectly nice and juicy. But since then the place has really gone downhill. I order a burger it's dry, burnt and plain tasting. i order a Steak, it's dry burnt and plain-tasting. Even the pastries taste bad. Earlier this year I got an apple strudel and I bite into it and it's doughy, like uncooked dough and the apples feel like apples but taste like lemons! I could barely eat it!! \n\n\nThe only saving grace is the Cheesecake and Red Velvet cake is okay, but that's it. Maybe the new one in Times Square  is better.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "I thought that the cheesecake was really good. Can't go wrong with anything. Try to get seated before the dinner rush cuz it gets pretty crowded.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Junior's has the best cheesecake you will ever eat - plain, strawberry, cherry crumb, pumpkin - every flavor is rich and creamy, and out of this world!\n\nas for the other menu items, i can't say since i only come for the cheesecake :)", "author": "Jasmine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "best cheese cake in the entire usa\" so great !! your mouth keeps  watering after you get done with a slice,and the food is awesome\"", "author": "Natasha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "Probably one of my top 10 restaurants anywhere!  I've been to Junior's a number of times and look forward to it whenever I go to New York!  Their cheesecake will make you want to slap yo mama (sorry mom).  Have never had a bad meal here.  It's part of the Brooklyn experience you HAVE to take in if your anywhere nearby.  Easy to reach to.  Flatbush \u0026 Delkalb.  Get off the train and look across the street.  Plan for a line on Sundays!  Always excellent customer service.", "author": "Jeremy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "This place is overpriced, and the food is no better than a diner. The last time i was in their i was sitting in a booth and dropped my napkin on the floor. As i reached down to pick it up i glanced under my table and noticed their was a mouse glue trap. GROSS!!!!! i know restaurants in busy districts have somewhat of issues but to just leave a glue trap right under the table is NOT RIGHT.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "Junior's cheesecake is the best  I've ever had....not too heavy, I love the taste and the texture...I usually get the strawberry or blueberry cheesecake. I cannot rate their food because I never had any interest to try their food. Junior's is famous for it's cheesecake so I stuck to what I know, CHEESECAKE!", "author": "B T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "I'd heard about this place only recently and, being in New York on vacation, I resolved to go out to Brooklyn to taste the famous cheesecake. It's right next to the DeKalb subway stops but be warned that the B train on the orange line doesn't run during the weekend. The best way to get there is to take the Q train on the yellow line. If you have to take the D train on the orange line, you'll end up at the Atlantic stop. It's not really that far to get to Juniors from there though.\n\nAs to the restaurant, it's in a fairly unremarkable neighbourhood, just the right side of grotty. The interior is really jolly and there is a lovely atmosphere. The servers all dress in sharp black uniforms and there is a real air of activity. It's a big place so you shouldn't have to queue for long, if at all.\n\nThe food is nice, if unlikely to change the world. I had a pulled pork sandwich. As I say, nothing revolutionary but it was REALLY tasty. The cheesecake was fantastic as advertised. I had the original and, for the price, it was worth it. The price of the main was high enough for what it was, but that's New York prices for you (even in Brooklyn).\n\nThe review almost lost a star due to the conduct of my server when it came to settling up. While she was polite, swift and capable, she suddenly became VERY attentive to my table both as I prepared to pay and after she brought me my change. She was obviously angling for a tip at that point. It was really quite awkward. Given the fact that she'd done a good job, I was of course going to leave her the standard 15%. Perhaps I looked like a cheapskate and, as a European, I have to say I find the American expectation of a gratuity as a matter of course to be rather strange. That said, when in Rome...", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Good deli at a reasonable price in a comfortable deli/restaurant that isn't trying to be trendy with nice folks making your meal enjoyable and pleasant.  A good deal less pricey than some hyped delis and the pastrami and corned beef are tasty tender and piled high enough to fill you up.  The desserts are great big old style bakery classics with the cheesecake a definite must try.  No this is not high end but its good basic food in a comfy classic retro 70's environment and staffed by friendly experienced waiters most of whom have many years on the job as evidenced by their easy going manner and skill.  Before you drop way too much for way too little remember that deli food is not and will never be gourmet/health or cutting edge so go to juniors and enjoy the extensive menu, fun surroundings big comfy tables with lots of pics of the famous and not so famous.", "author": "John L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "The fried chicken here is SO GOOD.  I think I'd have to say it is my favorite place for fried chicken!  Strawberry shortcakes here are divine and ridiculously tall (but I guess that makes sense since you're paying so much!)  I love the old school feel of this place too.", "author": "Sammy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "Five words for a 5-Star Rating*: Cheeeeeez Cakes Cheeez Cakes Cheeeeeeeeezcakes!\n\n* Only for the cheesecakes.  I've nothing to say about the venue and other food items and services and what not, since I do not know.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "Hands down,a MUST PLACE to VISIT For ALL BROOKLYNITES!\nBEST STRAWBERRY CHEESECAKE IN THE WORLD!!!!!! Great fresh great tasting Americana diner food.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-16", "description": "It's Monday, 10pm, I'm in San Francisco and obessing about cheesecake. From Junior's specifically.\r\n\r\nSomething today got me to thinking about cheesecake, and the fact that in college in NY, I would sometimes sacrifice my stomach for dairy. Thinking about it again, it was almost always for a slice of Junior's with another friend who could not say no to Junior's. \r\nI again had a flashback to diners, and restaurants in New York, and Junior's came up yet again. I might have to find a way to order one before I start obsessing about it. That, or I might have to make a trip to NY soon to see friends, and indulge. This time, however, Lactaid will be in hand.", "author": "Niki M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "Junior's hmmm chessecake grade A. The food is above average. The waiter staff is good. Always keep my drink full. I always order the meatloaf and mash and it is very good. Now to the dessert Juniors's is known for the cheesecake but the lemon meringue pie is to die for. The Strawberry cheesecake is the best cheesecake here.", "author": "Hector S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}