{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "As in manhattan: great food, fantastic staff. No disappointment whatsoever. A sure place to be.", "author": "Fanny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "Ok. I'll be the 1000th review. I'm a fan but even though I pick up 3-4 Rubens every time I'm heading back to SF doesn't mean it's the best. But it's very good. I get torn between the corned beef and pastrami. And that's the thing... Juniors has to be pastrami. Just not a huge fan of their corned beef. So be it. Fwiw, picking up 4 tomorrow in my way home from Brooklyn. Not sure what's gonna happen when Katz moves next door... But almost sure that will be my next bring back.", "author": "Adam X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "Cheese cake was good but the food menu items were just ok. I would only come back for a piece of cheesecake", "author": "Kiva A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Sometimes you just have a taste for Juniors.  It's pretty damn good.  My personal favorite is hitting it up on a Saturday night for some shrimp bisque (soup of the day).  Staff is mostly very friendly, and also very accurate.  \n\nEnvironment is good, excellent for a diner.  You can't fault the cheesecake either.\n\nPrices aren't the best, but it's a legendary spot if you're in BK you HAVE to go.  Cheesecake is great too.", "author": "Julian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-19", "description": "Not worth the hype . Service absolutely sucks . I got an $8 strawberry milkshake that's made with nesquik . Everything is overpriced and overhyped . I'm so disappointed. Was so excited to try this \"work famous\" restaurant.", "author": "Salvatore A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "I love it here! Strawberry cheesecake my absolute fave. Staff is amazing good for families or date night. Parking is tough but it's worth it. Prices are pretty good most entree are under 30 bucks. Good for breakfast lunch or dinner.", "author": "Summer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Just so pissed. My server was so friking rude. I came for a slice of the strawberry cheese cake he argued with me about the fact that I was calling it cake and not pie. I had to show him a picture to make sure I was not going crazy. I had to ask another server to make sure I could get what I wanted. I am just beside myself, on top you are supposed to get bread and he makes it be like it is extra. I will not go back.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Great!!!!!!!\nGood service. Food was excellent including the giant broccoli. \nFish and other seafood was very fresh.", "author": "Chasity J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "This review is just for the red velvet cupcake.   I am a red velvet fanatic so I try them all over and since I couldn't get to my regular spot I figured I may as well try theirs.   The price of the red velvet cupcakes was about normal at 3.50. It was moist and the frosting had the perfect amount of sweetness.  I won't be rushing back for one but it is a good second or third choice.", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Gosh!  I remember going to this restaurant with my family during the '80s.  Their menu has not changed much.  Their setting has not changed at all.  Even the pictures in the men's room look like they've been there for decades.\n\nOf course, they're famous for their cheesecakes which are weight-gaining delicious (and priced high for a slice, I might add).  But I have to say that I am not much of a fan of their all-American menu.  Their portions are generous, so you don't have to worry about getting teased with artsy food.  (I hate going to those foofoo restaurants.)  I do, however, enjoy their pickles.  They're pretty tasty.  \n\nWhat can I say?  I know you're going to go there because it's a Brooklyn treasure that managed to stay there while all of these condo buildings are showing up in the area.  So I hope my review was, at the least, entertaining.\n\nEnjoy your time at Juniors, you tourist!!", "author": "Daryl H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "Junior's is a diner? I never had before because cheesecake has never been on my palate's top 25 delightful foods. Junior's has never been an eager destination for me to go. This place has a bit of an atmophere of a diner from a few decades back, with their colorful striped seating and mirrors everywhere. There are several sections besides the diner feel: the bakery section as you enter, the tiny bar like seating, the back room, cafe and window seating. This place is big and their menu has a good variety to choose from including steaks, jerked chicken, seafood, soups, barbecue, breakfast all day, sundaes, sandwiches and of course what they are known for: their cheesecakes.\n\nThe cheesecake is a 4 star cheesecake, it does live up to worth trying, even if you're not a big fan of cheesecake, like me. The Chocolate Swirl is I guess one can consider a four layer cheesecake. The bottom is a dark crust (not burnt), soft and lightly crusty, good texture. The layer above is a chocolate cheesecake and their is not much chocolate flavor. The layer above is the regular (vanilla) cheesecake, and it is smooth, lightly flavored (without the strong cheese flavor) and sweetened just right. The top layer is a hardened crust that has a good swirl of chocolate. Yum, worth the $15.95 for our small pie of cheesecake.\n\nI want to put my stamp of \"Overrated/Overhyped and Overpriced\" here but I won't. It's not overrated or overhyped because food though average; what they are known for: cheesecake, is good. But it is slightly over priced.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Ushered to the corner booth for a slice of cheesecake heaven. Junior's knows how to do cheese right and with great service. The place has many savory options as well if you're not feeling desert, but you should eat the cheesecake that put them on the map.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "Best. Cheesecake. EVAR!!! :D :D :D\n\nSeriously if you haven't been here yet to try it, do it NOW! Definitely in my top list and took me by surprise honestly as I'm not a fan of cheesecake. At all. Sorry it's the truth, I've had horrid previous experiences with cheesecake that I wish to not further discuss. I call that period the \"dark cheesecake ages\". \n\nJunior's changed me and  turned me over to the good, lighter side. A side that's heavenly where I can forever (realistically speaking for a few hours, wished it was forever) go into cool, sweet, fresh, and decadent bliss.  \n\nGot a slice of strawberry cheesecake as I heard many great reviews from friends, family, and other die-hard Junior's fans. By far the best decision I ever made! So fudging awesome as the cheesecake was not overly sweet, nice and cold, strawberry filling tasted fresh and not manufactured, and was the PERFECT size!! Big, wide, and worth paying $6.95 for a slice of pure greatness. :) \n\nMy mouth continues to water like Niagara Falls and my conquest is to be aquatinted with my sweet lover again. Cheers to Juniors!!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Loved this place. Even though it was full and loud I enjoyed every second of it. It was money well spent. \n\nThe food was freshly made. The salad dressing, my god, fresh fresh fresh. The soup, even more amazing. I would probably go back again on the day time for like brunch or something but I will go back for sure. \n\nI always enjoy a good, lively place with fresh food.", "author": "Xaima M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Good breakfast spot. The portions are a good size and the food is tasty. The service is good and the coffee is strong. I did not get a chance to try the cheese cake, maybe next time.  A spot I will definitely try for lunch next time.", "author": "Carlos's H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "I am too excited to write this review!  The food here is absolutely superb!  I will give you a list of what all I've eaten here:\n\nComplimentary bread - The warm cornbread that comes out tastes so homemade.  It's the perfect way to start out a great meal.\n\nPotato pancake - I don't know what a potato pancake is supposed to taste like, but I sure did enjoy the one from Junior's.  I thought the pancake was really good without the chopped apple mixture that came with it.  Enjoy!\n\nCajun cornbread crusted salmon - Wowsers!  I've never had salmon  so good.  The crumbled cornbread that was baked ontop of the salmon will make any true Cajun be proud.\n\nVegetable omelette - It's really good!  \n\nPancakes - Pass on these.  I am a pancake lover, and if you are anything like me when it comes to pancakes, you won't appreciate these from here.\n\nSides:\nMashed potatoes - Nothing to say about them other than that they are darn good!\n\nMixed vegetables - Pass on this unless you request that they go light on the vegetable oil.  They were quite oily.\n\nCollard greens - I think they were worth ordering one time for me to be reminded of what soul food is all about.\n\nLast but not least...\n\nStrawberry cheesecake - I can't get enough of it!  Each time I come here, I have to share a slice of this.  The Brooklyn location has the best cheesecake and I recommend it to any and everyone!\n\nThe only bad thing about this place is that the last time I was here (I went 3 times in 5 days), there was a used condom at the very top of the trashcan in the Ladies restroom.  It was extremely gross!  If it weren't for the good food and cheesecake here, I would never return.", "author": "Lily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-22", "description": "Cheesecake - that's what you are coming here for.\n\nThe dinner/lunch food is nothing special. It's good but it's something I would compare to Applebee's or TGIFridays. Same style menu also. Our server was great, very friendly and was fast with his service and very interesting to talk to. \n\nThe cheesecake is great and I'm not a cheesecake fan but I definitely enjoyed this. We got the classic Strawberry Cheesecake and the Marble. Both were sweet, creamy and very rich. If I have a craving for cheesecake... I'll come here.", "author": "Vishal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Deservedly renowned for the cheesecake. I've tried a couple of different flavours - all delicious, but the original is best!\n\nOther favourites include matzoh ball soup (the broth is savoury, chicken-y and so, so satisfying), egg salad on toasted challah and chopped liver (on it's own or added to any sandwich). The portions are huge ... perfect for a sit-down lunch and a take-away dinner.\n\nDecent coffee and good service complete the package.", "author": "Seshini P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "sure, it's a legend.  sure it's big, fast, convenient, not even too expensive.  sure the sandwiches are big and filling.  and sure, the cheesecake is still prettty amazing.  but...\n\ni have to say that i was completely underwhelmed by the pastrami and corned beef.  first, the latter.  this seems like blasphemy to say, but i've tasted supermarket corned beef - MADE FROM THE ROUND! UGH! - that compares to what i got from juniors.  chewy, absolutely no fat, not flaky, pretty flavorless.  the pastrami was only slightly better, and that's because i specifically asked for it to be fatty.  it was just an uninspired sandwhich.  add to that the beets right out of a can (not even added onion or caraway) and a very plain cole slaw and i was wishing that i'd gone farther east on the A train to David's Brisket House.  and next time i'll stop in juniors to pick up a slice of cheesecake to go and then head on to david's for the main course.", "author": "Ken P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-20", "description": "Tourist Trap! For the past five years a friend has raved about this place! They informed me it's the number one place in the countryfor cheesecake. I BEG to differ! The cheesecake was decent, but was not dense. It was was airy and whippy. The crust was a cake, not graham cracker or shortbread. My husband and I weren't big fans! We sat at the counter and had excellent service from our waiter. He was a HOOT.", "author": "Stella K."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}