{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "I'm not sure what the hooplah is about. I ordered a turkey sandwich. It was a pound of dry turkey on a roll. Horrible. The straberry cheesecake was ok.", "author": "Ruth J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Come for the cheesecake which is really the best you'll find.   They also have great food and the staff is always courteous and attentive.  If you're looking for an old fashioned egg cream this is your place!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Cheesecake lover? Try stopping into Junior's after class or during you  lunch break. It's slapped dab in the middle of Downtown, Brooklyn. So whether you work for a company or you're a student, you can always count on Junior's to fulfill your appetite. It's an American Restaurant, so you'll find a good variety of food, I love their burgers and fries. But if you're more of a health freak, then you shouldn't be reading me reviews to begin with, ;) I've always enjoyed their food and love their cheesecake. My stomach thanks them!", "author": "Tahmoor K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "I had the Devils food cheese cake. Amazing. It was a huge piece of cheese cake for 7.75. The coffee was good. Fresh and hot. The place is clean and a great place to go for breakfast or lunch. Parking is an issue down there but it's worth it. Staff is friendly and quick in service. Check out this famous landmark.", "author": "Kristofor N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "This review is for the Devil's Food Cheesecake,  and the big Biggie picture on the wall. Excellent!", "author": "Jeff E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "I don't care for the cheesecake anymore. Like most businesses, once they make there money they start cutting back on quality. I was very disappointed. I will not eat there again", "author": "Missouri M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "I'm in New York for a few days.I walked about 5 blocks to get to juniors to grab a delicious slice of cheese cake ( strawberry cheesecake \"graham crust\". BUT I was told it's only online. As in don't come looking for it they don't have it. Unbelievable I said.  That cheese cake is heaven! Honestly I'm disappointed. I tried here regular strawberry cake. It's ok. The crust makes a big difference.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "If you go to the counter of a \"world famous\" bakery/restaurant in Brooklyn, on a slow Saturday morning expecting to have a fab time picking out cookies with your toddler, or any other sweet excursion or occasion, please don't choose this awful, still overhyped, why-would-you-reopen-after-renovations-and-hire-dumb-bitches-to-work-your-to-go-counter place.\n\nWe were rushed out. A mother with her son. Perhaps she didn't like that I gave my child a choice and he took a while deciding. Perhaps she was mad that I lingered for a while over the cute Valentine's cupcakes with heart-shaped sprinkles. Or, perhaps she's just a miserable person that loves company. In any case she didn't want me to order more than a quarter pound of cookies. I tried and she said no. \n\nI complained to the manager about it and he said he would take care of it and walked to the back. I have no faith in that, and I chose to leave soon after I spoke to him. I didn't want to keep my son waiting there for bullshit. \n\nObiviously, this is not the first negative experience I've had at Junior's, but it will be the last.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "What a lovely place! \nConvenient location, excellent customer service and best cocktails (at least for me)!", "author": "Rasulbek R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "30+ years later and 4yrs since my last review, and I'm still saying there is no other cheesecake like a Junior's cheesecake.", "author": "Yasmin R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-26", "description": "This place is gross.  I don't see what all of the fuss is about.  So what if its been around forever and is an establishment.  New York has so much good food.  Please, please, please don't waste your money or tastebuds by eating here.\n\nGross.", "author": "Ari L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Ate here in November 2015.\nIf you want a taste of pure heaven you have to visit this spot .Hands down the best cheesecake I have ever had .We ordered 3 slices (and trust me ,1 slice is huge ),the plain cheesecake,the strawberry cheesecake and the red velvet .Each one was absolutely amazing .Not too sweet or rich but trust me dont eat anything else on that day if you want to finish your slice .The waiters were really friendly and the service was good .Try this spot at least once in your lifetime if you want to know what real cheesecake should taste like", "author": "Nicole Stepping O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "Ordered the fish and chips cod. The portions were generous, the fries wide and thick, soft and airy on the inside. \nThe food was a pleasant surprise on this Thanksgiving.\n\nThis might sound odd, but sitting there I had the strangest feeling I'd been there before...It must be the decor which looks very retro, but retro in a good way. And way better than the \"chic\" places that are dotting brooklyn's gentrifying neighborhoods and creating a vibe of exclusivity and snobbery. \n\nJuniors was just 100% welcoming.\nI had no room for desert, so I asked for a cheesecake to-go. Awesome cheesecake.", "author": "Jay J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "OMGEEE. First of all, this was such a surprise to see Junior's literally down the block from our hotel. We came up for a girl's weekend and this was the FIRST thing we ate. \n\nThe wait was 0 minutes. The server, Davie, was handsome and courteous...did I mention handsome lol. He was on point, accurate and considerate. The 3 of us ordered, I had the BBQ Shrimp \u0026 Chicken with collards and Carrot Cake Cheesecake. The food was perfectly cooked. The cake was to die for. \nAlso, this place SERVES APPLETON RUM, which might not seem like much to NYC natives, but it's a HARD FIND in bars/restaurants in DC (my hometown).\n\nAll in all, I will be back. This is a MUST do when in NYC.", "author": "Alicia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Love this restaurant. Just dropped in with a tour group to get coffee and cheesecake. Delicious, as usual!!", "author": "Grace S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Will always come here when I'm in downtown BK. \u0026 get a slice of cheesecake it is still that good so worth it I know they have gone up in price that's because downtown Brooklyn has turn into Manhattan but as far as the other food there I don't know never tried it lol I always get the cake here so that's my story.  But the carrot cake is also on point too !!!!", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "MMmmMMMm Cheesecake, Seriously, love at 1st bite. I was so full from my dinner - a HUGE portion that I only ate about half of - but still managed a few bites of the strawberry topped cheesecake. And I am not a big strawberry fan. \n\nSo like I said, the portions are huge. The place is a bit pricey for a group of 8 but definitely worth a stop. I had a pulled pork sandwich that came with fries, fried zucchini \u0026 drink included. \n\nI took about 1/2 the meat off the sandwich to have for lunch the next day!\n\nWe tried a few different flavors of the cheesecake \u0026 other treats - all of it was fantastic. The original cheesecake is one of the best I have ever had. \n\nThey ship it too...mmm hmmmm. Come to Mama.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Worth the walk for several blocks, just to Grace the place that puts a smile on a persons face. The cakes we're worth every step to make it there. The manager Napoleon treated us like family. He's a must meet and worth the time to say hello!", "author": "Antonio P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Junior's Restaurant has the finest Strawberry Cheesecake in New York. Sadly, Walter Rosen passed away this year but the restaurant continues as it was. Located at DeKalb Avenue, the original location been around since 1950. A New York landmark, Junior's has maintained its authenticity, despite a suspicious fire back in 1981. Traveling to Junior's for their famous cheesecake is literally a rite of passage for any New Yorker. What some may not realize is you can still order some of their quirky old fashioned drinks such as the Orange Fizz. Very unique \u0026 refreshing. The egg creams are top notch too. As for the rest of the menu, I've tried a few things but everyone knows that you go here for the cheesecake. There's a large selection of items but don't even think about it. Just get the strawberry cheesecake. \n\nAnd by the way, if you're thinking of going to one of the Junior's in Manhattan, don't go to those until you've tried the Brooklyn one first. Theoretically, there shouldn't be a difference but it's a completely different dining experience. Well worth the trip to Brooklyn.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "Juniors is alright the food is average nothing special except their cheese cakes I guess. Its a bit over price for the quality of the food that they serve, but lots of tables and super fast service if its not too busy. Had an average experience waiter messed up my order and I knew more about the wine than The bartender who seemed clueless and was just spitting random words together to give an answer. So I just got a glass of what I know. Their loss because I was wanting a bottle of something different to try that morning. Although my order was messed up the waiter was polite and very very professional I think she was new and just nervous have her a nice tip too :) . That's it.", "author": "Issac L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}