{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-19", "description": "I've been going to Junior's since I was a kid and back in the '70s and in those days it had one of the best burgers in NYC.  Its 'D' special (cheeseburger, fries, and superb onion rings) would probably have been on a last meal request. The burgers were cooked over a flame grill and imparted a flavor impossible to achieve on a griddle or in a frying pan.\n\nThe fries and onion rings are just as they were made during my childhood but, sadly, the meat used in the burgers is not the same.  In fact, the quality was terrible.  I suspect the cut of meat was skirt steak, an awful cut of meat that doesn't taste good even when marinated and fully cooked compared to better cuts.  Of course, no one who remembers the good old days is fooled; the decision to offer the horrible modern incarnation was obviously made with an eye to preserving profit margins as the restaurant can only charge so much for a burger and these days even a very cheap cut of meat is expensive.  Frankly,I can't recall when I had such a bad burger and the experience was all the more disappointing when I remember the very high quality of meat used back in the day.  In those days Junior's burger was on par with that of any good steakhouse in the city.\n\nFortunately, the cheesecake was the same as I remembered, i.e., excellent, and management doesn't seem to have compromised on that staple (which would be extremely foolish as it is Junior's signature offering).", "author": "A G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Came for breakfast at about 10 am on a Tuesday. Corned beef hash was amazing, and we had great service! Lots of food for the price too. Definitely would recommend. We'll probably come back tomorrow!", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-10", "description": "I understand that all famous restaurants are over-hyped, so I was not surprised when this was not exciting. Most of the Jewish delis in New York have bigger reputations than are warranted, but they are all better than Junior's.\n\nThe food was meh. The bread on the grilled cheese was weirdly thick, which they made up for by putting on a freakish amount of cheese. Some things shouldn't be scaled up.\n\nIt must have been our server's first day, because he seemed to panic when he had to take our order and appeared to actually hide when we finally got the bill and tried to pay with a credit card. I'm not joking about him trying to hide - it seemed like maybe he didn't know how to use the machine and was having a panic attack. The manager finally spotted what was going on and made him go back to our table and let us pay. It was uncomfortable.\n\nIt took a long time to get our food and a very, very long time to pay, so it became painfully apparent that they play the same songs on a loop. There are not enough songs on the loop for it to not be deeply unpleasant.", "author": "Cori C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Awesome decor, clean and nice. Very prompt service. People are very nice. I was looking for something new I can try, just found it.although the price is little high but I like it. Food was delicious specially I love their breads with coffee.", "author": "Khan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "This place is a New York icon! I live in Colorado and was visiting New York and there's no way I could leave without eating a piece of Junior's cheesecake. My friends back home that are from New York would have never forgave me. \n\nHey, it's good cheesecake. The best I've eaten, no. I didn't eat anything else, but glanced through the menu which seemed pricy to me. This location felt a little dingy, but we sat on the side where the windows are larger (almost like a sun room). The other dining area was brighter and had more color. The service was great.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "I came here because I remembered Diddy make his band walk to Brooklyn to grab him a slice lol The strawberry cheesecake was delicious and worth every penny. It was my first time eating here on my first trip to NYC", "author": "Anthony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "DISCLAIMER: Five Stars is only for the Cheesecake which is always outstanding.\n\nThe restaurant is typical, old fashioned \"Mel's Diner\" (from Alice) diner fare and it was waaaay overpriced. It wasn't disgusting, but I wouldn't go back for anything other than dessert.  \n\nCustomer service was great and we were seated quickly which was great because it was a very cold night during Thanksgiving weekend 2012.", "author": "Tonja F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-16", "description": "I had breakfast there. Good breakfasts and service.\n\nRolls and pastries are put on the table to enjoy before your meal arrives.\n\nBooths! Cakes! Big portions, Big waffles. Maple syrup! Constant coffee re-fills. Jazz and Sinatra on the stereo. Lots of local heritage and news stories on the wall. Really good and attentive staff. I enjoyed my visit to Junior's. I can't stop eating this cheesecake! I'm not even a huge fan of cheesecake, but Junior's is delicious!!!", "author": "Carl B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Juniors has always had a special place in my meal plan when I am in BK. Although they opened a IHOP downtown the line was too long to wait so old school Juniors was a viable option.\n\nI had the Cornbeef hash omelet  and wedge fries with one of the best Hot Chocolates I have had in a while. I am not sure if it was the creamy whip cream or the yummy deep chocolate flavor, but it was all good.\n\n I dibbled and dabbled on some of the Mac and Cheese my sister had which was not good in my opinion. It tasted bland and simply not hearty just manufactured in the most boring way.\n\n My other sister had this huge Tuna Sandwich. My mouth could hardly manage the bite. The Tuna was dry! can you believe that? How do you forget to have enough mayo in your tuna sandwich? This was not ok at all.\n\nI also had their \"jerk wings\" which were more like bbq wings. I am going to have to check this next time because we had had too many before we realized they were not \"jerk\"\n\nBrunch is my favorite meal of the day and Juniors is an ok option for me, but not my number one goto.", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Be prepared to walk back in time.  The atmosphere is straight out of the 1940's and 50's.  Old style booths and tables will greet you.  The front of the restaurant is a full fledged bakery with every imaginable cheesecake you can think of.\n\nThe sit down menu has so many choices that you could read it for 20 minutes.  The lunch specials are easily enough for dinner and they include free unlimited refills of any beverage.  \n\nUsually its sad to admit but after having lunch there is no room for cheesecake.  But the few times I've saved room, it's been well worth it.\n\nI've also been to the Juniors under Grand Central and it was also very good.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "First time, and it will be my last. A lot of reviewers are saying they started off with pickles and cornbread, not me. They only gave me pickles and beets, ugh. For appetizers I ordered hot wings, which was actually good. And, my main course was a steak sandwich. It was terrible! They forgot to put onions \u0026 cheese. The steak taste as if it was rubber! I asked the waiter if I could exchange, and he kindly did. It was replaced with a bacon cheese burger. Let's just say frozen burgers from the supermarket taste better. But wait it gets worst, the water the waiter gave me had a long straight hair in it. Need I say more?", "author": "Jizelle O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "I came here solely for their cheesecake. Walk into their bakery side on on the left, you can order a slice of their cheesecake. I must say, I was pretty impressed by the strawberry cheesecake. I'm use to overly sweet cheesecake where by the 3rd or 4th bite, you are done. I enjoyed how Junior's cheesecake had a good balance of cheese and sweetness where I didn't get that crazy sugar rush in the head. It's still pretty rich. It was worth it to try, but I wouldn't consistently pay 7-8 bucks for a piece. Way too expensive for cheesecake.", "author": "Jessica Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "My first time here with my family from out of time. It's a shame I've lived in nyc my while life and never cared to stop in. Especially after the rodent problem. Years later, i had a sandwich and root beer from here and it was amazing.  The sandwich was big and tasty. Parking is good in the evening after 9pm. I would go back again.", "author": "Aleathia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "This place IS NOT what it used to be! Change is supposed to be good but I don't think that saying applies here. Firstly the table was extremely small and every time the waiter brought an entree or appetizer we had to rearrange everything on it to accommodate the new dish. Next the food the was horrible. The chicken and shrimp was very rough and the steak was burned. Then the waiter ruined three of six orders and appeared to be more frustrated than us. Lastly when the bill came he urged us to tip $36 dollars because there were six of us. It was understandable because I've heard of the gesture before however the service was horrible and he did not deserve it. We tipped the $36 anyway but I wouldn't want anyone else to suffer the way we did. Save yourself the trouble and go to the Applebee's across the street!", "author": "Alfredia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "I've been to Junior's twice now, and I agree with other Yelpers that their diner-style food is good but typical--i.e., tasty but nothing overly special. They have a large number of food choices on their menu, so, have no fear, there's bound to be something at Junior's you will like... but, I'd say stick to the more typical diner choices (burgers, omelets, french fries, etc.). My parter, Vinny, and I have had their sandwiches (the Pastrami is delicious and huge), burgers, fries, and onion rings... and they were all good. I didn't care for the cheesesteak sub I ordered on my last visit-- it was served on Challah bread, which I didn't realize was going to be Rye Challah... and the cheese served on the sub was ballpark style nacho cheese, which was unexpected and just okay. So, on my next visit, I'll be sure to stick to tried and true diner style food.\n\nPrice-wise, Junior's is a little pricey compared to most diners. In fact, it surprises me a bit based on its location in downtown Brooklyn. Most everything else around is reasonably priced. Also note that I haven't yet had any of Junior's famous cheesecakes yet, but I want to try one sometime soon... their entreé portions are just so big that I'm always overly full and just don't have room for dessert... and, in my book, that's a good thing!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "I wish this place was open late. I would eat here every night. The look and feel of this restaurant is amazing, it's so 50s retro. I love it. The decor looks so historical. The cheesecake is probably the best cheesecake I have ever had. Second is Ferraras. It's so smooth and creamy. The taste is so fresh and light. The service is great, and the cheesecake is better.", "author": "Yahya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "can you SAY HANDS DOWN\"!!!!!!?????? UNBELIEVABLY GOODNESS through n through the homemade chicken pot pies are to SERIOUSLY  DIE FOR!!! the pastami???? THE ULTIMATE!!! what a great experience!!!!ALOHA!!! BTW I'm buying the mustard to take home for reals!!!!", "author": "Windi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "Overrated and overpriced.\n\nThe strawberry cheesecake is good, but definitely not the best I have had.  I think they go overboard with the sugar and the strawberry sauce has to be preprocessed. I certainly doubt they use the real vanilla beans (they are perhaps too expensive to be utilized on such a scale), as I thought it was missing a strong vanilla flavor and aroma typical when a real vanilla bean is used. Just purely based on observation alone, you cannot see vanilla bean dots in the cake. \n\nThe buffalo wings are very good. I love the vinegary kick of the sauce here.\n\nOther than that,  Junior's serves pretty average diner food, with the entrees too overpriced to warrant a sensible consideration.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "The food is good! The French Toast is amazing! But this review is for the staff! I walked in here and everyone was smiling and happy! And they genuinely seemed like they enjoyed each other which is nice to see. It felt good to be in this space. And as they laughed and smiled amongst each other they were extremely attentive! Everyone checked on me. Most restaurants these days aren't as friendly it was nice to witness this vibe and be apart of it. My server Marcelin was really helpful and kind to speak with. As I was sitting at the counter top I read this article on their way about a retired employee named Mary Blevins who worked for 40 something years at the counter top , I can see how Marcelin could be this same kind soul to visit over and over again. And really all the girls were so sweet! Thanks for creating a happy environment in a sometimes hard world.", "author": "ALEXandria H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "We recently visited NYC and someone recommended Juniors.  We only went for dessert and it was delicious. They have a variety of cheesecakes and other desserts.  It's definitely worth a visit.", "author": "A. S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}