{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "My favorite is the fresh strawberry cheesecake. Everything is delicious. Slices range in price but usually in the $7.95 range which is not bad considering the generous portions. It's busy but they are so quick! There is limited street parking, but not too hard to find.", "author": "Diana U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-04", "description": "WOW\nhas this place gone\ndownhill..\nAs a former Brooklynite\nI remember the great sandwiches and even better desserts..\nThe food is maybe mediocre \u0026 the service worse...\nNothing is forever!!\nAnd they have the gall to add a 18% gratuity to your bill with out telling you\n!!!\nAnd then leave a blank spot for your tip!\nThe worst\nAlways always always check your bill!!!!", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "Juniors is a brooklyn staple, its a place i usually take out of town friends. \n\nJuniors is diner style food, from soups and salads to sandwhiches and pasta, bugers, buffalo wings  etc they have enough variety for everyone. \n\nThe place is pretty spacious and can accommodate different group types easily. I've been here with one person and ive been here with 20 people.\n\nThe service is typically good, on rare occasions i have dealt with a bad server or someone who didnt care much but its not the norm \n\nThe place can get very busy of course it is a very popular place so choose a good time to go. \n\nNow the main event!!! CHEESECAKE  \n\nthe cheesecake is offical!! ive had several different slices from the original to chocolate moose, apple crumb to red velvet which is my go to. The cheesecake is definitely a must try. The rest of the the desert menu is pretty good too. \n\nOverall juniors is a good place, nice variety, spacious, and generally good service. A brooklyn staple to definitely check out.", "author": "Desire W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "My first time visiting Brooklyn and my bf's friend was raving about Junior's cheesecake. Of course we had to check it out. The diner itself looks old from the outside in, like a typical old fashion diner should look like. The food I saw being served for other tables seemed like any other diner food. \n\nBut we came for the cheesecake. We ordered the red velvet and the original...oh my god. I normally would like red velvet more but the original won me over. Their cheesecake literally melts in your mouth and it isn't as dense as most cakes are back on the west coast. It amazes me how I could eat a whole slice without feeling sick from all the sugar. It sure has a lightness to it. I also found the crust interesting, since it doesn't have the typical brown graham edge. They instead used more of a breaded/fluffy cake type of consistency. I do enjoy eating my brown crust, but this was just as good.", "author": "Ester S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "I guess dining at Junior's is one of those things you have to do as a New Yorker, but perhaps once. In that case, I am glad I got it off my bucket list because there are these rumors about it closing due to the development.\n\nSave for the desserts, the food at Junior's is standard American diner fare but with prices considerably marked up because it is an institution held dear. After debating where to go for lunch before taking the train out of Atlantic Terminal, and wanting to visit a diner, my buddy and I decided to visit Junior's. After all, the cheesecake is good right? So we went.\n\nWe ordered eggs and protein, modest breakfast options you can find elsewhere easily. The portions admittedly are large. My buddy ordered eggs and bacon, I ordered eggs and pastrami. Our server explained to us that because it's around 12:30pm, we may not be able to get home fries and would get the steak fries instead. Sure why not.\n\nThe bacon was fried beyond recognizability. Meanwhile, I could not taste any flavor from the pastrami. It barely tastes smoky or cured, which is how one would want the pastrami to taste like. So I have these cuts of meat that resemble thin cuts off a steak. The fries were dismal. We got the steak fries, which I generally dislike because they have little flavor. There's no exception to the rule this time. No flavor, just wide blocks of potatoes that marginally taste like potatoes.\n\nOur lunch or brunch was therefore a letdown. But it was for experience. The saving grace to it was ordering a slice of cheesecake. It's heavenly and I wished that I went there only for the cake, because it was so good it made me almost wanting to forget about the lunch I had before. \n\nService is ok. Prices, eh.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "It looks interesting as you drive by but... don't waste your money!!! Maybe lunch would be okay.\nThe burgers looked good. I had onion soup it was the only thing that was okay. My mom had ribs-thumbs down and wayyyyy over priced. The Thai ginger wings I returned they were over sauced and not cooked enough. The vibe was horrible. The restaurant needs a MAJOR makeover! The place was creepy and looked dirty!!!! And wayyyy wayyyy too expensive for what it is. It's no Ruth Chris!!!!\nDon't go!!!!", "author": "Rhonda O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-11", "description": "Ridiculous. I ordered from half a block away and it took an hour to get my order. And they lack communication with their delivery guys. What did I order? Two slices of cake and fries.when I asked to speak to the manager I was put on an endless hold. Pathetic", "author": "Arhum M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "The salmon fillet meal is nice but really I just love the warm cornbread, yikes it's a guilty pleasure indeed lol.... but I also love the brownie cake!! #Yummy", "author": "Entirely U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I have to say that it makes me happy to have places like this still around.  It's a throwback to days gone by.  However, it is great for kids, they are greeted with coloring  page when you sit down.  You will always get something yummy to eat while waiting, from pickles, slaw and beets, to pastries or rolls and cornbread, it's all good.   \nThe menu is huge and you can get big salads, big sandwiches, breakfast, and so much more.  Matzo ball soup, yum, bagel and nova platter, yummy, Asian Salad, wow.  It' all here and all good, a staple, and more.", "author": "Neil G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-06", "description": "Juniors is a nice plc to give especially if your a tourist cause they're famous for their cheese cake but ..they can be a little pricey food has its moments of being good and bad", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "This review is just for the New Yorker milkshake (see photo of this gloriousness). It's vanilla milkshake with graham cracker crust on the outside of the cup and a strawberry cheesecake on top. SO GOOD. My friend and I shared it, and it was the perfect amount between the two of us... can't imagine eating it all by myself. \n\nStaff was very friendly, and we had a nice chat with one of the managers too about the popularity of the milkshake:) Came here on a Saturday at 8pm, and there was plenty of seating and no wait. Street parking (free after 7pm) is available but difficult to find an open spot.", "author": "Li W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-17", "description": "Where do I even begin? This restaurant is so bad. They're so greedy. First it's $15 for a sandwich and $17 for cheesecake!!! Are you kidding me?! \n\nWhen I did get the overpriced sandwich, the waiter forgot my lemonade. So we asked another waiter and he gave it to us right away. Then our original waiter comes back like 15 minutes later after we are finished eating. And he grunts that he had to throw away the  lemonade that he forgot. Excuse me but is it my fault that you forgot to hand me the lemonade? Is it my fault that you don't communicate with your other waiters?\n\nThen when we get the receipt, we noticed something odd. They calculated the gratuity from the price of food+ tax. Normally it's just 15% from the FOOD ONLY! But wait, it gets worse! \n\nThe price of food and tax was around $17. (See my receipt as proof). But the receipt said 15% of $17 was $4.75..... that seemed fishy to me as 25% or 1/4 of $16 is $4. So that's a big up from 15% to 25%. The actual 15% of my order was $2 something...... Juniors Cheesecake gave me a wrongly calculated gratuity to lure me into giving them more money! WTF! That's so rude and so bad! \n\nHOW DARE THEY TRICK CUSTOMERS BY GIVING INCORRECTLY CALCULATED GRATUITY. People please don't fall for these tricks. Most people just look at the suggested gratuity and then pay. But I am not most people. I hate liars! Computers don't make math mistakes but humans do. Humans can calculate 25% and then write it off as 15% to trick customers into paying more. I was nice enough to pay the 15% even though I was so disgusted by this service and disgusted by the trick! I should've paid $0 in gratuity! \n\nNever coming back here again!", "author": "Cal C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "I cannot say much about the restaurant, because I just dropped in to grab a cheesecake for a birthday. I picked out a three fruit (blueberry, pineapple, and cherry) cheesecake and it was really good. The service at the front counter was just OK. The guys seemed a little annoyed that I asked them for their recommendations. I admit that I can be kind of indecisive when I am faced with multiple options, so I wanted a few options. Maybe they were tired because it was kind of late, and they were just plain over work. \n\nOne tip for carryout: Upon arriving to another place to the have the cake, we agreed that the cake was absolutely AMAZING. If you think it is good right out of the box, let the cake sit out for about 45 - 60 minutes for an even better taste.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-16", "description": "I have been going to Junior for about 29 Years now and l must say it has change some from back in the day, but l still go with friends from time to time and enjoy a nice meal.", "author": "Lourdes G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "My coworkers say great things about this place regarding their cheesecake. Finally being in the area, I decided to get a takeout order of their original New York cheesecake. I got the whole pie which was ~$17.50? I only ate one slice so far and it was delicious!! They said strawberry cheesecake was their most popular, but I'm not a big fan of strawberry so I went with their second most popular, aka the original.\n\nI've had Boston chowder in Boston, philly cheesecake in philly, and now I can FINALLY say I had NY cheesecake in NY!!!", "author": "Shirley G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "Food: very classic America sandwich, soup and salad place. I got the BLT and it came with way too much bacon for my liking. I guess you get your money's worth! \n\nPrice: around 12 dollars for the sandwich \n\nService: okay service. They came to check on us a few times. The waiter spilled some water on my from his water jug when he was refilling my cup but I don't think he noticed and I didn't say anything because it wasn't a big deal. Could be more attentive though \n\nOverall, I know they are known for their cheesecake but I don't think I'd come again for a meal. Not my favorite type of food options available there.", "author": "Enya G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "I've been coming to Junior's ever since I was a little girl (decades)!!!\n\nI'm here eating breakfast....my server who is black (Eugene) took more than the normal time to take our order.... took even longer to see if all was well with us after giving us our meal.The only thing he rushed to do was to receive our payment. When we did get extra napkins, more butter, and jelly from the bus server.......\n\nHowever, the table right next to us....a table of 4 white women had about 3 different servers give them coffee, accommodate with their wobbling table. They had 2 servers bring them their food......did I forget to mention it was 4 at my table......\n\nEven as I write this post.....the table next to us has been severed refills on water and coffee by more than two different servers......\n\n#EnoughIsEnough \n\nNot Another Dime Will I Spend At This Establishment!!!", "author": "Sharmaine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "The food was good. Take out was so \nlong. I could have went to  a movie\n and came back.  At first ,they could\nnot figure out how to use my credit card.\nI had to call myself. It was a limited card, and\nI had to spend less for tip, and tax, etc.", "author": "Gayle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "I was pleasantly surprised by juniors in this location. In the past, I only knew of Junior's being that restaurant that is right next to shake shack down on the underground level at GCT. I also knew that they specialize in cheesecake, but that the cheesecake itself wasn't all that great.\n\nLater I found this location on a rainy day, and jumped inside in order to get out of the bad weather. The interior of the restaurant here is really nice, and very old timey. There were a couple people lining up at the front waiting to buy pie/cake, and there were a few patrons on the inside waiting for food as well, but for the most part this place was pretty empty. \n\nI sat at the bar and ordered a pastrami sandwich with russian dressing on the side. I think I was curious to see how the pastrami here compared to some of the more famous places here in new york, and was also curious to find out what russian dressing was exactly, since I've never had it.\n\nTurns out that while the pastrami here is not as good as some of that at the vaunted establishments in NYC, it's not too bad either, and I would totally order it again. Russian dressing also turned out to be quite good, and has a nice sweet taste to it. I'm not sure if something like this is authentically russian or not, but I certainly liked it a great deal. Overall, my expectations of junior's were not that high, so I'd say they definitely exceeded them here.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "I was Super excited to try the cheesecake here, I was a bit disappointed. I am from the dmv so Cheesecake Factory is the place to get cheesecake here in Maryland. Typically the cheesecakes are a bit more moist and topped with whipped cream. I was not use to such a dry cheesecake, not to say it was bad it was just a different experience if you are now use to it. I spent almost $30 for three cheesecakes so if that is not your style of cheesecake I suggest saving your money.", "author": "Alise G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}