{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Cheesecake is the bomb! Totally fun place to have lunch. You get a platter of pickles before your entree comes. That's non existent in this rent obsessed city.", "author": "Spiro G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-15", "description": "My friend and I wanted to have a decent breakfast at a nice place and so we came here. We had hoped to have great customer service and excellent food. Instead, we got mediocre service and great food. A horrible mix if you ask me. Our first server was rude, obnoxious and had a disgusting attitude. He did not inform us of the breakfast specials and we discovered it on our own, he said that it was our responsibility to find it out for ourselves and he immediately became defensive and gave us away. Our second server was spot on, but the first impression is what matters. He ruined my morning, but... The food was really good and cooked perfectly. The corn beef hash with poached eggs was one of the best I ever had. The banana slices were fresh and the pastries are soooo good... If you come here, stay away from Peter (the horrible server) and love the hostess. She made my morning so much better!!", "author": "Alex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "After trying all kinds of cheesecakes there, I found the the best flavor is the original. The three berry combo cake is also worth trying. We always get that one for some occasions.", "author": "hang g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "True story: I'm only a fan of their cheesecake and rugelach. Do not come here expecting great entrees along with their desserts. The entrees are bland. \n\nBut everything else is a check plus: service, presentation, decor, setting. The wait staff is incredibly friendly, the decor plays with the orange and white colors beautifully, and the diverse clientele (tourists, residents, and everybody in between) reflects the restaurant's status quo and spectrum of romantic dates and friends hanging out. Best of all, their cheesecake is the best, hands down. Their rugelach, random as it is, is a standout. \n\n if it weren't for Junior's, I would still be hating cheesecake (I abhored it when I was a kid) and would never have found rugelach that tasted as good as theirs.", "author": "Cat J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "I have been going to Juniors since the mid 90's and I have never had a bad meal there. The cheesecake is as good or better than you've heard, it's simply the best anywhere. The menu runs heavily to basic comfort food...steaks, decent seafood, good southern cuisine, and for the most part, the waiters are attentive and professional. Here's my problem:  Juniors prices have come very close to doubling over the past ten or so years. While I appreciate the fact that there's inflation, it doesn't come close to justifying a $90.00 tab for two people ordering a seafood platter with a beer, Caesar Salad, soup, soda and mac\u0026cheese with cheesecake for dessert. Unless they do something to make their prices more realistic, I'll limit my visits to taking out of town guests for cheesecake.", "author": "Seth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-20", "description": "(Jan/ 2007)\n\nWith little time to spare, we cheated and had Juniors not in Brooklyn, but at Grand Central Terminal. But it doesn't matter where you have it just as long as you have it-- right?! RIGHT!\n\nCreamy and rich, we had the classic cheesecake topped with strawberries. YUM!", "author": "Gerard B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-26", "description": "I found a curly dark HAIR deep inside my slice of fresh strawberry cheesecake. I still feel like vomitting and I will NEVER go back.  This place needs a health inspection ASAP!!!", "author": "Es L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Junior's is a cultural institution here in Brooklyn for a good reason.  The food is exceptional; the service is great; and the cheesecakes and chocolate cakes are perfect.  I highly recommend that everyone go there to eat at least once to experience it.", "author": "Jay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Hands down best cheesecake I've ever had. The portion is enough for 2. And relatively inexpensive at $6.95. Quick and courteous service is also a bonus.", "author": "Dominic M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "I've been coming here since I was very small. I love the service because It's super professional. The food is so good! Makes me happy that I live in Brooklyn. It can be a little costly though, but It's old fashioned good cooking! And then there's the cheescake. I'll let someone else rave about it. When you've had it a thousand times, frankly you just turn away.", "author": "Alisha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "As far as actual food is concerned, the food here is blah. I had the beef ribs which were gross. The bbq sauce they put on it was just watery, sugary ketchup at best. My brother got the beef goulash which was actually ok.\n\nNow on to the real reason for this review, the dessert! I actually came here because I wanted to get some more of their red velvet cake. See, a coworker of mine made the grave mistake of sharing some of her Junior's red velvet cake w/the me and i've been craving for it ever since. This is one of the best red velvet cake that i've had. It is DE-liscious!! I also tried the pumpkin cheesecake which was also great, you really taste the cream cheese and the pumpkin. \n\nI would never come back here for a meal, but all you have to utter is \"Junior's desserts\" and i'm there! Heck, i'll even drive!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "First of all, 5 stars for the service.  Excellent!  My colleague and I both had the matzo ball soup and shared the plate of potato pancakes.  I have to say the soup was a little bland, and the potato pancakes a little bready, but I still enjoyed both.  What the rest of my table got were the pastrami and corned beef sandwiches which they all LOVED.  They did look great.  Also I loved the free pickles they have on the table when you first sit down.  Would love to go back and try the turkey rueben since I don't eat meat.  They also have all day breakfast which was tempting.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-13", "description": "GREAT desserts, horrendous customer service.\n\nThe desserts are amazing. Caution: an order of pie can feed two or three people! One order of lemon meringue pie was more than  of an entire pie. Delicious! Great for a throwback to the old days, when people didn't know from cholesterol or food waste. The cheesecake is as decadent as ever and the pile-up of a pastrami sandwich still rules.", "author": "Elvis T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Pastry's for sure are legendary, had the strawberry cheesecake and it was amazing. It's big enough for 2 people, so don't be afraid to share. Only reason I would give this place 4 instead of 5 stars is the food came out a little but too quick if you ask me. I sat down and had great service, waiter was very good, but after ordering the steak burger, it literally came out 2 minutes later, don't know if that's a good or bad thing. Anyways, everything tasted great and pastries were amazing", "author": "Luis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "The interior design is really beautiful and takes your breathe away. The cheese cake in this store taste really good, and taste better than the cheese cake factory. The price is a bit expensive. The people working there are okay.", "author": "Cheryl W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-12", "description": "They brought me with my mint tea the peace of lemon which was in use before,it was in red lipstick and one side was bitten a little.red velvet cheesecake was ok but not the best one I've tried(very disappointed of this place(((", "author": "Viktoria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Tim and Tariq are the best bartenders here. They make the best apple martinis.", "author": "Tracy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "The strawberry cheesecake and chocolate cheesecake was to DIE FOR!!!! I want some right now! \n\nI guess is is comparable to cheesecake factory. I don't really need to go all the way to NY to get some cheesecake! hahah\n\nIf I could, i would give this place 3.5 stars b/c we had dinner there, and it was disappointing! Only the cheesecake is worth come back for.", "author": "Jen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "I came here just before closing (midnight) to pick up a cheesecake for New Years. The place was still bustling. I loved being surrounding by all types of cheesecakes! I got a small cheesecake for ~$20. It had three types of fruit on the top. I intended to eat more than one slice, but it was so heavy and filling, that I could barely finish. Overall, I will definitely come back whenever I have a craving for cheesecake.", "author": "Megan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Junior's definitely isn't famous for their food. It's absolutely terrible and expensive, but if you want a delicious pastry, you must, must, must try their cheesecakes. It's the best in the UNIVERSE!!! Please tell a friend! You won't be disappointed.", "author": "Allison R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}