{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "When entered no one greeted us. We ordered the cherry cheesecake. We are from Chicago where the food is amazing and honestly this cheesecake isn't all that. Not sure what the big thing was when I honestly think Costco has better cheesecake. And the manager was the rudest person ever, he wouldn't let us sit by the bar and eat our cheesecake. I mean if someone came to my business and bought food there I would be more then glad to service them. He had the nerve to ask \"did you buy this cheesecake here. Not impressed walked the entire Brooklyn bridge for an average cheesecake.", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "I'm in love with Junior's cheesecakes! The bottom is made of some kind of fluffy cake, NOT graham crackers, and it's so rich and fluffy! What did you put in there?! \n\nI think after having a bite of the cheesecake here, I can never let myself go to the Cheesecake Factory ever again! I can't believe it took me so long to finally check out Junior's here too. I got the Original, which I deem as my favorite. I guess this is what they mean when they said NYC has the best cheesecake!\n\nThe service was efficient when I first ate here with my family for lunch. The waitstaff was friendly for most of our time eating here. The food was alright. It was good but not mind-blowing like the cheesecakes! \n\nI will return for your delicious cheesecakes someday in your other locations, Junior's. As for this place, just check it out!", "author": "Melody W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-17", "description": "Food was universally disgusting. I guess they are known for their cheesecake, so if you have a real need for cheesecake in Downtown Brooklyn and you stumble upon this place by accident, then stick with that. Do NOT bother ordering anything else. If our four different dishes are any indication of the quality of the place (and it would seem likely that they would be), you're going to leave annoyed.\n\nEdit: Finally had their cheesecake from some random place in Grand Central. It was overly sweet, overly processed and painfully overrated. Juniors is an abomination. If you like utter disappointment, then this hole is probably your cup of tea.\n\nEdit 2: Ok, they simply have to be paying people to post positive reviews of this turd-factory...", "author": "Benjamin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-11", "description": "No idea what the hype is about this place. Must have some fantastic marketing I suppose, or maybe it was brilliant back in the day. \n\nGrilled Cheese with bacon and fries. Average at best. No better or worse than 99% of diners could serve up. Could have cooked better myself tbh.  \n\nRaspberry Swirl Cheesecake to go: For a place that is meant to be known for their cheesecakes, c'mon . Barely even average. I'm not one for big chain restaurants, but Cheesecake factory craps all over this. My local deli could probably do a better cheesecake if I had the balls to try it. \n\nLike I said, no clue why this place is as well known as it is. \n\nLocation, location, location I suppose. \n\nService was friendly, hence the two stars.", "author": "J S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-23", "description": "Note:\n\nUpdate: 6/16/2011\n\nI had uploaded a photo of the mouse along with mouse droppings found in the cheesecake display...and apparently my photo was taken down. It was flagged as \"inappropriate photo\". Really? Must have been flagged from the owner/managers from Juniors. Hmmm.... Well if you want to see the photos I was talking about, pictures of it was posted on the news channel NY1 news' website here: http://alturl.com/a98c9\nand also on Brooklynian's website, link here: http://alturl.com/a36ox\n\nAccording to the NY1 news...after several photos surfaced the internet about the mice issues found in Juniors, the Department of Health stepped in. Inspectors found evidence of mice in areas of the premises and Juniors was issued several violations. A follow up re-inspection was expected days later...however I'm unable to find any information as to the results of the re-inspection. Watch the follow up video on NY1 news here: http://alturl.com/p5yhf\n\n\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nPros: \n- None! Nada! Zilch! \n\nCons: \n- There was a homeless man sitting INSIDE the restaurant on the floor begging for change. \n- Mouse was found in the cheesecake display.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nMy HORRIBLE Experience:\n\nOkay, I had Junior's cheesecake for the very FIRST TIME! The worst first time experience ever! The first thing I noticed when I walked in, was a homeless man, sitting INSIDE the restaurant on the floor by the entrance begging for change. \n\nI came to this place after so much raves from P.Diddy's love for this place being the \"best cheesecake ever\". So I got the chocolate mousse cheesecake topped with chocolate chips to go, which costed $6.75 for one slice. \n\nI got the chocolate mousse cake on Tuesday October 22, 2009 and I was very unhappy when I discovered on the news the NEXT DAY Wednesday October 23, 2009 that there was a MOUSE found in the cheesecake display. I found out about it when my friend posted a picture of it on my Facebook! EWW! Gross!\n\nApparently, I'm not the only one that likes cheesecake! \n(see picture attached) \n\nThey should rename the \"chocolate mousse cake\" and rename it to \"chocolate MOUSE cake\" instead.\nSo does that mean the chocolate chips on the cheesecake weren't really chocolate chips afterall? =(\n\nA video of it was featured on the News on NY1. You can watch the video of it on the news here: http://ny1.com/7-brooklyn-news-content/top_stories/107668/mouse-photographed-in-junior-s-cheesecake-display\n\nYeah....I usually make my own cheesecake. I think i'm going back to just making my own. \n\nLuckily, I only tried a little piece. Once I saw that on the news....I threw the rest of the cheesecake in the trash.", "author": "Arlene F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "A very Southern style restaurant, but a little nauseating if you don't like the smell of fried food. You can also just order, pick up and go. \n\nGreat cheesecake! It is unmatched and I always come when I have friends visiting from out of town. The portions are huge, including dessert portions.. I never actually do finish my slice of cheesecake.", "author": "Lalouse H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Schlepped through rain for a bowl of matzoh ball soup.  Delicious!\nSplit a turkey reuben and chased it with the best cheesecake.\nService was good.  Our waiter was funny and attentive. Yum!", "author": "Mark W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Know for the cheesecake that pdiddy made his band protégés walk across the brooklyn bridge for while singing a biggie rap- this place also has a wide variety on the menu, good service and a straight up money egg cream!", "author": "Kira A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "Came here for cheesecake with girls. So we had red velvet cheesecake, Black Forest cheesecake and famous strawberry cheesecake. I think strawberry is really the best here. Red velvet and Black Forest versions were not bad but I would not recommend.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "Perhaps it was the 2 Brothers Pizza in Flatbrush, that got me sipping the NYC haterade in terms of food spots so far.\n\nA lot of my fellow Yelp buddies (and many other NY locals) appreciate this place with utmost respect.\n\nI came in and tried the Cheesecake and when I asked which was their most popular flavors it was between Strawberry or the Plain.\n\nAll I need to say is, I should have opted for the plain. Wasn't really feeling the gelatinous strawberries. Otherwise the cheesecake itself is on point. Now, if only their savory options are just as good. 3 stars... all for the cheesecake.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-11", "description": "We went to the iconic Junior's restaurant to get a taste of Old Brooklyn. Frankly the experience was horrible. From the moment we were seated things went badly. The waiter was downright unfriendly. He acted as if he was doing us a favor by serving us. He could barely hide his contempt when we asked him to explain items on the menu.\n\nMy friend ordered chicken dish which he felt  was overly dry and too salty.  I ordered grilled cheese on challah bread. The dish just wasn't that good. I've had better food in random diners across NYC.\n\nI ordered the cheesecake. It was OK. I have gotten better cheesecakes at bakeries other bakeries in the neighborhood. \n\nThis place might have been a great diner in its heyday but today its just a kitschy tourist spot.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "The best black and whites in NY! The staff is extremely rude though! I would never go back to this location!", "author": "Ivey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "Junior's has standard diner food along with a wide selection of desserts. I am not a fan of their cheesecake. They have a heavy, overwhelmingness which made me nauseated after a few bites. Next time it's someone's birthday, I will pass on the Junior's bday cake.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Shrimp bisque and fried chicken for me. So much to choice from. I love my hometown spot.", "author": "Sharon F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "I used to go to Juniors all the time when I was younger growing up in Brooklyn.  Went with some friends recently and the place looks the same, clean and decently decorated. The staff were very friendly. I ordered the half sandwhich pastrami with a salad and it came with tea or lemonade.  We had coupons for a free slice of plain cheesecake and had no issues using them.  You wont be disappointed with Juniors.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "In New York for first time and had cheesecake at Juniors. Excellent texture. Excellent richness. Excellent taste. A must have when you visit the Big Apple.", "author": "RC W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "yummmm if you're looking for thick, rich cheesecake this is the spot. \nI'm not a fan of going there because the atmosphere is kinda weird. Reminds me of an old school place. Our server was also looking at the ceiling and writing on his pad as we were placing our order. Thought that was pretty rude. Their actual food was terrible. I give it a 4 for the cheesecake only.", "author": "C. Marie .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Was in downtown Brooklyn helping mom out. I always love to try out true Diners with ten page menus. I heard all the stories of how great this place is. PLUS: 1. The condiment tray you get upon sitting down, such a true nostalgic thing. 2. They have the ten page menu 3.The outside has the true old school neon. 4. Yes the cheesecake was all it should be . IF it was a review of just the dessert it would be a 4.5 but the diner experience blew it. ONTO BAD: 1. Ordered a tuna melt, and shall we say, I guess in there eyes a 'melt' means melt the cheese under the heat lamp and the tuna and bread remain COLD.  2. Mom had the French Onion Soup how can it be greasy? 3. The prices are totally touristy and over the top, yea I know it is NY but it's a diner, what it is Brooklyn so it has to be Over the top 4. The server never checked on us once, and we had to flag down anyone to get the check. SUMMARY: If the friends/family come for a visit, take them for dessert on a non weekend for NYC Cheesecake, but not again for the food or service.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "I absolutely love this place. The cheesecake and pastries just melt in my mouth. It is a good thing that I don't live here or I would go here every day. The pastries are so delicious, they melt in your mouth.", "author": "Wendy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Let me start by saying their Fried Chicken is THE BOMB!!! OMG!!!! I LOVE THEM!!! They give you MONSTER pieces and it's just so HEAVENLY!!! \n\nThe mash potatoes are great their gravy is so delicious and the collard greens are the best I ever had!! Hands down they rock!!! \n\nTheir Salads are on the money! Fresh and tasty sauces. :) Oh yeah!\n\nI love their corn bread!! So GOOD!!! I tasted their Corn bread topped baked Salmon and OMG that is just too awesome along with their Catfish! WOW!!\n\nJust recently my mate and I had amazing service with a wonderful and most professional waiter his name is Zaman. If you want the most friendliest and amazingly detailed service you have to seek this guy out. He is top notch AWESOME! We now will always seek him out. He certainly makes your stay enjoyable. You will come out a happy camper. This guy actually cares about his customers. We had a great table and just sat in a great atmosphere. The manager was delightful. What a great place!! \n\nThe Cheesecake to DIE FOR!!! PERIOD!! Hands down AWESOME!!! \n\nCheck this place out! It is the go to for AWESOME SOUL FOOD \u0026 KICK ASS CHEESECAKE!!!! :)", "author": "Freddy R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}