{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "I used to go here every other week when I was visiting friends in Bklyn Heights for brunch and dessert.  There's also the location in the city by X Square, but I prefer this location becuz the service and is better.  The cheesecake is quality from the ingredients and the detail of all the samplers.\n\nJust doing some channel surfing and I came across Junior's selling their cheesecakes on QVC and it just reminded how much I miss this place.  You can also order all of their desserts on their website.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-05", "description": "I have been here  many times and every time the food is good, however the service is hit and miss. This morning it was down right crap. \n\nUsually once you sit down you are served the bread, pickles and condiments. Today, we waited to have our drink order taken, then we waited to have out  food order taken. The table beside us came 10 minutes after and were served quicker (their pickles arrived once they sat down). We were served our brunch. I asked for the bread and pickles and we were told that they were coming and to wait. We finished eating and then the pickles arrived. WTF??? \n\n  I will go back because the food is good. It is just disappointing when the service ruins the meal.", "author": "oWEN w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Came here for a little get together party for my best friend.Everything was expensive, but the sundae bowls that we ordered were really delicious. It's around 8-9 dollars, but that's honestly really cheap for the portion we had. ITt was HUGE bowl, and there were 9 of us. And every three people had a bowl and was filling.", "author": "Rafia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "This is kind of a tough grade to give out because Junior's is a diner style restaurant with a famous dessert bakery attached to it.\n\nThe restaurant is a basically a run of the mill diner.  It's nothing special but nothing bad either.  Prices are pretty cheap.\n\nOTOH, the cheesecakes are great.  I wouldn't go as far to say its the best ever but it's up there.  It can be a little pricey for you out of towners.\n\n5 stars for dessert and 3 stars for the restaurant part.", "author": "Franco G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-23", "description": "I don't know what all the fuss is all about.  Cheesecake is okay not to rave about.  I prefer cheesecakes to be light and smooth. Junior's is dense.\n\nMy neighbor loved Junior's until I told her about Eileen's on Cleveland.  After trying Eileen's, she converted.  :0)\n\nUpdate: 4/12/12  If you don't know, someone videoed rats roaming in the glass case displays.....", "author": "Aspiring M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-17", "description": "i would always have my mothers left overs from juniors, dinner menu \u0026 I'm not too hot about it.  I feel as though i make better ribs ,.. and whatever else they make. therefore they lose a star for that.\n\nHowever, the breakfast at juniors is complete HEAVEN.  They use some kind of..... something .....that makes their pancakes and french toast , sooooooooooooooooo good!!!!!.  The bacon is cut thick!, and they give you a good portion of eggs!.  They also give you a small amount of this concoction of apples and raisins , that go great with your pancakes or fresh toast!\n You could never make  what they have at home ,.. or get it anywhere else.  I Don't think any one knows how good the breakfast is , and it is served alll day!!!.. pleasee go and try it  ....!  soo yummy!!!. its what breakfast should be like everyday , and now, i feel as though whatever i have been eating  is trash.... \n*except my baby's cinnamon pancakes of course lol", "author": "Tee A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-02", "description": "Eh...its pretty average cheesecake; probably no different than the ones they sell in Entenmann's aisle.  Its good, but nothing really distinguishes itself from any other brand.  As for the food, its on par to being close to diner food...a bit pricey IMO, but not bad.\n\nI'm betting it was really good  (back in the day) when there was only 1 or 2 cheesecake places in the NY Metro area, but nowadays its competing with a tons of other grandiose joints.  Come for the historical value.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-15", "description": "The box says the best cheesecake in new york city.  This is false advertising:  it's the best cheesecake outside of the city as well. They also ship outside of the city, so you can spread the love to people who've moved away.\n\nI'd recommend the strawberry cheesecake or the original, but be warned:  You will go to great lengths to hide Junior's from any roommates, friends, or family.  Then you will feel guilty about it, and eat away that guilt with the remaining cheesecake.   You should probably renew your gym membership at this point, because you'll need it.", "author": "Pyke D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-24", "description": "Just writing this review makes me want to PUKE. Their food is disgusting. Do people really go there for cheesecake? Seriously? I wouldnt step foot into that Juniors if there was a meteor shower in Downtown Brooklyn and it was the only shelter around! (Drops Mic) my boyfriend disagrees on the cheesecake part. fuck him too.", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "Went here during my first trip to NY. I must say that the food wasn't that great. But the portions are ridiculous! You get a meal for 4, when you order for one.  Clear overcompensation for the quality.  Even the deserts weren't all I expected. Meh", "author": "Justin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "Their cheese cake is outstanding! Best cheese cake I've ever had! I dream about their cheese cake. Why the 2 stars? Because I went to the restaurant once and walked right out. My friend and I sat down and looked around and it was so dingy and uninviting. Also we were pretty much ignored by the wait staff. Big surprise considering the location of this place (full of sarcasm). The look of the grimy restaurant made me loose my appetite, but I still love their cheese cake.", "author": "coleen j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-30", "description": "Sorry, I would skip this place. \nIt is extremely hit or miss, with emphasis on the miss. The overall experience was confusing since my dad's pastrami sandwich tasted great but everything else was terrible and expensive. My split pea soup was from a can, and my potato pancakes were fried in rancid oil, something I've never even had happen even at much cheaper restaurants.\nI'd hoped that their trademark cheesecake would be the highlight, but it is just average. It may be that I don't like this style of cheesecake,  I prefer mine denser and less sweet. It does have a nice atmosphere, so maybe come and just get dessert.", "author": "vivien c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-11", "description": "The food here sucks!! I've went here twice, and I ordered the chicken fingers the first time, and it was horrible. The second time, I can't remember what I got, but it was equally as bad.  \n\nIt's only redemption was the strawberry cheesecake....soo decadent...tasty..creamy...yummy...and it's all for meeee! My driving instructor in Buffalo, actually requested me to bring him a slice when I go home for vacation.  That's how good it is! He wanted me to freeze it and lug it back...but I haven't been back..soo too bad. This place would've been 4 stars if it wasn't for the crap food...blegh", "author": "tiffanie n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-13", "description": "The major selling point from my friends was the cheesecake.  I was told that even if I don't like cheesecake, I'd like theirs.  So we go.\n\nDiagnosis: meh.\n\nIt's a glorified diner.  It's got an old-timey kinda feel to it (like 1940s).  The wait staff has a habit of acknowledging that they saw you and come by to tell you that they won't hear your service request just yet.  The food is for the most part passable (I liked their Matzah ball soup).\n\nThe cheesecake?  It was good.  But I'm not singing praises.  I think I gotta be more skeptical of my friends' exaggerations...", "author": "Anthony Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-25", "description": "My parents recently took me here. This is where they used to go on dates in the early 80s, which I think is so cute. My parents of course had to split some classic sandwiches of the roast beef/pastrami variety and an egg cream. And they took some cheesecake home. Me, being a veggie, got the potato latkes. And for a Jewish girl with some high standards of these things (really, my mom just makes them best) but these were good! I also got a side of pasta which was larger than I thought. There was so much food on the table as they also give you complimentary bread, pickles, cole slaw, and it just keeps coming. \n\nThe only downside was that this place was packed and we were crammed in. Screaming babies everywhere. Just a little too insane for me.\n\nBut overall, a nice dinner with my parents, who took a trip down memory lane.", "author": "Jae K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-05", "description": "Hands down the best cheesecake I've ever had and their sandwiches are extremely filling and indulgent. While its true their prices are a bit high, this is a very classy restaurant. The atmosphere is very inviting and perfect for families.\n\nYou should also check out the Junior's Cookbook on Amazon if you want an awesome Goulash recipe.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Best cheesecake in NYC.  I've tried so many of the flavors and they are all great!!!.  Never ate the regular restaurant food so i am no help there, but why eat that when there is CHEESECAKE!", "author": "Theresa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-29", "description": "Tried the banana shake this time and it was pretty good, not too sweet. The chicken fingers were ok with a sauce that is an acquired taste. The mac n cheese tasted like mac n cheese you buy at the grocery store; nothing special. The original cheese cake tasted much better than the Rasberry Chocolate.", "author": "Ss S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-06", "description": "I give juniors freshly baked (store bought )strawberry cheese cake a 10 star rating, but what ever you do DON'T ORDER IT ONLINE!!!!!!! I ordered a strawberry cheese cake on line for $54.00, was so excited but when I opened the box the pie was completely frozen. So I waited a few hours for it to thaw out, I then took a bite and it tasted like 6 month old FREEZER BURN cheesecake that was not freshly made. The gram cracker crust was soggy and the strawberry topping tasted like frozen jelly.  I was born and raised in NY, now live in DC had a taste for it, but now, Ill just wait when I go back to NY and get it there. Luckily, customer service was nice enough to give my money back along with S\u0026H!!! SO moral of this story...GO TO THE ACTUAL BAKERY IN NYC, you will love it while its fresh.", "author": "Tricia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "I haven't been to Junior's in Brooklyn in a number of years, but I do have to say I was not disappointed.  The food was great.  Their free cornbread is my favorite handsdown.  Its soft and sweet and melts in your mouth.  Just delicious.  I ordered the bacon cheeseburger, which was so huge that I could not finish it.  I brought it home and devoured the remaining portion the next day and it was still just as good.  I was too stuffed this time for cheesecake, but they aren't going anywhere, so I will definitely be back.", "author": "Toy L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}