{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Went here for the cheesecake and ended up with a full meal. This is an old school diner with a full all day menu and old school vibe. The disco fries were our app and the gravy on them was awesome. The meal comes with bread, coleslaw, pickles and an awesome pickled beet salad. \n   We ended up full on the fries so took our BBQ rib entree and corn beef hash with poached egg entrees back to the hotel. We didn't end up with photos of those but the ribs were nothing but bones when hubby finished them. They came with steak fries that we didn't eat. The corn beef hash was pretty standard- but a solid breakfast item. Both entrees are pictured in yelp and ours looked just like the prior pics.\n  Of you want a good solid diner with INCREDIBLE cheesecake then this is a really good option. Service is friendly as you would expect in a diner and it's a great place to hang out, Sri I coffee and watch people.", "author": "Terrell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Visiting for the weekend from Florida. First time in New York. \n\nThe atmosphere was great. The location and views were phenomenal. The employees were great as well.", "author": "Anthony B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "I realize that Junior's is a bit of a tourist trap, but as far as their breakfast goes, it's one of my favorites in the area. \nWe come here about 3 times a month and ALWAYS leave satisfied. \nThe staff is consistently friendly and though it's slightly overpriced, the food is really great diner food. \nI've only ever come for breakfast because the regular menu doesn't really appeal to me.", "author": "Rae S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "Best cheesecake I've ever had. We got takeout of one of the tiny mini cheesecakes and it blew my mind away. We even accidentally ordered chocolate but I still loved it (I wanted the original)! This was my first encounter with NU cheesecake so I cannot compare it to other places. But as a tourist looking for some good dessert, this totally hit the mark. I will DEFINITELY come back when I'm in the area again.", "author": "Amanda I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-08", "description": "So I tried Juniors in Manhattan and I instantly obsessed over their cheesecake! For some reason, I didn't have the same effect from this spot:/ \nThe burger was too dry. I actually had trouble swallowing and couldn't ask for help:/", "author": "Sara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Man oh man oh man can I just say that these cheesecakes are phenomenal!\n\nThis is my first review of Junior's, but not in the least my first time here.\n\nI have had their cheesecakes on numerous occasions and this time I got the most amazing, chocolate loaded \"devil's food cheesecake\". I told myself only a few bites, and I barely made it out of Junior's it was almost done.\nABSOLUTELY phenomenal!! easily 10/10\n\nI have only had their breakfast once at least ten years ago and from what I recall, I really liked it. I'll definitely be back to dine in", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Love Juniors too bad southerners don't know about this. If you love cheesecake this is better than the cheese cake factory. They make all of their cheesecakes on premises. They have a wide range of food selection for those that might just want to add a dessert to their their meal or just get a dessert by itself either way you can't go wrong. My 3 favorites is the strawberry cheesecake, classic cheese cake and strawberry shortcake.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "Last time I was here. (See previous review) the service was bad. But tonight the service was worse .me and my wife visited on 4/13/19  it was horrible I ordered a burger\nWith Swiss cheese and sautéed onions they gave me a burger with red onions not sautéed and it was on a plain hamburger bun that was too small for a burger of the size they're selling.  Never again. Next time I will try The Apollo diner on Livingston st. Juniors is way overrated", "author": "Vernon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Friendly server, lots of food, I mean a lot of food. Rolls and cornbread basket, pickles, pickled beats and cabbage slaw. You know a restaurant is mindful of the culture it's part of when the food they serve reflect the various people in the community. My friends ordered Escovitch salmon with rise and peas, collard greens. I had regular salmon with rice Florentine and collard greens. Couldn't tolerate desert we were so full and Jr's is known for their cheesecake and pies. The leftover champagne from the mimosa was given to us to finish off. Coffee was great, met an 85 yr old man celebrating his birthday with his son and friends. Just an over all great environment with good soul food. Loved it.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Service was excellent. I was excited to try the infamous cheesecake and decided to eat there as well. My fish was perfect the side were nothing special but not bad. \n\nI was very disappointed with the cheesecake kinda skimpy for ny cheesecake, lacked flavor overly topped with berries. Not sure why Diddy made them cross the bridge for that cake but my trip could've done with out it.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "Cheesecake.\n\nBrooklyn-born and raised here, so it has been ingrained in my mind that Junior's is the original NY Cheesecake, and for good reason. While it probably will clog your arteries and make you die of betes eventually, it's worth it while the dense caloric dessert lasts. \n\nJunior's Cheesecake is a gem from the time before we fell prey to the gluten-free, dairy-free, soy-free, flavour-free trends, but oh well, that just means shorter lines for me.\n\nWe came here on a warm Friday winter evening and surprisingly were seated immediately for two groups of 10. The place really gives you that NY/NJ diner feel with all of the old-school memorabilia, but at the same time, I felt like the booths were crusted with half a decade's worth of crusted fountain soda.\n\nOur party had two steak burgers, a bunch of shakes and something terrifying sweet called the \"cookie monster\", and a slice of the original Cheesecake. The consensus from the group was that the food was meh, but the cheesecake was the bomb diggity. \n\nWas the experience worth $16 for a mediocre burger? Probably not.\nWould we come back for the vanilla shakes? Fat chance.\nDid I enjoy my chesecake? Hell yeah.\n\nI think the secret to Junior's is to stay for the cake, but avoid any of the tourist-trappings of actually consuming food here.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "Great local place for traditional American diner food and FABULOUS cheesecake. Come here to experience local Brooklyn!\n\nI love the traditional 70's style burnt orange and mustard yellow colors; they have maintained and kept in shape their original diner furniture and it's like a ballast to the past.\n\nThe restaurant size is huge especially for New York real estate, allowing them to serve many customers. Service is quick and friendly, making it a joy to visit. \n\nPrices for food is extremely reasonable. We got the chicken tenders appetizer which was probably about a pound and a half of fresh fried chicken breast for about $15! I loved the Mazzeo ball soup too: great on a rainy, gloomy day. \n\nKnown for their cheesecake, there are over a dozen types to choose from. I can't say I've had cheesecake quite like it before. There is something unique and amazing to its taste! Perfectly baked with amazing texture too. \n\nIf you have never been here, it's a must!", "author": "Tiffany P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-01", "description": "I came in for an omelette one day and the entire experience was average at best, from the food to the service. It was a basic diner that didn't stand out in anyway, except perhaps in the higher than normal price. \n\nI unfortunately did not try the cheesecake, which perhaps would have enriched the experience.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "I've been to Juniors plenty of times but I never actually dined in. I would order a cheesecake to go on random occasions but this time I met up with a friend for drinks. I never even walked all the way inside the restaurant. Sad to say since I'm a Brooklyn native. The bartender was hilarious and friendly. I think his name was Tim, but I could be wrong. I'm pretty bad with names. Anyway, the drinks were strong, the company was good, and the hot wings were tasty. I like my wings pretty mild and it was nice. They had the blue cheese dip and the hot sauce on the side for dipping. The wings weren't pre-tossed. I wish there was a bit more celery. I love the celery but there were only 2 measly sticks. Boo! I also had the buffalo shrimp which was actually coated in the spicy buffalo sauce. It was good but pretty typical. Tasty but nothing special. Just good bar food/appetizer. Again, only with 2 sticks of celery. I know what you're thinking. I feel the judgement as you read this. Who cares about the celery? I do! It's great for groups big or small. This is where New York natives, tourists, and families on vacations come together and meet. Definitely kid and family friendly.", "author": "Anya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "The Original! A Brooklyn institution - serving the best cheesecake in the world. Classic restaurant and bakery, serving all day breakfast. Friendly service and the food is amazing. They ship all of their cheesecake as well, but you have to dine in when in NYC - and yes even if staying in Manhattan hop on the train and head to the original spot in Brooklyn. Dinner served with house made pickles and rolls . . .outstanding. All the breakfast foods you want as well - breakfast for dinner I'm just saying!", "author": "Dan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "I'm sick of deconstructing hierarchical patterns, to hear people say nothing is, and yet, everything is, and then offer their own arbitrary rules to live by. I'm sick of people saying for instance that Junior's cheesecake can be labeled as Junior's apple pie. That the only reason we call it cake is because society deemed it cake. Well, yeah. Let's move on to better things. Let's rejoice in sincerity. \n\nI want to be spoon-fed this cake on a beach in Los Angeles. Why I have to eat it in grey Brooklyn is because God has made it so that I shall never be content. I'm a pocket square dandy in a world of hobo chic. I suffer with cheesecake. I cry with with strawberry topping. \n\nI weep for churches and spires and old Brooklyn. Junior's is across from the train station. I used to visit my best friend here and we no longer talk because of politics, and how sad is that? Surely, that colors my experience of cheesecake. \n\nBut no matter how subjectively I deem the cheesecake, it remains what it is.  A very old recipe by a time-tested restaurant. The kind of place that serves tea in a metal pot, which I always forget to place my tea bag in. In the ceramic mug is less efficient, of course. \n\nI'd come here again, but only after the PTSD of studying art in New York wanes. Fact is, no one reads anymore. But they still go to Junior's. No one paints but still eats at Junior's, takes the train. We don't type but we stick our thumbs in cheesecake. I have many things to look forward to in New York. A spontaneous hand-holding maybe outside the DeKalb stop. I lament for whipped cream. I cannot look at anything objectively. This iconic diner, no less. I digress. \n\nIt may be best to stay faithful to classic. To wear sadness and eat cheesecake.", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Waited a while to write this because......\n\nMaybe I'm 100% wrong for not liking a place because of ONE staff member but sue me. I'm sorry I have to leave this type of review for such a BKLYN attraction but it's in the hope that the staff member reads this and learns it's not okay to touch strangers! \n\nNote well, I've been here before my Yelp days and my visits were good ones. \n\nOn THIS visit I was at the bar having a drink as I poured over their menu trying to decide what to try. Staff member passing does a double take, comes over, wraps ONE arm around my waist and with a squeeze whispered I love your look..I belligerently shoved his hand away and said in the meanest of tones. Don't you ever touch me again!\nInstead of apologizing, he made excuses like \n\"I was only paying you a compliment\", \n\"What's wrong with you?\" etc etc.  \nIt would have been BAD had he touched my hair but he touched my BODY, he touched my fat! I am typing this and I'm mad all over again! \nI paid my bill and left. I couldn't sit there to eat with that beast walking about. \n\nWould he have done the same thing had I been sitting there with a man because he \"liked my look\"? Would he have done this with anyone else? I'm I SO approachable? \nWhy did he take God out his thoughts and thought touching me (or any stranger) like that was okay???? Not even a pat on the shoulder (not that I'd like that either). I don't like strangers in my personal space.  \n\nHey you, if you're reading this, it's NEVER OKAY TO TOUCH SOMEONE WITHOUT THEIR INVITATION/consent!!!! I DONT CARE HOW NICE YOU THINK YOU WERE TRYING TO BE. ARE YOU EFFING MAD?\n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Junior's is and will always be one of my favorite  places to go for a hot pastrami  sandwich  on rye or an onion roll. I didnt have a lot of time, so l walked in placed my order to go,and strolled over  to get a good view of the cheesecake  selections. I didnt want to be greedy. But a small pineapple  cheesecake said \" take me home\", and so l did. I hot my sandwich  on rye and ordered two onion rolls and was on my merry way. The sandwiches  at Junior's  are very tasty and very thick and the pickles  that come on the side are delish. There were a few times that l watched HSN and they offered Junior's  cheesecakes on their channel.\nMy parent's  used to order  them in Savannah when they got home sick. Lol. Not me!\nI want the real  deal, right  off the press.\nAll l can say, if you are in Brooklyn, its the place to be. Try it, you will like it.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "It's hard to not like the nostalgia and hearty portions at Junior's. Come hungry because portions are gargantuan. Our group of 6 stopped by on a Sunday afternoon for cocktails and dessert (don't judge), and we were seated right away under an array of Brooklyn and New York memorabilia. Our waitress was genuinely kind and took care of us like family. \"Sure thing, honey\" and \"you got it, baby\" remarks were endearing and provided well-rounded customer service.\n\nWe ordered 3 different desserts each split between 2 people, and each was better than the next. For a classic cheesecake, The Original Cheesecake is a sure crowd pleaser. The Carrot Cake Cheesecake was the best of both worlds combining two iconic desserts into delicious bite after bite. If you're looking for complete indulgence, the star of the show was The \"One-and-Only\" New Yorker Cake Shake - a strawberry milkshake topped with a fatty slice of strawberry cheesecake. This thing was so ridiculous, it even came with a cheesecake rim. A total \"treat yourself\" luxury, I would recommend sharing this beast with at least 2-3 people.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Would recommend! We had the pastrami sandwich! It was finger licking good! The portions were huge so be prepared and go in with an empty stomach. \nComing for Europe, it is a dinner as you see them in the movies. \nWe had the most darling waitress (Lotoya) she was beyond nice with us and checked on us regularly and her good mood was contagious!", "author": "Marie T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}