{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-16", "description": "After I made the move across country and settled on living in Brooklyn, people kept telling me that I should immediately go try the cheesecake and Junior's, which is only a few blocks away. Juniors has been around since 1950 and the diner is nostalgic for many New Yorkers.\n\nTonight, I was finally craving something sweet--and it wasn't freezing--so I made the trek over to pick up a chocolate swirl cheesecake. Hoping the quest for the \"best\" cheesecake, as eater's kept saying, was over, I carted it home with delight. I expected a slight crisp on the top edges of the cake, the cheese forming a natural crust in the oven, a smooth, creamy texture inside, and a final cookie crunch of the crust. \n\nInstead I found the cheesecake overpoweringly sweet and the sides of cheesecake had an odd stale flavor. The artificially sweet flavor that lingered after every bite was too strong, and while texture shortcomings are challenging to overlook, the artificial sweetness made me put my fork down. If you're going to indulge, make sure it's worth it--consider whether you are looking for nostalgia or fresh flavor, before carting one home with you.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-25", "description": "I really don't know what the hype is about seriously.  I went there on Saturday  and the service was horrible  the food wasn't great  at all so am assuming  they are known for their cheese cake . The red snapper dish had no seasonings at all it was jus plain -even though I was told the chef is jamaican  hmmm I guess not all Jamaicans can cook. The lady next to us had a salmon dish that looked  good . I won't be going back to juniors for dinner just cheesecake.", "author": "Khacia Shana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Beware dishonest service! Our waiter, despite taking his sweet time through our whole meal, took it on himself to add an 18% gratuity without pointing this out -- setting us up to add a tip on top of the tip he'd give himself.\n\nI worked in the service industry for 10 years, and always tip 20%, but this drives me crazy. Only time it's acceptable is if it's a big group, or Europeans -- we're neither. We live done the street.\n\nI pointed it out to the manager who offered to take it off, but also said \"it's a holiday.\" (It was New Year's Day). What does that have to do with it? Gave me the impression he's in on it. \n\nAnyways, food is good (had the matzo ball soup and the reuben) and the cheesecake is great. But dishonest waiter kind of marred the experience.\n\nUPDATE: I wrote Juniors an email about the incident and they offered a thoughtful apology .. Sounds like it might have been one rogue waiter or manager", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Overall, a great place to eat . I 'm a fan of the cheesecake which is good for two. Who wants to share! Enjoy my friends.", "author": "C J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "My review is for delivery in downtown Brooklyn.\n\nFAST delivery for order I placed just past noon. I ordered the \"Lunch Delight\" . The half sandwich was the size of a slider but packed full with moist pastrami. The matzoh ball in my soup was a bit soggy, but authentic. Good broth.  Perfect comfort food meal for fighting off a cold. I can't say the same for the slice of cake I ordered in a moment of weakness. But that thing is huge enough for 2 people! I'll try to restrain myself.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "Had an ok experience. Had to wait 45 mins for a table but maybe that's typical for such a synonymous place. My mom and I came here during a stop on the Gray Line and we had the best time trying to figure out which cheesecake to try. Cheesecake was ok. It wasn't as moist as I'm used to. \n\nBeing from Cali I wasn't aware that they had butlers in the bathroom, so that was different. Wanted to give this place 5 star because it was on our must see list in NY. I'm hoping if I have another opp to come back it'll be a better experience.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "As a native New Yorker, I'm sometimes hesitant to say that I enjoy Junior's restaurant in Times Square...but I DO!\n\nEven though it can get crowded and filled with tourists and theater-goers it still is a great place to go. I enjoy sitting at the counter for a retro vibe and less of a wait - especially perfect before a Broadway show! Food is good and portions are huge so you might want to consider ordering less and sharing. \n\nDon't skip dessert (\u0026 remember to share)- my favorite is the Chocolate Mousse Cheesecake, it's enormous and amazingly delicious, you won't regret it!!", "author": "Marissa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "The original location but a dumpy dive. The Times Sq location is much nicer. Service here is on a good day merely disinterested. Cheesecake is the same. ;)", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "Went with my girl to do her taxes downtown yesterday and she had never been to Juniors so we decided to have lunch. I probably have been here in 25 years and it looks exactly the same. I kinda liked that.  Wasnt crazy about the very small table we were given, barely enough room to hold all the comps they give you. Pickles,cole slaw,corn bread,rolls and the best of all pickled beets with red onions. We made quick work of that dish. Very yummy. \n   I had the soup and half sandwich combo. The shrimp bisque was just ok. The shrimps in it were, well shrimpy. It was one of those dishes that taste kinda good and then starts to just feel repetitive. I had the pastrami on rye and it was good but a bit too lean. They have their own mustard but I think its just licensed Guldens. \n  My girl had the fried seafood platter and she seemed happy with it, I had a scallop and it was pretty good. The fries we split were decent diner fries. We split a piece of pineapple cheesecake because thats what you do at Juniors and it was good as it's always been.\n    The problem was the service, my girl ordered a frozen pina colada and they brought her a \"virgin\" one. She kept complaining she couldnt taste the rum in it and when the waiter finally returned at the end of our meal she asked him why it was so weak and he said \"well you asked for a virgin\". We both said she did not. Now my girl only looks like she is 16 (shes 25) and not sure if he took it on himself to give her the virgin one. However after we pointed it out I was a little upset to see it still on the check. Didnt want to make a big deal out of 7 bucks so he just got a smaller tip. The fact that I had to basically wave my hands like I was landing a plane to get his attention to give us the check didnt help his cause either.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-04", "description": "The cheesecake deserves every accolade it's ever gotten; I'd rank it 2nd, right behind S\u0026S for the best in NYC, and by extension, the best in the world. But when it comes to everything else, don't be fooled. Junior's might be an institution, but it's also a diner, and not a particularly good one at that. \n\nI broke my rule of never ordering anything out of the ordinary at a diner, and I went with some barbecue. But in my defense, the menu said it was famous. They wouldn't lie. FAMOUS! (Perhaps for being cloyingly sweet, and most-likely microwaved.) \n\nThe 10 oz, charbroiled burgers are also famous, ostensibly for being under-seasoned, and largely flavorless. The chicken fingers, usually a diner staple that can't be screwed up, were not particularly good either, and the honey mustard accompaniment was more of a vinaigrette salad dressing than a dipping sauce.\n\nHowever, never let it be said that anyone left Junior's hungry. We ordered food for three, which turned out to be a meal for at least eight or nine people, and that's without the tremendous amount of extras they bring (pickled beets, cole slaw, cornbread, dinner rolls, pickles, etc.).\n\nThe atmosphere is also impeccable. The oldies (but goodies) playing over the PA, combined with servers sporting bowties, offers up the pleasant possibility that this place hasn't changed in fifty years. Although, I'm betting they didn't offer three different kinds of Alize back in the day. That's one reason why life is good in 2011.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-18", "description": "When I want a NY cheesecake, this is what my mouth waters for.  This was my final stop before leaving Brooklyn to come home.  I made my friend sit in the car as I drove around 4 times looking for a place to park, finally I double parked it (everyone's doing it, even the cop ahead of me in line) and made Brendan wait in the car as I got my slice of heaven.\nI prefer the plain, there is nothing like it- cheesey, creamy and dreamy!  I brought a 2nd fork and wishing I hadn't, the man who doesn't like dessert grew a broad grin as his first bite of cheesecake melted in his mouth.\nI've never eaten inside a Junior's so I can't remark on their service but I can tell you this is the BEST cheesecake I have EVER eaten, and don't nobody go telling my mom I said that!", "author": "Tawheed H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-17", "description": "It would have been so nice to actually experience Junior's but unfortunately it didn't work out on our first go around. I went to Jr's today at about 11 to indulge in some breakfast. The closes I got to my goal was looking at the menu. After being seated and waiting on my waiter to come out of hiding for about 20 minutes I kindly walked out. Perhaps there was some sort of miscommunication on someone's part. I don't know.\n\nAs far as the interior of the restaurant is concerned, it was nice with white paper covered tables and decent looking silverware. Hopefully I can add a lot more positive comments to this review sometime in the future.", "author": "Sheldon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "The best part of Juniors is there Famous cheesecake , absolutely love there cheesecake. I have tasted many cheesecakes In different restaurants  but this is the best I ever had. It's Worth it and not expensive at all. That's why I give them 5 stars. Definitely coming back for more.", "author": "Ide I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-25", "description": "A real Brooklynite knows Juniors is only good for their cheesecake. \n\n\nThe Cheesecake: Best I've ever tasted hands down. (I'm partial to the cheesepie because it has the little \"crunchies\" on it.).  (:\n\nThey also have seasonal cheesecakes. The Pumpkin Swirl I purchased for a Thanksgiving family gathering and it was a big hit! I also devoured a personal slice of the Carrot Cake Cheesecake, it was equally yummy if not better.\n\nThe Food: If you're going to Juniors for a meal it's pretty much just to pay for overpriced lackluster food at a well known restaurant .  I personally don't care for the way their food is seasoned, I find it to be extremely bland. When eating here I stick to the basics and I'm not disappointed-- sandwiches, burgers, breakfast, and the buffalo shrimp appetizer. Their classic cocktails are well made also.", "author": "Vana C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-05", "description": "I expected a lot from Junior's, having been to their Grand Central location in Manhattan, but this location was a bit of a disappointment. I'm giving it 2 stars because I enjoyed their cheesecake and their burgers were decent. Unfortunately their service was the deal breaker.\n\nMy bf and I came here on a Saturday night to get dinner before a show at the Barclay's Center. We arrived at 6:30 and it was already popping. There were a good number of people waiting to be seated. I asked to be seated and the manager rudely mumbled something and walked away. I waited for the hostess to come back and she seated us right away.\n\nWe waited at our table for about 15 minutes before even being greeted and brought some water. We ordered some cocktails that took another 10 minutes to arrive at our table. We finally ordered and I thought \"okay it should get better from here on out,\" but unfortunately that was not the case. We ordered burgers and when they arrived they were lukewarm at best. It appeared as though they had been sitting for a while before someone brought it to our table. \n\nWe then asked one of the other servers passing through if we could have extra napkins and he said \"sure\" but continued to pass by us without bringing them. I walked up to our server and he said that he was not the server and arrived at our table 5 minutes later to say that he was actually our server. I don't understand how that kind of confusion can possible happen. I was a bit of a struggle to get any employee's attention. The food was okay but there are a lot of places in NYC to get okay food for much better service.", "author": "Jasmine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Holy freaking delicious! \n\nWe've lived here for just a few weeks and we've eaten here 3 times already! The half spring BBQ chicken is to die for and the sweet potato fries are crispy and sweet. As a self-proclaimed Diet Coke addict, I am also a huge fan of the FREE Diet Coke refills - oh thank God!\n\nWe haven't had anything that hasn't been good and we look forward to returning here again and again.\n\nA few tips:\n- Try the plain cheesecake first - you won't be disappointed.\n- Go during lunch or breakfast - there are great specials!", "author": "Kelley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Mmmm....that cheesecake.\n\nThis place is obviously famous for its cheesecake and for good reason. It might not be everyone's favorite, but it's a lot of people's.\n\nThe rest of the food isn't bad either. I've heard people knock it, but as far as diner food goes this is definitely solid. Compared to what's in the area both price and taste wise, I'd say this is a great place to go to. \n\nDefinitely not romantic date spot, but this place gets a solid four stars for the food alone and then a bonus star for that famous cheesecake.", "author": "Whoo W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "Went to Juniors last night and tried the Little Fella cheesecakes (pineapple and blueberry) they were amazing but cost a lot considering it took me 5 bites to finish it. Im a huge cheesecake fan and I think its worth trying at least once. And Yes I will repeat....on payday", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Basically, the food is mediocre and what you see on the menu is what you get. You can not substitute anything or change anything to your liking. The waiter we had seemed like he really didn't want us to be there. Anyone not from Brooklyn and just touring should just go there for their cheesecake but that's about it.", "author": "Marissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "Junior's claims that they have the no.1 cheesecake in New York and is famous for it. I do not have any doubts that they hold the no.1 spot as the Original Cheesecake and the Red Velvet were to die for.\n\nWe visited this place as a friend was meeting up with a family member and we were in the mood for cake. The portioning of the cake was huge, so much so that we shared two slices of cake between four of us and still couldn't finish.\n\nIf you live in the US and aren't able to make it I'd highly recommend using their delivery service as this cake isn't to be missed by anyone.", "author": "Andy M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}