{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-21", "description": "I'm not sure if this is the original Junior's, but if it is they must've stop caring about this one once the other opened. I met up with a coworker for a bite to eat and some work complaints. I had never eaten at Junior's but of course had heard of their cheesecake, but heard their food wasn't that great. Sadly I absolutely agree. Their food is not that good, especially not for the over the top price. I ordered the chicken fingers with honey mustard and a side of fries. The fingers were slightly hard with too much breading and the honey mustard was runny. The fries were good. I understand the concept that when you have one knock out product you tend to care a little less about the other stuff, but when you have an entire restaurant you kind of forfeit that option. I have had their cheesecake prior to this visit and it's okay, but I'm also not a cheesecake fanatic. I had ordered the Strawberry Shortcake at the midtown location and loved it, so I ordered it. This time I got a plate with a tiny slice of shortcake and a tub of whip cream. If I hadn't pushed it off onto another plate, I would've had four bite full of nothing but whip cream. A bit much wouldn't you say? I think I'll be passing on eating here for a while- awhile meaning until I'm forced by visiting friends or family.", "author": "Tonya C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "alright so their tagline is \"Most Fabulous Cheesecake\"...but i would change that to like \"shut-up for the next 2 minutes and let me eat!,\" or \"sweet jesus this is screaming!,\" i think you get the jist of my seriousness on how dayyym tasty this cheesecake is.\n\nso how do i put this... my department just invested in major storage solutions for some academic programs and well the vendor we work with attempted to send us this cake during the holidays.  they didn't realize we were already on vacation and on my return i came back to this box on my chair.\n\nit said Junior's on it and i immediately jumped out of my pants, grabbed some scissors and opened what i always heard was amazing, but never tasted for myself.  to my surprise i had a blue and green colored cheesecake and i swiftly grabbed the phone, dialed the vendor and said what the hell!  what kinda message you trying to send buddy?!  \n\nfast-forward to today.  iam in a state of zen-bliss from having just one piece of Junior's and i feel my political capital with all my collegues have increased 10-fold by my generousity in sharing that fattening, 3 lb., sugar-packed, food of the gods.", "author": "omar b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-21", "description": "As much as i love their cheesecake, I would avoid their flagship location. I was here only once , maybe it was bad timing, bad night, oh well it was a split second decision.\n              around 11.30 in the night, i decided to take the MRS. for a date-date. we hop into my pocket rocket and head out. I could literally taste the cheesecake on my drive there. we get there , find parking after a bit of trouble and the rest is history.\n\nexcerpts of my email i shot to the owners on feb 11th\n\nTO DATE I HAVE GOTTEN NO RESPONSE.\n\n\nGood Day Sir,\n                    Hopefully the owner is reading this. I am one of your faithful cheesecake fan. Even before I moved to NYC, I was made familiar to your cheesecake by my wife while we were in VA. I am writing you this letter so that you can be made aware of some things i have noticed while visiting your historic site for the 1st time last night. On many previous occasions, I have had you world famous cheesecake only in you 2 city locations. Last night i had the urge around 11 pm , we hopped in the car and headed over to your site. We found parking with ease, and entered your restaurant. I was like WOW, like a kid going to toys r us in the city for the 1st time. After that everything went downhill.........My views are of an avid foodie with a touch of a business man.\n                    The counter on the right sells pies.I was very intrigued by the heart shape pies. I asked the host behind the counter about them and the prices\nME: hey, how you doin ,  what is on top of that heart shape pie and how much is it?\nhost: berries . 44.95 ( i could be off with the prices)\nM: how much for the plain heart shape?\nH: after given me a decent stare of 5 seconds , he said 39.95\n I was like ok , maybe this kid with his cap goin in another direction is having a bad night. I looked around and saw the section across where they had individual slices. We headed over there.\nM: hi, can i have 2 of these( pointing at the 2 plain slices)\nDifferent host, man in his late 40s , lookin hispanic. : pulls the 2 slices out.\nin the meantime , my wife had a change of heart, and wanted the carrot cheesecake\nM: sorry sir, can i change one to the carrot.\nH: ( visually upset/ mumbling goes to take out the strawberry on)\nM: no sir the carrot one\nH: i heard ya..\nwe pay , did not realize that there were no benches around to enjoy so we seated ourselves at the cheesecake bar. I realized it was not the right thing to do, but i told my wife wi ll leave a couple dollars tip. We also talked to each other about the 2 gentleman i had interacted with so far, and she said \" welcome to brooklyn\" I was like no, some thing ain't right. Sitting at that bar , I noticed a lot of things about your restaurant. The guy behind the bar name tag st. patrick  seemed like he was forcefully there, he never approached us/ never said a word. Infact all he did was stare at us in intervals at least 10 times. This man looked very sad \u0026 unhappy. In fact everybody looked the same, I was like whoa, even the folks at ihop are happier  and have a smile on their face, even though it was like midnight, it was still within your operating hours. None of your staff looked happy, I kept looking at the host who was seating people down. He never greeted any folks in, whenever people would walk up there to be seated, instead of greeting or having a smile, all he said were how many?\nIn the 15 minutes we were there, 4-5 employees clocked out, and wished goodnight to st. patrick, and he looked at his hand watch every time they passed by.\nMost of your staff at the time looked indian/guyanese. kinda odd, it is ok i guess. what irked me was whenever they talked among themselves it was in their native language, which is rude cause a lot of ppl could hear them talk.\nAs usual we could not finish our slices, I left NO tip, cause i was let down. I asked for a card from the guy sellin accesories behind me, the manager on duty was mr. Rama or maybe it was mr.Mohammed /mr. Ivan Forest.I would highly recommend you into looking into your service , send a mystery shopper and judge your servie or best yet diguise yourself and experience your service. It was BAD, the worst i have seen, and no, people in brooklyn are not like that. I have had the oppurtunity  to enjoy other place in brooklyn, and people are friendly.\n\n-- \nkaran singh\n p.s. your menu shows the plain slice to be 4.95 / carrot to be 5.75. i was charged 5.50/6.25 respectively.\n\nI will continue to eat your cheesecake, but doubt will ever go to your location again \n\n end of email\n\n2 stars only for the cheesecake, which would be 5 stars by itself", "author": "k s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "Last week in NYC and I haven't had my first NYC cheesecake yet.  So we decided to to walk to Junior's.  Best strawberry cheesecake ever!  I also wanted a piece of red velvet cake cheesecake but resisted the temptation.  That small cheesecake never stood a chance once we got home.", "author": "Sam N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-03", "description": "At the beginning of a meal your waiter brings you pickles and beets and coleslaw -- all of which are decent (and free!) -- and as I've come to find out, this is the best part of the meal... Leaving BAM, never knowing where to go, and suffering from extreme coldly weather (and/or heavy rain) as well as extreme hunger, I've found myself jumping into this place twice as an impulse before jumping on the subway back home (into Manhattan)... The turkey/beef tongue sandwich was disgusting (both were dry and bland), and the corned beef and chopped liver sandwich was absolutely terrible -- the \"chopped liver\" was pretty much just ground up hardboiled eggs mixed with salt and brown gravy (I don't think it actually contained any liver)... Cheesecake was just okay both times -- the top was kind of rubbery, and the bottom is a thin layer of cake instead of crust... Drinks like \"thug passion\" and \"alamaba slammer\" are overpriced and weak... Service is terrible terrible.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "This is pretty damn good cheesecake.  I ordered the Strawberry Shortcake Cheesecake.  It was a layer of actual cake on top of a layer of strawberry cheesecake, which was actually quite good, but the grass is always greener...My friend had the original cheesecake and I could kick my own butt for not ordering that.  She let me have a little taste and it was absolutely amazing.  Seriously, I heard the strains of 'Dream Weaver' wafting on the breeze...fortunately Junior's delivers its cheesecakes all over the country, so as soon as I can justify spending $40 on cheesecake, I'm all over it.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-03", "description": "junior's is that place to go after big gatherings, when brooklyn is central and people want gut-busting food, droves of sweets, and some sweet 50's/60's nuclear family nostalgia.  the savory food here relies heavily on clientele's lasciviousness for dessert, most visibly their cheesecake. like other reviewers, i have had burgers, barbeque, fried chicken, tuna melt. with natural skepticism, a restaurant with that zealous of a menu creates underwhelming meals, even breakfast items like pancakes can be outdone by other less popular diners. service is inconsistent as i have been there over 4 times and each time runs the gamut of being flirted with, ignored, receiving a little passive aggression, and once, a perkiness that was as saccharine as their namesake.  \n\nnow on to dessert, which either is a beacon of light from supernatural sources or lusterless.  when i speak freely, sometimes i speak blasphemy, but for me, my midwestern sensibilities tell me pie is something not to be messed with. here, they are generally overly sweetened and seemingly not spectacular. sure, the cheesecakes are good, but instinct tells me also that some of the bottom crusts should not be cake or moist, should refreshingly counteract in crunch with the creamy rich filling and fruit toppings. yes, they give you a peninsula sized piece for larger price points, but based on imbalanced texture and some cheesecakes being tastier than others, i am not convinced that these are the \"world's most fabulous.\"  like my pie, the term \"fabulous\" is taken quite seriously to an honor code. i feel that word must be savored during the most outlandishly innovative times. in my outnumbered opinion, this cheesecake is not appropriate use of the descriptor. additionally, before you pull out the foodie pitchforks to go out and find me, i told you i speak freely and that you might not like the outcome, didn't i?", "author": "kay b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-04", "description": "Known for their cheesecake, but they have good food otherwise. Its always packed which is a negative as well is the parking, but if you train it over an enjoy the neighborhood you can have a lot of fun.", "author": "Brian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "My father used to bring cheesecake back from here in the '70's since he used to work around the corner.  It's the best damn cheesecake in the world.  Has anyone been here recently?  Is it still the same?", "author": "Mitch A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "I had no idea that Junior's was a full-on restaurant.  The place is HUGE and the waiters are all dressed up in little tuxes and bow-ties.  Very cute.\nThe drinks are good and strong and the lunch was very yummy (I had the mac and cheese and some veggies).\nOf course, I had the original cheesecake which is like many people say, the best in Brooklyln.  \nI'm glad I went because it's an institution...oh...and the drinks are CHEAP!", "author": "C J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-22", "description": "Only come here for cheesecake, I'm telling you! A definite MUST TRY for all you cheesecake lovers out there. I had a chocolate mousse cake and boy was it filling! Decent pricing, amazing food definitely worth checking out. Also had a side dish of mac and cheese, not bad. Service is fast and the waiters are friendly. They took the wrong order for my friend's strawberry cheesecake and gave her short cake instead, but quickly fixed it with no extra charge. Great atmosphere.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "Junior's was the first restaurant I ever went to in NY. My lunch was standard diner fair and was quite good though not deserving of 4 stars. Why 5 stars then? CHEESECAKE!! I think the strawberry cheesecake is the absolute best I ever had, and I have had many. I live in Brooklyn now and any time I go to a dinner party, my friends leave it to me to bring dessert. The texture of the cake is heavenly. Treat yourself and your pals to a large cheesecake. Yes it is pricey but aren't your friends worth it?", "author": "Tom B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "The place looks like a place from yesteryear.  It's typical diner fare with generous portions.  The waiter was courteous and attentive.  I was boring and ordered a burger which was a typical burger.  Nothing exciting but solid.  The cheesecake is one of the best New York Cheesecakes around.  But as I get older I just can't handle heavy cheesecakes.  I guess I'm just a bad New Yorker.  Anyways, if you happen to be in the neighborhood stop by for a slice of cheesecake.", "author": "Kouichi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "Best cheesecake in the world!!!  I will make you walk from Tampa, FL to Brooklyn, NY just so i can have a Juniors cheesecake!!!", "author": "James K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-04", "description": "I've been to Junior's in the past and had such great experiences that I briefly considered a cross-country move to Brooklyn just so I could enjoy it on a regular basis.  But as they say, that was then and this is now.  During my recent Holiday stay in NY we made the detour from Midtown to BK just to get our fix.  Sadly, I came away disappointed.  \n\nI don't know if we did or said something, but we had the distinct feeling that our group was bothersome in some shape or form.  We called ahead to find out if it there would be a wait to accommodate our group of 6 plus baby.  The response was extremely friendly and we were told to come on in.  Our group was meeting up with an old friend so we were all smiles, it couldn't have been our attitude.  Was it our abundance of coats and scarves?  I hope not, it's not like it wasn't winter outside.   Was it the stroller?  Our Stokke isn't an eyesore so it's not like we were being all ghetto or something.    When we arrived we were first brought to such a distant nether region of the restaurant that I truly thought we were initially being led out the backdoor.  It's not like they were super busy because they weren't.  When we innocently asked if we could sit ANYWHERE next to some other patrons our question was met with an audible sigh and sour puss face from our hostess.  All I know is that I never felt truly welcomed and that was a shame.\n\nTo make matters worse the food wasn't all that.  I've had a couple of incredible meals here so I was all geeked up to feast on the hash.  When it was time to order our sour puss waiter took half of our groups order and then began to walk away before we politely reminded him that everyone at our table would be eating.  I'm NEVER rude at restaurants, I don't ever want to feast on a green salt bomb and at this point on I asked everyone at our group to maintain their composure and not say anything until we had our food.  Shortly after ordering Mr. Sourpuss returned to inform us that there was no more hash and if the two people in our party who ordered it still were still going to eat.  What's with that?  Finally, when our meals arrived every dish that should have been served with hash browns had been substituted with French Fries (it was about 11am).  What's really going on?  A simple heads up would have been nice.  I would have ordered lunch if I HAD to have French Fries.\n  \nThe rest of the food itself was fine but at that point it didn't really matter.  I felt like a goof for going out of the way to recapture some faded glory.  When our meals were done we ordered several pieces of cheesecake to enjoy at our friends apartment.  THANK THE HEAVENS that the cheesecakes were the bomb.  Without the cheesecake they'd get nothing more than a half-star from me.  With it they'd only muster 2 stars.\n\nI may not completely boycott Junior's but I doubt I'll make the trek to BK just for them.  If I really got to have it I may has well just order their Cheesecake online.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "This review is based solely on the carrot cake cheesecake that I ate there. I have never had such a delicious cheesecake as this EVER !! The texture is so smooth and creamy its unbeliveable. I can't even eat cheesecake from anywhere else after tasting theirs. So they get 500 stars from me for the cheesecake but the place as a whole I only gave a 4 cuz I don't know what there food taste like. This definitely the place 2 go 4 dessert.", "author": "Tameka X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-10", "description": "I'm sorry but this is not the world's best Cheesecake.  It's not terrible, I mean I will eat it; but it's not the best.  Their moniker as the world famous \"Junior's\" is cute, but idk, I'm not smitten by this place.  And do they actually have a doorman or was that just a random homeless person who so graciously shooed me in?", "author": "Natasha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "Cheesecake is worth traveling across any mountain, river, and ravine to get to this true historic diner.  I've had the egg salad sandwich as well, and that does not live down its reputation.  Seeing those bright neon lights lit up the Brooklyn sky gets me every time.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-20", "description": "Best Cheesecake I've ever had, enuff said.", "author": "John W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "The 5 stars goes to the cheesecake. The apple crisp is insane (by that I mean reaallyyyyyyy goooood)", "author": "Leslie O."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}