{"aggregateRating": {"reviewCount": 1586, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-28", "description": "I've only been here for cake and iced coffee.  The coffee is EXCELLENT!  The cake is mediocre.  I've had the red velvet, german chocolate, carrot cake and chocolate layer and they were DRY.  The cheesecake was good, but I don't get what the hype is about. Didn't try any food yet.. seemed pretty pricey, but from what I could see looked really good.", "author": "Dee .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "Best cheesecake ever. I still dream about it. Don't order anything else, like for example peach cobbler - you will regret missing out on the cheesecake for years afterwards.", "author": "Hans K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "I miss this place.  They have such large portions I've not once had the space to have some of their famous pie.  Avoid going Sunday mornings because it's ridiculously crowded, although the space is quite expansive.  It's a great place to go after a long day at the beach.  I also liked going there after law school class on the other side of Fulton Street Mall.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "cheesecake..cheesecake...cheesecake...Thats all I'm going to say...and yes diddy made those poor fools from making the bank walk all the way from manhattan to bk for this...but u will see why it's everyone FAVE!\nservice is super quick...and during holidays there is always a line to get cheesecake! def a great place to take friends who are visiting NY or bk for the first time!!!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "Best Cheesecake in NYC. I have never had any of the food but if you want great cheesecake, make a stop at Juniors.", "author": "Johnny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-30", "description": "This is a nice, solid, old school place.  I came in for breakfast, so I can't comment on the cheesecake.  Am I still allowed to keep typing?  I mean, cheesecake is what makes this place famous.  Still, the standard breakfast items are good.  Pancakes are thick and fluffy.  Blintzes would have been better if they had not been deep-fried.  I ordered mine with cherries, but got strawberries.  Our server's mind just didn't seem to be on his work.  In fact, we barely saw him and the place was not busy at all.  I really loved the decor at Junior's -- it's kind of a 1950s circus theme.  In other words, it's ugly, but you wouldn't want them to change a thing!", "author": "Raina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-29", "description": "overrated, slow help, foods sucks, and is way OVERPRICED. The cheesecake was good though. Skip the food.", "author": "Jon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "the BEST strawberry cheesecake EVER!!!!! omg! im from cali! and i wish someone from NYC can just send me a whole pie of that for me just because! \n\ndefinitely a worth it to stop by and pick up a slice!\n\nnow i know why diddy told those fools from making the band to walk over there LOL", "author": "Rachele B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-02", "description": "My parents actually started eating here in the mid 70's. They followed the tradition once I was born and I still eat there to this day. I've been there for a quick bite, a good sit down lunch/dinner with friends and family, breakfast at the counter. And a bunch of times to get a cheesecake, strawberry of course. I can sit here and describe the decor, service, food, prices etc... but even if I was the best writer that ever existed... words cannot substitute actually enjoying a meal at this establishment. Go.. GO GO... take the train to DeKalb and its right there.. for you city folk that don't leave Manhattan... take the train DOWNTOWN into BROOKLYN ;-)", "author": "Hector L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "If you want to know what cheesecake is supposed to taste like, go to Juniors. Even if you don't know what the hell cheesecake is supposed to taste like, suddenly you'll find yourself recognizing it, it is called Bliss. It is worth trekking down to Brooklyn to see for yourself what all the fuss is about.", "author": "Maritess Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "excellent food and , most  of all the dessert, the best cheese cake. The staff are courteous, .  I felt bad, my date was too cheap and didn't leave any tip.", "author": "Lorena S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-10", "description": "keep in mind, i've only been here once. Split pee soup was nasty (couldn't finish it). The briskett sandwhich was whatever. The cheesecake was average. I was expecting this amazing work of art cheescake. Are u kidding/ Seriously, people giving this place 5 stars are not taking yelp.com seriously. Latter cost me $19 not including. tip.  Service is excellent. Place was really pretty. Food is average for a diner. Again, this is an evaluation of my one and only experience.", "author": "Thomas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "During my visit to New York, the tour bus guide recommended this place, so my family and I went over here to try the cheesecake. Hands down the best I've tasted. Only got to stay for a few minutes in order to catch the next tour bus going through Brooklyn.", "author": "Loren John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-26", "description": "A glorified diner basically with a plethora of cakes.  This franchise consists of all the Americana hearty dishes and then some.  Big dishes, big portions, big price.  What may throw you off a bit are the immigrant waiters that are taking your orders.  Yes, I said waiterS taking your orders.  They speak english and expel hospitality their own way.  It's neither a good or bad thing, but it's just you should be aware of when going.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "Cakes are awesome!\n\nI love their carrot cheesecakes and their applecrumb cheesecake.\n\nMe and my friend brought a entire applecrumb cheesecake once and split it 50/50 (Juniors waiter actually cut it up for us which was great). \n\nTheir food is also pretty good. I love their meatloaf, their steaks and their burgers.\n\nThese days, I usually get their sugar-free cheesecake (it the only juniors out of the 3 in NYC that has it).", "author": "Fabian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-14", "description": "my first exposure to junior's was not long after i'd moved to NYC and was at a party at a friend's house in brooklyn.  it was around 1am or so, and we were sharing a car service back to manhattan with two other people we didn't really know who insisted on having the car stop at junior's before we went back over the bridge.  at the time, after a few (ha) drinks, i was like, you've got to be kidding me.\n\nanyway, we were like, what the hell, we're here, why not.  and the rest, as they say, is history.  the short answer is that it's easily the best cheesecake, ever.\n\ni personally probably wouldn't go eat dinner in the restaurant, but would i go to brooklyn to buy it?  do i send it to people for gifts?  do i order it online for myself now that i'm back on the west coast?  yes, yes, and oh, hell yes.\n\noh, and on the ordering, it's a total cinch.  i felt a little weird at first about UPSing a cheesecake, but it's space-age packed with dry ice in styrofoam.  maybe bad for the enviro, but so long as my aunts and uncles in florida insist on driving their yukons, i'll be endorsing the junior's uber-packaging.  so even if you're not waiting by the door, fork in hand (and really, who could blame you if you were), you've got nothing to worry about.\n\nps - i always go for the plain.  you can call me boring; i'll call myself a purist.", "author": "brian g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Gosh it has been several years since I came here, but I think about it all the time.  I love going to Juniors for a yummy breakfast and topping it off with one of their classic cheesecakes.    If you are ever in New York, make sure you cross the Brooklyn Bridge and grab a bite at Juniors.  it is well worth it!", "author": "Mike L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "I give the cheesecake a yummy 5 stars. However, the food is nothing to brag about. I think you might have a better time going to burger king!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-15", "description": "Let's quit playing here. This is the best place on Earth for cheesecake. It's typical NY where you feel rushed in and out, (but that's coming from a Texan) however, I'd go back at the drop of a hat. I ordered applie pie cheesecake and I've been dreaming of it ever since. I was taken as a treat while visiting my husband's family in BK.  I tell ya what, I can't wait to go back. They have a delicious red velvet cake, too.  I wanted to cry tears of joy when i ate here.", "author": "Angelica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-08", "description": "I really never got the hype about Junior's. So many people have raved about it. I went there twice. (I'm all about second chances.) The first time I went, I wasn't too impressed, but I was thinking maybe it just wasn'ta good day for the restaurant. But the second time I went, confirmed why I won't ever be coming back. The place is crappy, the cheesecake (and food) is nasty, and the service isn't the best. I mean, you would think they would at least update the place. But no, it's still crappy looking Junior's. I;ve have better food, including cheesecake, in other places.Save your time and money by passing Junior's. It's a landmark by name only, because the food just isn't that great!", "author": "N H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Junior’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "386 Flatbush Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/51GkmfCs08QabOoqYMegYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188525257"}