{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-06", "description": "We put up with Happy Days because it is pretty much the only 24 hour diner around. That being said, it is pretty pathetic. The service is awful - even for a diner! You specify what you want, they repeat it to you as \"sure, no problem!\" then it comes the opposite of what you expected. Also, when you pay with credit card, they ask you how much tip to put on the card before they ring it up -- because they are too lazy to run it thru a second time. And, if by some chance they dont ask you how much you want to put on your card, the stand over you while you sign it.\n\nWhat is worse, the food is mediocre. The fries are soggy. The burgers are too greasy. \n\nThe only thing that Happy Days is good for is a late-night, drunken pig out session.", "author": "Rrose S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-15", "description": "I have been into Happy Days a few times as it is 24/7 and I used to be an insomniac who lived in the neighborhood. I never failed to regret that decision. Cold, greasy, and gross. Yuch. If only i could remember at 3 am that I hate it, and I would be better off going down to peas and pickles and picking up something frozen.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "I sit.  The coffee comes.  The host says, \"talk to me.\"  'Nuff said.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-21", "description": "Excellent service by friendly mexicans. It's always nice to get served by people who treat you nicely and with a nice smile.\nThe food is pretty decent and the prices are reasonable.\nGood service and cheap, decent food definitely makes it a top choice for diners in the neighborhood.  \nIt's 24 hours and that helps.", "author": "Suman D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-07", "description": "So, I made the unfortunate decision to drop into HAPPY DAYS DINER with my visiting parents.  We thought, oh, cute diner...a classic \"greasy spoon.\"  What an understatement!  I have no idea how this establishment survives in Brooklyn Heights.  Terrible service (+rude) AND more importantly, overpriced, bland and inadequate food!  Never have I had such a disgusting omelette.  I got the \"spanish omelette\"...it was cold with no cheese, no taste, and topped off with what seemed like a can of beef stew.  YUCKKKK.  oh and a side of cold, undercooked hash browns.  Avoid this place - you will leave UNHAPPY.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-17", "description": "Whenever I'm craving a burger at 1 am I go to this place.  The owner (I think he's the owner) is really nice and always recognizes me.  The burgers are delicious, which is the most important part.", "author": "Paula M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-17", "description": "The only time you should be going to this restaurant is if you are hungry at 2AM and Montague Bagels isn't going to satisfy you. Literally the only reason this place must stay open is the 24/7 operation as the food is awful. The service isn't much better and the new TV doesn't really add much to the place.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-12", "description": "Food-wise, Happy Days ranks just below the selection of garbage cans in Brooklyn Heights. But when you are working for a 9am deadline and at 3am you realize \"Oops, I forgot to eat dinner,\" that grey-brown wafer of \"beef\" on a seasame squish bun is your only friend. Just make sure you have some pickles on hand, because they sure as hell don't give any . . .  [see also: Food only edible when so drunk that you can't remember where you live]", "author": "brian a."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-06", "description": "The only reason I'm giving it 2 stars is because of the waiter. I ordered a grilled cheese with tomatoes sandwich with a side of onion rings. The onion rings took a while to come but I didn't mind especially when I noticed that the fry cook was a senior citizen and he was working alone. I was with friends so I did not mind waiting. I did ask the waiter if he put in my order but that was only because I thought he forgot. The next thing I know he is yelling at the old man telling him to hurry up that people were waiting. At first I thought he was playing around but then the waiter comes up to my table and apologizes and tells me, \"the old man shouldn't be working here anymore, they need to hire someone younger but he doesn't want to leave, I always have to yell at him to hurry up.\" I found that appalling, as a customer I did not need to know the problems he has with the fry cook. I told him that he is old and he is working alone. He then tells me that he doesn't need the money because he has money saved up. My friend asked him if he was the owner and he replied no, so my friend said that if he works is his business and besides he probably needs the money. I like this diner but this waiter really turned me off. The food was good so the fry cook is not the problem. As a waiter he does not need to tell me his problems with his co-workers. Especially when it's a hardworking man trying to make a living.", "author": "Claudia C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}