{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-24", "description": "The only way I can account for this place still being in business is the fact that it's 24 hrs. Otherwise, I have no idea why anyone would go here. For a diner in the area, Clark's restaurant is a much better choice.\n\nI've been here twice, both times in the wee hours of the morning. The first time I vowed never to go back, but a few weeks later I made a poor, drunken decision and ended up going back (\"oh it couldn't have been thaaat bad\"). A drunken memory is a faint memory. Yes, it most certainly WAS that bad. We practically had to get on our hands and knees and beg for service. Even though we were the only people there, it took eons for our food to come out (greasy, but not in a satisfying way), and even longer to get the check.\n\nWith Montague St. Bagels (also 24 hrs) seconds away, there's absolutely no excuse for coming here.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-04", "description": "Look, the rep is bad. Because of the reviews I felt compelled to check the food for signs of cleanliness. That being said, it passed the eye ball test, and while the food was a little over done- I took that as at least it isnt raw. The food is much better now than it was in 2009, but it still comes off cheap. There are superior diners in the area, specifically New Apollo, but Happy Days isnt quite as bad as it rep suggests.", "author": "Max F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-18", "description": "I've only been to Happy Days once.  But that single experience was enough.  Rather than write a formal review, I feel I must regale you with my harrowing tale.\n\nMy friend and I went to grab dinner there, assuming it had credibility from simply being a Brooklyn diner.  (We don't mess around in our fair borough.)  I ordered some fries and she ordered a burger.\n\nThe food came.  I delved into my big plate of fries with gusto.  My friend ketchupped her burger.  But when she flipped it over to chow down, she found that the bottom half of the bun was (brace yourselves) moldy.  Yes, green and moldy.  And not in a cute way.\n\nWhat's worse is that when she informed the waiter, he didn't seem at all fazed.  Which led us both to believe that a Happy Days patron discovering a moldy hamburger bun is just another day at work.\n\nThe story speaks for itself.", "author": "Caitlin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-09", "description": "One word -- GREASE\n\nSeriously folks, if you wanna grab some greasy grub I would say go for it here. Went out to lunch with a co-worker and was in the mood for a ham and cheese melt with fries. She got grilled cheese with onion rings.\n\nWould have been perfect if we were drunk, but everything was soggy and bland and I was disappointed.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-25", "description": "The place looks inviting, and you hope for a cheerful family type atmosphere with homemade food when you walk in.  What you end up getting is a rude guy with a non-descript accent and bland greasy food.  Is that just NY charm?  \n\nI ordered the bleu cheeseburger expecting crumbled bleu cheese and fries.  What I got was bleu cheese dressing on a burger and deep fried fries straight from the freezer.  Eek!\n\nI wasn't grossed out beyond all belief, but I don't think I'll be going back.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "A lot of bad reviews to my surprise. I've been here twice when I return home and go to Brooklyn to meet a friend for lunch. Both times I've had good food and good service. The same guy served us both times, an older white haired man who seems nice to me. He's not fawning over you nice, but it's Brooklyn and it's a diner not a 5-star restaurant, so what do you want? But he is polite and seems nice and friendly to me. The food is good diner food, I've had the turkey burger and chicken fingers with fries and all were good. Simple and good diner food. Both times I went (on weekend afternoons) it was quiet inside, fast service, and a clean bathroom. We're all different, but I like it and next time I'm in Brooklyn I'll return for more.", "author": "Travis R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-09", "description": "Don't go here UNLESS:\nIt is 3am\nYou're wasted\nYou're starving\n\nI went there twice in 24 hours before...accidently. Had dinner with was disgusting, the onion ring i had was like leather, I actually spit it out. So you're probably wondering why I gave it even one star...well I went back later that night, like 2am, after being caught in a thunder storm. I got chicken fingers this time and they were amazing! They were hot and tasty and came out fast. I was in love.\nHow on earth is it that they have better food at 2-3am than during the day?", "author": "Darren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Open really late in a neighborhood where everything closes early. Good burgers", "author": "GUY W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "I order from this place pretty often,  and almost always have been satisfied. But this time the food delivery guy was extremely rude. my phone was put on silence by mistake and it literally took me 3 minutes to realize that he had called, when I called him back he was yelling about me taking so long. I rushed downstairs and got my food, turns out he continued complaining in a very rude manner to my face. If i order from this place again and they send the same guy, I will never order from here again.", "author": "Matias I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "Whenever in doubt go to happy days. Its in the neighborhood and price are damn good especially around here. Breakfast is my favorite. Portion size will leave you hurting. There food to me is very simple but delicious. Order anything the way you like it. Place is always packed especially weekend breakfast. This is the kind of place to take I friend who you really enjoy talking to. The place is cozy. Like the throw back decor.", "author": "Krystal F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-25", "description": "Had a nice brunch here on a saturday morning after checking out the farmer's market and strolling Montague Street. The challah bread french toast was rich and buttery and the Greek omelet was awesome! \n\nNothing special or fancy about this place, just a good, relaxing diner to have a hearty breakfast in.", "author": "Lucas K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-03", "description": "I wanted to love Happy Days the diner the way I used to love Happy Days the show.  But wish I'd read Yelp before arbitrarily ordering lunch here.\n\nI was in kind of a funk when I wandered down Montague, so maybe the word \"Happy\" subconsciously drew me in.  Unfortunately, my food did NOT make me happy.  For $9.25 my burger was super dry, bland, and overcooked.  The fries were ok, but the coleslaw was nearly tasteless and never in my life have I tasted a less pickled pickle (not kidding).  At Five Guys I could've gotten a better burger for less.\n\nTo add insult to injury, I was in such a funked mood that it wasn't until I got back to the office -- and I realized I'd actually brought lunch that day and forgot.  UGH.  :(", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Roughly standard diner fare.  Walked past it and it looked good from the outside.  The waiters were friendly and the food was average.  Nothing to write home about.  The food came out ridiculously fast.  So overall it was nothing more and nothing less than I expected from a diner.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-06", "description": "the number of options for late night restaurants are very limited in the area.  The  night manager? is consistently friendly.  It is everything to be expected from a diner experience.   The food is always what's anticipated, don't set the expectations too high.  When you're hungry at 12am, it'll do.", "author": "Arthur S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-25", "description": "Probably the worst cheeseburger I ever had.. Shouldn't even call it a cheeseburger, it's more like a frozen elementary school cafeteria beef patty..except those are better. I should've got the hint when they didnt even ask how i wanted it cooked...Horrible.", "author": "George D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-04", "description": "Really, really bad.  The only reason why I'm giving them two stars instead of one is because they're open 24 hours.  That's really the only thing they have going for them.  Their food is terrible.  They even managed to screw up an ice cream soda...I don't understand why that's so hard.  It's literally a glass of soda. . .with a scoop of ice cream on top.  They don't even have to do anything, yet they still fucked it up.  The only reason why I would ever go here again is if no other places are open and I'm starving half to death.", "author": "Yuri H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-20", "description": "last night, after our first big snow storm of '09, also after walking across the brooklyn bridge, i stopped in bc i was starving and it was midnight.\n\nalthough i got a bite of eggshells in my omlette (which put a stop on eating the rest), and the side of onion rings came out after we finished our meal, the folks there were super easy going (did i really just use those words to describe east coasters? really!??) about all the snow we dragged in and proceeded to stomp/shake/flick off us, and they were super friendly.\n\nhonestly, i don't want it to be that good, because then i would want to go back when i wasn't starving or it wasn't post-midnight...", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-18", "description": "Ugh.  Don't go here unless it's 3am.  And you're starving.  As in starving or you'll die.  Otherwise the food alone may kill you.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "Best place, not because the food is excellent, but because it's open 24 hours and they are quick! I think it's cute that they renovated, but it definitely gave them a \"lift\". Want pancakes at 2am? Go here.", "author": "Steffany E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "High-class, white tablecloth dining, it's not, but if you're looking for decently-priced, 24-hour diner food in Brooklyn Heights, Happy Days is where it's at! \n\nI'm a little disappointed at some of the reviews here. Obviously, if you come here expecting gourmet food, you're going to be disappointed. But Happy Days gets props in my book for its fast, friendly service and cleanliness.  I almost always order the same thing - eggs, sausage, homefries, toast and coffee -- but their soup (homemade) and rice dishes are good too.", "author": "Caylin C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}