{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "I would give this place 2.5 stars but the 24 aspect definitely gives them a bit of a bump. while I think of it to be overpriced, it does fit the price for the location, Brooklyn heights. Delivery is always fast but sometimes quality takes a bit of a drop for deliveries. staff is always very nice and the place is clean. but it's definitely a spot to go to after a late night on the promenade but don't go out of your way for it...", "author": "Cherry C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "It's open late, so it gets 2 stars. But receiving an already-opened, already-used jelly packet with your toast is just disgusting.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "I went for breakfast- its  24 hours which is convenient for all hours. I had the Belgian waffle with home fries. The Belgian  Waffle was very good. Its light and fluffy. I recommend this place for a quick breakfast. The servers were slow. Decent though.", "author": "Fabolous D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "3 friends and I came by after a club night for some breakfast. Although the food was pretty good( I had the French toast eggs and sausage) we did not have a good experience in this diner. Here's why:\n\nUpon entering the diner, there were about 3 or 4 groups of people already sitting down with one of the groups having a loud drunken conversation amongst themselves about foolishness. My friends and I paid them no mind... Here's where it got crazy... The drunk guy who was getting very loud walked out of the diner and upon returning tried to target my group as if we were looking at him funny. Words were exchanged and he threatened to do this and that to us but we ignored him and did not allow the situation to escalate. His friends calmed him down and he left. \n\nBottom line is. The food here is good and it comes out quickly. It serves it's purpose as a diner and I can appreciate that. However, it appears that this diner attracts thugs and criminals and Id rather not share my eating space with that type of crowd. I will not be returning.", "author": "Kristian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Happy Days Diner is just that. A diner. It serves a variety of food with reasonable prices. I was there last night with a large group. For a diner, the food is excellent. The service is fast. Not bad for an area that is becoming more che che by the day.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "This place gets a bad rap from some but I gotta say it's treated me well.  I've eaten there and ordered in a number of times and things are always solid (this is diner food, folks).  They're corned beef hash is top notch, as are their sundaes, if you're in the mood.  Also one of very few 24 hour joints in Brooklyn Heights.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "Food was fine (omelette). Service left a lot to be desired. Particularly that I specified something particular when I ordered, then heard the girl not specify it when she told the kitchen, and then when I asked her about it when the food arrived, she lied to me. \n\nAlso didn't find it terribly inexpensive as many people stated (perhaps their prices have changed?). $10.95 for a very basic omelette and $3 for juice. \n\nStick with Clarks up the street!", "author": "Jay L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-31", "description": "Coming here late night begrudgingly for the past 4 years now, I think it's about time I write a review for \"Happy\" Days Diner.  The service is effecient and the food is always passable for 4am meal, but I just find the service to be mostly rude and uncaring.  It's like they're doing you a favor serving you.  I could just walk a couple extra blocks to Park Plaza Diner on Cadman Plaza West, but Happy Days is literally one block away from my apartment and who wants to be farther than necessary from home late night?  8 out of 10 times I eat here, I ask myself why I didn't just walk the extra 4 blocks.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "Living near Montague you can find great Indian, Italian, Asian, and even Vegetarian food, so how do you ever justifying dipping into Happy Days for a meal? \n\nGetting off the subway, my roomie really wanted a grilled cheese. Wanting to cheer her up I felt obligated to join her in the hunt. Enter justification!\n\nGrilled cheese, mozzarella sticks, and fries were served up quickly by our perky waiter. The glittery blue patent seats squeaked beneath us and we bounced around just taking in the atmosphere of the place.\n\nWe left unnecessarily full but happy. Would I be back here again? Maybe if I ever got the urge for a late night snack but, as I said before, the culinary adventures that hide in the surrounding area surpass any need for a chili cheese dog that might lead me here for a normal meal.", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-12", "description": "** I would like to preface this review by noting that I am from New Jersey, where diners are SERIOUS business**\n\nThe thing about diners is that if you are the ONLY diner open late at night in an area where people love to stay out late and drink on weekends, after which they want food, you get away with a lot of crappiness. \n\nHappy Days Diner smells bad, is not air conditioned, and the food kind of blows. BUT it's one of the only places on Atlantic Ave you can go late at night for food, and the foreign older man who waits tables on Friday nights is adorable and very friendly; he earnestly wants you to enjoy your meal and get your food as quickly as possible. He also came in 26th place in a marathon consisting of about 700 people 20 years ago, which doesn't improve your meal at all, but at least you get an adorable little old man factoid with your meal.", "author": "Julia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "A\nDiner\nWith diner\nFood that's open\n24 hours a day for late bites.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "Most people may think of Happy days as a low budget diner, but me and my husband loves this place! we like the staff especially mario! The food is great and never had an issue with the food. This perfect for a date, or just having time out with family and friends for a quick bite. Cost friendly and 24 hours!", "author": "Lola L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "One of my good friends lives on Montague Terrace and it was just after an awesome party that he threw. Of course after raging all night we needed some type of substantial sustenance. My friend suggested we hit up Happy Days Diner.\n\nHonestly i don't have a bad word to say about the food, the Cheeseburger and Cheese Fries i got were perfectly melted and the Pancakes my friend got but fell asleep tasted good (as you can tell i finished them off, you snooze ya lose) Also major props for the staff getting out our food so quickly especially since it was a late shift and they actually were pretty funny cracking up at a few of our jokes and interacting with us. But then again the diner crowd is known to amuse every one especially after being all Ciroc'd up #WINNING", "author": "Ali K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-15", "description": "Went here with a couple of friends. Server rushed us out even when we weren't even done eating (it wasn't packed). He got our orders wrong as well. Never going back here again. The food was ok. Nothing special.", "author": "Kurt D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "it's a typical diner located in the ground level of a brownstone (i don't think it's the basement as we just had to go down a few steps of cemented stairs to get inside) where I'm sure I'll back again whenever I'm in the neighborhood especially during very late hours. I've seen similar looking places anywhere in NYC, where most workers are hispanics especially at such ungodly hours. my friend \u0026 I sat at the counter area, and I saw a few other customers who were there that night. I had a club sandwich, half of which I decided to bring home and have for lunch the next day. I also had many cups of coffee refills during that midnight time that I was there, which to me was normal. my friend's a regular in the place and probably has been going there for decades. what I'm saying is that if you're not looking for something outrageously fancy, reasonably priced, familiar, \u0026 edible to have at strange hours when most people are in their houses already resting to prepare for work the next day, i'd say you can come here.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "Very convenient to have something 24hrs open in this area but was definitely disappointed. How can you go wrong with hot wings?! That was my safe food. Nothing is safe anymore. My wings were not edible. The wings were oily and l couldn't see any chicken...just fat...could not finish one. I ate my fries bc I was starved n thought the whole time I could've made these fries at home...That's whatever...but what irks me is for service to then come and take my plate, clearly seeing allll these wings there and not saying anything about it. I don't even know what customer service is these days...I was not happy @ Happy Days", "author": "Shyne F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Excellent restaurant anytime of the day or night.  A friend and I went in at 3 A.M one morning and the service was still excellent.  The sever was really nice and the food came out within minutes.  The bacon was a little on the burn side, but overall an excellent meal!", "author": "Ajay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "When ever I'm in the mood for a good omelet and home fries, this is the first place i go. family run, good service, and pleasant experience.", "author": "Christine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "I love that this place is so mom and pop. Dont get me wrong, they get bus loads of customers on the weekend. This place is 24 hours and is a beautiful neighborhood. The staff is very nice and personable. Its a great place to go with anyone, especially with your best friend (the one tohat would share a sundae with you). Give this place a try if you are in brooklyn", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "I don't know why there's so many bad reviews here... but I do like Happy Days. I come here once in a while in the morning to get some breakfast, the usual. Nothing is great, but nothing is horrible. So, I think this place deserves a 3 star. They open 24/7 and the owner is nice.", "author": "Kate L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}