{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Happy Days might be my new favorite diner in Brooklyn. When you first walk in, the smell of fresh brewing coffee lets you know this Happy Days takes its role as diner seriously. Then, huge portions of food served quickly fill you up and send you right into food coma status. The best part has to be Maria the sweetest waitress I've ever met. She checks on you every thirty seconds, and has a slightly booming voice, but it's all with love and man does she care. I drank three cups of coffee in part because I felt like I was letting Maria down if I didn't say yes every time she asked, \"More coffee sweetie?\" Yes, Marie. More coffee please. More Happy Days. More diner loving. I may never leave.", "author": "Kristen M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "I ate here once around 4 AM after a long, long night when it was the only thing open. And I gotta tell you, considering that it wasn't \"cheap\" by any means, I would go out on a limb to say that there MUST be a better option than this. I can't hate on it too much because all I had were fries and a shake, but the fries were too chunky and soggy to be satisfying and the shake was pretty watery and tasteless. So yeah, definitely a place to avoid unless you have to, although I'm sure its shittiness is part of the charm.", "author": "Max T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "We tried Happy Days Diner while staying in Brooklyn Heights for a week and were pleased with their enormous menu - no matter what you're in the mood for, they probably offer it.  Our dinner was enjoyed via delivery - not in-dining.  Service was super fast and food was good, order accurate, and prices were very reasonable. \n\nWhile out for a stroll we passed by Happy Days Diner and found it located in a nice shopping area, looked like hustling little restaurant inside.  Our hotel recommended them for great delivery and they were right.  We'll be staying in Brooklyn Heights a few times a year and will be sure to dine with them again, this next time in-restaurant.", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-08", "description": "Horrible customer service this morning! I usually order from this diner all the time, but for some reason today they were super late with my order and then when I tried to find out what the issue was the person I spoke to was very nasty and hung up on me, without finding out any more information about my order. Eventually, I did receive my order and hour and a half later than what was to be expected, and the portion size of the food leads me to believe that they probably forgot about my order and didn't realize it until I had call, and quickly threw something together because I order the same thing every time from them and the portion size has been stellar. Sadly, I will not be ordering from this diner again despite their food being somewhat decent. Treat your regular customers better or customers in general better!", "author": "Shaina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "I think this is the worst food I ever had. Shame on me for thinking the breakfast would be good. I ordered the French toast deluxe with eggs. The eggs were watery despite me asking for it to be scrambled with cheese (they didn't even put the cheese in). How do you make scrambled eggs watery...? The french toast was dry...and tasteless. The ham was definitely store bought. You know the thin slices in the packets. Those. If I wanted that I would go home and make breakfast myself. I asked for no sausages, so I have no idea how it was. Probably awful like the rest of the food. Don't come here. My bank account cries because I wasted money on this piece of shit diner.", "author": "Chioma A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-14", "description": "I gave this place a second chance ... and it was worse than the first time. My egg cream was thick and sickening to drink. I walked out without drinking more than a couple of sips. My husband ordered a burger ... and wasn't given any condiments to eat his fries with. The waiter kept disappearing for lengths of time, and never checked in on us. And we were eating there at MIDNIGHT. The place was practically empty! The waiter also had a difficult time understanding that I wanted an open-faced sandwich. He kept trying to get me to order it as a full sandwich because \"it cost the same\". If I was worried about cost I would have ordered a cheaper item, not ask for less bread.\n\nAnd to top it all, the waiter made a mistake in adding up our bill, and then was hassling me as I was trying to double check his math to make sure everything was in order.\n\nI AM NEVER GOING HERE AGAIN.\n\nP.S. The only reason why I went to Happy Days is because Custom House across the street stopped serving food that late.", "author": "Sharmeen I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "I would not go here if I had other brunch or American fare options, but it was my only option past midnight. Place isn't bad and the breakfast was decent (a bit more greasy than I would like though). Plenty of breakfast (eggs and omelette selections), but less on healthier options. Paid around $13 including tax and tip for one person.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "So disappointed that they're still there and Grand Canyon is closed. I never had any problems with service or food here but something about it is always uncomfortable and sketchy to me.  We've eaten at various times of the day and night and it's consistent.", "author": "Deb A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Had a good experience eating here, breakfast eggs w/home fries also had turkey cranberry wrap. Food was good quality, service attentive and it is after all a diner. A good one at that with similar pricing to its neighbors.", "author": "Marco L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "lol Okay...so I have to laugh otherwise i'd just continue to be angry. This was my first and i'm pretty sure it'll be my last time ordering from here. I ordered a cheeseburger deluxe and received a hamburger. I called and told them they got my order wrong, and to just charge me for a hamburger instead. The man on the phone told me they would send me another one. When I received it I literally received a bun with melted cheese. -_-  A. BUN. WITH. MELTED. CHEESE! I couldn't believe it. I was angry and laughed at the same time because, who the hell does that? Clearly this place does.", "author": "K D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-04", "description": "Just ordered take out from here, and I'm extremely disappointed. I specifically asked the waiter to please omit the tomatoes that come inside the wrap I ordered, only to find out there's TONS of tomato pieces in my wrap which I had to pick out, and now I'm eating a wrap that's falling apart in my hands. The fries that came with my order are soggy and plain, they taste like those microwaveable fries you buy at your local supermarket. Never ordering from here again.", "author": "Rosa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Affordable with a very nice staff! Food comes fairly quick. Neighborhood is wonderful.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-24", "description": "Sneaking away to a local diner usually does the trick when you're having a heinous day at work.  Diner food has the greasy capacity to cure all of these ills.  This place, though, I'm not so sure about.  \n\nTo start, service can be bizarre - food coming out at weird, uneven times, gruff servers, forgotten orders, etc.  Nothing to write home about in terms of food quality.  I stick to pretty basic stuff, like omelettes and grilled cheese.  Both have surpassed my diner expectations for grease, and underwhelmed with flavor.\n\nMeh.", "author": "Hope M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "LOVED this place. Great breakfast, attentive service, cute little diner. very old school. Huge menu. We sat outside and it was lovely. Highly recommend.", "author": "Paula H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "Really nice servers and chill atmosphere however overpriced for a diner. Also danish had mold in it :/ so freshness and cleanliness is questionable.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "definitely a go to spot if you've been drinking on smith street and you're hungry.  it's not as bad as these people are saying... \nIt's a diner. Nothing special about it, but should you be in a drunken state and require some sustenance, the happy days sign will sine like an oasis beacon in the middle of your vodka tonic desert.\n\nMy needs to be met at 4am:\nI like my omelets done my way.  check\nI like my toast lightly darkened with butter and tad of jelly. check\nI like my water with a straw. check\nI like my waiter to come visit my table a couple of times. check\nI like my company attentive and just as hungry as me. check\nso i guess that means... they're good enough for me!", "author": "Kristal F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-02", "description": "The silver dollars weren't silver dollars. They look like the average size pan cakes. My husband did not like his food at all.  The potatoes were cold and tasteless, the eggs tasteless. It was kind of expensive. No more diners for my husband.", "author": "T D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "i felt personally threatened in this establishment. my pronouns were assumed. besides that, i also met my second wife there which was cool until i found out she'd been fuccing my brother on the low- that being said we also signed our divorce papers here. the coffee was cold and the food was unusually grey toned. my intelligence was challenged here today  they some how managed to mess up a grill cheese. i was scared for my self and my kids that my ex wife debora left me with. we later got chopped cheese's at the local cona stop.", "author": "Nic L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-05", "description": "Okay I did takeout via seamless here and despite the fact that it went smoothly, was ready in time, and they were very friendly at pickup the food was just horrendous. I got a simple blue burger described as a burger with \"blue cheese crumbles\" with fried onions so I'm thinking great yummy love some blue cheese crumbles on my burgers. Nope, what I got was a soggy mess of ODed blue cheese dressing and an overload of thick onions (not what you would normally put on a burger). Basically the burger was unedible. I tried despite the fact that blue cheese dressing is no where near the same as blue cheese crumbles but there was so much dressing that the burger kept slipping completely out of the bun and I had to attempt to eat it WITH A FORK AND KNIFE. After about 3 bites it was just too gross and also wayyyy undercooked and kind of scared me. Moving on to the onion rings...frozen and what tasted like microwaved to be quite honest. Not crispy at all. Soggy and had the consistency of fish sticks or bad fried calamari more than it did onion rings. I was so disappointed in this basic lunch I won't be back there. Grand Canyon farther down on montage is better (although still not great).", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-21", "description": "I am surprised at some of the negative reviews. IMO it's a great diner in a great location. The staff is warm. You can tell the owner puts a lot of pride in his restaurant and makes sure his customers leave satisfied. I've gone here twice for breakfast but  this place is open 24 hours so you can order whatever you want, whenever you want. The portions are pretty decent too.\n\nThere are many great diners in NY and breakfast is big here, but if you're ever in Brooklyn and looking for a nice omelet or a grilled cheese with fries, then head on over to Montague street.", "author": "Jason G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}