{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "This is the worst place to eat from there delivery time sucks and food comes cold will never eat from them again", "author": "Jason P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-10", "description": "Why did I give it one star...\n\nWas it the lack of service in a completely empty restaurant, or was it the trying to overcharge each credit card to make the minimum amount on the card, or was it the lack of food on the plate, all of these could easily be given maybe a two star... \n\nwhat solidified the one star was an hour later I was sick... my friend who went with me text me to let me know she was sick...\n\nin other words.... never again... let's move on shall we...", "author": "Dena A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "Uh, yeah.  I should have known better.  Rather, I should have known better and warned my fiance about what I was dragging him into.\n\nIt was a late night of babysitting and I was STARVING.  When midnight rolled around I was freed, but I was experiencing my worst nightmare: I wanted food.  Greasy food.  I wanted it NOW.  BUT IT'S MIDNIGHT AND WHERE WILL I GET GREASY FOOD AT MIDNIGHT IN THIS NEIGHBORHOOD? (yes, I was quite dramatic at the time).\n\nA quick google for neighborhood 24 hour diners led me to the yelp page.  Multiple reviewers complained of food poisoning.  In my weakened hunger-induced state, I accepted this risk, and had my fiance meet me here.\n\nI ordered a bacon cheeseburger and strawberry milkshake.  After checking the bun for mold, all was clear and I chomped down.  No problems there.\n\nMy fiance, however, ordered cherry pie.  CHERRY PIE.  He commented that it tasted kind of strange, but ate it all.  The next day wasn't pretty for him.  \n\nTo make matters worse, I hadn't warned him about the reviews I read.  I held back, because he was ordering cherry pie, after all.  Who gets food poisoning from cherry pie? I was the one who should have worried.  There are so many ways a bacon cheeseburger can go wrong.  But cherry pie?\n\nI am an awful girlfriend.  But Happy Days Diner is worse.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "These people are terrible. Food was fine but I didn't get my drink and when I called they said they would send it. Three hours later I called again wondering where it was and they said the driver went home. So I asked well then I'm not getting what I paid for? And they said they would send it in the morning. I very much doubt it! The food was fine but the service was terrible! They even gave me attitude when I called the first time, like it was my fault. They are just terrible and I will never use them again! I would not recommend getting food delivered by them ever!", "author": "Stevie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "This is my go to place. Perfect for late night. I usually order a gyro, a stack of waffles for my girlfriend, and a banana split. Open 24 hours and very convenient if your a student at one of the nearby universities.", "author": "David W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-22", "description": "My girlfriend and I were walking up and down Montague, trying to decide on what to eat. We ended up trying Happy Days, figuring that it's \"just a diner\" and couldn't vary too much from any other we'd passed. \n\nOh, how wrong we were. The place is a little bit grim inside, and even though it wasn't all that busy, service wasn't too attentive. After browsing the large menu, we ordered our food. I believe I had a massive omelet, and I'm not 100% sure what my girlfriend ordered, but I do remember the both of us getting sick not too long after. It didn't taste bad when we tried the food, but the frequent bathroom trips that followed the meal were a sure sign that something was up.\n\nMost memorable moment of the meal? A very, very (VERY) large man stomping into the establishment, plopping himself down, and shouting at the top of his lungs \"TWO CHEESEBURGERS! NO FRIES!\" and then breathing heavily while sopping up all his body leakage with a cloth. The waiter then called him gordo under his breath. Food that makes you ill and a patron that makes you sick. Not a good combo. \n\nHonestly, that man, weak juice, and and a need for pepto are all I could remember about this place. With all the places along Montague to choose from,  please spare yourself the trouble and try another option.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-13", "description": "Here's the thing:  I've been in this neighborhood for ten plus years.  I try not to order out, there isn't really that much, but it's two in the morning, you need something to eat, what are you going to do?  The guys are surly, I don't call over there anymore, I order online.  What's worse, and mark this, the last several times I've ordered I've found hairs in my entrée!  There's no way to prove intent but I think it was done deliberately.  I tip about three bucks and there five blocks away, which I think is fair.  If it come to late night and I really need something I go Carrol Gardens Classic Diner.  Yes it's more expensive, but at least I'm not finding P--- hairs in my hashbrowns.  They put the greasy in greasy spoon.", "author": "Flem B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-12", "description": "It was late at night and most restaurants we had passed by were closed. My hunger was beckoning and Oscar the grouch was threatening to come out.\n\nLo and behold, Happy Days! Did I get that warm feeling as I walked into their diner? No. Sad days indeed. Where's Fonzy when you need him to fix things?\n\nAlthough the staff was friendly, the food was quite pitiful. I had a burger and fries that I had to work quite hard at eating (it was that bad). They tasted like they had freezer burn and were just gross. \n\nWithin a few hours, I had a bonus:Montezuma's Revenge!\n\nNeedless to say, after I talked to my sister in law the next morning (after she woke up), she had a similar experience and would have warned me away. Why oh why, Michelle did you have to be asleep?", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "It's the only 24 hour diner in the area. So if you're out late, coming home from a late night looking for a meal, this is pretty much you're only option.  I've been here twice, both at very odd hours and I'm glad they have been open.  But it is just that - a diner.  Nothing fancy, food is not great yet not terrible, wait staff are pretty friendly.  Cleanliness is good.  Take a booth seat!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-29", "description": "It was just ew.  First, the chocolate milk.  Okay.  Chocolate milk has two ingredients, so if a place can't make it, there's a problem.  Happy Days cannot make chocolate milk.  My milk was so warm I had to fish the ice out of my water to get it to a drinkable temperature, and I'm pretty sure the waiter (or whoever made it) used like an entire bottle of chocolate syrup but neglected to mix it up.  The glass looked like a black-and-white cookie lying on its side.\n\nThe rest of the food was okay, but not great and felt kind of greasy and sub-standard (and I lived in Jersey for six years -- I know from diners).  There's no reason to eat here.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "My wife and I were not very familiar with this area, but while exploring, came across this diner. Seemed ok at first. We ordered coffee, an omellet and yogurt/granola. The coffees came, and well, that was it. After about 30 minutes, a table of 6 was seated and served before us. I was very annoyed, because it was just an omelet and yogurt/granola. That was it for us. I found the waiter and he kept saying that its almost done. I said how much for the coffees, we're out of here. I wouldn't go back again.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "This place preserves the diner like aspect of eating in a retro style diner.  The menu is extensive and quite diverse.  The waiters are really friendly \u0026 attentive.  My burger (which was a freshly made patty that was huge) came out with all the fixings and nicely cooked fries.  I definitely want to return for another burger!", "author": "Cortney W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-30", "description": "Disgusting greasy spoon overrun by \"inner-Brooklyn locals\" who invaded the area to watch the latest Tyler Perry film at the Court Street cineplex. \n\nA note on prices: Needing something greasy at  3:00 am after eight hours of drinking, I learned that a Happy Days bacon cheeseburger deluxe to go runs over $14.00!  So be prepared to eat poorly prepared, over-priced diner food surrounded by a very vocal crowd. \n\nWhere do I sign up?", "author": "O U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-31", "description": "Nothing special. Food did not look very appealing. Belgian waffles tasted like frozen ones you put in a toaster.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "Pastrami tasted like my boyfriends asshole after he took as shit. Actually I would prefer the asshole over the pastrami!", "author": "Eva D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "Huge menu, you can definitely find something on there. Great for large groups too. Waiters are average or below average in terms of courtesy. Overall its definitely a spot i'd recommend", "author": "Mr M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-07", "description": "stumbled in by accident on the verge of hunger-induced murderous rage.\nNOT A HAPPY PLACE.\nrather, a RUDE, fucking DISGUSTING place. everyone RUDE. everything DISGUSTING. \n\nfired.", "author": "Lolo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-02", "description": "I should have called my sister.  The boy and I ended up on a romantic walk on the promenade, which he's never been to.  After we left, his stomach spoke.  Big time.  So we had to go for food.  Problem is it was close to midnight, and everything on Montague St was closed.  Except for Happy Days.  I had never been, but this place has been around forever, so it had to be decent, right?\n\nWrong!\n\nAs we sat down, we scanned the yelp reviews on his phone.  Started to get nervous about the food.  His burger came out alright (i.e., no mold or anything gross) but according to him, it was pretty bland and tasteless and disappointing.  I opted for fries with cheese and gravy.  How could something so right go so wrong?  I was hungry and did end up eating it, but damn, I felt so empty on the inside afterwards.  I guess that's how people feel after pity sex.  That's what it would remind me of.\n\nWith so many food choices around, do NOT go there during the day.  And at night, there are other diners open late.  Or opt to go into Manhattan.  Or something.  I seriously don't know how this place has stayed open so long.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "This is my second time ordering from them and both times, it has taken an hour and a half for delivery -- and I live four blocks away. I called to check on it and the guy was extremely rude to me. Food arrived cold and bland. Wouldn't recommend to anyone.", "author": "Marisa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "Happy Days are here again! Cheesy, I know... \n\nThis place is now awesome. If it's not new management, it might as well be. I've had great blt's, great milkshakes, and a bunch of other diner food here (hey, I don't go to diner's to eat healthy, ok?). It's all good. \n\nOne complaint: One unisex bathroom and one MEN'S room?? That's not how it works, guys.", "author": "Haley C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}