{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "Ordered from the diner - an option was provided to substitute fries for a small extra price with my sandwich. Seemed suspect for the price but added fries to my order. When it arrived, no fries, or the original accompaniments. I called and was told that the option was incorrect and they contacted grub hub or whoever to fix the issue. Never offered to take off the additional amount paid for the fries or send extra fries along, as it was not my mistake. I also questioned where the extra accompaniments where and was told we opted not to have them a part of our meal, which we did not.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "I had a fried egg sandwich with bacon, avocado and mayo and a cup of coffee for breakfast.  Everything was great.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "This diner has got to be the sorriest, most pitiful excuse for an eating establishment I have EVER come across. The workers here are THIEVES. \n\nMy friend and I came in to eat at around 1am, we sat in a booth and I got undressed and quickly went to the bathroom. At 1 am the place was pretty dead, only two other couples eating one behind us, one closer to the door. Before washing my hands I placed my phone on the towel dispenser, stupidly I left it there. Sitting down we ordered, the waiter went back to the chefs and I realized my phone wasn't on me. I asked my friend now on his way to the bathroom to kindly grab it as I remember EXACTLY where I placed it last. The phone was gone. The only people surrounding the bathroom were the workers. NO CUSTOMERS WALKED PAST OUR TABLE TO THE BATHROOM. The ONLY culprits are those animals who laughed and shrugged off my first polite requests. The manager had such a lack of concern at his own staff being accused of stealing you could tell they're all into some grime sh*t. He took no time to even ask the back of house about my cell phone, and it got to the point we were so frustrated at the lack of response that we called the police. Nothing was done. \n\nTo top the shitty service and these bozos stealing my phone the food was borderline bland and stale. The french toast was practically thick white bread and the eggs are tasteless. You would think with all the theatrics they provide they could at least serve up a quality meal. Disgrace.\n\nWhichever of you has my phone I hope you choke on your own dry ass food. BUMS.", "author": "Etisyai P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Well, the food was good but the service was extremely disappointing. We came here around midnight for a typical post bar snack, and there was ONE waiter on duty. We asked for separate checks and only got one. It was very slow and we had questions about our bill but because it was so slow we just paid and left. Sad because it was good food.", "author": "Kaitlyn P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "I Use to like coming here for the convenience of it being in a nice area but the more I come here the more I don't want to come back to this place . Upon my arrival I sat in the booth and waited for the waiter approach me or even ask if I wanted anything . I sat there for 5 minutes still waiting to order my food , 3 other people walked in and got seated immediately and received a menu and drinks mean while I didn't receive mine as of yet . I was told do I need a menu and I after I received cold food I mentioned I wanted a drink that he never offered . I then spoke to the manager and told him my food was cold ( even the cheese on my omelette wasn't fully melted ) . I also mentioned how rude the waiter was but all the manager did was order me new bread with no apologies . I still paid even though I didn't feel the to pay for cold food service and rude customer service . I will not recommend , they don't pay any mind to you", "author": "Alainya G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "This place is not good. Just take a seat at the bar and watch how they handle the food. The cook picked up the waffle with his hands and walked across the kitchen to throw it on a plate. A waiter came back from taking an order and picked up a muffin and then scratched his head multiple times and then cut the muffin in half. The guy behind the bar was taking orders, handling money and then picked up bagels. I'm sure there's more. Disgusting.", "author": "Chelsea W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "Waited almost 20 minutes for someone to come to my table to take my order, but no one came. When a group of folks came in and got attended to, that was it for me. A busboy stopped by the table afterwards to ask if needed anything but by then I was over it. I'm sure the food is good and the diner has a good reputation, but today was just one of those days where they messed up.", "author": "Darren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I went here with my sister for her birthday, and the food and environment was excellent!. The food was cooked to perfection and the staff is friendly!! Will always come back here!", "author": "Eva S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This is a five star diner, for sure. The staff is so friendly and service-oriented, and they seem to know all the regulars by name. I love the familiar, at home feeling of the place. The breakfast is solid - really yummy food, large portions, and I really like the sausages they have! Also, the price is right. For $7 I had a feast!", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "HORRIBLE. Never go or order from here. Their food is gross and stale - I doubt it would meet health standards. They can NEVER get an order correct. On top of that, their delivery is non-existent. If you make the mistake of ordering delivery, they will not deliver it AND they will NOT refund your money. Stay away. This place needs to be shut down for bad food, service and business practices. F-", "author": "Thameka T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Happy Days is another throwback to my high school days. Cozy, comfy, really good diner food. Breakfasts are always a hit. Omelets, pancake breakfasts and grits when available are my usual choices. Open 7 days a week, all night long. Friendly staff.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Looking for a late night snack? Then stop by this 24-hour diner. They have a very large menu with affordable meals. I ordered the chicken salad wrap with sweet potato fries, which also came with two onion rings. I don't recommend mixing bot and cold food lol. I loved the booths, very comfortable seating.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "It's an okay spot to grab food really quick after a long night. Not the best diner when it comes to food but the service and location is great. \n\nI've always had the omelette when I visit. It's not the best omelette but it will do the trick. My boyfriend said his omelette was pretty okay.\n\nI like that it's near all the late night festivities and the promenade. Also every time I've visited, I never waited to be seated and my food always came out in less than 15 minutes regardless of how big my part was.", "author": "Shardae W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "This little dinner is hidden between two larger buildings. During my first semester of college I use to walk right pass this place, because I barely noticed it. One day a group of my friends stopped here for a late night snack. The staff was extremely friendly, and our orders were taken immediately. The food was delicious, and the menu ranged from classical breakfasts to fancy pastas. There was also a Belgian waffle on the menu that came topped with ice cream, whipped cream and sprinkles. Everything on the menu is affordable, and can fit a college student's budget. The restaurant is always packed to the rim, but the service is so quick that there's always an empty table awaiting the next customer. I've visited this restaurant on numerous occasions and every meal that I've had has been amazing. I've been a faithful customer for about 3 years, and I'd recommend this place to anyone who is interested in great food for a great price.", "author": "Cherishe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "Totally and utterly disgusting. Turkey burger was the nastiest thing I've ever seen. Texture was worse than dog food. Regular burger was as hard as a hockey puck. Pancakes were not good. Hash browns were OK, but everything seemed dirty and gross down to the coffee, plates, and silverware.  And I haven't even mentioned the sevice yet!  Sat down at 2am and left at 4!  And not because we were enjoying ourselves!! It would take 20 minutes to get coffee and another 20 minutes to get milk!  Diner seekers beware. Just overall terrible and disgusting. Hate to write a review like this, but that place is out of place on that street. Overall teribble. Would give it 0 stars, if possible.  On the plus side, I would give this place 5 out of 5 stars for being disgusting.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "Nasty, disgusting food. Never left a yelp review before, but seriously, go hungry. Not worth it.", "author": "Steph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "It's a nice quiet little spot, the food is filling and cooked with love :). The service was excellent, they checked on us frequently and the food arrived in a decent time. Not to mention the cake is to die for I had a chocolate mousse cake and I couldn't get enough of it it was delicious.", "author": "Brina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-02", "description": "What is it with all the old 24hr spots no longer being open late? This neighborhood has changed, man.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "A good local diner, happy days is open 24/7 which is good to know when most restaurants on Montague Street close surprisingly early. We went in just before the lunch crowd started arriving on a Sunday for a late breakfast. The service was polite and the food arrived lightning fast. My feta and spinach omelette was rather pleasing and the banter between the regulars and the staff was fairly amusing. \n\nI definitely recommend this place for a quick, cheap and cheerful bite to eat. If I could I would give this place 1/2 a star more...", "author": "Michaela E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "The service was good, waiter kept checking in. Food was below average at best. Place is a tad on the dirty side, bathrooms are filthy. I will not return, there are better options.", "author": "Jim M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}