{"aggregateRating": {"reviewCount": 149, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-18", "description": "I really enjoyed here for breakfast when you want to get out of Manhattan. It's your typical old school diner where the portions are big and your coffee is constantly refilled. The omelettes are so good. I had the California omelette because I'm obsessed with avocado. Depending on how much you can eat I'd opt for a side salad instead of home fries because it would have been too much to eat for me personally. But food was great and our waiter was very funny and charming. Typical Brooklyn personality  also the diner chairs are blue and glittery so that's a winner in my eyes", "author": "Hannah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-23", "description": "Disgusting!\nThe bathroom was so f dirty!! And it was the morning!!! Smelling and rest of number 2 here and there!!! (Not into the bowl)\nI had corn beef hash that looked like my cats vomit. I told the guy \"this looks like it came out of a can\" and he proudly say yes, saying that NOBODY makes fresh corn beef any more. He said he didn't even remember when was the last time he saw corn beef hash that was not from a can in a restaurant. \nSeriously? He really believed in that stupid?\nDO NOT GO!", "author": "Masama S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "This diner is awesome! The service is lightning fast, and the waiter was very nice. The bathroom is pretty small, but it's still usable. The pancakes are the most fluffiest pancakes in the world. The cheesecake is great too! The servers were funny and kind like I said before. It felt like the customers were their best interest.", "author": "Keith W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "I never reviewed this diner, even though I've eaten here occasionally in the past mainly for breakfast.\nThe interior is typical as well as the multiple page menu (common at most diners). There is something here for everyone whether sanwiches, soup, salads and breakfast (served all day). Service was also pretty good whenever I dined here.\nI like their omelets and silver dollar pancakes. They also make really good old fashioned egg creams. Prices are kind of steep but that's the trend.\nI'd consider it an old reliable selection for breakfast, sandwiches etc. \nI would say standard grub.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-24", "description": "Customer service is well below par. The waiters are extremely rude. For an after hours diner the wait staff was not prepared for a large crowd. Do yourself a favor and try somewhere else. I wish I did. The food came cold as well.", "author": "Dashana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "Turkey bacon- dry as f\n Salt was added but still dry \nSlow service \nGood atmosphere \nNice bathroom \nGood pancakes and butter and syrup", "author": "Avni V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-22", "description": "Ordered a specialty burger for ~$15. What did I receive. Literally a plain burger on a bun, none of the burger's actual description was delivered. Don't waste your time and money on this place.", "author": "Tareq A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "It's a diner what u expect. Well you do expect what's on the menu I hate substituting my cravings. Otherwise is diner food quantity over quality", "author": "Tram Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "If you order from this place and let them into your apartment building, they will plaster their menu by every tenant of the whole building.", "author": "Anton M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Wow great food ! Great service clean the staff were very attentive I will definitely go back", "author": "Taina N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-16", "description": "Delivery took three hours to come. Fries arrived stale, burger arrived soggy and cold.", "author": "Kent M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-04", "description": "Do not order delivery from these people. Someone sent delivery to my 90 year old, disabled grandmother on Christmas morning. I heard their delivery person bullying her for a tip. She didn't have it. The breakfast was a surprise gift for her. She was home alone, since my grandfather is in the hospital and I wasn't there yet. I was on the phone and getting ready to run downstairs. He kept pressuring her until she found some change\n for him. He was disgusting and bullied her. I'm so angry. How horriffic. And to add insult to injury, the tip was already give.  It's a shame. Their food is great and we've never had a problem dining in or with delivery before. My grandparents really like their food. This place has left a very nasty taste in my mouth.", "author": "Dakeeta G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Absolutely terrible service. Rude and unhelpful. Food didn't match menu even remotely. I was absolutely pissed.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "Fine food, fine service. Has one or two tables outside which we opted for. Was nice to grab a quick breakfast on the sidewalk and people watch.", "author": "J O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "Happy Days diner is what you expect from a 24-hour diner. There's a large menu with all of the diner staples- pancakes, burger, pies, etc., with a fun \"Happy Days\" theme. \n\nFood could use some improvement. I had the chicken strips and French fries. Edible, large portions, but also resembles what would be served at a hospital or school cafeteria. Surprisingly though, the blueberry pie was pretty good with homemade crust. I saw many people order milkshakes which looked good. Perhaps, Happy Days is better at its desserts than its food menu.\n\nIf you're looking for late night food with limited options, Happy Days will satisfy the hunger. If you're looking for quality food, better to search elsewhere.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Came here after being in the area with the family after shopping on Montague St. We wanted a quick bite to eat. We each ordered off the Wednesday lunch specials. Food was excellent, came fast and the portions were a good size too. Came around many times asking if I wanted more coffee. \n\nWasn't too busy and they gave us the big table because we had the stroller with us. Definitely will be making our way to this diner when in the area.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "I can see why the average rating here is 2.5 stars. Came here and it was dead quiet, no other customers in here. The atmosphere was nice and there was even a cute little outdoor eating area right by the entrance. When I got my food THERE WAS A HAIR IN MY PICKLE. The waiter paid barely any attention to us, and we only got one napkin each. When we showed him the hair in the pickle he had the nerve to blame it on me.... Will not be visiting again or recommending", "author": "Kika O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "My son and I had lunch here. He had burger deluxe, I had buffalo burger. Good size burger, properly cooked and ample french fries. We both had chicken rice soup, which was excellent. I forgot to get waitresse's name, but she's Dominican and very friendly and efficient, if this helps to identify her.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Had a fresh fruit salad. Friend had french toast. Unlimited coffee.  I was happy. NOT a lot or people, so that makes it even better!!", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "It was a slow night but, the food was done right except one came out warm and it was a burger.\nThey took back the platter with an apology and delivered a spot on dish.\nService was great especially, since I remembered him from another diner.\nThis place is great for midnight munchies...", "author": "Papilindo C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Happy Days Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/KfeVoaMcfXr6iyJm38vFAA/ls.jpg", "@type": "Restaurant", "telephone": "+17188758361"}