{"aggregateRating": {"reviewCount": 9, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "I'm a Brooklyn native - public schools and neighborhood pizzerias informed my childhood - and perhaps it is this unique upbringing that qualifies me to argue that Bella's Pizzeria has some of the best slice in Brooklyn.  Pizzeria pizza is comfort food - piping hot and oozing with cheese.  We're not talking gourmet, we're talking tastes that will transport you through time and induce revel on your tongue - a $2.50 pilgrimage to the homeland of true Brooklyn.\n\nAuthentic Brooklyn slice consists of a slightly sweet sauce, proper cheese ratio, and a soft crunchy crust.  Check, check, and check.  Thank you Bella.  \n\nI dare say, many of you will not get the appeal (the place is kind of a hole in the wall and scary looking patrons are not uncommon).  But those of you who know how elusive the perfect Brooklyn slice is, rest assure, you can find it here.", "author": "Brandi G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "I know it's just breakfast, but I left dissatisfied; yes its what I ordered, yes it was filling, but somewhere in the process the taste got lost. I know you're saying breakfast is the easiest meal to make, but this sandwich lacked flavor, the bread was lightly toasted, but I'm just not satisfied. The best part of my meal was the Pepsi I had to wash it down with. Maybe lunch is better, but since I'm passing through, I won't find out anytime soon.", "author": "Cheryl W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "Nothing special . The pizza is okay but nothing to remember . They also have burgers fried chicken and Jamaican patties.\nI had a patty and a Snapple . Okay when you are hungry and don't have a lot of money to waste", "author": "Walker A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-11", "description": "If you come in here at lunch, there will be a large crowd of people milling about. There is no discernible line or system, so don't even try and be nice. Just walk to the front and order what you want; if someone's in front of you, they will tell you.\n\nOtherwise, it's a lot like the thousands of other slice joints in the city. In addition to pizza, they do have garlic knots, chicken rolls and the occasional stromboli. Examine what you're ordering though; for doing such brisk business at prime lunchtime, the slices in the display case often look pretty damn old. \n\nFor instance, when that Sicilian pie first came out of the oven, I was trying to decide whether to get a slice or hit up Burger Prince. That buffalo chicken slice is so old the rest of the pie was served at the Last Supper. The next slice off that pepperoni pie is on Moses, because I got his last one.*\n\nBut once in a while you'll luck out and catch a fresh pie, and then it isn't half bad. Regular slices are $2, specialty slices can range up to $3.50 or so. \n\nThere's also a very unused-looking deli counter with crappy deli bagels and a flat-top grill. I've never dared to order a sandwich, but it looks like you could get one if you really wanted to risk it. \n_________\n\n*Remember Snaps? Ah, memories. And yes, I'll be here all week.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "First of all, I would like to apologize to my taste buds for subjecting them to this terrible pizza.  I appreciate that you guys are champs for indulging in all of the sampling of different foods that I put you guys through, from the good, the bad to the inedible.  This spot goes towards the inedible end of the spectrum.\n\nI got two slices (pepperoni and plain) and regretted both of them.  The plain was over cooked, flavorless with not enough sauce.  The pepperoni took everything that was bad about the plain and then put old pepperoni on top.  I tasted like the slices were cooked yesterday, left out all day and then reheated to try and be sold today.\n\nThere are many better options in downtown, even if you are in a rush, the $0.99 slice spot across the street is a better option.  Avoid this one at all costs.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-26", "description": "I ordered pasta with vodka sauce and a tuna salad. The tuna salad was fine, if basic. The \"vodka sauce\" was watery, flavorless and bland, I sent back the first order because there was hardly any sauce, and then got the second order with a bit more sauce but still no flavor.", "author": "Adrian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-03", "description": "My boyfriend and I are from New Jersey. We went here just walking around downtown Brooklyn trying to find a good pizzeria, bc we were starving we just said whatever well go here. Anyway, it's very odd first of all that it's ran half Indian, half Mexican serving Pizza. But since we were hungry it was fine. The pizza was alright we added a lot of garlic for flavor. But the place was FREEZING! It was 20 degrees outside AND inside you could see our breath. Probably not going back unless they pay the heat bill or its summer time.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "Delicious crust but what's on it is very simple/bland. Perhaps this is a good thing so you can put whatever spices you like on it...\n\nThe grandma slice is on a perfect focaccia crust. Crunchy outside, spongy soft inside. \n\nA good spot if you're in this area but not a destination", "author": "M H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-02", "description": "First thing I notice upon walking in? Fat woman in the corner who's obviously enjoying herself. A LOT. Could be a good sign but then again, it's not indicative of the food quality since the standards for shoveling shit into one's mouth don't seem to be terribly high in this case.\n\nSecond thing I notice? Only three different pies out and ready for consumption (regular, pepperoni, and something else that I've already forgotten).\n\nGood thing I prefer my pizza regular.\n\nIt was decent. Not spectacular but not bad. However, they do offer free delivery for orders over $5. Now that could come in handy. And they have a full menu with sandwiches, baked pasta, breakfast, and coffee. Caffeine AND pasta/pizza? The Italian part of me says that you can't go wrong there!", "author": "Shea D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Bella Pizzeria Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/4U_iV68DUFiAj2Y_OrU9Yg/ls.jpg", "@type": "Restaurant", "telephone": "+17185224100"}