{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I have been visiting Cafe Paulette since it was at the smaller space next door. My husband and I decided to come here for our Valentine's Day dinner at the last minute. We don't come often. However, every time there was a new French bar tender behind the bar. Nonetheless, they were all very cheerful and interesting to chat with. \n\nThough, the wine list is not a long, the bar tender always had great recommendations. \n\nWe were early enough to get two seats at the  bar. The restaurant filled up soon. There was a Valentine's Day menu that included a glass of sparkling wine. We both ordered the pan roasted duck breast. In other restaurants the duck breast usually cooked medium rare and sliced. We had the whole breast unsliced and well done. It was a bit chewy, but the flavor was excellent! \n\nNow, the smaller space next door became a popular wine bar. People waiting for a table at the nearby restaurants, not only at Cafe Paulette, would go there to have a glass of wine, or two before dinner.", "author": "A G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "A wonderful neighborhood restaurant. Always kind service, great wine list, simple but satisfying menu with new specials, and some of the best oysters I've ever had. \n\nHighly recommended =)", "author": "Eddie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "Overall nice local place for the area but it was not worth the drive over.   Interior is nice but limit drink menu.   Ambience is not very French.   They have HH from 5 to 7 ant the bar which is not bad but even at half off oysters it not cheap. \n\nApps was decent but the French onion soup could be better.", "author": "Judy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "The service here is average, but the waitresses aren't too attentive. It took a few minutes before anyone acknowledged that we were waiting for a table. \nThe food was not bad, I had the croque monsieur and my boyfriend ordered the eufs norvegiens. The salmon from the eufs norvegiens lacked flavor. The coffee here is also terrible, avoid at all costs. Overall the experience was just okay, but I much prefer Walter's down the block where the service and food is much better.", "author": "Qi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "So I go in for happy hour. The bartender says wine is $7 a glass. I order 3 glasses of the sparkling rose off the wine menu she hands me. She neglects to tell me this is not part of happy hour (you literally just said it was), hands me a $85 bill then says \"oh I should have probably told you that wasn't part of the happy hour menu\"...yes obviously. I will never go back because she could have rectified the situation and chose not to.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-27", "description": "Great location - wow! On the corner of the park. Cool! Beautiful sunlight at dusk. A dozen bootleg kumamotos for $54. Twice the size and twice the price. Was our average dinner for 2 worth $174? Not sure. Really amazing location though. The park is so nice. More expensive than balthazar and a fifth of the feeling. I love Fort Greene, great up and coming neighborhood!", "author": "Mr F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "This was a great breakfast stop. I had the Croque Monsieur, and it may have been the single best breakfast I had in NYC. The coffee is strong and delicious.\n\nThe service was just ok, but then again our waiter appeared to be the only one covering the entire place.\n\nNice little place in cool neighborhood - well worth checking out.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Some friends and I had an impromptu brunch here on a rainy Sunday. We had intended to dine at Walter's but there was a wait as expected, and the rain put a damper on our be flexible plans. \n\nThere was a brief wait at Cafe Paulette, but my friends and I were able to wait inside before sitting at one of the booths by the window.  We shared a bottle of sparkling rose, which was delicious. I ordered the burger, medium. The burger was just okay which makes it kinda disappointing. The accompanying salad was tasty, as were the fries. The burger was kinda dry and I never got a chance to ask for more aioli because the server Just wasn't coming back around. I've had so many tasty burgers in Brooklyn, that a just okay burger for almost $20 was not okay. \n\nMy friends said they liked their food. The presentation was good-- the avocado toast with salmon looked amazing! We had some coffee after brunch, and that was decent. \n\nOverall, the best part of this brunch was the sharing of wine with two friends I hadn't seen together in quite a bit. I may be back if a friend suggests it. But when craving a burger, I'll likely go else where.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-14", "description": "Just ate here.  Have been here for brunch before.   Last experience was good.  This one not so much, felt pretentious.   Had my biking gear on which was Ike $500 worth but anyway was getting stared at by some patrons.  The waitstaff also seemed uncomfortable with me there.  Wasn't offered a table and it wasn't that full, but it's like they didn't want me to be seen in a seat.  It's not like we were in Soho.  I felt I was rushed out even though it was in a polite way.  Just wanted to have nice burger instead of going to another place around the corner.  The burger was delicious.  Probably won't be back though.", "author": "Royce W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "This place was near our hotel and the online menu looked like it would work for all of our party, plus they were on OpenTable--which I always appreciate.\n\nWe were not disappointed with Cafe Paulette from the excellent Croque Monsieur sandwiches to the powerful coffee that will stimulate the growth of hair on your chest! The only things that keeps this from being a five-star joint is slow service and a slight lack of air conditioning. Our server appeared to be the only one working and we could have used a little more attention and air flow. \n\nBonus: They were shooting scenes for an upcoming episode of \"Elementary\" right outside the restaurant.\n\nBottom line: Quaint bistro in a quiet neighborhood of Brooklyn serving up solid food and incredibly strong coffee.", "author": "Warren D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Love this wonderful neighborhood place! We always have a great meal...love to sit at the bar and just relax with some nice wine and a comforting meal. The only thing that they could do is to upgrade their baguette....there are so many great bread sources in Brooklyn now. That said....had a fabulous hanger steak....wonderful olives...and a perfect creme brûlée ! Highly recommend", "author": "Yvonne Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "One of the best Sunday brunch experiences I've had recently. We were a party of six, 3 adults/3 tweens, so made a reservation. Even though some of us were 10 minutes late the others were able to sit and order drinks at our table which was greatly appreciated given the ratio of hangovers to grownups. The coffee was strong, food great, ambiance relaxed. Classic fare such as eggs Benedict came out quickly with sides of both salad and superb fries. What really stood out was the excellent service: our waiter was professional and attentive but not obsequious. He brought additional milk for coffee, provided information on the menu items, and didn't flinch at a poor attempt to speak French. This place is a treasure.", "author": "Cat H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "An excellent restaurant, the ambiance was awesome, the food stellar and overall the vibe was down to earth and relaxed. We thoroughly enjoyed our time here... and the bartender: mmmmmmmm! \n\nI would highly recommend this place, for casual and delicious french fare.", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "Giving 3 stars instead of 2 because the food was actually good but the service was laughable. I have worked in the food industry so I am a very patient person...but come on. Only 1 server working today during lunch. Took 20 mins to be seen after being seated. When our food came out, we watched the server bring it to the the other table (mind you, we were 1 of 2 tables of customers in the restaurant). Could you really not distinguish between the 2 groups of customers you had? The server literally could not figure out how to run a card or poor a glass of wine (at a French restaurant) properly. As we were about leave, the server told a new customer that he could not sit at an empty/slightly dirty table until he cleaned it. 5 mins later and still hadn't even attempted to clean the table but had plenty of time to yell friendly convo to his cooks. If you are only going to have 1 server, at least make sure he is competent for his job! \nOther than that, the croque-monsieur was great.", "author": "Elliette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "Terrific bistro in Fort Greene. I really enjoy their steak au poivre and the duck. Traditional and delicious french onion soup.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "My friend and I were there Saturday branch time, and luckily we did not have to wait. We were sat in the counter chairs and it was great because the waiters were continually payed attention to us and served very well. \nThe music was little loud, and the bathroom was strangely dark, except those I really enjoyed this place. I recommend this cute little place for brunches.", "author": "S O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "I have lived in New York City 2 years now, have visited countless times over the last decade and have eaten at probably upwards of a hundred or more restaurants of all different styles, cuisines, pricepoints, etc. Cafe Paulette is my FAVORITE RESTAURANT in NYC for weekend brunch. The food is always outstanding and fresh (and very well priced). The wait-staff is always very sweet and hospitable. The food comes out quick and with big portions. I could easily spend 3 hours in that place. Just sipping coffee, reading a book, or chatting with one of the folks there. I've brought dates, parties of 10+, and just sat by myself, all of them wonderful experiences. I love this place, and I hope you will too.", "author": "Miles C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-11", "description": "Very disappointing moulets frite. Very dry and oily and lacked that good broth that is customary to this dish. Bread was dry and tasteless.", "author": "Akane F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Not bad, had croque monsieur with fries. The atmosphere was relaxed, the staff was pleasant. The food was well made and they have nice strong coffee.", "author": "Grace S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Worth the trek in the snow today. Lovely drinks and brunch dishes. The wait was not as bad as expected. I never realized sake, bubbles, and wine could all be served in one place at brunch. \n\nI loved the kale Florentine instead of spinach and my friend enjoyed the omelette special with ratatouille. A great selection of savory and Benedict dishes.", "author": "Urszula P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}