{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "This neighborhood establishment is an absolutely lovely place to eat a delicious meal or have a glass (or three) of wine. The staff is attentive and the owner is a lovely and generous person. The restaurant is cute and cozy and lends itself to wonderful conversation. I go here as much as possible!", "author": "Nadia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "My friend and I were headed to the Brooklyn Flea this weekend and were planning on going to Walter's for brunch.  While walking there, we stumbled upon this restaurant.  We took a look at the menu and decided to go for it.  \n\nThe restaurant itself is very cute and cozy in that French way.  My friend had the eggs florentine and I had the eggs benedict.  Our poached eggs came out perfectly (they were runny inside).  Eggs florentine are usually made with spinach, but Cafe Paulette made theirs with kale.  Our dishes also came with a side of greens and french fries.  The french fries had skin on them and were crispy and yummy.  I wanted more.  \n\nI only have two gripes about this place:1) They only allow larger groups to sit at the booths.  Otherwise, you have to sit at the tables.  2) The other thing to note is that this restaurant crams all the tables together.  There's hardly any space to maneuver around.  It felt like we were on top of the couple next to us.  Having said that, the food is good and I'd come back if I lived in neighborhood.", "author": "N L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Had the lunch special, small tomato and ginger soup with bread drops.. Loved it... very cozy atmosphere.. I would come again...", "author": "Kathlyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "LOVED the escargot, the ravioli appetizer, the meat plate, duck confit, and steak! I wouldn't recommend the cheese plate as they don't have a wide selection however. Otherwise, lovely!!!", "author": "Shiny P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-26", "description": "The beautiful presentation of the photos posted on Yelp were the reason we sought this place out for brunch. We were sorely mistaken.\n\nThe Place: It was 90 degrees out and with windows open, flies and knats were roaming \nfreely. We came not expecting Michelin star joint but that's not how we wanted to start our Sunday brunch.\n\nThe Food: The burger with roasted potatoes and pain perdu we ordered looked NOTHING like the photos. The pain perdu were 4 pieces of thinly sliced, soggy, underdone brioche French toast. Someone should explain to the chef that Pain Perdu is typically made with stale baguette, NOT brioche. The burger was average and does not warrant a $16 price tag... Btw we never got the roasted potatoes we specially requested. \n\nThe Verdict: We came to this place hoping to find a hidden gem but left feeling deceived by the photos seen on Yelp. One and done.", "author": "Ange L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This place is really french. The escargot is on point. They have an oyster happy hour as well. Everything we've had here was really good and we felt transported to Europe.", "author": "Liesl E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Come check out the new location.  Used to be a casual hole in the wall on DeKalb and has moved next door into a beauty corner location.  Not fine dining but more of a French comfort food concept.  Everything on the menu is good and it's a casual spot to spend a couple of hours.  Service is friendly; a real neighborhood place.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "Pro: $1 oyster happy hour 4-6 pm daily\nCon: staff a bit rude - I have been there multiple times and they are never nice\nALSO it took them 35 minutes to shuck a dozen oysters. That's over 2 minutes an oyster. Unfortunate because we were planning on ordering more oysters (just starting slow to not overwhelm the kitchen) but by the time we got the first dozen I was ready to call it quits.\nOverall: the oysters were good but the owner needs to work on the staff, especially service.", "author": "G S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-27", "description": "I've been here a few times and always found the place to be a bit overpriced but the food to be good. However tonight, my friend and I were told from our server that we were being to loud: Mind you he didn't come up to us and ask if we could lower our volume (which would have been annoying but I ultimately would have understood) but yelled loudly himself from behind the bar - and across the restaurant- \"Guys! Be quiet\" \n\nWe felt like we were being chastised by a teacher or something.  We speedily relocated to another restaurant and kept making fun of each other saying \"guys! Be quiet\" so it'll get a lot of play in further outings I'm sure. But it really was bad form for this boujie place to yell at customers who - loud or not - are paying patronized, I mean patrons:)", "author": "Angela G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-02", "description": "Food is fine to good but service is abominable and unapologetic -- it alone easily rates 1 star. Prices are high. I wish I had nicer things to write but I've now been twice and both times met the description above. Maybe they'll get it together in the coming months? Hope so.", "author": "Madam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Charlotte and Eva are rockstars!! Amazing service(despite being totally overloaded). The food was good but the service impeccable!!", "author": "April T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great little french restaurant, cozy environment and good for small groups. I had the steak au poivre cooked perfectly", "author": "Michael H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Spineless frog cried about an empty Starbucks cup of coffee I was finishing off when we walked in because \"they sell coffee\". Well needless to say we ate at Cafe Vino.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Lovely atmosphere on rainy evening or anytime :)\nDelicious cassoulet.  Great wine list. So glad nothing g is heavily salted. Much better to add your own. Nicer w french background music! Will def return.", "author": "Ruth R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "The first time I came here, it was awful. I would have given the place one star.\n\nHowever, I'm giving it four. I returned only because a friend whose tastes I trust highly told me to go back and give them another try. I'm glad I did.\n\nWhy it was awful the first time I don't exactly remember, but I do know the server was a bit rude and unattentive (I haven't seen her since so maybe she was fired) and the food seemed lackluster on that day.\n\nBut ever since I've been going back, I am reminded that it must have been an off-day. This place is otherwise fantastic-- super charming and cozy. The french owners / staff are really funny and warm and friendly. And the food is quite good, and they have a small but solid and affordable well-curated wine list.\n\nDefinitely a very authentic French vibe; it's obvious as I often hear French speakers hanging out there having a glass of wine, so it seems to be the hot spot for French people and Francophiles like myself. ;) The atmosphere is something special-- the kind of place you'll see friends greeting each other over a glass of wine and smiling and then a little ember will ignite in your heart reminding you that it's good to be alive. Ya know?\n\nOne last thing: the burger is amazing! I can't call it the best in NYC only because it's a different experience: it definitely has a French spin on it that makes it unique and different from all the rest. But it's really. damn. good. And trust me, I am a burger connoisseur. (And to my dearest vegetarians: they have some fantastic veggie dishes as well!)\n\nAnd come on, patio seating right across from Fort Greene park? Could you be more damn cute? I'll take it.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Had a Brunch date. Food is good. Was a little bit disappointed about the Chakchouka. It was not what i saw on the yelp picture.\nThe place was cute.  Love Fort Green. I liked the atmosphere. It's a small menu for Brunch.\nI'm putting a 5/5 because my date was really cool. Otherwise I would have put a little 4.", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-10", "description": "I was really disappointed by this place.  I live right up the street and it's adorable, but those reviewers who talk about the terrible service are right - it's bad.  \n\nMy friend and I went for brunch, and even though there were only 2 other tables occupied, we were sat in a corner where we could barely move.  We ordered drinks and food at the same time, but were served both after people who came in after us, which is a huge pet peeve of mine.  It didn't make matters better that I was probably 4 feet from the bar/waiter while he continued to ignore our attempts to get his attention... \n\nShit really hit the fan when he took my friend's food away **before she was done eating.**  He then offered to give it back after piling all of her silverware and napkins on top of the plate/food, at which point I went from being shocked to just truly amused.\n\nAlso, I looked over the reviews again after having been to Cafe Paulette, and I find the owner's (\"Lionel\") responses really funny.  Even when voluntarily responding to displeased customers on Yelp, Cafe Paulette implies a defensive, self-righteous for no reason, pretentious attitude that is a perfect reflection of what it's like to interact with their staff in person.  Like why is it necessary to cite to the standard size wine pour when responding to a YELP REVIEW?  Calm down and just say you're sorry (or maybe just not say anything).\n\nLionel - I would suggest checking yourself before wrecking yourself, and try admitting fault once in a while before too many potential customers catch on.  Good luck.", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Food and wine were delicious. Very busy night but Charlotte and Ava were superb! Kept it all flowing seamlessly.", "author": "Anthy A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-14", "description": "Had dinner last night at 8p w 4 ppl. The place was full which I was glad to see. We were seated immediately as I made a reservation (so would reco you book even though it used to be a quiet gem) \n\nThey didn't have the stuff tomato special but did have tilefish and chicken paillard. Not sure what happened during brunch but they were out of bread - I mean the good French kind and the buns for the burger.\n\nThe food was still good but service was overwhelmed. The burgers were not cooked as ordered. Plates weren't provided. My chicken was undercooked - i sent it back for reheating and when i looked today at my leftovers, chicken was still undercooked in the middle. \n\nI'm going to give this place one more chance bc they are really good but this is bad news for sure.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "Had an amazing time at the old place and really enjoyed the food. i was pleasantly surprised to see the updates but, once all is said and done,  am really disappointed with the service and quality of the food. my waffle tasted very stiff (cardboard-ish) and was doused in a very tangy raspberry sauce. I don't think I'd come back here.", "author": "Krystin H."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}