{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "I came here for brunch and dinner. \nAn adorable tiny hole in the wall that serves solid food.", "author": "Minty N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "very nice and tzhia is the bomb - he made our dinner the most pleasant experience", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I took my date to Café Paulette on Saturday evening (August 9th) and I cannot say enough how much we enjoyed the wine, the food, and the atmosphere.\n\nThe food was delicious, and the portions were both generous and appropriately priced. \n\nThe restaurant's physical footprint is somewhat small, but the lighting, layout, and ultra-cool French music lend themselves to making the space feel cozy verses claustrophobic.", "author": "Bill D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Came in for brunch with my brother.  As usual, he tells me he is running late as I am walking into the restaurant.  I decide to grab a seat at the bar and wait for him.  The restaurant just opened, so they don't make a fuss about me sitting there with just a coffee to wait. Overall the service staff was friendly and attentive, and *bonus* they all speak French, so if you're trying to practice those Duolingo skills, this would be the place to go. Minus a star- their website is a little confusing.  They do breakfast (7:30-11:30) and Lunch (11:30-3:30) on weekdays only, and only serve the brunch menu (11-3:30) on weekends.  This is clarified on the main page of the website, but not each individual menu section, so I was under the impression that I was able to get bread and nutella while I waited for my brother.  The brunch menu is very small (10 items), so if you are looking for variety, this is not the place.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "I can't wait to return to cafe Paulette. The food wasn't the most memorable I've had, but it's an amazing little slice of Paris in Fort Greene. Reservations seem essential because the place is tiny. Favorite thing I had was the rilettes, which is a huge portion. Next time I must get the charcuterie and cheese, it looked amazing.", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "Cute little hole in the wall at the mouth of fort green.\n\nWhen we first stopped by they had a three piece jazz band playing and several people chilling out at the bar. \n\nWe had Poulet piccata with arugula and tomato and the organic grass fed burger with potatoes..\n\nThe chicken piccata was huuuuge and a touch on the acidic side. Maybe a touch more butter to temper the lemon juice Would balance it a bit more.  Eating the chicken on its own was difficult,but balanced well with the addition of the arugula.  Also when I say the chicks was huge I mean I had a whole butterflied chicken breast on my plate. Good value for what we paid ($17) but still pretty overwhelming when it first arrives at the table,\n\nHusbands burger was ordered mid-rare and cooked to perfection.  Served with a roast garlic aioli and cheddar it was definitely rich but delicious.  My only complaint here would be that it may have been a touch over seasoned - it was pretty salty.\n\nWe both finished our meals however and had the sweetest little server who was so friendly and kept our waters filled. \n\nCutest receipts on postcards.\n\nDefinitely worth checking out, and below the price point of the rest of the neighbourhood. Love it", "author": "Eryn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Small place with few tables. The owner (I think) was super friendly and entertaining and the food was delicious.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Great location, especially if you are attending a BAM performance, but definitely has a neighborhood feel to it. Fronts a park, also has sidewalk dining, great food. I especially loved the cheese plate in place of dessert. My SO did share one bite of her mousse. Service is attentive without being hovering or pushy.", "author": "Kent G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "My friend and I came here for brunch on a Sunday. The restaurant is quite small, so the tables are close together which makes you feel a little cramped. Regardless, the service was pleasant and swift. My friend had the Avocado Toast and I had the burger. Both were decently sized portions and very tasty. We also both had raspberry mimosas which were very refreshing. I'd recommend this restaurant for anyone looking for a quaint, quiet brunch spot. Nothing spectacular, but I would return if I was in the neighborhood.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "Paulette is adorable, but unfortunately they have consistently mediocre  and sometimes downright rude service. When Paulette first opened I was delighted to have a charming edition to the neighborhood. The first time the service seemed lackadaisical and un-enthusiastic, I cut them a break b/c they were new and I thought perhaps it was a one  off. Another time we left after waiting 20 minutes for someone to take our drink order... The waitstaff seems deeply perplexed if you ask a question about the wine or food and seem annoyed to be serving you. They are un-accomating about seat requests and and menu questions.\n\nThey could great if they added a touch of warmth and care to their service.\n\nAlso, I have to say the wine selection is a bit uninspired and the pours are not generous", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Phenomenal brunch. Small cozy atmosphere. Raspberry mimosas hit the spot. I had an awesome avocado toast, poached egg, arugula, and roasted red peppers. My friend had an original eggs Benedict and insisted it was better than other places. It fills up quick. The food was Luke warm but the taste was amazing.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "Brunch Sunday. Nothing extra ordinary. Very simple and small menu. I had omelette with kalemera and cheese with roasted potatoes. Three star for organic ingredients.", "author": "Deo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "The french press is great. I also ordered the chakchouka and it was delicious. The atmosphere is relaxed. Great for a nice coffee meet up or lunch/dinner.", "author": "Moe N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "I'll keep it short and sweet: authentic French cafe run by Frenchies. Good oysters, and while the drink options are limited, the wine is solid. Burger was unique and scrumptious. Will go back.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "What a hidden gem ! Fantastic view, overlooking Fort Greene Park, we were transported in Paris. Small and intimate, perfect for a date with my wife. They have some really nice daily specials (try the raclette) and a very well curated list of natural wines. The staff was friendly and professional.", "author": "Loc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "We love Cafe Paulette.  The food is great.  We also love the music, the decor, the service and the atmosphere.  All around excellent spot.", "author": "L-Rae S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "I had another meal here with a large group and everything was on point. The food was great, service was great, atmosphere was perfect. The bill at the end of the night was reasonable. What more can you ask for? The waiter brought over comped glasses of prossecco so we could toast the birthday girl over a divine crime brûlée. This place has earned my love. If you've had a bad experience I say give this place another shot. They are clearly a neighborhood joint that's trying to please a lot of people, and they are getting it right. See you there!", "author": "Odetta S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-16", "description": "Clean with good decor, French music in the background and good light. Quiet during lunch. Had the lentil soup with a carrot/OJ juice. The soup was a bit salty for my taste. I couldn't get comfortable during my meal. It seemed hard to find a good space to stay relaxed.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "The Avocado Toast is just Splendid as is the Expresso!! I plan on returning for the Escargot this evening, this quaint restaurant is perfectly out of the way and worth the visit!!", "author": "Barbara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "If you're looking for an intimate atmosphere combined with exactly perfect food and wine, this is your place. You're allowed to linger, enjoy your meal, have long conversations without the frantic pace of the city. Cafe Paulette is across from Fort Greene park, so an absolute delight for outdoor eating when the weather is good. When the weather is colder, it's a welcoming, cozy French cafe with downbeat music and a simple menu. Most importantly, the food...the best parts of French cuisine to me are allowing rich, fresh, seasonal ingredients to shine in seemingly unfussy preparation. The whole experience is like an exhale. I've been several times and think it's one of the best restaurants in the neighborhood.", "author": "Periwinkle L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}