{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "Worst croque monsieur ever!  This place is totally pleasant, lovely atmosphere, wood decor, lots of light and the park across the street.  I paid $13 for a \"croque monsieur\" that was terrible. The \"brioche\" was like Wonderbread, and they didn't bother to toast it or heat it, there was a thin slice of ham between the slices, and a layer of melted cheese slathered on top, while on the bottom the butter wasn't even melted.  It came with a handful of greens straight out of the bag, dry and stale, with an Ok dressing.  Very disappointing -- and we NEED neighborhood cafes here.  I hope they get this place working better", "author": "Mary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Cafe Paulette has become our go to neighborhood restaurant. The food is consistently amazing and authentically french, in addition to having very friendly owners and staff. I find the prices very reasonable for such high quality food. I preferred the decor/ambiance of their previous location, but the new location is much larger and comfortable. I'd rank their burger in my top 2 for NYC and my wife fancies the skate wing, however, everything we've had was delicious!", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "This is my new favorite Fort Greene spot! Every time there, the staff is very welcoming and it's reminiscent of a traditional Parisian cafe. Between 4pm and 6pm half price oysters and rosé with a view of the park. Can't beat that! The burger is excellent, the creme brûlée is great and there's always different pâtés du jour and cheeses that are delicious. Most times the server or bar tender will offer an extra glass of wine or a taste of something on the house. That's what a neighborhood bistro should be. Great ambience, excellent food and charming staff.", "author": "Seth J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-16", "description": "I want to like this place; charm, fun music, and great location, but I felt like I was bothering the staff during brunch on Sunday... It was just my party of 4 in the restaurant around 1pm and we still felt like the staff could care less. I'm spending $$$ on eggs and mimosas, at least treat me like I'm a person and engage my self and the other paying customers.", "author": "Tina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-31", "description": "Nice brunch and nice little spot, but it was just okay. I have been to other spots around the neighborhood that I still remember what I had vividly unlike here. It's same since it's really cute, but I'm not dying to go back, especially given all the other options nearby.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Cafe Paulette is an incredible addition to Fort Greene.  It is tiny but they go out of their way to accommodate and the food is incredible.  Small menu but everything is delicious and the staff is very pleasant.  Highly recommended for breakfast, lunch and dinner.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Had an lovely dinner here with friends. Packed, but we got a table in just a few minutes. I had a fresh, creamy anchovy \u0026 kale Caesar salad (so, so, so good). The olive plate appetizer was a bit more than the three of us could eat, but delicious. And the crème brûlée? Never have I tasted such an amazing CB. You could go just for that. But then you'd miss out on a yummy dinner and great wine.", "author": "Juliana F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "A charming small restaurant/cafe/bar at the edge of Ft. Greene Park. Jazz plays in background. I've been on several occasions. Hamburger excellent, but last night had the tomato garlic soup and the pork belly --crispy edges with tender insides covered w/ radicchio, mesclun and what tasted like a ponzu sauce.  Really good. Perfect for a cold night.", "author": "Jole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "Strategically anchored in the center of Fort Greene, I stumbled over Cafe Paulette last night and decided to give it a try. Very cozy with tasteful French music in the background and cool interior, I really felt like I was in Paris. The food was simple and yummy - there were options for everyone (I don't eat meat). The wine list was great and affordable, which is refreshing. The food is also priced fairly.  \n\nThe staff was attentive and the owner checked on us few times and introduced himself. Nice touch!\n\nI recommend Cafe Paulette and I will for sure go back.", "author": "Desta D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "It was my fiancé's birthday and Cafe Paulette was perfect.   The food and service was superb.   The place was cozy small,  understated,  and comfortable on a chilly night.   We could not stay for dessert as we had to catch a show at BAM (just a few blocks away).  But we will go back! The duck entrees were very good and the bread and pesto appetizers excellent.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "We landed at the Cafe late on a chilly Friday early last month (March), around 10pm, and grateful that it was not only open but a warm cozy spot with a number of empty tables. We were ushered in by an unsmiling... waiter? (only two possible waitpersons, both in ordinary dress; was one the owner? both?). Our table was comfortably in the back, away from the narrow and somewhat noisy front area. The unsmiling fellow proved to have a somewhat impatient and irritable demeanor. There was another fellow, gregarious, who enthusiastically told us about the specials. I ordered the pork chop which was billed as being quite substantial, and ordered it medium rare. My friend ordered the skate. What came back was rather surprising: not a single, thick, juicy chop but two thin dry ones, one placed on top of the other. This was a first for me (and pretty outrageous, the more I think about it--which I try not to do). I declined to say anything about it for fear that the surly fellow would hurl the plate at me (joking, more or less), and it was unclear whether, that late in the evening, another dish could be ordered. My friend reported the skate to have an unpleasant texture, as though it had been defrosted too quickly. This will be my last visit to Cafe Paulette.", "author": "Allan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "We had a wonderful meal in this restaurant that is conveniently located close to the BAM theater. The crostini were delicious and very fresh, and  I had the special chicken, which was delicious; my husband had the cassullet, which was more ordinary - I would recommend sticking to the specials. \nMy husbands wine was very good - mine was so-so - I would recommend asking for a taste before getting the whole glass (they were happy to do this for others).\nService was very nice and friendly.", "author": "Cory A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Loved this place. Great French press coffee, French toast (pain perdu), and my favorite, the eggs with bacon, which is a delicious and perfectly balanced dish out of the oven with potato, bite sized bacon pieces, melty cheese, and 2 eggs however you like on top. Definitely go here for brunch!", "author": "Julia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-14", "description": "Food is great.  Beautiful place. Been there several times now and the service is consistently terrible - they shame you if you ask for more bread, servers don't come around often to check on anything, drink orders take forever, they said they don't have almond milk, then someone else brings an almond milk latte after I order a cocktail instead. But the latte is burnt. And then the cocktail doesn't come out. No one offered more water. Just a disorganized mess.  Maybe they should hire an American with some skill in running front of house to compliment the French owners and their clear lack of experience delivering on American service standards.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Hangar steak, pistachio crusted mahi mahi, olives, escargot, bread, crime brûlée, and chocolate mousse were all wonderfully delicious. The decor is very nice and a bonus feature includes a park view from the whole place. We will definitely be returning!", "author": "Keith G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-06", "description": "Brunch was very disappointing.  Had the salmon egg scramble and the avocado toast.  The avocado toast is relatively tasteless and the egg on top was not properly soft boiled.  The salmon was inedible - it tasted like it was house cured but may have gone bad.  The side order of French fries was not fresh.  At the end of it brunch was 40 dollars and had to go somewhere else for second brunch.", "author": "Yusuf I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "This is a quaint place. It has an intimate cafe style for coffee, tea, and breakfast bites  They offer good brunch and evening food with wine and beer. It's great because it's close to the park.", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Great spot for a date, intimate and cozy atmosphere. The specials were fantastic. Such a neighborhood gem!", "author": "Kim P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-22", "description": "A real gem. It reminds of the little cafes and brasseries in the Latin Quarter. \nExcellent service; the food was a little slow in coming, even though there were hardly any customers in the place. The table next to me got unreasonably angry with the waitress, as they couldn't understand that she *hadn't* given them a free dessert--they misheard through her thick French accent (another draw of this place). The coffee is French too (an OK, but not amazing latte; but I suspect the espresso will be good on my next visit). The food: incredibly simple, clean French flavours. The perfect escape from New York.", "author": "Evan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "Total find.  Adorable place, great service, and the best coq au vin I've ever had (plus some unique offerings like raclette--permission to eat a plate of melted cheese for dinner!).  We'll definitely return.", "author": "Jessica K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}