{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "If you want a vegetable sandwich without vegetables this is the place. Instead of saying they were out of them they delivered a sad baguette with a single limp piece of Chinese cabbage! I sent it back and they then said they were out of vegetables and would take it off the bill. The bill arrived and the waiter again said it had been removed. It wasn't!!! Twice tried to fool but never again.", "author": "Marcia Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "Good food, rude waiter. I've never been treated so terribly for NO reason. From the moment we sat down, he couldn't wait for us to leave and it only got worse. Quite a shame as we work one block away and live in the neighborhood. It seems they only want to serve customers who look a certain way. Patronize at your own risk.", "author": "Chelsea W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Cafe Paulette is a small, quiet French cafe across from Fort Greene park. I did not try their food - although the menu looked tempting, I only wanted a glass of wine at the bar. Service was prompt and friendly, and the French Pinot Noir very pleasant. Next time, I will definitely try something from that amazing food menu as well.", "author": "Zsuzsa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "My 3rd visit first two were average and acceptable, 3rd visit rude and obnoxious, won't go back", "author": "Jackie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "We love this place. From the moment you enter you feel welcome. It's menu is very French, small but with something on it for everyone. The salads are really fresh and the specials highlight the season. From the fresh oysters to tomato salads or Little gem lettuce salads they all rock. \nCome hungry and you won t be disappointed! \nOn this visit we had a cheese plate with a French Chardonnay and 2 salads to start us off all were perfectly made. We also had mussels and fries which were cooked in a delicious white wine broth worth sooping up with some French bread! And our kids shared the chicken which they polished off. \nThis place is really good.", "author": "Neil G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "Went here for dinner last night. There was a human hair in our gravlax... The restaurant manager did not even come to our table to offer any assistance or to check in on us. Seafood ingredients also could be better.", "author": "Aman J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "These days Paris is downright polite.  I often wonder how Paris got so awesome - now I know! They exported all the rude awful French people to New York.\n\nI used to love this place but I was chased and screamed at by the server for attempting to use the bathroom before securing a table.  Naturally I decided to cancel my lunch and go elsewhere.  I will never eat here again and neither will anyone I know.\n\nAppalling, vile waitress.", "author": "Nick A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "Nice little place in Ft Greene section of Brooklyn. Visited this morning with my daughter for brunch. She had the Avocado Toast and I had the Omelette special. Both dishes were excellent. \n\nMy only issue is that they had no cream for coffee, only whole or almond milk. Not sure how a place that specializes in brunch doesn't have cream, but that was the case.", "author": "Pat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Nice french cafe in a really nice area of Fourt Greene, in front of the park. The service is very good, and the food is good too. I ordered the ravioli appetizer and they were very small and tasty raviolis, very original! The prices are a little high.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "Terrible service, never going back. The waiter messed up the order and seemed coked up while the manager/owner is equally aloof.\n\nIf you want to spend your night at some overpriced, mediocre, bland dinner THIS IS YOUR PLACE!", "author": "Mandana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I swear guys it was best avo toast with homemade gravlax for all time I living in NYC! It was the only one branch which was really tasty not just good or good-looking no. It was DELICIOUS", "author": "Ninel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Wonderful sweet and cute cafe and crepe shop. Great location just across from Fort Greene Park so I could sit and look at the trees as I ate. \n\nThe overwhelming number of French speaking patrons also eating here made me feel like I was on a vacation in France. \n\nThe crepes are simple and well made. I ordered one with kale, goat cheese and carmelized onions and fresh squeezed orange juice. A perfect quick Saturday lunch. \n\nCan't wait to come and try a sweet crepe.", "author": "Julia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Solid neighborhood restaurant, good spot for a day at the park. It's across the street from Fort Greene Park, which is an off leash dog park until 8am, right when Cafe Paulette opens. You can't bring your dog inside restaurante legally in NYC because of the health code, but if you want breakfast in the park you can get to-go boxes.", "author": "William J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "The bartender told me I couldn't use my computer during dinner. A guy next to me sits down and opens up his laptop. I ask if it's now alright for me to use my laptop and am told no. Sweet.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Not sure what happened to the 2 other people that wrote something on yelp but I love this place and its always packed so I guess I am not the only one who likes it. I specially like the ambience there, perfect for a date with my wife. Also the waitress called Charlotte at the bar is lovely. Been there many times and its one of my favorite place for a late and long diner in Fort Greene.", "author": "Aurelien M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "The short story: I have a refined palate and I'd give the food and wine 4.5 stars though I'm not sure I'd be comfortable going back. Unfortunate since I live in the same block with the restaurant.\n\n******************************************\n\nThe Burger Paulette is very good and so is the Vouvray. The music is lovely and the (manager?) came over promptly to tell me about the special and then again later to ask how my food was. The lighting is dim and the ambience is pleasant. There were groups but it is very much a date spot and had I known, I probably would've gone elsewhere. It was packed for a weeknight and in general, and there appeared to be only one other person of color there besides me. Though those two factors didn't really bother me. It was the way I was spoken to upon arrival that I couldn't shake. \n\nShortly after I arrived, a woman approached me asking what she could do for me. I thought it was an unusual way to greet somebody, since people normally say \"hi\" or \"how many?\" or at least smile as a way to seem welcoming. It threw me off so I said, \"I have a table...I mean, I booked a table.\" She laughed at my stumbling over my words, which was off-putting and then offered me a choice of two tables. \n\nI then followed her and after she wiped down the table I chose, I sat down. She had gone for a menu/utensils and upon returning, made some sort of comment like, \"Or you could just sit down\" and chuckled to herself again. It's a small place and it was full/a bit loud so I might've missed something she said but normally if you're standing, it's customary to sit once the table is clean. Based on where the table was, the only place I could've stood was in front of the bathroom and I can't think of a good reason why I should've done that. Either way, I already felt unwelcome and that didn't help. \n\nI made an effort to make the best of it and she was fine after that though it seemed like she was in a bit of a rush to give me the check, which I didn't love. For context, the place had started to clear out by then and there were several open tables. I left right after the people next to me did and they came before me, appearing to have dinner and dessert. I had only eaten half my dinner when she asked if I was done. \n\nI sat next to a man/woman couple and when I arrived, the woman complimented me on my dress, which was sweet and almost made up for the rest of the night. Before they left, the man looked at the woman and said, \"Did you have fun?\" and she said, \"This was our best date ever!\" They looked so happy and seemingly in love. Overhearing this made me tear up because I was able to witness a beautiful moment and because it highlighted how disappointing it was to have such a different experience in the same restaurant at the same time.", "author": "Lanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "I been to cafe Paulette several times and find the food to be good and the setting quite lovely. Today however at 5pm I walked in wanting a single late lunch and a coffee. I was tired and did not want to sit at the bar, which was crowded. There are approximately 15 tables there and only one was occupied. \nI asked if I could sit at a table and the host refused. Saying they might have reservations coming in. I said really it's empty. I wanted a quick meal. 1/2 hr at most would I have sat down. It is shocking to me that they had all that space yet refused to seat me. I live in the neighborhood and often pass by thinking I should stop in. I will think twice next time. \nI walked up the road two blocks to Walters. They were bustling and seated me without any question. The vibe was also lively and joyous. Booo Cafe Paulette!", "author": "Adrienne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "Good brunch place but not spectacular. The brunch menu was limited. We had the lox and omelette but the best part of the meal was the side of bacon. If you're looking for a special meal in the neighborhood, there are probably better selections.   I have not tried other meals here except for brunch.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "The tables are a bit tight together making dinner a little uncomfortable given the proximity of other diners. But the food is delicious and the service attentive. Came for a Friday night dinner. Thoroughly enjoyed the pate and my burger with fries. Have come before and sat at the bar for wine and oysters which were chilled and nice and fresh! Overall a nice dinner experience", "author": "Bridget G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I came here for a dinner party a few months ago, when there was still a chill in the air, and it was a wonderful experience! From the excellent customer service, to their extensive wine list, to their cozy ambiance, I enjoyed my meal thoroughly. I love, love loved the pate, escargot and mushroom soup apps. I also went for the raclette for my entree and oh my, it was the definition of cheese heaven. Divine.", "author": "Shu Jin S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}