{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "A lovely, little cafe for simple French comfort food. The knowledgeable waitress coaxed us into the perfect dinner (hint: don't forget the leeks), and obligingly over-poured the wine.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "What a gem! Was strolling down the street with my girlfriend and popped in for a glass of wine. Stayed the whole night having dish after dish. The ravioli is some of the best I've had. \n\nEclectic decor and the service is great. \n\nThis is a must go!!", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "This place was adorable! I went here for brunch and it was a bit more expensive than I wanted it to be, but it was worth it in the end. I ordered a burger cooked medium rare with fries and added goat cheese for an extra dollar, such a good choice. The burger was cooked perfect, rarely do I go to a restaurant and the burger is in fact cooked a true medium rare, this was. I also ordered a mimosa, they did not skimp on the alcohol at all, hells yes. Another note all the workers were fairly friendly even though they were a full house. I'll have to make another trip here, I mean I do live about 15 to 20 minutes walking distance, so I might as well.", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Holy McGoogle-pants! This place is just perfect. Superbly delicious food, very small menu (which means everything on it is good), and a charming-as-hell-atmosphere. Also very reasonably priced for the area (everything around Fort Greene is getting expensive). All in all, a great experience. Will be coming back at least twice a month.", "author": "Carlos A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Great food, proper portions and tasty coffee. A big plus is that this place is pretty quiet and has a lovely view of the Fort Greene park.", "author": "Nina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Good if limited French food and nice service. Very convenient to BAM and the other downtown Brooklyn sites. They were out of rilettes so I had a pate, which was pretty good and my companion had a kale salad. Mains were a tagliatelle puttanesca, and a very tasty stuffed tomatoes with rice; the rice was cooked in butter and was delicious and the tomatoes were stuffed with spicy sausage. Dessert was creme brule with fruit.\nEspresso is available and was good. This is more of a bar with snacks than a restaurant and the menu is quite limited, but good.", "author": "james h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-05", "description": "Bad review based on a 4 dollar iced coffee that was both small(12 ounces) and tasted mostly like water. \n\nPretentious atmosphere does not guarantee  quality.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Awesome little spot! New to the neighborhood, so my boyfriend and I wanted a nice brunch spot nearby. Called and they were happy to take a reservation for three people despite the small space (maybe room for 30 people). I had the burger, which was done just right and had a lovely aioli on it. Boyfriend had the avocado and egg toast, while our friend had the gravlax club. All solid choices. Service was helpful and prompt. Will definitely be back again!", "author": "Mark K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-20", "description": "1-  you marginalize and exclude the working class in your neighborhood who want to give you business by considering 50 cents insignificant.  If it's that insignificant to you and your staff, then round up, not down.  \n\n2- if your server's dehumanizing look and tone in emphasizing the word \"you\" was not a sign of judgment and racism, then what was it?\n\n3-  you fail to quote my positive reviews, at other male/white dominated establishments who treat all people equally and with respect", "author": "t c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Very nice however they need to use different bread for their Croque Madame.  I believe it was Texas toast instead of brioche.  The cafe was very quiet and overlooks the park.  It definitely reminded me of a Parisian cafe.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "I recently visit Brooklyn and was recommended to this cafe by a friend but I had such a horrible experience that I wanted to share. I experienced a form of discrimination by one of their waitresses . As I was told to move to another area so that any other family can take my seating. I didn't understand what was the problem then I was advised by the same person that their restaurant may not have been what I wanted and was told I could go somewhere else because I asked if they had something else other than crepes. My friend and I decided to leave because we were obviously not being welcomed . I am not sure if it was because we didn't look French . I am a dark skin Hispanic and my friend Asian or the fact that we probably didn't fit the profile of their usual European primarily white customers but it was awkward and humiliating and will never go there again and want to warn those like myself colored ,Hispanics , and Asians to beware and don't spend you time and money on this place!!", "author": "Wanda A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "This is a terrific find and is close enough to BAM to be an excellent before-performance dining option.  It's very cozy and service was impeccable, wine was generously poured and delectable and if you get there early enough, you can have their sensational oyster special!  The roasted carrots are highly recommended.  We had two specials, both wonderful.  Will definitely be back!", "author": "Margaret S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "I want this place to succeed, I really do. But all I wanted was a cup of coffee to go and the staff couldn't seem to get it together. It took about 15 minutes to do something that should have taken a second.", "author": "owen w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "we ordered eggs Benedict both of ours had burnt English muffins. We could not even cut them. One of us had eggs that were very over cooked with no run. We told them these complaints and we each only got a half of an English muffin properly toasted. Very bad Benedict. Definitely will not be going back.", "author": "Sophie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I absolutely love this little gem of a restaurant. I've had lunch and dinner here, and always really enjoyed the meal and the sense that somehow, we've been transported from Fort Greene to France. Lovely people and food. Happy to have Cafe Paulette in the neighborhood. Great for after-BAM too.", "author": "jennifer s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-19", "description": "Stopped in for happy hour oysters just a few mins before happy hour ended. Place was practically empty. Wait staff was rude and seemed annoyed to be serving us. No friendly vibes at all for a small cozy neighborhood. Perhaps they should move to manhattan.", "author": "Leigh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Like a good friend's home--comfy, warm and intimate. The francophone staff couldn't be more helpful. My friend and I split the mushroom risotto and sea bass and both were delicious. The chef even agreed to sub out the butter for oil for my fish dish--unusual for a French restaurant. Grab a good friend, a date or a book and enjoy the hospitality.", "author": "heidi b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Was looking for a place to have a glass of wine and read a book on a sunday night before heading back to work on Monday, and this was the spot. Laid back and relaxing. Beet salad was very good...plus there is a happy hour on Sunday from 4-7... total surprise!", "author": "Emilie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "I can't believe I haven't reviewed Cafe Paulette yet! I've been walking by it for months, and have eaten dinner and brunch there, had a few drinks on New Year's eve, and even stopped by just for coffee.  I'd definitely recommend their dinner service:  the radishes with butter were so delicious, and everything we ordered (plate after plate) was really fantastic.  My boyfriend is French and enjoyed speaking with the owner, who also sold us a really nice bottle of wine for a deep discount.  I had a creamy, cheesy cauliflower soup (the soup of the day) which was perfect.  The brunch was not as good as dinner.  My croque-monsieur needed more cheese, and to be cooked more, the cheese that was on it wasn't melted (a pet peeve).  The French press also tasted really off...but on the other hand, their pan perdu/french toast was extremely good, and the prices are pretty good for Brooklyn/Fort Greene.  Definitely worth a trip!", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Lovely authentic-feeling French place. If you just want to take it easy and hangout and have delicious food, this is a great place.", "author": "Benjamin T."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}