{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "I don't understand this place. They had one person bussing, serving and working the register which seems unhygienic if nothing else.  Management should have more people on the floor. There were dirty dishes for 15mins at empty tables.  The person next to me didn't have a menu.  I wish I walked out before the long wait for it.", "author": "A M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "Delicious food. Great service. So happy they had almond milk for their cappuccino. Not pretentious at all. BUT...\nThey just opened Crepe Paulette next door and the French woman behind the counter was extremely snooty. Two years of Higgs school French didn't help me at all with this chick. I basically gave her the English enunciation and you would have thought I said something in Swedish to her. So annoying. The guy making the crepes was very nice when I came back to pick up the order. But the crepes?? They were so bland. \nWhen they finally get their own Yelp page, I'll make sure to check back in with another review.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "We just had dinner at the restaurant, food was good, nice sized portions,  price was average and service was very good.  I spent a lot of time in Paris and it had the feel of a french bistro.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "I was absolutely shocked to see the poor reviews of this place. I rarely write, but decided to do so because this is one of our favorite spots in the area and I don't know who these folks are who are writing these negative reviews - I live within a few blocks and come here for brunch every other weekend if not more frequently. It's always packed and I always feel like everyone around me treats this place like their best kept neighborhood secret.\n\nI selfishly thought maybe I shouldn't write a review, for fear it gets more crowded. Oh well.\n\nThe food is priced where I'd expect it for any brunch place in Fort Greene. I've tried most of the brunch items and loved every one of them. The Oeufs Norvégiens are my favorite. I've spoken with the owner, and every waiter I've worked with has been very helpful. The bartenders aren't the smiliest, but this is an authentic French restaurant for crying out loud - it's not a southern dance hall serving fried chicken where everyone calls you \"Honey\". \n\nAnyways... good work Paulette crew. We are so happy you're in the neighborhood and I'll see you this weekend probably. :)", "author": "JD M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "No one likes rude people. This restaurant... Cafe? Whatever, not the point. I love the coffee but whenever I go here I feel as if my presence annoys the people there. Staff and other patrons stare. Makes me feel really uncomfortable. I mean, I am wearing normal clothes. Maybe it's my backpack. The sight of a student worries them - maybe they are afraid I might be the youth that steals their career. Maybe it's the neighborhood, but the air of entitlement and judgement does not mix well with that of youth. I mean, a high school is next door. Don't they want younger customers? High school students love coffee and pastries so what gives?", "author": "Dani C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "This place is a fantastic neighborhood spot! Fresh onion soup is great. Wide variety of wines. The setting is great for date or work.   Also, they have a great happy hour.", "author": "Dave G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Came here a few times, the service is always on point. Everyone is always smiling and welcoming.\n\nThe food is also great, I had the mussels and the mixed platter. It is just as good as if you were in France. I just wish more fries came with the mussels.\nThey also have a rich variety of wines so don't forget to take a peek at the menu.", "author": "Maxime T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Nice French cafe/restaurant of the neighborhood. The service is very friendly yet professional. Thee menu contains the French cafe usuals as well as a range of selected main courses including several couscous dishes. Being right by the Forte Green Park makes it an attractive location.", "author": "Taner B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-18", "description": "Nice little spot. Little being a key word here; the tables are so close together it is like eating at a community kitchen. We went for brunch and the food was good (had eggs benedict and chokchouka.) This place is perfect for a snack. Plates were really small and no dessert menu to fill up on. Be prepared to wait for food, the kitchen does not move quickly. Though im sure it wouldve been quicker had they not overcooked the chokchouka. \nThe worst thing about this place is that it took so long to get a mimosa it literally came after we finished eating and our table was cleared.\nWait staff was excellent.", "author": "Sim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Very surprised to see negative reviews on this site. My boyfriend \u0026 I live in the neighborhood, and this is consistently one of our go-to choices, when we're able to get in (which can be tough, given how popular it is). NOTE: we've only been for dinner, not brunch.\n\nAdmittedly, I don't always feel like my palate is sophisticated enough to enjoy all of the things on the menu, but everything I've ever had was amazing. Burger, mussels, a number of the entree specials. \n\nThe team that works there clearly enjoys what they're doing; even when it's crazy busy, they're polite, smiling, joking around, and more than happy to give recommendations. Is the service flawless all of the time? No - sometimes there are slight delays, or something falls through the cracks - but any time that has happened, they could not be more gracious. \n\nOne of our favorites. Highly recommend.", "author": "T.R. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "My girlfriends and I stopped here for a quick drink before our dinner reservations down the road.  They had a great happy hour, where everyone enjoyed the $7 rose.  Cafe Paulette has a sunny, positive, and welcoming atmosphere.  Overall, nice spot to drop by!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Somehow, Cafe Paulette has never been on my radar but I\"m certainly happy to have tried it for brunch the other weekend.  I arrived before my friend and was asked to wait at the bar - ok I guess, no biggie - I did enjoy an amazing cup of coffee while waiting (ah the aroma and the taste!).  Once my friend arrived, we were promptly seated - the restaurant isn't huge so you do get to know your neighbors a bit haha but we were lucky to score a corner table so it wasn't all bad.  The staff are really friendly and sweet - how can you resist an attractive man with a french accent?? Just saying (blush)... the food was pretty good as well, Croque Monsieur for me and Steak and Eggs for my friend; definitely not stingy on portions! Oh and mimosas were absolutely what the doctor ordered!  Thank you! SundayFunDay!!!", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "I give this place one star because the staff was nice. But this is the only good thing the restaurant has to offer. Don't let the cute decor and friendly staff fool you though. My friends and I decided to have brunch here because it was the only place we could get a reservation at the last minute. That should have been a RED FLAG. \n\nWe were seated and it took 30 mins for our waiter to take our order. I ordered the Belgian Waffle. The waiter mentioned they just ran out of waffles so then I ordered the Shakshuka. Guess what? They were out of that too! I'm thinking, what the hell do you guys have to offer then? Mind you, their brunch menu is small so there should be no reason to have 86ed on anything! \n\nMy friends and I were busy catching up and realized an hour had passed by with no food sent to our table yet. When I asked the waiter where our order was, his response was, \"Which order?\". We were in shock and couldn't believe this guy had no recollection of our order. So I had to tell him what the exact order was again because he couldn't remember the adjustments made to the order either. \n\nOur dishes finally came and can't believe none of our food/drinks were comped for the their mistake. Then as we were paying our bill, we were told to leave right away because they needed to set up for dinner service. This was an overall HORRIBLE experience. NEVER coming back to this place again. And I hope you don't either!", "author": "Anthro Food E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "This is one of the neighborhood staples. The place is absolutely charming and French in every way. The food is great, atmosphere is great and the bar is nice and cozy. \n\nDon't go anywhere Paulette! We love you!", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Enjoyed this quick stop to Café Paulette. I was craving a nice glass of white wine, some rustic pate and delicious bread. I wasn't disappointed. We ended up staying for dinner, we had scallops special. \"Beautifully, visually gorgeous, of course cooked perfectly. No cool center for me! Our companion have the duck which was delicious.  We will definitely be back!", "author": "Kb R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Was there on Friday with my wife and kids.Food was excellent.. Our server Miguel was very attentive. He answered our questions , very professional top notch waiter.. Thank You Miguel", "author": "Johnny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Fantastic food, fantastic selection of wines, Friendly, cozy atmosphere... cafe Paulette is a go to option in fort green and vicinity.", "author": "Carine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Cafe Paulette is an adorable, intimate little French bistro in Fort Greene with a delicious weekend brunch. Though the menu is limited to just about 6 or 7 entree options, that does not help narrow the selection. I almost always opt for lunch foods at brunch, so I recommend the burger. And the raspberry mimosa was so refreshing.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "Food was excellent!! However, my coworker and I had a terrible experience with the staff. We came there for a work meeting over drinks and dinner with a reservation and when our server found out that my clients weren't eating he said, \"wow you know I really appreciate you making a reservation for 4 when only 2 of you are eating.\" Very unprofessional, and made our clients feel incredibly awkward. Why would anyone even say that? 2 of us are paying customers, and if we and our clients (who weren't eating) were treated well, perhaps we would've ordered more food/drinks, given a good tip, and be returning customers.\nAlso, when we got the bill we were charged for 2 extra glasses of wine. Whole experience, except for the food, was very unprofessional. \n\nIn response to the owners comment: We were never asked to move to the bar or we 100% would have. We wouldn't have declined that offer due to the situation and would've been happy to move to make room for other customers.\n\nIf you're coming here for a work meeting, I would strongly recommend against it. I will definitely tell my company and future clients to stay away from this place. Shame because the food was great!", "author": "Christina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "perfect place to meet for a glass of wine, or chill on your own with a book at the bar.", "author": "Phil T."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}