{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "In this little charming bistro the staff makes you feel like family. Our favorite is the burger but you really cannot go wrong!\n\nEdit: I wrote my first 5-star review a few years ago. Since then the restaurant moved into a bigger space and is always packed. Doesn't have the same cool quaint vibe that it had before.", "author": "Rychiee E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I don't understand the 3-star reviews. This place is awesome!  It's a little slice of Paris situated on an adorable park in the heart of a very authentic Brooklyn neighborhood.   (What could be better than that?)  I've eaten here several times now and the food has always been very good to excellent.  But this last time really blew me away, prompting me to finally leave a review.  The salmon gravlax app was to die for, and the chicken entree was absolutely spectacular.  I don't like oysters but my husband was raving about them.  Overall the menu isn't huge, but it's well-edited and there's something for everyone.  Service is efficient and friendly, they have a solid wine list, and the space itself is really nice.  You should definitely check this place out!  My next trip will be for brunch.", "author": "KB S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Best low-key brunch ever in NYC. The vibe is chill and the food was outstanding . Will definitely be going back the next time I visit", "author": "Perkins B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "One bite into the steak au poivre and my eyes close reflexively, allowing my senses to focus solely on the play of perfect flavors on my tongue. Call me dramatic, but the last time this happened to me with French food was actually in France. Even the ambience at Cafe Paulette--homey, full of character and charm-- was reminiscent of the small Parisian restaurant where I had this moment. It is evident that the one who prepares this food does so with experience, creativity, and love. To warm ourselves up we started with the winter special raclette: melted, gooey cheese paired with sweet pickled vegetables and cured meats. For mains we ordered the burger and the steak. While the burger was delicious and well-seasoned, it was my steak au poivre that stole the show. As a matter of fact, it's pure cocaine. Tender meat and potatoes au gratin wading in light yet creamy peppercorn sauce, and accompanied by a genius medley of greens (red watercress, tarragon, chervil, and parsley) to set it all off. We fought with ourselves to order dessert, having gorged ourselves but not wanting to miss out. We were so happy we did because the coconut creme caramel was heaven.\n\nEver sat down with an old friend in that unassuming little neighborhood restaurant and end up having one of the best meals ever? That, my friend, is the Cafe Paulette experience.", "author": "Trinette G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "At here last week and was so excited for this meal. Sadly, the only thing I walked away with was a buzz from the bottle of wine.\n\nMy friends and I ordered the escargot, mussels, tuna Niçoise salad, and the salmon sandwich.\n\n-Escargot was a bit gritty but sauce was amazing and THE BREAD! \n-Mussels lacked some flavor but did the job.\n-tuna Niçoise salad was great but for the price it was small.\n- salmon sandwich was okay.\n\nIt is a cute spot for a nice drink and maybe a small plate but don't think I'll dine there again for dinner", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "This may be my first review ever but the service here was abhorrent and I cannot stay quiet. We and several of our friends live in the neighborhood and I can assure you will never go back to this hostile restaurant. We were treated HORRIBLY by the waiter. DO NOT GO HERE. After several initial negative interactions with this unprofessional (and apparently uneducated in customer service) waiter, we finally sat down and ordered drinks.  Twenty minutes after sitting, the waiter rudely approached us and asked us to leave so he could give other customers the table. I assume it was because we didn't order food fast enough? It was not communicated to us. He was so nasty, curt and hostile that we decided it was better to walk out of such a disgusting establishment than the engage with such a nasty person. He needs an intervention. Never in my life have I ever been treated with such utter contempt and disregard despite having done nothing to cause such treatment!", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Amazing raclette! So rare to find in the states! Straight back to France! Also a great find  of organic/ natural wine producers on the wine list! All in all cool!", "author": "Kreso P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This is our \"special occasion\" place. Location, food and service are all terrific, with lots of personality to make it memorable. The maitre d' is always kind to our child and has wonderful wine suggestions to go with the delicious, very French food. My one quibble is the high price of the oysters--I wish the happy hour special on them (1/2 price) would extend to the tables.", "author": "Perdita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "This place has amazing food, attentive service, great wine and a very comfortable atmosphere. This is a must visit for a date or casual lunch.", "author": "Beer S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "They asked if we wanted sparkling water when we sat down, and I wouldn't have agreed if I knew they were gonna charge me $7 for a Perrier. It's almost laughable. Don't go here.", "author": "Amir S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Lovely intimate vibe. The wait staff is very friendly. They great wine selections and the food selection is authentically French and is always fresh. Happy to be a local here. It's great place for special occasions and everyday dinning as well a great date spot.  Definitely a must if you're in the area.", "author": "Shavannah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "We stumbled into this restaurant after being turned down by several restaurants during their changeover period between brunch and dinner. \n\nAlthough this restaurant was going through the same changeover, they did offer oyster happy hour during this down hour. Being a lover of oysters and wine, this seemed like a solid solution while waiting to order full meals. \n\nThe service was really friendly here, but somewhat confusing. To be such a small place, we had atleast 4 different staff members waiting on us during the visit. Quite frankly it felt like everyone was running with their heads chopped off for a while.....and with all of the people we still didn't receive our oysters for atleast 30 minutes (that's likely an understatement) though we were the only people in the restaurant initially. That's a bit long for shucking 12 oysters. \n\nI respect the changeover, but if you say that oysters are not effected by this period, I expect that they will actually be available in a timely fashion. If the timing is needed for cleaning and preparation, just don't give the option. The positive from this was that the timing allowed us to order our main entree and have it ready by the time we finished our oysters. \n\nOnce the food came out and the kinks were fixed, the food was actually tasty. I had the mussels and my friend had the steak. \n\nIt's a small place and they turned a few people away because they had pending reservations. As a result I assume it's best to get here early. Good addition to the neighborhood and perhaps once the Managament kinks are ironed out it will be a great place. This could easily be a 4 star place, but for now it's difficult.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Had great dinner there. Cozy and very French atmosphere. Food is amazing and I really enjoyed the homey vibe. This will be part of my Brooklyn circuit whenever I visit NYC.", "author": "Vee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "------Brunch review---------\n\n+++\n- The French press coffee was phenomenal\n- The juice of the day was orange/beet...It tasted like I was actually eating fresh oranges and beets; Im not the biggest fan of beets\n- Wife enjoyed the croque monsieur\n\n\n++\n- Good place to watch French soccer\n- Hachis Parmentier (Shephard's pie) was nice and buttery\n- The portion was big, I was not hungry again until well into the evening\n- Easy to find a table around noonon a Sunday", "author": "renje g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "I like the space and wanted to enjoy the food, but it felt very short for brunch last weekend. My husband and I shared a kale salad and avocado toast entree. The salad was small, was too dressed, and was overall very uninteresting for $12-13. The avocado toast (also $13) was one very small multigrain piece of bread that looked like it came from a package. The colorful tomatoes were a nice touch. But the egg was very runny on top. The avocado was fine, but not plentiful either. For such a simple dish, you'd think there would be more food and of better quality. Both my husband and I felt sick to our stomach when we got home, so I'm not sure which of the two dishes was the culprit. Unfortunately I can't say I'll be back for brunch any time soon.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Such a così place! Went there with friends for light dinner and was so happy that we choose this restaurant. First of all, they have wonderful French hosts which made my time there even better. Excellent selection of wine for any taste. Our food was pretty tasty too - I ordered beef tartare and it was delicious. My friend ordered mussels and could not be happier with her choice either. I looked at people around us and all of them were enjoying their food as well. That place has a very friendly vibe and truly French atmosphere. Will be back there definitely.", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Their food is decent (if overpriced for what it is) and the ambience nice, but the people who run it are so rude they are able to make you choke on whatever it is you're eating in no time. It is quite astounding how unfriendly they are and how quickly they manage to make you feel not welcome. From the very moment my friend and I sat there on a  Saturday night (and it wasn't crowded, mind you!) we could feel that they can't wait for us to leave. \"No\" was an answer to every request; the waiter was pushy and unapologetic. Our check was on the table before we eve asked for it. Their wine is fine and the creme brûlée was good, but I will never set my foot in this establishment again - and I don't recommend to anyone who does not like to be treated with unabashed condescension.", "author": "Kamila S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Cafe Paulette offers a tasty French brunch/pastries, strong espresso, and a cozy atmosphere. Its a bit too small for the average brunch meal, but the lack of a wait makes it a great standby. The menu is short, with a few benedicts, french toast, and some sandwiches. The smoked salmon open faced sandwich with creme fraiche was delectable and well balanced. The french toast was generous, with plenty of apple on top. And the croque monseuir/madame were solid and well executed. While this may not be the most exciting brunch location, its a great neighborhood option for smaller parties who don't like as much noise. They also have a TV and a few sidwalk tables.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is a lovely French bistro where the food is just updated enough to feel special, while still being traditional and classic. Atmospheric but not too loud or crowded (unlike many restaurants in the neighborhood) and the staff are friendly.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Exceptional beef tartare as well as some of the most delicious salmon I've ever had. C'est tres bien!", "author": "Adam E."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Café Paulette", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/s0Kk96xhzNT-I-hEXQqtaA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528582"}