{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "This place is phenomenal, from the service to the decor to the food (so many specialties)! We walked in on a whim and were immediately charmed by the space and the staff, quickly ordering the Kao Soi, papaya salad, sticky rice and the Kua Kling. What's great about Charm Kao is that they offer options unique to specific regions in Thailand, something I'd deeply missed since traveling there. Highly recommend for a lunch date or high quality take out. Will certainly be back!", "author": "Joey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "duck curry great when they first opened and still good but i think they realized that the portions they were giving were too big because now the amount of duck is at least 25% less then my first few orders. same thing with the short ribs. still very tasty but smaller ribs!", "author": "peggy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Outstanding little place. I'm very picky when it comes to Thai food. I asked if they do Thai spice level and the owner said of course. And boy did they deliver. Food delicious. We had the mango salad that was very well balanced. Pad Ke Meow was awesome plus my spicy pork dish that was the best I have had in long time. Prices are reasonable. Glad that they opened around the corner.", "author": "Mitko B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-21", "description": "The pad thai was nearly completely flavorless. The flavor on the chicken wings was ok but they were soggy. A shame, I was excited to see a new Thai place open up around here.", "author": "Zoey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Brand new spot in the hood. So excited for its arrival. Seems to be everything I'd want in a local spot. Thai food feels a bit like comfort food to us, so having just down the block, is amazing! Food is delicious, woman inside is extremely friendly and proud of the authentic Thai cuisine. Couldn't recommend more highly.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-22", "description": "Went for a pick up when the place just opened. The food tasted good until the next day when my wife had food poisoning after eating one of the curry dishes. So just so everyone is aware, hoping no one else experienced this.", "author": "Dan Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-08", "description": "The food was burnt...... and the service was okay ... really tight spot. Drinks were overly sugary.... for al my friends. We left a tip of 7 dollars and we were expecting our change 10 dollars back. The lady hold down on our 10 dollars and goes ur only going to tip me 7 dollars after the food was disgustingly disappointed. Well over this 10 dollar tip she was begging for we let her keep.... she has lost 6 customers that will never be going. Advise you not to go unless ur big on customer service.", "author": "Sara A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Charm Kao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "193 Schermerhorn St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/CgVF85ZHqVxLcN-XCFoaBw/ls.jpg", "@type": "Restaurant", "telephone": "+13475991748"}