{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "I like your food but can you PLS make it less salty? \n\nthe noodles are all way way too salty", "author": "Yanqi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "This new, excellent Thai place has instantly become a favorite.\n\nIt's a small, beautifully decorated restaurant with a semi-open kitchen. It's an endlessly charming spot in a central location, suitable for a casual date, a solo lunch or dinner, or a meetup with a small group of friends or colleagues. The service is beyond attentive, very fast, and very friendly. \n\nThe food comes out quickly and is presented elegantly in hearty portions, and it is rightly the star of the show. Rich and complex flavors make you savor each, hit all the right notes, and keep you thinking about Charm Kao for hours.\n\nCharm Kao is also a great deal, which makes it a win-win proposition.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-28", "description": "All right look. I really like Charm Kao. \n\nThe food is tasty. \nThe people are sweet. Charming even (get it?).\nThe spice level is right, by which I mean it's slightly too spicy for my wife, but that's her problem so no one cares. \nThe place is tiny and cute and close enough to my apartment that I could conceivably walk there in my big stuffed Homer Simpson slippers, and I wouldn't even feel that weird about it. Although, it looks like my feet are stuffed in his mouth, which actually does make me feel pretty weird when I actually stop to think about it.\n\nMy only problem with Charm is the value proposition. \n\nThis is not the only Thai place in the neighborhood, and they suffer by comparison. Not in the quality of the food (which has been solid), but in that they offer smaller portions for higher prices. You're paying more for less.\n\nThe noodle dishes start at $12 (I've enjoyed the pad kee mao and the pad see ew, and tolerated the pad thai), the curries start at $13 (I prefer the red to the green, and haven't tried the $20 massaman shortrib yet), and unlike some of the competitors, don't give me three meals worth of food for each one. \n\nThe duck pineapple curry is $28. It might be my favorite dish from Charm thus far, and it's beautifully presented, even when you take it out...but there are fine dining restaurants in the neighborhood where I can get better executed duck at a lower price point. Is this Long Island duck? Is the chicken organic? Are the vegetables grown on a family farm? I want there to be a reason that the fact that everything 10-30% more expensive than the other places around, while the portions are 25% smaller.\n\nIn a vacuum (or some suburban town), I'd be quite pleased to have Charm Kao nearby, but there's actually a Thai joint every few blocks and while Charm it's good, with so many other Thai options, it's hard to justify paying the markup on a regular basis. \n\nBut it is good.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "It's okay. I had the lunch special pad see ew with Thai salad and it was middle-of-the-road Thai food. Not the worst, not the best. The bigger issue is the price. The going rate for a Thai lunch special in the area is about $9. This was $11.95 + tax. Glad I tried it but there is better and cheaper Thai in the area.", "author": "Jimmy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Charm Kao took over the former Bed Stuy Fish Fry space. There are no other Thai restaurants in the immediate radius, so it's a welcomed addition to the hood.\n\nI ordered the Red Curry and Pad See Ew. I felt like the red curry was a little watery, but I enjoyed all the fresh veggies and the flavor. I thought it was a perfect spice level, but could be too much for those who don't love spicy food. Typically curries can seem fatty and creamy, but this dish actually seemed very light and healthy. I also ordered the Pad See Ew which was good. It also wasn't overly greasy with unnecessary oil. I did think both dishes ($14 each) were priced a little high.\n\nAll together, it's some of the better Thai in the neighborhood! I look forward to trying more dishes and making this my regular Thai delivery restaurant.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-03", "description": "I really enjoyed trying this new Thai spot in the neighborhood! We stumbled upon it as we were looking for a place to eat. Very small place...maybe 4-5 tables. We were lucky to be able to have a table put together for 6. The ladies who seem to manage/run the place were very nice and attentive. Smiling and friendly the entire time. Their menu includes foods from different regions which I liked.\n\nI ordered the Thai iced tea (which was bomb) and the massaman curry. The meat could have been a bit more tender and it tasted a little too gamey to me. The broth was excellent. Paired with the rice, this was a nice dish. I'm interested in coming back to try the variety of dishes this restaurant offers.", "author": "Yasmin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Amazing Thai food! Beautifully decorated and great service. This was a gem nestled into the streets of downtown Brooklyn. Will definitely be going back when I'm in the area again!", "author": "Niklas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "I was tracking this place like a hawk when I overheard during their construction period that this was going to be a Thai place, which this area was in desperate need of. On the FIRST day that they opened, I walked in late, I might have even been the last order of the day, and since that day, every time I walk by, I'm just so happy they're here.\n\nEverything about the place is charming, the people, the decor, the size (they made amazing use of the tiny space).\n\nMy favorite: Pad Kee Mow. Some Thai places don't have it (why? I don't know. It's the best thing), so the fact that they had it was a huge score. When you get the veggie, they still include some tofu in there (YES!), and the veggies they provide are way better (in quality, variety and amount) than most places. And adequately spicy. I tend to inhale my Thai food (because it's comfort food, yo), and let me tell you, even though you end up finishing earlier than you liked, because it's that good, the fullness will hit you.\n\nMango Salad: So good. That's all I have to say about that. It's spicy, it's refreshing. It makes me happy.\n\nSriracha Wings: It's good. And that crisp on it...man. It may be the crispiest hot wing I've ever had. Truthfully, I don't know if I'd order it again.  But if you're in the mood for spicy wings, it's worth an order. \n\nGrilled Pork Skewer: Worth ordering and re-ordering. \n\nChicken Satay: Skipable. It's not bad. It's just not stand out like the other items I've had thus far and I think if you comparing meat on sticks, the flavor on the pork wins out.\n\nThai iced tea: Good. Worth ordering here. Not crazily sweet, not powdery tasting. Very enjoyable (so enjoyable in fact that after the first time I had it here, I had to start making my own Thai iced tea at home because I kept craving it).\n\nI can't wait to make my way through the rest of menu. Clearly, I have many things to hit up, though it'll be hard since I'm so loyal to my veggie Pad Kee Mow, especially since they do it so, so right here.\n\nThey do have lunch specials here, if you're into that sort of thing.\n\nJust a note: the doors need an extra strong pull/push because they tend to suction close. The handles on the outside are also skinnier than you'd like, so you need to really pull.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Thoroughly impressed!! Ordered the pad kee mow - wide rice noodles with egg, scallion, basil, and choice of protein. I got shrimp. It was grilled very well! The noodles we're cooked to perfection with a good bounce. Just the right amount of spice and portion size was good too! It's a small space to sit down but the inside is super cute. Total came out to $14 plus tax and tip. I can't wait to go back!!", "author": "Foodie_Nishi I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "This place is very small! It only has 4-5 tables in the whole place. It seems really new so I guess that's why my friends and I were the only table on a Saturday evening. But, the food was really good and totally worth the wait that it took to get to the table! I got the Drunken noodles (which I always get at every Thai restaurant so I have a lot to compare this dish to). The dish was excellent. The balance of noodles, beef, and vegetables was delicious. The meat was cooked perfectly and the noodles were tasty and well sautéed. I would definitely come back here again and get the drunken noodles! I am interested in trying the other dishes, as well, so it looks like I'll be coming back here more often in the future.", "author": "Matt O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "Great addition to this neighborhood.  The area really needed a good Thai restaurant.  Before placing my takeout order I had just eaten a terrible larb dish from City Point and wanted to make up for it at Charm Kao. I ordered the  Kee Mao Noodles and the Chicken Basil sauce.  They were both very good and the spice level was just right.  I liked that the basil sauce had some diced string bean for some extra crunch.  The portions were good size and not overly oily.   My advice to this restaurant is to be mindful of the oil and be careful of the cartilage in the ground chicken.  I noticed a few bits of it that wasn't chew able.", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-09", "description": "I've been to this restaurant for lunch before and was very pleased with my meal and everything. I saw that they take orders for food delivery so I placed an order today at 7:46 PM. It's already 9:22 at the time of writing this review and I have yet to receive my order. I tried contacting them via phone and no one picks up. I received confirmation from the app that says my order is in the works and that estimated time to deliver was 35-55 minutes. If you're going to offer delivery service, you should at least make your phone available for customers to contact you in case situations like this occur. I don't recommend ordering from this place if this is how they treat delivery service. If you're looking to try them out, you're better off going to the restaurant.", "author": "Chengzhi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "Cute Thai place in downtown Brooklyn. Very small so come early for dinner! Appetizers were excellent. Chicken pad Thai was great as well (wish I ordered it spicy). Going to try the curry short rib next time. Definitely recommend!", "author": "Silas N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "Agree with the other reviews, very good quality, fresh Thai.  Mango salad was delicious (if a bit drowning in the dressing), and pad Thai was nice, as well - except for a bit of a fishy after taste, which isn't my fave..but that's just me.  Overall a welcome addition to the neighborhood!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "This place is an absolute gem. Having eaten plenty of amazing Thai food in Thailand, I can appreciate authenticity when I taste it! I was transported right back to Bangkok where my friends dragged me around sampling tons of amazing food. Same Same! :)", "author": "Max M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "Really enjoy their quick service and delivery. Haven't ordered one thing and not liked it!", "author": "Ezer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "This is, hands down, the best Thai food I've had in New York City since moving here five years ago. I can hardly believe my luck that this restaurant opened up right in my own neighborhood! \n\nWe tried the papaya salad, the tom kah kai, the chicken pad kee mao, and the shortrib massaman curry. Every single dish was a knockout - but we will be dreaming about the shortrib massaman curry until we return (which will probably be embarrassingly soon). The meat fell off the bone, and the sauce was so luxurious and decadent I wanted to drink a mug of it. \n\nFor drinks, we also tried the ginger iced tea (delicious) and the honey lemonade (a bit sweet). \n\nI appreciated how their menu offers specialties from four different regions of Thailand - can't wait to go back and explore. \n\nA lot of Thai restaurants in NYC seem to serve overly sweet food - so I'm really excited to find a place that tastes much more like the food I had while traveling in Thailand.\n\nThe food alone would have made this place a great - but the owner, Angie, and her staff raised the experience to the next level. Angie was so personable and warm, gave us great suggestions on what to order, and made my birthday dinner there very special. \n\nThe restaurant is small - only four tables. I imagine that there will soon be a line down the block once folks start hearing how good the food is. \n\nWelcome to the neighborhood, Charm Kao - so excited you are here!", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "The food is amazing!! I don't remember the last time I had such good thai food outside of Thailand. The lunch special is a great deal and I can't wait to go back! Do yourself a favor and eat here!", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "This restaurant is fantastic! The best Thai food I've had in New York! All the richness without the oiliness!", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-13", "description": "Feel like food was a little better when they first opened, now the Pad Thai is 95% bland noodles. Some other dishes are good, but not as good as they are charging especially compared to the several other thai spots in the area. I am fine with paying a little more for better tasting food, hope dont stop caring completely only after 3 months open.", "author": "Gene P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Charm Kao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "193 Schermerhorn St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/CgVF85ZHqVxLcN-XCFoaBw/ls.jpg", "@type": "Restaurant", "telephone": "+13475991748"}