{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "Updated review as of 6/1/2014: its very sad when when a good place goes bad. The quality of thisbplace has really diminished. Im disappointed that this place has gone down the drain. The quality of the food  is shit and the drinks were watered down.\n\n\nOld Review with 5 w/ stars:  I cant believe I havent written a review for this place. I know I posted a picture anyways. \n\nI love the ambiance at Habana's. The drinks get better with time and I love the fact that real fruit puree is used to flavor the drinks. Writing this review makes me realize that I should have gone to Habana today and try some of the new additions to the menu! I think Habana's is a favorite in my book because I am a secret Lush and the drinks are my best friend!", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "After a show at BAM nearby we wanted to chill and eat at a good spot so we went to Habana Outpost as my friend really loves it.\n\nThis was first time at Habana , the place is nice , very spacious with plenty of outdoor seating and good decor. They also have sitting booths inside. One has to order inside and get the ticket. The order is picked up at the truck outside , they have machines which show your ticket number once it is ready.\n\nWe tried the chicken quesadillas , tacos , corn and margarita. We were actually disappointed with the food and drinks. Quesadillas and tacos were just bland even the margarita was oozing with too much ice and no flavor. \n\nThis place gets 3 stars because of it's ambience and location. I would here buy avoid the foo here.\n\nFYI- Restrooms are unisex", "author": "Vineet S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "Woohoo!  This is my 300th review!  And what better place to review than a place I've been dying to try (even if it means a 3 star review).  \n\nI love the original location in Soho - Cafe Habana and I've been dying to come and try out this place.  We got here around 6pm and the place wasn't too packed.  The place is easily a 5 min walk from the Atlantic Avenue train station/Barclay's so it's very convenient!   There are a few tables inside as well as some tables outside.  The way they have their outdoor seating is very cute.  We opted to sit inside since it was hot.  To order, you order inside and then go outside to pick up from the truck.  There is a box that flashes your order number which really helped and made picking up food really efficient!\n\nThe famous grilled corn - the corn was good, but it was no where anything like the original from Cafe Habana.  =(  This was smothered in an absurd amount of butter and I had to wipe some of it off.  So off with the butter meant I had to wipe off the seasoning/spice + cheese.  =(  I think I will stick to the corn at Cafe Habana instead. \n\nRoscoe on a stick with honey - We ordered this to try since we've never had it before.  It was bland and tasteless.  It's basically a chicken tender with batter around it.  They also gave us some honey, but the honey seemed to be diluted since none of it stuck.  I would give this a pass as well....\n\nPork Platter - I am normally not a pork + yellow rice + bean person, but this was surprisingly the best dish of the night (I was disappointed in my Cuban sandwich too).  The pork was okay.  It was a little dry.  The yellow rice was good.  I didn't eat the beans since I am not a bean person.  Overall, this dish was decent.\n\nCuban sandwich - I love love love Cuban sandwiches.  I had them for the first time at Cafe Habana and have eaten them at Sophie's, Tina's, and Havana Central.  The cuban sandwich here looked enticing, but when you bit into it, it seemed to lack some flavor.  =(  I don't know what it was missing, but it was flavorless.  It was missing something, but I can't pinpoint what it was.  I would give this a pass and go to the above mentioned restaurants instead or better yet, go to the original and get it there!  The pork in the sandwich was also really dry.  =(\n\nOverall, this place was just okay.  I don't think I'll be back since it's not exactly on the way for me.  Even though I live in Brooklyn, the original location in the city is more convenient and I'll just stick to that even if it means long wait times and less seats.  Perhaps the chef here needs to talk to the chef at Cafe Habana to find out what he/she is doing wrong and then maybe I'll come back.", "author": "Angeline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Such a cool place to hang out with friends or go on a casual date night. The outside dining is fun on a summer night. The tacos taste super authentic and are perfect amount of messy. The only think is that they are cash only so make sure you are prepared to spend some money because it's not cheap tacos. I wish they had a little more variety on the menu but that's just me being picky. Will indeed return.", "author": "Cruz Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "Who does cash only in 2015? We had to leave because I'm not paying a fee to eat (they have a atm inside for \"convenience\")\n\nToo bad bc the food looks amazing", "author": "Akua O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "This place is amazing, I love to go here during the dead heat of summer, sit with friends and order margaritas and the Mexican corn. The mixed drinks are pre-made in what I would equate to a New Orleans daiquiri blender, and it definitely brings me back to the days of living in Louisiana. Such a cool place to go to, it does get crazy crowded though, so plan on spending time trying to find a table to sit if you bring a big group.", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-04", "description": "3.5 stars\n\nI really wanted to be a super fan of this place,  but unfortunately the experience was just OK nothing stellar.  The drinks were a couple dollars more than I expected but nonetheless they were good.  $10 will get you a flavored margarita or Mojito. In my opinion the drinks are better when the frozen part has melted away.  Habana outpost drinks can be real creepers so be careful lol. For food, I ordered the hamburger which was actually really delicious and freshly made.\n\n The outside seating is really cool and bright and inviting.  Habana is located in a really cool area in Brooklyn. The way Habana works inside is that you wait online to order your food, pay, and once your food is ready you look on the screen that shows your receipt number and go out to the food cart in the back seating area and get your meal. \n\nThe ambience and environment at Habana is very inviting and laid back. I will definitely come back here to try and see what all the super hype about this place is  because I didn't see it the first time.", "author": "Tashana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Can't wait to go back the drinks are bombbbbbbbbbbb. They're Cuban food is the best I've ever had . You might have to wait but it's deff worth the wait . I recommend it to everyone deff a summer spot has seats outside and very affordable", "author": "K S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "The atmosphere here is fun. I've enjoyed many a margarita outside and felt the sense of giddiness all New Yorkers feel drinking in an outdoor space that's bigger than a postage stamp. Unfortunately the food isn't so good. My husband and I both got ill once after eating here. And NOT because we had too many margaritas. So eat your meal elsewhere, then come for your frozen drink and hope you can snag a spot in the shade.", "author": "Kay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Really good sandwich Cubano (although it's not your real traditional one), and delicious frozen margaritas. The place has a real nice with a fun outdoor area playing Spanish music and plenty of picnic tables to sit on. I really like the ambiance and the food, but I've seen the line that forms at night to just walk in on weekends, and I don't think it's worth that type of a massive line. But, nonetheless, great fast food with a nice chill outdoor area.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "I used to frequent Habana solely for the Cuban corn. And then I learned to make it at home. :D\n\nI always get a frozen mojitos or a \"morita\" (mojito and margarita mixed together).  Their drinks are STRONG!\n\nIt's gotten way too popular for me in recent years. If you come after hours, they have security which leads me to believe they've had some incidents. So when I do come, it's usually early enough to avoid the crowds.  My daughter loves it here. \n\nCash only!!!  \nBut there's an ATM inside. Whether or not is works is the question...", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "This is very lively place. It's has a great outdoors seating area. The seating it's mostly outside and the restaurant is medium size. The food is average and relatively cheap. It's good for an afternoon for drinks and averse food. The decor is very eclectic. Great to be outdoors.", "author": "Diana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "One of the best outdoor seating/hangout spots in Prospect Heights. \nThis place is awesome for summer days where you want to enjoy a frozen cocktail outside and grab a bite to eat. \n\nGrab a table and a frozen mojito and maybe some grilled corn!\nQuesadilla was overstuffed with cheesy goodness! Full bar at your fingertips. \nSelection of hot sauces near the forks and napkins outside. Fun environment. \n\nYou can either get your food from across the street or pick it up at the good truck parked within the outdoor area. It's all self service. \n\n\nGreat for groups and kids.", "author": "Lorenzo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Beautiful and lively exterior seating area, and very friendly staff! The food was great too -- I got the Chicken Guacamole burrito and really enjoyed it.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Good Mexican food, hey have a small menu and it's a self serve place. Try their Roscoe stick!", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "The atmosphere is good - 4 stars for outside, super casual, picnic themed.\nGreat for kids- something to remember if you have kids and also if you don't want to be surrounded by them.\n1 star for wait time- we waited 52 minutes for 2 burritos. \n1 star for cash only- super annoying.\n3 stars for food- it's decent, not worth waiting 52 minutes. Huge chucks of ice cold cheese.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "Have been here many times for their AMAZING sangria and fun atmosphere. The outdoor seating is great and the food is surprisingly delicious (always considered it more of a bar than restaurant but I was totally wrong!) - particularly tasty was the breakfast burrito, Cuban sandwich, and catfish plate. \n\nMade the mistake of trying to get in on cinco de mayo....yeah, not happening. But choose any other slightly off hour time and you are guaranteed an awesome time at Habana Outpost!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-16", "description": "Go for the scene and not the food. \nBasically all the meat is overcooked all the time. The place is wayyy overpriced for what it gives (spent nearly 30 bucks on overcooked shredded chicken and pork) but it is almost like a place to be seen in the neighborhood. Very popular events and outdoor seating (I'll never understand people's love of outdoor seating... it's hot as balls and everyone wants to sit and stew in their own juices it seems. Indoor with the A/C for me please!) make this a great place for kids, a large crowd whatever. The food is just bland and not worth it. The staff is perfectly nice and the place is quirky and fun but for me it's always about the food and I just don't know how this place has flourished as their food is just not acceptable. El Toro two blocks down has wayyyy better tacos to go and La Pequena has better food and you can sit down and dine. \n\nSpend your money at the other local taquerias. Habana is just not worth it.", "author": "Duey Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Cuban sandwich or\nbust because that shit is great\nAnd it's huge as fuck", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Strong margs \u0026 cute ass outdoor seating area! Could you ask for anything else?? Come here with a group there's benches", "author": "Adrea M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}