{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "Are you ready kids?\n\nAye aye Captain!!\n\nI can't hear you!!!\n\nAye aye captain!!\n\nOOOOOOOOOOOOH\n\nWho has the best frozen mojitos in all of BK?\n\nHabana Outpost!\n\nWith corn so delectable and juicy u say?\n\nHabana Outpost!\n\nWith fun outdoor seating, with lotsa tables and shade?\n\nHabana Outpost!!\n\nMakes for a great lunch or dinner that will just make your day!\n\nHabana outpost, habana outpost, habana outpost, habanaaaaaaaaaaaaaa outpooooooooooooooost!!", "author": "Mushki D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-29", "description": "I love the frozen mojitos, and the food hasn't done me wrong.  It gets really packed in the place, but i've never had to wait for a table.  Most people prefer to sit outside; it's a bit tiny, and the experience isn't the same indoors. \n\nI like that it's a \"green\" eco-friendly restaurant. While this doesn't necessarily affect my decisions to choose Habana Outpost over other places, it does make me feel like a better human for supporting an environmental movement while getting trashed.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "This place is adorable!\n\nIts the perfect summer hang out spot. I go here to people watch and enjoy the beer and corn. \nThe seating outside is cafeteria style, so you have to be on the prowl for an empty seat and will probably end up sitting next to random people.\n\nAlthough the corn is not ideal for trying to be cute because it gets everywhere, it's AMAZING.\n\nI've tried the tacos and they were lacking something and on top of that I really wished they'd add cheese!\nI only wish the margaritas were a bit larger for their price, but its a great vibe on a beautiful day!!", "author": "Kaiti S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "This place is so cute!  I love the colors and the seating out back with music.  We had the mexican style corn which was pretty good but I thought they put way too much cheese.  The corn also wasn't the best quality but who doesn't love grilled corn?", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Habana Outpost is an ideal locale to enjoy a nice night out. There is lots of outdoor seating so people can bring large parties and conveniently sit together without needing to move chairs around from everywhere. Normal dinner platos are around 9 dollars while tap beer is 3.50 and margaritas are 8. Overall, this place is very informal and perfect for anyone looking to have some decent food, drink and laughs.", "author": "Maximilian R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "I definitely approve of the waffles on stick. Truly fabulous!  The Cubano is delish and the corn is a total mindf*%#! I suggest stay away from the drinks. The frozen mojito was nasty! Too too sweet! And the six sweet point beer tasted like earwax! Other than such, this is an awesome spot to hang especially come summertime!", "author": "Rosalie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "The corn is super dope!\nThe beer is super cheap!\nand when you pair the two together under a warm summer day you can't lose!!!", "author": "Josue P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "The food is fun, the drinks are fun, the atmosphere is fun. Cactus salad? Refreshing. Corn? Slathered with spicy, creamy goodness. Maduros? Hard to mess up, and they don't mess them up here.\n\nJust remember, while it's a really fun place to relax in the sun on a weekend afternoon or chill with friends at night, just know that the lines get long and the tables fill up fast. So be ready to get there early or wait for a table.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "I came here for a birthday on a rainy day...needless to say we were all inside and there was adequate seating. I wish it wasn't raining so we can sit outside which had PLENTY of tables. We took the large table right when you come in. They don't take reservations so get there early to get the large table if you are in a group. Definitely like everyone said--cash only at this location. You order at the desk, pay first then they call our your name for food.\n\nI've been to the Cafe Habana Location in SoHo--which the SoHo location about 3times smaller=hard to find seats and not good for large groups, and takes credit cards, but has a LARGER menu for food and drinks. \n\nBut I think the main point is to get teh grilled mexican cord (cojita cheese, lime juice and chili pepper powder). The outpost location is $2.75/per corn (sold only as per corn) but the SoHo location is $4.25/plate with 2 corns. It is awesome that there is a location here in brooklyn for this cause the corn is awesome! However, I'd try the SoHo location if you haven't had it before. Even if you can't find seating in the SoHo location, go around the corner to the To-Go section and eat near there on the planters or benches.  Drinks are awesome as well and more choices!", "author": "Lee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Devious cubano sandwiches for a decent price. Outdoor seating really makes this place perfect!", "author": "Greg M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "When I went to high school at Brooklyn Tech, I always ran by \"that restaurant with the truck outside\" on my way to the track, but never got a chance to go there. It wasn't until I graduated that I finally tried Habana, and that was... 3 years ago.\n\nI am obsessed. I love this place with a mighty passion, the food is always delicious; I honestly get the same thing each and every time I go. Guac and queso sandwich? Heavenly. The corn? Amazing. Too bad its closed half of the year, as it is an outdoor restaurant. I love the theme/ambience of this place, I'm craving me some Habana right now :( too bad its December.\n\nI like this place approximately a hundred billion times more than the Habana in Soho. It's less crowded, the food tastes better, and there is way more space.", "author": "Kara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "I love this place.  It's been a summertime staple for the past 3 years.  As scene-y as it is, the food, drinks, and people watching are GREAT.  I went last Wednesday evening with my best friends - it was not crowded, service was great, and the food was super fresh.  I ordered the Diablo Chicken burrito - what a deliciously spicy treat.   As always, the corn was amazeballs!  Thanks Habana for great summer memories.\n\nAvoid the only hitch.  Cash only peeps!", "author": "Tamara O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "I swear the sun shines some days just to make me go to Habana Outpost. It's a great place to sit outside, people watch, drink margs and enjoy the Fort Greene neighborhood. \n\nThe food and drinks are pretty yummy.  And I appreciate they have a \"drink \u0026 corn only\" line.  The lines do get a bit long, so that's a bummer.  As well as searching for a table. I always feel like such a nerd when I'm wandering around checking people out and searching for an open spot. \n\nBut once we settle down, it's great to just chill.  \n\nThe sustainable design really makes for a unique place. They have some of my favorite bathrooms in the city.", "author": "Tina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "please get the cuban sandwich. it's to die for. the grilled corn was a little burnt but it wasn't bad. the steak plate was also good but so little rice and so much beans.  and the frozen pina colada has enough alcohol.\n\nthis place is great for outdoors in the summer. full of art and interesting decor. \n\ni will come back again. bring cash.", "author": "M.L. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "The Habana Outpost is run by the same people who own Cafe Habana in Soho. The restaurant is super simple and verges on divey. You walk in, order and pay for your drinks and/or food from the counter, get your drinks right away and wait to have your name called from the modified kitchen/trailer out back making the food. The seating is primarily in the large backyard concrete courtyard with lots of tables and umbrellas, but there are also a few booths and a counter inside. As they really don't have air conditioning beyond a fan or two so sitting inside while it's super hot outside isn't any better than just dealing with the heat under an umbrella outside. They've got a few great sounding frozen drinks ($8), but I opted for one of their $2.75 draft beers (in 12oz plastic cups), a great deal considering they were good beer choices. I also got their famed Cuban Sandwich ($7.25). They make theirs with pulled pork, ham, swiss cheese, chipotle mayo, pickles, on a slightly toasted roll. I thought the sandwich was great, the meat was seasoned and cooked perfectly and the slight toasting/pressing of the bread added just the slightest extra warmth and crunch to each bite. The sandwich is the same in the city but they charge $9.75 and give you fries with it. I wouldn't have minded more meat but at the same time I didn't think they skimped. I think the place is really good in most aspects but it's got a few little glitches I wouldn't mind see changing (no napkins by the tables, no easy to find trash cans outside, cash only, cook that didn't know one word of English, pricey frozen drinks, and no AC inside). I'll definitely be back when it's nice out.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Best part of a weekend spent in Brooklyn (we were in town for a wedding) -- the chance to check out tasty food!\n\nIt was 100+ degrees the weekend we were in town, but that didn't stop us from sitting outside on the lovely courtyard, next to the fountain. \n\nHighly recommend the frozen mojito but....  O.M.G. the fiery corn on a stick!! You MUST try this. Don't get me wrong, the chicken burrito was good, but the corn! I could've just had 2 of those and been oh-so-happy. Slathered in cheese, chili spices and lime and grilled to perfection.", "author": "Jeska D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "About a year ago, I organized a party there. It was very memorable. i loved the fun/festive atmostphere, vibrant outdoor seats.  I've been there like 3 or 4 times since. Crowd can get pretty outrageous, esp on weekends. One night i came they ran out of mojitos. i had to settle for their sangria, which turned out pretty aweful. As for the food, it's really like a 3 stars. Just ok ,nothing spectacular. The only thing that sticks out is their $2 corn. The food is def better at Cafe Habana, their sister restaurant in Manhattan. I would give them 5 stars just for being the only eco-friendly  restaurant in BK.\nI will continue to go there to meet friends but not when I'm really hungry for some good food.  Good place to chill pre-party.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "This is a great place to come on a beautiful night/day and enjoy some food and drinks. Definitely good for groups if you get there early enough to get a full table.The lines inside are loooong but they move quickly. Frozen drinks are tasty and pretty strong. I wanted a beer and was told that two of three beers on tap were out- it was 7:00 PM. That's where they lost the one star. Other than that, everything was great. Really great food- I've had the grilled corn (add some hot sauce..yum), guacamole burrito, and spinach salad. I'd have all three again. Good vibe, happy people, yummy food! Oh and cash only!!", "author": "Jade B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-24", "description": "The margaritas here are excellent, but I think I'll pass on the food.  This place is in a perfect location by the train and the outdoor space is perfect in the summer.  So its worth a visit but if you want good food, I would not suggest this place.  Sorry Habana Post...I was really hoping I'd enjoy my experience but I didn't.  I tried the corn, which was quite dry.  We also ordered two chicken dishes which were very average.  If they stepped up the menu, I would def return, otherwise I would only come back with a group of friends to drink.", "author": "Nia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I love everything about this place. The whole eco-friendly theme is great and trendy. And the food doesn't suck. I felt like I was in a school cafeteria, saving my own seats for my party, kinda cool.\nDid I mention the food was amazing! That corn was something and the frozen mojitos?! The best. Wait was about 20 minutes but well worth it. About to become one of my favorite summer hangouts..", "author": "Charmaine B."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}