{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "So four years later, I'm singing a different tune about Habana Outpost. I met up with a group of friends after work, and since it was a bit chilly outside it wasn't packed. The spacing/seating was plentiful, and it didn't feel like we were sitting on top of another group. I bet this might change when it's more crowded. The drinks also have improved--I started with the frozen margarita and then switched to the spiked lemonade. The girl behind the counter asked how spiked I wanted it! So of course I said very spiked. The tacos were decent--I had the fish and the pork, and the pork was the clear winner. It was juicy and flavorful, while the fish taco was cold and sad, but I ate it anyway. The atmosphere was much better as well--there was background music and no smoking, and much better eye candy. Service was great--the ladies behind the bar were funny and kept the line moving quickly. Glad I gave this place another chance, especially since summer is just around the corner. Cash only!", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "I didn't know this place was a grab a drink and sit outside type of place. They sell frozen drinks for about 9 dollar and its good. Food was decent. I wouldn't eat here again tho. I ordered 2 taco and they just wasn't good. Also I didn't received cheese on my taco because I didn't ask for cheese which I found very different because what kind of tacos don't come with cheese.", "author": "Renee A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "Fun spot. Solid tacos. Burrito was okay. The drinks and patio make it all come together.", "author": "Chikky T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "After reading other Yelp reviews, I regret ordering the pork burrito because it was cold, dry and overall mediocre. I should've got the steak tacos, grilled corn (which my friend said was amazing) or the Roscoe's on a stick. Loved the vibe of this place though, with outdoor seating and fun music.", "author": "Courtney K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Really delicious food (corn!) , really awesome drinks. Also , great outdoors seating and easy access to public transit (the C line is literally underneath the restaurant). \n\nCan't give it 5 stars due to extremely long wait times and overcrowded elementary school cafeteria seating. Finding seating for a large party (4+) is like Hunger Games or something.", "author": "Dave L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "The vibe and environment is cool, but their drinks and food are way overpriced. I don't think I'd go there again. It's also cash only which is a bit annoying.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-17", "description": "First visit here and I did not like it much. We ordered the steak Plato which comes with rice and beans, very bland. No taste. And served on paper plates. WTF! We ordered 3 corns on the cob. Worst ever. They were raw inside. Very hard. Now the frozen margaritas are weak. Well for nine dollars they can keep it. Let's not forget its VERY LOUD IN THERE. NOT RETURNING.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Nice spot to grab a drink and throw down some tacos, I had the fish and pork tacos.   The fish definitely taste the best to me. Thought the pork aren't bad either.  The frozen mojito tasted like a mint icey to me.   The beers were good the cups are small though.  Overall a nice little spot to talk shit and drink.", "author": "Miguel T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "The food was alright. I was really psyched because of the reviews. I will go on e more time and order something else before I make my final decision about this place.", "author": "Queen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Not gona lie, this is a chill spot on sunny days to catch rays, friends and even babies.  Eco-friendly vibe makes me proud that I am not harming the planet whether I am wiping away grated cheese from Corn or pork juice from Cubano.  \nHowever, saving the earth and a cool chill spot come with a hefty price tag.  A Corn and a Frozen Margarita will freeze your wallet out of 10$.  Or is it a steal?  Regardless, I love this spot and so will you.", "author": "Alexi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "Our summer soccer league playoffs run the semi-finals and the finals on the same day. Meaning, if we won our semi-final game yesterday, we would have to play in the finals immediately afterward. \n\nTechnically, we lost. (It went to penalty kicks.) \n\nBut NOT playing another game in the blazing, 90 degree heat, and instead sitting on Habana Outpost's patio with lips burning from the delicious corn, sipping $2.50 Sixpoints...that tasted like victory.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "My kind of outdoor bar/restaurant. It is a simple place, with basic food like tacos, corn on the cob, burritos and chips. Beers and a couple alcoholic drinks like frozen margaritas. The drinks and food are not that special (Food 3.5 stars- drinks 2 stars), but what makes Habana Outpost great is the laid-back outdoor vibe. There are picnic tables and umbrellas, a nice fountain and it is super chill. You can tell all your friends to meet you there and they won't have a problem getting in, or looking for seating (most of the time).  I have had a birthday party or 2 here and we were able to get in 20-25 people with ease as long as we held down the tables for a bit. There are some weekend nights when it can get a bit busy, but mostly it is not too busy to have a drink and a seat.\nTuesday mornings there is a toddler \"party\" with arts and crafts and water toys. They are kid friendly at all times. There is something for everyone at Habana.", "author": "Saba F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "Absolutely love the food, atmosphere, and more importantly the sustainable and environmentally conscious mindset of this establishment!", "author": "Zak S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "I went there yesterday with 2 friends. We ordered 3 different entrees. All were remarkably bad. \n\nThe steak was lukewarm. Pretty sure it was microwaved. The pulled pork reminded my friend of tuna. The waffle chicken thing was bad as well. \n\nThen we started looking around and realizing the majority of the guests were just drinking frozen margaritas. Maybe that is good, we didn't order drinks but the food is just awful. \n\nIn conclusion, I would just like to say No.", "author": "Albert E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "lovely decorate！！！make you feel like back to childhood.\nback to the taste was great however the meat little bit not enough，still would come again", "author": "Edie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-19", "description": "Cool place to chill if u find a seat, the food is good but I give 3 because they charge 9 dollars for a frozen drink that should be stronger fit for that price and they need more machines to make the drinks they make enough money. Half the time it's not even frozen It's slushy", "author": "Ohso J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "My favorite place to grab tacos and have a good time! The music is always on point, the crowd is fun, and the food.. Mmmmmm! Fish tacos, corn, and a guava Boing! drink is my go-to. My bf had the shrimp plato and enjoyed it so much!", "author": "Farah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "I just had to try the infamous corn on the cob. I regret wasting my money. it was gross in ways I can't describe with words! I think it's just the cheese that comes on it, it was not very appealing to my tastebuds at all!! I don't know if/when I'd go back to try something else.", "author": "Purpose T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "Pretty cool on sunday with the kiddies. They always have free activities. Great frozen margaritas. It does tend to get overcrowded during hot summer nights so i'll stick to Sunday's with my lil one.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "I love finding restaurants that have something more to offer than just the food; as soon as I walked off Fulton Street, I knew I had just entered one of those rare gems! Picnic tables full of activities for kids and adults alike line the outdoor eating area, making you feel as though you've stepped into an old friend's huge backyard for an afternoon cookout of Cuban food. \n\nI knew I'd have to try the famous corn (which is much better than I can possibly try to describe), but my main meal was the guacamole and queso burrito, which was terrific. I always hate ordering the same thing twice when there are so many great options to try out, but I think that this is one of those dishes I'll have to order again sometime soon. \n\nThe fact that the meals were relatively cheap just added to the relaxing atmosphere, which is truly one of the best I can recall from my dining out experiences this summer in New York. My one regret is that we didn't decide to try one of the frozen margaritas or mojitos, which would have been a refreshing and welcome choice on a humid Brooklyn day.", "author": "Alex F."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}