{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "The best place for people-watching on a summer weekend, with some tasty food and a couple beers.", "author": "Dominic R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "How can this place not get 5 stars?! I use to live next door and would go all the time. Not only is it the greenest restaurant/hang out you'll probably ever find, but they have cheap food and good beer and fun events. It's fun to sit outside and enjoy their yummy food on a warm day, surrounded by tropical colors and interesting people. Cheers to doing something different and considering the planet!", "author": "Sara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "Really enjoyed a sunny afternoon here.  The food and drinks were great.  The food was very tasty.  The best was the outdoor atmosphere.  It was a great place to meet up with friends or make new ones.", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-22", "description": "I'm just keeping it real. This place is fine and nothing special. The place is called Habana Outpost, but it's really just commercial Mexican food with a Cuban sandwich on the menu that is supposed to give meaning to the name of the place. The outdoor area is cool, but even on a Tuesday night is near impossible to get a table (like fights were about to break out over tables/table holding). As for the drinks--at least the frozen margarita actually tasted like it had alcohol, but the frozen mojito had none of the flavors of an actual mojito (as in no rum flavor, no mint flavor, not really any flavor at all). The spiked lemonade tasted very...strange? It had a very floral flavor and definitely no trace of alcohol (and I am not much of a drinker, so for me to not notice alcohol in a drink means it really has no alcohol taste). I had the mango salad which was very average--some greens and mango. The chicken taco was ok once I added guacamole to it (paid extra for that). The corn was the best thing I had there. In short, if you're going there to hang, it can be fun if you are able to get a table. If you want Cuban or even Mexican food, you should look elsewhere.", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-24", "description": "I love this place! It's totally cute with the bright colors, lights, and flowers on the painted barbed wire. I loved my quesadilla, the corn really is worth the trip, and hello frozen mojito, where have you been all my life?", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-07", "description": "Habana Outpost is the whole package. Not only does this place have the eco-friendly aspect going for it, but it the food is nothing short of scrumptious and the atmosphere is lively and fun. I'm glad I don't live closer because I'd weigh two tons from eating those corn and cheese curds!", "author": "Suzanne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "this place is so great, I love the corn its really delicious and the drinks are really good. I've never actually had anything else there, so its time to go back and try!", "author": "Alisa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "i am giving habana a 5 because it is so much fun- although i have to admit that i wouldn't give their food a 5. the few things i have tried have been less than impressive but i continue to go back and hang out because it's that much fun. the colorful guests that come from all around brooklyn create such a lively scene of laughter, drinking, flirting, and just an all around good spirited day/afternoon/night whenever you find yourself there! i've had a blast on a weeknight, a weekday, a weekend, a weekend night- you name it. i highly recommend habana for a gathering of friends or for mingling with singles...", "author": "sarah m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-02", "description": "AWESOME!! what a great find! The food is amazing and even better is the place itself.  It is so eco friendly- with highly informative recycling stations and lots of cool signs.  It has an outdoor area to eat in with a fountain in the middle.  the kitchen is a taco truck that you go up to directly to get your food.  cheap too!", "author": "Gaby W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "Have the corn! It's delicious!! \n\nI loooove that they're doing so much to be \"eco-friendly.\" They were even willing to give a little tour and talk about all the green stuff they do for a class of 7th graders from the school I used to work for. \n\nI've seen a fashion show and craft market there and I think they do all kinds of events besides just serving up some yummy food and drinks.\n\nThe only downside is the very limited indoor seating - not a good choice for a rainy day and not even open during winter.", "author": "Becca P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "This place has great frozen mojitos and margaritas! It has Eco friendly events and set up. Don't leave without trying the corn!", "author": "Paola G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "The food is really really tasty. But, unless you live in Ft Greene or Prospect Heights, I'm not sure it's worth the trip because of the hassle. When it's crowded or even not, it takes forever to get your food. And the self-serve system is a complete hassle. And it can be very loud on nice summer days. But if you can go when they're not crowded, it's pleasant.\n\nIt's cool that they don't use any electricity -- I like that. And the drinks are fantastic!", "author": "Josh H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-17", "description": "Cute hipster-ish hangout in Brooklyn.  The food was not something to write home about - pretty standard.  Definitely a little more pricey than I imagined or thought it should be.  \n\nBut the outdoors area is really fun during warm weather.", "author": "J J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "hurray habana outpost!\n\ni give five stars with no reservations to this place.  love the $2 beers, the killer mojitos and margaritas, sitting outside, etc etc.  food is fine but i come here to drink with pals on a warm night.   and awesomest of all is their rainwater catchment system, composting, biodegradable utensils and other green features.  hopefully this place will serve as a model for other restaurants to operate more sustainably...\n\nthe only bummer is that i always think to come here on a tuesday when they happen to be CLOSED.", "author": "rc c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "This is very cute, eco-friendly lil' joint that only runs on solar power which explains why they're closed during the winter season.  My siblings and I ordered corn on the cob, chicken burritio, catfish burrito, and grilled chicken sandwich.  My favorite was the grilled corn on the cob!  I thought the food porportions were a bit small for the prices, but overall it was a neat experience.", "author": "Mui L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "The frozen mojitos = PURE PLEASURE LOL . It's a great place to chill after-work or on the weekends with friends . It gets packed \u0026 is completely solar so it gets warm inside. There is a courtyard to chill in too though and on weekends there's a DJ .", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "I would really like to give this place an awesome review but there are some things that stop me.\n\nI will give you the short of it...\nThe atmosphere is awesome, sitting outside hanging with friends, awesome\nThe margaritas, though come from a machine, are pretty good and have a good punch to them\nThe whole place is eco-friendly\n\nBut the food...the food is made in a truck and tastes like it.  The food is not very good.  I have eaten here about 4 times.  Each time tricking myself that the food wasn't that bad, but each time I find the same nasty food before me.  If you must get something to eat here and you don't mind the calories, order the corn on a stick.  Though it is dipped in butter and cheese it is good.", "author": "spazzy p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "This is one of the most awesome places for the summer. Good quick food... outdoor seating, socializing, drinks... great for friends. The margaritas are alright... I always enjoy my time. For a date or with a group, I enjoy. A little expensive for a place that makes it in a trailer, LoL, but worth it. I love the outdoor bathroom the recycles water... I always feel like I'm doing my part while eating good.", "author": "Oakland L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "i love the fact that this is where the soulful brothers and sisters and the ridiculously outfitted hipsters all congregate. i never knew you had to be cool to eat here.anywho you cant go wrong with a place that filters rain water.no but seriously this place is cool and nice to sit out during the summer although not a great idea to have steel/aluminum furniture in the sun during 80 degree weather.my dog like the fact that he could drink from the fountain. cuban sandwiches were ehh.. corn was pretty good", "author": "Manny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-19", "description": "just pure and simple greatness here!!! For your buck this place is well worth it, if you read all the other reviews there is ALWAYS a line. and try the corn on the cob, just yummy!!! for one person you'll prob spend 15-20 bucks a meal. drinks are great too. The decor has a summery feel, very comfortable. no credit/debit cards. only cash.", "author": "Krish D."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}