{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "Food is decent but not worth waiting 50 min. Line situation to order is out of control. Chipotle makes a better burrito. If it wasn't for good music and a nice outdoor atmosphere they would get zero stars.", "author": "Dan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "I can't say enough wonderful things about this place. One definitely has to experience it for themselves.\n\nI have been going to this eatery for years hence I am surprised that I had not yet written a review. I love how the main dinning room is outside making this an ideal summer night venue. You do not need a reservation and you pick your own seat making this place a socialite's delight.\n\nThe drinks are amazing and large. You definitely get a good bang for your buck. The food prices are also affordable making this a great get together with others spot. If you only want take out they have a spot across the street where one can buy.\n\nOn Sundays they play movies outside which again adds to the personality of the eatery.\nPlease note that there is security on the premises and you do get asked for ID when walking in.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "In the eighties this spot was a vacant lot with over grown weeds and a wooden chained linked fence.\n\nNow its the spot......roasted corn, margaritas, and fish tacos on a warm pre-summer  evening in a hip and happening spot just made my Saturday awesome. The music was hitting a variety of top 40 and R\u0026B. I heard Biggie dropping bars (Ebonics for rapping over music) begging us to give him one more chance and the crowd of hipsters went wild.\n\nThis is the neighborhood Ft. Greene hang out spot...communal seating and picnic tables make this a cozy spot especially at night when the out door lighting is shimmering through out Fulton Street.\n\nI would have given it 5 stars because of  the friendly customer service, that local vibe, and the food was awesome. However because of the wonderful weather and the overflow of hipsters we had a 45 minute wait time to the table. \n\nCome thru and order an Margarita or two, oh and bring cash because they do not take debit or credit cards.\n\nI was too busy bumping my head to The Notorious B.I.G to take pics, maybe next time because I will be back!", "author": "Letty C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "A slice of el cielo cubano in the heart of Brooklyn--who knew?\n\nAs a Miamian, I think I know a thing or two about Cuban spirit and while this place doesn't offer an entire Cuban menu, it's vibe is Little Havana af. Frozen margaritas, I've heard of, but frozen mojitos? Yes please! \n\nMy friend and I initially approached this spot with the idea that we wouldn't even feel a buzz because most frozen drinks are typical diluted but we were both pleasantly surprised by the buzz the small cups gave us.\n\nThe drinks were cool and refreshing and very much needed during a heat advisory. \n\nTrying the grilled corn is also a must, especially if you enjoy spicy. Beware, you will get messy.\n\nTL;DR refreshing drinks, delicious food, and fun Latin/Caribbean vibe with outdoor sitting that felt like a patio party complete with colorful banners and salsa playing. \n\nStepping into Habana Outpost feels like stepping into my childhood best friend's Cuban birthday pachanga, except this time I get to enjoy the drinks. What's not to love?", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Sunday nights in Brooklyn calls for seeking out hidden gems! We ordered two catfish tacos, one chicken burrito to share and of course the Mexican corn! Two of those please! \n\nAll the food is made and picked up outside in a trailer. Pretty cool vibe, outdoor seating while you enjoy a frozen pina colada and a movie! Can it get any better than that?\n\nIn terms of food, the corn was ok, just because I think they applied too much mayo to help the cheese to stick, there was big chunks of mayo on the corn. The catfish tacos were tasty with some hot sauce! I enjoyed it because it was not overly breaded and not fishy. The chicken burrito's rice was too mushy. The chicken was seasoned well but it was too dry. However I enjoyed that they put sauteed green and red peppers in it. \n\nIt's a pretty cool place for a quick bite. I would recommended their fish tacos and for my hot sauce lovers, there have three types there!", "author": "Kelly Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "There are many things people associate with summer. The beach. Picnics. The park. Baseball. That time you killed that drifter when we were driving after the prom. I think of Habana Outpost. I love coming here on a nice day to eat some awesome food and take down some tasty drinks.\n\nThe best Cuban sandwich, EVER. No one else can compete. One of the best guacamole's too. I'm not a big corn person but people come here specifically for the corn. They have Mojito's and Magarita's, they even do a combo called a Mojarita. They have brews on tap. They'll usually have Kelso and at $3.50 a beer, it's not a bad deal. Bottles are $5. They have Sol which is one of my favorite Mexican beers. They sell buckets, 4 bottles for $17. For someone such as myself, it's not a bad idea. Especially with...... the lines.\n\nIf there is a downfall for this place it can be the lines to get food and drinks. They have two lines. One for just drinks and corn. Another for everything else. They can get quite long at times. I highly suggest you come here with a squad of people. Habana Outpost has a huge picnic area that is outdoors right on the corner of South Portland and Fulton. You want your crew to hold down a table or two. You also want to rotate who is getting drinks. Because by the time they get the round of drinks back to the table, someone else should get up and go on line. \n\nBathrooms are cool. They're eco friendly using recycled water from rain. The look of the place is beautiful overall. They also get brownie points for having a bat mobile kiddy ride. I'll be sure to get a picture of me in it next time I'm there so I can post it. \n\nEvery Sunday starting May 5th, they play movies outside.  \n\nIf you're looking for a great place to enjoy the sun, have fantastic drinks, eat delicious food and be part of Fort Greene's cool hip scene, come down to Habana Outpost.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "I live near here and I've always been curious to try it, because during the warmer months their outdoor area is packed and festive. I went for lunch today, and I'm sad to report that it wasn't very good. I ordered a chicken quesadilla, corn on the cob and a frozen margarita. Everything was average - nothing special about it in terms of flavor, preparation or presentation, and for less than half the price I could have ordered exactly the same thing at a better restaurant up the street. The tiny frozen margarita should not be 9 dollars - it should be 5 bucks tops. It was overly sweet and I'm unsure if there was much alcohol in it at all. I couldn't tell through all of the sugar. \n\nOne last aside: For the amount of business they do, they also should take credit and debit cards. It's obscene how many businesses still get away with cash only in a thinly veiled attempt to hide profits from the government. Management: Nobody carries cash anymore and they're onto you - start offering credit cards as an option.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Havana outpost has taken over the entire block and we loved it! 2 locations across the street from each other one was habana to go and looked like the one in NOHO and across the street there is the outdoor seating one. \n\nWent to the outdoor one on a Friday night and boy was it packed! Every seat outside was full and there was even a bouncer at the door. Every person had a margarita in hand and looked like they were having a really fun time. \n\nWe just ate the food and as always the cheese corn did not disappoint! Wait time was quick for the food, and found a seat inside behind the registers. \n\nGood prices good food and good vibes. \n\nOne star removed that there was no space outside, maybe take reservations for some tables outside so that new people can come, it seems as though people were there for hours in one seat, so new people just had to stand around. \n\nCash only fyi !", "author": "Anna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Todos los noches, donde esta el bano.  Mi gato es muy frio, por favor amor.\n\nOK, Ive gone through every Spanish word I know to form the worlds worst sentence.  No, this post is not to highlight my command of the Spanish language....but to emphasize the feeling you get from Habana Outpost.  MUY CALIENTE!!!!!!!!\n\nSomewhere, someones abuelita is having heart palpitations, my apologies.\n\nOn to el review (didn't I say I already used all the Spanish words I know?)\n\nI LOVE Habana Outpost.  How much?  We came here twice in 4 days.  \n\nCORN - Oh Em Gee!  Amazing.  Its sweet, salty, HOT, its delicious.  Seriously...this is really the star of the show.  It reminds me of my days getting the Latin corn from the Ice Cream Man.  Sanitation was of no consequence back in the day.\n\nBurrito - the burrito is HUGE.  \n\nDrinks - Mojitos and Margaritas are DA BOMB. Get you 5.  \n\nThis is a great place to bring the familia, the scenery is great and in a cool neighborhood.  Come.  Eat. Be el Merry.", "author": "Amaya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "This is one of those places that you go to and think about when you're gonna come back. It is adorable. I went a week ago with my bestfriend and we each ordered a frozen drink (Margarita for her and a Mango Mojito for me) two of their famous corn each (super greedy) and a shrimp taco. The taco was BOMB.COM I wish I'd ordered multiple of those. I am typically wary of ordering tacos because it's either mystery meat or the tiniest bits of seafood. Not here, there were 4 huge shrimp in each. Probably more shrimp than tortilla. The corn were a bit underwhelming, it was the first time I'd ever had Mexican street corn from an establishment but for my taste there was just too much mayo on theirs. It was a struggle to get through the second one. The drinks were good, we were satisfied with one each. But the true gem with this place is the outdoor space. Walking through Habana Outpost I immediately thought up reasons to have my friends meet me there. It is the quintessential summer garden establishment.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "Took about 3 years, but I finally found the time to make it to Habana Outpost when it wasn't crazy packed (Friday afternoon).\n\nGet the frozen margarita. Get the spiked lemonade. Both are delicious. I especially liked the lemonade because I heart ginger beer.\n\nAlso be forewarned that the sandwiches are HUGE. Especially the diablo chicken sandwich. It wasn't as spicy as the name suggested, and a bit dry. But some extra hot sauce took care of that. Oh! That's something else to like about this place - lots of hot sauce options (and by a lot, I mean at least 3). The Cuban was also pretty good, but could've used less-soggy pickles.\n\nWe also had the Roscoe on a stick. It's not quite a waffle on a stick (more like pancake batter), but surprisingly, the fried chicken inside was still crunchy. Great texture, though the dough is a bit heavy.\n\nOverall, it was a very fun experience with one main exception. We ordered the corn and asked to have it cut in half. The girl who took our order said it'd be no problem and put it on the receipt (there was obviously a button for it). But when we picked up our food from the truck, the guy inside refused to cut the corn for us and said they \"don't do that\". It was typed out on the friggin' receipt. Not even that, but it would've taken two seconds to cut instead of arguing with us. That dude needs some customer service training.\n\nOh and cash only!!!!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Love the concept and idea. Fun and easy, low key. Nothing pretentious. You can bring your kids too. And of course the food is great.", "author": "Joanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "I love coming here. Can get crowded but food usually comes out quick, the drinks are delicious. They're open late and have nice, chill outdoor seating. No table service as far as I know, so pay attention to your number getting called. They also have other events for families and adults so check out their calendar.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "Ordered food from this location, and have to say the food was really tasty. I had the catfish with rice and beans ($11.50-ish). So why 2 starts? The portion size I got was really not worth the price. This was the first time im having their food so I dunno if they had a bad rush, or they ran out of rice and beans or this is it. Maybe you can let me know from the he picture. But overall, if the portion was a bit more reasonable (where I'm not scavenging for more food after finishing their meal) then the stars would definitely go up.", "author": "Masum C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Nothing like mojitos and margaritas on the patio. Great vibe here! Be ready for long lines for food tho!", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "I've been here more times than I can count over the past five years and have only had minor issues with it that I overlooked bc of the fun, sunny scene. However, my first trip this season was shockingly bad and makes me not want to come back. Our simple order did not come out after waiting forty minutes. Then we waited in line to find someone to cancel it for us. During the time we waited to cancel the order still did not come out. Then no one was able to cancel so we will return to get our refund later (we had places to be so couldn't wait any longer to not even eat). Sad that I had such a crap experience at this charming spot in my neighborhood.", "author": "Catherine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "It's something chill to do on a warm summer night \nI went there on a Tuesday night it wasn't too crowded like I usually see it crowded on a Friday night \n2 drinks and 2 meals came down to $35 not bad \nThe staff is nice and friendly the food was good fresh and made to order \nI will go back \nThe only bad part is they don't accept cards", "author": "Myrisse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "One of my summer go tos the fish tacos and the loaded corn with queso and mayo is life. Topped off with a frozen margarita. They have outside sitting in the summer and it really does remind u of an old rustic authentic taco joint right in the middle of Brooklyn. Me n and friends come here all the time but mostly in the summer. The food is made to order so u wait patiently until your number is called.", "author": "Jenny T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "I love coming here for after-work drinks or weekend pre-game!\n\nFood- LOVE the grilled corn! I'd rather eat this than anything else on the menu\n\nDrinks- I love the Sangrita (Sangria mixed with Frozen Margarita) it's the perfect amount of sweet, tart, and it packs a punch. Didn't care too much for the Mojito, the mint flavor was overpowering\n\nAtmosphere- I love that it's an outside patio, and it also has limited seating inside. The crowd is usually mid 20s early 30s and ranges from couples to large groups. Definitely a great casual spot for a quick bite and yummy drinks.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "This place is great. Great food, great service, great place to day and/or night drink. \n\nBEWARE: this place is cash only. \n\nA lovely Cuban/Mexican restaurant in Brooklyn with a great outdoor seating surrounded by a high chained fence where you can people watch. There is a subway station just outside the fence, making it convenient for those who don't live within walking distance. \n\nThey also play movies outdoors on Sunday evenings against the adjacent wall of the restaurant.\n\nNow, for the food. The Cuban sandwich was one of the best I've ever had. And I've had quite a few. I really dislike pickles, so I judge Cubans by how good they taste despite the pickles. This was just one of two sandwiches that passed the test and raised the bar on my Cuban sandwich expectations list. \n\nIf you ever find yourself wandering Brooklyn in search of Mexican/Cuban food, head to Habana Outpost!", "author": "Christopher G."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}