{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "The place is cool for drinks with friends, but the food was a big let down. I don't think I would go back for a meal, but maybe for a margarita.", "author": "Thiago F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "No ones winning any awards for passionate cooking (or cleaning, or greeting) at this place, but it's a fun, chill place to sit outside and enjoy the outdoors.", "author": "Liza K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "I really don't know how their food can be considered Cuban when they offer quesadillas, chicken \u0026 waffles on a stick, and burritos as menu options. 90% of their food is terrible. I've had their burritos and sandwiches and they're never good. Everything in them tastes separate and doesn't blend as one. They do have taste margaritas and frozen mojitos, and their corn on the cob is mad good too. I think most people come here for the social atmosphere though. People get dressed up to be seen when they come here and the people that work here are very nice, especially Jessie at the front counter. \n\nI'd recommend it for the social scene and outdoor space, but you should skip it if you want authentic Cuban eats.", "author": "Corey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "This place is great! Awesome food \u0026 cheap but strong drinks. (8$) I love that you pick up the food from a food truck in the backyard, how cool is that!? The back yard is filled with tons of seating\u0026 solar powered lights. Awesome spot!", "author": "Aisha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "The roast pork is AMAZING; the taste, the texture, the smell....it's the best, if you like tuna fish. Save yourself the disappointment, avoid this spot and go explore the countless other places that are worth your time in Park Slope.", "author": "Andrey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "I'll first start off with this is Def something different but in a totally great way. When walking in I didn't expect much but their Margaritas we're really really good. The food was ok but the drinks we're on point. I had the guava margarita while my gf had the mango margarita. They both tasted delicious and just enough tequila. I'll be Def coming back for the drinks and the food is decent.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "We love this place! A must in Park Slope and P Heights. The Jicama salade is amazing along with the rice and beans!\n\nThe decor is beyond cute and a great place to have a wonderful meal by yourself or with friends. The Staff is sweet! They could be a bit kinder with the to- go orders.. \n\nYet, it is all worth it.. Salute!!", "author": "M R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-11", "description": "The corn is good but it's better after a few drinks. I had a frozen mojito which i gave away because it tasted of cheap liquor. \n\nI went back a second time \u0026 tried the steak taco. I wouldn't even call that a taco. It was more like a few pieces of meat on a thin soft taco shell. It came without lettuce, tomatoes, nothing. There was some kind of salsa on it but it didn't add much to it at all. \n\nI will definitely go back again in a drunken stupor for the corn. Tip: If you don't like spice, tell them to hold on the cajun pepper. They put it on the corn along with butter \u0026 cheese. \n\nAlso, this place is cash only but they do have an ATM in the place that costs $2 per use. Why they have an ATM but don't take cards is mind boggling to me.\n\nAs for the service, you order your food inside \u0026 wait outside for your food. The girl inside taking the orders was slow as molasses \u0026 spent way too much time chatting with her girlfriend instead of taking our orders. \n\nGood customer service is so hard to find these days but on the strength of the corn, I will be back.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "The Cuban is everything you could imagine and more. The corn is a must have! Do not leave without have the corn!  Great atmosphere and location! Outdoor sitting is nice during good weather! Enjoy!", "author": "Alycia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I love habana but its upsetting that they dont accept credit cards. On another note they have some of the best mexican corn ever with the perfect amount of queso fresco and cayenne pepper. the layout is really cool and they are always so eco-friendly in all they do. With huge solar pannels and cool bathrooms they do try their hardest to support the environmental cause a lot. i enjoy their  food and its such a cool place to hangout and it usually packed so seats are few. Habana is a huge part of Brooklyn culture and everyone should try it. First solar car restaurant in NYC.\nPS. Their also locations in Manhattan and Malibu", "author": "Isaiah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Great chill spot.  Even without a full bar they're still awesome.  I love habana outpost", "author": "Ronsheeka H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "After years of walking past this place, I finally go in, and I'm so glad I did. The timing was perfect--free movie night--and the food was delicious.", "author": "Camille M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "This place is so good. My friend took me here a few years ago and from that point on I've been a fiend for Mexican Street corn. This place just has a cool, hipster vintage vibe. It is so the place to be on a nice day in Brooklyn. Seating is always an issue since it is popular place but if you wait 5-10 minutes, someone is always leaving.  This go round, I got 2 elotes, and a veggie taco. The taco was disappointing in size but not taste. But for $3, I am not getting it again. The corn was superb as usual. They do offer a variety of other options to choose from so I will be back!", "author": "Kamilah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-16", "description": "It was ok.  I came here on Saturday around 11:30a with a group of 12.  There weren't many people which was good for us.  I had the chicken burrito, roscoe on a stick, and mango juice.  The burrito was ok, I thought it would have been better.  The chicken was kinda dry, so I added some hot sauce to it.  The rice was pretty good though.  The roscoe on a stick was only ok too, not bad, but not great.  Mango juice was pretty good, tasted like a straight up mango, pretty sweet though so beware.  Tried a friends fries and they were good.  A friend had the cuban and said it was good, so I'll try that next time if I come back.  Overall, the food was just ok.  Not sure if I'll be back though.", "author": "Tammy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-19", "description": "This is a cute little spot. The food is tasty and the drinks are good. On a beautiful day, it's nice to sit outdoors, enjoy the food and take in the Brooklyn scenery. This place is kid friendly so there may be lots of kids running around on Saturdays.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Food and drinks are okay. The pompous jack-ass who claimed to be the owner threw my wife out of the place for asking about her order after waiting an hour and a half with two kids and no warning that there would be a wait. He's an embarrassment. They need help. I'll never go back and I look forward to the place imploding under his amateur-hour tough-guy act.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-15", "description": "I was invited here for a block party that Habana Outpost was throwing, and man, was it a fun time!! What I respected and loved about this place, is not only their fun and happy environment, but that this place is eco friendly. Outside live music is playing, and it was solar powered. They enforce recycling, and inside they have BEAUTIFUL culture shrines (check out my pictures for examples)\n\nHabana Outpost had a party outside, with LIVE Salsa music, drinks and food. There was a lot of salsa and merengue dancing going on, and everyone there looked like they were having a good time. I went inside before enjoying the outdoors to grab a bite to eat. Being that everyone was outside it wasn't hard to find some seats indoors. Be prepared to stand on line during their busy days (weekends). \n\nHere is how it works:\n1. There are two registers.\n2. Register 1, you can order food and drinks.\n3. They will give you a ticket, and you will walk outside to the food truck, and they will pass you your order.\n4. Register 2, is for their specialty corn and drinks only, so if you want to skip out on a meal, that's the line to go to.\n5. Grab your food and drinks, and enjoy the best spanish food I had in a while (excluding my grandma's cooking :cough:)\n\nI ordered the margarita ($8.00 \u0026 worth it), their \"specialty\" corn, the \"Best cuban sandwhich in NY,\" and my sister ordered a burrito. All of this was good to share between 4 people. And DAMN, was I SATISFIED to the fullest!! The cuban sandwhich is to die for, and the margarita just downed that so well. I noticed that their Brooklyn draft beer is only $2.75...that's a steal for all you beer drinkers ;) Bottled beers were from $4-$5. Not so bad either.\n\nAfterward, I walked out, and enjoyed the live music, sipping on my margarita, and busted a few moves for the hell of it. \n\nYou want some spanish food? You want cheap food and beer??! Go here.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "This place is pretty cool. Went here on my last day in NYC and im glad I got to see it. \n\nI would describe it as an outdoor bbq. except with tacos and margaritas? \n\nmusic, drinks, MEXICAN CORN, picnic tables with umbrellas, mixed groups of people.. \n\ndecent place to stop by if youre visiting.", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "This place has the BEST frozen margaritas in town, in fact one cannot simply drink one!!! They also have amazing grilled corn that's made to perfection and many other tasty selections on the menu. The prices are very affordable and the atmosphere is so welcoming. I've been here numerous times during its open season and it's definitely one of my favorite places.", "author": "Chantal-Annik E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Habana Outpost is a eco-friendly and lively Cuban spot on Fulton Street. It is a completely unique dining experience.\n\nAt Habana Outpost, you wait in a line to order your meal. Note that there are two different lines - one for food and drinks, and one for food and corn. You order your food at the counter, and then go find a seat and wait for them to call your name.\n\nHabana Outpost has indoor seating, but the outdoor seating is where the party's at. There is a huge outdoor area with lots of seating and large umbrellas and awnings. A DJ plays music in the background. On some nights there are movies and other events. People stay for hours to talk and drink and eat. This is the epitome of a cool neighborhood hang out. There are always a lot of locals as well as a few people coming in from the city. \n\nHabana Outpost has a lot of different Cuban food. They offer a variety of mojitos (a good portion of the patrons were drinking them) as well as hard lemonade and some beer. Their food was delicious. The build your own meal is great, but so is ordering a variety of things. My friend and I ordered a ton of food. We ordered the catfish tacos, a cheese quesadilla (for yours truly, the vegetarian), and chips with delicious guacamole. And for those of you familiar with chicken and waffles, I highly recommend Roscoe on a Stick, which is literally a chicken stuffed waffle on a stick. \n\nOverall, this is a great casual spot that can fit lots of people and is perfect for grabbing a bite to eat outside.", "author": "Jacqueline M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}