{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "I'm a big fan of this place!\n\nIt's not exactly the healthiest of foods, but if you're willing to let go once in a while and have a cheat meal, this place and its food is a perfect fit. The place is definitely distinct. In fact, it actually stands out from the rest of the neighborhood, to the point of us wondering whether or not we're still in Brooklyn. Okay, maybe not that extreme, but it is very charming and chill.\n\nIt's cash only payment with pickup in the courtyard, from a permanent looking food truck facade. Just be sure to keep your receipt, as your number is lit up and you need to hand it in. When I picked up our order, I felt like a little kid looking up to reach the counter and the tray. I bet you that there was at least one person who had mishandled the tray and have had it fall, but hopefully not on their face!\n\nThe steak burrito and cuban sandwich we ordered didn't look like much, but chowing down brought flavortown to our taste buds. I dislike pickles alone, but felt that the cuban sandwich could've used more. The steak burrito was satisfying and the steak wasn't tough, but nicely flavored and tender. We had beer as it was $5, but the frozen margaritas were close to $10, which is a bit pricey for me.\n\nWe'll definitely come here again and get the Mexican corn, which is super tasty.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "Tacos tacos tacos.\nI'm all about their tacos here, especially their fish tacos.\n\nI came here to meet up with a date on a random weekday night. The atmosphere is fun and vibrant. They have a cute huge outdoor patio that is great for summer nights. Unfortunately the night I came was a little chilly, so I was relieved i was wearing something with sleeves. Their outdoor seating was much bigger than their indoor, so i'm sure it gets packed during the cold winters. \n\nIt's not your \"wait for your server\" kind of environment. You order your food up at the kitchen window and wait for your order to be called (or yelled in this case). \n\nI ordered the fish tacos with a order of corn (a must try, so i've heard) and my date ordered the cuban sandwhich. Both were very tasty. I wasnt able to finish the corn, as seasoned and flavorful as it was, mainly because it's awfully hard to eat corn on the cob in deep conversation. \n\nOverall, the place was decent. I could imagine it being fun on a hot summer night with a bunch of friends to drink and hang out. Not the best tacos i've ever had, but it sure satisfied my cravings.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "This romantic place combined the tasteful dishes and a good atmosphere. I like fresh, super tasty and great vibe.  I like to come here with a book and take/have a cup of my favorite Mojito. \nEvery day, I discover something new. This week my favorite is Cubana. Yummy!\nThe beautiful design of this cafe makes this place a pleasant one and besides the good coffee served here you may enjoy several tasty cakes or salads. Do not hesitate to visit this cafe!", "author": "Allie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "I loved Habana . Great music , great vibes and great food . The lines can get really long but be patient, it's worth it . I got the chicken quesadilla and it was delicious.  And margaritasssss ! Great place for a group....", "author": "Nancy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Habana Outpost\nNY BK Fort Greene\n7:30p Sunday 31st July 2016\nThree Stars\n\nThis seems to be the happening place in Fort Greene. We went inside and waited in a little long line to order. It moved pretty quickly. \n\nTip#1: It's cash only. \nTip#2: keep your receipt to get your food\nTip#3: wait by the food truck outside bc the name and numbering system was not a well oiled machine. I wouldn't trust the DMV like number display board with your number. \n\nThere is a lot of seating outside but it wasn't that easy to get a picnic table for four. \n\nThe corn which was boiled and charred with torched. There is no way they actually grill it because it had no smoky flavor. The butter, mayo, cotija cheese, and chili powder had a nice flavor. \n\nThe Roscoe's on a stick is a bit misleading. It is shredded chicken fried inside of waffle batter. The chicken is not fried chicken. The \"waffle\" didn't have the waffle pattern and taste more like funnel cake. They do provide you with some tasty sticky maple syrup which is just like the real Roscoe's. It was cool novelty food item but not very impressive in the taste department. \n\nThe Mexican food was actually pretty delicious. I had a plate of pork with black beans and orange Mexican rice. The pork was tender and flavorful. I wish it came with some green salsa. I actually enjoyed the fluffy rice and flavorful beans as well. The shrimp were overcooked but had a nice grilled flavor. \n\nIt was also movie night at 8:15 (sunset-ish time). They were playing Jaws 2 which was an odd choice since I thought Roy Scheider killed the shark in the first one.  \n\nOverall, it was a decent place to eat but pretty fun to drink and hangout.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Who doesn't like Habana Outpost? Like, for real? \n\nWhenever i'm in town, i'm all too happy to stuff myself with their rice and beans. Wrap it up nicely with a few cups of their spiked lemonade, and i'm good for an evening of shenanigans.\n\nTheir outdoor space is nice if you're looking to be social and loud; and their indoor space is good if you want a mellow space for a date or a nice chat with a friend. \n\nWhy not 5 stars? Cuz the germophobe in me won't let me live. The straw dispenser releases straws that are not wrapped, and no shade to the lovely young ladies manning the bar, but if you're handling money and whatever else, i don't need your albeit beautifully manicured but germy hands touching the top of my straw. Not exactly sanitary. In addition, while i realize that they're going for the whole cantina vibe, containers where all the patrons on the planet must stick their hands in to get their preferred forks and spoons just makes me think of all the superbugs that emerge like once a year and they're often traced back to some place where too many people are sharing too many germs. \n\nSo, if you can get past some of these aforementioned reservations and you're craving some Latin-inspired food in a jovial setting, Habana Outpost just might be the spot for you.", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "Use to be alot better when they firat opened.. The food is not as good and the crowd isnt either.. The drinks however do  not disappoint.", "author": "Mayra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "\"Best {Cuban} in NYC\" they claim.  Eh.  I think not, Habana, I think not.\n\nHere's what I didn't love about my cuban sandwich:\n\n- The way it's constructed.  \nIt was basically a slip and slide.  Ball of pork in the middle surrounded by a thick slice of ham and a serious helping of chipotle mayo so the bread had nothing to hold on to.  The pork slid one way and the ham another.  I ended up eating most of the sandwich with a fork and knife.  :-/\n\n- The lack of cheese.  \nI'm not saying every sandwich needs a ton of cheese - but the Cuban needed more than a couple little pieces.  Not even slices - pieces.  Not nearly enough cheese. \n\nThe visit wasn't all bad though.  Here's what's kinda great about Habana: \n\n+ The Pineapple Ginger Lemonade is super refreshing.  \nI felt like it lacked the pineapple the name promises but I still liked it very much.  I'd drink a pitcher of it if it was available. \n\n+ The décor and vibe of the outdoor space.  \nIt's like walking into a backyard fiesta and that's awesome.  Colorful tables and chairs, umbrellas.  I love that you order inside and then grab your food from a 'foodtruck' window.  The whole atmosphere is awesome.\n\nI'm not giving up on Habana just yet... I'd like to try a couple other items on the menu.  But for now it's a solid 3-star establishment.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "I love the tacos here. My 4th time coming so why not write a review. I brought along my 14 month old son and he loved it. He ate his food and he's picky. I had two fish tacos with corn which is my favorite thing to get besides the frozen margaritas. My mom had the sangria which she loved with a fish combo of rice and beans. All three of us were satisfied. The only problem is wen it's sunny outside all the umbrella tables are taken. It would be nothin but love if more tables had umbrellas.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "So first things first... CASH ONLY! Next thing you need to know is that after you place your order, you have to go outside to the truck to get your food. There is indoor and outdoor seating available. I had the guacamole and queso plate which was delicious, but it took almost thirty minutes to receive... mainly because girl taking orders is very unpleasant and did not notify myself or the other people behind us how it worked. So we sat inside and waited all that time until I got up and asked. That's why I had to take off a star. Food was great. Would come back again now that I know better.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "We used to come here more often when my boyfriend lived in Fort Greene but we still try to come every now and again even if we're not quite as close anymore!\n\nMy go-to when I'm here is the fish tacos and the elote. The elote. Please get the elote. My boyfriend has gotten some of the other tacos, too, all of which were delicious. So far, everything we've tried has been delicious. Also, they're super consistent.\n\nThey have margaritas on the rocks and blended on \"tap\" do to speak. The margs taste great and refreshing. My boyfriend also tried the blended mojito but we both preferred the margarita. Their lemonade is also yummy.\n\nNote: this place is usually paaaaacked. They have outdoor seating and it can get pretty loud out there. The last couple of times, we sat indoors (towards the back) and it was a lot cooler and less crowded, so we could actually chat (and hear each other). \n\nIt seems like a lot of people like to come here to hang out and have drinks. The place definitely has a festive atmosphere.\n\nAnyway, we love it here and will definitely keep on going!", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "Long line. Rude staff at food pickup area. After an extremely long wait had to get manager from inside to get food. He also watched the cook to ensure properly prepared after complaining. Need I say more !", "author": "Ed M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "Out of plates we liked the pork.  Shrimp and chicken plates were not good.  The corn is excellent.", "author": "Ari S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "I love this spot! I used to go all the time when I lived in the neighborhood. I stopped by again with my fiancé after years and it's still just as amazing just a totally different demographic. \n\nThe Cuban, corn, and catfish were all delicious. The sangria was ahhhhmazing, but don't let it sit too long bc it tastes way too strong after a while. \n\nThe decor is fun and welcoming and a real community vibe. Totally worth a visit!", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Great spot to have a frozen drink outside in the summer time. Their frozen margs, mojitos, pina coladas go for $9 a pop. I came here on a sunny Tuesday afternoon and it was half crowded. They serve food as well, which you order inside and wait for your number to show up on the board outside. Their battered fish taco was tasty but soggy - $3.25/each taco.\n\n**CASH ONLY**", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "Well we went looking for a quick bite to eat before a concert and found it here. The margaritas were great! The tostones were good but the garlic butter was unsatisfactory. Perhaps they should've made a garlic oil that is more typical and delicious. I was really looking forward to a Cuban sandwich. I really don't like that they use Chipotle mayo instead of mustard, it really ruined the experience for me. I'm all for culinary uniqueness but sometimes a good sandwich shouldn't be changed.", "author": "Ekat G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "We went here this past summer. I had a burrito and plantains. The plantains were sooo delicious! I also had this lemonade drink that was really good. We sat outside in their outdoor seating area. It was really cute. We will definitely be back.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "Though I'm a fan of the original Cafe Habana, the Outpost leaves much to be desired. It may have won the popular vote in large part due to the success of their sister location in Soho, but it's clear the execution is far from the same. There are better options in Brooklyn, but that's not to say that it's all underwhelming.\n\nBK had incurred a population boom over the last few years and Habana Outpost has set up shop in one of the borough's hippest neighborhoods in Fort Greene. The lines are worse on the weekend, but with a little patience and a penchant for the outdoors, Habana Outpost could pass as a solid choice overall.\n\nThe Grilled Mexican Corn (i.e. elote) is one of the more popular choices on the menu (read: safe bet / hard to screw up). A dash of chili powder, cotija cheese crumbles, butter smeared all over a corn cob makes for fun eats. And at a $3.50 for each, it feels pricey next to other similar spots, yet it serves as a no brainer apperizer. \n\nThe rest of the menu is a mix of everything from tacos ($3+) to burritos ($9-12) and quesadillas ($7-10). I haven't had much luck in either area. Without regarding price and portion, I've found it's usually the flavors that are lacking. At this point, I'd avoid the tacos entirely. If all else fails, just cough up $10 and get a Cubano sandwich. And also order a mojito ($7) on top of that.\n\nOur non-Latin cuisine lovers might appreciate the \"For The Gringos\" section, which aside from being both hilarious and necessary, features burgers, hot dogs, and chicken fingers. There are also *insert* on a stick for food on the go, but I would be hard pressed to recommend it. At this point, it might as well be a kid's menu. \n\nLastly, the BK location also holds the distinction of being one of the first and only solar powered businesses in NYC. Thus, this outpost is closed for the season. We'll just wait till the nice weather months before Outpost emerges again. Take that Con Edison!", "author": "Jando S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "Habana Outpost has a really fun and laid back set up. There are indoor seating, but on a nice day, you definitely want to take advantage of their big outdoor space. They are run completely by solar power, so they are only open during the warmer months. \n\nI was honestly a little disappointed with this location. I think the Prince St. location definitely has more spice to the food. When we were here, we ordered the Cuban Sandwich, Fish Tacos, Grilled Mexican Corn, and the Spiked Lemonade. I did not try to Cuban Sandwich in Soho, but the Fish Tacos and Grilled Mexican Corn definitely packs more flavor there than this location. I did really enjoy the Cuban Sandwich here.\n\nIf you are in the area, it is a great place to hang out and eat, but if you can, make your way to Soho for a more delectable meal.", "author": "Elain T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Always was a fan of this place. Glad it was near my university so if a few of us wanted to go somewhere to unwind, this was the best place if the season is right. Unfortunately and logical it closes temporary for the winter. My recent complaints could be why is so ridiculous crowded now. Plus I run into people now more than 1 occasion now. Sometimes you don't want that especially if you're trying to unwind after a log hectic day . Again a great place to do so. You should head over there before it cold outside. My favorite is the drinks and the corn. That's why you go anyway for the good company, drinks and atmosphere.", "author": "Diane D."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}