{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "I love Habana Outpost! The frozen mojitos are delish and the food is really good from the the corn on the cob to the the burritos and chicken sandwich's.", "author": "Martin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "5 stars for vibrant atmosphere and community vibe. Love the casual outdoor seating. Tip: if you're looking for extra folding chairs, they keep some behind the trash area. \n\n3 stars for food -- Cafe Habana is MUCH better. The only thing you have to eat here is the $2 CORN, smothered in mayo and queso fresco, then seasoned with cayenne pepper \u0026 other spices... SO GOOD. My chicken diablo salad was almost $10 for dry bland chicken strips, mixed greens, a ton of tortilla strips, and some niblets of roasted corn. Meh.\n\nI'll be back for the mojitos and margaritas when the crowds die down after 11 or so... glad they're open til midnight every night!", "author": "Jacquelyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "Delicious margaritas. Perfect for a late night first date, and \"is that a band playing downstairs?\" I think it might've been.\nOnly had chips and salsa, which was pretty good. I kept looking for the salt tho. Maybe next time I'll order real food and give a real review. Had a great time on my date tho!\nI'll be back.  Sometime.", "author": "Jeannette A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-04", "description": "Five Stars for it being GREEN!\n\nI wish more business establishments would take the time and make their restaurants more eco-friendly.\n\nThe line system sucks but hey, it's green so I can look pass this flaw.\n\nCorn and Margaritas are delicious!", "author": "Ro R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "I have been to Habana Outpost a handful of time and for me it is always the same: mediocre drinks. Now you may ask why i keep going back? The ambience is nice, and the food is good I just don't waste my money on their drinks and you shouldn't either.", "author": "Bernice W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "I made a special trip from Manhattan while in NY to check this spot out and it was EXCELLENT. \n\nI had the famous corn, a chicken burrito and the sangria...the corn is beyond words...just amazing. the burrito was really tasty and the sangria was very good...not GREAT, but good. \n\nGreat atmosphere and I enjoyed eating in the outside patio area...the only drawback would be that I didn't exactly dig the salsa, but that's a small thing. I would definitely check this spot out and recommend it to anyone hanging out in Brooklyn.", "author": "J. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "Habana Outpost - where can i begin?  Bring your appetite here for Incredibly awesome eats, delicious, fresh and just outrageously mouth watering food.  Decent prices as well - though the $8 mojito is ho hum. I try to stick with the beers on tap for $2.75 - pretty good deal and awesome local breweries.  I recommend the corn on the cob, the cuban, the diablo chicken. Hell, i recommend it all - depends what you're in the mood for. I imagine you can't go wrong.  Bring your sunglasses and enjoy the amazing and very happening Fort Greene scene-great beautiful people watching and lively music.", "author": "Sandy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "In all seriousness, as far as I am concerned the epitome of my brooklyn summers are long afternoons drinking frozen mojitos and eating guacamole and chips in the sun at Habana Outpost. I can't explain it, if it the perfectly bright colored furniture, or the optimal use of a sunny corner in Ft. Greene, or the genius of an almost exclusively outdoor restaurant that keeps me coming back to Habana despite its very limited menu of food and drinks. But I find comfort and happiness in its simplicity. And given how absolutely packed it is most days of the week, I assume that I am not alone.\n\nSit in the summer sun. Drink a frozen drink (or bike one on saturdays for a discount). Get some food off of their truck. Be joyful. Be merry.\n\nPS: Did I mention the emphasis on eco-friendly environment saving practices employed by Habana? Enjoy yourself and better the world around you, all in one.", "author": "C P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "**DJ Scratch...Wicky wicky Whaaatttt!** This place was the bomb! I don't even know if they still say that but it was. lol\n\nI heard about this spot from a co worker who doesn't speak much english. She gave me their business card and I kept it for almost year wanting to check it out one day but didn't know what to expect. I just loved my co workers personality so much I thought I'd check out this spot she said she enjoyed in hopes it would be filled with pleasant folk like her. \n\nSo I venture into Brooklyn one night to meet up with a dear girlfriend to catch up and vent like us girls do. She took me to this place where she said the margaritas were to die for. Immediately after I saw the name, I was excited. Its set up utdoors with benches and chairs. There's small area inside where you order and a trailer outside you can walk up to get your food.  Everyone, I mean everyone was chowing down on these corn on the cobs. So I say to my friend \"Whats up with the corn on the cobs?\" she replies \"I don't know but I think its like their specialty or something. Everyone says how good they are\". I politely excused myself while I went to go see what everyone else knew about but me. I got one corn on the cob, an order of fries, and 2 frozen margaritas. (Those ritas were good too) The corn was grilled with this cheese on it. Not like a slice of cheese but powdery but it melted. It was buttery and it came with a lime. I squeezed it over the cob and bit in. *Thats what she said! lol* It was sooooo goood!!!!! I can't even describe the taste but if you like tortilla chips with lime, then you'll love this!!! \n\nToo bad this spot is only open in the summer. Its so laid back, the crowd was chill. I would go back in a heartbeat. The food was enexpensive and if I'm not mistaken, the frozen margaritas were $5. Yes, you heard me $5! Can't beat that on a hot summer day.", "author": "Tasha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "What a great spot!!!\n\nVery relaxed atmosphere and a great place to grab some food and beers on a summer night. \n\nFood is good and the price is reasonable. What else can you ask for in Brooklyn where outside space is so limited.", "author": "Jayme S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "I haven't gotten around to writing a review on Habana Outpost because I forgot I had a Yelp account for quite some time lol (sounds stupid right?  but so true) Well, on to my review:  I've been to this funky colorful bklyn gem twice in the last 2 years (definitely need to make an effort to go more than once this year in the summer)  All I can say is \"DELICIOUS\"  I have not eaten one thing that I have not loved from here, OMG the corn is amazing and so good and flavorful!  They're cuban sandwich is tasty, the pernil (roast pork) is moist and seasoned just right.  The first time I visited Habana my drinks were great, now the 2nd time, not so much.  The mojito machine was broken so we had to have margaritas.  They were ok but I really love the mojitos so that was a bit disappointing.  The crowd is fun and it does get crowded but it doesn't really bug you because it's just one of those fun and free flowing places to eat, drink, and enjoy good company.  All in all, a great place if you want to just chill out on a nice warm day in the spring / summer have some great tasting comfort food with a mojito or margarita in hand.  Check it out you guys will love it!", "author": "FeLix L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "Went on a sunny Saturday afternoon\n\nTook yelpers advice and got the corn as a midday snack. $2.75 and delicious. \n\nThere's a line just for \"drinks and corn\" - that's how good it is. I couldn't get myself to buy a small mojito for $8 though. \n\nLoved sitting outside and being a part of the neighborhood. Thought it was adorable that there a young girl doing arts and crafts in the shade around me while\nFun music was playing and people were Happy in the summer sun.", "author": "Amani M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "Great food, in a fun casual, atmosphere. Don't go in thinking of it as restaurant, think of it as a catered picnic with your family and friends.", "author": "James F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-18", "description": "This is definitely a fun place to have lunch. They've got a beautiful and bright patio. The staff are always cheerful and friendly. \n\nI've only ever had the cactus salad and the avocado sandwich. I love them both!\n\nThe beer on tap is also cheap and cold!\n\nThis is supposed to be an 'eco-eatery' but I'm not sure about the disposable plates and utencils. If it weren't billed as such it probably wouldn't be an issue. \n\nRegardless, I'm here for the food and I'll definitely be back when I'm in BK!", "author": "Garry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "I wish I could put five stars for food, drinks, and atmosphere and a negative five for the crazy lines that always make me feel like an idiot for coming here -- which, of course, I immediately forget as soon as I'm sitting down, sipping my always-delicious frozen mojito, eating my yummy food, and chillin' outside. \n\nLast night they had a problem with the exhaust fan and couldn't make any food, so my friend and I were talking about how the super strong drinks were going to be a little tough to handle. The people next to us on the picnic table overheard the convo and literally gave us half their food, which struck me as a very Habana Outpost-y moment. Yay Fort Greene!", "author": "Megan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "Doesn't hold a candle to the Manhattan location.\n\nNegatives:  The Mexican corn, which is the staple at Cafe Habana on Prince St, is a sad facimile.  Way too much cheese, not enough Mayo, weak corn cobs. Disappointing.  The Cuban Sandwich can only be described mediocre at best. Also disappointing.  The fried plantains, which are so good at the Manhattan location, here--feh.\n\nPositives: The frozen mojito rocked. Great outdoor nabe atmosphere. Less hipsters than when I first went two years ago.\n\nToo bad, I really wanted to support the Bklyn location. I'll be back for drinks perhaps.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "I didn't try the food - this is for after-hours nightlife based on one visit.\n\nMy girl had hooks with someone and we came for a VIP party and TALIB  was spinning.  It was so fun. Everyone one was dancing, looking good - J dragged me into a soul train!  The upstairs bathroom is wonderful and pretty and of course as everyone mentioned - green. Makes me a little disappointed in S.F.\nDownstairs the bathrooms are a little tight.\n\nThe drinks were good, they don't have it all at the downstairs bar. Overall a great place to have a party!", "author": "Cheryl D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "Great grilled corn and cuban sandwiches. Awesome frozen mango margaritas. Perfect place for outdoor drinking!", "author": "Mark G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-03", "description": "Can think of no better place to spend a lovely Saturday afternoon in Brooklyn than at Habana Outpost drinking a Mango Margarita and surrounded by a fabulously artistic atmosphere and eclectic peeps. ;-) \n\nI did just that last weekend while I was in New York - and was way impressed. Check out the bathrooms when you go - they are so cool! Oh, and pick up a free Habana Girls Calendar ;-) Major props for being completely solar-powered.  Didn't have any food - but the corn on the cob looked fabulous! The Mango margarita was the bomb, and the bartenders and staff were very friendly. When are you guys coming to SF?? ;-)", "author": "Claudia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-31", "description": "I really shouldn't be giving this four stars, but I am, so whatever.\n\nThe deal with this place is this: it claims to be New York's first solar-powered restaurant and flea market.  I didn't see any of this flea market business, but the concept intrigued me.\n\nSo, you walk into the place and order at the counter.  They have a few drafts (two of which were Brooklyn brewed when I was there), and frozen margaritas and frozen mojitos (they were out of mojito the night I was there) on tap as well.  The food, I guess, is Cuban, but it's much more of a \"bought it on a street\" Cuban than \"ate it in a restaurant\" Cuban.  This place puts on no airs though, so I won't fault them for that.\n\nOkay, so now that you've ordered, you take your receipt outside to the open-air area and hand it to the cook (was his name Oscar?) and wait for it to be cooked.\n\nI personally think that this is very cool.  The plasticware is made of recycled sugar cane...actually, pretty much everything is recycled.  They even have a bus person working there to assure that the garbage (which is then all recycled or composted) makes it into its designated compartment.\n\nThe food is all right, but everyone I was with who had anything with chicken in it complained that it was too dry or burnt.  Coming from Chicago where neighborhoods and people are far more segregated, I've never had a corn cob on a stick before, so that was really cool.  I thought that the catfish burrito was really good.  And the beer.", "author": "Bob J."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}