{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-08", "description": "This place rocks! I was against it at first because of the super-casual environment but it quickly warmed up. Not only is this place good for groups but its pet friendly...and by pet friendly I mean that I was able to take my Beagle there with me without someone telling me to put him outside.\n\nThe drinks are okay...not the best but okay. The food is worth the trip if you're not too far, not worth leaving another borough for though...but if you do then definitely try the guacamole.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "Long gone are the days I avoid eating corn on the cob. Yes, getting those annoying strands lodged between your two front teeth out can be annoying but I'll splurge for some floss if it means I get to eat more corn like this! \n\nCame here with some friends on a Saturday afternoon and instantly fell in love with the atmosphere. Music playing, kids running around, and people sipping frozen mojitos put me at ease. We cozied around a table in blue adirondack chairs and indulged with corn on the cob, veggie burgers, guacamole burritos and huevos rancheros. \n\nThe corn definitely saved the meal as my veggie burger was compromised by the generic and too big bun that took away from the great flavor of the patty. While I wanted a mojito, I didn't want to spend 8 bucks but definitely next time. \n\nIt's nice to know I can find a little taste of Havana in the middle of Brooklyn!", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "I can't believe I haven't noticed this place before. I love it! Some of the items are a little overpriced compared to other Latino inspired food places; but it's worth it.", "author": "Destiny G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-16", "description": "This place has so much hype around it. Heard about it for 2 years before I got around to going. I was not missing much. This review is two fold. It is all about what you are looking for. This place if you want to get some drinks after work with friends and the weather is nice. Nice outside seating but you have to sit yourself. When it's crowded you have to hoover over tables like a hawk if you think the people are about to leave. \n\nThe drinks are tasty. Cash only. However the food is just really bad. I ordered the chicken burrito and I didn't know it was legal to serve chicken that dry. If I wasn't starving and didn't want to drink on an empty stomach I wouldn't have finished it. I would go back for the social aspect but I will make sure I arrive on a full stomach.", "author": "Terance T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "I absolutely love this place. Once the weather breaks in NY this is where it is. The crowd a nice mixture from hippie to hip hop to yuppie lol i love it all...cash only!!! Which i hate its 2014 who doesnt take cards...alas they do have an atm dont fret! The lines for drinks can get pretty long literally going out the door but worth it. The margaritas are tasty and so is the mexican corn. I had the catfiah burrito which was sooooooo goooood. On a nice day on the weekend be prepared to rush for seats seems like once ppl find a a seat they never leave lol", "author": "Latrisha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-31", "description": "They used to be much better. And I can't believe they're STILL cash-only. Annoying\n\nThe ambiance is still cool. They have fun events such as Sunday evening outdoor movies. There's always a crowd here which can get annoying. Park Slope couples meet Clinton Hill youngsters looking for action. But that's not the real problem.\n\nFood-wise is where I was disappointing. They used to be on par with their parent Habana Cafe in SoHo a few years back when they opened. Now it's kind of crappy. Small Cuban sandwiches on stiff bread are barely put together and the meat is not v tasty. Sad looking burgers served with dead lettuce. Completely plain, small hot dogs for $3.50+. It's also getting expensive (oh and house salsas are extra $) and all drinks are tiny. The menu also seems to have changed, now being primarily Mexican style stuff. Burritos, tacos (not good ones), $6 quesadillas, etc. Not very Cuban. They even added some bbq chicken wings or something like that, I guess to respond to their demographic - but they're super small and don't include fries.\n\nThe lemon flavored fries on the other hand aren't bad. And the ginger lemonade although tiny, was good.\n\nAnyway, I guess that's what success does to some places. There's even a new \"Habana something\" place right across the street! Watch out Outpost, you got some competition... Actually, I think I'll try the new kids on the block next time around, at least for food.", "author": "Jorge O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Very cool outdoor spot. Order at the counter inside, and pick up at the truck-like thing outside. Solar panels everywhere! Lots of greenery and tile and string lights, too. Cash only. \n\nI didn't have the frozen drink but they looked super good. I had a queso and guacamole \"burrito\" -- it was really small. There was a square hunk of white cheese inside with some arugula, and then it was grilled like a cuban sandwich. Maybe tasted a drop of guacamole. It was alright, but I wouldn't order it again. Also literally everyone had a birthday party going on around us (Monday) and I was getting cake envy. Anyway!! \n\nI want to visit during the day. The vibe I was getting made me want to sip coffee and eat eggs in the sun.", "author": "Julia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "This place is great! Habana's Cubano is the best I've had in the city, and if you're not hungry, the outdoor space is great for grabbing a few beers with some friends. An added bonus, their in-house DJs play some great tune during the weekends.", "author": "Arthur B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Had a fish taco, a steak taco, and the corn. My husband had a pork taco, a steak taco, and The Roscoe (fried chicken and waffle on a stick). Everything was delicious!!!!", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-15", "description": "I came here with misguided expectations.\n\nI was expecting a Cuban restaurant with some drinking and great outdoor seating. \n\nWhat I found was a great outdoor space with lots of drinking and some Cuban influence.\n\nThe Cuban sandwich was pretty good, but it weirdly came with mayo instead of mustard. My wife had some fish tacos and the grilled corn. The corn was unequivocally awesome.\n\nI was rather disappointed with the drinks. The only cocktails were frozen and came out of 7/11 Slurpee style machines. My main motivation for coming here was getting a mojito on a hot summer afternoon, and the frozen stuff was fairly awful. \n\nThat being said, if you know what to expect, this is a great place to hang out and drink in the sun with some better than average but not fantastic Cuban food.", "author": "Ted O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "CASH ONLY\nI had the steak w/ rice and beans, grilled corn and Roscoe's on a stick with a frozen margarita.  The guy handed me my plate and I looked soo greedy.  But I definitely ate every last bite.  And I was so confused because normally after a meal like that, you could roll me down the block.  But I felt unusually light - not stuffed but satisfied.\nThe steak was tender, the rice and beans were spot on.  The corn was so cheesy and amazing.  And the powered sugar on the chicken on a stick...YES.  Even got a lil buzz from the drink.  Thankfully the weather was good so were able to enjoy the outside but there is decent seating indoors just in case.  \nTIP:  the chipotle mayo is tasty but mild.  The green sauce in the bottle is HOTTTT!", "author": "Tiffini M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "This place was a really good Friday afternoon option. The food was good, great ambiance, and the spiked lemonade was amazing (scary how little alcohol you could taste - good thing). The one thing I didn't like was the lack out seating outside, you have to wait for people to get up, however once you get a seat you are golden!\n\nDefinitely going back", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Hello frozen drinks! I still can't pick which one I liked most lol.. Just get all three. You won't regret it.", "author": "Lainey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Great food. Open late and close to Lafayette station. Loved the music and great ambiance.", "author": "Cindy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "The frozen margaritas were out of this world and the catfish burrito was stuffed full of rice beans and battered catfish and absolutely delicious! We somehow managed to snag a seat in the super crowded outdoor area  which had a fab chilled vibe. A gem of a find in Downtown Brooklyn!", "author": "Sara J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "My favorite place to go during the spring and summer. Their corn along with other items on the menu are amazing and the drinks are well worth it for the price you pay for them.", "author": "Janice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Love the corn, the beer is cheap, though there tend to be a lot of fights for some reason.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Had a great dinner here: totally hit the spot. My vegetarians daughters loved it and I will want for grilled corn every day from now on.", "author": "Linda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Came to Habana Outpost because trekking out to Cafe Habana was too much of a journey for me on a Sunday night. Little did I realize how kid friendly Habana Outpost is! Had I known this before hand, I probably would've just went into the city.\n\nMy boyfriend and I ordered a ton of stuff, but our bill came out to be just $25! We had the corn and the Cuban sandwich of course, as well as a few other items. Comparing this location to the one in the city, the Cuban sandwich meat was a bit dry. The corn was fine though. I also ordered a cheese quesadilla. The menu here is definitely more diverse than the other location. Food wise though, this location can't compare to the original venue!\n\nThis location is more of a family setting: they show movies and have outdoor seating. The \"kitchen\" is actually a truck outside. You order inside, then go outside with your ticket to wait for your order. You also seat yourself. So it has a cafeteria sort of vibe. I guess that's why parents bring their kids here?\n\nThe cashiers area different types of frozen drinks and beers. There are also an array of sauces you can choose from. The indoor space is tight but the outdoor space is large. Again, the food is slightly worse quality than Cafe Habana, but by no means bad. The only thing bad about Habana Outpost are the number of messy kids.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "Likes...\nThe outdoor patio is nice for the summer Brooklyn nights. \nThe atmosphere is social, lots of laughs, drinks and CORN!!! \nThe food is descent...\nThe drinks are great... \n\nDislikes...\nVery small and seems to always be crowded...\nCan be a bit too noisey for me...\nThe ordering process will take getting used to...\nTables could've been cleaned better...\n\nThe idea of security being there concerns me but I guess it's ok. \n\nWeekends are jammed packed, try and come as early as possible.  Weekdays are crowded too, just with more families (tots \u0026 strollers)", "author": "Nakia S."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}