{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "Wednesday - 8pm\n\nOn this night there was a crossroads of finding a place to eat before seeing a show at the Barclays and craving Mexican food.   Habana Outpost fit the bill.  This cash only place is perfect to eat in gorgeous weather as they have a sizable outdoor dining space.\n\nAfter placing your order inside, find free table and wait for your number to be called from the \"truck\".  Don't get too distracted by the décor as your number will be called fairly quickly after getting a seat.\n\nThe food was delicious and filling.  We will definitely go back.  \n\nA nice touch is the very detailed recycling receptacles with one just for utensils.", "author": "Henry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "The staff was friendly. The ambiance was cool and the bathrooms are in a a  solarium and it's beautiful. The food is simple and good! And on Sundays they have movie night where they showcase classic movies like PURPLE Rain and The Outisders!", "author": "Chante N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Had the Guacamole and cheese burrito and Mexican style corn. The food was much better than I expected it to be. The atmosphere is like a food truck with its own space to enjoy the food.", "author": "Mark O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "The vibe here is very kumbaya-vegan-yogi meets bad biker boys meets the Cleavers. They all converge, depending on the time of day, on a fantastic patio along with everyone else in between.\n\nThe Mexican corn is everything. I mean everything. Roasted corn with tasty burned bits, cheese, lime and spices that leave your lips tingling like a plumping lip gloss.\n\nUnfortunately, I'm not too impressed with the tacos, which are very small (even for tacos), and come with minimal fixins'. The steak taco was somewhat chewy. The frozen mixed drinks remind me of Kool-Aid slush and Pixy Stix.\n\nThe line is always way too long and some of the prices are completely out of whack compared to the food portions. And they only take cash.\n\nPeople seem confused by the second Habana right across the street. And apparently you can't order from the small one across the street and take your food to the other big Habana with a patio. I can't tell you how many people I witnessed in one day repeatedly crossing the street between the two Habanas asking questions because they were trying to beat the long line at the big Habana.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Best frozen cocktails ever!!! I love how they have exotic natural flavors like passion fruit and guava.", "author": "Kwarana A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "Tacos were very sparse on taste.  The chicken and cheese quesodillas or however you spell it were also lacking taste.  The sour cream was a joke it basically dried into the tortilla.  I'm not a lemonade fan and the pineapple ginger lemonade didn't sound to great but my friend had one I tried it and it was actually good.  The corn was very good,  wish it had more meat on the cobb to eat but very tasty.  Wasn't a fan of the chili powder though so I scraped it off with a fork lol.  Bathrooms are different.  Don't know how to explain but if you go, you'll see for yourself.  A little over priced but if I would return just for that lemonade and corn lol", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "The food was great! You MUST try the corn! \u0026 steak Tacos! The place is simply amazing! Everything about it, from the out door eating, to the coolest bathroom ever! Definitely going back for more!", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Service - Good\nAmbiance - Cool and Simple\nFood - Good\n\nGot there 10 min to close they served me and I was happy.\n\nThis place has a great patio and music on weekends, must be great.\n\nHad a cubano and was good.\n\nGoing back", "author": "Ronald D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "In my opinion, heaven on earth! Music, outdoors, dog friendly, great food and drinks! Great sense of community, and the staff is awesome every time", "author": "F B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "CASH ONLY! 1st time here and it was SUPER crowded. My girlfriend and I came for the Sunday movie night \"West Side Story\". Next time we will arrive much earlier. My neck is hurting from sitting so close to the wall where the projector screens. You can order inside which the line was super long or you can grab a seat and have a friend get food from across the street where takeout is available. (Same food) Good music played before showtime and mango margaritas were so good! Had a pork taco it was pretty good. Had a fish taco and should have passed becuz it was overcooked and no flavor. Corn was burnt and not too sweet but tasty with the cheese/chilli powder on it. Like I said, come early on weekends cuz it gets crowded. Had a great time and can't wait to go back to see The Shining.", "author": "Liv B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "I don't understand rave reviews about the Cuban Sandwich; maybe I just got a bad one. The bread was stale and tough on the outside and soggy on the inside, just gross. The cheese was processed  and value store tasting, as well as the pickles. I'd expect a sandwich like this from a sketchy bodega, but not from such a popular restaurant at $9 a pop. \n\nThe pork and chipotle mayo were really good, ended up scraping them off and eating them on the side. It's too bad they use such poor quality ingredients that ruin the sandwich otherwise. \n\nI really wanted to like this place because its Eco-friendly, has good links with the community and is just a nice spot to come and spend an afternoon. Maybe I'll give it a second chance someday. Maybe.", "author": "Miles K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-16", "description": "So I've been wanting to check out this spot for quite some time to see what all the hype was about... my bf and I went there on a saturday night and it was jammed pack..  the line to order was crazy long and moved at a super slow pace...FYI ITS A CASH ONLY SPOT!!! \n\nWe had the steak tacos and the pork tacos... I thought the steak tavos were okay but I found the pork to be dry... the star of the show was the corn!!! It was sooo good... washed it down with a mango margarita.. \n\nOverall it was a decent experience and should I venture there again I'd get a plato and of course the corn...", "author": "monique n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "To keep it short and sweet - The food is delish, drinks are great and can creep up on you because they don't taste as strong as they are. Service is great. Bads - Lines are always long, and depending on the day and time they're out the door and around the corner. Hard to find seats if you come late. Come here and be ready to have a blast.", "author": "Mariela E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "The outdoor space is cute. Although, you have to stalk people for a table or get lucky and catch someone as they're leaving. There are no servers, you have to DIY at the counters for food and drinks.\n\nI would recommend the Roscoe on a stick (chicken and waffle with maple syrup). Make sure you get the maple syrup because we didn't get any and had to go back to ask for it. The corn is good, but you kind of taste that they made it in a hurry.\n\nThe other food is edible to poor. The steak is tough. The catfish has no flavor. The rice and beans are bland. The chicken was dry. So definitely just go for a drink and snack, not for any of the meals.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "All issues related to the past review are solved since longtime. I have been back to Habana Outpost many times and the experience has always been great. \n\nA monument in the neighborhood. Great energy and atmosphere. Food is a bit pricey.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Yum yum yum x another yum yum yum x 10. I was finally able to visit Habana Outpost on a weekday afternoon. There was STILL a good amount of people but nothing where we had to wait. For apps we had the chicken \u0026 waffle stick, and the Mexican corn. Both what we expected (or better). The corn is huge and juicy. I could do without the chicken \u0026 waffle stick next time but its really interesting. It's a chicken finger inside of a waffle .... I got a fish burrito which was really tasty but my bf got the Cuban and I had to say that's better. Really flavorful and juicy. Affordable and nice seating outdoors, I wish it was more accessible and less crowded usually... A+++", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-03", "description": "The food was really tasty and you can tell they used good ingredients. However, was it a mind blowing delicious meal? For all the hype on yelp, naw it wasn't. \n\nI was also hoping for a ropa vieja dish and didn't find one. A cuban restaurant that prides on it's culture yet has no ropa vieja?? Most dishes are mexican. haha, which is cool, i enjoy mexican, tex-mex food. But from the name of the restaurant I was expecting more authentic cuban dishes. \n\nI found the prices to be a little more than average. This place is obvious that it is meant to serve the more than average wealthy hipster, then the common folk people. \n\nThe place has great decoration. The ambiance is great. Too bad it draws a certain crowd of people, and not a socio-economically diverse community.", "author": "Luna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "You've got to love the concept[1] behind Habana Outpost: a neighborhood joint fitted with recycled furniture, compostable plates and utensils, and a human-powered bike blender! The power comes from solar panels, and the water used for the toilets is actually rain water.\n\nMoreover, each and every Sunday throughout the summer, you can enjoy outdoors movie screened at Habana Outpost.\n\nDeceptively Cuban by name, Habana Outpost serves, in fact, reasonably priced Mexican food out of a truck in the back.\nThe grilled corn, served Mexican-style with cotija cheese, chili powder, and lime ($2.75) is solid.\nThe tacos[2], however, were disappointing: the catfish taco ($2.75), was bland and had no discernible fish flavor; and the pork taco fared only a little better.\nPerhaps the best part of the meal was the hot sauce: the fiercely hot (and equally tasty) green Yucatero sauce.\n\nThere are two registers: one for corn and drinks only, the other for everything else. Unfortunately this puzzling arrangement makes for very long lines, since the person behind the counter is also the one in charge of pouring your drinks.\n\nYes, the food is mediocre. Still, I am glad Habana Outpost exists.\n-----------------------------------\n[1] \"practical environmental solutions for urban challenges [...] Habana Outpost aims to reduce wasteful consumption and promote sustainable solutions while maximizing good food and good times\", says Sean Meenan, the man behind this place.\n\n[2] That tacos come served in a single tortilla shell, and not two as at most places.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Cool atmosphere and delicious food. The margaritas were a little on the sweet side for me, but everything else was wonderful.", "author": "Deminica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I feel like Habana Outpost is a Brooklyn summer staple. I come here every month of the summer. I love the frozen margaritas, grilled corn, outdoor seating, community/neighborhood atmosphere, and Sunday night movies. One of my city favorites!", "author": "Lauren W."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}