{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "I love this place!  I've only been there for lunch so haven't had to put up with long lines.  Its a lot of fun sitting outside on a Saturday afternoon eating with friends and listening to the DJ spin some soul music.\n\nAs for the food, everything I have ordered has been really good.  I would especially recommend the Cuban sandwich; its the best I've ever had.  I get it almost every time I go.", "author": "Ben N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "I came here after playing in my first ever soccer game a few blocks down.  Grabbing a recycled cup made out of corn (how is this possible?) and filling it from the water jug was a free and perfect start to my Outpost experience.  Add Habana's delicious guacamole and sweet plantains and I was in outdoor heaven among the most beautiful lime green barbed wire I've ever seen.", "author": "Meg L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-08", "description": "Habana is the it spot for outdoor drinking in Fort Greene. They have several picnic tables and benches and delicious frozen mojitos and margaritas. The setting is very pleasant.\n\nHowever, because of the appeal of Habana's atmosphere and their monopoly  on outdoor drinking in the area the prices are too high for what you get. And that's true of the drinks and the food. \n\nLastly, a disappointing anecdote: I tried to take some coworkers to Habana Outpost on a beautiful spring afternoon in May and they were closed for \"spring cleaning\". I was disappointed and confused because Habana is only open 5 months out of the year. And for them to be closed for cleaning on a warm day is poor form. I called the next day and asked I they were open and I was told \"hopefully by tonight\".\n\nSo in conclusion, I believe Habana Outpost is a fun place to be in the spring and summer but they are taking advantage of their customers and their ideal location and setting.", "author": "Vanessa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "Really, it isn't about the food. The corn is soooo good, but the Red Hook Vendors do it better. The ambience coupled with the drinks is what makes it worth it. If you're expecting a delicious meal, probably go elsewhere. But on a summer day with friends, it's the perfect spot to be.", "author": "Kate G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-01", "description": "Que buen! Food and atmosphere is festive.  The huge patio is great for kicking back Six Point drafts ($2.75) or spiked lemonade.  Portions are huge and we were able to split the Chicken Diablo and a corn on the cob. Grabbed a quick lunch for two for under $15 including tip. Will definitely be back.  They have other locations in the city as well.", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "A fun place to eat, especially when it is nice weather out. Great burrito's, fajita's and tasty margaritas. You must get the corn! Worth going for that alone! They also have veggie burgers!", "author": "Robert M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "I love this spot. They have one of best frozen Margarita I have ever tasted $5.00. I love the outside seating even it is always crowded. I love the food too. The corn is like OMG!!! Too Good!! The Cuban sandwiches, rice and beans along with burritos.  Very tasty!! I will always come back!!!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "I F-ing love this place!!!!!! I want to spend my everyday in the summer here.  Friendly staff, fun fresh food, great frozen drinks, margarita's, music, celebs.  Its a party!", "author": "Davidangelo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "Let's face it, sometimes living in Brooklyn there are just some summers where you can't get away for a trip or vacation. Its depressing and discouraging. What are some ways to cheer yourself up? Everything at that point can look pretty sour, pretty grim. The streets and the buildings of Brooklyn can truly grate on one's nerves if you have to look at them year 'round. But this is when you have to dig-deep in your own spiritual resources and remember that no matter where you are, good things might be just-around-the-corner. That is also when a  nifty little tropical-themed outdoor restaurant like HP (with umbrellas and palm trees) sometimes is just that little extra touch that you need to complete the illusion. Yes, even in dour ole' Brooklyn, this is a very upbeat place to elevate anyone's mood. Fun and funky--renowned locally not just for its food but for its outdoor seating. Reggaie, salsa, meringue, steel drum music on the speakers; the awnings, roof \u0026 walls are a multi-color of turquoise/orange/purple; and there are always groups of people laughing and making merry. Constants swish of tanned, bare-legged girls in volleyball shorts and tennis shoes; ponytails swaying, chests jiggling in thin t-shirts with funny sayings written across the front. You seat yourself down at some big picnic tables with your food and chow down. Spicy, tangy tropical recipes and icy fruit-juice/booze concoctions.The restaurant is also BIG on recycling, energy conservation, and all the latest new-agey trends (vegan, gluten free, etc etc etc). Good times!", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-18", "description": "Reality: People seem to like this place, simply because you can sit outside with music and have drinks and its different then other places...BUT every time I have tried this place, at least 5 times now, the food is HORRIBLE, and drinks UNPREDICTABLE ( depending on who makes them) I guess coming from the west coast and being blessed to travel and having a latin husband and a taste for all foods latino would at least mean that I have tried many varieties served up in many places and this MUST be one of the single worst I have ever had...really. Its just too bad as it is fun and cute, and YES only really popular since there isn't much like it in this city. NOTE: anyone considering opening a place, open something similar and you will be busy, make better food and you will open 5 more. I am sorry but if you read down most reviews are about drinks, fun and hanging out and NOT about the food, other than corn on the cob, which I also thought was very mediocre. (try Los Muertos on Washington, or any Mexican place for better ones) The burritos we had were absolute horrible-how can you make them that bland and average? How hard is it? It's not fine cuisine after all ! Haven't been since last summer, but do not think I will try again after 5 attempts with various friends. Really disappointed and it just shows how a little cuteness can get you everywhere!", "author": "Elle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "I live their flavorful corn, their rice and beans, and their picnic benches! Sometimes I don't like how much of a scene it has become but what can you do.", "author": "M J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Not only is the Cuban and Grilled corn pairing the best thing I've eaten in Brooklyn, but the venue is incredible! It's perfect for a sunny day and a great staple in Fort Greene. Friends love coming here when they visit and I have no problem returning time after time. The service is quick and consistent. Highly recommended!!!", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "Though the order line was a bit off-putting at first (granted, it was 1 PM on a Saturday, so Brooklyners were hungry), the small wait was a small price to pay for the tasty lunch. We ordered Mexican corn, a Cubano burrito, 2 pork tacos, and a Boing mango juice, which totaled under $20. Highly recommend for a casual meal. Good for couples, kids, and groups (though you might have to wait a bit to snag a table). Selection of bottled beers and mixed drinks available, also.", "author": "Louren enid C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-07", "description": "Love this place! Try the roast corn, rolled in parmesan and spices. Good mojitos and margs. Great little bench in front to watch the world go by. Reasonable prices. Some cool green innovations like the bicycle powered blender. The patio is wonderful when the weather permits. I met one of my best friends from Brooklyn here!", "author": "Leah Shane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "Love this place! Perfect for summertime group meet ups. Frozen mojitos and margaritas are on point! Only reason I didn't give 5 stars is for the food, the menu is boring. I never come to eat, just to socialize.", "author": "Ebony T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "I'm not too familiar with the Fort Greene/Clinton Hill area, so this place came as a very nice surprise.\n\nWhat I found was: great food, a great place to hang out, and good beer. Also, everything is reasonably priced. And eco-friendly.\n\nIf you're a vegetarian, the guacamole/queso sandwich is a great option: flavorful and filling. Also, the corn and plantains were incredible.\n\nIn sum: all smiles, no complaints.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "It was a gorgeous, summer-like day so we decided to check out the outpost. My bf looked at the menu beforehand and was set on the steak quesadilla but when we got there they said they wouldn't have it on the menu for a couple of wks. He wasn't that excited about the steak sandwich he got but I sure did love my corn!! I could have done without the mojito but I'm not much of a drinker anyway...we were seated in the hot sun but someone left and we got a shady spot which was much more comfortable. All in all, good times. We are new to NY and with so many places to eat on our list, we will not likely try this place again. But maybe...for that corn!", "author": "Lita J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "I rated this place mostly on atmosphere. My companion suggested we meet for dinner here and even though I've been in the neighborhood for ovber a year, I never quite made it. In the summer it's packed, and (i feel) annoying. It was perfect for a cool, fall night for a beer and a sandwich. The food forced me to give it 4 stars, but if you go for a decent place to drink CHEAP ($2.50) beers and enjoy being outside with your friends, then you'll be happy.", "author": "Kristin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "Chill place, good food, good drinks, cheap prices. The seating is limited and it tends to be pretty packed in summer, so you might struggle for a seat. A lot of bench seating, so hopefully you dont mind socializing.\n\nI had the catfish burrito. Yum! Also tried the chicken diablo sandwich. Yum! The \"famous corn\" was the highlight of the meal. You must try it!\n\nOnly came here once but I could definitely see myself as a regular!", "author": "Dorian P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Great place to grab a bite during good weather. Give your order ticket to the on-site truck/kitchen and relax with some friends.  Drinks are tasty, food is fresh and flavorful, picnic-table dining, and a commitment to eco-friendly practices. Even the open-air bathroom is fun!", "author": "Amy H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}