{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-26", "description": "If you like food, don't come here. \nIf you like to get drinks with your friends, ok, come here. \nHave been so excited to try this place based on reviews and now I think the reviews aren't as honest as I thought they'd be. \nGot a catfish platter, catfish was cold and had no flavors. \nGot a roscoe - it's a joke. Dough with flavorless chicken inside. \n\nCorn was the only passable menu item, but how do you mess up corn? \n\nThe outdoor seating is great for a group, just not a hungry group. \nSo I walked out full....full of disappointment.", "author": "Anne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Crowded. Grab a seat first then we can get set up with food. \n\nDefinitely love the sandwich they got and the drink is very strong. Up to par.\n\nI would come here on a cool night just it's all out door. Very loud.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Good was okay, nothing I would try again. My burrito was dry and bland, chicken and waffle was just plain nasty..", "author": "Lolo G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "Fun late night margarita outdoor bar. Tho, I must say, WTF is up with their security. Like, come on, this place is not that amazing that there needs to be 5 giant scary security guys manning all the doors.\nCOME ON.\nAnyway, fun chill casual atmosphere that gets super busy when the weather's nice. Right near the C train (which is good during the day, but not so great at night since it SUCKS).\nFrozen margs were tasty, but let's be real, they came out of a machine and they don't hold a candle to Blockhead's $4 margs (these were $8). So it was fun and good, but honestly, nothing compares to you Blockheads, love of my life.\n\nDidn't try the food here tho, and I'd like to so perhaps I'll be back to try it.", "author": "Alex F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "The corn was amazing! I wish my stomach could have held another one!\n\nThe chicken sandwich was pretty good as well.\n\nI loved the ambiance of the restaurant as well. I enjoyed sitting outside, listening to music while eating my food.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Went here for a pre-Barclay dinner. It was a very relaxed atmosphere with communal seating. We order some drinks (margarita and pina colada- both good margarita was on the sweet side) tacos and some Mexican corn. The corn was on point! It will bring be back for sure. Overall it's a great spot if you want to be low key and not afraid to mingle with strangers.", "author": "Juliska M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-28", "description": "I didn't review this place? Wtf?! I came here super storm Sandy weekend since my friend \u0026 I had Halloween plans. Ugh I had my own Mexican corn \u0026 some chicken quesadillas \u0026 man was it so freaking good. Can't wait until the spring. I shall return!", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Stopped by at 1030PM and was quite surprised I did not know this place existed.\n\n\nI decided to have a Cuban sand which, listed as being voted best in the city.  I'm not sure I would go that far, but it's quite good, especially for the price.  \n\nI recommend the Cuban sand which, but I can not say anything about the rest of the menu.  I'll be back to test that out.  Great find on a cold winter night.  Gotta love the music and overall vibe too.", "author": "Brian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Food was delish and the music sounded like their was a live band from Miami! My hubby and I shared the steak burrito and pork burrito. Wish y'all had a full bar though and accepted credit cards.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "You can't go wrong with a huge patio and 2.75 Beers, and not bud light, I'm talking SixPoint Sweet Action.  They also have a brown ale.  \n\nI've been here on Sundays when they are showing old school movies out on the patio.  It's a very relaxed spot for people of all ages, including kids.  I haven't tried the food yet, but I know I'll be back next year.  They are seasonal, so they will be closing around Halloween until May.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "I absolutely love this place so I'm very sad to say my last experience was disappointing. I went there this past Thursday and was the food was cold and the corn was skimpy:( I mean SKIMPY!!!! \n\nWhat was really shocking is that we ordered a beef and chicken burrito. We paid $5.00 extra for the chicken so imagine my dismay when we received a PLATE of cold chicken!!!:(  I told them that we wanted the chicken inside of the burrito and they said \"we don't do that\". I mean, \"you don't do what, sir\"??? We paid for a beef and chicken burrito but you won't put the chicken INSIDE of the burrito because you \"don't do that\"??? Soooo...my boyfriend ate a plate of cold chicken along with his cold burrito. As usual, the drinks were on point but I was very disappointed with the food and service:(", "author": "Kimberly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "I went here after work with my girlfriend for the first time it was pretty cool. I love the decor and the outdoor space. I had the catfish burrito which was served with jalapeños and a spiked lemonade. The burrito was very good the jalapeños addicted that extra kick which I loved. The spiked Lemonade was ok but it could have been stronger. I'll definitely come back with friends.", "author": "Joanne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Since I have been here only once with a few friends about a year ago, I don't feel confident giving this place 5 stars just yet. I would need to come back another time.\n\nBut man, this place holds a spot in my memory for having the best cuban sandwich I've ever had. As far as other dishes, I can't remember that much except that people liked the catfish burrito, and I remember liking the corn. But the ambiance was very nice with the outdoor seating, and the food pick-up area resembling an outdoor food cart despite it being a brick and mortar restaurant.\n\nIt makes me feel like I am in Cuba. I should go to Cuba now that we are allowed to go there. But for now, there's Habana Outpost.", "author": "Alan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Decided to come here for dinner before going to a concert over at the Barclays Center.\n\nThe facts about this place: CASH ONLY. Solar-powered establishment/eco-friendly. Cute decor! There will be a long line for food (drinks \u0026 corn can be ordered on a separate line). It will be hot and crowded. BUT IT WILL BE WORTH IT!\n\nWhat we ordered: Cuban sandwich (yummm!!!), Grilled Chicken Plato (standard, but still good), Roscoe on a Stick (SO GOOD. A piece of chicken inside of a waffle-like puff with a drizzle of syrup and powdered sugar... to die for!), Roasted Corn (A MUST IF YOU GO HERE. SO DELICIOUS AND SAVORY.)\n\nMargaritas are a little pricier than I thought they would be ($8 and only one size), but they're pretty strong and tasty.\n\nI must must must eat here again!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Me and my husband FINALLY got a chance to eat here. I ordered the chicken quisedilla and I forgot what my husband ordered.... anyway...\n\nIt's very different than what I'm use to. It's a restaurant with a \"fast food\" style of ordering. There's a menu on the wall. No waiters and u sit wherever u want. That was disappointing. There's basically a food truck attached to the building. So u place your order insidr and pick up your food outside and then sit where u want. We wanted to sit outside but all the tables with the umbrellas were taken. I didn't want to sit in the sun. It would have been nice if all the tables were shaded. So we opt to sit inside. The decor is a mess. It needs a makeover badly.\n\nBut what they lack in decor and service, they make up in food! The food was sooooo good. The portions aren't large. It's just enough to satisfy. Perfect for lunch. I'd definitely return again.", "author": "Anisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "Colorful place. I knew it was going to be good when I walked in and George Michael's \"Father Figure\" was playing on the PA system. This place has great music taste, which is an underrated part of many restaurants, and it continued through the night. I was craving a Cubano so I had to order it along with the sweet plantains. I was in the mood for Cuban food. The one mistake was that my brother recommended I get one of the fruity alcoholic drinks: a mango mohita. All I could taste was the alcohol, not the mango. I originally wanted the mango fruit drink but since I wasn't driving anywhere, I figure alcohol isn't a bad idea. Oh well. Live and learn. The food was really good. The Cubano had swiss cheese but I could hardly tell from the taste. Plus, the sandwich was the perfect size, not too small but not too big so as to become heavy. It was filling too.\n\nEating outside was a good choice. It's a little chilly, but there's a little more color; a sense that the city is alive outside the walls of the restaurant on the outside instead of the inside.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Steak taco, Pork taco, Mexican corn, chicken and waffles on a stick.\nWhat shined through the most in this meal was the steak taco. Meat cooked to perfection, and seasoned to perfection in a good old Mexican-style taco. \nThe Mexican corn was good as well along with the surprise item on the menu which was the chicken and waffles on a stick. Unique in every way, my first chicken and waffle dipped in maple syrup experience was a good one to start with. The contrast of the salty chicken along with the doughy waffle dipped in maple syrup to combine the sweet and salty taste was nice to say the least.\nFor the steak taco alone, I will go back. That says a lot for me because as most that know me very well know, I rarely repeat my restaurant experiences.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Nice back yard areas to come with friends, dog, and even your kids to drink margarita and shrimp tacos are amazing.", "author": "Iriana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-27", "description": "Do not use caviar for delivery.  Food at habana is decent but they cut corners when doing delivery.  You get half the food and pay a premium for delivery.   I have given it two chances and both times food was missing or made incorrectly. \n\nSo who's to blame? Caviar or habana....\n\n\nboth", "author": "Michael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Cool crowd but the food is bland.  I ordered the chicken burrito and it was UNseasoned.  You'd think a crowd of black people would hold them to standard.", "author": "Ryan E."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}