{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-22", "description": "Ummmmm, as far as the food, it was just ok for me. I didn't find the corn to be  fascinating...it had way to much stuff on it, my mojito was slushy instead of frozen due to the machine not working and my burrito had mushy rice (as another yelper mentioned) which felt weird with each bite (sort of like biting into bubblegum). The atmosphere on the other hand is cool, just be sure to get there early if you want a seat outside. Overall, it's a cool spot if you're just looking to hangout.", "author": "Tracy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "I just really love this place.  The one in SoHo is so annoying...all these weird fashion industry people and tourists...but the Ft Greene one is like a concrete desert oasis.\n\nCan't really think of any better way to spend a weeknight (weekends are wayyy too crazy) than eating grilled corn, a grilled chicken quesadilla or steak burrito, some fried plantains, and OF COURSE a frozen mojito or margarita. Them drinks are hellof strong!!  \n\nI get really antsy waiting to order and it's sometimes stressful finding somewhere to sit, but it's always worth it.  Wish it were open year round!", "author": "Shira K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "Weekends are way to crowded, weekdays are cool....frozen drinks could be better!  Love, love, love the CORN!", "author": "Karen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "I love this place.  I've spent many nights indulging in their delicious and cheap roasted corn on the cob and drinking Brooklyn Brewery beer (from plastic cups; boo)   The huge patio is great and the place has a really good atmosphere.", "author": "Tyler E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "Food is good, but man, it's way too crowded for it's own good.  Where are all the nice quiet places in New York City?", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-20", "description": "Good food and layout, though the ordering process is bizarre and inefficient (order inside, pay inside, get drinks inside, give receipt to a food truck outside, wait around for your name to be called at very low volume), which basically just leads to long lines of very confused people.\n\nThat aside, the food is pretty good (although their famous corn wasn't as good as it was pitched to me) and seating is communal and pretty easy.  Good find for hanging out near the park.", "author": "Joe Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "I can't really eat here, but the other night I came to the re-opening 2009 and was bowled over. Solar powered lights, rain water toilets and an increadibly open atmosphere makes this a must visit. Even if you live in Bronx or just an antibrooklyn manhattaner, get yourself to Habana Outpost.", "author": "Brad S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-23", "description": "Awful service when crowded. I spent an hour and 20 minutes waiting for my food in the blazing sun outside. The system for ordering food is an absolute failure for big crowds so if you go, make sure it's not mobbed. The food is great though which is why I didn't give it 1 star, but the I had an awful experience today (enough to write my first yelp review ever). They absolutely need to rethink the process for ordering food, maybe hire a waitress or two?", "author": "Marc F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "Delicious, cheap, and filling. I had the Cuban sandwich, rice \u0026 beans, plantains, and the roast corn. Perfect with a guava Jarrito.", "author": "Jasmine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-28", "description": "I absolutely LOVE Habana Outpost. Where else can you find great food, cool people, drinks and sustainability all in one. They serve one of the best veggie burgers I've had. Sundays are the days you'll find me at the outpost, probably chowing down on a veggie burger and drinking a corona or something of the like, while watching the movie that they're showing. If you're in the neighborhood, I totally recommend stopping in for drinks and something to eat.", "author": "Ian F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Habana in the summertime is a definite must in Brooklyn if only for the atmosphere. The long ass lines are kind of annoying when it's crowded (and when it's nice out it's always crowded), but can be fun if you have the munchies after getting lit! Great for people watching, as well as the classic movies they show on Saturdays. The food and drinks are always on point, love the corn! No really you have to have the corn! and the mojitos are good too. Like another yelper said the location is Soho is better food wise but the BK environment well makes up for it.", "author": "Janelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "I love this place. Sure, you might have to wait in line, and yes, the seating gets crowded, but they are so genuine and the food is reliably good quality. Plus, $2.50 for a beer, and Sunday movies during the summers? I'll take it. I love that they take eco-responsibility seriously, and still make it fun with lively decor and a celebratory atmosphere. Awesome Ft Greene staple.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-14", "description": "I love the idea that its so eco-friendly. I thought their corn was absolutely divine and their drinks are so refreshing.", "author": "judy n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-30", "description": "LOVED this place, its so nice to sit outside on those picnic like tables on a summer evening and share some tacos, corn and beer with your friends. Real casual place with a mixed crowd, and I hear it can get really crowded but the day I went it wasnt so bad...I got two fish tacos for like 5 bucks. The fish could have been seasoned better, but overall it was a good taco and make sure u put some chulola(sp?) hot sauce on there!! Takes it from good to great. As everyone else mentioned, corn is great. I cant wait to go back, esp since they will be closing soon for the winter months.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-22", "description": "habana outpost and their delicious lemonades, their wise eco-practices, their ability for us to pine for them once spring arrives. habana incites cuban food to me, which is funny because the burrito and elotes-laden fandom is mexican fare from my midwest knowledge. with the quirky menu and the matching kitsch of the surroundings, you can catch many scene-sters and now, haggles of yuppy moms wading in the sun. on an ideal day, a great snack and comforting crowd. on a bad day, sticky humidity surrounded by upwardly-mobile customers who want a brooklyn aunthentic-feel. if your craving is right on any of these days, the corn is overpriced (in chicago this street vendor food done just as well costs $1.25) and still quite undeniably glorious.", "author": "kay b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-23", "description": "Habana Outpost is a fun little spot.  The food is outrageously good and the frozen mojitos \u0026 margs are delicious and the atmosphere is really fun.  It serves as a great setting for a fun night out with friends. The eco-friendly vibe is interesting, and the decor is fun -- picnic tables, rainbow-colored umbrellas, and the like.  I really enjoy the crowd here, which is generally low-key and diverse -- there's always good people-watching.  My only real complaint is that it closes at midnight!  Boo.", "author": "Micaela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "just got back from a quick beer and corn.  had to get some outside goodness before the rain clouds come in.  i love the atmosphere there.  good folks enjoying good food, drinks and company.  $2.50 draft beers and you must get the corn for only $2.  we were discussing whether habana corn is better than red hook ball fields corn.  i think the flavors of habana's is superior however you get more in red hook.\n\nget your butt out to habana outpost at least once this spring/summer.  you won't be sorry.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Don't bother with the $8 frozen mojitos or margs. Sixpoints on tap, light or dark, are only $2.50 each.", "author": "Ted L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Usually too crowded on a nice Summer afternoon, but we were lucky being so late in the season. Got an outdoor table right away. Chicken quesadilla was pretty darn good. Beers were super cheap: $2.50 for Six Point!!  DJ was playin jamz from middle school/ high school days. A perfect way to say goodbye to Summer.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-03", "description": "Nice quick bite here, went here to have eat after drinks at another bar.  You order the food from the counter and grab your food once ready by the a small shack outside a sitting area.  I got the deep fried catfish with rice and beans.  The fish tasted bland and the rice and beans are ok. My friend got the pull pork which also aren't any better. It was less then $10, so didn't have high expectation, but I think it could have been better..", "author": "Tom H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}