{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "absolutely wonderful and the margaritas arent too bad either. dont forget to try theyre roasted corn", "author": "Brittney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-02", "description": "Dear yummy flavored corn, I see you've returned to taunt me again. The taunt stings less though because the weather's nice and you're being sold to me again. You truly are the best two dollars of food on this coast. \n\nGreat Brooklyn beer for cheap + fun atmosphere you want to keep coming back to. \n\nBeans and rice and plantains oh my!", "author": "Rhubarb M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "What a perfect place to stop by on a hot summer day to drink a cold beer and eat corn while you sit outdoors underneath an umbrella providing just the right amount of shade to keep you cool. \n\nThe corn is really good. It's really sweet and burnt on fire then completely covered in Parmesan cheese and chili powder. The beer cups r pretty small but hey, what do u expect for under $3? If I had a lot of time and didn't have to drive after wards I would've sat here all day. \n\nI'll be back.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "I really love this place, but I live steps away from it and can wander over whenever I want to--and more importantly, decide to avoid it when it's looking too crowded. It gets crazy busy at night, to the point that I've never gone in there past about 6pm. I personally think it's a fantastic place for lunch or an early dinner but kinda overwhelming as far as a late-night hangout.\n\nI really like the food--it's always fresh, their juices are amazing (pineapple ginger--yum!), the corn of course is fabulous, the guacamole \u0026 queso sandwich is awesome (creamy fresh guac, yummy cheese, spicy chipotle mayo, hot \u0026 crusty grilled baguette, so good!) \u0026 they're always good for a perfectly charred burger! \n\nI'm not sure if I would recommend it to people who aren't already in the area or not . . . I think it's definitely worth it to make the trek out earlier in the day (at least before it gets dark) when you can actually enjoy the outdoor seating, the cheery \u0026 brightly colored exterior, the fun eco-friendly elements like the bike blender, the food \u0026 the experience of actually sitting and having a conversation. It has a very low-key, welcoming, neighborhood block party sort of feel to it, and it's a nice place to sit and chill on a summer afternoon. Also, it's missing that \"you must be a hipster sporting an edgy (read: ugly) haircut \u0026 a quirky (read: ugly) outfit to hang here\" vibe that too many places 'round these parts seem to have. Another great thing is that it's perfect for any mix of people, whether you're going by yourself, with friends or with family/kids. \n\nThe *evening* is another story entirely. At a certain time of night, the sidewalk on Fulton \u0026 South Portland is slowly taken over by girls in tiny shorts and guys in oversized shirts all trying to impress one another \u0026 all trying to get into (or escape the crowd of) Habana. If you go at night you're going to wait in line, your food is probably going to take forever and you're going to be crammed in there like sardines. That being said, the place does still have a really fun \u0026 laid-back vibe and it hasn't been *completely* overtaken by people who think they're too cool for skool yet.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "Mmmmm mm!  Had the pulled pork sandwich, plantains, and a beer the last time I was here.  Everything was delish!  The sandwich was the best pulled pork I've ever had.  It had tons of meat, jalapenos, a little bit of spicy mayo, all atop a crunchy roll.  Big sandwich for $7.50!  Plantains were yummy, and beer was cheap.  Whole meal was $13, not bad!\n\nTrying the cheesy corn and quesadillas tonight!  Woo!", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "My favorite summer time place to hangout eat great food and have superb drinks and chill", "author": "Ray S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Cute spot in BK.  Very diverse which I loved! A ton of picnic tables for seating, so sitting in a skirt became a skill I picked up while there.  The food was hot \u0026 the Mexican corn was delish! A nice place to hang out on an afternoon that isn't too hot and grab a bite and a quick drink with friends!", "author": "Jojo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Habana Outpost... I've been visiting here a few times during the summer. I enjoy the food.. but  I really enjoy the Drinks..... It's a cool spot, come with friends, family and just sit outside take in some fresh air.. just a nice relaxed time.. BUT!!!! as of recently it seems ppl view it as a club.. now there are Bouncers at the doors.. and the area gets flooded with motorcycles and the fashion show gets into full effect.. SMH.. I stay away Friday \u0026 Saturday nights.. Best time to go for a nice relaxed time is mid day any day... or go during the work week or Sunday nights.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "I live right around the corner from Habana and get so excited when it re-opens in the summertime. Its such a great spot to have cheap local beers and good food while soaking up the sun. All the food is good, but I recommend the Mexican style corn and avacado cheese burrito if you're having trouble deciding. Even cooler is that they have Sunday movie nights and are environmentally friendly.", "author": "Terry N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Drinks are great! Food is ok! Crowd is graciously mixed! Overall, a good experience.", "author": "Sunshyne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "What a great, cheap way to spend a lovely, sunny afternoon in Brooklyn. \nThe corn is unparrelled, the draft beer is cheap, and the crowd runs the gamut from young beligerent fools to young families.", "author": "Mika P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "Awesome tacos, corn on the cob and burritos (the steak is particularly good). Wonderful outdoor seating area with loads of character and projected movies on the weekend. The perfect outdoor spot in my opinion and a pretty hard Mexican spot to beat all round.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-13", "description": "This place is close to where I visit so the convenience is 5 star for me.  The roasted corn is wonderful.  I had a steak burrito and was happy with all the fresh ingredients and flavors.  My lunch partner said he thought it was a little 'too arty' for him if that means anything to anyone.  Not a classic perhaps?  I thought that was a good thing.\n\nIt is crazy at night so I am only recommending this place for lunch.", "author": "Beka M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-03", "description": "Just a hangout - nothing to rave about - grilled corn was what they're known for, its so so", "author": "Katz Meow I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I was here on a Friday night, and while the place was packed, there was no line to get in and no cover. Went for the $3 drafts and had an awesome(ly cheap) night! I'll be back to try the food!", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "I dont know what more i can say that the last 250+ people haven't. However I do really like this place its very chill and perfect place to do something chill with friends, especially when the weather is nice. Convenient since its in my neighborhood. I LUV the drinks and the chicken fingers! Yummy! \nI'm no tree-lover but I'm pretty impressed by the eco-friendlyness of it all :)", "author": "Ladi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Pretty cool place, although their food tends more Mexican than Cuban. Was here last week and was glad to have some elote.", "author": "Y R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "I went here on a Saturday afternoon in the summer and sat in their backyard. It was awesome, the drinks are cheap, the food is yum (had the cuban sandwich), the atmosphere great, and prices overall good. Will definitely come back here next summer with some friends!", "author": "Lina E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "The corn, fantastic.  Burritos?  Amazing.  Cheap Six Point!  Mind the crowds....\n\nFor an outdoor venue, this place is the best you'll get in the neighborhood.  Lots of outdoor seating, constantly filled, mind you.  The weekends at this location are PACKED.\n\nThe roasted corn on the cob is just unreal.  The spices, lime, and a dusting of fresh cheese all blend together.  Personally I add a little Cholula, which they always have on hand!  I don't even mind that I get covered in it.  It's good enough that I don't care.  I'd roll around in that combination of flavors.  =D\n\nSo show up early, camp out a table with friends, and enjoy quality food and astonishingly cheap good beer!", "author": "Alan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "I love it ! Drinks are great and the corn is the most amazing Corn I ever had !  I will be visiting often. Drinks add up very quick. Trust me you're gonna want more  it's a cash only spot be sure to bring cash !!!!! It's a unique atmosphere for a chill night.", "author": "Debbie C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}