{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-29", "description": "Living just around the corner and given the eco-friendly design and my love of Cuban food, I really want to love Habana Outpost. I was introduced to Habana-to-Go this week and the corn on the cob and plantains were to die for. I decided I must have more. \nWhen I tried to come to Habana Outpost the following evening around 7PM, the line was out the door and I wasn't willing to wait. I waited out a shorter line tonight (a Friday) around 5:30 but was very disappointed in the results.\nI ordered the Ginger Pineapple Lemonade, sweet plantains, and grilled corn on the cob. I love ginger and lemonade and don't have any issues with pineapple, but unfortunately all you could really taste was the pineapple and absolutely no ginger. The plantains had a tough texture as compared to the amazing ones I had earlier in the week and the corn on the cob was good, but not great. The cheese topping just wasn't the same. To top it off, I was scolded by the guy in truck for not specifying \"take out\" at the counter. \nPerhaps it was a bad day given that the restaurants are under the same ownership, but I'm not too motivated to try it again. I was going to bring friends here tomorrow to enjoy the sunny day out on the patio, but I'm going to come up with a Plan B.", "author": "Terry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "Nice place, decent looking crowd. Only problem is the lines are long at times and ordering food isn't quite straight forward.. If you don't like Corona or the Spanish drinks they have there (be warned some are really bitter) you might be in for a long night.\n\nYou might not get a seat too, so be prepared to eat while standing if you decide to order food, or if you have a nice BIG smile someone might offer to share a bench with you :)", "author": "Bayisana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "I love Habanna! \n\nCheap beer, good drinks, great food- you MUST get the corn!\n\nSo tasty. \n\nThe only drawback is on a saturday night the food truck gets a little hectic and it's hard to snag a table/get your food at the same time without a team of a few people!\n\nBut so much fun, it's worth the wait in line!", "author": "Emily B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-10", "description": "What a great idea that is executed horribly.\n\nI love the idea of an eco-friendly restaurant that serves great food. Too bad they didn't stick with the tested solutions to ordering and serving food. The place is horribly organized. There are no real signs and simple roped lines would work wonders, once you order you hand deliver a ticket to the cooks, who seemed to lose one in three orders. Whatever happened to waitresses? Or even an organized system for getting the cooks the orders and checking if the correct people pick up the order?\n\nThe food was good, but not worth the pain in the ass.", "author": "Brett W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "Very cool place. Damn the corn is awesome I had to try it after reading previous yelp reviews. Also had the sloppy jose very tasty and a nice spicy kick to it. Had mojitos and margaritas both very good. \n\nI will be going back.", "author": "Ray W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "This place was so cute! The patio was hopping on a Sunday afternoon, and they were blasting some great classics from Michael Jackson and Prince. Only food I tried was the grilled corn, which was tasty, but a bit heavy on the cheesy mayo-type sauce that covered it. As others have said, beers were really cheap, $2.75 for local drafts. My friend had the frozen margarita which was sweeter than I like, but really strong. I had a great time hanging out here and would definitely be there all the time if I lived nearby.", "author": "Allyson P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-29", "description": "$2 Brooklyn Lager beers. An outdoor patio that feels like a beach side San Diego taco joint. I couldn't ask for anything better. \n\nFun, relaxed, delicious. A great place to unwind, and for those of you (like me) who need it, feel like you're not in Brooklyn anymore.", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-01", "description": "Ok. The corn was pretty darn good. If I was rating this place by corn alone, it'd get 4 (or perhaps even 5) stars. \n\nAlas, I'm not. I'm all for eco-friendly places. You can tell they don't use modern, high-consumption technology because it takes about 45 minutes for your food to come out after you've ordered it.\n\nThe meal was good, though not spectacular and the portion size left me wanting more. (Perhaps that's why Cafe Habana offers fries with their sandwiches.) The restaurant itself is fun and happy and the atmosphere is relaxed. Still, that wasn't enough to save this place for me.\n\nI might go back for the frozen mojito. That could have been my problem. And even if it wasn't, at least that way the hour long wait for my food will be more tolerable.", "author": "Mathew T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "Used to go here a couple a yrs ago in the summer. I keep saying I am going back - but just havent gotten around to it.\n\nIts a cute place to chill and grab something to eat in the summer. Outside is usually loud - you will have to hustle for a table - def not something easy to come by. You basically stand there with you food and grill/ stalk people until they are ready to get up - kinda creepy sometimes. Drinks are okay - food is okay. To be honest - I dont really come for either one. Its more so like a cute place to hang out in the summer and chill with friends and other random people. Oh yeah - and there was a DJ when I used to go - not sure what the deal is now. \n\nHot Day - Cold Drinks - Good Company... you'll have a decent time.", "author": "Kris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Now I can also comment on the Guac \u0026 Queso burrito--absolutely scrumptious, especially with some hot sauce. Even better than the catfish by my books. The corn is also a must-experience, although I've now had it twice and the first time it was much better than the second. (I suppose there is an element of inconsistency at play here). But still, the price is right, the ambiance is perfect (so long as it's not raining), and the food is delish. Just don't try to go here during the winter because you'll be most disappointed--it closes for the winter season, only to open again sometime in the spring.", "author": "Elliott C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-05", "description": "The place is super cute and has the great outdoors but the line just kills it. I don't think I'd even come here if I lived nearby...who wants to wait on a line like that.  There are 2 lines in side...one for drinks and corn and another for food. The have 2.50 Black Star beer on tap and 4.50 Coronas, other than that they have pre-made frozen margaritas. No full bar, no drink making...so I don't understand why the line. Really long and slow.\n\nThe food line is even worse. You order then go out to the truck and pick it up. I didn't eat here but I've been at Cafe Habana in the city and It's the same place basically so I imagine the food is similar. I don't like Cafe Habana to say the least.\n\nCute outside...but not worth the hassle.", "author": "Marina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "I know that there are so many mentions of the corn, but it is quite amazing. I am happy that there are more eco-friendly places so that alone gave it a star. \nThe line can be scary... seriously scary\nI like the veggie burger. It's one of the best that I tasted. Mind you I am not a vegetarian!", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "Meh.\nWhat else can I say about this place that hasn't already been said?\nGreat frozen drinks, good grilled corn, average to below average food.\nThe outdoor picnic area is great for chilling if it's not too crowded, but it becomes a nightmare the warmer the weather gets, in fact the entire intersection that HO is located on becomes a nightmare during summer nights due to HO spillover.\nHO.", "author": "Gee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "I love the habana it's a cool hangout,it  has  outdoor sitting as well  as indoor, but everybody wants to be out, the food it's pretty good it's a mixture of tex-mex, and  cuban,the best it's the grill corn on the cob,and of course the drink of the house ,  the mojito which  it's frozen,and the coolest it's that is a solar cafe everything it's powered  by the sun.If you want to go on  weekends  you'll be  waiting a lot,so try the weekdays it's not so bad except for the nights,when all the cool people meet there.", "author": "Mariana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "Is it just me, or is this place totally style over content? The entire menu is made in what essentially amounts to a curbside food truck, despite a spacious seating area.  There are few options, they tend towards being slightly overpriced but come with no sides. I haven't had the iced cocktails, but they look pretty darn small in those ice-filled plastic cups for these Manhattan prices.\n\nAnd as for that style, I think the motif comes off as incredibly tacky. The signs, the color scheme, it all kinda seems childish.\n\nI know this place is popular for its events and its eco-friendly projects, and that's what makes my two stars very difficult. But I'm not the least bit impressed. The food leaves me hungry, and the style takes away my appetite.", "author": "Rocombey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "Such a cool atmosphere and amazing space. The drinks and food are pretty cheap for what you're getting. I would have given it 4 stars easily, but my food was just mediocre. I think I'll do more drinking and less eating here in the future. But maybe I'll give the food another try. Overall I would definitely recommend this place. A great place for a group of friends on a nice night.", "author": "Julian T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "Really fun atmosphere, especially on a nice day. The food was good, but the chicken was dry. I had the quesadilla and my sister had chicken tacos. The fried plantains were amazing!  Excellent spiked lemonade too.", "author": "Anne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "This place is right down the street from me and is the perfect place to stop in on a nice day to grab a bite and some drinks. While at 8-9/Frozen Margarita is a bit steep for the small cups they serve them in, the drinks are refreshing (although not very strong). Don't go here to get drunk, do go here to drink cold frozen drinks on a hot day with friends while sitting in the back patio. Do order some corn which is crusted with machengo (or some kind of Mexican cheese) with chili and lime, do get burritos, tacos, or a sandwich...everything is fresh, relatively cheap, and delicious. On nicer days you may have trouble getting a bench to sit on, but there is also seating indoors. Weird that there are bouncers here, but overall a good spot to check out and always good for takeout at the very least!", "author": "AJ K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "Frozen margaritas.  Yummy food served out of a truck.  Ample outdoor seating.  Eco-friendly...what more could I ask for?\n\nNot much...however, I'm taking a star off cuz there's something about this place that makes it almost borderline too much.  I think we happened to catch it on a good night cuz we were served quickly and found a seat outside.  But I've had that not happen before and in those situations it can be kinda frustrating when you're standing around without a place to sit as there's no real \"bar\" area to speak of.  And two bathrooms [however cool they might be] + 100 people drinking heavily is just never a good combination.  Plus, it's kinda expensive...$29 for two sandwiches [which were mad good if I might add] and two margaritas.\n\nEh, whatever...it's summertime and Outpost lets me drink tequila outside.  I'm down.  At least it's not in Park Slope.", "author": "Shaina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "There's nothing like a humid summer day and a frozen mojito at Habana Outpost.  Okay, so the mojitos are a little bit on the pricey side for such a casual place but it's cool since there's picnic table-like seating out in the wired fenced in concrete area.  \n\nSo you go inside, order, pay, get a ticket and then you go pick up your food at the truck outside.  I tend to get a little nervous as sometimes it's so packed, I can't hear the person sitting at the next table, let alone the guy on the truck yelling out your name to get your order.  But it works out.  Usually the porter guys will echo the name through the area to help out.  \n\nSurprisingly, the inside is a little \"neon-ish.\"  Doesn't go with the decor of the outside of Habana but oh well.  The bathrooms!  Oh my, try going in the fall when it's chilly out.  You'll realize your bum is cold because there's sorta no roof in both of the stalls.  Go check it out.  I actually kinda like it.\n\nFood is good though not outstanding.  I go for the atmosphere - I think they still have movies on Sunday nights?  It's broadcast on an external wall of a building next door.  Oh, and if I remember correctly, there's one beer that's always 2 bucks for a just less than pint.\n\nCheck it out :)", "author": "Karen H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}