{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "I'm keeping this review simple. Good Food. Good vibe. Long Lines that move fast. I got a quesdilla and frozen margarita with a side of corn on the cob. It was delicious but the LINE WAS OUT THE DOOR. Be prepared to watch the number thingy so you'll know when to pick up your food. Cell service kinda sucks in the back but I'm not sure if that was occuring to everyone. There are 2 lines..one for food and one for just drinks and corn. obviously, the drinks and corn line was super short because everyone was there for food. overall, i'll go again. i heard someone say something about them showing movies on the weekend on the wall which sounds like fun. Also, this place is only open in the summer...from my understading.\n\nIt's CASH ONLY. Let me repeat...CASH ONLY. Womp. Womp.", "author": "Alessia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-11", "description": "All three stars are for the decor and the patio, which charmed me with its happy crowd, family-style seating (everyone just crammed in together at communal picnic tables), and lights. Heck, probably even a star in here for the blue and green paint. Actually, hey--also some props for the fact that the long line went fast, and the food came quickly.\n\nBut the food? The food gets like, 1.5 stars, and that's just for the corn. The taco was fine but dry, the salsa verde cup they give you is smurf-sized, and the chicken quesadilla was the single worst, least-cheesy, most-dry, most under-seasoned, least gooey \u0026 delicious quesadilla of all time. It had a schmear of dried salsa verde and a schmear of dried sour cream, like it sat under the warmer for a little bit. I doused it in chalula and pretended it was a Taco Bell quesadilla. \n\nIf you go here, like the crowd--it's this place's redeeming quality. And skip the long line and the food. Eat beforehand, and then just hop in the corn/margarita line.", "author": "Miranda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Such a fun place! Get the corn, they're amazing. Sunday nights are movie night, they usually show old, classic movies. I loved sitting outside eating tacos and drinking frozen margaritas while watching \"the three amigos\". This place is such a gem. Frozen margs are strong, mind you.", "author": "Laerke V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Love coming here in the summer for the scene. Outdoor seating and frozen drinks. You can't get much better. Food is just OK though.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Great atmosphere. The grilled corn was good as well as the drinks burrito and quesadillas", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Spread love it's the Brooklyn way... Nice chill spot in the summer. Live DJs from 12-6 on the weekends. Music all the time tho. Only thing that sucks is cash only. ATM is inside so not so bad. Price is reasonable for food. The Food is good.  Little pricey for the drinks tho. Good location soon exit the train in ur in front of the place.", "author": "Tyson S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "GEEZ THE CORN IS SO DELICIOUS. take all my lunch money, already.  a little pricey but the fish tacos were delicious, and the pina coladas were solid.  fun atmosphere, and who doesn't want to eat corn and color Biggie's face??!", "author": "Aly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Habana is a cool spot to hang out if you're yearning for sun, drinks, and a laid back atmosphere. The food is pretty mediocre. I had the chicken casadias which tasted like American Mexican chain restaurant food. Also, Habana is a CASH ONLY restaurant which is such a pain. If it weren't for the sun and the awesome frozen margartias I would have gone elsewhere.", "author": "Brandie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Came to Habana Outpost for their July 4th showing of Top Gun. The place was packed, we were lucky to get outdoor seating with a great view of the screen. I loved the showing, but it started late so keep that in mind if you're on a schedule! Besides that, the food here was great! We had mexican corn, catfish tacos, rice \u0026 beans, and pork tacos. Everything was delicious, but the tacos and the corn were fantastic. That mexican corn was cooked to perfection and seasoned just right and the tacos had the right amount of ingredients and heat. The margaritas here are great too, they are large and worth the money! I can't wait to come back to this cute spot, it seriously was the highlight of my july 4th weekend :)", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Chill Vibes....GREAT DRINKS (especially the Frozen Mojitos-my fave), Perfect Location, Beautiful People all around. oh and the Corn...YES the CORN.", "author": "Kaylan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "When I first found Habana I went two nights in a row and got the same thing both times. The best chicken burrito I've ever had! And that corn. It weirded me out a bit at first that there's so much mayonnaise on it, but it really is delicious.", "author": "McKenzie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "What a fun place to be! This is the spot to take your friends for drinks, Cuban / Latino food, and a good time! They have a huge outdoor patio and communal benches. Keep in mind it does get crowded here as it's a popular spot in the summertime. So be prepared to wait in line!", "author": "Caroline C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "How in this day and age can a place like this be cash only? And to boot, their inside atm was broken so no way to get cash if you didn't bring it. Just ridiculous.", "author": "Kerri M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Love this place. Cuban sandwich is the best i have ever had and I've had quite a few. Roscoe on a stick, corn on the cob and frozen drinks are on point. My new favorite.", "author": "Ray R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "The only way I can even justify the 1-star is for the staff- they were super friendly and made you feel at home. Gold stars for them! So, I was excited to return to Habana Outpost since I was in the area and remember eating the corn outside on a hot summer day years back. Well it wasn't at all how I remembered. The food was cold at the takeout location across the street- came back to the main site to try again-same thing ICE cold. I was so disappointed and my friend was sick from the food all weekend. Word of precaution: make sure your food is hot!!!", "author": "Sandy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-19", "description": "Strictly food speaking, the place was only A-OK. \n\nI know everyone else recommended the catfish burrito, but honestly, I did NOT like it!! The fishiness just permeated the burrito and so it didn't taste good at all. \n\nHowever, the CUBANO on a SANDWICH is highly recommended. It's savory, like a nice Philly cheese steak, but somewhat....different (in a great way). I seriously never tasted anything quite like it, and I am amazed at its novelty. \n\nThe corn is not like anything I've ever had before. It tasted pretty good, but I felt like it was bit forced in that they added so much seasoning on it that I could barely taste the corn itself. I still recommend it, though, because after all, it IS one of their specialties. I have to admit that they did a great job of not overcooking it though. Nothing's worse than trying to nibble soggy, squishy kernels off the cob.\n\nOverall, the portions are a bit small, but it's enough to keep you satisfied. \n\nMore than anything, I loved the milieu. It's a very cute place, full of vibrant colors. The outdoor seating is self-seated and family-style arrangement. I could see it being a great bar scene at night, so perhaps I will return for it's nightlife. As for now, I won't be coming back for the food any time soon.", "author": "Rose W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-28", "description": "I came here on a cool spring night, and opted to take a seat indoors. I got the steak burrito and a frozen margarita. The steak was a long, thick slice, and pretty juicy. It had some rice and beans in it. It wasn't exactly bursting with flavor, but it was satisfying. The bottle of hot sauce at the table took it a long way. The frozen margarita was alright.\n\nEverything was a bit too underwhelming and expensive for me to want to come back. Still, there's probably something to be said for outdoor seating in the summer, easy food, and a place to eat in Ft. Greene.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "One of the best Cuban sandwiches I've ever had!! Full of flavors, juicy and for a good price! It's a really chill spot in Fulton and I think they do movie nights on Sunday the elote is amazing!! In general all the food was tasty and full of flavor I would definitely go again!", "author": "Santiago C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "Well we wanted to order take out but we just called and said we wanted take out and not knowing we righy in front she said we close but as I wait in the car literally in front of it then my friend went inside and order take out but her face was priceless. ...I mean what the hell just because yall don't want to stay up late and take this last money cause every customer thats come brings money on the table so after my long ride all I wanted was some spanish food! But Hopefully the food will taste good if not yall will know about it:)", "author": "Kay. K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Ok so I went here with a friend on a Thursday night. We both had chicken quesadillas and frozen margaritas. The chicken quesadillas were really good and the frozen margaritas are really good too. If you come here, you have to try one, they are 10$ though and they put them in a small cup which I think is kind of a rip off. This place DOES NOT take credit or debit which is why I gave it 4 stars, and to top it off their ATM didnt work. The place has a good vibe and outdoor seating so if its a nice evening in the city and you just want to chill out, I would recommend it.", "author": "Monique J."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}