{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Good, quick Cuban food right on Fulton. The frozen margaritas were surprisingly good per my associates.  Cute outdoor bathrooms and decor. Nice patio.", "author": "Olivia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Would've given it 5 stars but I found the Catfish Burrito to be too dry. I wish they topped it with red and green sauce like many other Mexican restaurants. Aside from that excellent option and affordable prices. The draft beers are $3.50 all day everyday and Burritos around $8.50. \n\nThey have outdoor seating. The lines get long here. I highly recommend visiting on a weeknight or early during a weekend. They have the best Corn on the Cob I've ever had during my entire existence!! Seriously AMAZING!!! Please go try it. Great place for a quick meal and cheap drinks. I can't wait to return.", "author": "Yanill P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "I went on a thrusday night at is wasnt packed! Laid back vibe kinda place. Drinks are strong, cheap and good.. I got the catfish burrito and wasn't impressed because it was not seasoned. Very bland. However GET THE CORN!  It's very good!", "author": "Thomas D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "I rarely take the time to write a Yelp review. That said, the customer service at Habana To Go was so awesome tonight that I could resist. I go to Habana Outpost often for margaritas and chips during their open season. I love their fish tacos - not greasy, lots of flavor, delicious! So, when I was down the street this evening getting my hair done I figured I'd walk down the block while my color set to grab some tacos. \n\nFirst, the young woman at the counter was DELIGHTFUL. She was patient and kind, giving me time and guiding me when I couldn't make up my mind to save my life. She must have seen the disappointment on my face when I inquired about the veggie taco. I said, so what veggies go into that one? She said well, it's guacamole, lettuce and tomato. Again, she must have seen my \"oh that's it?\" face. Without skipping a beat, she said, we actually have a vegetable mix today that is sautéed, why don't I have them throw that together for you? And let me tell y'all, it was DELICIOUS. So, here I am, hair setting and my salon calls to tell me that I need to come back - I've clearly taken forever to make a decision. (Concerned that my hair would snap into pieces) I went to the counter to inquire about my order. \n\nThe manager has since come behind the counter and heard my cries for help. She insisted that I go and she deliver the tacos to the salon down the block. Seriously? Amazing. Note: it was really really cold tonight and she volunteered to go outside. Not only did she bring the tacos straight to my salon chair, but she brought me a free water bottle. \n\nHabana staff, you made my night! Thanks for being so kind. It's the little things that keep the world smiling.", "author": "Becca K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "This is my new Sunday spot .. The steak tacos are awesome .. U need to try the corn on the cob !!!! My fave drink is the mojito ! And also Cuban sandwich is really great as well ... U can't go wrong comin here", "author": "Raisa V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "This is a fun outdoor spot to sit outside and drink with friends.  You can chill and people watch to your hearts content. Also great for groups. \n\nHowever, I have to say I feel like this place is coasting on its past glory, if it was ever considered glorious, when it comes to the actual food and drink. \n\nGuacamole - meh\nMargarita - meh (especially for what tastes like a Walmart frozen mix)\nTacos - meh to decent, depending on what you order. I'm partial to the shrimp tacos. \nCorn - don't bother\n\nI usually come here because someone else has invited me to a group outing - like a birthday. It's festive and cool for that.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "One of the best spots in this neighborhood to hang out outdoor and eat amazing food!!", "author": "Naghmeh F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "Had been here a few times before. The atmosphere is fun, lively and great DJs. I usually come here for the Cuban sandwichs. I feel that the flavor is still there but the passion in making them fell off. The ham was cold, the bread was barely pressed the way it should be. The beverage waitress inside ruined my visit. She was very rude and nasty. Her attitude was extremely uncalled for. I went to get drunk twice and the second time was as bad as the first. She made me feel very unwelcomed. Not sure ill return just because of her attitude", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "A Few Dos and Don'ts for Havana Outpost:\n\nDO the Frozen Mojito\n\nDON'T have the salsa and chips, the salsa is bland\n\nDO the guacamole\n\nDON'T have the Ginger Lemonade, not enough ginger and little on the alcohol\n\nDO the plantains\n\nDON'T stand online longer than necessary, there are two lines, make use of them\n\nDO sit outside, if you can, a lovely experience on nice day", "author": "Jade A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Great food and cool atmosphere\n\nThe shrimp tacos are amazing and the corn is to die for. The drink selection could be better but overall a good place for nice food and a laid back ambiance.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "I finally made it here this past weekend after wanting to come for the longest. The atmosphere is cool. It's a nice place to relax with a group of friends. I had the chicken sandwich, sweet plantains and Sangria. My bf had the guac and queso plato, Mexican corn, and spiked lemonade. Everything was tasty. I loved my sangria but the spike lemonade needed some extra spiking so I paid an extra $5 for a shot of vodka in it. For all that the bill was about $45-50 which is pretty reasonable for 2 people. \n\nMy only problem was with the security patrolling the place. It was my first time so I'm not sure if anything happens in here but he was walking around the restaurant like a bouncer in a club. Made me a little uneasy because I wasn't sure if I needed to be on the look out like he was... \nEither way, I'll be back.", "author": "Jenya W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Newly moved from Manhattan... I have found my little piece of heaven.  Really amazing food, large outdoor area curated by a DJ with nice music, but most importantly... the Food. Oh the Food!! So fresh, so yummy. The chips are super crispy, the corn on a stick- fantastic.", "author": "Nilay S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-22", "description": "We were tired and starving.  Place looked cute and they claimed they had the best cuban sandwich.  \nBest Cuban sandwich in ny? That's all u got? Ehh, I've had better.  \nWe also ordered a chicken dish.  When we asked the server how big is the serving, she asked how hungry we were.  We said we were hangry.  Then she said that chicken serving is good.  We get the food and we're like uhhhh, that's not a big serving.  Either we're heffas or their portions are just different.  \nJust not impressed.", "author": "Claire J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Great food. Pay before you eat so you leave when you are ready. Pretty good food for a small price. Outdoor cafeteria style seating. Can be annoying to find a spot to sit. Weak drinks lol and cash only.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Great fun place to go to in Brooklyn. Great outdoor area. I wish they wouldn't keep increasing their prices. Last summer the taco was cheaper than this year. I guess it's getting more popular and they decided to jack up the price.", "author": "Ali B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "Good as a hangout spot - outdoors, frozen drinks, casual crowd etc. But tacos are mediocre - my chicken taco came looking listless and no part of it was warm; pork taco was warm and good on first bite but dry after that. \n\nGrilled corn is generally good (things smothered in cheese are hard to do wrong!) altogether have had a dry ear of corn before, underneath that wonderful cotija/mayo/lime.\n\nService is aight. Cashier got our order wrong, but the kitchen didn't want to fix it bc it wasn't in the order. We had to push back to get it fixed.", "author": "R L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "I really enjoyed this place. It was reccomended by my cousin from Brooklyn and I was sceptical, but I got 2 tacos there and they were on point.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Great social house with pretty good food. The chicken plate was boring and the chicken was a little burnt giving it a not so great taste but everything else made up for it. The fish tacos are amazing And so is the roasted corn. Margaritas are pretty good too! Great spot to catch up with friends.", "author": "Dominique S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Can't go wrong if you have a Biggie mural painted on your restaurant wall. I used to live in Fort Green and this was one of my go to spots. I especially enjoy the corn.", "author": "Hassan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-05", "description": "Other than only accepting cash, this somewhat rundown outdoor space is somewhat perfect for parents with young children during afternoons of warmer months. \n\nFirst, you don't expect it to be a problem (and trust me, it's not) if your child messes something up. Napkins and menus were blowing all over the place while we sat outside one early Fall afternoon. \n\nSecond kids seem to like it. For whatever reason: the bright colors; the neglected water fountain; the self service or the freedom to run around in Habana's vast angular space, the other kids had the same lit-up-like-a-Christmas-tree look on their faces as my toddler. So no matter how much I was itching to get out of there, i tolerated it because he was having a good, simple, no pressure time. \n\nThird, the system is a bit of a pain the arse, and kids love to see their parents annoyed. If you take the side entrance, you'll have to walk inside to grab a menu, go back to your table to figure out what you want, go back inside to order and pay, then back outside to wait for your order. It's kinda like being at your single cousin's house for a 3 p.m. bbq that really starts at 5, only you have to pay. \n\n$19 and change for chicken fingers, fries and a chicken sandwich seemed steep to me. What happened to Brooklyn being cheaper than Manhattan?! Guess that doesn't apply to Fort Greene anymore.", "author": "Michelle W."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}