{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-30", "description": "Awful! Awful! Awful! Nothing in my burrito tasted fresh, the chips were stale \u0026 the salsa was bland. The frozen mojito tasted more like a Slushee, with little or no alcohol. Do not waste your time!", "author": "Abigail T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I love what these guys do with their energy choices, so I am an automatic fan. Tasty food, fun energetic atmosphere. I haven't drank here, so I can't comment on that. I am vegan, and they were helpful. if you are vegan ask for NAKED CORN, with just cayenne. It is cheap, fast, and satisfying!", "author": "Scarlet R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Love being able to sit outside and I like the casual feel, BUT when you have such a great environment you should have GREAT drinks! Not so here...all the drinks are wayyyyyyy too sweet to the point you only want to have one and then move on to another spot.", "author": "Kendra J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-03", "description": "The atmosphere is what makes this place great. Even the razor wire surrounding the Outpost is made friendly with a coat of green paint and fake colorful daisies! We came on a Saturday night and it was pretty packed, but we eventually found our way to a table. There was a nice mix of people, including super cute babies that kept me occupied while I waited for my food.\n\nThe food was pretty good. I had a quesadilla with shrimp and a side of plantains and everything was fine. The guacamole was tasty, but not the best ever. My friends had the Cuban, and the three of them agreed that it was just OK. I also tried the frozen mojito, and it was super minty/kind of strange but good.\n\nAll of the eco upgrades were nice as well. The bathroom floor was pretty wet and gross, though. I'm not sure if it was from the morning's rain, or if it was from the sink that was in the stall (kind of strange, but nice).\n\nI would probably come back, but more for the atmosphere than for the food.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "This is the best place in the summer. The food isn't anything to write home about, but it's a great place to get drinks and people watch IF you can get a seat. I like the downstairs lounge, too, they usually have some good music - but haven't checked it out in a while. Maybe it's not open in the summer? Not sure.\n\nDo not come here Thursday to Saturday night., it is an insane mob scene. Walk by, though, since there's usually some eye candy hanging around.", "author": "Ann T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "Words cannot describe how much I love this place.\nOutdoor seating with (sometimes) live music, solar powered energy, recycled rain water and compost-able cups/plates all housing AMAZING fresh off the grill veggie hot dogs, sweet plantains and delicious frozen \nmojitos... throw in some bright colored paint and cool lighting and it's probably the happiest place in new york.\n\nI cannot think of a place I'd rather be. Seriously, go there, now. It doesn't matter if you're not already in Brooklyn-- ITS WORTH IT!", "author": "Ashe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "great vibes. great drinks. good food. cash only. can get crowded and annoying when trying to find an outdoor table. still one of my fav spots in BK.", "author": "Raven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "Every day it is nice outside, I wish I lived closer to this place.\n\nYeah, getting your food takes a little maneuvering and a lot of patience.  But it's worth it.  I get to sit outside, eat grilled food and drink margaritas and feel like I'm doing something good for the earth.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "This place is great on a summer afternoon or evening.  It gets very crowded and loud but it's a really fun vibe.  The ordering system is slightly annoying - right when you think you're done, you have to go wait again.  But it's worthwhile. The food is good, especially the corn.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "If you go for anything, it should be the grilled corn. The rest of the food is okay, but nothing to be amazed by.  The price range is about average for a restaurant of its kind, but when I went they were still cash only (hopefully that has changed). Overall, the staff is nice and this place is in a great location that has a lot of seating outdoors, which is good in the summertime.   And if you're looking for a quick bite and nice outside atmosphere to grab a bite and chat with friends, this place will do.", "author": "Ana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "I really love the atmosphere here.  This place is super cute.  The people-watching is top notch.  The patio is the place to be with a beer or cocktail in hand.\nI will be spending some quality time here this summer.\nI had the veggie dog which was really delicious.  I want to try all the veg options here.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Came here with my roomate for the first time to try the infamous Cuban sandwich and corn. We both had the sandwich, but I ordered the guac and chips and she got the corn. Overall, I enjoyed the meal and the atmosphere. The cash-only thing is getting very played out in BK. Come on its 2010.. get a credit card terminal!!!  Very funky place though! \n\nIt can get very crowded, which is not so bad. We both had spiked lemonade, which was more lemonade than spiked. Our sandwiches were very tasty, howevever the weren't as warm as they could have been and our bread got soggy... which we both hate. The corn is delicious... regardless of how bad it is for you. \n\nI totally recommend coming here, maybe on a not so busy night. And next time, I'm having a mojito.", "author": "Xiomara T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I can not wait to go back to Habana Outpost when it is warm.  I went on a cold cold sunday with a couple of friends.  I had the special of the day with was spicy shrimp with avocado and beans and rice.  It was super yummy.  I also had a frozen drink which was yummy.  My friends had a burger and a veggie burger which was also yummy.  my only gripes are that they are cash only and the bar people seemed...well...high.  Which i usually dont mind- but we were in a bit of a rush.  \n\nNext time i really want to try the corn!\n\nbonus stars for the crazy eco friendly artwork on the walls and cool bathrooms.\n\nThey also have a great outside area...which i wasnt able to try because it was freezing...but next time i'm in town its a must do!", "author": "Janna V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-23", "description": "First of all, I've been wanting to come here for years because everybody told me how great it was. My husband and I finally ventured past the chain link fence and prepared ourselves for an experience of a lifetime. We ordered burritos and mojitos. The latter were barf-inducing. Honestly, has anyone had a REAL mojito here? This was the furthest thing from a mojito I have ever forced down. It reminded me of a urinal cake blended with ice and Pine-Sol. The burrito was mediocre at best. The thing that really got my goat was the blatant green-washing campaign in effect here. This place is full of shit, touting recycling as part of their slogan/business model. I watched one of the workers dump a whole trayful of recycleables into the trash. If he doesn't care, why should anybody else? Clog the landfills, fuck it. And then I saw the same guy tie up the 'recycleables' bag, which was a black trash bag that should have been either blue or clear to designate recycleable items as per city code, and haul it off toward a teetering pile of other black-bagged trash that most likely contained shitloads of recycleables. It's obviously a farce, this whole notion that they're eco-friendly. It may not be a big deal to anybody else, but I saw it with my own eyes and it made me hate this place even more. Don't waste your time. Even if you're wasted, the mojito still sucks.", "author": "Jenny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "MMMMMmmmm mm MMMMm!\n\nGrilled corn: Getchoo some! It's slightly charred with light butter, queso cotija, a bit of cayenne pepper and MAGIC.  Or something; it's heavenly.\n\nBesides corn they have great traditional Cuban sandwiches and traditional beans \u0026 rice dishes, and there is always a light and dark brew on tap for $2.\n\nYou may have to stand in line for a while, and if the weather is fine the patio will be packed. But there is always the Stationary-Bicycle-Smoothie-Blender for you to hop on if you need a diversion...\n\nThe place is easy on the eco-conscience too. The bathrooms use recycled rainwater, the aforementioned human-powered blender saves energy, etc. etc.", "author": "Topher B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "fun!!! love it here SO much. best f*cking corn on earth. thank GOD there's one in the city so I can get my corn fix all year round. \n\nonly request - please, when it's busy, open up that drink + corn line ALL the time. kthx.", "author": "Maegan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "I really loved this place. You wait in line to get your food and drinks and then bring it to a food truck. The place was hopping at 5 on a saturday evening!\n\nI ordered the Guacamole \u0026 Queso sandwich, I think it is up there with the best sandwich I have ever eaten. The guac was so creamy and smooth, and the chipotle mayo gave just enough kick to it. My husband had the Cuban sandwich which he really liked. We also got the corn, so sweet and delicious. And I also got the Mango salad, wasnt toooo impressed I guess cos I loved my sandwich soooo much!\n\nWe also got the Frozen Mojito, it was super sweet and I didn't think there was much liqor in it, but walking out of the place I did feel the effects of one!\n\nI would totally make the trip back to this place, great!!!!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-04", "description": "This is a great neighborhood restaurant.  The food is consistently fantastic, the price is perfect, the service is spot-on, and I'm always happy to eat there.  It's no wonder why they have security guards, food this good could cause a riot.  Havana Outpost has done something really incredible and I hope they stay here in Ft. Greene for many years to come.  If all you have is the beans and rice, you'll be in for a real treat, it's the best I've ever had.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-12", "description": "Seems to be the Mecca of Ft. Greene.  Blacked chicken sandwich with the spicy mayo was very tasty.\n\nCorn cob was good but not great and the margaritas are just standard.  Not impressed with the food but the scene is great.  Love to people watch here and have a beer.  \n\nBig drawback is the way to get food.  The line can get ridiculously long, not worth the wait.", "author": "Byron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "Habana Outpost, I miss you!\nThe neighborhood is quieter, sadder, and far more lonesome without your eclectic cool.  How does one cope with a cold Saturday after having tasted your summertime thrills?  What does one do on a Sunday night when there aren't any outdoor 80's films to enjoy (Free Popcorn! Star Wars! Cute Boys!)?  Where can one find that automatic answer to boredom?  The palate yearns for sweet corn coated with cheese, for spicy black beans and mojitos that, after only a few sips, will cause more than a brain freeze.  The corner of Fulton \u0026 S.Portland now feels like a ghost town - deflated and waiting for the color and life to return from hibernation.  We stand at the gates, hoping for them to open and restore us all. \n\nOh, and if you forget to bring cash - there's a painted atm-machine, just in case.", "author": "Cannon H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}