{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Perfect casual spot for dinner or drinks, especially if you are looking for an escape of the city. The flavors of the food are spot on and price point is reasonable for serving sizes, including drinks. I have a huge sweet tooth so ordering a frozen piña colada was a no brained. Don't forget to ask for strawberry in your frozen/blended beverages! \n\nMy friend and I each ordered the corn, an entree (quesadilla for me) and split the plantains and were totally set (if not stuffed). Arrive with time to scout out a spot outside since seating goes fast! It's more of communal dining with tables grouped together under a set of umbrellas.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "This place is JAMMING!! Fortunately for us, we walked in at the right time because as soon as we got our food, the line of people waiting to order was literally out the door. The vibe is super chill, especially outside where the food is cooked and served through a food truck window that is definitely the focal point of the awesome yard with plenty of picnic tables to sit at. The food is good, although not the best \"Mexican\" or \"Cuban\" I have had; however the atmosphere makes up for it. The beer is cold and the people who frequent here are fun......and so does the gigantic mural of Commandate Biggie outside on the wall of the Love Building. Only drawback is you have to pay with cash which is a little annoying. I mean, who carries cash nowadays? I will say that the grilled chicken in the quesadilla was really good and the jicama, mango, and cranberry salad was fresh and flavorful. It could use more than one tiny container of dressing though. The chips and guacamole were standard but good. If in the area again, I would go back. Thankful for my friend who always has cash!", "author": "Lesley O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "The Habana outpost is an interesting place. I believe they are only open for the summer and parts of the fall. They have a few fun outdoor activities in the summer, including screening of movies. \n\nI'd describe them as an indoor food truck. They have a menu consisting primarily of sandwiches. They have beers, pina coladas and some non alcoholic beverages.\n\nI've been here a couple of times and haven't been disappointed with their sandwiches. \n\nIt is a cash only place, they do have an ATM in the location. They have outdoor and indoor seating. It's a self service location, you place your order and wait for your number to be called to go pick it up.\n\nA nice place to grab a sandwich in a pinch, I'd probably stop by again sometime.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Really nice and colorful place to have brunch or lunch outdoors when the weather is nice, it also has seats inside, but outside it's much better! At first I though it was a Cuban place, because of the name, but it turned out to have Mexican food, variety of burritos, quesadillas, sandwiches, guacamole, margaritas, mojitos, etc. The dishes are good and cheap. This place is also New York's first solar-powered restaurant!", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "I stopped by Habana Outpost for a quick dinner before a concert at Barclay's. I got the cuban sandwich, and it was one of the best sandwiches that I have ever had. I totally get why it was voted the best in NY. I also got the guacamole and chips which were really good. I would definitely be willing to travel from all over NY to get this sandwich again. The outdoor seating area and string lights are really cute and perfect for a warm day. It's also very affordable and casual. Highly recommend it!", "author": "Audrey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Real, quality Cuban food! Thoroughly enjoyed Habana. They are priced very well. Would recommend the tostones. Only downside of Habana is they are cash only, but there is an atm inside!", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Margaritas to die for! \nBeautiful outdoor seating.. and they focus on sustainability! It's a great place to head to for people to that do not know the area well. It's hard to miss! \n\nSuper trendy and something everyone can enjoy!", "author": "Shannon R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Oops! Forgot to take a picture of my food, but I had 2 fish tacos with beans and rice. The beans and rice were good. The fish seemed to be lacking a bit, but overall it was ok.", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "The food was delicious but basic. I enjoyed the shrimp tacos and corn and my date had the pulled pork. The pulled pork was unimpressive. I emptied my taco in my rice and beans and mixed everything up and it was exactly as I expected ( tastiness) . The spiked lemonade hit the spot. I definitely recommend trying Habana Outpost. They also have activities for the little ones.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "The food is amazing: love the vegetarian empanadas and the grilled corn!!! And the service is very good, staff is very friendly", "author": "Aj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Went here on a date recently, and to my surprise both the tacos \u0026 the company I was with exceeded my expectations. \nI had the shrimp and the pork tacos with the spiked lemonade to wash it all down. \nThe tacos were amazing - messy \u0026 amazing. The spiked lemonade hit the spot and helped ease my nerves for the date. \nThis place was my dates idea, but I'm definitely add this place to my list of \"go-to taco spots\"", "author": "Antonio N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Stop by the first time on tuesday, i had the cuban sandwish, also my first time. It was so good. The pork so so tender and thst sauce was great , then the juices that ozes out as you bite into it. Yes great. It made me happy, amd i ordeted the corn, great my favorite.", "author": "Connie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Fair warning - It gets crowded quickly after 5pm\n\nThat being said the food and drinks here are amazing. The prices on their frozen drinks aren't too harsh, and the wait was never long. Definitely worth a night if you're in the area or on a date. Cuban food done right should always be appreciated.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "This place is super unique. It's like a little piece of Mexico was picked up and placed in Brooklyn. Go in the summer and sit in the outdoor seating area that is decorated with colorful umbrellas, wall art, and streamers; it's super Instagram worthy. I loved how they had glass bottled sodas; they always taste better that way. My chicken burrito was banging as well. Downside: cash only. Other than that, totally worth checking out!", "author": "Diana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Spotted this colorful little restaurant while walking around Ft. Greene.  It's eye catching for sure and a fun little spot to have very delicious frozen margaritas.  \n\nI'm always annoyed by cash only establishments but hey, everyone gets to choose.   So know this, it's Cash Only.\n\nWe ordered two frozen margs, a roasted pork plate, a pork burrito, plantains and an elote.  Ran us around $45 bucks.  \n\nThe elote was pretty sizable and charred to perfection, as was my portion of plantains.  I wasn't wowed by the pork.  There were some dry bits on my platter and the burrito lacked spice and creamy texture.  Probably could have used a dollop of sour scream or guacamole or salsa.  It did come with a heaping portion of jalepeños, probably to impart the heat that was lacking on the burrito itself.\n\nI would definitely come back for elotes and margs in the future.  The patio is super fun and has a constant musical loop of old school tunes.  It's shaded and clean and the food comes out fast.  In the meantime I'll have to continue my search for awesome Cuban food.", "author": "Rian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Hardy meals.  Very fun outdoor setting. Corn tastes just like their other location in SOHO. Just long lines on occasion.  Definitely a weekend summer dinner spot.", "author": "Edmund L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Wow. What an awesome little cuban oasis in the middle of Fort Greene in Brooklyn. I popped into Habana with a few friends on Saturday afternoon for their delicious cubanos and, naturally, some margaritas. Staff was not overly nice or outgoing or supportive, but did everything you could want.\n\nAtmosphere outside is amazing, and I love the interior of the restaurant, including the bathrooms that are all rain-water powered. The restaurant itself seems to be at least partially powered by solar energy as they have a ton of solar panels around the outside, which I will always support. \n\nThe cubano was one of the best that I have ever had. It was moist, full of flavors, had a little spice to it, and the meats were all clearly of quality. I was really really impressed by how every bit just made me want to come back for more. If I had one complaint about the sandwich it would be that it was a bit small for the $9 price tag. The margarita was good, but not great, and cost $9.75 for a 10-oz frozen margarita with very little tequila. I wish it were a little larger, had a little bit more alcohol in it, and had salt as an option. I don't mind spending the money on a drink, especially in NY, but I was disappointed in this for basically $10.\n\nI would definitely come back, but I probably would have a few drinks before or just only be expecting to have one drink. \n\nALSO, it is CASH ONLY and the ATM inside did not work that day I was there.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "Habana Outpost can be a fun place.  I enjoyed my cuban sandwich yesterday - the pork was very juicy and the chewy roll sopped it up nicely.  The frozen daquiri also hit the spot on a sunny day - oddly, when I ordered it,  the cashier asked if it was to go (we're not in NOLA!)   \n\nHowever, I am deducting a star because this place is CASH ONLY...and their ATM has a $2 surcharge.  This area of Fort Greene is a bank desert and I find it offensive for this place to be cash only.   Too Greedy.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Habana Outpost is a really fun place to grab a frozen cocktail, and they have many to choose from. Frozen margaritas, frozen daiquiris, and frozen piña coladas just to name a few.  They have a giant batch in a little dispenser machine so there's plenty to go around.  I had the piña colada and my friend got a margarita. I liked my drink, but after taking a few sips of his margarita, I definitely preferred his.  In didn't get any food here, so I can't speak on it.  It smelled pretty good though.\n\nMost of the seating here is outside, and they play really catchy music, its literally like a nonstop party in the middle of a Brooklyn neighborhood.  The service here is pretty friendly as well, I had no problem leaving the cashiers a generous tip.  I can't wait until I come to brooklyn next summer to enjoy a frozen drink outside.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "A Brooklyn favorite for years! I'll start off with my cons and say, it's still very inconvenient that they only take cash! I also wish that the happy hour was extended. I would love if those two things would be modified. Now, that my cons are over, on to the things I love! The atmosphere is amazing, the staff and the other visitors are always friendly and don't mind engaging in conversations. On Sundays there's movie night where the outdoor seating area is. My favorite things on the menu are the corn, the tacos and of course the Cuban sandwich. I've been coming here for years, happy to see the business still doing well!", "author": "C C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}