{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Went there for their movie night Sundays. Watched Grease and sang along with the crowd while sipping a tasty frozen mojito. May be one of the best ways ever to spend a Sunday night", "author": "Sydney T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "Habana makes you feel good. Not only is it a very \"green\" place (the toilets run on rain water) but the food is exceptional. Never hesitate to get the side of corn because its a barnburner of a tastebud blast. The Chicken Diablo sandwich is a perfect partner to the corn with chipotle mayo and blackened chicken breast over a fire. Seating outside is comfy and often times they have movies or entertainment. The Price is right with bob barker for this place. a must try on a summer day. The mojito would even make the members of kiss say \"ALLLLRIIIIIIGHT\".", "author": "Lukas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-18", "description": "I'm sorry but this place is overrated.  The line goes out the door just to order a drink and it feels sticky in there.  I get the vibe of being in college again ie. spilled drinks, overly crowded, pushing, young skinny jean * thick black glasses wearers, no seats available at the outside area.  It just seems elementary to me, be it the decor/design \u0026 the crowd that it attracts.  The crowd is a mix of emo, ghetto, hipster, skater, eco-friendly haven't showered in days hippies....its just all over the place.  On top of that when you get to the front of the line, your beer is clearly diluted and the food is subpar.  They have 2-3 sitting booths behind the bar and at the outside deck there are maybe 10 painted picnic tables with large umbrellas on each of them scattered around the gated outside area.  15 min in I had enough and finally ditched my party and headed to the next spot.  Def an acquired taste.", "author": "Toni T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-01", "description": "This place WAS great.  Then it became over run w rif-raf.  I too was shocked when they tried to charge $10/person (w a free $2 drink, ha), BUT I think it needed to be done.  I don't know how else they could  resolve the problem of SOOO much \"rif-raf\" spilling out onto the sidewalk/street.  It was obnoxious.  So although, i'm loath to wait in their long and really slow lines, I'll go there early in the day when it's not too crowded for the cheap beers and to sit outside (although we've only stopped by once this year so far.)", "author": "hazy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Seeing that I'm out there constantly trudging through these city streets looking to bring a little light to your lives (or at least some cool shit), I do occasionally run across pure awesomeness.  My dear dear friends, while I have neither the time nor desire to suss out whether or not the Habana Outpost is NY's first Eco-Eatery, as it claims, I can absolutely confirm that HO (apparently I haven't the time nor desire to type out whole restaurant names either) fits into the above-mentioned category of pure awesomeness.  Running off solar energy, having cups and cutlery made from biodegradable cornstarch, being adorned by bright murals and having a smoothie machine powered by either you or some kid on a bicycle (ATTN: child protective services) is only the tip of the compost pile, er, iceberg of HO's twice mentioned pure awesomeness.  There's also a big outdoor patio/cerveza garden that has a local artisan bazaar on the weekends and the joint doubles as a community event space hosting things like summer movie nights, art, and burlesque shows.  AND, they have local beers on tap for only $2.50!  Since it is technically a restaurant I should mention that the Cuban/pan-Latin food served here is great but it isn't super cheap ($7.75 chicken burrito).  That being said, the corn ($2) is so good I'd beat up the kid on the bicycle for it without thinking twice.", "author": "Broke-Ass Stuart S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "The Brooklyn offshot of Cafe Habana - this eco-friendly eatery is the perfect go-to location on a Sunny day. On the corner of Fulton and South Portland street in Brooklyn, it's an easy subway ride from practically any Manhattan location and boy is it worth it. Enclosed in a  playground-like open air corner, patrons pay and order inside and pick up their grilled corn, salads, quesadillas, and other delicious eats outside from the solar powered cooking truck where your name is called out through speakers when ready. A fountain, colorful benches and swings are scattered in the yard outside for you to hang out and leisurely eat your steaming corn (the same delicious one as the Nolita Cafe Habana location, but somehow better eaten under the sun) as music blares from the speakers outside. Smoothies are delicious, free, and made by the cutest boy, Tyler, who puts fresh fruit in a bike-powered blender and starts biking to blend your fresh smoothie together. The food itself is amazing, but it's fun, leisurely atmosphere and eco-friendly ways makes it even more ridiculous.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "Came here a couple times with my fiancée and friends...good place to chill in a trendy neighborhood...food is good get the corn it's awesome...drinks are a little overpriced but all in all I loved it.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "love this place cute and fun, the food is great!!  must check it out!!! the one on prince in soho is open all year round! have fun!", "author": "Livzan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "love this place! cheap beer good times!", "author": "ben o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "Cuban sandwiches were so so good. Sweet corn with cheese blew my mind. Awesome patio area with charming lights and shit.", "author": "Jamie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-24", "description": "hard to review this place...if your a hipster or a local cruising the strip for bitches \u0026 brew with a flare its perfect for you, personally not me but im not that type and that doesnt make the place any less for you. everyone seems to be having fun out in the beer garden where i suggest you seat yourself-crowded mabye but inside isnt where the scene is here so much", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "good corn, fries, cheap sixpoint beer, minus one star for the weird co-ed bathroom and bad ketchup, has to be hunt's or del monte.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-02", "description": "after how many years, it's still as much fun as the first time i went. its definitely a lot more crowded and popular, so if you're going- be ready for a wait...for everything. to order food, to get food, to go into the bathroom, and to get a seat....and that last one may be a no go. thats neither here nor there, the place is great, the drinks are amazing (and i dont even drink!) and the people and crowd are friendly. fun times all around.", "author": "Jenelle P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-29", "description": "We loved this place until they started charging men $10 to enter and set up a fake velvet rope, partitioning off an already congested sidewalk. Ft. Greene doesn't need it's sidewalks taken over by an over hyped bar that treats men and women differently. With more bars with outdoor space opening, Habana Outpost is becoming outmoded.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "The most gorgeous people go here. I dunno how that happens, but I swear it's true. I think I'm going to try to go here more often to benefit from the beauty by osmosis. I love the fact that they have so much eco-friendly technology: rainwater in the toilets, solar powered cell phone charging station, and I'm sure there's other stuff I don't know about it. What keeps that fifth star held back is the prices on the menu. The frozen margarita/mojito are about $8 and when I had them they weren't that strong. Also, what's up with the Mexican food at a place called Habana? My chicken burrito sin arroz actually turned out to be dryish (though well-seasoned) chicken breast with mixed field greens in a tortilla. I was looking forward to the onions, peppers, and beans so that was saddening. Despite the lackluster food, I just can't wean myself from this place, especially in the summer time. It feels like a backyard cookout with people whom you wish you shared genetic material.", "author": "Ava R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "Love this place! Food is good but you have to wait for a long time if its crowded and it's hard to heard your name called. Drinks were weak the last time I went, but had been strong previous time. This is an excellent place to go if you're catching a show or movie at BAM and is conveniently located near multiple subway stops and near the Atlantic Terminal. Try to go during the day if you can get away from work.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "always fun. great grilled shrimp plate, great cubans, ok cheeseburgers...  great atmosphere! love it there.", "author": "Tam T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "Excellent food, very nice festive atmosphere. Fun to go in the summer but it is seasonal so make sure to check to see that its open. Also very green establishment. Has a bike that you can blend your own margarita using the bike power. Seems cool but its never working when I go.", "author": "Mia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "i love the corn.  even though the corn itself is sometimes dry, when combined with the buttery/cheesy/spicy goodness slathered all over it, it's magical.  i think the only other food i've had here is chips \u0026 guac and a veggie dog, but the corn alone is worth the trek all the way from astoria.  my friends loved their cubanos and burritos, i love the atmosphere and the eco-friendliness, and did i mention i love the corn??", "author": "cathy w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "Well I always love a place with outdoor seating in Ft. Greene. As for the food, everything that I've had is good, but the cuban sandwich is my favorite. The burritos are a little on the small side... only problem is on the nice evenings that you want to go, everyone else does too and you can be waiting for awhile. But even on the really busy nights I always manage to find seating since it turns over pretty quickly. And the fact that it's eco-friendly just makes it that much better!", "author": "Davi H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}