{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "A friend of mine who lives in Brooklyn brought my husband and me here for dinner. Great atmosphere and the staff were all very friendly. Love that it is eco friendly - there are solar panels and rain collection going on.  I had the corn and the Mexican grilled cheese sandwich. My husband had the cuban sandwich. Everything was great! Seems a shame that they are not open all year round.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "This place is pretty delicious. Yummy tacos and corn and nice outdoor seating. Just one complaint though. I came with a group for my birthday and we ate and drank several rounds of vodka lemonade (not very alcoholic). Before leaving my friend brought out a bday cupcake she made for me and we were gonna eat it and go when the bouncer came up and informed us that we would be charged a 20$ cake fee if we ate it. It was a cupcake. Just a cupcake. I get that they would do that for groups that come bearing big sheet cakes and want to use the restaurants plates and silverware and take up space and time but the fact that they made an issue out of it in our case really irked me and I probably won't go back there again. Cuz that was totally lame.", "author": "Kara D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-01", "description": "Saturday night, the place was over-crowded.  There was a bouncer to control the knuckleheads, so we decided to order the food to go and our order was missing food... after an hour wait smh.", "author": "M. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "Great summer spot to sit out and have a few beer. Delicious Mexican corn and Cuban sandwiches are some of my favorites  The summer movie fest is a great local time as well", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Ok just gonna throw some random specs here, Cool place. Nothing fancy. Nothing Pretentious. Just good food. Menu says \"Best Cuban Sandwich in New York.\" Im sold.  Good six point beer thats actually under three bucks.\nThey have some spectacular green hot sauce. Habanero I believe. I think I must have had a gallon on my sandwich. Cool bathroom and the pedal blenders a nice idea. Cigar bar right around the corner......outside eating area.....put the rest together yourself. Nice staff and crowd full of lookers. Sounds like a winner to me.", "author": "Jeffrey D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-19", "description": "Echoing the gentleman who said 'No food on earth is worth the indignity of the ordering process here.'\n\nThe food is dry and flavorless. And generic. Not even generic, inauthentic Cuban. If I didn't know the food was supposed to be Cuban, I never would have dreamed it was.\n\nThe ordering process involves standing in line--one line for adult beverages, the other for food--for an eternity, before retrieving your mediocre order at a food truck. The atmosphere is casual, but has an ambiance that is a bizarre hybrid of hood and hipster; it's the kind of place where women with obvious weaves and half-shorn heads wear pink stilettos with their leggings. No thanks!", "author": "L L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "Sunshine, frozen margaritas (with an actual kick), and grilled corn? Who could ask for more on a lovely lazy summer day! The only drawback to this place (and the cause of the star deduction) was the odd set-up of the ordering system. You have to stand in a line inside, order drinks and corn from the counter, be sure to keep your ticket, and then go outside to the truck that will prepare your corn and whatever other food items you ordered. Somehow it just seemed strange and the line moved pretty slowly. Also, I didn't find the people taking drink orders efficient or friendly. However, when you enjoy your lovely meal outside you're sure to forget about all your worries and criticisms about the service. Love this place!", "author": "Holly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "The food here is excellent but be fore warned that you need cash.  All of the dishes have a lot of flavor.   I'm rating the food, as this is a causal food on plastic plates, plastic utensils and a tray type of place, but it's a fun atmosphere and relatively in expensive for such great food.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "Don't get me wrong, I like Habana a lot!  It's an awesome place to meet up with friends and have some locally brewed beers or a frozen margarita.  \n\nOn a nice summer night, their outdoor seating area and quirky environmentally-conscious decor is the perfect place to hang out!  However, since everyone seems to have that same idea, this place is always busy on a nice day and you'll wait in a long line and probably wait around for a table as well.\n\nThe food is just all right here, but you're not really going to Habana for food.  They have decent mexican/cuban (though I think Pequena across the street is far superior).  The highlights are the corn on the cob (mexican style) and the frozen margarita.  But if its a full on Mexican dinner you're looking for, I'd say head across the street.", "author": "Jenna O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-08", "description": "The food is below average. Mass produced food with no flavor. Place is overcrowded and seats are very difficult to find. Better to look elsewhere.", "author": "Taylor H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-28", "description": "My enjoyment of this place has seriously gone down hill.  They seemed to have changed the recipe for my favorite sandwich (White queso and avocado, currently guacamole) and since it's getting busier and busier, even on week days, their staff members at the cash register just take such a long time to ring everyone up (It's a cross between incompetence and the length of the line).  I don't live in the area, but I do work a good 12 minute walk away.  It used to be worth the walk and the wait, but it just isn't any more.  I have to wait and then scarf my food down without enjoying the ambiance.\n\nI thought maybe ordering take out would be a good solution, but they don't take orders over the phone, which seems ridiculous to me.  \n\nIt's strange how the quality of the food hasn't changed much, yet the whole experience is downgraded by issues that could easily be resolved with better customer service.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "I would give this place a qualified four stars-- it is not the place for a taco that is blow-your-mind delicious if that's what you're looking for, but it's a fantastic hangout spot with tasty food , very very strong frozen drinks, and cheap beer. \n\nI went their with a friend for drinks and we were just looking to relax in a laid back atmosphere. The outdoor seating at picnic tables, pretty lights, and great location just outside the entrance to the Lafayette C train makes this an awesome spot to meet up and start the night. \n\nWe had the frozen mojito-- it was very good and very STRONG (watch out!). The corn is fantastic. But the carne asada tacos we ordered were just average. Overall it was a fun time and would definitely recommend checking out for a great night outdoors this summer.", "author": "Lindsay R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "Was in the mood for tacos tonight. Decided to try this place out finally. Brought 1 steak and 1 pork taco plus the Mexican corn. The meat for both of the tacos were very tender, fall apart in your mouth tender. The tortillas soft and flavorful. Each taco was topped with a cilantro, onion guacamole  mixture. The take out box holding the tacos had a slice of lime for extra flavoring. That was all the flavoring that was required for me. Hot sauce wasn't  needed and if you ask me that is what makes a great taco. The Mexican  street corn was rather tasty  the only thing I would probably  change is the amount of mayo that they  slather on the corn before adding the cheese. As well as sprinkling the entire cob with chili powder so that it isn't  lumped into just one section. The corn also comes with a lime wedge. Overall I enjoyed my food. For 10$ hunger was completely satiated. I will return to try the spiked lemonade!", "author": "Terita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "so yummy, so cheap ! such an attractive crowd and good music. \n\nif you're in the neghborhood, its better than cafe habana cause you dont have to wait and its not cramped ! \nespecially fun when the weather is nice :)", "author": "Solmaz J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "Eh OK a pretty decent spot.  I confess I do take Yorktown girls here when I wanna play kewl and she has already been to Madiba. Hey it's a fun place to hang out don't get me wrong, I do recommend it, BUT the food is not Cuban, it's TexMex at best and they have a section on their menu called  \"For the Gringos\" ... OK I get it, but I am sorry that is unacceptable, If an Anglo restaurant had a menu section with a racial slur for Hispanics there would be all kinds of lawsuits... PC cuts both ways.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "In my opinion, this is the kind of place you go to for the atmosphere/drinks with friends more than the food.  I've only been here once so all I can say is that the veggie tacos were the worst excuse for a veggie taco I've ever had. It was literally just guac, chopped tomatoes, and chopped onions in a lackluster corn tortilla (I asked for it without cheese). Really? What about peppers, beans, corn, and everything else you can put into veggie tacos? So disappointing.", "author": "Marysia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "I've been here twice in the past month, and both times I've been pleasantly surprised.\n\nOur first trip was late on a Friday night when the boyfriend had to work so late that everything else that served food had closed for the night.  My handy Yelp application on my phone indicated that Habana Outpost was still open and served food, so we checked it out.  The food was surprisingly good, and the beer was cheap.  Win!\n\nI came back last week when my brother was visiting and had a hankering for frozen margaritas.  I'm not much of a frozen margarita person, but I really enjoyed the one I had there!  It might have had something to do with the outdoor atmosphere, but it was definitely delicious.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "The reason I really love Habana Outpost is because of all their sustainable practices. However, the food is spectacular as well! Perfect place to eat out with friends on a sunny summer day.", "author": "Dillon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Always a good time with great people. Nice lil snacks and drinks too!", "author": "Elle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "I came here on a Sunday which I believe is movie night, or at least it was during the summer. And it was awesome! Their corn is to die for, it's cheesy and limey and all around goodness. My friend and I were so impressed by the food, the feel and the overall vibe that we promised each other we had to go back sometime. Definitely worth a visit if you're into a chill laid back vibe and some good Latin American noms!", "author": "Ashika C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}