{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "Great outdoor space that is full of \"fun\" \n\nCame here on a nice sunny day and was remarkably surprised that this place existed in Brooklyn. I cannot comment on the food, because I consumed all of my calories in liquid form. The place has about 3-4 different frozen drunk slushies ($9). You can even request all of the flavors mixed together; I loved my mojito/piña colada/margarita mix. \n\nThere is a huge outdoor area, which is pretty kid-friendly. I kind of resembles a carnival of sorts. \n\nThe only annoying thing (a star deduction) is this place is Cash only. Cash only!!! What is this, 1983? There should be no reason that a restaurant with booze is cash only.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "Always a nice inexpensive Cuban Mexican food meal here. The cuban sandwich is pretty good. The Mexican grilled corn is the highlight. It is damm tasty and has the right amount of cheese on it. Best to come here around noon. It starts getting busy after 1pm", "author": "david l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "I usually don't do this, but I had a bad experience here and didn't even get to try the food. I was visiting from California and had this place bookmarked to try out. It was a Monday, I checked their hours and it said they were open. So I hopped on a train for about 40 minutes, once I arrived I walked up to the door only to find out it was locked. I thought there may be another entrance so I looked around the building, nothing. Came back to the front door only to be greeted by someone telling me they were closed but would open in 30 minutes. So I walked over to the Barclays center to kill some time. I wandered for 45 minutes and returned, the door was still locked. A lady came to the door this time and told me they were closed and wouldn't open for another 45 minutes! At that point I wanted to tell her what I had to go through to get there, but I before I could say anything she closed the door in my face. \n\nI know this was probably a once in a lifetime thing, but one experience is all it takes to leave a sour taste in someone's mouth. I wish this business nothing but the best, but please do better in the future and be considerate of other people's time, you never know what they did to get there.", "author": "Amer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Ugh I came here like 4x out the week during my pregnancy. Everything is so so so so good\n\n Chicken sandwich on a hero is my favorite. At first I was a bit like ah no I'm. It big on chipotle I don't think I'll like it an than I grew to love it \n\nTostones with the garlic sauce is mouth watering, great\nCorn on the cob with mayo delicious\nMargaritas are super great especially on a hot summer day very good. (Had before my pregnancy) \n\nThe girls are so cool an make my orders come out fast esp when I order to go everything is well packed an I have all my napkins an condiments.\n\nThis is the spot to come to when in BK \nAwesome biggie quote on the wall so you know it's must to stop in when your in the area.", "author": "Steph A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "The way that their food was setup at the indoor location that is open in the winter, I didn't really like it. I had the fish tacos and the tortillas with guacamole dip and Boggs were okay. The fish tacos had too much going on with a massive amount of toppings and the nachos were extremely hard while the guacamole was aight. My soda was good though. Customer service was standard and the venue was as to be expected of a small Mexican food joint. Actually though the setup was typical, it wasn't too neat and clean. That is all.", "author": "Shana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "This place is chill. \nMostly outdoor seating at this location (I believe there is another location across the street) and there's been a Dj there playing fun but not overpowering music most times I've been. \nYou buy your food and drinks inside and then find a seat outside-I've never really had to wait for a seat even though the place is usually pretty full.\nThe service is so nice! They're really friendly and put out a great vibe.\nFood is pretty good and the drinks are solid-nothing spectacular and it's Brooklyn so not super cheap either. I do really like that they have so many vegetarian options.\nOverall, this is a great place to meet up with friends on a warm afternoon or evening-I always have a great time and the crowd is so fun/chill. I always run into some random friend from the area here-it's a fun, low key hot spot!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Great place to hang out and have a couple drinks. Its a cool chill spot. The food was ok i just don't think its worth  it for the price.", "author": "Jackie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Despite the name of this restaurant, they do not serve any Cuban or Caribbean food. The menu is mex-Tex, like burritos, tacos, etc. The guacamole was ok but needed extra acid. Fortunately, they gave us extra lime wedges without a problem. A fun feature is that they play a movie outside on Sunday evenings after sunset.", "author": "Nat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Tasty Cuban spot with cool Havana feel and decor. The food is very good. Had an authentic Cuban sandwich (with pulled pork, ham, swiss) with tostones. Very tasty.", "author": "Caleb C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Beautiful place in Brooklyn \n\nAwesome food \n\nAmbiance is to die for \n\nVery close seating but everyone's friendly\n\nGreat customer service \n\nSecurity guards on duty \n\nCorn on the cob big hit \n\nChicken n waffle on a stick also big hit tastes kinda like a corn dog \n\nFrozen margaritas another hit \n\nThey're tacos are so small but packed and flavorFULL\n\nThe Cuban sandwich was very good \n\n5 stars \n\nAnd they have high chairs", "author": "Will V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "It's a great lil place , nice  mean cute cashier ,makes you feel like your in Cuba lol", "author": "Simon T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Great food, great drinks - the passion fruit margarita is amazing and great outdoor seating. FYI: it's cash only", "author": "Geraldine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Been here a lot of times and it's just one of those places to go on a nice hot day when you're trying to relax and vibe out with people's. Made a couple of new friends here almost every time I've went. The food is good, \u0026 the frozen drinks are good as well as long as you flavor them and try to make your own kind instead of the normal drink. Hoping to see more growth out of you guys and also hope you'll start taking cards soon. Paying Cash is sometimes a hassle in New York.", "author": "Nic P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Beautiful aesthetic. Beautiful restaurant. Outdoor seating was beautifully set up. Drinks were amazing. I highly recommend the mojito. The margarita was good too, a little bit on the strong side. The food was okay, could've been better. I saw someone else say it would've been nice to have been explained how to order. You kinda just wander in and have to figure out yourself. Very awkward for first timers. Service was good. Restaurant was beautiful. Drinks were great. Food was okay. I had the steak burrito and I wasn't exactly displeased but I definitely expected better.", "author": "Sonia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "My friend and I came here for a quick bite to eat. I ordered the pork rice and beans with a side of plantains and she ordered shrimp tacos and plantains. The plantains were soggy for both meals. Hers more soggy than mine. While I enjoyed my roast pork plate my friends food was unappealing. Her shrimp had no seasoning and tasted blackened. The guacamole included in the taco also had no flavor. Actually her meal was just a soggy taco with toppings. The best thing that I really enjoyed was the pineapple ginger lemonade. I would come in again for the lemonade.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Literally used to walk here twice a month in the evenings before kids. The crowd is soooooo great in the evenings - diverse, chill, fashion forward and just a good time. During the day, very family oriented and less everything else mentioned above. The food is really good - the corn and margaritas are my favorite. The atmosphere is great - just hanging outside. The service is meh.", "author": "Shelby S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "Food is not bad but could be better. Roscoe on the stick is pretty clever and for $4 for two sticks, it's worth trying. The steak plate is a joke. It's steak is dry and overcooked and comes with a few pieces for the price. The catfish burrito was not bad but could use some more seasoning. The corn could be better too.\n\nLots of outdoor seating with umbrellas. Cute place overall.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "I came here a few weeks ago to bid my cousin \u0026 his girlfriend a fond farewell before they moved to Seattle.  As a west side of Manhattan girl, I'm pretty unfamiliar with Brooklyn's hidden treasures.  I wanted to put in a good review, so to recall the name of this place, I seriously just Googled \"Fort Greene corn\" and found the correct restaurant.  So there's my biggest takeaway:  get the corn on the cob.  It rocks.\n\nThe outdoor patio area has plenty of room for all on its picnic tables.  Great for conversations without having to scream at each other.  It definitely makes sense that they're seasonal, though, because if I remember correctly there are zero inside seating options.\n\nIt is cash only which is sort of a bummer, but I got drunk with my cousin at a reasonable price.  So that's a fair trade-off, I think.", "author": "Davina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "First time coming here. Place was packed. Waited about 15 min to get a table and about 10 min for the food. Overall good food and great location. Prices where good.", "author": "Jose C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Discovered this gem last year through a friend. I decided to return with a guy friend of mine. He's never heard of the place so I decided why not have him come with me. This place tends to get packed easily. So come prepared to wait on a line. Line 1 is for food \u0026 drinks. Line 2 is for corn \u0026 drinks. \n\nTheir Margaritas \u0026 Moritas (Margarita \u0026 Mojito) are really good! You can tell that they added more alcohol to the pre-mixed frozen drink. I had a Guava Morita \u0026 a Mango Margarita. The thing that I love most about it is the fresh puréed fruit. Yum yummies! \n\nThe food is mediocre. I had a Pork Plato, their infamous corn \u0026 fries. The Pork Plato came with Pernil (pork), yellow rice \u0026 beans. I could've done without the beans. There was a hint of something that might be really tasty but I just couldn't find it. The corn was delicious! The perfect amount of seasoning, cheese and buttery goodness. I wish Habana offered a Shrimp Plato :/\n\nThis is a cool kickback spot if you want to get a nice buzz from the drinks and a light meal to eat.", "author": "Briaunté W."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}