{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "Go with friends in the summer... Get the elotes and the margaritas!\n\nHonestly the rest of the food (burritos, etc) are just ok but its a great place to meet friends and bring your pooch--they are dog-friendly in the outside patio area.\n\nIf you're looking for desert, grab some red velvet cake at Cake Man Raven down the street!", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "Simply amazing food and the outdoor experience is worth it. Did I mention that they're pet friendly and I love love LOVE their Cuban Sandwiches.", "author": "Calisha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-11", "description": "Fun, casual atmosphere with cheap food and good drinks! I love the outdoor seating and the solar panels that provide electricity. I had the catfish plate with rice and beans; the rice and beans were yummy but the catfish was so-so. My friend is a big fan of the grilled corn which I have yet to try, and she said the chicken quesadillas were so-so. I had the frozen mojito which tasted almost identical to my friend's frozen margarita, so a bit disappointing there. Overall, good for drinks and a quick bite, especially during the summer, but the food's not out of this world.\n\nPS. Havana Outpost seems to be a bizarre choice for a name, considering the restaurant only services Mexican food.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "Great Concept, great food.  I only wish that it was open year round.  The elote and steak sammies with a margarita are a perfect way to wind your week down or start a new one.  For a special treat you should head there on movie night when they project them on to the wall in the outdoor seating, as close to drive in as you can get in Brooklyn.", "author": "Elias S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-15", "description": "I still have much love for Habana Outpost, their delicious food and drinks, and of course their eco-friendly practices, but GODDAMN this place has gotten WAY too crowded! It's almost impossible to get in nowadays without waiting in a line that seems to stretch forever, and don't even think about finding some seats - it ain't gonna happen. It's too bad, because I used to really enjoy hanging out here. I guess now a lot of other people do too, and that's the problem. The owners need to find some way to buy up the lot next to them and expand onto it because they clearly cannot meet the overwhelming demand with the space they've got.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "I hardly ever venture into Brooklyn.  Since I live in Queens, such a venture involves an hour's trek, into Manhattan and then back out again.  It's either that or the G train.  Either way it takes too damn long.  This past weekend, me and a couple of friends from high school were having a reunion thing, so I went anywhere requested of me, and one of those places was Fort Greene.  As we walked along Fulton, Habana Outpost called to us like a beacon.  \"Oooh, I like that place.  It's shiny!\" O. said.  I had always heard great things, but it was more than I had imagined.\n\nThe inside of the restaurant is really cute and one of the themes is eco-friendly.  There's a cool mural at the entrance, and the bathrooms have plants all over the place, which gives it a jungle kind of feel.  Extra-nice in a Latin restaurant.  You check out the menu posted on a chalkboard and then order at the counter (and here I issue a warning: girl working the register that night very obviously had another gig going, which is great, and everyone in NYC has, like, five things going on at once.  But you need to not publicize your other gigs to your friend with in-depth explanation when there's a line of people waiting to get their orders in.  Just sayin').  If you do not order a frozen mojito, you are out of your mind and you mustn't ever speak to me again.  The Outpost is also famous for the Mexican corn, grilled with cheese sprinkled on it.  Get many.  Take your receipt to the food truck outside and wait for your name to be called to get your food.\n\nI ordered the special, spicy shrimp with avocado and beans and rice.  Delicious!  My friend had the catfish burrito, her favorite and usual dish.  And of course, all of us had ears of corn and a frozen mojito each.  After we ate, I went in to get another mojito, and I feel you should know that they just might run out of mojito before the night is over.  I took my frozen margarita in defeat.\n\nWe had a great time stuffing ourselves, drinking and reminiscing.  The setting is so nice, everything very brightly painted, a nice fountain in the middle of the space, the food truck off to the side, Christmas lights everywhere, man candy and cool kids.  This place is great on a warm and breezy night.  Great food and alcoholic slushies!  What more could you want?", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "Line is super long but you cannot beat the Queso \u0026 Guacamole burritos here. The Six Points Ale that I ordered to accompany it was fantastic. I love the outside courtyard. It is something not seen in many places in the world, let alone NYC. Habana Outpost must make tons and tons of dough because the line didn't stop accumulating for the hour and a half that we were there. If you are in the Fort Greene area, definitely take a look and stop by Habana Outpost.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "Great atmosphere for a weeknight meal. Friendly staff. Good food.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-10", "description": "This place is exactly why I love Fort Greene: Chill, Diverse, Fun and Affordable. The food is good and the vibes is just right.  I have easily let time drift away in this spot many times.", "author": "Dee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "Amazing! The sun was shining the dj was spinning and the margs I was sipping. And the first solar powered restaurant in NY? Really? How cool! Definitely check out this place for some tasty food and a stiff drink when the weather allows.", "author": "Jacob S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-04", "description": "if you come to habana on the wrong afternoon/night, it can be a total nightmare. it may take you 20 min to wait in line for drinks and then another 20 min to order your food and then another 15 min outside by the truck to get your food. and, if it's this crowded waiting, it's even more so in the outdoor area - made worse by trying to balance corn, a drink, and napkins. \n\nbut the moment you get habana right, it's beautiful. the drinks are strong and tasty. the fries well seasoned. the corn simply bliss. \n\ndon't forget, CASH ONLY!", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "Sunny afternoon. Chilled sangria. Corn. Veggie dog. Quesadillas slathered in canned jalapenos. Solar-powered. Truly a Brooklyn afternoon. My favorite place to sit in the sun and drink, people-watch, hear good music and watch some more.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-24", "description": "they have GOT to change the way they call out the orders. no one can hear a guy from inside a truck calling a name in an inside voice. Come on guys, use a number system with a sign or something. I waited 45 minutes to get a veggie dog to have it come not only cold, but with a hair on it as well. not acceptable. and they were out of every paper product (napkins, TOILET PAPER and paper towels to dry your hands. Hopefully, when they open up next year they will have it fixed. But until then, Im not going back.", "author": "Anonymous A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-31", "description": "Maybe you have to live in bk to appreciate it, but we trekked from queens...and I am not a fan. Like I said if it was local, I'd come here but I wouldn't come out of my way to come here again. Prices aren't bad $4.50 for coronas, $2.25 for the yummmmmmy corn which was the highlight of our brief visit, you can also get that cheap six points beer for $2.75- I tried a friends, it was OK. I didn't really like the crowd or the area, a bit too grimey and was definitely not a fan of the system......if you want another drink you gotta go back on the 20 minute line? Yea I know you should just orderr everything at once...but what if u want a 3rd beer after all...anyway, I doubt I'd come back but if you're in the hood, I guess you can give it a try.", "author": "Lana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-28", "description": "The scene:  multi-racial hipsters with the coolest hair you've ever seen.  Local watering hole for the neighboring Fort Greene artists. One of the bathrooms has no ceiling.  It's tranquil and clean in there.  You can look up and see stars and planes, a fantastic restroom experience.  \r\n\r\nThe cuban sandwich didn't look very cuban, but the fries are freshly cut, and the grilled corn is sweet as summer with generous cheese, paprika, and a wedge of lime.  The music is straight up Latin and facilitates a steady drinking binge.  A note on the mojitos and margaritas:  both are $7 each and only available frozen from a machine, like alcoholic Icees from 7-11.  The mojito is surprisingly tasty, but sweet and quick-melting. The margarita is strong and bitter on the rum (or is that every margarita?).\r\n\r\nThe tables are made of recycled cans and bottles.  They compost the leftover food.  And after you eat the corn, they use the cob to make the plastic cup for your mojito.  This last part is speculation after reading the disclaimer on our plastic cup (\"This cup is made of corn\").", "author": "SV P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "It's been a while since I have been here (about a 1-1/2 years), but it is certainly memorable and fun.  You have to come here with a group to really enjoy it and get the most out of it.  It is a very lively atmosphere both inside the gates and out.  It seems to be quite an eclectc neighborhood -- and in all my years living here in NY, I had never ventured to this neighborhood.  And let me tell you, it is a fairly long ride from the South Shore -- you are almost better going into Manhattan and taking either the Williamsburg or Manhattan Bridges to get here because Atlantic Avenue is a hike once you get off the Jackie Robinson.\n\nHabana Outpost is one of those places where you go to grab a bite to eat, and not want to leave.  There seems to be so much going on there and it is unique and eco-friendly (think solar powered), to top it off.  Who came up with the idea of a \"bike blender\" for making drinks.  It's ingenious!  Save yourself a buck and make your own while peddling off the calories that you are about to ingest.  Follow it up with an order of their wonderfully famous corn (grilled with spices and spanish cheese -- yummy), a steak burrito (wonderful) or one of their salads which also looked great.  They have indoor and outdoor seating (I highly recommend eating al fresco as long as the weather cooperates.  The Frozen Margaritas and Mojito's are great as well (although those are not \"bike powered\").  Oh, and the kids are sure to find something to eat -- they have great Quesedila's (with and without meat), and hot dogs all followed-up by ice cream sandwiches.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "2.75 beers, really good corn, a large outdoor area with different tables (frozen margs and mojitos are 8 - tho i dont thin they are anything too special, they do pack a punch!) fast moving lines and pages to color... summer time fun with friends! i tried the marito (marg and mojito mixed)...", "author": "Aubrey R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-18", "description": "Really freakin' HOT indoors, and outdoors, on a sunny day you'll have to deal with the beaming sun. But in the evening it's a nice and chill spot. The drinks are okay and the food is just as good as their SoHo location. DELICIOUS GRILLED CORN. It's a real friendly low-key cool peeps type place, definitely a good look. Wish it was in my hood. Points for being an eco-friendly, solar powered establishment.", "author": "Michelle Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "Everyhing we had was good. The vibe rocks. But it really is all about the corn.", "author": "Kristina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "THE BEST PLACE TO HANG OUT in the summertime.  Frozen mojitos, cool friendly vibe (as other reviewers have noted, this is a \"hip hairstyle \u0026 heavily tatted\" crowd), and helloooo!  Solar powered!!  Food is okay too.", "author": "Joan C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}