{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "I just had drinks here. The frozen margaritas were great.  Tasty flavor and a good amount of tequila.  I was a little irritated that we had to get our water from a self serve cooler (as opposed to it being served with our drinks from behind the bar) and at one point the water ran out and it took about 20 minutes for the cooler to be replinished :/ Also the bathroom situation is a less than ideal, its just 2 unisex stalls for the entire restaurant. Otherwise the service was nice enough. The huge outdoor patio area was packed with picnic benches, tables and people but everyone was cognizant of the tight quarters, polite and scooched in when necessary. I will definitely return. But probably with my own jug of water.", "author": "Maxine M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "This place is all hype, no substance. The food is awful, the drinks are decent but overpriced, and it's crowded for no reason. This was \"the spot\" a few years back and people are still trying to hold on to it, but there's absolutely no reason to go here. None.", "author": "Monique W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Great spot, great food, and great concept.  Only open in warmer seasons because it's entirely solar-powered.  Containers are all compostable, and drinks are yummy.\n\nBest dishes: Cuban sandwich, fish tacos. Corn looks great but I haven't gotten it yet.", "author": "Brad M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "I love this place.  Heart of Brooklyn.  Parking isn't all too bad.  The corn is amazing. The drinks make you forget you are in NY.   What I love most is the diversity of the patrons.  It's a melting pot with an amazing atmosphere.", "author": "Lele V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "I actually prefer this location rather then the soho location. The being is that the atmosphere and seating is much better! Their carne asada tacos are much better. The elote is pretty consistent between both locations. The elote is soooo GOOD! I can't wait to visit Brooklyn again. This will be my first stop!\n\nI also like that they separate the garbage to make it easy for folks to discard correctly. Also their bathroom is so cool! The overall Eco-friendliness is a plus.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "Not a bad little spot to hang out and grab a margarita. The corn is great and the sandwiches are not bad either. The patio area outside is nice to hang out on a spring afternoon.", "author": "Al L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Chill spot for the summer. The food was great. Definitely get the corn. It's literally right by the train so you have no excuse ha. Get that sangria margarita.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great margaritas. The corn is to die for. The atmosphere is cool, laidback and relaxing.", "author": "Tammi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "When you make it to this resto, you asked yourself why is there a long line almost wrapping out their street. Then you go inside \u0026 you start feeling the vibe \u0026 the delightful energy of all their guests. We sat outside \u0026 waited for our order of corn on the cob and had a pint of beer. Never would I had thought that corn on the cob could taste so good. So, I highly suggest to sit outside during the late Spring/Summer in order to enjoy the eclectic feel of Brooklyn, New York City. It is truly a diverse city \u0026 you can to inhale the flavours within the melting pot.", "author": "Sacha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "My boyfriend and I had burritos here the other day. Not good. His was steak, and while the meat was better than say chipotle, he found the flavors all wrong. I agreed. The bell peppers were kinda sweet. I found the rice mushy. The whole tomatoes, lettuce, I felt like I was eating a wrap! I kept dousing the burrito with hot sauce for some kind of flavor. And I ate the pickled jalapeño prices that came with the burrito. \n\nWe were seriously disappointed! On a higher note, my frozen  margarita was yummy and left me with  a buzz. Mmm and the people watching was prime, on a not too crowded Wednesday evening.\n\nI will go back again.  But never, ever, again for a burrito.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "Summer just aint the same without making homage to the colorful Habana Outpost, but as of yesterday, for me, that tradition and love for the frozen margaritas may be re-considered.\n\nI chose the Cuban sandwich and my friend, chicken quesadilla.  Not good.  They were both dry and pretty greasy and mine came with a single french fry which suggested the basket hadnt been emptied or the paper in them changed.  The bread it came in almost stale and tasted like it had been dunked in oil.\n\nMy friend went back to the truck outside to get additional sour cream which her quesadilla seriously lacked as well as being dry and the truck masters would not oblige, saying she would have to line up (at this point was a very long line) at the register to order more for $1, (by which time it would be cold anyway).  I found this completely ludicrous and really put me off the place, especially since I noticed their prices have gone up.  Is $7 for chips and guac really justifiable?\n\nI get HO, and its a nice environment and they have a sense of community with the extra activities they offer during the summer but I dont think they should be forgetting about the quality of the food, despite it being cheap, to outweigh the decor and patio experience!", "author": "L J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-07", "description": "I went with a few friends here on a holiday weekend, the food was good but I've had a bit better. The drinks were amazing though. It is cash only but they do have a ATM that charges I believe $2.00. I would for sure be returning back. The option to sit yourself I love too.", "author": "Ruthie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "I don't think that there is much more to add to the glowing reviews, but I will say that if you are only in Brooklyn for a short period of time and have to choose a place to have lunch, go here!! Especially if the weather is nice. We got lucky! The bathrooms kinda blew me away- completely Eco friendly and run on rain water....it's like you are doing your biz outside, but not really......or in the privacy of the Redwoods. The tacos are yummy- pretty generous and made outta a truck in the back. These, plus a bucket of coronas equals a pretty nice afternoon! \n\nNote: this place gets packed!!!! Arrive early and expect long lines. Go with friends, as there is picnic table style seating outside!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "This place is fun. You line up for your drinks and food, then take it all out onto the sunny patio. Though I've never been to \"Habana\" (Havana?), it does remind me of some of my favorite drinking experiences in other ramshackle, makeshift locales, from Asia to the Bahamas -- though sadly, these did not have the eco-friendly toilet plumbing that this Outpost boasts. (Check out the bathroom displays to find out where their rainwater goes!)\n\nThe food's not very good (both the pork and corn were at turns too bland or too spicy) but it's reasonably priced and fun to eat, and the buckets o' beer are sure convenient. I might go back before another show at BAM -- but if I didn't, I wouldn't be duly upset. It is, after all, NYC, and there are plenty of other kinds of outposts.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "Tacos were great!  We went on a temperate spring day after the harsh winter so it was very crowded. Good frozen drinks (and I'm not a frozen drink person) and nice crowd (despite the numbers).  Good place to go with friends on a warm Saturday afternoon.", "author": "Schavonne F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Food was pretty good and quick service. Decor was decent, seating was kind of small. Price/portion is about right", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "I'm a straight up idiot for not coming to Habana Outpost sooner...  and I can see my house from here (literally)... so there's no excuse.\n\nThis is the outdoor summer snack-n-sip you've always dreamed of come to fruition in as close to a utopian image of a Brooklyn summer as could exist in reality.  Just a bunch of people chillaxin' together and sweltering in the summer heat.\n\nFood/Drink:  As a vegetarian I am 100% in love with the queso and avocado sandwich.  Gimme a side of chips and salsa and some El Yucateco (be careful) green habanero hot sauce and I am in heaven.  Add a frozen margarita and I am in drunk heaven.\n\nAtmosphere:  Picnic tables, umbrellas, chain link fence, conviviality.\n\nPrice:  Maybe a dollar more than I'd like to pay... but that's life in NYC.\n\nAs a bonus they are extra \"green\" so you can feel good about yourself as you sort your trash.", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "Food was tasted okay but it was cold in the middle. Service was quite poor, table was dirty etc. Wouldn't go back.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Where at,  Brooklyn!  This is a,  good vibes environment .  And,  good food too .  Yum yum yum...  Bring your family. Bring your friends.   Bring a date!", "author": "Millk T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "Really enjoyed this spot. The fact that they had a 4 space outlet near my table was amazing in allowing me to charge my phone. :) As for the food, the chicken plato was great. On par with everything you'd expect it to be. Drinks were good, the sangarita and spiked strawberry lemonade were good choices. Overall, I'd say it was a great experience. Workers were friendly and atmosphere was pleasant. Great spot for a summer day.", "author": "Gina R."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}