{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-09", "description": "I came to visit Habana Outpost on Thursday 9/8 evening with two of my friends.  This is my first time visiting.  I always miss out each year, since they close after summer is over.\nAnyways I ordered Shrimp Taco, Chicken Taco.  One friend had a quesadilla and the other had pork, rice/beans.  We all ordered the Margarita (which is the highlight of the review because it is so good).\n\nAbout 45min after consuming our meals, myself and one friend started to have some stomach issues (bubble guts), which we didn't pay much attention to.  It was only by the time we left (11:45pm) and got home that the intestinal issues begin.\nBy morning, we all experienced intense gas, bloating, nausea and persistent diarrhea.  There definitely is some cross contamination with the meals we were served.\n\nI called and spoke to the Manager (Dee) to report the situation, she was very nice and considerate and she took my complaint and apologized for what happened and said she will review everything with the chef for the night.  There was also an employee their who was unprofessional, which I learned this person was terminated for inappropriate behavior\n\nVery disappointed with the experience (food wise), still recovering today.  If I decide to return, I will not purchase any food and just stick to their drinks AND also bring your own straw.\nThe straws are not covered and easily dispensed which means random people's hands also touch straws you are placing your mouth on.  Maybe this is something they should consider, Covered straws (sanitary purposes).", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Love Habana Outpost! Its my home away from home! The music, the atmosphere and especially the food! Zizi who is one of the managers is the sweetest person in the world!\nNever a dull moment here!", "author": "Verna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "great place. nice outside ambiance. try the chicken taco a d get the mixed margarita, which is mojito and pina colada... \ngreat date spot. not too loud.. light spanish music.. nice staff.. they xleam up quickly...\noh, cash only", "author": "Catore I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Swung by on a Friday night for drinks with friends after a dinner nearby. The place was hopping and we thankfully managed to snag half of a table. One of the major draws of this place is the vast outside seating area which can seat a bunch of people. \n\nHowever, it does take a long time to get drinks and food, wasn't worth waiting for food.\n\nThe margarita was good and they have a small selection of decent beers.\n\nWill come here again if I am ever in the area during the summertime. Remember that it is CASH ONLY!", "author": "Timothy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "I've been hearing about this place for so long I finally made an effort to head over with family this Sunday afternoon.\n\nI was worried that we would have to wait on line for seating, especially since we were 7, but we came in and there was lots of seating and no lines.\n\nFirst of all, I had no idea this was a food truck joint. You go inside, choose your meal from the large menu posted on the wall, order your food then go outside and wait for your name \u0026 number to be called. All utensils, sauces and napkins are self serve. Pretty simple, and surprising, process but it was seamless and efficient.\n\nWe sat down at one of the picnic communal tables and sipped on our drinks while we waited. My spiked lemonade was refreshing but not strong at all. 15-20 mins later our food was ready - food for 7 people might I add!\n\nWe ordered the chicken diablo sandwich, the Cuban, chicken tenders, fries, Mexican corn, fish tacos, roasted pork plato \u0026 chicken quesadilla. The Cuban and the roasted pork plato were instantly the best dishes. Packed with flavor and nicely portioned. I only wish the Cuban had mustard instead of chipotle mayo. The fries were good too - nice and crispy. The chicken tenders were juicy all white meat. The corn was pretty good but had too much butter and cheese, for me at least. (Yep, I sampled everyone's dish! Lol)\n\nEverything else lacked flavor. I was mainly  disappointed with my fish tacos. So much in it and yet no flavor? How hard is it to season the fish? I was soo looking forward to it since I've been on the hunt for some delicious fish tacos. \n\nAll in all, the ambiance is awesome, the food is average but the prices are great. I fed 7 people with $106!", "author": "Shirley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Alert Alert: CASH ONLY! \n\nI have been watching this place for a while now. The experience is like being at a BBQ with a whole bunch of friends without having to plan it.\n\nThe weather was great on Sunday, and the BAM Festival was in full swing over this Memorial Day weekend so it was packed but we found room. The place is so fluid and fun. As we waited on the long line which moves steadily a lady came out and announced that people could go to their \"to go\" location across the street. But I wanted to experience the outdoor seating under the sun. It was really a fun casual spot. The whole number system for your order posted on the monitors while the food is prepared in a food truck was surprising. How strange is that? A food truck is the kitchen for the restaurant? I still can't get my head around it but it was interesting.  As I picked up my chicken Quesadilla and Mexican corn I was super excited. \n\nOnce I got seated (under the shade) I enjoyed my food but had to add some hot sauce to pep it up a bit. I did check out the plate next to me which will be what I get next time: Some rice and beans and some sweet plantains.  \n\nI came around 3 left around 5. Walked through the fair Pan African Festival and went back in time for the 8 pm Sunday film \"Police Academy\" which was hilarious! \n\nI will say though, I am NOT a fan of the whole communal bathroom thing here. It kind of feels like an outhouse and the two stall's are not enough for a place that is so popular like Habana.", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "If you're in the right mood for communal seating, loud atmosphere, and a crowd always always always, this place is really fun. The elote is a must and the frozen drinks are fun. In the summer they play movies outside - showed a friend Stand By Me for the first time in their outdoor space and it was the best.", "author": "Jamie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Frozen margaritas on a hot summer day? Why not? Habana Outpost is conveniently located in Ft Greene, Brooklyn. It's right next to the C and G trains but also a short walk from the Atlantic Terminal subway stop. \n\nOne of their most popular items are their frozen margaritas which are delicious and refreshing. The also offer mojitos, sangria, a delicious spiked lemonade and a handful of beers. There is an extensive menu with a little something for all taste buds. The food is fairly consistent, fresh, and flavorful. On my most recent visit I had the guacamole and queso burrito. My friends ordered different types of tacos as well as a Cuban sandwich. The Cuban sandwich and tacos were a hit except the fish taco. My friend didn't go into depth as to why she wasn't a fan of the fish taco but she lover the chicken and pork. We also had the chips and guacamole. I felt as the guacamole was rather bland and could have used a little more spice and flavor. \n\nWe were there on a Friday so around 4pm a DJ came and started playing some awesome tunes. Unfortunately we were on our way out but the music definitely added to the fun vibe. \n\nThe place is definitely kid friendly. I've even seen on the calendar that there are certain events that are geared specifically towards children. \n\nOverall, Habana is definitely a MUST when you are in the area.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Favorite place to get some delicious corn and frozen margaritas! Oh how I wish it was April right now and not 0 degrees outside! #ineedamargarita", "author": "Tiffany P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "love this place. great food! love the environment. I ordered the shrimp plato, chicken plato, sweet plantain, corn and fish taco. hehehe don't worry I shared those with others. definitely something you need to try if you in the area.\nThey have TONS of outdoor seating but I came in a windy day so staying indoor was a better choice for me. Don't forget to try their spiked lemonade. ahhhh tasty and refreshing!\nhope you guys like it as much as I do.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "Yay! I'm a fan! Habana Outpost gives to Fort Green a cool vibe. \nThe place is very laid back. In fact I realized that there is not that much cool places in this area.  Habana Outpost is this place where it smells summer all year long. Food is fine, service is fine but I truly believe that what give this place a good rating is the people who comes to eat there. Everybody is so happy and enjoyed their meal with a great smile, dancing on the music that the DJ plays. If you are too broke to go to Cuba, Habana will take you there for $10.00", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "Good food, affordable and lively. Always enjoy coming here. Reason from r 3 stars? \"Cash only\" is an inconvenience to your customers (owner) this means someone is tryna find a back door to paying their fair share of taxes.... hmmmm!", "author": "Ny's Finest .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "It's too bad Habana's outpost is seasonal, because it's one of the best things about Fort Greene summer. The outdoor seating is huge, and is truly one of the best ways to eat brunch during the summer. The food is good, although my boyfriend's eggs were slightly undercooked in the Huevos Rancheros so it isn't his favorite place...I got one Fish ($3) and one Veggie taco ($3), as well as a Margarita ($9) that were delicious enough to come back though. Also, they have more brunch choices, but that section on their menu doesn't seem to be available online....\n\nIt's CASH ONLY, but there is an ATM. The service is fast and they'll call out your name from the food \"cart\" in the corner of the courtyard when your food is ready.\n\nIf you recently watched \"Chef\" with Jon Favreau and are craving a Cubano ($8.75), they serve them here as well as their To-Go location across the street (which is open year-round!)", "author": "Kaitlyn R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Wow! Among the endless pizza and deli restaurants it was great to find this awesome Cuban fusion bistro right in the middle of Brooklyn NY. I felt like I was transported to little Havana in Miami Florida, the decor was exactly what you what expect with the Caribbean flair and ambiance of an old world Cuban cafe. It was a total unique dining experience not only because of its style and equally outstanding food but the kitchen was outside in the huge patio area in an old food truck which seemed to be attached to the side of the building. Totally cool! We came for lunch, so of course we had the Cuban sandwich and we also had a few specialty steak and chicken tacos. The service was also friendly and attentive. The only negative is they have no AC and maybe they could use a few more fans to move the air around inside on the hot summer days, thankful they do have high ceilings to trap the real hot stuff . However, that didn't sway me from giving 4 stars for everything else. I highly recommend this place if you are here in NYC for a visit, and if it's a little warm that day it's well worth that trade off.", "author": "Steve O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Came here for brunch with the boo. Got the Cuban Sandwich, Grilled Corn, and Roscoe on a Stick. To start off the Cuban sandwich was quite average, maybe the other things on the menu were better, I'll try the burritos or tacos next time. I would also not suggest getting the Roscoe on a stick (chicken and waffles on a stick), it was quite a small portion, and basically dry waffles with even drier tiny pieces of chicken in it. The best part of the meal was the grilled corn, yet that would be hard to mess up. The outside seating area is beautiful and lively, yet can get crowded, and watch out for all the bees near the fence! Didn't get any drinks because they were wildly over priced for a tiny serving. Ended up making our own piña coladas at home after, for half the price.", "author": "Yeji S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This place is wonderful and bright and fun in the summer. I'm so happy they opened the full year to-go counter across the street, but it was fun back when this place was only open part of the year to really revel in its return to glory. It was always an event. A great way to kick off spring/summer. I'll always love it, the families, the eco-consciousness. Wish they weren't cash only, but I get it. Frozen drinks too!", "author": "Bea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "We love coming here. My point of view is a little different from the other reviews. I'm a momma and my little ones are ALWAYS in tow and Habana is VERRRRRYYYYYYY kid friendly (during certain times of course) \n\nWe have been to countless Halloween parties, back to school parties, first day of summer parties and sat/sun activity mornings all hosted by Habana. My family has many memories here. The staff are always so nice and friendly perfect for dealing with all the small children that come to these parties. A plus parents can still partake in frozen deliciousness. The frozen deliciousness does sneak up on ya a bit so one is recommended unless you are an experienced drinker such as myself ;-). Two drinks and I'm usually starting the kiddie conga line. \n\nOutside of the parties we like to go early in the day  during the week, it's a good location to meet up for play dates or mommy groups with little babies and toddlers (totally speaking from experience) the kids  are so fascinated by the little fountain in the center of the outside seating area. The seating area inside isn't as big as the outside but great to take a break from the heat. We enjoy the food the pork tacos are my absolute favorite. My kids like the chix and waffles on a stick. There is a nice variety in the menu. \n\nIt's very unlikely you will find me there late on a Friday or Saturday night it turns into a whole scene with a bouncer, tons of people, waiting for food and drinks and I just don't have time for that knowing the speedy service and laid back atmosphere I am so used to.", "author": "Cieanne E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "Stopped by for an early dinner with a friend a couple weeks ago after meaning to visit for months. Even received a recommendation from a random hairstylist who used to live in Brooklyn while on a trip a few weeks ago. So, we went in with high hopes.  The ambiance is nice, so we were excited that the meal would match the decor. WRONG \n\nEverything we received, aside from the chicken and waffle pops, was cold. Even the Mexican Street corn was awful! Cold and rubbery. I was so disgusted I didn't even know where to begin and we were both too exhausted to endure the hassle of calling a manager over and waiting for recooked food. So, we trashed the remaining food and called the manager over on the way out the door to let him know about the poor experience. \n\nMy time is very precious and so is my cash. So, a restaurant only has ONE chance to get it right with me. When my friend and I went to this establishment, it wasn't even that busy. So, the fact that we received cold, thoughtless food during a lull does not bode well for what we might receive if it's really busy. Customer service is SO important and each dish should be prepared with that in mind. Especially in the highly volatile restaurant business. I won't be going here again. I don't care if Oprah scooped me up in a limo to go grab a bite.", "author": "Shana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "This is a great place to come for lunch. The service and food were both excellent.\n\nCame here for lunch with my girlfriend around 2:30 p.m. on a Thursday. She picked the place out the night before. I knew already that I would be getting the Cuban Sandwich.\n\nShe ordered the Shrimp Plate, which came with Rice, Beans, Guacamole and of course the Shrimp. I ordered the Cuban Sandwich with everything on it, pork, ham, cheese, pickles, and a nice chipotle mayo sauce. We also ordered sides of grilled corn and fries. I loved the Cola Cola in the classic bottles, definitely a nice touch.\n\nThe sitting outside definitely added to the experience as well. You pick up your food when your number shows up on the board. It wasn't long of a wait either.\n\nThe food was in short, delicious. We shared what we had. The Cuban Sandwich was excellent. Perfect lunch item that had a nice spiciness to it which added to the pork, ham and cheese.\n\nMy girlfriend loved the Shrimp Plate. One noteworthy thing is that the the guacamole was really good and added to the dish as a whole.\n\nThe Grilled Corn was nice too. Seasoned really well with good flavor. The fries were somewhat bland, but some salt and ketchup and you're good to go. You don't come to a Cuban restaurant to the fries anyway.\n\nThe service was excellent and efficient. No complaints here.\n\nTo round out the meal we shared a Pina Colada, with an added twist of  some Mango puree in it. Personally, the mango elevated it for me because I'm not the biggest an of Pina Colada. So kudos for having those options available.\n\nAll in all, it was a perfect lunch date. 5/5 and will definitely be coming back in the future.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Such a great place, especially for groups. I have been here a few times over the years. I love that if you have a group that always has a problem with splitting the check it's perfect because you order, pay, pick up then sit down. No conflict; everyone orders and pays for it themselves inside first. I don't usually like pina coladas but they were delicious and really refreshing on a hot day. They also do movie nights during the summer. Will definitely be back!", "author": "Nicole A."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}