{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "The best Mexican grilled corn I've had! Mannnn it's really really good. Great place to come when it's warm outside to enjoy some food and drinks with friends. \nIt can get really really packed here, but that's always a good sign.\nThey even show movies here in the summer.", "author": "Sheri A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "This semi-permanent food-truck-plus-patio has an awesome patio and vibe.  The food... eh, nothing you'd write home about - the quesadilla seems like what Napoleon Dynamite probably made himself in his Utah kitchen.  $1 add-on for salsa (none included) translates to less than a tablespoon's worth of the stuff.  Burritos are fine, cuban sandwich is OK.  Portions in general are a little small, prices are a bit high, but the beer is cheap, and the atmosphere is great.  They compost, which is awesome.  Great place to hang out outside.  I can't think of any other place nearby with a patio like this.", "author": "Wendy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "Atmosphere was great.  Drinks were good.  Service was okay.  Food was meh.\n\nThis is a great place to get together with friends, especially in the summer.  It's got outdoor seating and frozen margaritas and it's not too expensive.  Really chill and easy place to be.  You buy your drinks at the counter and no one bothers you.\n\nHaving said that, I'm rating this at 3 stars because of the inexplicably long line for food, and the food itself.  \n\nBeginning with the line, there was one cashier taking food and orders for everyone there - separate line just for drinks.  All she had to do was take your order, and your money.  You wouldn't expect it to take too long, but it did, considering the number of people there and how standard their menu was.  She was nice though, which might have explained why it took her so long to take an order and move on.  Don't get me wrong, I like service and attention when I'm at that type of restaurant, but I don't want to wait on a line to get that service when I could be back at my table with my friends.\n\nAnd then there's the food.  It was cold, it was a bit bland, and it just didn't look that nice.  At least that was my impression of their tacos.  It was only $3, but how could you get a taco wrong.  All it has to be is fresh!  They serve it out of a trailer to give you that street aesthetic, I suppose, but they would have been much better off hiring some real Mexican food truck guys to come in and prepare the food for their clientele.\n\nStay for the drinks and the endless chatter with friends.  Leave and end the chatter when you get hungry.\n\nOn a side note, for those that care, they recycle, and you sort out your own trash at their recycling/compost area/station.  It seems like every other place is concerned about being green these days, and I'm not sure if it's just a gimmick or not, but at they are doing it.", "author": "Dan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Came here on late afternoon during the week with a couple of friends and it was super busy (def good sign). Their drinks are freakin' fantastic and so worth the $8. Definitely try the sangria and their margaritas. Next on my list to try is their spiked lemonade (which I hear is also amazing and fantastic) and their mojitos. The food is also great! I've tried their Chicken Quesadillas, the veggies tacos and the guacamole. The salsa verde that accompanies most dishes is amazing and definitely complements the entire dish. This is my 2nd time here in a month. Will definitely come back soon to try the other items on the menu. So worth the walk, visit and $$$$$.", "author": "Monica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "I try not to review a place that already as more than 10 reviews, but I just had to drop a few lines on one of my favorite places to hang out in Fort Greene.\n\nA Review in Convenient List Format:\n- $2.50 cups of Sixpoint beers (Get two at a time, per person.  Why not?)\n- Frozen froo-froo drinks (If you are into that; they can be really refreshingly icy on these summer days - \n\"Dude, I want a Slurpeee!\"  \"Okay, let's hit up The 'Post\")\n- Diverse mix of clientele\n- Dog-/Kids-friendly (Amusing to watch mothers bring their kids to the place while throwing back a few)\n- Movies on Sunday evenings\n- Fun out-doorsy bathrooms\n- Cute blonde girl behind the counter who's always smiling\n- Couple of guys sweating in a trailer churning out tasty sammies/dishes from the grill (Cubano, Diablo, Oscar's Special, etc: You name it, you'll love it)", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Come here in the summer.\nGet yourself a margarita and an order of corn.\nHustle for a table.\nBask.\nJust do it.", "author": "Tinylittleimpression S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "I thought the best Cuban food I had was in Miami but this place certainly is just as good! It's just a colorful joint with an outdoor seating area but the food is amazing! The mango margaritas in the machine are wonderful and I got the chicken plate. OH MY GOD... the meat is tender, the plantains are to-die-for, and even the beans and rice are wonderful.", "author": "Joleen Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "Meh, this place is a 3 star at best.  Not sure what the craze is all about.  Yes the patio is cool, and the Margarita is good but definitely that's all.  Food is meh; over greased and burnt.  Nothing special here.", "author": "Khai H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "I went for the movie night featuring The Princess Bride and left a VERY satisfied customer.\n\nFirst of all, the place just makes you smile. It's bright and colorful and there are lots of diverse people enjoying themselves - it's a great atmosphere.\n\nEven while waiting in line to order my food wasn't such a bad experience, although I did wait for about 35 minutes and then waited another 15 for my food. It was crowded and finding seating just for myself was difficult- I had to resort to going inside, even though I wanted to stay outside. This whole part of the experience wasn't terrible, but annoying enough that I docked a star.\n\nBut onto the good stuff- the food! I wanted to try a bunch of things since there were so many great recommendations, so here's what I ordered:\n~ Pork Taco : very tasty and lots of pork! :)\n~ Sweet Plaintains : so good, I ordered another batch to go with my frozen 'rita!\n~ Corn : If you get anything here, please let this be it - SO GOOD!\n~ Lemonade : really refreshing and flavorful!\n~ Frozen Margarita : Everything you've read is true - it's delicious and STRONG! :)\n\nThe movie was the cherry on top! It seemed like they were having issues with the projector, so it didn't start until around 9, but the crowd that was there to watch The Princess Bride had a great time - there was cheering and clapping and laughing - seriously fun!\n\nNext week's movie is Coming to America and I may have to go back to Habana Outpost and brave the crowds because the whole experience was fantastic! I may just get there a bit earlier this time... :)", "author": "Maleia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Great casual place to come eat and drink. I ordered the chicken diablo sandwich which was nice and spicy (even though I like it more spicy and added hot sauce). My girlfriend had the chicken Plato which had great flavor to the beans, rice, and chicken. We also ordered the grilled corn and it was the perfect \"appetizer\". The main attraction however, were the margaritas. These icy beverages fool you; they will rush up to your head and make you feel dizzy in no time.", "author": "Adonis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "I enjoyed this restaurant and the food. the portion of the food was larger than I expected. The environment and the atmosphere was fun.", "author": "Eunbee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Best Cubano I have had in awhile!!! \nDon't leave without having the corn or delicious sour cream!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "Great spot to get some beers and grub before a show or game at the Barclays Center. They aren't messing around with the grilled mexican corn here, it's fire. The cuban sandwich is also really good. I'm aware that's exactly what they are known for and it's what you MUST get if you go. Also, stay for the fried chicken/waffle on a stick, it a little strange but delicious. The space is really cool too, it's only outdoor seating at communal picnic tables. Unfortunately this location closes for the winter, but it only gives me another reason to look forward to spring. Can't wait till April 19th....", "author": "Avery S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-12", "description": "Used to be one of the treasures of the neighborhood. \n\nBut I went back recently and food was horrible. Totally different experience.  Hopefully they just had an off night, but the bread on my cubano tasted like cardboard and the corn wasn't anywhere near as good as it had been previously. \n\nPretty sad given how good it was originally. I hope this is only a temporary lull.", "author": "Andrew U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "Super cute!!!! \n\nJuliet C. and I stopped by after a disappointing few hours apartment hunting and I must say this place definitely lifted my spirits and filled my tummy quite well. \n\nWe shared a Cubano plate which consisted of moist, delicious pulled pork, beans and rice. I'm normally not a fan of Mexican food or anything related, but I couldn't put my fork down. Oh wait, I did put my fork down occasionally, but that was only to slurp some frozen Morita (Mojito + Margarita). Yum! We also went back and ordered some fried plantains for our dessert. They were unevenly cut but that worked out in the end since I preferred the thinner sliced, crispier pieces and Juliet, the thicker, chewier ones. \n\nAtmosphere wise, this place is so perfect for the summertime lazies. Large outdoor space with decent amount of seating, bright colors everywhere, environment friendly solar panels ... it's a little slice of Cuban hipster flower-power.\n\nDefinitely give this place a shot if you're around the area and it's summertime!", "author": "Cat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Love this place! It's a seasonal joint that serves the best corn on the cob and tacos.  Outside seating makes for a cool chilled out place to gather with family and friends. I highly recommend this place to anyone.", "author": "Kimmi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "This place is the cutest! I had fish tacos and that delicious lemonade thing. The outdoor seating was so cute and I felt like I was in Cuba!  Huge fan and the catfish was delicioso! \nI want to really sit there all summer, listen to the fountain and enjoy the sun.", "author": "Yvonne K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "This place is cool for a casual drink or a bite to eat.  Decent patio.  Great for a nice day.", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "I honestly only come here for the drinks (frozen mojito/margarita mix!) and the corn so can't speak much on the other food. The corn is amazingly flavorful and spicy!  Love coming here in the summer with friends and hang out. Definitely a must to look cute here cause it can turn into a fashion show! lol\n\nLove the outdoor seating, the food truck, and the music. It can be damned hard to get a seat here though since its super crowded when its beautiful outside. Overall the place is cute, chill and trendy. If you like that scene--come here. it can get very loud though so don't think you're going to come here and have a conversation on the intricacies of life.\n\n(not sure if they still do this but a couple of summers ago, every Sunday they would play a movie on an outdoor screen.)", "author": "Empress T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "The place is a great spot for summer after noon, The music is awesome, the food is excellent  especially the grill corn (YUMMY) BUT their was a specific staff member that was truly a jerk! The orders are by numbers my husband notice that 2 numbers we're skip ours and the following one when he went to check this guy (Indian guy in the food truck) told him that it wasn't ready...:fine but then after another 10 min they were customers that we saw on the order line getting their food before us and we were there already about another 10 mins waiting. Then my husband when up again to find out and guy said again it's not ready but this time took our receipt. Believe it or not another 10 mins past buy and we're still waiting for our food to the point that a customer that was after us got their food order something again and got their food before us and jokingly ask my husband \" your still here\" At this point my husband went up to guy asked him what was he issue the Indian guy continue to say that it wasn't ready. So then my husband responded I ordered the something that last customer order how is THAT my food is still not ready? He answered was he wasn't the cook. At this point it was obviously that he had purposely skipped our order because my husband ask the guys that were cooking can he please help him because  this guy was not. No lie the guy start placing all our items on a tray less then a min!!! Honestly I don't want to go back because of that guy especially of he's the one who will be giving out the food", "author": "Rebecca C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}