{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Best Cuban sandwich you'll get in Brooklyn, plus outdoor seating, unique style, and specialized take-out version across the street! Frozen margaritas are great too. Cash-only can be a drag, but can't complain too much. Also the corn! Sometimes can be too packed and even get a club-like line out the door, but just try to avoid peak hours.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Great food in this location (just like in the city). The place can get crazy crowded with a long line, especially on nights with events at either the Barclay's Center or the BAM. \n\nHowever, on nights were you CAN actually order and sit down, it is a great joint. I hate when it's closed during the winter because I spend so much time here during the warm months. I recommend the elote, quesadilla, and tacos (of course). \n\nTheir drinks are great, too, especially anything with lemonade mix.", "author": "Laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "The corn on the cob is great! I don't drink alcohol so I can't comment on their fruity fresh beverages but they look good.  \n\nI love the festive decor and bright colors! It's great for the outdoor patio on a beautiful day (sun and birds are out). I always want to go dancing after I eat here at Habana Outpost because I get hype...Viva!", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "i. love. this. place.\n\nthere's a lot to say about this place. so i'll just bullet point it.\n\nfor food, get the:\n-corn\n-guacamole\n-fish tacos\n-cuban sandwich\n-cheese and guac sandwich with a side of chicken\n-frozen pina colata and frozen mojito\n\natmosphere:\n-very eco friendly.\n-outdoor seating\n-order inside, pick up food outside, seat yourself\n-colorful, vibrant, a great spot for drinks in the summer\n-cash only\n\ncan't wait to go back!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Do not leave without trying the roasted CORN! Pina Colada margaritas are on point! Do not be discouraged by the long line, it moves fast. Had a good time with some friends as we chatted and devoured our pork tacos, chips/salsa, margaritas, and of course the corn! Good crowd, good food. Families are here too! Its closed during the winter/cold months, great summer spot!", "author": "Janine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "The frozen mojitos \u0026 margaritas are soooooo good! The food is great, especially if you're not Vegan. If you are, stick t the drinks, the veggie burgers aren't as amazing as the drinks \u0026 atmosphere\nI'd suggest going on a weekday cause it's crazy on the weekends", "author": "NiCo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "If you are cool and under 40, this is the hang out spot with your friends in Fort Greene.  It is a parking lot that has a big red extra large food truck and has about 2 dozen picnic tables.  You order at the counter and pick up your food at the truck.  The beer is cheaper than average ($5) for a draft Sixpoint and the food is great (get the catfish plate).  I used to come here all the time on those perfect balmy evenings when I only lived a few blocks away.  However, I haven't been returning here often because the secret is out and by 8pm this place is packed.  The worst part is that there are many empty seats, but certain annoying people insist on holding onto a couple picnic tables so that their 9 friends have a place to sit whenever they show up.  Habana Outpost needs to post a friendly neighbor rule to combat this selfishness.  Because this place is outdoors, it opens in mid-April and has a Halloween celebration in October to close out the season.  Pluses include it uses solar power for the lights, rainwater for the toilets, tries to recycle/compost most of the garbage, near the C/G Fulton St/Lafayette St subway stop and is open until midnight.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Skip the margaritas as they are frozen and quite sugary. Instead, on a nice day grab a few Sol bottles and kick it outside for hours with your friends. You will have a good time it is impossible not to.\n\nHaven't tried the food yet.", "author": "Zach S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "Dear H.O,\n\nPlease hurry and open up again so I can eat that corn. \n\nThanks.", "author": "Sherice L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Came here with some friends for a happy hour after work. While they don't have a happy hour special, the food and drinks are relatively cheap so it's not an issue. I had a fish taco, guacamole and chips and a mango margarita.  Total was about $20 so not bad at all. The fish taco was pretty good and the guacamole was ok. The margarita was tasty. It's It's a great place to hang out with friends because of the outdoor backyard type setup which I really like.\n This is a regular hang out spot and I'll be back!", "author": "Whitney P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "I used to love this place however each year the prices of the drinks increase while the crowd gets more and more iffy. I came for happy hour with a large group on a Friday. We were able to get seats but had to fight for chairs. My $9 margarita melted in about 3 minutes and started to taste very sweet soon after. Sorry to say I won't be coming back soon", "author": "Maggie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-24", "description": "Fast service if you are getting only drinks and/or corn, people are nice and although you sit around strangers everyone is cool.  I only had their frozen margarita,  it was ok, not nothing really to shout about though.  Not rushing to go back.", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "Only downsides to this place are the long line to order the food and the Lord of the Rings style quest to find a place to sit. Don't let that deter you, this place is freaking great.\n\nThe corn, OMG THE CORN, it's like a creamy piece of heaven. I thought people were exaggerating when they were saying how good it is, but it's absolutely amazing. My friend and I had the burritos and they weren't the best I've ever had but they were pretty good. The drinks were really good to, the mojito is just the right amount of sweet, mix it with the fruit blend they have and it's good but just a little too sweet.\n\nThe crowd here is good, it's a nice spot for people watching, seeing some cute guys, having random conversations with the people next to you. Overall it makes a pretty good way to spend a summer afternoon.", "author": "Ashley A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "So I'm not sure why this place calls itself Cuban because it's way closer to Mexican than anything. I've been to Havana and I ate nothing like this when I was there. Like, not even close. \n\nThat aside, this place is really tasty. The corn, which other Yelpers will tell you, is SO GOOD. In my South West homeland, our county fairs skip things like Zeppoles and Sausage and Peppers and instead serve fresh roasted corn with your choice of toppings. Again, I don't know why they're going for the Cuban vibe, but the corn is amazing, and straight-up Mexican. \n\nMy friend and I also got veggie and steak tacos, which are served the way Mexican street tacos are served- with cilantro and diced red onions. The tortillas fell apart, which was annoying, but it was all really good.\n\nThe guacamole was also really great. So were the  Spiked Lemonade and Frozen Morito.\n\nThey do have one \"Cuban\" thing on the menu: A Cuban Sandwich. Funny, because that's a sandwich that was developed for Cuban immigrants working in...Florida. \n\nI'll get over my annoyance with this place being called a Cuban place someday. In the meantime, I'll be back for some corn!", "author": "Brianna P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "I have passed this place quite a few times, but never tried it. Went in and thought I was gonna have some cuban food in a cuban restaurant. no. I felt a bit insulted at the fact that they had mexican references everywhere I looked. The hipsters and the black people from the neighborhood couldn't tell the difference of course. I thought the place was ran by cuban locals or at least people who knew about the cuban culture before I walked in. I come from a cuban background and I felt somewhat overwhelmed at the fact that a good chunk of the menu had mexican cuisine, and the place had mariachi paintings on the wall. CUBANS ARE NOT MEXICAN. But the apparently people who ran the place think cubans eat tacos and burritos. Also at the pick up station there was a cartoon of a lazy mexican with a hat over his sleepy eyes saying \"amigo, you're food is ready\". *facepalm... Not only are you insulting cubans, but you're insulting mexicans! This place reminded me of that episode with Guy Fieri asking a cuban restaurant if they had anything to do with mexicans. That struck a nerve.\n\nA certain guy who came in with a group was in confusion as well as I was waiting for my food. I overheard a conversation about him asking, \"what kind of food do they serve here?\" after standing around looking at everything in the restaurant. Just cause they speak spanish doesn't mean they're mexican. As for the food? I got myself a cuban sandwich that came with ham, pork, cheese and pickles. It tasted normal. Filled me up, but it wasn't good or bad. The sauces and napkin station table they had didn't have containers for people to take with them when they take their food to go. \n\ntl:dr A message to the staff/management/corporate. Do a little research on cuban cuisine and culture. You'll avoid offending people this way with stereotypes. Your establishment has made me feel insulted and you're giving the impression of something else that is not cuban.", "author": "Chuckie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "The outdoor seating is very nice.\nThe people are very friendly and helpful. The food comes out very quickly.\nHowever, I found the food very bland. The black bean and rice Looks and tastes like the black and rice have been cooked together and stuck back in fridge for several days. Not fresh at all", "author": "Chris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "Finally tried this place, and really, I don't get the hype. I had the Cuban Sandwich which was terrible.  Barely lukewarm, not pressed, no pickles (!).  I would have mentioned it to the staff, but \"meh\" applied to the entire meal.  The nachos were cold, salsa watery.  Really good Cuban sandwiches can be had at La Isla Restaurant in Hoboken; or Puerto Viejo in Crown Heights, Brooklyn.  I give it one extra star because the garden is nice.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Should've done this over the summer. Anywho who doesn't like Habana! Drinks great! Chicken tenders and fries get the job done and my cousins love the corn. When it opens up outside again(and it's sunny and warm outside) I'll be there. See you there soon!", "author": "Narvina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Cheap (small) beer!\n\nAwesome grilled corn.\n\nMovies on Sundays. \n\nAmazing outdoor seating.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "You don't come here for the food...it is just OK but for sure you come for the location and the festivity of the place seating outdoor on a Sunday afternoon", "author": "Gil V."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}