{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Came here one afternoon after hearing so many positive things about the restaurant i had to see what the hype was about. The Establishment itself is super beautiful..with plenty of outdoor seating. i order the pork plato with sweet plantains on the side also shared a Cuban sandwich with my husband when it says best in New York you cant say no and i had the frozen margarita. The Margarita to me was the highlight... very very delicious a couple of those will defiantly get you saucy. So the Pork plato came with black beans and yellow rice.. i wish i could say it was amazing but sadly enough it was just ok.. the pork was nicely  flavored but the rice and beans ummm bland as hell. When im eating Spanish food flavor should never be lacking. As for the Cuban i have to say ive had way better else where soo sorry. Its a cash only, and if you ask me a bit pricey. Overall its a beautiful Brooklyn restaurant with good food.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I'm all over their grilled corns. Curious why the bigger store across the street closes during the winter tho. Do the staff go on vacation to the Cuban beaches every winter? It's a mystery to me.", "author": "Beimeng F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This could be my new favorite spot in Brooklyn. It's a great summer spot with the outdoor seating and fun young crowd. I've made some great friends here and had even better drinks. I love the drinks, the atmosphere and the Sangria!", "author": "Toni S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "One of my favorite places to eat and hang out in the summer. My friends and I often meet there for tasty food, decent drinks and a good time. I enjoy the Sunday night movies that they show. It's easy to meet new people. Dogs and children are allowed. It's a great hang out spot. Dee is the manager and always makes sure we have a great time. She lots of fun and always checks to make sure patrons are well served.", "author": "Revee J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Love the corn, the tacos are great and so are the frozen drinks. I love this place on a summer afternoon. The prices are great too...as a introvert its a little too packed all the time but what can you expect when the food is great.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Really great place to catch up with friends. The music is always good and the vibe right. Can't say I was fond of the frozen drinks but the ambience balanced it out I suppose.", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-27", "description": "I had the corn here. I remember eating the corn at the Manhattan(cafe habana) location over 10years ago. What I had modern time was nothing like the other. It wasn't bad, but it wasn't as good as what I remembered waiting in line for at the tiny spot they had in the city. \n\nI got the cuban sandwich.\nI don't know. I wasn't so impressed. I had a great cuban sandwich at this hole in the wall cuban place in sunset park eons ago..I prob should go in search of that place.\n\nThe food is here is okay. I wouldn't return unless made to.", "author": "Kemi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "Great business concept, and delicious food! Was visiting from Portland, OR, where almost every restaurant recycles everything, so it was refreshing to see a place that had \"green utensils\", captured rain water for their garden, and toilets. \n\nThe food was delicious. I highly recommend the roasted pork either on a plate, or in a burrito. I tried the chicken on my second visit, and it was good, but no where near as tasty as the pork. I'm usually not a fan of frozen margaritas, but theirs was damn tasty!", "author": "Curtis C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "Very hectic which is good for their business but couldn't even get a table. The food is okay but I can see that the reviews are based on volume and low cost.  Wasn't crazy about customer service.", "author": "Joe P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Just left Habana outpost and it was enjoyable. First off we arrived around 7 and it was packed to capacity. I ordered the Mexican corn which is a must, a mango margarita which hit the spot and a chicken and guacamole burrito which was pretty tasty. The chicken needed a little hit bit of some type of season but other than that it was good. This is a nice spot to babge with friend but it's crowded! It's dsmn near impossible to get s table. I highly recommend coming here to chill though.", "author": "T H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "Nice food and I'm guessing when the frozen drink machine is working the drinks are nice too. \nThose drinks are their bread and butter, they should ALWAYS be frozen and ready to go. \nDuring hot days, expect a large queue. \nI will try it again and am even looking forward to one of their movie nights.\nCash only is a little annoying too.", "author": "Tammy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Great go to spot for drinks and a quick bite to eat. LOVEEEE the fried corn.", "author": "Jesica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Yo... coming from Florida where all of the stops were Cuban. This place made my taste buds go ham. It was the catfish plate, and the rice and beans.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-30", "description": "... a little disappointed... \nafter reading all the great reviews I was so psyched to come here! My experience here was... OK. The Cuban Sandwich was NOT tasty. The drinks and the corn are good but not great. The wait for the food was very long too.\nI think I will make another appearance here just to see if it was their off day.", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Caught a late night, they're closing, but this train ain't coming fish taco and it was solid enough. The whole space looks great though and I look forward to a long day of drinking at one of it's many picnic tables.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "The best for a hot summer evening. I love their drinks. The tacos aren't outstanding, but they have awesome sandwiches and other dishes. Also, the steak tacos are pretty good. It's a really great place to go with a group!", "author": "Mary l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "I have been to this spot twice and really enjoyed it both times. They have a great seating area outside and great music playing. I have had the corn and the fish plate. Both were really good and everything is really reasonably priced. My friends that I was with got burritos and margaritas and were really pleased with their meals as well. Definitely a spot I will be returning to.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "I used to be a regular here when I Lives in NYC. I had a friend who lived nearby and went on the reg. Their food is phenomenal. Everything. And their margaritas are the bomb. I am not usually a fan of frozen margaritas but this place is the exception to the rule. And more than two will leave you on the floor- so be careful. It's been a while like I said, but they used to do Sunday evening movies there during the summer which was so fun. It can get crowded so be warned but have fun. I miss this spot!", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "Been here twice and I am addicted to their corn.  It is the perfect combo of buttery-ness, gril-lness, and spice-ness.  Seriously, you have to get it. Another good bet is the cuban snadwich, yumm!\n\nThis place definitely has a bit of a hipster tree hugger feel to it, but that adds to the uniqueness of the place.  Make sure you recycle your trash and you cant help but notice the signs all over the toilets about their rain water flushing system.  But I have one question, what happens in a drought? Does piss and fecal matter just sit there?\n\n Pretty sure it closes at the end of october for the season, so get there quick. Sunday nights are outdoor movie nights. Oh and CASH ONLY so hit that ATM before you come.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "This place is best for its outdoors seating which is large and airy and energetic - although their colourful metal chairs could be replaced with something more comfortable. They have some limited indoor seating too. I was disappointed that they had no grilled fish in any of their menu items - all battered and deep fried. But I got the veggie burger which was actually excellent. My friend got a pork taco and plantains which took over 30 minutes to arrive - they must have messed that up. Otherwise, we had a lovely time.", "author": "Abeer H."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}