{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Amazing spot for a sunny Saturday afternoon! The margaritas were great, and don't forget the corn on the cob!! We sat out for a number of hours. The vibe is very cool, all kinds of people coming in and out, including families. The DJ was great until she stopped playing!\nThe only downside was the VERY long wait for food or drinks. The process of getting food took at least a half hour in lines. There is a shorter drink line, which is convenient if you're not hungry. \nOverall great experience!", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "The corn on the cob is delicious. The atmosphere couldn't be better. This is a great place to relax with friends or a loved one in the summer. Always a cool crowd", "author": "Ricardo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "The Margaritas are the BEST !!! And the Fish sandwich is reallllllly good. Great place nice staff.", "author": "Bruce W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "The food is simple and pretty tasty, but I'm giving this place five stars because they have a great environment for a summer day. I love the fact that they have solar panels collecting energy for the resturant and often source ingredients locally including draft beers. I've had fun with friends each time I visited.", "author": "Dru C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Went there for  some afternoon drinks and the Sunday movie session - fun place! Had a few too many frozen margaritas because they were so good, ate the corn which was awesomely good and sweltered in heat but had fun doing it. I recommend a visit.. although not the most comfortable place to watch a movie", "author": "Nicky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Beautiful decor! Nice atmosphere...just needs more outdoor shaded areas... nice music...the DAMN corn was amazing!!!! I took another one one to go! Beers were ok not bad for $3.50 next ill try the frozen drinks. The \"Cuban\" sandwich was good..We WILL be back!!!", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "Cool atmosphere. Great place for drinks before going out or just for the evening. Chicken and rice was okay. Nothing I would go back for. BUT rosco on a stick was amazing -chicken covered in a waffle. The chicken in this was so much better than the chicken with the meal. I would go back just for this.", "author": "Katherine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Good food, nice summer activities for the kids on weekends.", "author": "Shaniqua G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "Their Mexican corn is such a mess and it's so good you don't even care that you look like Ralphie's brother in A Christmas Story when he acts like 'a little piggy' because its that fantastic.  Their tacos are great and damn their margarita's and other special drink (maybe an alcoholic lemonade?) is also so good.  Must haves. And their outdoor area is amazing and they do movies during the summer.", "author": "Asha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-17", "description": "Wow, I am so over this place. The food is OK, the drinks WAY overpriced and the \"scene\" makes me want to puke...", "author": "MoMo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Came here on a Sunday afternoon as part of what turned into a Brooklyn/Queens bar crawl and thoroughly enjoyed myself. Cheap beer, good eats, tons of outdoor seating, not crowded at all. \n\nThe bathrooms are slightly odd since you feel like you're inside a metal trash can, but other than that, fabulous place. And kudos on the eco-friendly practices, big fan.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "Cool and fun place to eat, drink and hang out with friends, in the patio, on a sunny afternoon.  The food is average, but the vibe is chill.  The live dj makes it a good place to kick it, have some margaritas or drinks and chat it up.  \n\nGot a guacamole queso sandwich and a beer.  Nothing special but it was a good time none the less.  My friend got a fish burrito - skip it.  They have a cool Eco-friendly thing going to.  4 stars for the scene and vibe, 3 for the food.\n\nRight off the C and G lines, so easy to get to from Manhattan.  Def worth checking out, esp if you are looking for somewhere to chill with friends.", "author": "Bryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-02", "description": "Summer weather finds me exploring more of the city by bicycle. While I'm usually looking for new experiences, I'm a long-time fan of Manhattan's Habana-to-Go and  was happy to stumble across this Ft. Greene outpost. After ordering up front you pick up your food from a truck out back and sit on the large outdoor patio. A couple of tacos and a few frozen margaritas left me feeling refreshed. And don't forget the legendary roasted corn.", "author": "Grant C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "Give me grilled corn and a cuban on a warm summer night and I'll be the happiest girl on the planet. Got hungry one night so some friends and I drove out to the outpost to get the two of the greatest creations ever made. Honestly I was scared to try it since I love Cafe Habana so much - what if the outpost let me down?! It didn't for the most part. The corn tasted amazing as always except for the fact that there were parts that were burnt. Cheese and lime juice made me overlook it.\n\nIt's good here but I still prefer Cafe Habana. The seating here is better though. The atmosphere is laid-back, making it an awesome place to hang with a couple of friends for food and drinks without feeling cramped.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "I went to this place a few weekends ago and had a pretty great time. My friends and I showed up pretty late (as the place was closing), but it was still fun. Great atmosphere for drinking and just being happy :) Very chill. Highly recommended", "author": "Meagan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "Excellent corn (I usually hate mayo, but the corn at Habana is an exception!). The cuban sandwich quality varies--the last one I had was at Barclays center and it was tasty in spite of being cold. There was a bit of bone in the chicken burrito I ordered, which was also fairly tasty, though my fellow eater noted that it was too sweet for his tastes.", "author": "S M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "I almost don't want to write this review because I don't want anyone else to discover this place!\n\nThe open courtyard full of picnic tables makes for a perfect group spot, or in this case, birthday party destination. By the end of the night we were able to crowd 12 people around one picnic table with just a little squishing and pull up of chairs.\n\nI've heard horror stories that it can get too crowded to move, let alone sit down, with 20 minute waits for drinks, but on this slightly chilly night it was full without being crowded.\n\nBeers are $2.50!!! This is amazing. They're a little small, but for $2.50 who cares. Frozen mojitos, their specialty, are $8 and especially potent.\n\nI didn't get any food, but oh how I wish I did. The little taco truck produced steak quesadillas, rice and beans, fried plantains, chicken burritos, spectacular grilled corn and a million other things. Everyone was raving about their food and I had serious quesadilla envy by the end of the night.\n\nHabana Outpost is so festive, with lights everywhere and flowers dotting the painted barbed wire on the top of the fence. Music is playing softly enough to not interrupt conversation, and busboys make the rounds frequently to clear empty cups and trays. Plus the entire place is solar powered, how cool is that? \n\nThe C train comes out literally 10 feet from the entrance, so you have no excuse not to get yourself down to Fort Greene to enjoy this neighborhood gem. Just don't go when I do; I don't want to wait in any lines.", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "Self-proclaimed Best Cuban Sandwich in NYC. Save your money. Dish served cold. Stone cold pulled pork, ham, and Swiss. The cheese was not close to being melted. Think about that for a moment. I could have gone somewhere for a deli sandwich for half the price. The only thing that went near heat was the bread. Very disappointing. I asked for the sandwich to be heated up and it was soggy the second time around. I didn't realize the best Cuban sandwich in NYC was a shitty choice. I should have tolerated the noise at shake shack and had a properly heated meal.", "author": "Aaa A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-27", "description": "I came here to meet a group of friends on a Wednesday night for drinks.  It was an insane mob scene, at 6pm.  Hate that.  The outdoor area is cramped, loud, and kinda dirty.  The inside is nice though.  But when I went in for drinks I realized they only had sugar filled pre-mixed drinks in those cheezy slushy machines, or beer.  Granted, the frozen mojito was good, but a pile of undesirable sugar in there.  And the beer is cheap (2.50) and tasty.  But with no wine or liquor options, there is not something for everyone here.\n\nDidn't eat the food but it looked pretty good, albeit served on paper plates.  It looked sort of like picnic food.  If your picnic is in Cuba.\n\nAll in all, a bit too scene-y for my taste.  The fact that an outdoor, paper plate Cuban food place could ever become scene-y is mystifying to me.", "author": "anni b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "I like how the frozen margaritas and mojitos are strong.  I like sitting outside.  I like that sometimes there are cute boys.  I like how it's not so loud (since it's outside) so you can really come here and talk with your friends at a normal volume.\n\nThe burritos are good but not OVERWHELMINGLY plentiful.  In fact, they are like neat little wraps.  It's not very filling and leaves me feeling wistful and taken advantage of.  I've seen other people order huge plates full of food so I know gluttony IS possible here, but I've never been able to order it.\n\nOh and here's a thing that makes me slightly shifty-eyed.  And that is that at first you look around and see all these black, white, and yellow faces, you know?  And olive and brown and red.  And you think, \"Whoa, the post-racial era has arrived and I am basking in its multi-colored glow.\"  But then you look at the tables more carefully, and you realize that all the colors tend to stick to themselves (with the exception of the white male/yellow female faces, which tend to be stuck together in pairs) and THEN you think, \"Whoa, racial segregation is alive and well!!\"  And you leave, figuratively red-faced at the state of the world.", "author": "Ying L."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}