{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-24", "description": "wasnt ever impresssed with anything i ate or drank here, and the extremely crowded long line out the door doesnt help either, but i guess the nice outdoor tables makes it a great socializing place.", "author": "Sparkle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "I had the white cheese and avocado sandwich. Absolutely delicious with the hot sauce and jalapenos. As you can tell I love spicy food...this sandwich was already good to begin with and adding on the spices made it EVEN better!", "author": "Anita D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "Habana Outpost - great ideas, great intentions, good food. \n\nI love the eco-eatery idea and I wish more places were like Habana Outpost! The drinks are great, though my sangria was always lacking in grapes.  The atmosphere is fantastic and it was really refreshing to sit outside in 60 degree weather. \n\nThe food was pretty good, but not great.  My corn had good flavor, but it was cold and clearly pre-grilled and the steak in my quesadilla was tasty, but the tortilla was average and the guac was a strange consistency...kind of like that store-bought guac that has a bit of a tinny taste.  \n\nGo for the outdoor drinking atmosphere but keep your food expectations low - its good for being made in a truck, but there's definitely better cuban/mexican to be had in Brooklyn.", "author": "G P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "Today was a beautiful, warm, sunny day and I decided it would also be the day to finally check out Habana Outpost!\nDue to the insane crowds on evenings/weekends I figured lunch time would be a great time to go and it turns out I was right! 12 bucks for a cuban sandwich, grilled corn and a glass of Six Point Sweet Action? Awesome! The sandwich was pretty solid. I wouldn't have complained had their been more pork on it (then again the last sandwich I had was at David's House of Brisket so my sense of scale might be a bit off) but overall the pork was excellent as was the cheese and pickle. It also has Chipotle mayo on it which was DA BOMB! The corn was very tasty sprinkled with cheese, cayenne and served with a lime.\n\nI had a great experience but place seems to be a madhouse on the evenings and weekends. But I'll definitely be going back during the week for lunch!", "author": "Andy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-12", "description": "i feel bad giving habana this many stars.\n\nthe food was ok, nothing spectacular.  it was reasonably priced, i guess.  the lemon salad was WAY too sour. Make your face turn inside out sour.  burritos are pretty large but taste is a different story (burritos at a cuban place? huh?).  Mojitos are 8.50 for about 6 ounces - FYI - a frozen mojito is not a real mojito, sorry.   \n\nThe blend your own smoothie is a cool option (its done on a bike - your pedaling provides the power for the blender) - and its an extra buck if they have to blend it.  \n\nnice patio area to hang out on a nice day.  plus the vendors on weekends is a nice touch.  bonus points for being (mostly? not sure if its entirely) run off solar.  i highly doubt those 4 panels run the building and cart outside.  \n\nif you want to kill a few hours sitting outside with expensive drinks, unimpressive food, but feel good because its an eco-friendly place, you found yourself a home.  they get 3 stars for trying.", "author": "pat b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-21", "description": "An eco-friendly eatery that has a bike-for-your-smoothie option. Only opened for 6 months a year, it's a Fort Greene institution.  Go on an warm evening with close buds and enjoy the festive atmosphere outside and dine on Cuban-style corn and frozen mojitos.", "author": "Jasmine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-29", "description": "Loved this place!  I had never heard of it, but stumbled upon yesterday while I was in the area.  I was instantly intrigued because it seemed like a big party.  A DJ was playing music and everyone gathered around the many picnic tables seemed like they were having a lot of fun.  You order inside (prices are pretty reasonable) and bring your ticket to the truck outside.  My chicken quesadilla was very tasty, as was my fiance's Cuban sandwich.  The frozen margaritas looked great too.  When we finished eating, we just hung out in the courtyard listening to the music for awhile.  Very enjoyable way to spend a Saturday afternoon!", "author": "Kacey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Great food. Fun atmosphere. Perfect summer joint.", "author": "Tiffanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "Great outdoor seating. Good food out of a truck (cuban pork sandwich!) and good blended margaritas! Fun atmosphere.", "author": "Lucky L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "I really like this place.  Being a Brooklyn girl, I love when cool spots pop up in my borough.  The corn is FANTASTIC and the drinks are great as well.  It is a very cool hang out spot.  The crowd is diverse and fun. The seating is typically shared with strangers so, you get to meet new people.  The sometime show movies as well so it can be a lot of fun!", "author": "Klysha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "Normally if I reviewed a place where there were a lot of negatives (cash only, long lines to order, meager beer selection) I wouldn't give up the stars.  For Habana, however, it's a different story.  This is THE PLACE for outdoor imbibing in summertime.  Always a beautiful, friendly crowd and anything but the typical \"beer garden\" experience.  It's powered by 100% renewable energy and the fact that you can save a dollar by mixing your own frozen drink using the \"blender bike?\" That's sa-WEET!", "author": "Sebastian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "The Habana Outpost is a great place on a sunny afternoon. They only have outdoor seating. They have benches set up with big umbrellas to cover you up. Overall, the food is pretty good.. but the corn on the cob is fantastic. The frozen margaritas are good, too--not too sweet, pretty light green color, blended well and enough alcohol to not warrant a complaint. \n\nThe mood at the Habana Outpost--especially on a sunny weeeknd day--is so happy, its hard not to have a good time.", "author": "Ivey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "food was good. drinks were good. eco-friendly is wonderful. i love anywhere with a green roof. \n\ni like the atmosphere. \n\nonly complaint: more mexican than cuban so maybe a name change is in order?", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-05", "description": "The only thing better than Cafe Habana is Cafe Habana outdoors, in Brooklyn! Its a great public space with fenced in picnic tables, an old stationary taco truck where you pick up your food orders, open air toilets   that channel summer camp, and a very cool, very Brooklyn crowd. \n\nThe corn is the same as the Habana in Nolita, thank god. The rest of the menu is a little different. The food line can get long, even on sunny weekdays, but luckily the line for beers or frozen machine made drinks is much shorter. \n\nThe movies are very cool too, they project the image about 25 feet up on the brownstone next door.... like I said, very Brooklyn.", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "Absolutely the most wonderful hangout a neighborhood could have.\n\nOn a nice day, it's packed, but sitting outside, listening to fun music, drinking frozen mojitos and eating awesome Cuban sandwiches--how can it be beat?\n\nLines are long but who cares?  It's fun, friendly and yummy.\n\nAlso! This year it's open 7 days/week till midnight!  Hooray!  So glad it's summer.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "This place is pretty awesome. It definitely stands out with it's colorful decor and outdoor sitting area. The food was absolutely delicious. I decided to pop in for a snack because a friend had been telling me that that the grilled corn was outstanding there....and he couldn't have been more right. The corn is grilled with a slight char on it...then it slathered in butter and coated with cheese...only to be topped off with a little bit of chili powder. It was borderline orgasmic! Then I also had one of their pork tacos which was delicious as well. The tortilla was home made and probably one of the best I've ever had. The pork was wonderfully marinated and super tender...and it was topped with chopped onions and cilantro. I think it could have used just a tad less cilantro (and I LOVE cilantro) because it seemed to be a mouthful of herbs....but even with that it still didn't take away from the bold flavor of the pork. I really liked the fact that they are also Eco-Friendly because when you throw out your trash, they have it separated by glass bottles, plastic bottles and other trash so it makes it easier for them to recycle. I will DEFINITELY be coming back to Habana Outpost!", "author": "Jacob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Fantastic concept, super casual atmosphere, great food and drinks. The corn is ridiculous and the tacos were good too. Highly recommend.", "author": "Carl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "$2.75 for draft beer...(I think it's 10 oz, but whatever, still awesome)...simple, solid tex-mex...big outdoor space with an eclectic crowd...and 100% renewable energy...would like it if they served something other than Six Point's Sweet Action or Brownstoner on draft...I'm not particularly fond of either choices (I know it's brewed in Brooklyn, but so is Kelso)...and it can get PACKED.  But catch it at an off-hour, and it's a great place to kill a few hours.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "There's not much to say about Habana. It's a staple in the summer and always a great place to hang out. The only downside is that it's always busy, but I rarely mind because I'm drunk and happily full.", "author": "Kendall L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "The food/drink here is passable but the draw is definitely the outdoor seating area, which can be swamped on most weekends.  A recent Memorial Day trek out here proved successful after 3 previous unsuccessful attempts due to ridiculous crowds or special events.  The corn was indeed amazing as everyone else has mentioned and I enjoyed the Chicken Diablo sandwich (though the chicken in it was paper-thin).  The frozen mojito I could have gone without - tasted a bit like a toothpaste Slurpee.  \n\nIf you can actually wrangle a table here, go for it and don't forget to give your receipt to the truck for food!", "author": "Phillip L."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}