{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "This place is always a hit. I love that everything is green, and environmentally friendly. It can get quite crowded on some days, but if you happen to pop in when there's seats available, you're sure to enjoy some nice sun, good music, and cheap eats. Get the Corn!!!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "Several friends and I stumbled in here late evening, starving and exhausted. We were a big group so we were  a bit stressed about finding seating, and after eating subpar mexican food earlier in the day I was hesitant to try again. I am a Florida girl, and good mexican is incredibly important to me, thank goodness I listened to my friends and went.\n\nI wasn't in too adventurous of a mood so I just got the basic 'mexican grilled cheese'  and oh my goodness was it amazing. A big swirl of spicy guacamole and sour cream, and the perfect amount of butter and seasoning. \n\nI demolished the thing. It was like heaven melting in my mouth.\n\nAnd oooh the drinks. I am a Sangria connoisseur , so when I saw they had an option for both red and white I was hesitant. Usually when a place has both, then the excellentness is split between the two and you get mediocre. But I was shocked and pleased. I went with the white and was so delighted. Strong as all get out, but it made the paying 8.00$ completely worth it. I sampled my friends drinks and they were equally as great, although the frozen drink machine wasn't working, but sometimes things break. NBD.\n\nThe atmosphere is beyond incredible, I honestly felt like I was back in Central America. Bright colors, loud music, and the food was served out of a food wagon, by people who were friendly and helpful. We ate outside because it was beyond hot, and I must say the only thing lacking was fans. How can that place not have fans is all I could thing. I am eating spicy food and drinking STRONG drinks and there are no fans. But I got over it. Quick. All in all I would go back in a heart beat. And thanks to the place, it endeared me to Brooklyn all the more!", "author": "Jade K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "I'm a huge fan of Cafe Habana. We were looking for a place w/ outdoor seating after Brooklyn Flea and OHNY... my friend remembered Habana Outpost was nearby. We got some corn and drinks, and spent a bit of time outside. Really chill, fun atmosphere. From a food perspective, the menu is a lot simpler than the Soho locations. Nothing fancy like my favorite chuletas. I will still love Soho more but this Outpost is still worth a stop by in you're in the area. I think their corn was better seasoned since it's not jammed into foil. Oh and they have a memorial to MJ.", "author": "Irene H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Super great atmosphere! the corn is amazeballs!!! I love to go right before the croud gets crazy, because it's a great place to chill and have a beer with freinds. \n\nGO ahead and try it!", "author": "Nayka A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "this is such a cute spot. it may be hard to find seating, esp on the weekend but it's worth waiting for someone to get up so you can sit.\nthe cubano sandwich is so good.\nalso please try the pineapple ginger lemonade. the name sounds off putting but it's really good.\n\nnext time i wanna try the chicken and waffles.", "author": "Jasmine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "Mmmmm. The Cuban sandwich. The guacamole. The mojitos. The corn. The environment. The.... EVERYTHING. Its an awesome place for group gatherings in the summer because of the outdoor seating, and its still great for smaller crowds indoors. Highly recommended for everyone thats in the neighborhood, whether visiting or living. its just a fun place to be if you're looking to hang out with friends and relax on a nice summer day/night. and the food ROCKS.", "author": "Kathy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "i should first say i've never actually eaten here, but nothing can make me happier on a sunny spring afternoon than a brightly decorated patio with a frozen drink in hand. \n\n$7 for a frozen margarita in a little clear plastic cup seems a little crazy, but then you realize they're strong. like $7 strong. \n\nplus i'm willing to pay an extra dollar or two to sit at a bright blue picnic table, look out over the patio and street at great fort greene people watching, and relax in such a fun, laid-back atmosphere.", "author": "Jody W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "I like this place because of the atmosphere. I came on a Saturday evening. It was pretty crowded. I love the outdoor, communal seating. I had a frozen strawberry margarita. It was pretty good, nothing to brag about. I didn't get any food because I just came to grab drinks, but it looked good especially the corn. If you're looking for a fun, outdoor place to drink with music then come here", "author": "Amber M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Went here on a Friday night for a casual dinner. Although crowded, the food came quickly and was delicious! This is communal style eating. We got the pork steak and fish tacos (all of which we're great!) and the fried plantains. Will definitely be back.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I wen there for early drinks on a Saturday afternoon... I just love the fact that you can sit outside (that's what I miss the most in NYC in the summer!)\n\nOnly comment : drinks are not as strong as they could be. But I gues that they were strong enough for 4PM!\n\nWorking in the solar business myself, I love that it's all eco-friendly. It could be better, but it's a good start!", "author": "Lucie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-03", "description": "Man, is their food good.\n\nBoy do they suck at actually getting it to you.\n\nHabana Outpost is, in some ways, a victim of their own success. Their beer is cheap. The space they occupy is awesome. Their food is quite good and well-made. And as a consequence, they are SRO at any time you go there. You have to fight for a seat. You have to wait 20 minutes in line just to put in your food order. Then you have to wait for 20 minutes outside the truck where they cook all the food, waiting for them to misinterpret your name to actually pick up your food, by which time you've definitely lost your seat. It can be fun with groups, but any group large enough is going to have a helluva time finding a place where they can all sit. There is a separate line, however, if all you want is more beer.\n\nStill, on the right night, with the right type of luck, Habana Outpost is exactly the type of place you want in your neighborhood.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "This is a very nice chill spot. I just wish the seats can be less sticky and gross. Other than that the food and drinks are the BOMB!!!", "author": "Marshalene M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "The customer service is TERRIBLE!!! ... As to a point where my change was thrown at me nd my sour cream was watered (down) which i never received in any other resturant ive ever been too in my life.. My suggestion would be to compliment your customers more and accept constructive criticism. And by the way real management needs to be on hands at all times in this location!", "author": "Steve S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-16", "description": "I'm sad to have to give Habana Outpost 2 stars but I've been a customer here for about 3 years and I have to say their quality is falling off.  The sandwiches used to be hot and toasty but now their cold and barely toasted at all.  Almost everything on the menu comes with rice and beans but since I'm not a fan of beans I opted for the Steak Platter that comes with rice, peppers and onions. When I got my order no peppers and onions but over cooked rice and beans. Sigh. I hope this is just a fluke since they just re-opened for the season.  I'll be back next week to test out the waters again.", "author": "Louisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Great spot.  Love the frozen mojitos and grilled corn.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "I really like this place. I went here after a hard day and needed to kick back. A friend recommended it and it was perfect. Some drinks some food, although it wasn't originally on my summer To-Do, I'll definitely be heading back there. It's screams of legit Mexican cabana. Love it!", "author": "Anne G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "it was a hot, sweltering summer night and 7 friends slurped down beer and frozen margaritas while munching on corn on the cob and burritos at a picnic table. \n\ngotta love it.", "author": "missy l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "Summer means Habana Outpost for those that live around.\n\nThis is a go-to place if you want to grab a beer and sit outside with your friends on a nice day - although the sixpoint beer went up a quarter to 2.75 - um, thats still pretty damn cheap.\n\nFood is so-so (not the best foodtruck in bk) so stick to the beer.", "author": "Maudey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Ah yes yes! I finally got to visit Habana Outpost, and was quite delighted by the ambiance and food. First off, I expected this place to be a small shack-like establishment with grimy outdoor seats. But as I walked up to it, I was a bit surprised. It is located on the corner, with a large chain-linked fence along the perimeter. Walking through the gates, there's an assortment of seating, to the right there are about 10-15 wide wooden picnic tables with bench seats and umbrellas. Towards the center, by the water fountain, is another set of ~6 narrower metal picnic tables with no covering from the elements. And to the very left is another 5-6 tables covered by a canopy/umbrellas. There are a few tables located inside, but who comes here to eat inside, when all the festivities and ambiance is located outdoors.\n\nDon't feel intimidated at this point, as it could get confusing. Walk past the water fountain into the brick establishment to order your food (menus are located against the wall across from the cashier). We were quite the curious couple, and there were so many things we wanted to try, so we decided to go all out. We paid for our meals inside (cash only) and gave our name (which is printed on the receipt so the chef knows what name to call). Our drinks were served and we were instructed to give our receipt to the chefs located in the grease truck outside. (Note: Make sure you give your receipt to the chefs in the truck, otherwise they will not know that you ordered, thus they will not prepare your food). Our food took about 5-7 minutes, fairly quick. Utensils, napkins, and a large assortment of condiments/hot sauces are available on a counter in front of the truck. And now to the food:\n- Cuban Sandwich ($7.25) - roast pork, ham, swiss cheese, and pickles with chipotle mayo. A very delicious sandwich with good proportions of roast pork, ham and swiss cheese. The roast was ever so slightly dry to my liking and would have been a bit better if they added some more pickles or of the yummy chipotle mayo.\n- Steak Sandwich ($9.25) - sliced steak with onions, peppers, and chipotle mayo served on a hero. Yum! The steak was cooked perfectly, tender and juicy. The sauteed peppers and onions were sliced into larger strips than the norm, added some nice texture of crunch. Complimented with the bread which was crispy (far from soggy), and the chipotle mayo which was sparse (again they could have put more, but still very delicious), made for the perfect Steak Sandwich.\n- 2 Corn on the cobs ($2.00 each) - covered with Parmesan cheese and spices. The corn was definitely the highlight of the meal. The corn was grilled so still maintained its crunch. It was doused in what I believe to be Parmesan cheese, covering the corn almost in its entirety, and sprinkled with spices (possibly paprika, cumin, etc.). Ooooh, man I was dying.. For $2.00 each, you definitely need to try it out. I was surprised when the chef served us three corn on the cobs, which I had no complaints to such a delish concoction of such simple ingredients.\n- Sweet Plantains ($3.00) - A small plate of about 10 slices of sweet fried plantains. Typical but very delicious!! The sweetness took the edge off from the cheesy corn and slightly bitter hops of the beer.\n- Six Point Draft Beer ($2.50) - The cashier/bartender was kind enough to let me sample both their Pale Ale and Brown Ale, the brown ale being slightly more bitter than the pale ale. I chose to get a cup of the Pale Ale but both were equally good. \n- Lemonade ($3.00) - Decent though I felt it was either watered down or did not have enough punch (sourness). I like for my lemonade to have a bit of tartness on my first sip, so that my lips pucker up.\n\nWe really enjoyed our food. We noticed that we, and maybe 2-3 other patrons, had ordered food while the majority were only drinking beer or eating some simple tortilla chip dish. The decor made the place feel very cozy, taking your mind off feeling like you're in Brooklyn. There was also a DJ mixing music, which played good tunes. I will definitely have to come back here again, though next time I may just stick to the cheap beer, corn, and plantains.", "author": "Jason P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-10", "description": "I went to Habana cafe several times before and decided to try out the outpost since I lived in brooklyn. I love the cuban from the cafe in Manhattan and decided to try it out here. I WAS REALLY DISSAPPOINTED ON HOW DRY THE PORK WAS.\n\nThey skimped out on pork on our cubans also, If you want to try out the cuban for the first time at Habana do not goto the outpost it will leave you having a negative thought of habana. \n\nI recommend going to the habana cafe not here, the fried chicken waffles were not worth it. The corn was good here, along with the outdoor seating which kind of made up for the sucky cuban I had.\n\nI did regret coming here more after I was finished eating when I was walking around the area and there was a carribean fair going around and they were serving jerk chicken.", "author": "Jin C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}