{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-25", "description": "\"Best Cuban in New York\" \n\nCan be seen at the bottom of the menu on the wall. Well you know what? This aggression can not stand, man. This \"cuban\" is a disgrace. \n\nIT HAS MAYO INSTEAD OF MUSTARD.\n\nLet that sink in for a second.\n\nThe gloriousness of a cuban is rooted in the delicate balance of fat (pork fat, cheese) and acid (mustard, pickles)...when you replace the mustard with mayo, it destroys that balance. Not to mention this sandwich has an extreme amount of pork fat dripping from it... the very last thing in the world it needs is more pure fat in the form of mayo slathered on both sides of the bread. Who made this sandwich - Paula Dean?\n\nI cannot believe a place that otherwise has good food (the catfish taco is actually excellent) could treat The Cuban sandwich with such irreverence. Unbelievable.\n\nThis isn't even the best Cuban in Ft Greene/Clinton Hill (try Pilar) let alone New York...\n\n...this isn't even a Cuban.\n\nMAYO - SERIOUSLY?\n\n\nFFFFFFFUUUUUUUUUUUUUUUU", "author": "Lee H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "This is a nice hangout spot. The corn is good and so are the tacos. I like the outside seating. It's more of an adult vibe, but I bring my kids and we have a good time.", "author": "Ruff B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Usually have a cool time here for the food and drinks.....  However, I swear I just had the worst sweet plantains in my life...  Whoever the cook is today(6-11-2016 @ 6:50PM) needs to figure it out...  Greasy, barely cooked or over cooked plantains....  Guess this will be going in the trash....", "author": "Allan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Essential Brooklyn. Some of the best Cuban I've had - roast pork, rice and beans and the sweet plantains are perfect. Vibe is great. Only reason it doesn't get 5 stars is the seating. Most of it is outdoors and people just camp out. They've long since finished eating and just hang around talking. That is fine if no one is waiting, but this time of year the place is humming and there is always someone waiting.", "author": "Matthew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Fun place to hang out especially if you are with a large group of friends. Great area in Brooklyn, so easy to move on to the next place after a bite. Food is fine, nothing amazing or out fo the ordinary. Just solid.\n\nThey show movies outside on their terrace on weekends which is fun! Would definitely go back here.\n\nThey do not accept credit cards here, so make sure you have cash, or pay the fee for the machine they have in there.", "author": "Bree C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "Very cool spot..don't kno why they don't step into the new era and accept credit cards...the drinks were cool didn't really try the food..the music was cool and so was the vibes..will be back", "author": "Rey W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "The food was not very good, very bland and my chicken was burnt. The corn was also not that great. I have eaten at Cafe Habana and they are worlds apart, it feels like a fast food chain here and food is mass produced without any care. \n\nThe only saving grace is a great atmosphere, they had a great outdoor space that's good for group hangouts in the summer and cute lighting, but it's very crowded and kinda loud", "author": "Fawn Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "This place rocks, i love coming here when its nice out. They got some of the best food in the area. I will continue to keep coming here. I always have a great time with my friends.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Gotta love Habana Outpost. Frosty mojitos and coladas. Fattening ears of roasted corn smothered in tasty, fatty things (grated cheese, butter, red pepper). Sunny skies, beautiful music and beautiful people. Every visit to this spot feels like a \"daycation\" to Cuba whether you sit in or outside. I bought my homeboy from work here and he didn't wanna leave. He lamented about the fact that they don't have anything like Habana Outpost in The BX and all I could say was,\n\"Sorry buddy. The BX will never be as cool as Brooklyn.\"", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Love the chill vibe of Habana , and the awesome corn oh so good , the frozen margaritas hit the spot !", "author": "Naima C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "No need to travel to cuba for a Cuban Sandwich.  You just need to travel as far as Fort Greene, Brooklyn.  Habana Outpost (HO) has good food and friendly atmosphere.  They serve up tasty Cuban sandwiches ($8.75) and Mexican style grilled corn ($3.50)  The corn speaks for itself.  Once you try it, you are immediately hooked.  It can get very messy but it's great.  One of the many reasons why I keep visiting HO.\n\nHO is the best place to hangout during the summer.  They have a huge patio outside and communal style benches that make it easy to enjoy your meal and converse with friends.  They have a DJ playing music and it just feels like a fiesta after a couple of beers.  On very hot days or on weekends, you can expect long lines.  Yelp Tip:  If you are just looking for a drink, they have a separate cash only bar with a register.  They serve up frozen margaritas and  Brooklyn's own, Kelso Beer ($3.50).  I suggest you try the Nut Brown Lager.\n\nHabana Outpost is conveniently accessible off the G (fulton) and A/C (LaFayette Ave).", "author": "John A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "I now understand why a fellow yelping maniac loves this place soo damn much.  What's not to love?  \n\nFabulous frozen margaritas on tap.  Fabulously cute bartender serving said margs.  Cute people abound when you turn to your left or your right, take your pick.  Fun times, and an 80+ Oct night doesn't hurt either!", "author": "Sean S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "One of the best locations in NYC for fun, outdoor dining. Go with the Cuban Sandwich, specialty corn, and a frozen margarita. I have never spent much time waiting, but there's a reason why the line can be long: it's a kick ass place.", "author": "Christian E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I can't believe I have not reviewed this place. Too funny. \n\nI live so close and also I really dig this place.\n\nThis is an awesome place to hang out when it is nice and warm out. \nThey make the best frozen margaritas. You will get twisted. \n\nYou order your drinks and can order food too. \nThe food comes out of a taco truck in the \"backyard.\" Great place to hang with friends to chat and sip on some strong frozen margaritas. \n\nFun memories with yelpers and nonyelpers.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Eating a fish (or pork or steak) taco while drinking a frozen mojito, outside. Life is good. \n\nThere is a free water cooler (I always need to gulp down some agua before I head out). The staff is really nice and friendly, even though their quick-moving lines are usually long.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "How have I lived in Fort Greene for two years and have only been to Habana Outpost once? (It's also taken me over a month to write this review, but I got behind!).  As I've mentioned in other reviews, I've basically been ordering guacamole and sangria as much as I can over the past few weeks.  So I can say with confidence that I was very happy with Habana's guac - the consistency was perfect (mashed but with lots of chunks). Their sangria was a little sweet for me, but I get that some people like it that way.  I also ordered the famous corn which possibly was a mistake because I had to eat it with a group of people i didn't know very well and that's some messy business BUT it was tasty and largely lived up to the hype.  What didn't go so well at Habana was the service - it must have been the cashier's first day on the job because the line moved painfully slow and a number of mistakes were made with my order, and with others at my table.  No big deal, they were rectified but I left wondering what the management was thinking by starting someone so new on one of the first sunny days in May, during prime happy hour time.\n\nRegardless, i will obviously be back - the movie line-up this summer looks great.  i hope it doesn't take me another two years!", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Tried the Cuban Sandwich, Grilled Corn and a Strawberry Margarita... Let's just say I'm full, content and happy. We ordered and say outside on the patio and shared a table with locals.  This place is super easy to get to via the subway.  The only con was this spot was cash only although they have an ATM site just save yourself time and plan ahead... I was super excited to hear that a location will be opening in NOLA on Bourbon so I will definitely be checking in again soon.", "author": "Ashle' H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "I went here with some friends for drinks and something to eat before we went out to hang out...I love the set up it is so cute with the food truck in the back. The food and drinks were ok. \n\nI think its the setup that makes this such a nice place.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "Just stopped by this place, it's closed until april. They have a small takeout location across the street, but the restaurant is closed. Disappointed since made plans to meet a few people here...", "author": "Deniz A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "CASH ONLY\nOutdoor seating is nice.  You order inside, and pick up your order outside.  Self-served water is a plus -- no need to ask for a free cup of water.\nService is fast -- there was a group of 8 of us on one order and it came out within 10 minutes.\n\nThe Plantains were really good -- sweet and enough for two or three people to try.\n\nThe rice is not dry like I'm used to at most cheap Mexican/Hispanic places -- it seems sticky and dense with a little flavor.\n\nPork Tacos seem to be the best -- Catfish not so much.\n\nI had the Pork Cubano Sandwich which was very good.  The mayo and pickle really add to the flavor.  The pork can seem dry at times, but is balanced with the ham.  The bread is crunchy and tasty as well.\n\nThe guac and salsa are served in chip bowls!  When you finish eating the guac/salso, you can eat the bowl and get your money's worth!  The chips are crispy and thick -- delicious.\n\nI would go here again... specially with a big group that doesn't require anything fancy or super healthy (though they do have a couple of salads).", "author": "Walter K."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}