{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "I've been hearing about this place for quite some time now and I'm glad that I finally went. I was absolutely in love with the corn on the cob. I had to order another one. My friends loved their mixed drinks. It's definitely a good after work spot. I had the chicken burrito, corn, and roscoe on a stick. My friends had the steak burrito, fish taco, veggie hot dog, and we all cleaned our plates! We all had a second helping of their delicious corn and we will definitely be back!!", "author": "Stacey-Ann M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "If I were grading Habana Outpost on the ambiance and atmosphere alone, the place would definitely get 4.8 stars. The location is ideal - as it is next to the G train line, and the C line as well.  Plus, there always appears to be a mixed crowd full of people enjoying themselves since it's certainly a great place to be social. The outdoor seating is spacious and lively, and it's a cool concept to have the kitchen set in a renovated van outside. Also, the restaurant boasts a eco-conscious focus that is impressive on many accounts. \n\nThe food is more Mexican than it is Cuban, but in all honesty I have no quarrel with Habana Outpost besides the salsa not being free. Aside from that, you can't hate on a place that has $2.75 taps, delicious sangria/ spiked lemonade, great dishes, and reasonable prices given the neighborhood.", "author": "Brad O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "This was my second time here, I don't really remember the first time except for the corn.  My boyfriend and I were on vacation from Syracuse, NY and I made him stop here just so he could try the corn (and because I really wanted some)! And it was as amazing as it was the first time! If you're in the area, it's definitely worth a stop. The atmosphere is extremely laid back and they are a eco-friendly eatery (everything is recycled, even the rain water!).  The corn cost $3.50 (our total $7), the food was served out of a food truck outside and the wait time is fairly quick (we were served within 10 minutes of ordering). Now that I'm back in Syracuse writing this review,  I really want a piece of corn!", "author": "April S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "I went to Brooklyn this weekend to visit my friend and she brought me here.\n\nI love how you go up to the counter, order your food, then go find a seat. It's fast food with a \"sitdown meal\" taste. I got the steak tacos and frozen pina colada. AMAZING! I love the authentic taste and the vibe was amazing. Plus they have an outdoor patio. \n\nI'd highly recommend for someone who's looking for good quality food quickly in a chill, relaxed atmosphere. Just another reason why I love Brooklyn.", "author": "Brianne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-11", "description": "I ordered the steak plate, which was good, but certainly could've been a larger portion for the price. My son had Roscoes in a stick which was food but a little too doughy. Also I got the fish tacos to go but they didn't taste like anything, waste of $. Also the morito was ok, I didn't even get a buzz.", "author": "Joanna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "You order inside and pick up your food at the truck outside. The atmosphere is fun and lively. Corn is very good... Cuban sandwich is really the best sandwich in the house. Frozen piña-colada \u0026 Lemonada with vodka are surprises to discover. Really good. Informal and non-luxury", "author": "Federico P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-29", "description": "Sorry, lame Cuban Sandwich for a Saturday night. Ya gotta press it and ya should not use crappy sliced deli meat.\n\nA waiting line to the door of mostly hungry transplants yet lots of available seating. Seems like the place is run by girls instead of trained owner operators. \n\nThe LEE piece is amazing.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-06", "description": "I've been genuinely underwhelmed by this spot. The cash only aspect definitely contributes to it but i don't know, it's nothing to really write home about. The mixed drinks are expensive I think for such a casual setting that's self service. It's a chill spot but there are definitely better spots out there and in the area more worthy of my cash.\n\nTwo stars for the open-air space and location...good for meeting up with friends.", "author": "Sonika H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-24", "description": "I dragged my friends here to try the frozen drinks. I got the frozen pina colada, which was good, sweet, and filling. 1 star off for no seats. We had to stand and drink -_- After we finished our drinks, we decided to go eat at a restaurant. As I was walking, I began to feel very sick. I dunno why. (Another star off). Either the drink was too strong, or I've eaten so little before. We got to the restaurant, and the sickness went away. Instead, I felt very tipsy and buzzed. I was surprised that one tiny pina colada made me feel so confident as well. Lol", "author": "Kat C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "My wife and I stopped here with our tour guide last week.  He could not have made a better recommendation!  I love the \"off-the-grid\" setup.  The herb gardens, solar panels, and rain reservoirs make this restaurant very unique.  The bright colors and friendly service really put me in a great mood.  \n\nThe food was hot, very fresh, and flavorful.  The grilled corn was spectacular; you must order this when you visit!  If you're in the area...heck if you're not in the area, find your way to Habana Outpost and eat some great food!", "author": "Philip L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-19", "description": "Reminds me of one of those places featured on Diners, Drive-Ins \u0026 Dives. Order inside and pick up your food in the back yard which features cafeteria style seating. There's also the option of sitting inside which has a vibrantly colored Cuban decor and an open layout. I'm a fan of their beef burrito and pineapple ginger lemonade. Great chill spot.", "author": "Annie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Went here on a date I think...? Or a meet-up? A date. Whatever it was, I felt weird for drinking the awesome Six Point draft beer (locally made) for $2.75 because he wasn't drinking any alcohol. \n\nI think after that I had a margarita. Both were awesome. The nachos are GREAT. You need to order it and hopefully when you get it, you aren't on some weird meeting where you're not sure if it's a date or not.... This was awkward for me. I hope it was for you too.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-20", "description": "I have been here a few times...It's nice to have a larger space to sit outside when the weather is nice. And with that said, it can get really crowded! \n\nFood is fine, but is a pain to order...you end up waiting in multiple lines.\n\n$8 slushie mojitos seemed a bit pricey for Fort Greene.", "author": "Birdie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "GRILLED CORN!!!!!! amazing!!!\n\nawesome ambiance! fun outdoor patio with colorful rainbow umbrellas and upbeat music. \n\nThe steak taco was pretty bland, so I'd skip on this next time. The roscoe (fried chicken on a stick enveloped in a waffle) was a little too sweet for me (but um AWESOME idea). \n\nThis rating is just based on the awesomeness of that grilled corn. (Also, frozen mojito was surprisingly strong!)", "author": "Jeanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Love the atmosphere! Definitely gonna hang out here more often when the sun's out. It's open pretty late, too.", "author": "Anami N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "I went to the habana outpost recently since a handful of friends raved about it. I love the vibe and how earth friendly the place is but food wise, its different.\n\nFirst the drinks...... I had a frozen margarita and my boyfriend, the spiked lemonade. Both drinks were extremely weak! I was saddened by this.\n\nThe food..... We shared a cubano plato. The pork had mucho flavor and was tender and juicy. The rice and black beans weren't all that good. The rice overcooked and the beans lacked flavor even though they were perfectly cooked.\n\nThe mango and jicama salad was fantastic !!! That salad alone gets 5 stars from me.\n\nAll in all, i would go back and have that salad and maybe get the cubano as a sandwich and not a plate.\n\nStill more menu to try and they have beer so i know better now.", "author": "Anngillian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "What a fun place!  Delicious food.  I had the steak taco and a chicken quesadilla with a side of guacamole.  There is mostly outdoor seating, which you definitely want, since they don't seem to have AC inside.  The seating is sort of a free for all, so it's likely that you'll end up sitting with strangers.  What better way to make new friends than bonding over good food and margaritas?", "author": "Candis D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Places like this are why I freaking love Brooklyn. Habana Outpost is like a neighborhood block party with great music and Mexi-Cuban food served out of a truck. People can stroll in and (mostly) leave their pretensions at the entrance as they chow down outdoors at picnic tables, immune to the traffic and passersby beyond the chain-link-fence enclosed space.\n\nThe frozen drinks were super-strong, practically demolishing the two lightweight Asian women I was with. I enjoyed the morita (amalgam of mojito and margarita, $8) but found the margarita ($8) cloyingly sweet. Both melted immediately in the heat of the summer night but I suppose that's bound to happen when your blender is powered by a bicycle.\n\nPerhaps the cooks in the truck were slacking that night? Habana's famous corn was lukewarm and overly spiced, while the Cuban sandwich tasted like a toasted ham and cheese from Subway. \n\nNo matter, I'm still a fan of the space and fun vibe here. However, not a fan of the mosquitoes that made an AYCE buffet out of my legs that night.", "author": "Zebra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "All the great food from their SOHO location, but in a much roomier location. The roasted corn and Cuban sandwich are crowd pleasers, but the comfort of the open patio is the main draw. A great place for lunch on the weekend or a casual night out.", "author": "James J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Good atmosphere, terrace is great. Food is okay but a little bit overpriced.", "author": "Guillermo T."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}