{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "I ordered the chicken burrito (grilled chicken, roasted peppers, lettuce, rice \u0026 beans wrapped in a flour tortilla with a side of jalapeños) for $8.75. It was a good first burrito experience for me, but a bit bland. I was not brave enough for the jalapeños so I kept it to the side. You can expect a full house towards late afternoon on a Sunday afternoon due to the weekly movie screenings. Due to the crowd, it can take a little longer for the wait staff to clear the tables. Great atmosphere and very casual. I have to try their infamous corn one of these days.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "I went their with my friends after graduation last year. The place is cheap - the food and the margarita is good \u0026 cheap. Big outdoor space with umbrellas for both big and small groups. The corn is a must if you love corn.\n\nRecommendations: Margarita, Corn", "author": "Ira M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "This place is very unique. My friend and I got there at 12 when they opened and it got really crowded, mostly with families and their children. You order then pick it up from outside. My friend and I ordered more than we should have - everything on the menu looked so good! We got the corn of course, the roscoe on a stick, frozen mojitos, an avocado and cheese sandwich and a catfish sandwich. We found the corn to be a little spicy but still delicious nonetheless. I loved my sandwich, I'd definitely go back for another one! We weren't big fans of the roscoe on a stick although it is unique. I liked the frozen mojito however it was really strong and being outside in the heat didn't help! It'd be nice if there was air conditioning inside. Overall we had a nice experience here and I'd definitely go back!", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "I like this place a lot. I've been here many times especially in the summer months. My favorite is the pina coloda, mango margharita, and the grilled corn. The drinks are always delicious and perfect for a nice hot day. They are also pretty strong. It definitely creeps up on you. There is always a long line to order food but the line for drinks and corn is short so that's what we usually do. They also don't take credit so you have to use the ATM located in their store for cash. The last time I came I was hungry so I waited in the food line and ordered the roscoe on a stick along with the corn. I was expecting pieces of chicken alternating with pieces of waffles on a stick but instead it was like a popsicle of waffle batter stuffed with chicken. It was still good but not what I was expecting. Overall, I would definitely recommend this place for a chill causal vibe with a nice tropical drink.", "author": "Djerica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "I believe this place is related to Cafe Habana in SoHo. The menu is essentially the same but I think the food is slightly more pricey at this location. There's outdoor seating, in addition to indoors, which is great for the summer. It's a pretty artsy place. You order and part for your food inside and pick up your food in the truck/vendor outside. I'm not too sure if it's the same during the winter time because I only came here once during the spring/summer. The bathroom is kinda creepy lol, it's in a cubicle outdoors. \n\nI would say I prefer the SoHo location better. The food taste better in that location, in my opinion. The waffle and chicken was a bit dry.", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-07", "description": "Food poisoning. More than once. Super fun atmosphere but eat at your own risk. Food is not even good but the atmosphere make it seem \"fun\" until you get sick .", "author": "Marco B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "Beautiful place great for kids, small but good selection of craft beers. Now my problem is with the food, it wasn't horrible but it was flavorless. I got the catfish burrito which was fried in a beer batter. It honestly sounds amazing but once you bite into it all the high expectations disappear. Nice place mediocre food.", "author": "Jose B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-25", "description": "Expected more from this place. Heard many great things about it for years. When my friend and I got there they didn't have great choices for drinks. Everything had to be cash. The food was kinda stale. Hoped for more from this place.", "author": "Kadiatou B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Simply divine.\nHave both been here and ordered multiple times. Their fish and veggie tacos are our go tos as well as the sweet plantains and grilled corn. Would recommend to anyone looking to get a nice fresh clean meal. The environment is pretty cool and funky at the restaurant but in the winter the space is limited and more of an in and out place. No quality loss when you opt for delivery/pick up.", "author": "Sunny Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Went to the location across the street, without the outdoor seating while this part was closed for the season. It was a Saturday evening. A nice warm vibe and authentic aesthetic. Only one small table in the back, but has bar stool seats near the front. I had two chicken tacos for $7.50. I tried the corn on the cob and the beef empanada. Everything was really yummy and flavorful. I would definitely come back here!", "author": "Elihcor K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "The food is fantastic and the atmosphere is outstanding. If your visiting Brooklyn make this a stop on your to see list.", "author": "Lasharan A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-12", "description": "My friend who is from NYC told me about this place! I was a litttle disappointed ! She raved so much about it, but I was not able to see what the hype was about", "author": "Tolu O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Great spot! I visited here with a friend after a concert. It was around 11pm on a weeknight and there were a decent amount of people. The bathrooms were cool! You order at the register and pick up the food outside. Great decor as well!", "author": "Nat P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Such a fun place....tacos are tasty! I tasted shrimp, pork, and catfish. Pork was my favorite; catfish my least, but all in all, very good. Rice and beans were ok, but the corn was super tasty! Probably some of the best Cuban corn I have tasted. Being a CA girl, I had to try the chicken and waffle on the stick, and i have to admit, it was pretty pleasing to my palate. Batter was just sweet enough, but I wouldn't mind a little more chicken. I am not a huge fan of frozen drinks; I tasted the mojito and margarita, I would just stick with beer. All in all, food is 3.5/5, but ambiance during the summer is 5/5. Nice day....definitely stop by!", "author": "Monae P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Like this taco place it's bright outside. Lures you in but the food is up to par w/ the beautiful outside simply done but done well can't say I ever had a bad taco here so yeah it probably 4 \u0026 1/2 stars almost 5.   I think so", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "1st cash business only.!!!! ATM in side  $2.00 free very careful coming out C subway walk in to colorful EMPTY ATM.!! If meet up with friends get seated 1st great outdoor space can get crowned quickly!!! Random Spanish loud music playing in the back ground. Very colorful decor.fun, bus~vibrait party good food I have the chicken burrito, friend had mango salad stayed it was fantastic. drinks might little bit overpriced. I'm not a big fan eating corn cob but it was popular is cover so much cheese \u0026 spicy Sseasoning looked good.", "author": "Edwin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Such a nice summer hangout spot.  But get there early or get ready when wait for a table.  Also cash ONLY.  But there's an atm inside if u need cash", "author": "Nan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "After months of telling myself to go eat at habana outpost, I finally made it! I'd heard nothing but good things about everything from the food to the drinks to the ambiance. First of all let me say that this is cash only. The ATM right outside is an empty shell so try to hit your bank before getting there.  Secondly this is first come, first seated cafeteria dining so be prepared to get there early or have a keen eye on spotting tables. \n\nWe arrived on a Monday and were able to score a table in the very full outdoor seating area. My friend and I held down the fort while the guys went to grab drinks and order food. I wanted a spiked lemonade but was mistakenly ordered a margarita. Good but frozen drinks aren't my favorite. Round two was the spiked lemonade and it delivered. Deceptively strong and the mixer covers any trace of vodka. They ran about 8$ which isn't to shabby.\n\nI shared a chicken quesadilla with my man. It was dry. I wish it came with a side of sour cream or more salsa rather than a small drizzle on top. I didn't expect to need it when it said it was served with the two. The steak taco was much better. They are served in soft tortillas with onions and cilantro sauce so avoid if you are not keen on the two. The stand out items on the table were the Cuban and the grilled corn. I can't personally attest to the sandwich but my friends loved it. Another friend and I had varying corn experiences. His was completely covered in cheese. I mean it, caked. Mine had less cheese but a crazy huge stripe of hot cayenne pepper. Both of us enjoyed them greatly but wished he had slightly less cheese and I had a more disperse spices. It just caused us to drink more which was fine in the long haul.  Oh and fyi, cheese fries means the fine powdered cheese in a condiment cup, just poor on top! \n\nI'll definitely be visiting again. The drinks were great. Beer was cheap (3.50 drafts). Plus out door seating and I can't resist corn on the cob (3.50). The major food items were all around 8$ but I'll end up trying something else, with a side of some salsa. They get a 3 for the majority of the food, 4 for drinks and corn and 5 for the great outdoor space.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "I love this place! So cute and nice outdoor space  :) I ordered Quesadilla and my friends ordered three kind of tocos. It was good! Chicken Quesadilla was so delicious! I will back to this place again", "author": "Midori K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "This place had decent tacos, the fish was tasty and crispy, and the pork was alright but didn't blow my mind. They came with salsas on already which is never a good look. All taco places should have a self service salsa stand. The roasted corn was excellent, as was the Cuban sandwich. French fries were also tasty, and the beer selection was decent. This place is environmentally sustainable and uses fair labor practices, so lots of credit for that. Most of the seating is outside at picnic tables.  Good customer service.", "author": "Sean L."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}