{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-24", "description": "I've always been a huge fan of Habana. It's in my hood, it's a great spot, with a great crowd, and with cheap drinks. overall great vibe.\nI hate to say, though, that their food system has completely failed lately :-(\nthe truck folks are completely disorganized, which results in your order being ready in 30-45 minutes, cold, and after having switched hands several times. Also, your name will be whispered very quietly from inside the truck, so make sure you're standing right in front of it for those 30-45 minutes, asking about your order every 10-15. another small comment... you can't charge me $8.50 for a sandwich with guacamole and cheese coming off a truck in brooklyn, when a beer is $2.75, meat-filled options are cheaper, and there is no service. no particular stand on those points, but the relativity just doesn't stand. almost anywhere else, the veggie option is reasonably priced.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Delicious charbroiled grilled chicken burrito stuffed thick with chicken salad beans and rice. Guacamole and fried plantains were delicious. I liked the ambience here. It is romantic in rustic way.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-23", "description": "Lines for DAYS.\n\nI remember when this place first went up and was empty. No one knew what the hell it was. Overnight it became some hotspot with people of all social groups (hipster, professional, hippie liberals, etc). \n\nThere are two main places to sit, outside on the park benches or inside at a booth. I prefer chillin out side. The draft beers are cheap but decent. Haven't tried the food ( I have issues eating anything prepared in a cart). Difficult to hear if you go with a sizable group of friends.\n\nAll in all, nice place to rest your heels if you've already got a little buz and want to chit chat with friends.", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Love d fish tacos and d corn but make sure to get extra cilantro sauce for the taco. .add a little spice to it. And u cant never go wrong with the corn", "author": "Dinah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-31", "description": "Place has nice outdoor seating but is super crowded. Seems like a good place to go hang out and have drinks with a group of friends. The food was alright. One of my friends liked the corn and the other two thought it needed to be more cooked. No one really liked their tacos too much.", "author": "Mahrukh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "I had such high hopes for Habana Outpost especially since its sister restaurant, Cafe Habana is one of my all time favorite good eats. I admit Outpost has lots going for it. Bigger space, outdoor seating, an eco friendly message and for us Brooklynites it gives us access to loved brand but closer. But the food falls a little short  and the ordering system is also a bit of a hassle and something about the Cafe Habana spirit gets a little lost in translation. However, I'm not going to completely right this place off. \n\nIt's completely a fun and a good space for unwinding on a weekend or afterwork with a bunch of friends and there aren't too many of those that fit the bill.", "author": "Yvette W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "Very unique concept. The bathroom is set up like an outhouse. And when you order your food, you do so first before sitting down in the location of your choosing. Then when your order is up, you go to the food truck like window to get your food and sauces. The margaritas seemed to be a little water down, but the corn on the cob was the best corn I've ever had. Who ever would have thought that Parmesan Cheese over corn on cob tasted so good. I also had the catfish platter which was good. I love the concept which allows you to sit inside or outside on a nice day/night. I will be returning.", "author": "Sheldon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "Holy god overrated. No food on earth is worth the indignity of the ordering process here.", "author": "Tom T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-03", "description": "A really cool looking restaurant, and eco-friendly to boot. A friend and I stopped in after a reading at Greenlight across the street and ordered chicken quesadillas, cheese quesadillas, guacamole and chips and one of their half-pints of beer. It's not really a sit-down restaurant, and I would recommend it for a quick snack rather than a full meal.\n\nThe food was good, but not amazing, and I didn't appreciate that my quesadilla was smothered in sour cream and salsa. It was messy to eat, and I like to control the ratio of salsa-to-quesadilla in each bite myself, thanks.\n\nOther than that, it loses points for being cash-only, which we only found out after we had ordered.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "2 different people suggested we grab a drink here after a show at BAM so we obliged. The catfish taco was a high point in my life and the frozen margaritas (don't judge me too harshly) were received as being 'exactly what I need in my life at this particular moment.' Bonus points for being super accommodating for my friend who ordered root beer and didn't dig it (so Australian right now): she was given an orange soda free of charge! So naice!", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "I finally had the opportunity to check this place out last weekend. The food was delicious. I had the chicken quesadilla, my boyfriend had the diablo burrito and we both had the corn. Everything was amazing! The setting and decor of the place is visually stimulating, it automatically puts you in a good mood. Lots of bright colors, outdoor space, mood lifting music... It really adds to the dining experience and makes it a million times better. I've heard great things about the tacos and margaritas, which I hope to try within the next week or so.\n\nThe only complaint I have is that the cashier, or whatever she is, the person who takes your order and rings you up (I wish I knew her name), she was a little rude and had an attitude problem.\n\nEither way, I'll definitely be returning! It was worth it.", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "I feel lucky that the first couple of times I tried this place, there was no line. Maybe because summer wasn't yet in full swing, but I didn't have to wait more than five minutes. Also, it was so hot the first time that I went with an unusual combo - the MANGO \u0026 JICAMA SALAD and corn. I'm sure most people pass over the salads in favor of all the heavy stuff, but seriously - TRY IT. I've had it three times now. The mango is some of the freshest I've had outside of Asia! The jicama is crunchy and refreshing, and dried cranberries are a nice touch. It comes with a creamy dressing that complements it well.\n\nThe corn is as amazing as everyone else says it is (also insanely messy, but isn't all good stuff?) and the pineapple ginger lemonade is unique and delish, whether spiked or not.  \n\nAside from the food being so great, the place lends a fantastic vibe to the intersection and the neighborhood and is part of the reason I ended up moving here! I'm sure I'll be back often.", "author": "Danna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "love it here! Ive been coming here for years now!  Great place, great food, always a great crowd! Highly recommend if your looking for a cool laid back \"hipster\" place!\n\nOh and get the corn!!!!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "I had the infamous corn and fish Taco. The corn wasn't hot it was barely warm (so what was the wait for) \u0026 the fish Taco was so full of everything except flavor and fish. I've been here time and time again and I really need to stop thinking it's going to change. The only thing that is consistently good are their drinks.", "author": "Elise E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-22", "description": "BURRITOS ~ 10LBs LATER ~ BURRRIIITTTTOOOOSSSS \n\nI came to Habana outpost for the first time last week after a long day of service. My team and I were ready to eat something spicy then drink liquor so that our saliva can turn to flames!! It didn't work but we had some great and not semi okay food.  It was a semi warm day and they have a nice outdoor sitting area. We must have gotten there just in time for the lunch rush because the line was out the building. It took 25 minutes for us to order our food. \nFYI I am the type of person who offers my food in hopes that you will then offer some of yours so I can taste everyone's food. It usually works.\nAnyways, I ordered the chicken burrito but everything I tasted was as follows: \nGuacamole and Queso sandwich, Catfish burrito, cheese quesadilla, Grilled corn, Roscoe on a stick (chicken and waffles), and the frozen Margarita. Now I did not enjoy my chicken burrito. It was way too dry for my liking. The rice had no flavor and I hate the taste of charbroiled meat.  It is pretty much case closed on that chicken burrito. BUT that catfish burrito!!!! What... That burrito was delish. Idk what it was but it was filled with flavor. I mean I only had a bite (or two) but it gets a thumbs up. The cheese quesadilla and guacamole and queso chicken was tasty but that roscoe on a stick!!!!! I was in love. Now I might be pregnant because I was craving some chicken and waffles and Habana Outpost did Roscoe proud with that side dish. \nAll in all I had a good experience at Habana and would definitely go back. Here's the menu if you want to see everything they have http://cafehabana.com/data/downloads/Color1161812784.jpg", "author": "Ayanna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "School is out, so we decided to kick back and take it easy for the day. We rolled into Habana Outpost, a real gang of four, and checked the space for a free table. At first we had no luck, but after about a 5 minute wait we scooped up a couple chairs and took over the first available table.\n\n\"So this is what 70 degrees feels like,\" she says, as she slaps on her sunglasses and crosses her hands comfortably on the back of her head.\n\nTwo of us share a guacamole \u0026 queso burrito, the righteously famous corn, and some guac and chips, while we all enjoy an icy cool cup of iced mojito.\n\nThe burrito is cold, which sounds odd, but on a warm spring day like no other, it's just right. The queso and guac are mixed excellently with rice and beans, with a side of jalapenos. The fantastic corn is something out of a Paula Dean throwdown, but the portion size is forgiving. The guac is rich in texture and flavor, although slightly overwhelmed by the raw red onion.\n\nThe mojito is nice and refreshing, composed of crushed ice, lemon, and a barely traceable taste of rum. These aren't your typical mojito ingredients, neither does the drink actually taste like mojito, but it's still highly enjoyable. \n\nNice atmosphere, happening people, wicked vibes, tactful portions, and a potential sun tan make Habana Outpost something to write home about. But don't bring your date here!", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-27", "description": "I came here only for drinks, on Memorial Day, and really enjoyed it! The line was extremely long to get drinks, but it was well worth it! The drinks were strong and the outdoor seating was great to just relax and catch up with friends, I'll be going back to check out the food, it looked delicious.", "author": "Bonita S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-20", "description": "Overpriced, overhyped, gaudy Brooklyn food joint.\n\nThe menu says \"Limited\" so I asked to see the \"extended\" menu.  I wanted more options.  \"It's coming--if you come back in two weeks we'll have more.\"\n\n\"Can you add guacamole and cheese to my burrito?\"\n\"Well, yeah, it's eight dollars extra.\" \n\n[???!!!]\n\nSo I ate my boring $8 burrito.  I didn't buy an eight dollar machine made margarita or mojito in the small plastic cups. \n\nI must say that this place relies on it's space, outdoors seating, colorful environment, the yuppie factor in the area, but it's nothing special.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "My get away spot. Great vibe. Good Cuban food \u0026 drinks. Lets not forget about the Corn!!!... Best time to go is movie nights outside.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-12", "description": "nice atmosphere!  food and drink were a little outdoor-family-picnic-y for my taste but it was a nice quick lunch outside.", "author": "Meghan G."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}