{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "One-of-a-kind ambiance in Brooklyn or even in New York City. It's casual, lively, eccentric with vibrant colors and Spanish music. Wonderful outdoor seating made up of colorful picnic tables, benches, and chairs. The restaurant may look like a kids playground at first but, it is very much an adult zone (children still welcome). Once you walk in, you feel like you are transcend into some type playful rainbow haven detached from the rest of the world. All of a sudden, the busy streets, cars, and people seems so far away even though they are only separated by a tall fence. Customers order food and drinks and pay at the counter located inside the restaurant. And then, stay for as long as one desire chatting or dreaming away. Time becomes irrelevant in this safe haven. Food and drinks are delicious. While prices on the menu does not seem too expensive at glance, it definitely adds up. \n\nAlthough there are indoor seating, it is very much an outdoor restaurant and is closed during the winter. Also, very interesting eco-friendly outdoorsy bathroom that uses rain water.", "author": "Eva Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-23", "description": "I can't imagine anywhere I'd want to be more than Habana Outpost on a nice day. The ambience is WONDERFUL and so fun! I think the food and drinks are solid: the Cuban sandwich is great (though needs more pickles) and the catfish burrito was a little boring, but perked up when I added hot sauce. We got the frozen mojitos, which definitely didn't taste like mojitos at all (more like margarita mix), but were still enjoyable. The best part of Habana Outpost is just being able to sit outside at a gorgeous restaurant surrounded by rainbow umbrellas, friendly people, and cute dogs. The music is a little loud, but that makes it more fun. It's a vibrant and exciting spot.", "author": "Riva L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Cool ambiance here at Habana Outpost. There's an inside and outside seating area, but outside is where all the action is. Lots of wonderful people from everywhere come here to chit chat and enjoy themselves. \n\nDrinks are pretty good and there is another location across the street if you feel like the line is too long here. \n\nOnly thing I did not like was the chicken quesadilla I ordered; the chicken was tough and made me sick later on in the night. \n\nDespite the laidback atmosphere here to enjoy summer rays, I won't be returning anytime soon.", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "Best Cuban spot after a concert at Barclays! Nice interior too!\n\nLocation: it is 5 minute walk from Barclays center. The place is right at the corner, the interior is nice with a Spanish vibe! Music is all spanish and you can dance in the middle which is kinda cool!\n\nService: the guy (i believe is the manager) is nice, talks to all who eats there. The girl cashier is lost. Lol\n\nFood: I only ate 2 things here. CUBAN SANDWICH: it is good but I ate somewhere better. It's okay for me. GRILLED CORN MEXICAN STYLE: also it's okay, the corn was too small for 5 bucks, the sauce on it is good tho. \n\nPrice rating: 5 out of 10. Cheap but small serving.\n\nWill visit this place maybe in daytime to I can take pictures of the interior, and they have a outdoor garden too!", "author": "Mark Nowell M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "Average!\n\nHabana is that great summer place with outdoor seating, decent drinks, and music. However, it's overcrowded and in my opinion, the food isn't that great. Here's the process:\n\nYou can look on the large menu on the wall and decide what you want to drink and/or eat. If you're a regular, that's not necessary. I would suggest while you're ordering you send one of the members of your group outside to look for seats because it's relatively difficult to find one here. It's like people will just sit and stay for hours, sorta like Starbucks.\n\nAfter you order your items (cash only) you'll head outside and wait for your number to be called. If you were fortunate enough to find a seat right away, then just watch the board until your hunger shows.\n\nAfter that, it's all up to you. On the weekends, they have a DJ. Unfortunately, on my last visit, that was the only seat available, directly in front of the DJ-- I could barely hear myself think.\n\nI always go with the Cheese Quesadilla, it's ok, but that's it, it's just okay. The same can be said for the rice and beans. My friend continuously tells me how delicious the corn is, but while every time I say I'm going to try it out, I always wind up sticking to my Quesadilla. \n\nThe drinks are also just okay. It wouldn't hurt to add a little more alcohol. But whatever! Like I said, it's great for these summer nights, but nothing more than that.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Go for the Cuban sandwich, NOT FOR THE DRINKS!!!! Cuban sandwich was delicious but the spiked lemonade was horrible! It tasted like the powdery sugary mix you buy from the supermarket.  It was supposed to be ginger pineapple lemonade but they failed me :( I woke up with the nastiest headache and nausea. Fish taco was not good either but once again GO FOR THE CUBAN SANDWICH!!!", "author": "Natalia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Habana, oh na na. \n\nThis place is cash only, and you pay by the cashier! \n\nTo be honest, the workers could have done a better job of greeting us and explaining to us how ordering works. \nInstead of us having to make the mistake of sitting by the booths, waiting for the food for several minutes, before realizing there was actually a beautiful patio. AND that our food was ready a long time ago by the patio.\n\nWe were wondering where all the customers were. They were outside! It was better out there too since there was no AC inside.  \n\nThe chefs make the food by the patio and you would pick it up by the counter when you see your order number on the display. \n\nGrilled Corn ($4.00): 5/5\nThis was the sole reason I wanted to go here in the first place. And it did not disappoint!\nThe cheese and chili powder went perfectly together with the sweet corn. Who knew putting stuff on corn could taste this good? \n\nRoscoe on a Stick ($5.00): 1/5\nI should have gotten tacos. I was just intrigued by chicken waffles on a stick. I didn't expect the chicken to be so dry. It didn't really taste like much, even with the syrup. I also wasn't expecting the \"waffle\" part to be so hard on the edges. \n\nOverall, even though the service could have been better, Habana Outpost is such a beautiful restaurant! You could already tell from the storefront. The outdoor patio also brings a refreshing unique point to the place! Perfect for the summer.\n\nI would go back for more of that grilled corn!", "author": "Sandy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This place serves the most delicious Cuban sandwich  we've ever tried. Definitely recommend getting it. \n\nMy hubby doesn't like Swiss so we almost didn't order it. The atmosphere is perfect on a summer evening. \n\nIt had just rained that afternoon so the outdoor seating was a bit soggy. Maybe opt for the indoor location across the street next time the weather is questionable.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "This place is designed so well on the exterior! So cUte! The interior seating feels a bit gross. My gal pal and I ordered the nachos, which you pick up at the \"decorated food truck outside\" They were ok. NOTE: this restaurant is cash only. The menu advertises that they have movie nights on their outdoor patio and dj on some nights. The music was very low at conversational level tonight. I don't think I'll return. Food, ambiance, and vibe didn't peak my interest.", "author": "A'Yanna E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This place is a classic go to in the summer. If your looking for a good frozen drink and good food this is your place. This place is casual and has tons of outdoor seating. I usually get the tacos here. I had the fish and pork taco. Very yummy. And I also had the roasted corn. Omg yassss. This is something I get without fail. And I normally drink the morito which is the mix of the frozen margarita and mojito. Or I get the margarita with some red sangria mixed in. Turn up! Drank! \n\nIf someone comes into town and wants to go to a casual place with good vibes, good food and good drinks come to Habana!", "author": "Anya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Habana Outpost: Cafe Habana's Brooklyn location has one of the best cuban sandwiches in NYC. I always get a side of the spicy mayo ($1.50) because I find the sandwich can use that extra creaminess. Be sure to order with a side of maduros (sweet plantains), a frozen margarita or mojito, and you will be thoroughly satisfied!! \n\nThey have a wonderful outdoor space where you can sit, but unfortunately their ticket system doesn't make a lot of sense. If you sit to your right as you exit the main entrance, you will not be able to see your number displayed as you wait for your food. Otherwise everything is perfect!", "author": "Charles R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "I really really like this place. My friends and I came here on a Thursday afternoon and we sat outside although it was super hot. The patio is really nice, bright and colorful and the umbrellas provided the shade that we needed. We were able to order right away because the line wasn't long at the time we got here. I ordered a chicken quesadilla, corn of course and for drinks I tried the piña colada and the mojito. \n\nLet's start off with the drinks, they were good. Just on the sweet side for me but I enjoyed them nonetheless. The drinks are strong, wow like it really sneaks up on you. At first my friend didn't think they would do the trick but they sure did. As for the food, it was also enjoyable. My quesadilla was good but my corn was delicious! Loved it. Will definitely be returning in the future.", "author": "Guitelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Long lines, metal chairs, communal tables outside and meh liquid cheese on the nachos...all that said, I still love the place! \n\nIt's like you're at a party and everyone is in a good mood! If the weather is nice, there's no place I'd rather be then on the outdoor patio. \n\nI used to go to the cafe Habana in Nolita (where I discovered the much loved corn). This one is bigger, better and has much less of a see \u0026 be seen crowd. Please don't go though; you'll only add to the long lines.", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-17", "description": "Nothing special...food was not even that good,portions are way too small:(Cute outdoor space though", "author": "Irina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Tl:dr cash only! great outdoor hangout spots for dates or friends\n---\nI came here with a group of 8 on a movie night (yes! In the summer time they project a movie onto the wall!) and we were eventually able to find seats for all of us!\n\nI ordered the Cuban sandwich and a frozen mojito. The frozen mojito was bomb! Not too light and not too strong, yet a good amount of frozen. The Cuban sandwich was actually more filling that it appeared. The bread was crispy and delicious. The ham, cheese, and pickles were just as good. The pork was alright. A little bland if you ask me, but overall it was a good sandwich with everything combined.\n\nI really enjoyed the atmosphere here. Before the movie started, there was music playing and it was great being able to spend a relaxing Sunday night here", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Boyfriend and I got the Cubano and the fish tacos. AND IT WAS FREAKIN DELICIOUS. \n\nI am in love with pickles so the cubano was my favorite. The bread was perfectly toasted. And the sauce inside was a great combination between spicy and creamy. It had the perfect amount of meat, sauce and pickles. It was amazing! Best cubano sandwich I've had so far.\n\nWe also ordered the fish tacos. The fish tacos were also delicious. The fish tasted very fresh and it was tender but with a crispy coat. It was also seasoned very well and the topping within the fish taco was also a great combination.\n\nThis place is adorable! Perfect for a sunny day brunch. They have a large outdoor seating and they give you numbers and they display your number on screens around the outdoor areas to pick up your food! Great system! Overall very cute place!", "author": "Frances T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "I enjoy coming here. It's a very chill place. There frozen alcohol drinks are on point. It's a great place for a date. Especially in the summer. I would definitely recommend this place", "author": "Victor J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "The atmosphere was amazing but I found the food to be pretty basic and lacked the authentic Cuban taste I was hoping for. I ordered 3 different kinds of tacos, Corn and guacamole with chips. All of my food tasted good but def was not the best I've had. The margaritas barely had any alcohol in them and tasted more like juice but were actually very flavorful. I would come back to this restaurant but more for the atmosphere than the food.", "author": "Julienne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Loved the vibe here. Big outdoor area. Drinks weren't too expensive. Poured strong enough. \n\nI didn't try any of the food but it all looked great. Would be back to chill with a group of people.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "The whole place is even more beautiful and eclectic than the pictures on here show--its so full of color and makes you really feel like you're in Cuba, not right next to all the chaos and commotion of downtown BK. I went for lunch on a Wednesday afternoon, so it wasn't too busy, but I'm sure it gets packed on the evenings and weekends.\n\nYou order inside at the front counter, and then head to the courtyard to pick-up your food. I understand the efficiency behind this, but if you're dining solo it makes it harder to go back and forth to order more food (and by food, I mean margaritas). \n\nI had the Roast Pork Plato (roast pork with rice and beans) and a margarita. The Roast Pork Plato was amazing all-around; if they had an item on the menu that was just a plate, or tub, of roast pork, I would definitely order it. The margarita was too sweet for my liking, but paired well with the food. There's lots on the menu and they highlight their most popular items, which just makes it even harder to decide. But I really doubt you could go wrong with anything here!", "author": "Teresa L."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}