{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "Ate here a while back and enjoyed its no frills, simple, fresh 'Cuban' food. Okay, so it's a little Americanized, but it's still good. I went during the summer so it was great to sit out on the patio with a beer (or mango boing!) and relax with a burrito. \nIt's literally steps off the Lafayette stop, so it's very convenient to get to! A great place to stop by for lunch/quick bite. Maybe it's not the best thing I ever ate, but it definitely hits the spot for that craving. \n\nThe only thing I didn't like was ordering inside and then waiting outside for someone to call out my order from the food truck. I had to awkwardly walk up to them and ask if it was ready only to find it was ready for a while and I didn't even know it. \n\nThe best friend had the veggie taco and it was also tasty. The salsa is fresh and provides a powerful punch, the queso fresco they use is great quality. I would say it's just a fun summer spot. You know what else? The place has character and puts you in the best mood, that's something you can't beat.", "author": "Suzy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-05", "description": "So I came here with one of my friends in celebration of cinco de mayo...(wooo) to snag a drink...the atmosphere of the place was crazy def a chill spot spot to grab a cheap drink and from the look of it a good bite to eat...\nI guess my rating of this place is so good...because the employees of the place..were really courteous..and actually gave me a 1st timers NOW YOU KNOW FACT about which line 2 stand on...The wait was a little longgggg...But the place was packed for a sunday night...it was def a great way to start off a chill cinco de mayo celebration.", "author": "Timothy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "food is quick and delicious every time, drinks are amazing, and i simply adore the outdoor space.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Nice spot to check out on a nice day. I go there for the strong and tasty mojitos and the corn. The crowd seems to be evolving every time I go, which I guess is a good thing because it's pretty diverse.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Move over, I'm jumping onto this bandwagon.\n\nI liked Habana Outpost so much, I came here twice in one day. First round, I had a chicken burrito. The chicken was grilled, and the selection of veggies made it taste deliciously fresh and different than your average burrito. I couldnt help but notice all the frozen mojitos being sipped around me while I was eating, therefore I had to come back later in the evening to test it out.\n\nVery tasty frozen drink, the strawberry margerita is also good, and it's strength is no joke. I also had to get myself a corn, yum!\n\nThe outside seating is also nice, and has a communal feel to it, like you may just wind up chatting to someone else.", "author": "Claire S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Skip the food and instead spend a summer day relaxing with a Morita. No, it's not a small and twinkly eyed Japanese man (though that would be fun too). It's a mix of a frozen mojito and a frozen margarita. And it's 100% delightful.", "author": "Briana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-29", "description": "Gets very crowded even on weekdays. Fun decor w/ a lot of outdoor seating but the sheer number of patrons they get everyday underwhelm the space. There are security guys in black shirts who patrol the bar and they're quick to chastise anyone for bringing in outside food (the guy behind us in line got that honor of being singled out). \n\nThe food was okay- the grilled corn, in reality, you can make yourself but why bother for $2.95 a pop? My friend and I shared the grilled steak platter as they don't serve the cubano (pork goodness!) on a plato. The drinks are also nothing to write home about but it's the combination of outdoor drinking area + eco friendly building that makes Outpost worth a visit.\n\nFor those who have tried in vain to catch the Coolhaus ice cream truck: they serve those sandwiches here. You're welcome!", "author": "Ro C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Great drinks, great food...get the grilled corn if you head out there. The indoor space is nicely decorated towards the back and the outdoor area is great in the summer time to enjoy the warm weather.", "author": "Jelissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "This is by far the MIXIEST place to eat in Brooklyn! You'll also meet a lot of people who aren't from Brooklyn in here. They feel as if because they hang out at Habana that they're also in Brooklyn... Yeah.. so anyway... Everyone you don't want to see hangs out here. When it's crowded, it's annoying. Not the staff, but the people. When it isn't crowded, it is such an awesome place to be. Friendly and awesome staff. The food is really good. The drinks are cool also. It's such a nice place to just stop by matter-of-factly to just get your 'chill' on. Parking can be hectic. I always sit outdoors when I go. But i'd recommend it if you dislike annoying crowds like myself. But if you're looking for a place where the mixiest people in NY hang out, I'd also recommend it. LOL", "author": "Troy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "There is one reason and one reason only to make the trek out to Fort Greene for this place: it is CHEAP!!\n\n- $2.75 will buy you a 12 oz. beer, and by beer I mean local, brewed in Brooklyn and not in some random Miller or Budweiser factory in god knows where USA. \n\n- $12.50 will buy you 5 authentic chicken tacos, which is how many we consumed that night along with our $2.75 Brooklyn Brewery ales.\n\n- less than $20 worth of food and beer will earn you a spot either inside or out in their \"garden\" place, which pretty much looks like a backyard decorated for a quinceanera celebration complete with out of control children and drunkenly loud conversation\n\nFinally, Habana Outpost will always hold a special place in my heart because this is where my fiancee and I learned that our state flipped the bird to the bigots and religious zealots, and decided to allow us to be legally married in the place we call home. Now that is awesome. :)", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "I love habana it has an awesome atmosphere great drinks and authentic Mexican food. I highly recommend going here on a cool summer or spring night with a group of friends or it would be a cute spot for a date.", "author": "Taylor B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "Best grilled corn and cojita cheese I have EVER had.  I also took a chance on the Roscoe on a Stick .  Who would have thought a fried chicken finger wrapped in a pancake on a stick dipped in syrup would be that good....and so healthy too.  Just kidding, but who cares.  It was awesome.  My friend got a Cuban Sandwich that was unbelievable.  With a beer and a margarita, it came to about $20.  Their Margs could use a little more flavor, though.  It sort of tasted like plain ice.  You can't beat the ambiance and the courtesy of the staff.  They are also very observant of the environment with all their eco-friendly trashcans and restrooms.  You should check them out, but they are only open certain times a year.  So hurry!", "author": "Evan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-09", "description": "The margaritas are very good. The place is small. It's better to go on warm or cool days because of the out door seating area. The food is decent it's almost a little Mexican stand in the out door area. It gets very crowded and noisy at times. Staff members are friendly. They only take cash no cards.", "author": "Kam w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "After being in the house for almost a 2 months straight my hubby thought it was time to get out the house before cabin fever set in. I did not want to go too far from my house since it was the first time leaving my newborn home and I wanted something fast and casual. My hubby was in charge of finding somewhere (Trust me I was scared to death!) He brought me here and I've been finding any excuse to come back. \n\nThe steak quesadillas are good which they rarely have on their menu. Their tacos are awesome. I always say I'm going to try the corn and never do. When I do I will def update this review. Now on to the drinks. They are as strong as you want them to be whether with an extra shot of vodka or nice sangria, it hits the spot. The margaritas and extra available flavors are also good. \n\nThe atmosphere is def eco-friendly and they have some activities for the kids during the summer sometimes! (def a plus) I really enjoy coming here I just wished they were open year round. (Which is the reason for the 4 and not 5 stars)", "author": "Medjinne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-09", "description": "What a perfect way to end the night! Habana Outpost could possibly be my new best friend. Not only it conveys a fun, lax and colorful (compliment definitely intended) environment, but the food is fantastic and the frozen mojitos were hijacked from Zeus personal kitchen on Mount Olympus; this could well be the BEST frozen mojito I've ever tried, so it must, must belong to the gods! \n\nEven though the place was packed we still found sitting outside, and right in front of the big wall; as it turns out, they have movie screenings via projector of several and even quirky oldies (next week is Star Wars btw), I ordered the special platter which had grilled shrimp, black pinto beans, rice and avocado and it was absolutely delicious! Michelle had a veggie burger that I forgot to try, but will next time. (They are also famous for the grilled corn, although I didn't try it)\n\nAnother AMAZING plus is the fact that this outpost is apparently totally eco friendly; they have solar panels surmounted on one of the tents, the garbage disposal section is geared for recycling and it even has a huge drawing to indicate how you must dispose of your garbage (in a totally non-cumbersome way), the tables are made with recycled soda cans, and last but not least, there is a smoothie stand outside, which is powered by....a bicycle!!! How could you not love Habana Outpost?? People are also very friendly, and a nice couple sat on our table, talked to us and even exchanged numbers??!! \n\nDefinitely a place that makes me wish for an extended summer; once the cold sets in, the outside party is gone, so come and try it while we still have two weeks or so of nice weather. You'll thank me in Spanish!", "author": "Javier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "How can you not love this place?  Go with people you really like, make it a crowd, and you'll be giving Habana Outpost five stars, just like me.\n\nThis place reminds me of why I love Brooklyn.  It's kind of like San Francisco meets Oakland, depending on the neighborhood.  Lots of folks of color, plenty to do, laid back, and it's got that neighborhood feel to it.\n\nWhat we did at Habana Outpost was we just ate grilled corn (the kind that's topped with sour cream and cheese and lemon juice) and threw back some frozen mojitos.  Summer weather, great crowd, lots of eye candy, families and doggies and friends gathered around.  Habana brings it together.", "author": "Diana Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-20", "description": "I adore Habana Outpost and am so glad that it is in Ft. Greene and EXPANDING!\n\nWhat more can you ask for on a lovely spring/summer/fall day?\n*great drinks\n*yummy snacks and such\n*cool and diverse crowd\n*ample space either covered or out in the open\n\nIf you are a fan of dining outdoors as I am, you should def check this place out. It is not award winning food or cocktails, but they get the job done in a fun and laid back manner. \n\nPLEASE don't leave without a frozen margarita!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "I'm a fan of the junkyard-lot-converted-into-outdoor-seating. The decor is pretty cute. The (two or three) draft beers they serve are $2.75 a (smallish) cup. However, the selection is pretty limited and the consensus is that the food is just all right. \n\nBut beer for under $3 and outdoor space to hang out on a summer night? That's A-OK in my book.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-28", "description": "Meh... I don't understand the hype. Maybe if you're not an avid fan of Latino foods then this might be the place for you. If you are, you've had better. I think it's gotten so many good reviews because of it's location, \nthe rarity of a large sit down outside eating area, and it's eco-friendly.\nFirst off, there should be someone to explain how getting your food works or at the VERY least tells you to read the \"fine print\" on your receipt lol. A friend and I sat down to talk and then realized that we had to go OUTSIDE to get our food. A second after we got to the backyard, the man in the truck was calling out names. For something that was \"just made\", my beans were a little dry. The margarita/mojito mix was good, I just wished there was more for the price. It's an okay place, it's just I've had better. I'd rather order nachos or steak and rice from nearby Yummy Taco. ::Kanye shrug::", "author": "Melinda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Great atmosphere, reliably good Mexican corn, solid tacos and cold local beer make this a go-to spot whenever you're in the area. Don't change a thing!", "author": "Bruno N."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}