{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "What a delight! Beautiful outdoor seating, tasty tacos (I had the pork and chicken). But the real treat is the grilled corn!!!! So yummy! Spicy yet creamy with butter and cheese sprinkled on  the top and bottom. The price is right for the food but the frozen margs could have been cheaper (9 bucks!). \n \nBe sure to bring cash! ATM charges a couple bucks. \n\nOverall I enjoyed it and will be back!", "author": "Pamela W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "This place is really cool! Authentic Cuban - no way. But the food is great and atmosphere very hip and comfortable. Also child friendly, which was a plus since we went with our 2 kids. Only frozen drinks they had when we went were frozen margaritas. Not what we would have ordered otherwise, but they were very good. Popular place around 6pm on a Wednesday, so I can imagine it gets packed during prime hours. But I think it's worth it. The shrimp taco plato is everything!", "author": "Gina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "Great summer spot!! \nMy experience: This place is so cool and laid back, the people, the ambiance, the drinks but most importantly the FOOD. Those who know me are well aware I don't drink however at habana I managed to have a frozen piña colada and actually finish it!!! Not to mention how buzZ I was after that. \nMy partner enjoyed a frozen Mojito as well which was super refreshing. \n\nFood: fresh Chips and homemade salsa are a great finger food to munch on while having drinks or just simply hanging out. \n\nPro: Music was a great source of entertainment live DJ in the outdoor area. \n\nCon: Outdoor area did not have enough shade which limited the seating :(.", "author": "Rosie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Super fun afternoon at Habana outpost today. I was with three friends, and even though the place was hopping we managed to snag a spot in the shade. They have a large terrace with lots of tables, and there are also a fair number of chairs inside. We ordered the chicken quesadillas (delicious and super filling even without the combo), chips and guacamole (also excellent) and frozen mojitos that were light and super refreshing. You totally get what you pay for, if not more. I loved the vibe, you can sit for as long as you want without feeling pressured to leave; perfect for a chill summer day. It's a bit out of the way for me, coming from manhattan, but I Found the neighborhood very vibrant and charming. Can't wait to explore it, and I would absolutely stop by here again.", "author": "Jasmine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "Great meet up for friends. The drinks are aahmaze-balls *Shoshanna voice*  \nSwipper no swipping at this place, so make sure you've got cash. \nThe corn is worth a try if you're into that\nThe 5 stars is only for in the week because on the weekends fuggedaboutit, its packed", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "The decoration is awesome! I love the feel of this place.\n\nMy friend took me here since we are both obsessed with tacos.\n\nI got like 3 tacos, a corn on the cob, and a soda and it came out to less than $20 \n\nI highly recommend this place and will visit soon!", "author": "Laura E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "Love the ambiance of this place. I had the Mexican corn and a mojito and enjoyed it very much. Will probably come again for drinks during happy hour", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Yum. I've ate in the city location a couple of times. I was working around the area,so i yelped # and called,I ordered the fish sandwich,the person on phone was a nice female and professional,I ordered with ease and she told me 8 mins,and she was right. Thank you BLUEISH GREEN HEAD GIRL lol for the good sandwich and fast service.", "author": "Joey A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "dried and skinny burger, syrupy mojito from a frost machine ain't my style, especially for 21 bucks.\n\nonly good thing were the friendly gals/ cashiers", "author": "Rrrona 7."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "This is a summer spot especially if you love a frozen margarita. Although my drinking days are over, I still come by for the food and ambiance. It's real food truck style, and seating is almost like looking for a spot to sit in a school cafeteria or a food court. This isn't a place for intimacy, but a perfect first date spot, or just a spontaneous destination.", "author": "Ivy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "This is the worst Cuban/Mexican restaurant I've encountered. Their menu mainly has Mexican dishes and only one Cuban dish. The decor is colorful and interesting, but I didn't appreciate that they had a big painting of the virgin Mary on the wall holding corns. I didn't appreciate the lack of customer service by the cashier girl and waiter. They did not greet me when I entered and continued with their full blown conversation until I interrupted and asked questions. It was obvious the two workers were two young college kids who had no manners and we're more interested in social media than taking care of their customers. Food was not great and will never come back here again.", "author": "Marivel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Came here in the summer of '13. There was so much buzz about the place I had to check it out. It was a Friday night and it was a bit crowded. Since the line to get food was so long my aunt and I just hopped on the separate line to get the famous corn with what I believe was cheese and chilli powder. (The corn was pretty good except that it didn't seem like it was freshly made, seems as if they made it earlier and just reheated it a little). Other than that it was bad. We also grabbed some drinks which weren't bad. \n\nAs far as seating, it's a a bit spacious but I guess in specific nights it's like over capacity so you'd be sharing tables with some stranger or stand and eat. \n\nI like this place. A nice chill spot. I would recommend if you're in Brooklyn.", "author": "Keiarra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "I LOVE HABANA OUTPOST\n\nEverything is so delicious. The cuban sandwich, of course! Throw in a couple of Mexican corns and some frozen margaritas! You can skip everything else.\n\nRemember, CASH ONLY!", "author": "Mich L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Great service. Great food. Great ambience. What more can you want from a place? I ordered the fish tacos and shrimp tacos which were delicious. Drinks, like margaritas are from a machine but they are cold and alright. I would check out the menu. There is a variety for all appetites. \nThe bathrooms and the outside patio make you feel like you are in little habana in New York. \nWill definitely come back!! Check it out. CASH ONLY.", "author": "Yessenia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Very hipstery spot. Outdoor seating, cool art/design inside, they project movies on the white wall from time to time, lively vibe. \n\nThe problem is that like most mexican food places, my tummy wasn't feeling so good after eating here. Also, since I get cold super easily it needs to be a really warm day otherwise your food gets cold fast and cold mexican food doesn't taste so great.\n\nAlso, since it's so popular you might end up waiting kind of long for a table and to get your food.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "When I arrived in front of the place, I thought the outside was super cute with the bright colors and the outdoor seating. Then I walked in and I was amazed at how much MORE cuter it is. This place is gorgeous.\n\nI wanted to try so much on the menu that I ended up ordering $16 of food for lunch. I ordered the grilled skirt steak on a plato, the chicken waffle sticks, and the corn with cotija cheese, chili powder, and lime. Steak was very juicy and the rice that came with the plato was delicious. The chicken waffle sticks are a great snack. One order somes with 2 sticks of chicken wrapped around with a lightly sweetened waffle batter. The corn was actually too spicy for me to handle, but irregardless, it was good.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Love this place!! the food the vibes, it's a great place to go now that the weather is getting warmer. They have outdoor seating and the decor is bright and colorful. I've never had a Cubano sandwich quite like this one, the chipotle mayo just gives it an extra kick. The drinks are pretty decent as well. If you're looking for a casual night out with friends, good food, decent prices then this is the place for you.", "author": "Aury O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "Pretty nice place clean and immediately someone took my order when I walked in. Frozen margaritas are $9. I got 2 chicken tacos they were okay when you added hot sauce. I asked for sour cream and apparently it's a $1 extra. I thought that was quite ridiculous. What's a taco without sour cream? The corn was the best part.", "author": "Amanda Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "So its a nice outdoor drinking place if the weather is good. Marg's are decent, but out of a daquri machine (nothing special, Especially for $9 a piece).  There is this awkward line when you walk in the door to order your food or drinks. the cashiers are really really slow (or there just arent enough), so the line is way too long. The food was pretty decent but again nothing to write home about. The prices are fair but by no means a bargain. The real draw to this place is the outdoor patio. Its just nice to sit outside on a sunny day for drinks. \nCASH ONLY! so come prepared. Overall if its just to hang with some friends on a nice day outside I would recommend. If you are really going for good mexican food or marguritas check out Fonda in Park slope (during their happy hour great prices otherwise really expensive).", "author": "William P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Haven't tried the food, but this is a good place to sit outside and grab a drink with friends on a nice day. They have counter service with a couple taps of craft beers (e.g., Sixpoint) and some frozen margarita machines that fit the outdoor Latin beer garden vibe. \n\nIt can get crowded when the weather's nice, so be prepared to stand around for a few minutes and swoop in on spots at the long communal picnic tables as soon as they free up.", "author": "Jonathan C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}