{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Habana Outpost is this tiny corner of urban oasis, with delicious, affordable eats, booze, outdoor seating, giant umbrellas, and music. It is an obvious choice for summer evenings and is popular with stroller mom dates during the day. They are seasonal, so in the colder months, go across the street to Habana to Go (https://www.yelp.com/biz/habana-to-go-brooklyn?osq=Restaurants) which is the same food and people, but with seats only for 12.\n\nOrder inside, food comes out of the truck in the back patio. You can also sit inside, but where's the fun in that?\n\nI am a fan of the tortas more than anything else. The cuban sandwich is the crowd pleaser. I love the eggs and chorizo torta and make them add avocado. The elote mexican corn is also a crowd favorite. I've also gotten the steak burrito and its solid. The frozen margarita is super popular here.\n\nService is okay. It takes a while to have your food made and the system to call you could be better.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "All is good with this place if you ask me. I visited twice before but held out for a 3rd time before reviewing. \n\nGot to Outpost about 6:30 on  weeknight and well it's finally summer in NYC. It was the week leading up to the 4th so people I assume a lot of people had off. The place was full but not overflowing and the crowding moved so you could still find a seat. \n\nWe ordered immediately. We both had shrimp tacos and corn. I had a frozen mojito. The mojito totally got to me because I gulped it down before the tacos came. \n\n\nEverything was way delicious. I couldn't make my way through 1  much less two because the cor is also filling. \n\nAmbience and vibes are def on ten. Quality and freshness if the food, def 10. Crowd can be a bit loud so it's possible you're eithe screaming with them or just not hearing your company. Def not ideal for a 1st date but I'd say stop by on the 4th. \n\nI will be back several times before summer is over.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I really enjoy they drinks. Just 1 of they margaritas and you would be litt!! I only ate here once and had the corn it was delicious. But I mostly come for they drinks then leave. Don't really stay long. Nice chill spot", "author": "Kisha V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "CASH ONLY !\n\nWith that said... \nHoly... this place is absolutely gorgeous. A++ for aesthetics!! As many of you know, NYC doesn't have many outdoor eateries so this is definitely a MUST GO-TO. I can't believe how much this area has changed over the past few years.\nThe interior is very spacious and has a very Cubano vibe. There's a backyard area with a food truck and eating area (picnic tables and umbrellas for shade..winning!). I love the concept of the restaurant, almost everything promotes an eco-friendly environment. \nI asked for a chicken plato and frozen margarita but i'm not sure how..... I got a chicken taco (??). I should've known she messed up the order though because I was only charged $13.50. \nFrozen Margarita- $10\nTacos- $3 each\n\nThe margarita... sttttttrrrrrong (not too strong but omg, it does the job)!\nThe tacos were tasty however I felt as though the chicken was a bit dry and so was the tortilla. . I will be returning to try the Plato I actually wanted!  \n\nAlmost everyone around me was eating the corn on the cob so I will be trying that next time!\n\nOverall, fairly priced for the area... ProTip:\n1) Order your food/drink at the counter inside\n2) Grab a table outside\n3) Get your food from the truck (when your number is shown inside)\n3) Sit and enjoy the very limited warm weather we have here in NYC!\n\nP.S: They have movie night every Sunday in the backyard area and they also offer events for kids (arts and crafts,etc). Also, the bathroom is just sooo cuteeeeee..... seee for yourself plz!", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "WOW to the CORN!!! is it corn season? because the corn was nice and meaty and super sweet. I ordered the Cuban sandwich that was good as well, just needed some green sauce but we ordered take out/didn't know that it didn't come with. \nMy friend order the chicken rice bowl. Not worth it, super small and not filling. Anyways will definitely come back for the corn or Cuban if I'm in the neighborhood.", "author": "Patricia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "I usually come here for the Cuban sandwich which is to die for. This time I came for a quick snack. I got the sweet plantains and the fish tacos which claim to be a customer favorite. I was disappointed with the fish taco. I thought it tasted pretty bland and dry. It needed some sort of creamy sauce. I wouldn't recommend getting the plantains alone unless you really love how they taste because they're also kinda dry on their own, but still pretty tasty! Now I know to just stick with what they do best- Cubans!", "author": "Susan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "I've been hearing about this place for years but always opted to go to Benny's burritos or blockheads. I finally went and I have to say I was severely underwhelmed. The set up is weird, the drinks are mediocre and expensive and it literally took 30 minutes to order 1 round of drinks. There was only one person behind the counter. I'm surprised they've been open this long. If you want good drinks and service skip this place and go to el jeffe", "author": "Raye S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Unique outdoor area seating area with a walk up counter for drinks and food. Didn't get drinks when i was there but the street corn Cuban sandwiches and burritos all looked good. The frozen mojitos was a little sweet for me but was still a good option on a hot night. Not the easiest to get seating for a large group as it's seat yourself and crowded but I'd rather that than empty.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Good vibes here. Bright colors and fun decor big outdoor space. Cash only. Great for a tasty casual bite to eat!\n\nQuesadillas are great. Burritos, tacos great as well. Highly recommend their corn, covered with white cheese .... super tasty one of my favorite things on the menu. Big outdoor space with picnic tables great for a casual bite but indoor seating as well. You order inside and go outside where the kitchen is in a shipping container and pick up your order. \n\nSolar panels on the roof and recycled water in the bathroom, sustainability vibes here. They screen movies outdoors on Sundays.\n\nIf your going to get a drink go with a beer or one of the frozen drinks. The vodka lemonade wasn't that great.", "author": "Carina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Habana Outpost is a Brooklyn staple that was a go to place for me a few years back but I've slowed down on going as more people became fans and it became impossible to find seats in the summer. LOVE the outdoor, bench seating for summer time food and drinks with friends. It's a small space and can become very packed but when you do find a seat, it's worth the wait. I love the Mexican corn and the chicken burrito, those are easily my 2 go-to items. The drinks are ok, not as strong as I prefer but you can't have Mexican without a margarita. \n\nThey now have opened a takeout spot across the street which I tried out 2 days ago. I ordered my usual chicken burrito which has rice and beans, peppers, and lettuce and tomatoes inside. I do wish it came with some type of sauce to make it less dry. I asked for sour cream for it and was told that they would have to charge me $1.25 for it. What?! My boyfriend had a shrimp, chicken and fish taco. I loved the shrimp taco which had a chipotle mayo on it. I recommend visiting Habana at least once in the summer to eat outside and enjoy the ambience. But then, stick to takeout so you can still enjoy the food without the crowd.", "author": "Robin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "One of my favorite outdoor spots when it's nice in Brooklyn... diverse group of people and you can't go wrong with a mint mojito margarita", "author": "Eman H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "The food here was pretty good. The grilled corn was really tasty and so was the chicken quesadilla. I think this would make a great summer hangout but i would not order take out here . I don't think it would taste the same once cold or rewarmed.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Hidden Gem in Brooklyn... Very convenient for travelers taking to subway. Located right across the street from the Fulton subway platform. This place is very small so if you come during the rush you may not get a place to sit as they have literally 1 table and very small counter space. We lucked up to sit at the one table they had which only fits four people. I ordered the ground beef empanada and the steak quesadilla. The empanada was fresh and wrapped in a flaky dough and fried to perfection. The quesadilla is drizzled with sour cream and some type of green sauce which complimented the cheese and steak. They don't have a bar but they do offer adult daiquiris. I had a Mandarin bottled soda with my meal. I enjoyed the close atmosphere in this tiny dive. \nPS if you're a fan of Biggie Smalls check out the mural painted on the outside if the building", "author": "Gina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "The move is to come here when it's warm - but maybe not too nice, so you'll have a chance at getting a seat - and grabbing a beer or a margherita and some elotes - the sweet corn and spicy, cheesy mayo combination is always tough to resist.  That said, the food isn't the draw here, you come here when you want a boozy, corny oasis.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "If you happen to stumble upon this gem, alot of their menu items are tasty. Especially the Cuban sandwich I wish I took a picture of. But it's one of the best you can get in NY. Drinks are cheap and strong as well. Great bang for your buck. The corn, everything about it is good but if you're anywhere near Sunset Park (5th Ave) find one of those carts for the REAL Elote. Otherwise, this is a pretty good alternative. BRING CASH.", "author": "Sergio P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Atmosphere: fun, loud and sometimes they have a DJ playing \n\nFood: the food is pretty good. \n\nPrice: CASH ONLY but pretty inexpensive", "author": "Zach A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Cant go wrong with anything on their menu. Reasonably priced and plenty of options. There is usually a good wait to order but once you do the food is out fairly quick. \n\nSeating is mainly outside. There are a few seats inside but part of their fan fair is getting your food and drink and hanging outside....", "author": "Keniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Its very cute. Very chill spot. You dont get a huge amount of food(tasty tho)  and they only take cash. The kids corner is literally a corner by the way.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Stopped for a quick lunch with my bestie and it was amazing.  Had a HUGE mole Cuban sandwich and sweet plantains. Amazing! Such a sweet staff and chill vibe. Hibiscus tea was great and super refreshing. Loved the food. I will return.", "author": "Natasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Love this place.. the wait for the food is extremely LONG but when you do get your food it makes you remember why its worth the wait lol ... it's a nice little spot to hang out with friends and have lunch or even for a date ... I came here one hot Saturday for lunch with my sister and my boyfriend and we enjoyed ourselves (as we always do when we come here) .. YOU MUST TRY THE CORN its AMAZING!!!", "author": "Kay K."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}