{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "Finally made it here after years of not being able to due to the crowds. Going on a rainy Saturday certainly frees the place up!\n\nThe basics:\n- Outdoor seating\n- Cash only (though there is a sketch ATM inside)\n- Pay when you order\n- There is no table service, you grab your delishussness from a food truck in the backyard (no, for real)\n- CORN IS A MUST but you might want to tell the cook to go easy on the queasy (aka go light on the mayo)\n\nSpiked lemonade isn't spikey enough and I wish my Cuban sandwich was warmer but it was definitely tasty.\n\nVaya con dios!", "author": "Vit C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "The things I would do for Habana grilled corn... \n\nConveniently located next to the Lafayette Ave C stop and steps from Atlantic Terminal, Habana is the perfect place to spend a shaded afternoon drinking too many frozen margaritas! This place is ALWAYS crowded- went there recently at 1 PM on a Monday and could barely find a table! The eating space is mainly the outdoor patio and a few tables inside. While anything on their menu is delicious, my go-to order is 2 orders of corn (I will share with no one), 4 fish tacos, the pineapple mint lemonade (spiked or not) and a frozen margarita. \n\nBesides the delicious foods, they also have cute car-ride things for kids and movies on the weekends! They also deliver AND have a year-round facility across the street.\n\nYour summer forecast: Habana Outpost, every day.", "author": "Carol S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "I love this place so much!\nThe place is closed for winter, but right across the street there is a smaller join from the same owners, I think. \nIt's a great addition to a great neighborhood. \nTacos are very tasty and I can kill for that street corn! Frozen margaritas are nice, but I don't really like it. I believe during summertime they show movies.", "author": "Eva N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "This spot is the best of Brooklyn. \n\nIt's both a great time and one of the most environmentally conscious restaurants I've ever been. They use solar panels to power the place and sell the excess electricity back to ConEdison to be used somewhere else! WHAT? Their Green Facts sheet on the website is definitely worth a skim. \n\nBesides all that great Green stuff, the beers are cheap, they've got margaritas and pina coladas ready to go for ya, and the food is wallet friendly, too. I had a couple of delcious nut brown ales and a pork taco. The taco came with a tasty smoky salsa. \n\nThe Outpost's vibe is super fun in the summer - so much color, music, and a really diverse customer base. It's extremely family friendly. There's a ton of outdoor seating. \n\nThis spot is pleasing for your eyes, taste buds, and conscience! Seriously, can't wait to come back and try some other things on the menu!", "author": "Priti K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Great spot in Fort Greene. Best to go when the weather is nice, but watch out for crowds and lines. You have to order your food and drinks in a line, and you have to claim a seat for your company. Best to do some sort of team effort where one person claims the seats and the other orders the food. Came here with colleagues the other night and I was the seat claimant. As it being Fort Greene the crowd has that nice Brooklyn diversity. IS IT EVEN OPEN IN THE WINTER? I don't know, but maybe the manager here will write some sort of obligatory reply even though the question was rhetorical.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "This place  has a very chill vibe however I think that everything is overpriced $9 for a frozen margarita?!  And nearly $5 for grilled corn and cheese.", "author": "Romi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "The outdoor space is clearly the main attraction of Habana Outpost for the warmer months. Its great to be able to enjoy a frozen cocktail in the sun in lovely Fort Greene. \n\nBut... $9 for a small weak frozen margarita? Really? I figure its worth it if you're just stopping by to have a drink after work while sitting outdoors. The main issue I have with this place is the brutally slow service. Last time I was here was a Tuesday evening, place was barely full and they had multiple people working behind the counter, and yet there was a long line that never moved. It took 20 minutes to get a drink!\n\nThey need to get their customer service in order, but since this place is so popular anyway I guess they have little motivation to do so.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "It wasn't what I expected based on the reviews\n\nSo I'm thinking I'm going to a Cuban spot and I'm going to be eating a meal with awesome seasoning and taste but not really. \n\nYour order # is located on the top of the receipt and shown on a screen so you can grab it. This information probably should have been communicated to the customer by the cashier. I had to ask how do I know if my food is ready. \n\nI wanted to sit outside but it was way to crowded and they definitely need my umbrellas to give shade. Instead I sat inside where there is limited seating and prepare to have people form a line from the bathroom to where your sitting and them looking at you or others while eating. The tables are so small that 3 people took up at least 3 small tables for 2 trays and out stuff (i.e phone, hot sauce, drink, arm room etc)\n\nI ordered the following  \n\n\nSteak burrito - to me was smaller than this pics I saw and it was dry. No guacamole  on the side nor sour cream. I used hot sauce to improve the taste because to me it was bland. \n\nRoscoe on a Stick - I don't know I expected the chicken inside to be more flavorful and the actual outside to taste like French toast. Instead in tasted like chicken tender wrapped in corn meal or something of that nature. It was ok nothing to die for. \n\n\nCorn- with cheese and cayenne pepper also wasn't flavorful to me it was ok. The corn was t soft and had a crunch to it. But all that on top of it wasn't tasty . \n\nFrozen Mango Margarita - was great. \n\nSoda: so they had vintage sodas that go great with the concept. But I still think some new age soda and even lemonade or some other type of juice should be offered for those who want options. To me the soda was nasty and that alone with stop me from visiting a second time. Bc you need to have a good drink with your meal.\n\n\nOverall - it was ok I definitely expected better. I probably won't be going a second time.", "author": "Lashanna R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Nice spot for drinks and nibbles--our order included grilled chicken with rice \u0026 beans, Cuban sandwich and waffles.  I tried the frozen margarita just because it looked so refreshing. It was raining the afternoon we visited so the place was virtually empty with a few diners taking refuge inside waiting for the rain to subside.  My partner enjoyed the Cuban sandwich and said it was the best he had tried outside of Miami the pork was tender and juicy and the ham was a decent size slab.  My plate of chicken, rice and beans was also tasty the chicken was well seasoned and the portion size was just right for the price.  Waffles were fresh perfect for absorbing some the alcohol effects of the margarita-it was strong and soooo good.  We will be back.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "Over priced and not so great. Two shrimp tacos for $16.75 and an extra $1 for sour cream. Shrimp was either over cooked and did not taste fresh at all. Could have been frozen shrimp. Definitely not worth the price.  Cash only and pick up your own food.", "author": "E G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "In the summertime, they play outdoor movies on Sunday nights, but get there early because it gets packed. The people that work here are super nice and friendly \u0026 will do the best they can to help you find a seat.\n\nDecent food (must try the corn, of course), but I'd primarily go there for the movie nights + $4 beers. \n\nAs mentioned by many people, this place is cash only.", "author": "Carol H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "My inclination to dine al fresco becomes more and more urgent as the weather improves, and since NYC winters now constitute half the year, our recent thaw put the idea back in my head. What more could one want than to sit in Habana Outpost's colorful side yard with a pint of some good beer and delicious, down-home Cuban food to go with? \n\nMy friend had been telling me about Habana Outpost for some time, but we never managed to get here until recently. When I perused the menu beforehand (as I am so wont to do), I was most intrigued by the grilled corn (aka elote) which indeed turned out to be a treat. Simple but satisfying, a grilled cob of corn, coated with a spicy, salty cheese mixture and a little lime to jazz it up (wow!). Along with that, I had the pork plate which was amazing. I remarked to my friend that the tender roast pork had the homemade quality I remember from my grandmother's cooking. \n\nAll told, this is a great spot for a relaxed bite, or even just to hang out with a drink. Of course it has a major hipster vibe which includes the food truck-like kitchen from which all the food is served, not to mention the actual hipster population hanging out here, but the location is super convenient (especially to Atlantic Terminal and Barclays) and the prices are a relative bargain. When the mood strikes, this will definitely do for an outdoor dining spot!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Yummy great Cubano and corn! Service was fast. Cute little joint with small counter for sitting. Cash only.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "This is the kind of place I absolutely love! Super relaxed. Great food. The people that work here are really nice. There is an awesome terrace and comfy seating inside. I recommend the fish tacos and black cherry soda (Boylan). \nIf you looking to have an afternoon frozen margarita and hang out with your friends? This is the place!\nFor all you soccer fans they have a projector. It's not great quality but this place is so cool who cares!", "author": "Jeremy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Bring cash NO CREDIT CARDS TAKEN! \nAmbiance was fun. Staff were great! \nThe fried plantains were no Bueno -- better luck elsewhere (there's an art to making those just right). \nThe Cuban sandwich was kinda sad too -- lacked some kick and it had way too much meat so wasn't appetizing to look at. \nTheir shrimp platter was divine though! \nTheir grilled corn was good but I've had better (instead of butter maybe a lil mayo--seriously try it). \nOh and their waffle desert --- MMMmmmmm!\nCome on a Friday/Saturday and sit outside (where you want to be)! Also, don't forget the iconic Biggie mural just across the street. \n\"If you didn't know, now you know!\"", "author": "Daisy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "I came here for a friend's birthday and it was the hottest day by far. Despite the scorching heat and smelly, sweaty crowd, my experience was great. The drinks are a little more expensive than I expected, but great nonetheless. I'll have to try their food sometime!", "author": "Florann E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Come for snacks, drinks, and a nice outdoor space to relax comfortably with friends. The menu is simple- tacos, quesadillas, salsa, and guacamole. People rave about the corn, though I didn't have any. The salsa is fresh and packed with onions, which I love, but needed some heat in my opinion. I was disappointed in the lack of alcohol-free drinks other than Boylan sodas. However, the picnic-patio set up made up for this. It's perfect to catch up with friends on a nice day. And in good-old hipster fashion, the garbage is easily sorted for glass, plastic, and compost, not that makes up for the fact that everything is served on disposable plates/cups.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Food was good. Could've used a little more seasoning, but I enjoyed it. The frozen drinks are yummy. And the space is nicely decorated. I love the loud colors. Staff was friendly and helpful with us as first time customers. I would love to return in the spring/summer season.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "I managed to check out Habana Outpost on one of the last warm days of our waning summer season. FTW! Such a great spot with a bright, latin-inspired ambience with pretty lip-smackingly good food. The only thing I take objection with is that its labeled as a \"Cuban\" resto. There was one Cuban dish on here (The Cuban sandwich) but apart from that I felt like it was lacking on its Cubano flavor.\n\nGreat outdoor seating with colorful tents, white tiled floors and a large fountain that at the entrance of the backyard seating. It is like a very huge, artistic Mexican cafeteria. The reason I say that is because when you first walk into the resto, you place your order at the front with the cashier. She hands you a number and you find your seat. When your number flashes on the electronic screens, you go to backyard (or the front of the backyard if you're already there) and get your food on these large vibrantly colored trays. \n\nIn terms of food, mmmhmmm good. I ordered the steak burrito with maduros (plantains). My friend ordered the Quesadilla and we both loved what we ordered. The prices were fairly decent ($9 each for the burrito and quesadilla). Also, if you're in the grab-and-go kinda mood, there's a Habana Outpost right across the street that handles pick-up orders.", "author": "Pallavi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "I have been to Cafe Habana in Soho, and their menu is so big compared to Habana Outpost. Meaning, Habana Outpost sticks to the favorites and doesn't leave any chance for disappointment. Which is exactly what they delivered.\n\nIt's located right off the C train, which is a little out of the ways for a girl from Queens (me), but not terrible since there are other trains close by. There is a huge space for outdoor seating. Though crowded on a Saturday night, finding seating for two wasn't a difficult task. There was staff cleaning up tables and keeping the flow going, which was great. \n\nThere are two lines when you walk in, but you may only see one. The first line is for food AND drinks. The second (sometimes non-existent) line is for drinks and corn only. The line wasn't too bad when I first went in around 8:30, but was almost out the door by 9:30. The lady who took my order was very nice (I can't even imagine how burnt out she must be having to smile, be nice and patient to every single person, though. Great job!). She told us that we take the receipt, and either wait for our number to be called at the food truck outside (?!) or keep an eye on the many number counters for our number to come up so we can go pick it up.\n\nI ordered veggie tacos sans cheese, rice and beans plate, and sangria. The veggie tacos were simple but very good. I LOVED that they added guacamole to it because the veggies inside the corn tortilla.  THe rice and beans was pretty standard, but not bland (sometimes I get rice and beans and it has that boiled flavor, bleh). The sangria was on the sweet side with diced apple in it.\n\nMy boyfriend really liked his Cuban sandwich and the catfish tacos he ordered. He wasn't a fan of the corn because they put wayyyy too much cheese on it, but I hear that's how it's supposed to be. Shrug.\n\nI love the vibes to this place - music at a comfortable level that you could drown out everyone else if you wanted to, yet won't have to scream at the person in front of you to have a conversation. The vast outdoor seating was a huge plus for me. We'll be back!", "author": "Angela C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}