{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-15", "description": "I remember the frozen Mojitos as amazing, but now they taste really chemically and like they're made with a cheap mix. Not sure what's up, but not the gem I remember. Almost undrinkable.", "author": "Kate C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "Soooo many other places I'd recommend you to spend your money at, I'm really serious. How the hell do you mess up corn, I may never know but my elote was very nasty. It was as if the crisp grilled kernels were soggy and tasted soooo buttery. The cayenne pepper was giving me a zero on the spice meter. Most horrible Mexican joint I've been too. Would never come back even if it's to drink the margs were regular nothing to rave about. I must add I seen the bouncer/security guard checking all ID's for all young black patrons and just letting white folks in not asking for ID or anything. Then had the nerve to tell my friend's brother he couldn't get in because it was 25 and older after 830pm. What kind of shit is that?", "author": "Moe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "They have two separate lines to order food, one line for just corn and drinks and the other for the rest of the menu. Then you get a ticket and go get your food outside where there is a food truck. I went recently and sat outdoor when the weather was in the low 80's, so it was really nice to eat out doors. I had the Mexican corn, lemonade, and chicken burrito. I love corn and the Mexican corn taste even better than the ordinary corn. The lemonade was cool and refreshing. The chicken burrito was full of quality ingredients. But I have to say I prefer chipotle.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "Came here with classmates to celebrate the end of the summer semester last year. It was packed and we had a lot of trouble finding seating. Once seated, we waited more than 45 minutes in line to order and another 15 minutes to receive our food. We were, however, able to enjoy frozen margaritas while we waited. For dinner, we liked the grilled corn on a stick, the fish tacos, the Cuban sandwich, and the chicken burrito. I would've ordered a dozen more grilled corn orders if it weren't for the long wait!", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Seasoned to perfection.. the fish taco was very very flavorful and the tortilla soup was a little thin but rich with spices. They ran out of beer and not enough seating. But would highly recommend and definitely go back.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "I really love this place. I've had their tacos, their burritos, their corn, their plantains, their chips and guac, their salsa, and their frozen drinks. All of that was the best you can find in the area, especially the corn. Gross in concept, mayo and cheese on corn?? But SO GOOD. My complaint: they don't take cards (annoying) and they charge $6 for chips and salsa. $7 for chips and guac. Really??? Most places that's free. They only charge $1.25 for a side of house made salsa, so that means that they are charging almost $5 for just plain chips!! Wah. But that's okay. I'll still come here for a burrito and be happy about it. :)", "author": "Cassie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "GIANT SECURITY GUARD: \"IS THAT OUTSIDE FOOD? CAUSE WE DON'T ALLOW OUTSIDE FOOD IN THIS RESTAURANT??\"\n\nSNARKY LUU SISTERS: YES. BUT, THESE ARE LEFTOVERS. WE'RE NOT EATING IT HERE, WE JUST STOPPED FOR A FOURTH MEAL AFTER DINNER. RUDE.\n\nIt was my last night in NYC and you bet your bottom dollar I was going to eat until I was uncomfortably full cause hey, anything worth eating, is worth overeating. And that is exactly what I thought when I sister jokingly suggested that we stop by Habana Outpost after a large dinner at Calle Ocho and I seriously took her up on the offer. \n\nWe ordered the corn on the cob: grilled corn, mayo, parika and queso fresco--YES, PLEASE! This treat was reminiscent of our days in Highland Park in LA when corn on the cob used to sell like hotcakes from those questionable food vendors (if you can call them food vendors..) pushing around a cart in 80 degree weather and ringing a bell! EXCEPT, the corn on the cob at Habana did not give my sister the shits like the cart guys used to (who knew mayo sure was questionable in 80 degree weather when it's stored in a cart). \n\nDefinitely a place to dine at, Habana Outpost serves all kinds of delicious Cuban food and their corn on the cob sure is something worth trying! AND, they show movies on Sundays during the summer just projected on a wall--it's a very lively experience with a ton of patrons! \n\nFun fact: Habana Outpost is the first solar powered restaurant in NYC!", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "Honestly Habana has high ratings because of the ambiance and crowd that frequently visits. The food is subpar and the drinks are watered down. I wish the food was a bit more authentic.", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "This place is adorable. My friend suggested this spot and we arrived at a brightly colored house strung with light and other festive Cuban decorations.\n\nThe food here is affordable and made to order.  I tried the fish taco, steak taco, guac, and plantains.  All were great though I highly recommend the steak taco above all.\n\nThere is a lot of outdoor seating and a decent amount of indoor seating. Not sure how it will work during the colder months - but certainly a great place for the summer!", "author": "Elyssa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "I've been meaning to come here for some time ! The food and drinks are good ! But this is a lil spot u come to with ur friends it's pretty cool.", "author": "Queeny B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Looking for an authentic Cuban place, this is your place. I had the Cuban sandwich, and it was delicious. It was one of the best Cuban sandwiches I have ever had. Not only that, but their fries were awesome. It hit the spot on a hot day. The restaurant itself is a quaint space, with music playing and a lot of life. Definitely check this out for great cuban food.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-09", "description": "Went there last night with my friends we all had different food. I had a fish taco(tasteless) rice/ beans with pork(not good) My other friends had the chicken quesadilla, shrimp taco and chicken taco. WE ALL ENDED UP WITH FOOD POISONING! so never again I'll  be eating from there again..2 stars because the drinks were good.", "author": "Mel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Love love love this place! Always look forward to coming here each summer. I went for the first time this season last week and it did not disappoint. Great food, great atmosphere!", "author": "Jaclyn R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "Only 3 stars for the atmosphere and frozen drinks. The food is mediocre at best. I got the chicken sandwich and my boyfriend got a burger and neither of us could get passed the overly charred flavor. However, dining outside and watching the sunset was great", "author": "Kayla D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "I really love this place. Great drinks cool people nice vibes. Great for summer. Ive been here on a number of occasions while meeting up with ppl in the area or hanging out.\n\nPros*\nAhmazing corn\nDelicious Cuban sandwich\nFrozen drinks\n\nCons*\nCash only\nMajority of food sucks", "author": "Lola S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Habana Outpost is an indoor and outdoor restaurant. Let me explain how this works. You walk inside the restaurant and order your food. One line is for general orders and the other line is specifically for drinks and corn. On a nice sunny day, both lines will be long so just anticipate a wait. Then you find a seat outside and wait until your food is called that is being prepared on a truck. Be advised that it resembles cafeteria seating. Remember in high school when you circled the cafeteria looking for a seat? It's something like that. Luckily, the seat circling and line wait is worth the experience.\n\nVisit my blog http://simplypamarie.com/2014/04/28/habana-outpost/ for further details and great pictures!", "author": "Pamela G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Four stars for the ambiance, drinks, corn, and chicken waffle - entrees were a miss and needs improvement LOL.\n\nI came here on a lovely summer weekend with my girlfriends for lunch. There was a DJ spinning for a few hours, and seating outside is on a first come basis on benches with umbrellas to hide from the beaming sun. We ordered our food inside and picked up drinks, no servers, so I guess no tip haha. \n\nThe mango mojito was DELICIOUS, would definitely recommend getting this drink AGAIN and AGAIN! The spiked lemonade wasn't bad, but not as addicting as mango mojito. I had the corn with everything on it, tasted pretty good. Chicken waffle with maple syrup was also really good.\n\nThe main entrees were the problem at this place, I had the Diablo chicken with rice, and it was bland and dry. It didn't taste fresh and hot, and NO WHERE close to living up to the word \"DIABLO\"...its like really? don't give it a cool name and leave me hanging. My friend's entrees were just as bad, the steak was not tender, very tough to cut through and chew.\n\nSo my recco would be, come here for the drinks and appz, this is a good place to go for a small bite with friends. Main dinner elsewhere. :)", "author": "Betty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Quick, casual, quality meal before a movie at the BAM. Our favorites were the spiked lemonade and corn. Highly recommend! We'll be back for a movie night.", "author": "Molly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "this is one of my favorite places in fort greene! even though it is seasonal. it's so fun! the corn, the margaritas! make sure you bring cash. good crowd, good music, really fun. i love coming here on summer evenings especially sunday nights. decorated super fun too!", "author": "Raven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Made our way to Habana Outpost after spending the day at Afropunk. The place gets 4 stars because it has a great outdoor patio and reasonably priced drinks. Our group of 8 did not have a hard time getting a place outside on a busy night and because they have a separate drink ordering line from the food, it was very easy to get a round of drinks (this is self service). \n\nWhile there our group tried a number of their dishes, I had the steak tacos and grilled corn. Friends had Chicken Diablo and Cuban sandwiches. Overall, our group agreed the food was good but not great (3/5). The tortillas on my tacos were cold, green salsa was bland but the grilled corn was tasty (and should be served with toothpicks!). I have lived in both Arizona and New Mexico and this food has nothing on the Southwest, folks who love food at this spot don't know what they are missing!\n\nBest part is standing outside the venue seeing \"SPREAD LOVE IT'S THE BROOKLYN WAY\" on the wall across the street and remembering how damn amazing Biggie Smalls still is!", "author": "Alyssa M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}