{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "I must have been lucky the day I came here. I was feeling not too well from the previous night and my girls and I came here after reading all the raving reviews. I've never eaten at such a place nor even been introduced to the concept. \n\nHabana Outpost serves DELICIOUS food with outdoor seating! i love the fact that we can enjoy our meal under the sun, as simple as it may be. I did not like waiting for my order to be taken because it took way too long for the line to get moving. But i did like how there were lots of options i wanted to try. I ended up ordering the Breakfast Burrito and though I can probably find it at home, it was still one of the best things I ate in NY. I loved the peppers that came with it, it just tied all the great tastes together. I didn't get a chance to get the corn, but by the looks of everyone else ordering it, i must have been stupid not to order one. I'm not even sure what was on the corn. The corn looked like it was topped with a mayonnaise spread with cheese, chili powder and probably something else I couldn't recognize. I also did not order a margarita on that beautiful day :[ even though i missed the must haves, i still enjoyed the outpost and will miss it dearly!", "author": "Connie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "So being that many of my friends live in Fort Greene and the neighboring Clinton Hill area, and I come from Bed-Stuy...this place is always a great pick for a last minute chill-out. \n\nI've been coming here for about 2 yrs or so...and I always have a great time (especially in the summer). \n\nThough the corn is a-ma-zing....I must agree with my friend when she recently said: \"The corn fell off...maybe they changed the recipe\"....But, its still all good in the hood. \n\nAnywho, Habana is the shizzzz-nittt!!!...My perfect summer day/night includes a stop by here!! =]", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "Pour Me Some Frozen Mojotos \u0026 Gimmie Mexican Corn!!\nCour Pe Mome Srozen Fojotos  \u0026  Mimmie Gexican Morn!!\nMour Ce Pome Mrozen Sojotos  \u0026 Fimmie Mexican Gorn!!\nGour Me Come Prozen Mojotos  \u0026  Simmie Fexican Morn!!\nMour Ge Mome Crozen Pojotos  \u0026  Mimmie Sexican Forn!!\nFour Me Gome Mrozen Cojotos  \u0026 Pimmie Mexican Sorn!!\nSour Fe Mome Grozen Mojotos  \u0026 Cimmie Pexican Morn!!\nMour Se Fome Mrozen Gojotos  \u0026  Mimmie Cexican Porn!!\nPour Me Some Frozen Mojotos  \u0026 Gimmie Mexican Corn!!\n\nWhew - Say that ten times fast with teeth full of corn and brainfreeze", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "3.5 stars.\n\nHabana Outpost is a great place for cheap beer and good eats on a summer afternoon or evening.  This is the Brooklyn outpost of the popular Cafe Habana, where people often find themselves waiting for an hour for a table.  I was excited to find that another Habana outfit was located conveniently two train stops from my apartment.  In a city full of $7 standard beers, it's a treat to find a place that has 3 kinds of beer on tap (Brooklyn Sixpoint) for just $2.50!  Although the \"mexican-style\" grilled corn isn't exactly like the authentic yummy elote I used to get from the corner elote man when I lived in San Deigo, it's tasty, albeit mayo-y.  The sandwiches are huge - I'd split them with someone. The rest of the menu is a very very abbreviated version of Cafe Habana's, and almost all of the items are less than $10.\n\nDuring busy times and in beautiful weather, you'll stand around waiting for space at one of the many outside tables.  Not a problem when you're just drinking, but a little problematic when you're trying to hold your food and a beer while eating and scanning for a table.  The crowd is fun and lively.  And honestly, this place had the most diverse crowd I've seen in NYC - it was like hanging out in SF or in Oakland.       \n\nThere are two lines: one is for beverages and food and the other is strictly for beverages so you can get your drink on quicker.  CASH ONLY.  It closes at midnight (so early!) 6 days a week, closed on Tuesday.", "author": "Caroline B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "This is one of my favorite eateries. I've tried Cafe Habana a few times for both lunch and dinner and was underwhelmed both times. At Outpost however, my belly and taste buds were very satisfied. Its the perfect place for a nice warm spring/summer get together with a friend or two. Their cuban sandwich is yummy and filling (the pickle with that ham makes for a great combo) and they had a shrimp and beans on rice special that day that was fantastic. I love that they are eco-friendly, so kudos to them. Their indoor seating area gets very hot and stuffy so best to just sit outside in the garden but it gets full very quickly and since people are just sitting and chatting, it might take awhile before you can get a seat for your part. I would not recommend bringing more than 4 people here, it'll just be hard to find a seat. Service is quick enough and friendly, and you get to learn a bunch of random facts about their eco-friendly garden and restaurant because they post little signs here and there. I give it 2 (green) thumbs up!\n\nI'm glad it's finally re-opening this weekend!", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "All the cool kids go to Habana Outpost to drink frozen mojitos from a machine and eat grilled corn at picnic tables. It's probably the most awesome place in my neighborhood during the summer, but I had to take away a star because I'm pretty sure it's only open in the summer. That's the downside to being a solar powered, primarily outdoors space. The upside is that it is, as previously stated, completely awesome. \n\nThe idea is that it's a \"community space\", so they do things like letting people sell stuff inside on the weekends and call it an \"open air market\". They also have movie nights and other fun stuff. I would probably be here every day if I could actually convince my Manhattanite friends to go to other parts of Brooklyn besides Williamsburg.", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "Kudos to Habana Outpost for bringing this eco-friendly version of their popular Cafe Habana to Brooklyn.\nThis is a cute, casual joint to eat at.  Contrary to another review, there actually is cool air-conditioned seating inside. (Much welcomed on a hot summer day)  Or you can hang out in the front outdoor area where the flea market is.  There was also a dj spinning when I visited on the weekend.  Atmosphere is very laid-back, even for Brooklyn.\nFood is tasty and reasonably priced.  Drafts of local Six Point beer are super cheap.  I think $2.25 a cup?\nAs others here have mentioned, all utensils, cups, plates, etc  are made of recycled products and the booths are wrapped in old sails.\nNow I can feel good about doing something for the environment as I'm stuffing my face.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-10", "description": "After a stroll in the Brooklyn  Flea, we stopped by this outpost of the Habanas.  I must say that I was surprised with the huge outdoor area and the strong frozen margaritas.\n\nI can't say much about the food due that I only had the corn on the cob; but the atmosphere at this place is rocking.  Some great 80 music (live DJ) on the background and some locals showing their moves and just having a good time make up for for their order taking system.\n\nNo attitude or pretentiousness found here.  It's all Brooklyn!!!", "author": "Eros A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "It was a very sunny day, MJ had just passed, the delicious frozen margaritas \u0026 mojitos were flowing freely, the outdoor patio was crammed with smiling faces, the heads \u0026 bodies bopping along to rare groove.\n\nA sublime summer soundtrack. The only reason I won't give this beautiful place 5-stars is because it was the first and only time I've been.", "author": "Motorman W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "YUM!!!!!!\nThe Cuban was good, the corn was GREAT.\nOne star discounted because I am a diet coke fiend and they have none.  I know I am just not yuppie enough.   :(   But I loved everything about this place.  The decor, the DJ, the vibe, the food.  So cool and for Brooklyn, not too heavy on prices.  :)   GO_GO_GO........", "author": "Jen-Jen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "Did this place need another 5 star review? No.\n\nAm i gonna give em one? Yes.\n\nWhy? Because they deserve it. This place is as good as it gets. Food is amazing. Drinks are amazing. Outdoor area is amazing. And THEY RUN IT ON F-ING SOLAR POWER. I mean, come on! I This may be the best place ever.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-01", "description": "FOUR STARS AVERAGE!!! Are you kidding me!\n\nAnd granted, the \"eco friendly\" schtick is real High Concept... bicycle-powered blender n' all. But 4 stars.... really!?\n\nMaybe its me. Maybe I should have been drinking some 8-dollar Mojito/Margaritas from the fancy granitas machine. Perhaps that would have softened me a bit. And I haven't yet tried the corn everyone is raving about. Though they'd be hard pressed to top the Red Hook women and their fancy charred corn-ey goodness.\n\nI'm not turned off by the food-from-a-truck thing either. I just got back from L.A. where there are like A THOUSAND taco trucks all over town with about 990 of them serving up mind-blowing $1 Carne Asada and Al Pastor mini tacos that puts every NY taco mill to shame. How is it that this well-financed Fort Greene concept-truck-as-restaurant doesn't come close to what a family-run roachey ghetto L.A. parking lot truck is putting out?\n\nHOW INDEED? \n\nWhat was being peddled as a \"burrito\" was merely a wrap with the ends closed up. What am I - two years old? It ain't fooling me. It is NOT a burrito.\n\nJust stop.\n\nHigh concept: YES. Mediocre Food: YES.\n\nHow to fix it: Let the dude in the truck cook what he cooks at home. Then it might rate 4 or 5 stars.\n\nAnd the saddest fact of all: you can walk 10 paces next door to Cafe Lafayette and get over-the-top excellent food. Sure they don't have solar cells to power their restaurant - they use dinosaur gas to cook it up. But at least you don't have to choke it down.\n\n(Here's my girlfriend's review: \"dry chicken, wilted lettuce. I have NEVER had a salad in New York like this.\" She's not as bitchy as me.)", "author": "Bryan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "This is a hard one....I give this a 3.5 because some things I liked and others I didn't care for. The food is cheap and tasty enough, but not great.  The area is fantastic and there are many good places to eat at so, so don't overlook habana but be prepared for a lively lively crowd ... Tacos were good... Margaritas were okay... Nothing outstanding, but overall a decent cheap eat", "author": "Ron J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "My philosophy to writing reviews is simple. You can't write one on a place unless you have been there more than once. So what do you do when every time you visit someplace, it gets better?\n\nHabana Outpost might be the best kept secret in New York, although it is not to native Brooklynites. We go there all the time. What more could you ask for in your local eatery?\n\nGreat food? Check, with the reinvention of the corn on the cob. I have tired to duplicate and its not the same. I barely like corn and I can't stop eating it!\n\nGood Drinks? Only the best mojito I have ever had! Ask anyone who has had it and they will tell you it is the best summer cocktail in NYC.\n\nOutdoor seating? Check. If you are single and looking to mingle, it features the most beautiful black people that Fort Greene has to offer. Talk about food for the eyes and taste buds\n\nWhat about the environment? Got that covered too! They are a eco-friendly restaurant.\n\nMy usual order: the INFAMOUS Corn of the Cob, sweet plantains and a mojito. LOVE IT! On Sundays, they show free movies. They do community events like a haunted house for the kids during Halloween. And at night, their downstairs turns into a lounge/club spot.\n\nI could go on and on, but you get the idea.", "author": "Max J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I love the concept of this place. It has a great atmosphere and crowd. It's communal to the extent that the seating is shared and you just might strike up conversation with the party next to you. The food was good and so were the frozen margaritas. The pricing was very reasonable and the staff was pleasant. Only four stars because of how difficult it was to find seating and that you're basically on your own to make things happen.", "author": "Aaron B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-25", "description": "5 Stars for:  Ummm, everything!\n\nYum yum moritas! The delicious frozen margarita/mojito combo that has you falling off the picnic bench when they close up at midnight (too early, but at least you can never really overstay your welcome).\n\nYum yum yum corn!!! Their corn is the most delicious thing ever, pretty much.\nThat's all I can say about that.\n\nBut also, I am in love with everything else I have ever had on their menu. Best Cuban sandwich ever, best veggie burrito (with cactus!), best chicken sandwich. \nI can't say anything bad about this place. I was already in love with Cafe Habana in SoHo, but after moving to Clinton Hill and coming here I was practically in Heaven. \n\nAlso, I love that this place is a true eco-eatery. They really stick to it, but make it fun with cute signs explaining the recycling procedures, etc.\n\nThe outdoor movie screenings on Sunday nights sometimes get a little overcrowded, which is understandable of course, but any other night of the week I've managed to find a little corner of a table at least (people are usually willing to scootch over for you, fortunately).\n\nJust loveliness, all around. That's all.", "author": "Emma M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "This spot has definitely been my go to spot during summer afternoons on the weekdays. Weekends get too crowded so when I come here for a quick lunch of corn and beer I love sitting in the outside patio area. Sometimes the food gets cold pretty quickly so eat as soon as you get it... Other than that the corn has me coming back time after time", "author": "Antoineta M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "$2.50 beers????!?!?!!?! Are you kiddin me? These aren't PBRs, either.\n\nOutdoor space, grilled shrimp special, rice n beans and avocado and frozen drinks.  The grilled corn is amazing.\n\nI'll be back.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "I honestly never tasted any food here. I usually order a few mojitos and mingle with the women. It's such a great vibe and not a bad place to stop after a long day of shopping. Stays open pretty late and serves as a nice tune up before going to the bars and lounges later into the night :). Great summer gig. Nice women. Awesome vibe.", "author": "Mars B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-15", "description": "So I went here last weekend for a get together of some old co-workers and a few of their friends. We chatted about New Line and caught up on what people were doing now. It was a nice day, and the rain held off even though the clouds were ominous. There was a whole theme of \"past\" that afternoon, old co-workers, a girl from high school that I didn't know but we recognized each other, the summer already gone in the essence of post-Labor Day. I had a lot of fun, but it felt a bit bittersweet. I did start to realize how many people lived around here though, it's such a great corner, right across from the C train and one block from the G.\n\nIt's simply one of the most colorful places you'll see, and the whole eco-friendly vibe adds to the charm. The old soul and funk soundtrack was absolutely infectious; kind of reminded me of that scene in Romeo Must Die when Aaliyah shows the kids how it's done with a few steps to Jackson 5. You walk in, and is all the picnic tables with the umbrellas for cover, a margarita stand, and the food truck which is awesome and covered with hand paint and Girls of the Month. It's such a neighborhood place that you only see in movies, the place was probably built on smiles alone.\n\nInside is just more color, as the register and bar is on your left (you order food here and bring your ticket out to the food truck). They serve up 12 ounces of Six Point on tap for: 2.50. That's right. 2.50. There's a water cooler and toward the back by the really cool bathrooms, there are booths if you prefer to eat indoors. The front side is an open, airy space with a long high table in the middle with stools.\n\nFrozen mojitos weren't that good, and considering they were 8 bucks, I'd rather purchase a beer. However, they were indeed strong. \n\nThe food was excellent; the corn of course is pretty famous but I really enjoyed the steak ques. because the steak was actually tender and not pre-cooked dried up meat. Most of the menu hovers around 7 to 12 dollars.\n\nThe place gets considerably crowded as the afternoon wore on, and the vibes just got better. Everyone is really nice here, there weren't any assholes that I could see, and that's such a rare sign, and it's such a good one. That alone makes 5 stars, because that's what establishments like this should do. Lots of laughs can be had at a loud volume without killing anyone's conversation. I wanted to dance so bad, the place just makes you want to do that. \n\nI walked out of there realizing that it's the best place I've been to in a while. Immediately after getting on the subway, I wanted to go back. It's almost bittersweet to spend an afternoon like that, because you realize it doesn't happen as often as it should, and with people you don't get to see as much as you would like.", "author": "Victor L."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}