{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "I love this place, it's a pretty cool spot. Love the decoration here! I have lived the area all my life and been coming here since 2010. \nFrozen drinks are great, food is great. Only thing is that when it's packed it takes forever for food to come if you order. Weekends are especially packed. Weekdays after work is nice, not too busy. Today I order a margarita and pina colada mix which I never tried before it's DELICIOUS. \nChicken quesadilla is great never fails", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "The Habana hype is not real. I've had better Cuban and Mexican food before. I was highly disappointed with my first, only and last experience. The place was had a lot of unventilated air, making it so hard to breathe and eat in there. \n\nI ordered some of the popular items Habana has to offer. The food was very bland and the drinks were substandard.  The fish tacos were weak, could have used a lot of extra flavors in there. Salt and hot sauce was not helping. I've had better cuban sandwiches. Rice was overcooked, beans were boring and the steak was dry and served as hot as warm. The frozen drinks could use some quality ingredients.", "author": "Carrie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-21", "description": "Great food, atrocious service. I waited in line for 30min just to make my order, and then wasted another 20min waiting for my number to show up on the prompter, which it never did, because they never inputted it.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "After a beautiful evening watching Sundance Gil festival short clips hosted by Rooftop Film the go to spot afterwards was not a debate! I've visited this spot twice before while living in Brooklyn and wanted to take my friends for an al fresco dining that makes you feel like you're in the backyard of your parents house. I'm a vegetarian but, my carnivore friends enjoyed the pork plate and enjoyed the flavors that brought them back home! Love the vibe and scenery!", "author": "Lidia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "My sis ordered our food for take out. She recommended it, says it's one of her favorite spots to eat. I had the shrimp taco plate. First of all the rice is soooooo good. The food was delicious. Juicy pieces of grilled shrimp and everything had so much flavor. I deducted 1 star because I ordered the taco plate and did not receive any tortillas. I was disappointed at first but after eating the food, I forgot about the tortillas (even though I would have loved to try them).", "author": "Jae J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Met some friends here before heading to the BK Museum and I have to say this little place is super cute. The outdoor seating is fun because it's like kinda packed but kinda spacious at the same time. A lot of people fit back there at once, and the customer diversity makes the environment super chill. \n\nI hate that I didn't eat anything other than the \"queso\", which I feel is really just 7-11 nacho cheese but that's my fault for not eating real food. I have to come back and try their food so I can update this....", "author": "Tina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "Food was pretty solid and it's a cool place, just way too many libs and hipsters out there. Definitely recommend checking it out. p.s. It's cash only, I mean what the fuck I've had enough of these places, pay your god damn taxes", "author": "Mike O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "This is a really fun Cuba themed summer restaurant with a unique message about promoting sustainable building in NYC. This location in Fort Greene is like a little Habana campus, with a take out joint on one side of the street and a counter service restaurant with a wonderful outdoor patio on the other. It was super sunny, so my friends and I opted to sit in one of the booths inside. It's not air conditioned, so we were sticking to the vintage vinyl booth seats. We tried the Cuban sandwich, corn, tostones, and some tacos. I loved the veggie taco, it got me so pumped up about tacos again, I went out and bought a pack of tortillas later that day. The tostones were crisp and savory with a soft, starchy middle - absolutely delicious in mayo. My friends thought the Cuban and meaty tacos were delicious - the sandwich was pretty substantial and smelled great!\n\nThe real superstar here was the corn, however. On its own, fresh corn is exceptionally buttery and sweet, but Habana Outpost takes it to the next level of yummy with even more butter, spicy mayo, and fresh cheese.\n\nSince this business makes a terrific effort to carry out environmentally friendly practices with their physical restaurants, I was confused and disappointed that there wasn't really any info about the sustainability of the food itself. It's unclear to be whether their environmental business model carries over to their food in any way.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "This place never seems to disappoint.  I have visited here 4 times in 6 weeks.  The Mexican corn is to die for, always done to perfection and one of my ultimate faves is the fish taco that is usually stuffed with a nice white fish with loads of salsa and fresh onions.  Is your moth watering yet? The outside vine is always on point, people are jovial, relaxed, and just plain happy.  On the weekend there at 8pm they usually play a movie  and Duong the day there is usually a DJ in the summer.  Let's don't even talk about the location, steps away from my favorite movie places BAM.  This is located right in the heart of it.  Perfect for anyone or groups, families, dates, friends and fiends with benefits.  You will not be disappointed.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "So when I walked it I didnt know what to think...is this Cuban or Mexican. I originally thought it was a Cuban place and when I saw the menu there was not many cuban dishes (granted I missed some and I think it may have been a limited menu bacause we were a the summer only outdoor seating across the street from the main place) with that being said the only Cuban dish i saw was the Cuban sandwich....I felt like Cuban food so I thought why not. .... well it was exceptional...I am from south Florida originally (and trust me Miami  has the best Cuban food...better than Cuba itself)...but this was great. The pulled pork is what made it.  So tender and juicy and tasty...would definitely come back and would go out of my way....that's a 5 star folks", "author": "Jon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Atmosphere: Such a fun place for summer lunch. You order at the counter (cash only) and seat your self outdoors or indoors. My friend and I came on a Saturday afternoon, and were actually surprised that there were so many open seats! We plopped down in the shade and waited for our order while listening to the DJ they had on deck-he was really good! \n\nFood: \nDelicious! I had two tacos-carnitas and catfish- and the corn. One weird thing I noticed on the menu was that the shrimp taco was $7 dollars while all the others were in the $4-4.50 range. Didn't get it for that reason lol", "author": "Brieana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "I can't believe I've lived in Brooklyn for like 6 years but never been here even though one time my husband peed next to Adrian Grenier here and if that's not a ringing endorsement of an establishment, what is? \n\nThe back patio is the cuuutest. It's like a summer fairytale out there with tons of communal seating and fun rainbow umbrellas. \n\nAND! They have killlllllerrrrr margs. Like, how am I so drunk I only had one drink, that's not possible?! But it is, because these margs are strong. \n\nI know the corn is THE THING you order here, but I ordered the burger instead. It was a mistake. I added cheese and bacon (also a mistake). Don't eat the burger. They shouldn't even have a burger. Stick with the Cuban or tacos or THE CORN. \n\nCash only :( But there is an ATM :)", "author": "Anne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "This place is Amazing!! I love to go out over the summer and have drinks outside and this place and perfect for it. Its so colorful and fun.Now the main reason that im writing this review is to talk about their cuban sandwish.OMG this is the best that i ever had in my entire life.the way the meat is cooked,juicy but not overbearing its just perfect.If you like cuban sandiwsh you have to go here\nAll the food that i tried has been so good.The only thing im not to crazy about this place is their drinks.They come froma machine so dont expect a tropical mojito that taste like you are in the habana.", "author": "Suleika L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Are you a twenty-something New Yorker trying to pull a group dinner together but everything's always so damn expensive and at least one friend is always running late and also everyone lives in dramatically disparate neighborhoods?\n\nBreathe easy and come to Habana. It's an easygoing outdoor space where friends can come and go. Grab a table and send friends on expeditions inside to get tacos and frozen margaritas while you listen to live-DJed tasteful reggae and watch a true cross section of Brooklyn come together.\n\nI came with a group of friends around 7 pm on a Friday and we were lucky to get a table. As the sun goes down, they take down the rainbow umbrellas and turn on the Christmas lights. A really fun space, and convenient located right off the C in Fort Greene.\n\nThe line inside for food is egregiously long, though there is a separate line for drinks. Offerings include tacos, cuban sandwiches, burritos, and the star of the show, grilled corn. It's pretty cheap-- my taco was under $4 and my corn was around the same. Margaritas are only $9. Cash only!\n\nDespite our large order, it came out in about 10 minutes. The taco was far too soupy-- the sauce was falling out everywhere-- but the guac tasted super fresh. The grilled corn is best-in-class. Just the right amount of chili powder, mayo, and cheese to complement it. And you're even eating a vegetable! My friends enjoyed their burritos and Cuban sandwiches; I think the tacos may be their only low point.\n\nThe food's not bad, but the space alone makes this worth a visit. There's an abundance of good vibes and being able to sit outside with all of your pals on a warm Brooklyn night is invaluable.", "author": "Liz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Love the food here. It's fresh, great prices, super tasty and a great vibe... love the outside space and the customer service. \nMust try the Mexican corn and their fish taco. \nDrinks are great and affordable", "author": "Angela F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "This place is about one block from my airBnB, we stopped by here for dinner and wow what a neighborhood gem. I loved the atmosphere here, and the food!! I ordered one chicken and shrimp taco, and one mango pina colada. The price was a bit high on the tacos but they were huge, and it was delicious. \n\nI came back here the following night because I wanted to try their Mexican street corn.. I didn't love it.\n\nIt's definite a cool place to come for lunch/ dinner or when you just wanna chill.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Such a good find on my way to see an outdoor movie at the park nearby. Cash only of course.\nCorn was bomb.com I could/would eat it all day everyday. \nCool place to hang outside on a nice day.", "author": "Khanhu V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "This place is definitely a cool spot for summer. The venue is nice and who wouldn't want to cool off to a nice frozen margarita also the Cuban food is ok, nothing special that would make me want to come back to. However if it's a nice day and you want a few small bites and some drinks it's definitely spot to check out or hang out when your in the area.", "author": "Dimitric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "It's a great outdoor and indoor place to chill , and chat with friends . \nEvery Sunday they have movie night at 8pm which is pretty dope . The only thing is they don't take cards it's cash only !", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-25", "description": "A great place to go with little kids, as they can run around fairly freely and safely. I enjoy the vegetarian burritos.", "author": "Deborah M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}