{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "I need to come here more often! What a great space for hanging out with friends, drinking some tasty margaritas, and chowing down on some tasty Cuban and Mexican staples! \n\nThe atmosphere is definitely the highlight of this place--a great outdoor space with tons of picnic style tables and umbrellas... and a live DJ on some days! Oh, and if you're not feeling the lively, outside vibe, they have indoor seating as well.\n\nFood highlights include the fish tacos (soooo flavorful) and the grilled corn. The breakfast burritos are also yummy. My only complaint about this place is the price point for their rice and beans; while they're tasty enough, they are super overpriced at $6.50! It's weird that the rice/beans are priced as such because the rest of the menu items seem priced as expected. \n\nI'll be back.... just sans the rice \u0026 beans :)", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Simply amazing food and atmosphere. I was not happy with the CASH ONLY policy (alas, the four stars) especially when I just looked at the menu and I am all excited about ordering. But alas, they do have an ATM in the store and there is a fee on top of your banks fee (thank you PNC for the reimbursement!). When I entered Habana's, the first thing I did was place my phone on the floor and plugged it into a wall outlet. I then sat at the center bar at the entrance and perused the menu. I was definitely eyeing the Cuban, which was denoted by a star as being the best in the city. I wound up ordering the catfish sandwich, with lettuce, tomato, and chipotle mayo on a hero. I also got the ginger beer pineapple lemonade. This was a ridiculously refreshing drink and at more than $3.00 for a what seemed like a 14 ounce cup, it damn well should have been. And no refills? Pleeeeze! That's  ridiculous. An employee did let me know that I could plug my phone into the hidden outlets lining the underparts of the long table and I thanked him profusely for now I could actually use my phone while waiting on my food. So you pay the cashier/host, take your ticket and watch for your number to show on the LED screen. You then proceed to the patio make a right, and pick up your food from the tin corrugated tin cooking room that is set into the restaurant. That was pretty cool. You could eat outside as well. While it was drizzling and a bit chilly, it did not stop a few patrons from eating on the patio. My food took about 10 minutes to make. The catfish was very moist. I liked how the bread did not separate from the ingredients when I bit into it. It was crisp, well pressed, but not rock hard. This was an amazing sandwich. I actually was considering buying an extra side of the chipotle mayo, but the sandwich was perfectly made with every thing layered just right. If this place did not have a CASH ONLY policy, it would easily get 5 stars from me. This will definitely be my go to number one spot in Brooklyn due to its great food, ambiance and unpretentious crowd.", "author": "Hillenbrand H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "The only thing Cuban about this place is its cash-only policy.  Also, don't drink the frozen mojito unless you enjoy mouth wash in your slurpee.  On the upside, there's a patio...so there's that.", "author": "Valerie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Great place to grab some quick and affordable food! Simple but delicious. I highly recommend the corn. So good and will definitely be coming back!", "author": "Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Came to this spot for the first time and I love it! Such a good spot that covers all reasons for going whether it's a day out with family, a date, hanging with friends, etc. the corn is addictive and so is the margaritas. The outdoor area is perfect for when the weather permits it. I hate that it's cash only but there is a ATM on site.", "author": "Garrick W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "I got pulled in by all the bright colors, Habana has such a fun set up! Ample outdoor seating, lights, bright colors, friendly staff, funky semi-outdoor bathrooms, a nice beer selection, Spanish music playing in the background. I felt like I had taken a turn somewhere and ended up in Miami. You order inside, then wait for your number to show up on a screen outside and collect your food. \n\nThe food was a little tame for me, I was expecting more bold flavors, more spice. The catfish sandwich is made with quality ingredients and is very filling, but the flavor is very mild. The pork and fish tacos were also similarly mild and calm in flavor. The pork was a little on the dry side, it needed some kind of sauce or just more salsa. But they did load the tacos up with onions which I love.\n\nBUT- the shrimp tacos? Oh my god the shrimp tacos. These are five stars on their own and worth making the trip out for. The shrimp had to be some of the freshest I ever had, seasoned and grilled perfectly, tender, flavorful, spiced, oompf. I should have just ordered three of these. Wow.", "author": "Luci B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Such a fun, busy, vibrant place. Perfect for a hot summer day/night hangout. They have plenty of space both indoors and outdoors. Colorful decor and loud music makes, and most importantly, great frozen drinks make you feel like you're on a mini vacation. \n\nAtmosphere: very casual and fun. Good for big groups. \n\nDrinks: \nFrozen Margarita - fresh, fresh and fresh! Delightfully sour and quite sweet. \nFrozen Mojito - minty taste is well infused. I liked it more than margarita. \n\nFood: \nGrilled corn - it came out like warm, but the flavor was there. Not that impressive. \nChicken and Waffle on Stick - so good!! Well seasoned chicken wrapped in crispy waffle, drizzled with maple syrup. I could have six of these!", "author": "Ellina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "I came here with a really large group on Friday afternoon, around 5 o'clock, although some people arrived earlier and some people arrived later. I am not too difficult to please, and I am generally a pretty generous reviewer, but I just wasn't really feeling this place.\n\n+1 star for the food. Everybody I was with enjoyed what they ordered. I had two shrimp tacos, which were bangin'. There were 4 pretty sizable shrimp in each taco, and the flavor was great, which made them totally worth the $7 each.\n\n+1 star for the ample outdoor seating and tents for shade. We showed up with a pretty big crowd, and we were all able to sit without fighting for spots or displacing any of the other many guests that were there.\n\n+1 star for the location. It's in a cute \u0026 trendy part of Brooklyn, which I don't really care about, but there were a bunch of other bars \u0026 restaurants in the area, there were several subway stations within walking distance (including the C train right outside the bar), and we actually got a parking spot just two blocks away, as did several others.\n\n-1 star being cash only. I'm not a fan of cash only under any circumstance is, and since this isn't a tiny little venue, I don't really understand why they won't except credit or debit. There's an ATM on site, but I hate paying fees from random, non-bank ATMs. Also, drinks there are kind of overpriced for what they are, they don't seem to run specials, at least not that we were aware of.\n\n-1 star for the surprising number of toddlers and children running around. I'm not sure if that's on the venue, on the parents, or both (I'm going with both), but it's definitely as much a bar as it is a restaurant, there were several security guard/bouncers patrolling the place, and I'm just not really about having my outdoor drinking interrupted by kiddos. \n\nI suppose I would come back again, but only under similar circumstances, where it was a group gathering and that was where the group had already decided to go.", "author": "Tara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "We went here after watching a movie at BAM for a bite. The food and drinks were delicious.  My only complaint is that a staff member came through the inside seating with a mop smelling of cleaning agent while it was full of customers. The smell during my bite to eat wasn't appreciated.", "author": "Sunita S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "This was a laid back place must say it gets pretty crowded and most of the tables are outside. They do have like 2 or 3 tables inside where you order. It was decorated with a lot of murals which made it very interesting and gave it a cool feel. They also had a mini clothing line if you ever decide to buy a shirt, hoodie or a hat that has their restaurant name this is the place. the chairs are not comfortable (basic metal fold able chairs) and some of the table were also just those plastic fold tables. They had dogs in there as well as children. I was a little thrown off when i saw babies there as there parents drank away guess it is a place for all? I did see a children section but thought it was for specific days for children to come with their parents.In my opinion this place is overpriced for what it offers but it is worth a one time visit and maybe a second. The mojitos were not traditional mojitos but they were not terrible either. Food was ok i had a chicken quesadilla and it was average definitely had better one before.", "author": "Esmeralda D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "Me and my friend walked down the block to this beautiful out door set up, but little did Ik what I was getting into. The menu had a Star next to this panini said it was \"Voted NYs best\"... Bulls$*t, I could have got better food from Starbucks....", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "Great place to grab drinks with friends. The atmosphere is always lively, atleast in the summer, spring. Food is street food, nothing exciting served on paper plates. This place wins due to their beer and sangrias. I had a Bronx Ale and my GF had a sangria. Again, great place to grab drinks, relax, vibe out to the DJ but skip the food here. One thumb up over here", "author": "Barry G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "The Mexican style grilled corn is one of their staples and people come from far just to try it. It starts with grilled corn, layered with mayonnaise, cojita cheese, chili powder, \u0026 lime. When served warm, it definitely hits the spot. I also ordered the steak tacos, served with cilantro, onions, and homemade green salsa.\n\nThe food can be hit or miss depending on when you go. The outdoor courtyard gives off a nice vibe and during the summer months, the showcase outdoor movies.", "author": "K. D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Went here over the weekend and I really enjoyed myself. Warning: the line can get crazy! There are two lines one for food AND drink and the other for just drinks so pay attention. I got a mojito slushee drink that was pretty tasty. BUTTTT what I came for was the almighty ELOTE (Mexican corn). Omg, it was so good! It was $10 for the drink and $4 for the corn. You can get the corn cheaper else where but with the ambiance and vibe it's worth it.", "author": "Bria B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-01", "description": "It's a neighborhood favorite that's been around for awhile. There's two separate lines- one for food the other for drinks. The food line is always ridiculously long. You'd think they expand to more than one line. lIf nothing else, come out on a perfect day with friends and drink margaritas to your heart's content.", "author": "Shannon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Average flavors, nothing  exciting. Prices are on par with the gentrification of BK. Had a veggie burrito and Margerita. Im no longer hungry, which is a plus, but im not satisfied with  the meal. \nOne of these stars is solely for decor and ambiance.", "author": "T. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Enjoyed myself at Habana Outpost. Fish and shrimp tacos were good. The guacamole was even tastier.", "author": "Sam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Luis the Manager he made our night! Thank you so much... I bought my family here in their first trip to NYC... he was amazing", "author": "Catalina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "This has been somewhat of a go to stop in the area for a while but I think it may getting too big for it's britches now. Unfortunately last Friday's visit was more  frustrating than anything else. \n\nI was able to get a spot for two at a table outside with little effort around 9 pm on hot May night. I took this as a good sign, though it unfortunately wasn't. Even when it isn't busy the food is slow in coming out, mainly because the kitchen is just a standing food truck with 3 guys. It's kitschy and fun but not sustainable for the kind of crowds this place gets nowadays. The real problem with my last visit wasn't even the 30 minute line to order food but the fact that after waiting said 30 minutes we were informed they weren't taking any food orders at all. Why  wasn't this announced? Posted? Told to anyone waiting in line? We left, frustrated and hungry and in search of a quick meal after wasting time. \n\nThe 3 stars are for my past experiences as a whole but it seems like as this once hidden gem grows in popularity the systems that keep it running should grow with it.", "author": "Erica M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "So overrated. Heard such great things about this place. First there are such long lines to wait for a margarita in -- have you heard of a waiter? Second of all the portion size for the chips and salsa is pathetic. Like the chip to salsa ratio is about 3:1. Read the other reviews, even if they give more stars. The food is just not good. Not an enjoyable experience here.", "author": "Steven I."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}