{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "I came here with a friend. I've passed this establishment a few times but never went in. Margaritas were really good (I had 2). I love the outdoor seating very casual setting. The prices were very affordable. I would come back to eat here again.", "author": "Fancy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "This place should really be advertised as a Margarita-Garden, cause the food is really just drunk-good and terrible when you're sober. For one thing, it hardly counts as cuban and they have a rep of serving up some raw ass plantains in the PM. Plantains need to be coaxed into deliciousness, you can't just flash fry them with some seasoning folks!\n\nAnyway, 3-stars for being a solar-powered establishment and I will gladly raise my marg in support of an eco-friendly booze hole.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Came here for mother's day! Wish we both got the memo to come dressed in our fedora hats, Ray Ban Warfarers, Toms shoes, and camoflauge jackets. But hipster jokes aside, I ABSOLUTELY love the chill 'beach' vibe with the DJ playing the jazzy-hip-hop-R\u0026B Foreign Exchange-like music (google Foreign Exchange if you don't know em!). \n\nNote - you enter through the green brick building. You'll encounter a cash register where you can place your order. Then, you can wait out by the truck in the yard for your name to be called.\n\n--Pineapple-ginger lemonade ($3) - A MUST! So good, something you can't get anywhere and it went well with the burritos and corn.\n\n--Grilled corn ($3 each)- watch out - they gave us two baby corn cobs with hardly edible kernels. I won't deduct points only because they were really nice about giving us a new one.\n\n--Steak burrito ($10.50) and cod burrito ($8.75) - so fresh and amazing! Substantially smaller than Chipotle, and slightly more expensive. But the steak had a great smoky, fresh off the grill taste you can't get at Chipotle. I'm the gluttonous type to devour my entire burrito at Chipotle in one sitting, but I still left Habana Outpost with a satisfied stomach after eating the corn and sipping on the tasty lemonade.", "author": "Cathy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-04", "description": "This place was a pleasure to visit, even for me, just a tourist from California. This is the first place I've ever seen to actually serve the corn covered with the spicy mayo and cheese. Around where I grew up, there used to be these guys that would walk around with shopping carts holding all the essentials of a mini restaurant, and sell the corn on the streets. \n\nI love the atmosphere of this place also. It's so colorful. It almost feels like you dived right into the heart of Cuba the minute you step into this place. The outside area is nice to just sit back and relax with a frozen margarita or one of their other drinks.", "author": "Sean H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Their chicken burrito was wonderful and the sitting out experience good, staff was also very friendly.", "author": "Tujo O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-18", "description": "Well I was really excited to eat here and the atmosphere is great with lots of energy. But we ate in the restaurant instead of outside and we got an order number and the food was made in a food truck outside not the kitchen. Also when you sit in the restaurant you hear the bathroom dryer so loud cause they keep a door open so GROSS! I was with someone and we ordered the the steak platos and the chicken platos. I was so excited to eat and the steak and chicken had no seasoning and there was a little bit of food that cost $35.00 with 2 guava drinks. The black beans with the reive though were great. Now what saved this ridiculous restaurant from me giving it a 1 was the grilled corn with all these great condiments. I will never go back the money and taste of that dry tasteless meat was enough for me.", "author": "Rhonda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-24", "description": "I down graded this from 4-stars due to the fact that the chicken on my tacos got quickly cold and tough. However, the guacamole and everything else was excellent.\n\nI stopped by Habana Outpost because we/ I had been walking past this location all winter and was curious.\n\nI stopped in to chat with someone about a business/ website issue, and I grabbed some chicken tacos ($2.50/ each), a large guacamole ($4), and a small beer ($2.75). All in all, I paid a little over $10 for a good portion of food.\n\nWe ended up sitting outside, enjoying the slightly warmer weather. \n\nFor those who have been to Black Rock City, Habana Outpost evokes a similar feel - it is somewhat sustainable and it is relatively clean (no MOOP, please!) and I liked the feel overall. Next time, I will avoid the chicken and try the fish tacos.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Like I'm on vacation. Margarita one hand, Cuban sandwich in the other and my son is doing arts and crafts with some new friends. Fun atmosphere. When we were there a college student was celebrating his graduation and his mom took him outside and everyone stood up, clapped and cheered as if he was family.  It was so awesome.", "author": "Tiara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "Cash only!\nEco-friendly, solar powered, interesting bathrooms. \n\nOK, with that out of the way I will break down the rest.  You walk into a long line to order food. Drinks and corn can be ordered at a separate window.  The line moved but not fast enough for a hungry husband.  We ordered 3 tacos and 1 corn each.  Delicious! \n\nCatfish Tacos - Spicy and Husband's favorite.\nPork - Shredded pork goodness.\nSteak - Fresh tasting and a close second to the catfish.\nCorn - grilled and covered in Parmesan cheese and cajun spice. A little too much cheese for me but hubby loved it. \n\nFinding a seat was like finding a parking spot.  Folks protected their spots while the others circled about waiting to swoop in.  While my husband stood in line and waited to order, I politely asked to sit down next to a couple who had no one else with them but was taking up a 6 person picnic table.  The guy was fine with it but the woman had this kind of attitude like she should be entitled to a 6 person picnic table all to herself because she says so.  It's a crowded place and everyone is trying to sit with anyone they can just to find a seat to eat.  Her attitude was so ridiculous I had to stop myself from laughing when my husband came to sit down with the food and she was rolling her eyes and grunting.  He accidentally brushed up against her arm and she moved away and wiped her arm like he had the cooties.  She is not the kind of person who should go to this kind of place.  All the tables and picnic tables are meant to be shared by multiple parties, just like at a German beer hall.  Get over it lady. \n\nThis was a great place and we're very happy we came here.  Hopefully next time we come we'll have friendlier people to sit near.", "author": "MandA R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Awesome atmosphere, cute picnic seating, fountain and bistro lights. The frozen margaritas and mojitos are worth coming here alone, especially on a hot day. We tried the Cuban which was good, not great. A little on the greasy side and it had mayo on it, I prefer mustard, but that's just me. I loved the fish tacos - really good salsa on top. Chicken quesadilla was good, but could use a little more acid. The corn? Omg - best thing we ordered! Sinful cheesy-sweet goodness. The chicken and waffle skewer while it is a wonderful concept, I wish it had more chicken and less waffle. To sum it up, go for the frozen margs and corn!", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "Definitely a fan of this place. Really cool out spot to chill and ppl watch during the warmer months. Drinks are good and the food isn't bad at all. I had the grill chkn--hmmm yea its been a while lol.\n\nCan't miss w/ this place. It does get crowded and hard to find seating sometime but hey u can always take ur drink to go and head to the park right up the block.\nOh--they sometime show movies as well.", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Came for the corn today! No lines despite it being 5pm (happy hour) and a holiday weekend. \n\nGreat vibes as well. Today the crowd isn't too snobby and that's what I like.", "author": "Josh F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "WHAT THE HELL IS WRONG WITH YOU PEOPLE? This place is gross. Horrible. Disgusting. Worst food ever, dirt chicken, mayo and slop. The mojito was fluorescent bug juice and the pina colada tasted exactly like spray suntan lotion with ice.\n\nShame on you all for supporting this place. Pigs.", "author": "J H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "cuban sandwich and fried plantains are amazing, rest of the food choices are mediocre. \n\noutdoors seating is fun and casual when the weather is nice", "author": "Roman S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Slow service. Only the corn was good. I'll go to the nearby El Toro Taqueria when I have a craving for Mexican food. Very noisy.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "It's usually a nice sorta atmosphere, especially when it's warmish outside. And the beer on tap is $4. No one's ever blown away by the food, but it's not bad.", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "This is definitely the happening Cuban spot in all of Fort Greene. This is not your normal restaurant build...you know the Hollywood gag props that have a pair of legs sticking out from a building or a backside of a NYC taxi two stories up. Habana is the real thing with a taco druck wedged between the inside and outside patio portions of the establishment. When you first walk in (from the restaurant side), there are two lines: #1 is for everything while #2 is only for corn and drinks. I assume this is to speed up the process of ordering. The top portion of the receipt goes to the truck outside if you ordered any food. The server shots out names of ready orders. \n\nLet's begin with the Famous CORN, dare I say it rivals the corn on the cob from Smoke Joint right down the street? Yes. It is nicely charred, a little dry, topped with butter sauce , queso, seasoning, and a lime.\n\nNext up is the Cuban Sandwich voted best in NY, was it? It very well could be with roasted pork, ham, swiss cheese all finely sliced with pickles and chipotle mayo. A split crispy toasted hero delivers the meaty goodness to your mouth...is that tuna I taste?\n\nThe Mexican Grilled Cheese is what we would call a cheese quesadilla made with a commercial flat-iron press. What makes the one at Habana special is the green and white sauce that they generously drown the thing in. Yum. It comes in two large pieces.\n\nI washed everything down with a small yet flavorful cup of the ginger pineapple lemonade whilst sitting outside with a hayload of patrons. It was an ideal scene for this warm summer night. I did consider the $8 for a frozen mojito steep, but I will be back one day looking for refreshment.", "author": "Will C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Come for the corn, stay for...well...not much else. \n\nDon't get me wrong, Habana Outpost is a great little place if you're looking to do some calm day drinking. Right off the C train, it's very accessible from everywhere and should be tried at least once. However, other than authentic (I think) Latin American decor and a patio, this place didn't really offer anything special. \n\nWhen you walk in, you get in line for your food and drinks. The food selection looked great, though I opted with one of their grilled corn cobs, which was really good. They throw it on the grill, put a little mayo on it and roll it in Mexican cheese and chili powder. Add a little hot sauce and you have something magical. The other food looked good too, though I was an idiot and had eaten dinner before coming. \n\nThe drinks were okay; not many choices, but decent frozen margaritas and spiked lemonade. They have three beers on tap for $3.50, although two of the kegs were kicked at 6:30pm (yup, seriously). I opted for their IPA and was thoroughly disappointed. Spend the extra cash and get a bottle of Sol. \n\nThe staff was pretty hit or miss. Inside, they were welcoming and attentive. Outside on the patio, they were a little standoffish. \n\nThis place should be 3.5 stars, with the half star coming from the magical corn, but you can definitely do better in this part of town.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "5 stars forever!!! The menu is full of goodness but the catfish sandwich or catfish burrito are my favorites. Ask for extra jalapeños on the side and you will be in heaven. The blended margarita is surprisingly strong, which is a plus. Also during warmer months, they screen outdoor movies on Sundays!", "author": "Shadi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "Again, I love corn, therefore I love Habana Outpost.\n\nThis is a great place to go for the summer time with friends and some trendy shades.  Very cool atmosphere where you pick food up from \"trucks\" and sit on benches to chow down.  Super laid back and the DJ plays awesome music.  Definitely recommend this place!", "author": "Diana C."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}