{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "Gotta love this place FOR WHAT IT IS. And not what it isn't. And for being so different than other places. WHO CARES that they serve burritos and still call themselves Habana Outpost? Who cares that the mojito isn't real, it's frozen because it's HOT outside. \nBesides where else can you get a frozen mojito, grilled shrimp AND sit outside in an unpretentious space?\n\nThe only caveat I noticed was that it closes absurdly early. MIDNIGHT. Really? I work late, I'm a waitress, where am I to go after my shift?", "author": "Lex A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Really cool how that they have an outpost open for warmer weather with outdoor seating. If they're going for making diners feel like they're enjoying a meal in habana they've somewhat replicated that feel. \n\nThe decor is festive, brightly painted tables, an outdoor cookstand, a tin roof, even the restrooms are themed like you're in Cuba.\n\nThe food is just like Cafe Habana itself, very yummy. The only complaint I have is the prices are a bit more expensive than Cafe Habana and if you order a sandwich, fries are ordered separately.  \n\nAnother NYC summer must.", "author": "Geralyn Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "This place is really great, especially the outdoor seating in the summer where you can sit back, relax, and enjoy frozen cocktail goodness. Habana has good frozen margaritas, mojitos and soritas (somewhere between a marg and moj) and, it being a completely eco-friendly restaurant, I've heard that they even have a bike you can ride to power the slushy machines to power the making of your own drink (though it wasn't around when I was there). \n\nThis place gets really crowded because of the large outdoor space they have, but it's totally worth waiting a little while in line for the atmosphere and the tasty cuban/mexican food! I highly recommend the sweet plantains and their famous authentic corn on the cob. Habana Outpost is perfect for a warm night of catching a bite and a drink (or two) with friends in a friendly community atmosphere.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "This is one of my favorite summer spots!  How lovely is it to sit outside drink frozen margaritas and eat yummy food?  I don't know how fair it is to generalize that all their food is yummy because I've only ever ordered the chicken diablo (I can't bring myself to order anything else, it tastes that good!).", "author": "Vana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Summer Drinking.  Nuff said.  This patio is great, the beers are reasonable, margharitas are delicious, and the food is perfecto to couple with an outing with friends.  The corn is great and the atmosphere is awesome.  I might also add that I don't feel bad supporting a business that so full-heartedly believes in sustainability!  I'll be going here until the unfortunate day I no longer live in NY! (hopefully not soon)", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "been here a couple of times since it first opened. it's always a good time with friends. margaritas and corn? say what???\nyou can't miss the place, it's bright green with the bumping music and busy bodies kicking back to summa-summa-summa time! it's like a big backyard cook-out, except it's not. ha ha. at times it can get crowded, but it's an all day party. people watching is fun, and so are the mojitos. ;)", "author": "Dee D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "Great and fun atmosphere. I love the outdoors. Great for people watching (and laughing).", "author": "Elisabeth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "Went here for a block party to kick off the summer. Had no idea this place wasn't open during the winter, but I realized it was because they use solar energy to power everything!  They had a band there and a very casual environment with benches and the like. I could see how this place would be great in the summer. They had frozen margaritas, frozen mojitos, and frozen mojitas? (I think that is what they were called - half margarita and half mojitos). You could definitely taste the alcohol!  I wouldn't really suggest the spiked lemonade....tasted like some fake stuff that was made out of powder and water.  They had this amazing looking corn with cheese on it that everyone was getting. I wish I hadn't eaten before I arrived as everything looked tasty and all the food was under ten bucks. I would go here again but only if i was in the area.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Upon first visit: great eco-friendly atmos, and plenty of fun mexi-esque food and drink options. The catfish burrito was a healthy portion of rice, beans, fish and pretty tasty combined with a $1 side of  salsa (mild). The ingredients all seemed quite fresh and of high quality, yielding perhaps the best burrito I've had since Austin, Tx. Though the quest for a Texas-quality-burrito still burns on.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "Visited more for the trendy ambiance for the Bklyn neighborhood, but don't be surprised that the food and drinks are a smashing good time. My fav is the cheese covered corn and mojitos...........", "author": "S S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-27", "description": "I really don't understand all the hype reviews.  I was unimpressed.  The meat in my steak taco was very luke warm with 1 cilantro leaf and 1 tiny cube of red onion.  The corn was good, but was also very luke warm.  I don't get it. Perhaps these rave reviews come from people who have never had a good taco?  Heck Taco Bell kicks this Habana's hiney BIG TIME!", "author": "Carol B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-21", "description": "Went to the Habana Outpost today addressing a curiosity that I've had for some time. As a result expectations admittedly were high. My expectations unfortunately were not met. I ordered a chicken burrito corn and chips and salsa. Surprisingly although the food comes straight from this counter where you pick it up when your name is called the food wasn't really hot. OK it was luke hot if there is such a thing. My burrito was OK, nothing to write home about, I mean this places burritos have nothing on Chipotle, OK maybe more meat, but that's it. The nachos were average and the salsa was tasteless and it just sat there. I appreciate that they might make it on the premesis but if they can't do any better than this then they should just buy it. If they're buying it already then they need to find a new supplier. The corn was good but again it probably would have been better if it was hot. All in all this place is OK, the novelty is the sit where you want al fresco dining. It is far from the best Mexican restaurant in Brooklyn.", "author": "James B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "Very good food and an interesting atmosphere.  This place is very casual and the Cuban dishes aren't the most authentic, but still quite tasty.  My biggest gripe is that the margaritas and mojitos were frozen.  They were good, but would've been better on the rocks.", "author": "Patrick K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "Good hang out on a hot day! Went on a Sat evening and it was super crowded. Waited in line forever, but got a nice cold drink to cool me down. Plus, I really like their social good program. Will make a special trip back to BK just to visit again.", "author": "Anon O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-06", "description": "Yes: Delicious grilled shrimp special with rice \u0026 beans and pico de gallo; yummi corn.\n\nNo: Super small portions (specially for the price); bad frozen margueritas... not tasty at all!\nPlus, they have this weird policy of not serving the shrimp dish for lunch.", "author": "Edgygirl O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "In these troubled times, we need a place where we can simply eat/drink/be merry and let our consciences take a bit of a rest.  Habana Outpost lets you do that.  It's eco-friendly, the food is good, the cups and utensils are recyclable, and the patrons are genial and diverse.  It's like a little kum-by-ya fest in there, but what would be even better is if at some point they could figure out how to get their food orders taken and cranked out faster, organize the seating better so there isn't the whole \"I'm saving this entire picnic table for a friend\" fallout, and stay open year-round.  \n\nThis place is great, but I live in hope that one day they'll fix these little/big issues and truly allow their patrons to reach nirvana and get yummy catfish burritos. mmm...", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "this place was great.  yummy, reasonably priced food and lots of delicious drink options.  very chill and relaxed atmosphere with lots of outdoor seating.", "author": "Dominica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "I love this place, the atmosphere is fantastic go there at the wrong hour and you will run into a long line. The food is great, but seating is limited due to the fact that it gets packed there pretty fast. I haven't there in a while and I miss it, perhaps before summer is over I'll go back.", "author": "Ayanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "This is a great place for a drink on a nice day. Full court yard the people are all over and the atmosphere is alive. Had a really good streak burrito and saw someone eating what looked like the most delicious smothered corn on the cob thing I have ever seen. Not low key or quiet at all so if thats what your looking for try elsewhere.  Also if the hipster set makes you quiver i'd also be careful. Like zombie and vampire movies they are ever present and always looming. Best part is the outdoor seating and food for me. Get out there and get it in.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "I love this place, it's a cool hang out spot. Saturdays and Sundays are the best", "author": "Ceo J."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}