{"aggregateRating": {"reviewCount": 963, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "I've been here only at lunch time, and usually with a group of five or more.  Keep in mind when ordering that it is cash only.  \n\nThe decor is a treat on a mild summer afternoon--mostly outside seating in a colorfully decorated picnic area.  The food comes quick enough, though every now and then there is a delay.\n\nThe menu may be a little limited, and I'm not 100% what makes it Cuban vs. Mexican, but the food is good.  The fish tacos are a must, as is the corn on the cob.  I think the tacos in general are the best deal for the money.  I was not crazy about their pico-de-gallo salsa, as it was very mild and watery, with no flavor or kick.  HOWEVER, their guacamole is ver good--though pricy at $6.  \n\nSome non-food positives include that the place is solar-powered, and has a very detailed recycling program. \n\nWe definitely will continue to come back.", "author": "Chap James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-25", "description": "I really wanted to like Habana Outpost, and yesterday came here with a friend for a margarita and some food. I ordered the pulled pork sandwich and a [somewhat overpriced] margarita, and they tasted great going down. But I'm pretty sure that Habana Outpost gave me food poisoning, as about 6 hours later I was suffering from the worst migraine of my life, then got totally sick and... I'm sure you can fill in the rest. It was the only thing I had eaten all day, so I have to say that the food I ate at Habana Outpost must have been the culprit.\n\nNot fun. Food poisoning is seriously the worst. It was a hot day so maybe the meat that I had wasn't kept cold enough before it was cooked or something? It just kinda sucks because this place is really cute and as I said, the food tasted good going down... I just don't think I'll be able to ever eat here again after what happened.", "author": "Casey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Came here on a nice warm beautiful Wednesday night with a friend and in my opinion this place is just A-ok... I guess i was disappointed with the food.. on the menu they rave about how good their Cuban sandwich is (that its the best in NYC) and umm no sorry but its not. So i didn't mind that you first have to wait on line to order food, then go out to find an available seat/table, then wait for your number to be called so that you can get your food and i loved the Spanish music playing. I did , however, mind that the truck was so high when it came to getting my food that i almost dropped my guac and chips on the floor and i did mind that the Cuban sandwich did not live up to it reputation. I did how ever loveee the mango margarita and the corn! omg..the corn it was the BOMB!", "author": "Wankairys D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Went here on Labor Day for the 1st time \u0026 I need to hurry back lol. My mango margarita was the bomb! That corn is to dieeeeeeee for. The mayo sauce is sooooo good. I love the setup the whole restaurant is Eco friendly I loved that. Great place", "author": "Latoya C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "The atmosphere is very energetic and the decor is true to its name. The line was pretty long but the wait wasnt too bad; we grabbed a booth pretty quickly. It is first find, first sit lol. I am vegetarian and ordered the guacamole queso burrito, it was a little bland so I added jalapenos for some spice. This is the only reason I docked a star, the food wasn't the best but it made for a decent dinner. Oh and this place is Cash only!!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "Eco Friendly environment, I love it! \n\nThe Steak Sandwich is to die for. The Frozen drinks is amazing. The service is excellent. The spiciness is mind-blowing. The crowd is fun and hipsterish. \n\nIt's a fun and relax place to chill with friends and although it gets a little noisy sometimes, it is still fun to be in this kind of environment.", "author": "Aliaa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "Pretty straight forward place. All my life living in Brooklyn and passing this place, I never went in because the crowds are crazy. Yesterday I caved in and stood on a long line for an $8 frozen margarita and it was worth it yum. I just didn't have anywhere in the backyard to sit and drink it. I sat inside at a cramped bar but its all good I enjoyed it. I'll be back (:", "author": "Amber A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Many love this joint. If it wasn't such a spot to floss at, I'd love it too. \n\nAside from that, I love that it's solar powered. The Parmesan corn on the cob rocks, as does the veggie burger! Never knew a truck could make food\nTaste so good.  The frozen mojitoes...the outside DJ. If only the \"hot\" boys and trend seekers would find somewhere else to post.", "author": "Jamiyla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "With it's outdoor seating, Habana Outpost is a great place to take in the summer sun and throw back a few ice cold beers and margaritas. Their Mexican corn is a delight and their Cuban Sandwich is both satisfying and delicious. I look forward to going back to try more of their dishes!", "author": "Lexi G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "Go for the outdoors. Food is aight, kinda disappointing. If you want to drink at picnic tables with friendly folks and snack a bit then go for it. If you're looking for a great Cuban sandwich, this ain't gonna do it for ya.  That said, I'm glad it exists and will go back with the right expectations", "author": "Neal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "i have been waiting to check out this place for years. seriously. i have eaten at the NYC version several times but heard the bklyn outpost is really where it's at. we finally ventured out on a recent beautiful weekend and Habana lived up to the expectations. \n\nthe outdoor area is really fun, bright, and inviting. it was crowded but manageable so we snagged some seats in the shade under a big umbrella then went for some frozen mojitos. these were delicious! a little sweet so i mixed it with some sangria for a change of pace the second round, but overall very good. the food looked and smelled delicious but we didnt get a chance to try.\n\ni really loved the eclectic crowd here. and the dj spinning tunes to keep the mood going.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-13", "description": "My new favorite neighborhood spot - cheap, locally brewed beer, yummy tacos, and a fun vibe. Definitely get the Mexican corn and the veggie taco. Be warned - they have cool haus ice cream sandwiches on the menu, but don't actually ever have them in stock. Womp, womp.\n\nI'm going to come back here as much as possible before they close for the season in Oct!", "author": "Megan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-27", "description": "This review is solely for the drinks because I HATE the food.\n\nMix the Sangria and Margarita and BOOM you have a nice drink.\n\nThe atmosphere is very friendly - you have people with dogs outside, along with mothers and fathers and strollers.\n\nInside you have an island to eat at (uncomfortable at times because the line gets long and you find yourself struggling to eat)  They also have booths (not many)\n\nEither way, I have gone to this place a handful of times and enjoy the drinks and nice atmosphere outside!\n\nCASH ONLY PLACE - Please remember that!", "author": "JENNIFER R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "Habana has become the new meeting pub for local young shoot callers. Easily becoming one of the most trendiest spots in Brooklyn. Habana Outpost stays true to it's Brooklyn patrons not being over stuffy or overdone setting a just right relaxed atmosphere to enjoy great drinks and tastey food. \n\nMy advice: \n*Visit on a Sunday- Catch a old-school movie projected on the building side. These Sunday night outings give new meaning to the drive in... \n\n*Grab a Cob of Corn- Habana's Grilled Corn is one of the best I've had besides my own mothers \n\n*Drinks- everything that I've had was great but my favorite has to be the Frozen Margarita (a bit strong but not over the top) \n\nIf you're ready for a change from the normal city outside dinning with high heels and snotty waitresses Habana Outpost should be your next stop.", "author": "Yana Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Really fun place to hang out with a group of friends on a summer afternoon/evening. Love the colorful decor in the courtyard. Hard to find seats at peak times (Friday/Saturday nights around 6/7pm), but you can stay there for hours once you do. I also love the young, hip, and diverse crowd that really represents the neighborhood.\n\nDefinitely order the Cubano sandwich, grilled corn (a little messy but oh-so-good!), and one of their frozen margaritas. Warning: the margaritas were a bit strong! The beer is also very cheap! $2.75 for some local Brooklyn brews. Definitely can't find that in Manhattan.\n\nYou order your food inside and pick up from the food truck outside in courtyard.\n\nCASH ONLY! They have an ATM inside though.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-29", "description": "I recently defended this place to some haters that said the food was meh and the margaritas only so-so.  I gave a 15 minute speech about the chilled out neighborhood vibe, the $2.75 Sixpoints, and the decent and inexpensive food.  Well... NO LONGER. THIS PLACE IS FULL OF SOCIALISTS WHO EXPECT ME TO PAY FOR THE PROBLEMS CAUSED BY OTHERS.\n\nI had never been on a Saturday night, so I was surprised when I walked up to 2 enormous security guards and ropes in order to get in.  Once I past the ropes, an Australian chick wanted to charge me 10 BUCKS to get in.  She said it was ok, because I'd get a free drink! I go there for the $2.75 Sixpoints, and I drink A LOT of them, so asking for a $10 cover is a joke.  It defeats the point of me going there.  They said the $10 cover was to keep out riff-raff that just stands around staring at chicks... but that's not ME nor my PROBLEM!  Why am I paying for them?  Why are hardworking Americans like me having to pay for these people?\n\nMaybe the girls that go there shouldn't be such sluts.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "This place has such a great feeling.  I wouldn't go if the weather weren't nice, but on a sunny day or a warm night, it's a perfect place to bring friends.\n\nBeer is cheap, corn is amazing, and the guava I added to my margaritas was a big plus!  \n\nI brought friends here on a Friday night and it was very crowded, but we shared a table with another group.  Lo and behold, the next day I saw one of my friends bring her boyfriend back to share the experience with him.  It is that cool.", "author": "Dana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "Came here last weekend with a friend/my only ride everywhere. We planned to sit down outside and eat but ended up indoors for 2 reasons. It was too windy for my dress (can't have the cheeks out) and because it was so crowded. Indoors was still pretty nice though.\n\nI had platanos and the famous corn, a regular mojito and split the chips and guac with my friend. He had the Cuban sandwich. Everything was really good especially the corn. The drink was just right for me as a non-drinker really. I can imagine that if you can really hold your liquor and maybe a friend's liquor too the drinks won't be strong enough for you.\n\nI read reviews about the place having the snooty doorman around 6ish on weekends but I did not encounter anything of the sort even though it was packed. \n\nI wasn't a big fan of the cheap-o plates and high school clique like outdoor seating. The environmentalist friendly bathroom was cute though. We had a outhouse back in FL so really felt homey versus dirty port-a-potty.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "I know it has been said millions of times, but the grilled corn is AMAZING. It literally changed my life. \n\nNot only is the corn amazing, but the burritos are also excellent. I love the outdoor kitchen and picking my food up from the window.\n\nI also love the enormous outdoor patio, and they allow dogs, which is super! \n\nHabana Outpost is a great place to come with a group of friends and eat phenomenal food and drink great margaritas. The decorations are very festive and the cheerful vibe is great!", "author": "Stef E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "I love this place.  Great atmosphere, awesome staff, yummy food.  Great for a night out with the girls, cozy date night or family fun...really it all works.", "author": "Wanda M."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana Outpost", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "757 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rxwbl8jMokqJA9gp4m7H5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}