{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Really cute place with a large selection of bubble tea hot or cold.", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Consistently good grub spot!\n\nPros: Yummy and authentic food. Never had a bad meal here yet. Bubble teas, Bahn mi, Pho all winners.\n\nCons: Tables tend to be dirty, as it is a seat yourself place.\nFloors and tables could use a regular wipe and sweep throughout the day.", "author": "Juliet F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "Yelpers who claim that Hanco's is the best have either never been to Ba Xuyen or are not Vietnamese. However,  Hanco's is still pretty good!\n\nThey both have a fantastic authentic baguette, but Ba Xuyen also has authentic trimmings (right down to the Vietnamese mayo, pate, and head cheese). Ba Xuyen's spring rolls are more delicious, and they serve the best avocado shake ever!  I tried Hanco's Vietnamese iced coffee and didn't like it too much. \n\nHanco's classic sandwich has roasted ground pork instead of roasted pork slices.  I have to say that the roasted ground pork at Banh Mi Saigon is much more flavorful but the baguette is not as good. \n\nBottom line, I'm going to stick to Ba Xuyen, but I wouldn't mind Hanco's if I was in the area.", "author": "Anvy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "I had been to Hancos a number of times. It's certainly not authentic Vietnamese but it's ok. What happened to my body around 15 hours after eating the grilled pork vermicelli salad, was nothing short of violent. Right before redecorating my bathroom in the worst way one might imagine, I felt for a few minutes like I was on some sort of very uncomfortable acid trip. I was so full of poison that it took a couple of weeks after this episode for the nausea to completely disappear. I WILL NEVER STEP FOOT INTO ANY HANCOS EVER AGAIN!", "author": "PJ I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Five stars for classic banh mi and 3.5 for pho.  They serve the best tasting banh mi in NYC.  I had the traditional (ground pork and pate) and grilled pork - both were fantastic but the classic is the winner.  The bread is perfectly crispy, light, and filled with mountains of pork and pickles.    Pho was good, but was not very memorable compared to banh mi.  I could eat there every single day.", "author": "Akira O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Meh :/ Pho should be beef stock based and slightly sweet but the chicken pho had odd chicken, cheap soup base (likely just chicken stock and water) and lack of flavor overall. Seattle has amazing pho and now I'm missing it :(", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Nothing special. Just a good Vietnamese sandwich shop. The bread is always on point and the ingredients are always fresh. The pho is good too. Portions are very generous.", "author": "Felix K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "It's always between here and Henry's depending on my geographic location. I like the sandwiches here, pretty consistent with any other Vietnamese sandwiches I've had. All in all this place is good and staff is friendly.", "author": "Luis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "I adore Hanco's. Pretty much anytime I order delivery, I have to order Hanco's. It's what I crave. I love the vermicelli bowl with shredded chicken and peach bubble tea. One of my favorite bloggers who moved away from the neighborhood even recently said Hanco's was the restaurant she missed most in Boerum Hill. If I ever move, I'd have to agree!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "I eat bahn mi all over and it's never as good as Hanco's. The vegetarian pork rocks. Also the bubble tea is tops here.", "author": "B B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "I've been here before and enjoyed their bubble tea and had a pretty 5 star experience but yesterday was a bit different. The weather was kinda meh so my friend and I decided to get some pho. The employees there are really unorganized and helped other people before us even though we arrived first. We ordered, no smiles or anything but whatever, i'm not that bothered by it. We got our food and went to the second floor, it was pretty cozy and the pho was DELICIOUS. After we finished our meal we decided to get some bubble tea, i specifically asked for it to be sweetened but lo and behold when we left the store, my bubble tea was bland. :( At least the tapioca balls made up for the lack of sweetness. \nOverall, i had a pretty okay experience, the staff could look a little more enthusiastic lol but it was pretty good.", "author": "Iman M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Hanco's is where you go when you can't decide what's for dinner and their banh mi is pretty damn good. Their distinguishing factor from other banh mi shops is two things:\n\n1. Pho. It's not the best ever but gets the job done.\n\n2. Viet coffee. I dunno why more places don't have it since it's not that complicated. If you added condensed milk to regular coffee it could almost pass for it.", "author": "Raphael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Oh my goodness! I haven't been to Hanco's in at least 6 years. The location has changed but the food is as good if not better. Can't go wrong with the bahn mi but they now have the vermicelli noodle salad which I got with chicken. Delicious! Can't wait to try the pho next! Yum!", "author": "Shaki T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "My husband and I stopped in to try the grilled pork bahn mis and they were absolutely delicious.  \n\nWe both got sick, though.  We aren't sure if it was them or the salads we had later that day, though.  The place has an \"A\", so I'm hoping it wasn't them. Either way, the sandwiches were delicious, but food poisoning is no fun!", "author": "Lia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "This is the best tasting banh mi I've had so far in NYC. The ground pork was so savory and juicy and wonderful...it more than makes up for the two flaws that I can see. \n\nFlaw #1: It's $5.50. That's just more than banh mi should cost (see Saigon Sandwich in SF). I've come to expect this sort of thing in Manhattan, but we're in Brooklyn. (It should be noted that Manhattan spots Baoguette and Nicky's both come in at $5, and those are on the high end.) Also, bottles of water at Hanco's are $1.25 and I think that's crap.\n\nFlaw #2: The distribution of the banh mi ingredients is off, and could easily be improved. (If you do not want to hear about how, please skip the nonsense below, and move along to The Conclusion.)\n\nFor the purposes of this discussion, imagine that Hanco's puts their delicious, toasty baguette in a V shape. All the porky goodness is stuffed into the bottom of the V, and the pickled daikon, carrot and cilantro was laid on top. The problem here is that this is not a hot dog. It's just too big; you can't take a bite of the sandwich vertically, which might allow you to get a little bit of each ingredient in every bite. \n\nIn order to eat this sandwich without getting it all over your face and/or lap, you need to come at it from the side (once again, assuming we are using the V model). Unfortunately, this leaves you either biting the top of the V and getting a mouthful of pickled vegetables and cilantro, or the bottom of the V and getting a mouthful of porky goodness. Both of these are unsatisfactory, as you want to be getting both in every bite. \n\nPlease excuse the rudimentary nature of the drawing below, but the ideal distribution would look something like this: \n\n________Bread _________\n\n   Daikon/Carrots/Cilantro\n\n       Porky Goodness\n\n________Bread _________\n\nAs you can clearly see, this distribution would ensure that the eater would get both the pickled vegetables and the porky goodness in each bite. And although it would not be very difficult to build the sandwich this way, opening it up and re-distributing the ingredients after you've purchased it can get messy.\n\nThe Conclusion.\n\nI'd still stop and get a sandwich at Hanco's anytime, because any place with only two flaws is pretty damn good. I don't even want to think about how many flaws I have. Thank god no one reviews me. I bet I'd average a \"Meh, I've experienced better.\" I just checked with my girlfriend, she's nodding. \n\nAh, crap. Now I'm thinking about all my flaws.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Spicy Classic pork sandwich with mayo, butter, cucumber, carrots, radish, cilantro served on a toasted French baguette, and EXTRA MEAT!!! With a order of bubble tea on the side and your meal is absolutely delicious! Been coming here for years and I am really happy to have seen them grow in popularity and the number of locations.  Keep up the good work!", "author": "Shaleem J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "This place is my heart and soul. I crave it day and night.\n\nHancos is my favorite spot to grab quick super casual lunch or dinner on my way somewhere. I go by myself or with a friend and either way it's the best. There's good seating but it gets packed certain times of day. Because it's really good.\n\nEverything always tastes super fresh and clean. I always get the grilled pork sandwich. Their bread is the right amount of toasted (I live closer to the Park Slope location but I prefer this one because Park Slope toasts the shit outta their bread.) I hate both cucumbers and jalapeños and unlike other sandwich places in the city they totally don't mind leaving those out for me.\n\nTheir bubble tea has a pretty good amount of variety AND they let you substitute tapioca for other things. I like the mango star jelly and the strawberry jelly (which is heart shaped and super cute). They also have vietnamese coffee which I love, even when I'm picky with my coffee and normally don't ever drink it sweetened.\n\nIf you're an addict like i am, they have stamp cards that let you get a free sandwich or bubble tea after 10 stamps. I've lost count of how many of those cards I've filled.\n\nThe food is a little pricier than other spots serving similar stuff (and pricier than the other hancos locations too!) but for the area it's pretty good, and to me it's better than Park Slope hancos and therefore worth the extra money (both are on my way home).", "author": "Cristina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-14", "description": "No no no! Troi oi! I hope this is not what BK thinks authentic Vietnamese sandwiches, pho, or whatever are. Don't you dare put sriracha in my banh mi, fresh peppers only! And why did my sandwich come out with warm mushy cucumbers and warm do chua?? I don't get it. I also don't get that photo of white people n Southeast Asia they got framed.", "author": "Azizah A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "meh. was super excited for takeout last night having not been here in awhile but the shredded chicken was rubbery and tasteless on my rice dish \u0026 the whole thing was terribly bland. won't be doing that again, guess I'll stick to their bubble tea which I've always loved {green tea with honey or mango}", "author": "Lauren D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "If you want an excellent banh mi sandwich, this is it. Quality meat, bread, and vegetables. The soup's very average but the sandwiches are GREAT.", "author": "Kevin S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}